[{"name": "Marvel Nemesis: Rise of the Imperfects", "details_link": "https://www.metacritic.com/game/playstation-2/marvel-nemesis-rise-of-the-imperfects", "publisher": "EA Games", "release_date": "Sep 20 2005", "developers": ["EA Canada", "Nihilistic"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 53, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/28f29a475212f1d82d0e37d3e7a8b49a-98.jpg", "descriptions": "Marvel Nemesis delivers the definitive Super Hero videogame allowing gamers to play as and against the world's greatest Super Heroes. The game features Super Heroes from the Marvel Universe as well as a new set of characters created through collaboration with EA and top comic book industryMarvel Nemesis delivers the definitive Super Hero videogame allowing gamers to play as and against the world's greatest Super Heroes. The game features Super Heroes from the Marvel Universe as well as a new set of characters created through collaboration with EA and top comic book industry talent. EA has called on the talent of top comic book writers and concept artists, such as Jae Lee, for Marvel character and game design as well as renowned artist, Paul Catling, among other industry talents, to create a new family of Super Heroes that will go face to face with an all-star line-up of Marvel characters for the ultimate showdown. Marvel Nemesis: Rise of the Imperfects features more than a dozen fighters in fully interactive and destructible environments. Gamers have full control over the individual characters with each fighter having unique attributes and super powers that are true to their background adding more depth and fighting strategy to the game. [Electronic Arts]… Expand"}, {"name": "Elemental: War of Magic", "details_link": "https://www.metacritic.com/game/pc/elemental-war-of-magic", "publisher": "Stardock", "release_date": "Aug 24 2010", "developers": ["Stardock"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 53, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/ea1dad7b3944827969dc9f06c7c2b32d-98.jpg", "descriptions": "Elemental is a fantasy strategy game set on a world filled with magic and ancient lore."}, {"name": "Bodycount", "details_link": "https://www.metacritic.com/game/xbox-360/bodycount", "publisher": "Codemasters", "release_date": "Aug 30 2011", "developers": ["Guildford Studio"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 53, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/3/2fb4b39abfa40784451a2f960c50d963-98.jpg", "descriptions": "Bodycount rips apart the first person shooter as genre-defining gunplay comes alive in a balletic orgy of bullets and destruction.\r Experience the intense thrill of close-quarters combat in a shreddable world as Bodycount blasts outrageous fire-fights and ferocious action from bothBodycount rips apart the first person shooter as genre-defining gunplay comes alive in a balletic orgy of bullets and destruction.\r Experience the intense thrill of close-quarters combat in a shreddable world as Bodycount blasts outrageous fire-fights and ferocious action from both barrels.  Become a powerful combat asset green-lighted to eliminate enemies known only as 'Targets' on behalf of the 'Network', ensnared in a clandestine global power struggle that rages away from the headlines and under the cover of conventional war zones. \r\rThis exhilarating shooter drops players into chaotic areas of operations equipped with a mouth-watering selection of contemporary weapons to tear through environments and enemies, chaining kills, earning power ups and building up a bullet meter to unleash devastating air strikes on enemies.    Complimented by co-operative online play and multiplayer modes, Bodycount will set new standards for spectacular, visceral gun play and put the fun back into the FPS.… Expand"}, {"name": "Halo: Spartan Assault", "details_link": "https://www.metacritic.com/game/xbox-one/halo-spartan-assault", "publisher": "Microsoft Game Studios", "release_date": "Dec 23 2013", "developers": ["Vanguard", "343 Industries"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "Xbox One"], "genres": ["Action", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 53, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/05253197f137c76e800c89e127449203-98.jpg", "descriptions": "Enlist as a Spartan soldier and sharpen your tactical skills in battle. Set between the events of \"Halo 3\" and \"Halo 4,\" Halo: Spartan Assault, developed by 343 Industries in conjunction with Vanguard Games, is a new chapter within the Halo universe. Spanning over 30 missions in vibrant,Enlist as a Spartan soldier and sharpen your tactical skills in battle. Set between the events of \"Halo 3\" and \"Halo 4,\" Halo: Spartan Assault, developed by 343 Industries in conjunction with Vanguard Games, is a new chapter within the Halo universe. Spanning over 30 missions in vibrant, dangerous worlds, dive deeper into the backstory of Human-Covenant wars, the origins of the Spartan Ops program, and unravel a chilling mystery in Operation Hydra. Play through the eyes of either Commander Sarah Palmer or Spartan Davis stationed aboard the UNSC Infinity as they fight never-before-seen battles against Covenant forces. You can also join with a fellow Spartan on Xbox Live, in battle against the Flood.… Expand"}, {"name": "Crime Lab: Body of Evidence", "details_link": "https://www.metacritic.com/game/ds/crime-lab-body-of-evidence", "publisher": "City Interactive", "release_date": "Nov  5 2010", "developers": ["City Interactive"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/5d96015d9c2d75f854b22f965732469b-98.jpg", "descriptions": "Young FBI agent Nicole Bonnet receives a mysterious package. Inside she finds a complicated mechanism that appears to be a message from a serial killer. This is just the beginning of an epic duel of minds between Nicole and the ruthless murderer, who leaves playing cards by the bodies of hisYoung FBI agent Nicole Bonnet receives a mysterious package. Inside she finds a complicated mechanism that appears to be a message from a serial killer. This is just the beginning of an epic duel of minds between Nicole and the ruthless murderer, who leaves playing cards by the bodies of his victims as signature. Bonnet will have to use all her wits to solve the case and stop the killer before he strikes again. Does she have what it takes to understand the mind of a psychopath, as complicated as his puzzles?… Expand"}, {"name": "Warriors Orochi", "details_link": "https://www.metacritic.com/game/xbox-360/warriors-orochi", "publisher": "Koei", "release_date": "Sep 18 2007", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 53, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/3d08caaab2d54f1d843513ddce94c5d9-98.jpg", "descriptions": "Without warning, the Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan to test his might against the heroes of these ages. Most of theWithout warning, the Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan to test his might against the heroes of these ages. Most of the great armies of these two periods would succumb to the might of Orochi. Yet powerful warriors remain and are ready to continue the fight. Now, the greatest showdown in history is about to take place. [Koei]… Expand"}, {"name": "Sniper: Ghost Warrior", "details_link": "https://www.metacritic.com/game/playstation-3/sniper-ghost-warrior", "publisher": "City Interactive", "release_date": "Jun 29 2011", "developers": ["City Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 53, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/b5fef54c67dd05b6f4526a0e51b48815-98.jpg", "descriptions": "Based on the covert, shadowy world of the military sniper, Sniper: Ghost Warrior throws players into the chaos of a military coup, as they aid the rebels in restoring the rightful government to the embattled country of Isla Trueno.  When the democratic government of Isla Trueno isBased on the covert, shadowy world of the military sniper, Sniper: Ghost Warrior throws players into the chaos of a military coup, as they aid the rebels in restoring the rightful government to the embattled country of Isla Trueno.  When the democratic government of Isla Trueno is overthrown, an aggressive and hostile military command rises to power. A highly trained special ops unit is sent in to help the rebels accomplish objectives that only a sniper can handle.  In addition to intense sniper missions, players will also take part in a variety of assault scenarios where their prowess with weapons will be a huge help to the undermanned rebels.… Expand"}, {"name": "Dungeons & Dragons: Dark Alliance", "details_link": "https://www.metacritic.com/game/pc/dungeons-dragons-dark-alliance", "publisher": "Wizards of the Coast", "release_date": "Jun 22 2021", "developers": ["Tuque Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 5 ", "genres": ["Role-Playing", "General"], "meta_score": 53, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/2/50e2814a04d10c4d3edac66431bc98e1-98.jpg", "descriptions": "Join up to 4 friends and battle iconic monsters from Dungeons & Dragons in the new co-op action RPG Dungeons & Dragons: Dark Alliance. Dark Alliance brings to life the world of Dungeons & Dragons in an explosive action RPG filled with real-time combat and dynamic co-op.\r Frost giants andJoin up to 4 friends and battle iconic monsters from Dungeons & Dragons in the new co-op action RPG Dungeons & Dragons: Dark Alliance. Dark Alliance brings to life the world of Dungeons & Dragons in an explosive action RPG filled with real-time combat and dynamic co-op.\r Frost giants and vengeful dragons roam unchecked through Icewind Dale as invading armies of evil grow stronger every day. Now four heroes must beat back the onslaught of creatures and defend against the dark. Choose your hero and join up to four friends to battle legendary monsters. Explore the frigid world of IcewindDale as you vanquish unstoppable bosses, earn powerful gear, and unlock new abilities to take on even bigger challenges.… Expand"}, {"name": "Daymare: 1998", "details_link": "https://www.metacritic.com/game/playstation-4/daymare-1998", "publisher": "Invader Studios", "release_date": "Apr 28 2020", "developers": ["Invader Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 53, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/453803f1364a2d1c1361f38806c7a579-98.jpg", "descriptions": "Daymare: 1998 is a third person survival horror game with over the shoulder camera, developed in Unreal Engine 4 for Windows PC. The game features high-end graphics, original soundtrack, immersive atmosphere, hardcore survival mechanics and many connections with the beloved old schoolDaymare: 1998 is a third person survival horror game with over the shoulder camera, developed in Unreal Engine 4 for Windows PC. The game features high-end graphics, original soundtrack, immersive atmosphere, hardcore survival mechanics and many connections with the beloved old school survival horror games and '90s landmark brands.… Expand"}, {"name": "B-Boy", "details_link": "https://www.metacritic.com/game/playstation-2/b-boy", "publisher": "Evolved Games", "release_date": "Aug  4 2008", "developers": ["FreeStyleGames"], "platforms": "PlayStation 2", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 53, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/6a6b4fc31b8db0adc1e9811e847f9baf-98.jpg", "descriptions": "B-Boy allows you to battle through authentic Hip-Hop break-dancing culture, challenging the world's best B-Boys on the world's greatest B-Boy stages - and hopefully take home an in-game adidas sponsorship along the way. The first and only authentic break-dancing title on PSP stays true toB-Boy allows you to battle through authentic Hip-Hop break-dancing culture, challenging the world's best B-Boys on the world's greatest B-Boy stages - and hopefully take home an in-game adidas sponsorship along the way. The first and only authentic break-dancing title on PSP stays true to the spirit of B-Boying thanks to the wireless functionality - giving you the freedom to battle on the move – anytime and anywhere – just as B-Boy competitions were meant to be. Featuring real life B-Boy characters, every in-game move is motion-captured from the experts, including moves taken from world famous Redbull athlete, \"Crazy Legs\", who also acts as game MC and end of level boss. Battling around the world, B-Boy features real locations and events, accompanied by the sound of a licensed Hip-Hop and classic Funk soundtrack with each track being selected by the B-Boys featured in-game. Progress through play by taking on 40 of the world's greatest B-Boy personalities, and pull off unique moves and outrageous combo's to become number one. Key game features include: 40 B-Boy characters to do battle with, including world famous B-Boy, Crazy Legs; 12 fully licensed motion-captured competitive B-Boys from Europe, Asia and North America; 21 authentic world wide locations including Redbull BC One, Freestyle Sessions, UK B-Boy Championships and IBE; 40 licensed Hip Hop and classic Funk tracks; Customise your B-Boy with full character personalisation – winning battles allows you to kit yourself out with the latest adidas clothing. [SCEE]… Expand"}, {"name": "Great Invasions: The Darkages \"350-1066 AD\"", "details_link": "https://www.metacritic.com/game/pc/great-invasions-the-darkages-350-1066-ad", "publisher": "Strategy First", "release_date": "Mar 16 2007", "developers": ["Nobilis"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Turn-Based", "Historic", "General"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/11b8317309213eede03ae0701b8cc3a5-98.jpg", "descriptions": "Great Invasions covers three periods from AD 375 to 1066 with over ten scenarios and a Grand Campaign. Dozens of races, realms and empires to choose from, play with more than 160 nations, tribes and states of all sizes and forms. A mix of strategy and action, Great Invasions thrusts you backGreat Invasions covers three periods from AD 375 to 1066 with over ten scenarios and a Grand Campaign. Dozens of races, realms and empires to choose from, play with more than 160 nations, tribes and states of all sizes and forms. A mix of strategy and action, Great Invasions thrusts you back into Europe of the Dark Ages, a time in history where hundreds of nations and barbarian tribes rush to assault the civilized world, from AD 375 (arrival of the Huns) to AD 1066.… Expand"}, {"name": "NBA Live 15", "details_link": "https://www.metacritic.com/game/xbox-one/nba-live-15", "publisher": "Electronic Arts", "release_date": "Oct 28 2014", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade"], "meta_score": 53, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/12cd85e1e5298279bf191743851982d2-98.jpg", "descriptions": "LIVE Seasons mode is back this year with new content updated daily, all season long. New Hot Spot Challenges within BIG Moments task players with replicating game-defining moments from real-world NBA games as closely as possible, while NBA Rewind lets you replay entire contests, jumping inLIVE Seasons mode is back this year with new content updated daily, all season long. New Hot Spot Challenges within BIG Moments task players with replicating game-defining moments from real-world NBA games as closely as possible, while NBA Rewind lets you replay entire contests, jumping in and out whenever you like. Replicate (or stop) a big run from last night’s marquee match-up, hop in to take the game-winning shot, replay the entire game from tip-off to final whistle or anything in between. Content in LIVE Seasons is refreshed throughout the NBA Season. [EA Sports]… Expand"}, {"name": "Virtua Quest", "details_link": "https://www.metacritic.com/game/playstation-2/virtua-quest", "publisher": "Sega", "release_date": "Jan 18 2005", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 53, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/d60a10d896a1d54e6bcd8aea36bb1e6e-98.jpg", "descriptions": "(Know in Japan as \"Virtua Fighter Cyber Generation\")  Virtua Quest is a 3D Action/RPG that features both core RPG elements (exploration, treasure gathering, and character development) and a strong fighting component. The player assumes the identity of a young boy named Sei (pronounced(Know in Japan as \"Virtua Fighter Cyber Generation\")  Virtua Quest is a 3D Action/RPG that features both core RPG elements (exploration, treasure gathering, and character development) and a strong fighting component. The player assumes the identity of a young boy named Sei (pronounced \"Say\"). As the player explores each stage, he/she will discover \"Virtua Souls\" - data clusters that contain information about the martial arts abilities of the legendary Virtua Fighter characters. These clusters give the player the ability to easily perform complex fighting moves. As the game's story progresses, Sei discovers that only he can unlock the potential of the Virtua Souls, and he subsequently gains the attention of an evil syndicate known as Judgment 6. [Sega]… Expand"}, {"name": "Jurassic Park: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/jurassic-park-the-game", "publisher": "Telltale Games", "release_date": "Nov 15 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Adventure", "General", "General", "Visual Novel", "Point-and-Click"], "meta_score": 53, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/02a263170f72a00a351fb0a15b88781d-98.jpg", "descriptions": "Telltale Games, the studio behind Tales of Monkey Island and the Sam & Max episodes, turns Spielberg's classic dinosaur movie Jurassic Park into an episodic adventure."}, {"name": "Eat Lead: The Return of Matt Hazard", "details_link": "https://www.metacritic.com/game/xbox-360/eat-lead-the-return-of-matt-hazard", "publisher": "D3Publisher", "release_date": "Feb 26 2009", "developers": ["Vicious Cycle"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 53, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/59c4777e51346feed44db0c67f4e03d4-98.jpg", "descriptions": "In Eat Lead: The Return of Matt Hazard, videogame action hero Matt Hazard gets his chance to prove once and for all that he is the king of shooters when the new owner of mega game publisher, Marathon Megasoft, gives Matt his comeback role starring in a new title for next-gen consoles thatIn Eat Lead: The Return of Matt Hazard, videogame action hero Matt Hazard gets his chance to prove once and for all that he is the king of shooters when the new owner of mega game publisher, Marathon Megasoft, gives Matt his comeback role starring in a new title for next-gen consoles that pits him against all of his memorable foes from videogames past. In the world of Eat Lead, however, everything stops being a game and becomes reality when it is clear that someone is using the new game to bring about Matt’s death once and for all. With only the mysterious QA to help him, Matt must fight against a legion of Marathon Megasoft catalogue of videogame characters to keep it from being Game Over forever. Eat Lead pays homage to the games of yesteryear with a menagerie of classic enemies such as zombies, space marines, cowboys, genetically mutated super snipers, and more and an expansive level environment design that reflects videogame history in a next-gen package. The game fires on all cylinders with explosive artillery and combat moves to help gamers escape from a variety of predicaments including radically-changing environments during gameplay via hack effects Hazard's nemesis uses by altering the game’s code on the fly. Throughout the adventure, players will utilize a strategic cover system dubbed point and cover, upgradeable weapons and different interactive melee moves to attack and outsmart foes. [D3Publisher]… Expand"}, {"name": "Airplane Mode", "details_link": "https://www.metacritic.com/game/pc/airplane-mode", "publisher": "AMC", "release_date": "Oct 15 2020", "developers": ["Bacronym"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/70fa33141eaf52f5ec46e970d8305500-98.jpg", "descriptions": "Airplane Mode delivers all the thrills of a real-time, six-hour commercial airline flight—in Coach. At least you've got a window seat. Buckle up."}, {"name": "Super Dungeon Bros", "details_link": "https://www.metacritic.com/game/xbox-one/super-dungeon-bros", "publisher": "Wired Productions", "release_date": "Nov  1 2016", "developers": ["React Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "General", "Roguelike"], "meta_score": 53, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/7/9d4b65a36c1e3880bbf28fb3c9547d1e-98.jpg", "descriptions": "In Super Dungeon Bros, teams of up to four players will control hard rocking warrior bros in the ever-changing dungeons that combine rock and fantasy with dangerous foes, deadly obstacles and hazardous puzzles. Players will take on bosses and plunder loot from the dark recesses of RökheimIn Super Dungeon Bros, teams of up to four players will control hard rocking warrior bros in the ever-changing dungeons that combine rock and fantasy with dangerous foes, deadly obstacles and hazardous puzzles. Players will take on bosses and plunder loot from the dark recesses of Rökheim where the Dungeon Bros will slay anything and everything in their path, as no challenge is too big for the Bros and their motto, “Bros B4 Foes!”… Expand"}, {"name": "Pixel Piracy", "details_link": "https://www.metacritic.com/game/xbox-one/pixel-piracy", "publisher": "505 Games", "release_date": "Feb 16 2016", "developers": ["Abstraction Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 53, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/2/1748ae5e04e6fa520ed043cbad94e960-98.jpg", "descriptions": "Presented by the creators of TERRARIA. Lead the life of a pirate captain in this open world rogue like sim. Recruit a crew, outfit them, customize your ship and set sail on the open seas! There you’ll use any combination of aggression, diversion and trade to become the most infamous piratePresented by the creators of TERRARIA. Lead the life of a pirate captain in this open world rogue like sim. Recruit a crew, outfit them, customize your ship and set sail on the open seas! There you’ll use any combination of aggression, diversion and trade to become the most infamous pirate crew of the seven seas. You can raid, pillage and plunder everything in your path, divert and lie to get what you want, or trade for a quick buck. Adventure awaits.… Expand"}, {"name": "Transformers: Revenge of the Fallen", "details_link": "https://www.metacritic.com/game/wii/transformers-revenge-of-the-fallen", "publisher": "Activision", "release_date": "Jun 23 2009", "developers": ["Krome Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Adventure", "Shooter", "Beat-'Em-Up", "Sci-Fi", "Sci-Fi", "Third-Person", "3D", "Arcade"], "meta_score": 53, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/f8df578289e3ddeb5af09719877cbe78-98.jpg", "descriptions": "The fate of the earth and the survival of the human race hang in the balance in the Transformers: Revenge of the Fallen video game for the Wii and PS2. Playing as both the AUTOBOTS and DECEPTICONS, players are propelled into an adrenaline-pumping battle for supremacy across the globe whereThe fate of the earth and the survival of the human race hang in the balance in the Transformers: Revenge of the Fallen video game for the Wii and PS2. Playing as both the AUTOBOTS and DECEPTICONS, players are propelled into an adrenaline-pumping battle for supremacy across the globe where every second and every choice makes the difference between mankind’s salvation and annihilation. Recruit a Friend to Join the Battle in Unique Co-op Campaigns - At any point in the intense single-player campaign, a friend can join in as a \"Remote Weapon System,\" acting as a floating shield to defend you and as a special weapons system to strengthen the assault. Test Your Skills in the All-New Co-op Arena Mode - Teamwork is key as players enter the new Arena mode to pick their favorite characters and fight alongside their friends arcade-style against increasing waves of enemies. [Activision]… Expand"}, {"name": "Space Trader - Merchant Marine", "details_link": "https://www.metacritic.com/game/pc/space-trader---merchant-marine", "publisher": "Meridian4", "release_date": "Oct 23 2008", "developers": ["Meridian4"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 53, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/5/47d1a89c995e4446d66485aa8132ec50-98.jpg", "descriptions": "In the far future, humanity is ruled by The Ministry of Accounts, an oppressive bureaucracy that tracks, records and taxes every transaction of daily life. From the depths of Red Tape, a new breed of marketeer arises to challenge the authority and make a profit: the Space Trader is born! AsIn the far future, humanity is ruled by The Ministry of Accounts, an oppressive bureaucracy that tracks, records and taxes every transaction of daily life. From the depths of Red Tape, a new breed of marketeer arises to challenge the authority and make a profit: the Space Trader is born! As a Trader, you will attempt to amass a fortune beyond your wildest imagination, buying and selling commodities and taking up arms against the oppressors or even accepting bounty missions, hunting down crime bosses and their thugs. [Meridian 4]… Expand"}, {"name": "Spy vs. Spy", "details_link": "https://www.metacritic.com/game/xbox/spy-vs-spy", "publisher": "Global Star Software", "release_date": "Apr  6 2005", "developers": ["Vicious Cycle"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Action", "Platformer", "3D"], "meta_score": 53, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/ab2ed599d6dff34b6c6ff7e9930e463e-98.jpg", "descriptions": "Embittered rivals White Spy and Black Spy return for more comical sabotage in this action-espionage game based on the characters made famous in MAD Magazine. Your mission is to retrieve top-secret information, while trying to outwit and outlast up to three friends (or enemies). OutlandishEmbittered rivals White Spy and Black Spy return for more comical sabotage in this action-espionage game based on the characters made famous in MAD Magazine. Your mission is to retrieve top-secret information, while trying to outwit and outlast up to three friends (or enemies). Outlandish traps and hazards abound. Broadband networked and split screen multiplayer options allow players to outwit three of your best friends...or worst enemies. Unlock features such as disguises, levels, weapons, and items. In Mod-A-Spy Mode, go deep undercover donning the unlockable disguises and fooling your foolish opponents. Eight Game Modes including: Modern, Classic, Story and 5 multiplayer modes such as Death Match, Armed and Loaded, Get Mad, Last Man Standing and Run and Gun.… Expand"}, {"name": "Carmen Sandiego: The Secret of the Stolen Drums", "details_link": "https://www.metacritic.com/game/xbox/carmen-sandiego-the-secret-of-the-stolen-drums", "publisher": "Bam Entertainment", "release_date": "Sep 13 2004", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/842b4af31631441a866eee3bfdfd0b6b-98.jpg", "descriptions": "Join A.C.M.E. agent-in-training, Cole Gannon, along with Jules Argent and Shadow Hawkins, in an all-new action adventure on the trail of Carmen Sandiego--the world's greatest thief. This case takes Cole around the world: from a museum in New York and the beaches of New Zealand to the IncanJoin A.C.M.E. agent-in-training, Cole Gannon, along with Jules Argent and Shadow Hawkins, in an all-new action adventure on the trail of Carmen Sandiego--the world's greatest thief. This case takes Cole around the world: from a museum in New York and the beaches of New Zealand to the Incan ruins of Machu Picchu. While on the case, you'll need to use acrobatics, stealth, martial arts, and most of all, your wit, to stop Carmen from unearthing the drums and making off with the lost treasure.… Expand"}, {"name": "Conspiracies", "details_link": "https://www.metacritic.com/game/pc/conspiracies", "publisher": "Got Game Entertainment", "release_date": "Nov 10 2003", "developers": ["Anima Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/c41ad032ee8aae6e648c3ce0599cd050-98.jpg", "descriptions": "Conspiracies is a first person murder mystery adventure. Join detective Nick Delios as he is asked to help solve the murder of a small-time crook. Nick needs the cash and accepts the case never suspecting the depth of intrigue and twists lying ahead. This seemingly \"simple\" case thrusts NickConspiracies is a first person murder mystery adventure. Join detective Nick Delios as he is asked to help solve the murder of a small-time crook. Nick needs the cash and accepts the case never suspecting the depth of intrigue and twists lying ahead. This seemingly \"simple\" case thrusts Nick into a complex case of multiple conspiracies, where nothing is what it seems and which extends beyond the very bounds of our planet. [Got Game Entertainment]… Expand"}, {"name": "Tetris Worlds", "details_link": "https://www.metacritic.com/game/xbox/tetris-worlds", "publisher": "THQ", "release_date": "Jun 24 2002", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Stacking"], "meta_score": 53, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/904221801d21bae3bcb5e5551fef63d2-98.jpg", "descriptions": "For over a decade, the Tetris series has made an appearance on every game system.  Tetris Worlds continues that streak, bringing their distinct brand of simple, yet addictive gameplay to the current generation of systems.  Small shapes called Tetraminoes fall from the top of the screen toFor over a decade, the Tetris series has made an appearance on every game system.  Tetris Worlds continues that streak, bringing their distinct brand of simple, yet addictive gameplay to the current generation of systems.  Small shapes called Tetraminoes fall from the top of the screen to the bottom and you must rotate them and fit them together to complete lines.  The game features six different variations of the classic Tetris, multiplayer mode for up to four players, and six different worlds.  Sound easy? Once you start, you can't stop.… Expand"}, {"name": "Top Angler", "details_link": "https://www.metacritic.com/game/playstation-2/top-angler", "publisher": "Xicat Interactive", "release_date": "Mar 28 2002", "developers": ["SIMS"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 53, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e9677586a95ceb879105f971bd8ae044-98.jpg", "descriptions": "Place your bait, set your hook and reel in the big one! This is the quintessential Man versus Nature game. You are set up with the most up to date lures, bait, Fish finders and boating equipment available. With these advantages your mission is to catch the most wily prey known to modernPlace your bait, set your hook and reel in the big one! This is the quintessential Man versus Nature game. You are set up with the most up to date lures, bait, Fish finders and boating equipment available. With these advantages your mission is to catch the most wily prey known to modern fisherman. You will prowl the best fishing lakes in the world on your hunt for a championship Bass. Features 4 fishing modes including a tournament mode, real 3-D modeling, real-time scenery changes in time-day. [Xicat Interactive]… Expand"}, {"name": "Samurai Warriors 2", "details_link": "https://www.metacritic.com/game/xbox-360/samurai-warriors-2", "publisher": "Koei", "release_date": "Sep 19 2006", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 52, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/d76a45c991db9101c191d969267dabfd-98.jpg", "descriptions": "Long before the twilight of the samurai, Japan was ruled by powerful leaders hungry to unite the land under one banner. The samurai and ninja who defended their land and honor became legends. Features 26 playable characters in all. 10 new warriors are ready for battle including the legendaryLong before the twilight of the samurai, Japan was ruled by powerful leaders hungry to unite the land under one banner. The samurai and ninja who defended their land and honor became legends. Features 26 playable characters in all. 10 new warriors are ready for battle including the legendary Musashi Miyamoto, the unifier of Japan Ieyasu Tokugawa, and the enigmatic ninja Kotaro Fuma. Once forbidden secret techniques for each warrior are revealed. Set traps, summon ninja decoys, and more. Use powerful Linked Charge attacks and for the first time power up to three Musou gauges. Now castle warfare blends seamlessly with field combat. Take control of castles on the battlefield to gain a significant morale advantage. Experience new tales in Story, Free, and Survival modes. Team up with friends for two-player Co-op play or compete with them at \"Sugoroku,\" a bonus party game for up to four players. Challenge an opponent in two-player Vs. play exclusively through Xbox Live. Over 70 cinematic sequences supervised by Shinsuke Sato, director of the cult hit, \"The Princess Blade\" and new music from fusion artist Minoru Mukaiya. [KOEI]… Expand"}, {"name": "Blade Runner: Enhanced Edition", "details_link": "https://www.metacritic.com/game/switch/blade-runner-enhanced-edition", "publisher": "Night Dive Studios", "release_date": "Jun 23 2022", "developers": ["Night Dive Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 52, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/1cab88294e714440b66ea8c1bab2640c-98.jpg", "descriptions": "In 1997 Westwood Studios released a title that won universal praise from gamers and critics all around the world, along with accolades like AIAS's Adventure Game of the Year award. Set in the same time and universe as the 1982 classic science fiction film by Ridley Scott, Blade Runner videoIn 1997 Westwood Studios released a title that won universal praise from gamers and critics all around the world, along with accolades like AIAS's Adventure Game of the Year award. Set in the same time and universe as the 1982 classic science fiction film by Ridley Scott, Blade Runner video game is now making a big comeback on modern consoles!Armed with your investigative skills and the tools of the Blade Runner trade, you'll be immersed in a world that lives and breathes around you with breakthrough lighting and visual effects. Your ability to survive will be put to the test in the richest game environment ever.… Expand"}, {"name": "Doctor Who: The Edge Of Time", "details_link": "https://www.metacritic.com/game/playstation-4/doctor-who-the-edge-of-time", "publisher": "Playstack", "release_date": "Nov 12 2019", "developers": ["Maze Theory"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 52, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/2a240e4d891c24cdd64ff67c6d2d8153-98.jpg", "descriptions": "Another mysterious enemy threatens to tear apart the universe and only you can stop them. Doctor Who: The Edge Of Time lets players embark on an adventure through space and time. Travel across the universe, visit alien locations, pilot the TARDIS, and solve the mystery of the controllingAnother mysterious enemy threatens to tear apart the universe and only you can stop them. Doctor Who: The Edge Of Time lets players embark on an adventure through space and time. Travel across the universe, visit alien locations, pilot the TARDIS, and solve the mystery of the controlling force behind the Reality Virus.… Expand"}, {"name": "Eden-Tomorrow", "details_link": "https://www.metacritic.com/game/playstation-4/eden-tomorrow", "publisher": "Soul Pix", "release_date": "Feb 12 2019", "developers": ["Soul Pix"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 52, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/87fe3168131e941ba28306b11bae44c4-98.jpg", "descriptions": "Developed exclusively for PS VR, Eden-Tomorrow is a story-driven, sci-fi action-adventure. The main characters are a human plagued by amnesia and a drone called Newton, who must work together to survive on this hostile alien planet."}, {"name": "Darkness Within: In Pursuit of Loath Nolder", "details_link": "https://www.metacritic.com/game/pc/darkness-within-in-pursuit-of-loath-nolder", "publisher": "Lighthouse Interactive", "release_date": "Nov  6 2007", "developers": ["Zoetrope Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 52, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/4f7948190e1902bbb6416192e92fe915-98.jpg", "descriptions": "As police detective Howard E. Loreid, players are tasked to solve the murder of Clark Field, a wealthy man involved in the occult. At the top of your list of suspects is Loath Nolder, a highly respected private investigator who mysteriously abandoned his last case for reasons unknown. RumorAs police detective Howard E. Loreid, players are tasked to solve the murder of Clark Field, a wealthy man involved in the occult. At the top of your list of suspects is Loath Nolder, a highly respected private investigator who mysteriously abandoned his last case for reasons unknown. Rumor had it that he ventured to several exotic places around the world. It remains a great mystery as to why Loath Nolder disappeared so suddenly, resurfacing five years later and resuming his investigations just as abruptly as he had left them. Why does this venerated P.I. now sit on the other side of the law? This seemingly routine investigation takes a dramatic twist as strange and terrifying happenings begin to plague your psyche. You experience lucid horrifying dreams and are tormented by paranormal happenings. Why do days pass instead of hours when you sleep? What’s real and what’s not? As you pursue fugitive murder suspect Loath Nolder, you must face dire truths hidden deep within a haunting darkness and the recesses of your mind. [Lighthouse Interactive]… Expand"}, {"name": "Hammer & Sickle", "details_link": "https://www.metacritic.com/game/pc/hammer-sickle", "publisher": "Take-Two Interactive", "release_date": "Dec  5 2005", "developers": ["Nival Interactive", "Novik & Co"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic", "Tactics"], "meta_score": 52, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/7c70c95682ceba5febb81fe615792226-98.jpg", "descriptions": "Hammer & Sickle is a tactical RPG set in the spring of 1949. The player assumes the role of a top Soviet spy on clandestine duty in the British-American controlled sector of Germany during the early years of the budding Cold War. In a world where no one is quite who they appear to be, theHammer & Sickle is a tactical RPG set in the spring of 1949. The player assumes the role of a top Soviet spy on clandestine duty in the British-American controlled sector of Germany during the early years of the budding Cold War. In a world where no one is quite who they appear to be, the player is trapped in a hellish ploy that could trigger a third world war, this time between the United States and Soviet Union and their respective nuclear arsenals. Gamers have to navigate a web of intrigue and make decisions that could determine the fate of the world. [CDV Software]… Expand"}, {"name": "Neopets Puzzle Adventure", "details_link": "https://www.metacritic.com/game/wii/neopets-puzzle-adventure", "publisher": "Capcom", "release_date": "Dec 18 2008", "developers": ["Infinite Interactive"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/0e3fa092318ad2129b99550554a17018-98.jpg", "descriptions": "Neopets Puzzle Adventure offers an in-depth and exciting storyline full of puzzle-based gameplay set in the world of Neopets. The game offers pick up and play gameplay, new never-before-seen areas in the Neopets universe to explore, and the opportunity to redeem codes for exclusive virtualNeopets Puzzle Adventure offers an in-depth and exciting storyline full of puzzle-based gameplay set in the world of Neopets. The game offers pick up and play gameplay, new never-before-seen areas in the Neopets universe to explore, and the opportunity to redeem codes for exclusive virtual items at the Neopets website. The game board itself resembles a chessboard, while the gameplay takes the principles of Reversi and Go, and adds new twists that take the adventure to unexpected levels. The goal is to turn all of the chips on the board to your Neopet's color. [Capcom]… Expand"}, {"name": "Bionicle", "details_link": "https://www.metacritic.com/game/pc/bionicle", "publisher": "Lego Media", "release_date": "Oct 20 2003", "developers": ["Argonaut Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 52, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/84a9b717852d4d319f5abd83962945d1-98.jpg", "descriptions": "Playing as the Toa, Toa Nuva and finally the 7th Toa, you must explore the six elementally-themed regions of Mata Nui - a tropical paradise of high mountains, great lakes and mighty volcanoes - rescue the scattered Matoran and break the spell of darkness sent by the evil Makuta. In doing soPlaying as the Toa, Toa Nuva and finally the 7th Toa, you must explore the six elementally-themed regions of Mata Nui - a tropical paradise of high mountains, great lakes and mighty volcanoes - rescue the scattered Matoran and break the spell of darkness sent by the evil Makuta. In doing so you will face danger in equal measure from the islands many environmental hazards (including falling rocks, rainforest winds, icicles and lava falls) and the foul minions of Makuta. So whether youre a skilled player or a young gamer, the time has come to emerge from behind your mask. The fate of Mata Nui is now in your hands... Toa, you must explore the six elementally-themed. Choose any one of the six Toa characters to begin your adventure. Use the unique elemental powers of the Toa and summon 'blasts' of elemental energy to defeat your enemies. [LEGO/EA]… Expand"}, {"name": "Realms of Ancient War", "details_link": "https://www.metacritic.com/game/xbox-360/realms-of-ancient-war", "publisher": "Focus Home Interactive", "release_date": "Sep 19 2012", "developers": ["Wizarbox"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 52, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/fc47fb7afa76c1c7916f6b2e2e8fb503-98.jpg", "descriptions": "This heroic fantasy hack 'n' slash takes you on a continent ravaged by a war that held ten years ago. The four Kingdoms of Men, Elves and Dwarves lay in ruins, preyed on by raiders and looters. In this chaos, a new, unknown threat is looming... trying to discover its true nature, theThis heroic fantasy hack 'n' slash takes you on a continent ravaged by a war that held ten years ago. The four Kingdoms of Men, Elves and Dwarves lay in ruins, preyed on by raiders and looters. In this chaos, a new, unknown threat is looming... trying to discover its true nature, the kingdoms sent detachments to investigate, a dangerous mission from which no one returned. But what about you ? You merely were in the wrong place, at the wrong time...… Expand"}, {"name": "Transformers: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/transformers-the-game", "publisher": "Activision", "release_date": "Jun 26 2007", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 52, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/21e95afa33b42fbfddc65502d480e3b4-98.jpg", "descriptions": "Based on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in DisguiseBased on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in Disguise such as BumbleBee, Barricade and others. As the Transformers robot's war comes to Earth, gamers make the choice to join the Autobots in protecting our planet or to join the Decepticons in destroying it. With dual campaigns, the fate of the world is in players' hands. Instantly change from a larger than life robot to a high-powered vehicle such as a sports car, fighter jet or helicopter. Players crush, topple and wreck every object, including buildings and vehicles, in their path or use the objects as weapons. An unprecedented line-up lets gamers experience the massive scale, unique abilities and sheer strength of an army of characters from the Transformers universe when they choose to play as Optimus Prime, Megatron, Ironhide, Starscream, BumbleBee and more. For head-to-head battles, fans engage in melee combat that reflects each Transformers robot's character, scale, weight and power along with melee weapons and special moves unique to each character. The game's ranged combat offers a wide array of projective weapons designed to take out enemies from afar. [Activision]… Expand"}, {"name": "Hidden Dragon Legend", "details_link": "https://www.metacritic.com/game/playstation-4/hidden-dragon-legend", "publisher": "Oasis Games", "release_date": "Sep 19 2017", "developers": ["Oasis Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 52, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/3dc08940fce72c2678f044b955fe2c04-98.jpg", "descriptions": "Hidden Dragon is a 2.5D action platformer set in Imperial China, combining classic platform action with fast-paced combo fighting, harkening back to classics like Ninja Gaiden, Devil May Cry, and Shinobi."}, {"name": "Krater", "details_link": "https://www.metacritic.com/game/pc/krater", "publisher": "Fatshark AB", "release_date": "Jun 12 2012", "developers": ["Fatshark AB", "Fatshark"], "platforms": "PC", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 52, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/1a172c1ff5ac5f005121e5a135b52441-98.jpg", "descriptions": "Krater is a squad-based roleplaying game set in a colorful post-apocalyptic world. It combines the combat mechanics of action-rpgs with the top-down view of the classic old-school RPG and RTS games. The game brings far into the future of a post-apocalyptic Sweden. Once home to IKEA, VikingsKrater is a squad-based roleplaying game set in a colorful post-apocalyptic world. It combines the combat mechanics of action-rpgs with the top-down view of the classic old-school RPG and RTS games. The game brings far into the future of a post-apocalyptic Sweden. Once home to IKEA, Vikings and Minecraft, today its primitive inhabitants scavenge the broken overgrown world for technological artifacts. At the rim of an impact site known as the Krater, three factions vie for control over the wound opening up into the world below. Consisting of an endless series of caves and tunnels filled with old world treasures and perils, the Underside stretches into the depths of the fallen Swedish civilization. You arrive at the Krater with your team of freelancers to take part in the goldrush where people come back rich or don’t come back at all. [Steam]… Expand"}, {"name": "Hail to the Chimp", "details_link": "https://www.metacritic.com/game/xbox-360/hail-to-the-chimp", "publisher": "Gamecock Media Group", "release_date": "Jul  2 2008", "developers": ["Wideload Games Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 52, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/8cdd0e24b321c37eff5dd1abfadef13f-98.jpg", "descriptions": "Since the dawn of time, Man has wondered who would win if a polar bear and jellyfish teamed up to fight an armadillo and yak. Do you have what it takes (approximately $40) to learn the shocking truth? When the King of the Animals is forced to resign in disgrace, a motley group of candidatesSince the dawn of time, Man has wondered who would win if a polar bear and jellyfish teamed up to fight an armadillo and yak. Do you have what it takes (approximately $40) to learn the shocking truth? When the King of the Animals is forced to resign in disgrace, a motley group of candidates turns out for a bare-knuckle campaign to win the Crown. From Ptolemy, the mighty hippo, to Crackers, the devious monkey, each of the ten candidates has distinct strengths and strategies, but the same hunger for political power. Hail to the Chimp is a party game that delivers exciting gameplay, lush interactive environments, and a comic look at politics. Players use the game’s unique team-up mechanic, mixing cooperation with competition, to claw their way to victory. Whether played by four friends on one TV, online against distant challengers or single-player against advanced AI, Hail to the Chimp offers endlessly replayable party fun for gamers of all stripes. [Gamecock Media]… Expand"}, {"name": "Alpha Polaris: A Horror Adventure Game", "details_link": "https://www.metacritic.com/game/pc/alpha-polaris-a-horror-adventure-game", "publisher": "Just A Game", "release_date": "Jun 24 2011", "developers": ["Turmoil Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 52, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/abd2c8de5d8aecb7c6a74417180486dd-98.jpg", "descriptions": "In the midst of the snowfields of Greenland lies Alpha Polaris, an American oil research station. High above, the ion storm of the century is gathering, bringing about a strange intermixing of reality and night terrors. It is up to Rune Knudsen, a Norwegian biologist, to take on a desperateIn the midst of the snowfields of Greenland lies Alpha Polaris, an American oil research station. High above, the ion storm of the century is gathering, bringing about a strange intermixing of reality and night terrors. It is up to Rune Knudsen, a Norwegian biologist, to take on a desperate struggle against fear and death, and to face the primordial force lurking beyond the veiled sky.… Expand"}, {"name": "Rango", "details_link": "https://www.metacritic.com/game/wii/rango", "publisher": "Paramount Digital Entertainment", "release_date": "Mar  1 2011", "developers": ["Behaviour Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 52, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/85f96070c693267754e41b509828ec57-98.jpg", "descriptions": "Rango The Video Game invites players to continue on Rango's journey through new adventures inspired by the movie."}, {"name": "Blade Kitten", "details_link": "https://www.metacritic.com/game/pc/blade-kitten", "publisher": "Atari", "release_date": "Sep 22 2010", "developers": ["Krome Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 52, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/ca9f27be8657f9fb53848b7425395fb2-98.jpg", "descriptions": "Blade Kitten the game begins with Kit tracking a local troublemaker named Terra-Li on the mysterious artificial planetoid Hollow Wish. But on her way to doing so Kit uncovers a dark secret about Hollow Wish and its inhabitants, little does she realize that her actions will affect the destinyBlade Kitten the game begins with Kit tracking a local troublemaker named Terra-Li on the mysterious artificial planetoid Hollow Wish. But on her way to doing so Kit uncovers a dark secret about Hollow Wish and its inhabitants, little does she realize that her actions will affect the destiny of an entire planet. Her tale is one of liberation. Her tail is pink.\r… Expand"}, {"name": "Akiba's Trip: Hellbound & Debriefed", "details_link": "https://www.metacritic.com/game/playstation-4/akibas-trip-hellbound-debriefed", "publisher": "XSEED Games", "release_date": "Jul 20 2021", "developers": ["Acquire"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Third-Person", "General", "Action", "Beat-'Em-Up", "3D"], "meta_score": 52, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/a83a384c968fa190cd424c3da824e897-98.jpg", "descriptions": "AKIBA’S TRIP: Hellbound & Debriefed is the precursor to AKIBA’S TRIP: Undead & Undressed, the smash hit that introduced a Western audience to the seedy underworld lurking in the shadows of the haven of “otaku” culture in the Akihabara district of Tokyo. Released as AKIBA’S TRIP Plus inAKIBA’S TRIP: Hellbound & Debriefed is the precursor to AKIBA’S TRIP: Undead & Undressed, the smash hit that introduced a Western audience to the seedy underworld lurking in the shadows of the haven of “otaku” culture in the Akihabara district of Tokyo. Released as AKIBA’S TRIP Plus in Japan, players explore a rich setting based on the famous “Akiba” district circa 2011, hunting vampiric foes and tearing off their clothes to expose them to sunlight. This remaster brings the game up to modern HD graphical standards, all while retaining the charm of the original classic that sparked a cult hit series. … Expand"}, {"name": "Kinect Joy Ride", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-joy-ride", "publisher": "Microsoft Game Studios", "release_date": "Nov  4 2010", "developers": ["BigPark"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 52, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/74e2211f17ac690388ab3db4ba284ae8-98.jpg", "descriptions": "Put your avatar behind the wheel of a vehicle you select and customize to match your personal style, and drive your avatar WILD. Trick out your avatar with styles and animations to guarantee you'll stand out in the crowd. The game universe constantly evolves and expands with new downloadablePut your avatar behind the wheel of a vehicle you select and customize to match your personal style, and drive your avatar WILD. Trick out your avatar with styles and animations to guarantee you'll stand out in the crowd. The game universe constantly evolves and expands with new downloadable content, including new stunt parks, tracks, cars, car upgrades, avatar clothing and animations, and new events. Once you're all customized, take your avatar out for a spin. Make friends around the world as you catch huge air, pull off crazy stunts, and participate in fun community events.… Expand"}, {"name": "Spider-Man 3", "details_link": "https://www.metacritic.com/game/psp/spider-man-3", "publisher": "Activision", "release_date": "Oct 16 2007", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 52, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/c6bfaee64ee11544624d78f59f21adb7-98.jpg", "descriptions": "Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time,Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time, enjoy unprecedented freedom—choosing what you want to do, when you want to do it. There's no checklist to complete in order to progress. You set your own next goal, roaming anywhere you want - including subterranean areas such as subways, sewers and villains' lairs - in the most massive, detailed New York City ever seen in a Spider-Man game. Experience an all-new combat system, two exciting ways. Redesigned from the ground up, a unique combat system empowers both Spider-Man and Black-Suited Spider-Man to perform suit-specific powers and abilities. State of the art animations, combos and finishers make punch, kick and web attacks more super-heroic than ever. Battle 10 of Spider-Man’s most infamous enemies from the movie and Marvel universe, including Sandman and Venom. [Activision]… Expand"}, {"name": "Xotic", "details_link": "https://www.metacritic.com/game/xbox-360/xotic", "publisher": "Valcon Games", "release_date": "Nov 16 2011", "developers": ["WXP"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/04490a40657b91c86a9afac0d4e584e4-98.jpg", "descriptions": "Xotic is more than just killing enemies. Players can compare their shooter skills with their friends’ on the leaderboards as they rack up chain combos by shooting targets like the life-choking Scab plants around each level, picking up Orb Essence, and, yes, blasting enemies. Balancing all ofXotic is more than just killing enemies. Players can compare their shooter skills with their friends’ on the leaderboards as they rack up chain combos by shooting targets like the life-choking Scab plants around each level, picking up Orb Essence, and, yes, blasting enemies. Balancing all of these elements while attaining the best time in each level is the key to becoming the top scorer. In their quest to become number one, players will also earn experience points that they can use to upgrade their skills and weapons and can pick up power-ups around each level.… Expand"}, {"name": "Uncanny Valley", "details_link": "https://www.metacritic.com/game/playstation-4/uncanny-valley", "publisher": "Digerati Distribution", "release_date": "Feb  7 2017", "developers": ["Cowardly Creations"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 52, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/0/a6451db69a664956a627ef58da568a9f-98.jpg", "descriptions": "Welcome to Uncanny Valley — an unsettling, story-driven survival horror where nothing is as it seems. Explore an isolated facility and solve its many mysteries, but be warned: the choices you make have meaningful consequences that will determine your fate. Play through multiple times toWelcome to Uncanny Valley — an unsettling, story-driven survival horror where nothing is as it seems. Explore an isolated facility and solve its many mysteries, but be warned: the choices you make have meaningful consequences that will determine your fate. Play through multiple times to reveal all of Uncanny Valley’s darkest secrets. [Playstation.com]… Expand"}, {"name": "Spider-Man: Web of Shadows", "details_link": "https://www.metacritic.com/game/pc/spider-man-web-of-shadows", "publisher": "Activision", "release_date": "Oct 28 2008", "developers": ["Treyarch", "Shaba Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Action Adventure", "General", "General", "Beat-'Em-Up", "Open-World", "2D"], "meta_score": 52, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/216857b05aa9816d8cfefc6c83d2047c-98.jpg", "descriptions": "New York City has been invaded and only Spider-Man can save it. The fate of New York is in your hands...Take Control. Spider-Man: Web of Shadows gives you an unprecedented level of gameplay choice, including, for the first time, control over the game's direction and outcome. Choose howNew York City has been invaded and only Spider-Man can save it. The fate of New York is in your hands...Take Control. Spider-Man: Web of Shadows gives you an unprecedented level of gameplay choice, including, for the first time, control over the game's direction and outcome. Choose how Spider-Man fights, which powers to upgrade, who in the Marvel universe to fight with or against, and the fate of New York City itself. Choose wisely. [Activision]… Expand"}, {"name": "Midnight Nowhere", "details_link": "https://www.metacritic.com/game/pc/midnight-nowhere", "publisher": "Tri Synergy", "release_date": "Mar 29 2004", "developers": ["Saturn+"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 52, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/c01c3566c0f8bb07f117dfe16aab65a0-98.jpg", "descriptions": "Murders... Dozens of horrific murdersЕPeople are leaving the town in panic. The police are bending over backwards to catch the criminal; the military are putting cordons round the town... but nothing can stop the maniac. New people are found dead every day. Horror and death reign overMurders... Dozens of horrific murdersЕPeople are leaving the town in panic. The police are bending over backwards to catch the criminal; the military are putting cordons round the town... but nothing can stop the maniac. New people are found dead every day. Horror and death reign over the town... You wake up and find yourself in a mortuary. The room, which you are in, is in a mess. Dead bodies lie scattered all around you... What am I doing here? What happened in the room? You cannot remember... The answers await you at the end of your journey... Midnight Nowhere will immerse you in a world rich in atmosphere. In this suspenseful, story-driven adventure you will solve numerous puzzles and battle creatures of the dark to reveal the ultimate mysteryЕPrepare yourself for the most thrilling experience in a stunningly beautiful 3D world of suspense and horror! [Buka Entertainment]… Expand"}, {"name": "18 Wheeler: American Pro Trucker", "details_link": "https://www.metacritic.com/game/gamecube/18-wheeler-american-pro-trucker", "publisher": "Acclaim", "release_date": "Feb 18 2002", "developers": ["Acclaim Studios Cheltenham"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 52, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/f3bd88446761f76cbd75599c4ccc91f7-98.jpg", "descriptions": "Get behind the wheel of a 60-foot-long, 20-ton, 18-wheeled truck and buckle up as you drive in locations from New York to California. 18 Wheeler: American Pro Trucker features arcade-style racing in four gameplay modes: arcade, parking, score attack, and versus. You'll transport cargo andGet behind the wheel of a 60-foot-long, 20-ton, 18-wheeled truck and buckle up as you drive in locations from New York to California. 18 Wheeler: American Pro Trucker features arcade-style racing in four gameplay modes: arcade, parking, score attack, and versus. You'll transport cargo and race against other truck drivers--all while protecting your rig from damage. In versus mode, you can take on a friend in split-screen action on four different raceways.… Expand"}, {"name": "Harry Potter and the Order of the Phoenix", "details_link": "https://www.metacritic.com/game/psp/harry-potter-and-the-order-of-the-phoenix", "publisher": "EA Games", "release_date": "Jun 25 2007", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 52, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/8349905761b4748a50068a28e699f6bb-98.jpg", "descriptions": "In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster,In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster, Albus Dumbledore, is lying about Voldemort's return in order to undermine his power and take his job, the Minister for Magic, Cornelius Fudge, appoints a new Defense Against the Dark Arts teacher to keep watch over Dumbledore and the Hogwarts students. But Professor Dolores Umbridge's Ministry-approved course of defensive magic leaves the young wizards woefully unprepared to defend themselves against the dark forces threatening them and the entire wizarding community, so at the prompting of his friends Hermione and Ron, Harry takes matters into his own hands. Meeting secretly with a small group of students who name themselves \"Dumbledore’s Army,\" Harry teaches them how to defend themselves against the Dark Arts, preparing the courageous young wizards for the extraordinary battle that lies ahead. With the ability to play multiple characters, including Harry Potter, Dumbledore and Sirius Black, the videogame of Harry Potter and the Order of the Phoenix offers fans the opportunity to wield a wand, explore all around Hogwarts, and experience one of the most exciting and dangerous years in the life of the Boy Who Lived. [Electronic Arts / Warner Bros.]… Expand"}, {"name": "Voltron: Defender of the Universe", "details_link": "https://www.metacritic.com/game/playstation-3/voltron-defender-of-the-universe", "publisher": "THQ", "release_date": "Nov 29 2011", "developers": ["Behaviour Interactive"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "5  Online", "genres": ["Action", "General", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/57b3e48501fa33dfb8ecfaf6f69b6f62-98.jpg", "descriptions": "THQ gives the giant robot TV franchise its first major gaming adaptation to go along with new animated series."}, {"name": "187 Ride or Die", "details_link": "https://www.metacritic.com/game/playstation-2/187-ride-or-die", "publisher": "Ubisoft", "release_date": "Aug 23 2005", "developers": ["Ubisoft"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Driving", "Car Combat"], "meta_score": 52, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/8f34f4f07d7c0f31ead9482e874bf42a-98.jpg", "descriptions": "187 Ride or Die is an urban-themed combat racing game that plunges players into a brutal street-racing gang war where victory depends on ruthless driving and deadly shooting skills. THe game features the voices and likenesses of Larenz Tate (\"Menace II Society\"), Noel Gugliemi (\"Training187 Ride or Die is an urban-themed combat racing game that plunges players into a brutal street-racing gang war where victory depends on ruthless driving and deadly shooting skills. THe game features the voices and likenesses of Larenz Tate (\"Menace II Society\"), Noel Gugliemi (\"Training Day,\" \"The Fast and the Furious\"), and Guerilla Black. 187 Ride or Die tells the story of a reluctant urban hero named Buck (L. Tate), a young man living a thug's life seething with money, fast cars and beautiful women -- with danger lurking around every corner. Set in the underworld of Los Angeles, Buck must defend the territory of his mentor Dupree (G. Black) from a menacing nemesis and his gang of bandit roughriders, led by Cortez (N. Gugliemi), who are determined to take control of the streets. The game features Adrenaline-Pumping Combat-Racing Action: Put your pedal to the metal as you literally blow your opponent away in non-stop, intense and unique combat-racing action intensified with replay and slow-motion camera effects, and spectacular blur and filter effects. Select from a number of unique vehicles ranging from vintage roadsters to modern muscle cars in your quest to rule the streets. Strapped to the Nines: Put your hand on the pump and take out the opposition with numerous weapons, including an array of pistols, shotguns, and much more. [Ubisoft]… Expand"}, {"name": "Sniper: Ghost Warrior 2", "details_link": "https://www.metacritic.com/game/playstation-3/sniper-ghost-warrior-2", "publisher": "City Interactive", "release_date": "Mar 12 2013", "developers": ["City Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 52, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/49158b6fe6a6a2ab5208396d134892a1-98.jpg", "descriptions": "Takes the bulls-eye precision of its predecessor to new heights.  Powered by the CryENGINE 3 engine, the missions of Sniper: Ghost Warrior 2 are graphically advanced and more challenging as you once again step into the ghillie suit of a special ops sniper to take down the enemy."}, {"name": "Judge Dredd: Dredd VS Death", "details_link": "https://www.metacritic.com/game/playstation-2/judge-dredd-dredd-vs-death", "publisher": "Evolved Games", "release_date": "Feb 24 2005", "developers": ["Rebellion"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 52, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/9931dcee1ff084c5cba91909d6fedc8a-98.jpg", "descriptions": "It is the third decade of the 22nd century. Unemployment is endemic, boredom is universal and only the Judges can prevent total anarchy? Empowered to dispense instant justice, they are judge, jury and executioner all in one. The most feared and respected of all the Judges is Dredd ? he isIt is the third decade of the 22nd century. Unemployment is endemic, boredom is universal and only the Judges can prevent total anarchy? Empowered to dispense instant justice, they are judge, jury and executioner all in one. The most feared and respected of all the Judges is Dredd ? he is the Law! In the darkest depths of Mega-City One a group calling themselves the Death Cult are devising a fiendish plan to free the evil Dark Judges from their holding chamber in a Justice Department penitentiary. Meanwhile the Judges of PSI Division have foreseen that the Big Meg will be blighted by a terrible plague. Soon enough, as predicted, there are outbreaks of vampirism across the city. Is this the return of some ancient, forgotten evil? [Vivendi Universal]… Expand"}, {"name": "Lost: Via Domus", "details_link": "https://www.metacritic.com/game/pc/lost-via-domus", "publisher": "Ubisoft", "release_date": "Feb 26 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 52, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/b3dae2f44b70ccc973ce89614f82fcd2-98.jpg", "descriptions": "After Oceanic Air flight 815 tore apart in mid-air and crashed on a seemingly deserted Pacific island, its survivors were forced to find inner strength they never knew they had in order to survive. The band of friends, family, enemies and strangers has become reluctant heroes who must workAfter Oceanic Air flight 815 tore apart in mid-air and crashed on a seemingly deserted Pacific island, its survivors were forced to find inner strength they never knew they had in order to survive. The band of friends, family, enemies and strangers has become reluctant heroes who must work together against the cruel weather and harsh terrain if they want to stay alive. Danger and mystery loom behind every corner on the island, and those they thought could be trusted may turn against them. Even heroes have secrets. [Ubisoft]… Expand"}, {"name": "Beijing 2008: The Official Video Game of the Olympic Games", "details_link": "https://www.metacritic.com/game/pc/beijing-2008-the-official-video-game-of-the-olympic-games", "publisher": "Sega", "release_date": "Aug  4 2008", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 52, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/5b93a1bc0ca346ff74b5571564036139-98.jpg", "descriptions": "The online functionality of all three platforms ensures that for the very first time, fans of the Olympic Games can experience the thrill of competing against other gamers across the globe in the world’s greatest sporting event. Beijing 2008 is a simulation of over 35 events from the BeijingThe online functionality of all three platforms ensures that for the very first time, fans of the Olympic Games can experience the thrill of competing against other gamers across the globe in the world’s greatest sporting event. Beijing 2008 is a simulation of over 35 events from the Beijing 2008 Olympic Games and allows gamers to experience the thrill of competing in many of the official venues ranging from the famous Beijing National Stadium (the \"Bird Nest\") to the National Aquatics Center (the \"Water Cube\"). In addition, Beijing 2008 incorporates innovative control schemes that allow novice gamers to learn how to play the game, while providing experienced gamers the chance to set new records. Through the addition of online gameplay and a variety of game modes never seen in an official video game of the Olympic Games before, Beijing 2008 truly allows gamers to experience the \"Olympic Spirit. [Sega]… Expand"}, {"name": "Hellpoint", "details_link": "https://www.metacritic.com/game/switch/hellpoint", "publisher": "Merge Games", "release_date": "Feb 25 2021", "developers": ["Cradle Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 52, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/b040c1a874a998873f4f78dd74fd8f3c-98.jpg", "descriptions": "Hellpoint is an intense action RPG taking place on Irid Novo, a derelict space station soaked in an intoxicating dark sci fi atmosphere. Fight dreadful creatures, face the Cosmic Gods and unravel their twisted story. Should the challenge be too great, play with a friend in local or online coop."}, {"name": "Back in 1995", "details_link": "https://www.metacritic.com/game/pc/back-in-1995", "publisher": "Degica", "release_date": "Apr 28 2016", "developers": ["Throw the Warped Code Out"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 52, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/fa8b83edfde75586d687ed86c118977d-98.jpg", "descriptions": "A throwback to the survival horror and mystery games of the original Playstation, Back in 1995 re-creates everything from this forgotten era of games."}, {"name": "South Park: Tenorman's Revenge", "details_link": "https://www.metacritic.com/game/xbox-360/south-park-tenormans-revenge", "publisher": "Other Ocean Interactive", "release_date": "Mar 30 2012", "developers": ["Other Ocean Interactive"], "platforms": "Xbox 360", "genres": ["Action", "General", "General"], "meta_score": 52, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/2f6a79216900dd1e99527d1c070490f3-98.jpg", "descriptions": "Scott Tenorman is back and he wants revenge! Help Cartman, Kyle, Stan and Kenny take on Tenorman and his army of Ginger robots before they destroy South Park! Suit up as the boys' superhero alter-egos to track Scott and his evil forces through time and space in this exciting platformer. It'sScott Tenorman is back and he wants revenge! Help Cartman, Kyle, Stan and Kenny take on Tenorman and his army of Ginger robots before they destroy South Park! Suit up as the boys' superhero alter-egos to track Scott and his evil forces through time and space in this exciting platformer. It's the ultimate fight to save South Park!… Expand"}, {"name": "KAO the Kangaroo", "details_link": "https://www.metacritic.com/game/game-boy-advance/kao-the-kangaroo", "publisher": "Titus Software", "release_date": "Dec 11 2001", "developers": ["Titus Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 52, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/3061dfa427a5c43b75db19d381cca62e-98.jpg", "descriptions": "It's not entirely unlike Nintendo's Super Mario World, except that it's significantly more dull and frustrating."}, {"name": "Star Trek: New Worlds", "details_link": "https://www.metacritic.com/game/pc/star-trek-new-worlds", "publisher": "Interplay", "release_date": "Sep  7 2000", "developers": ["14 Degrees East"], "platforms": "PC", "num_players": "Up to 3 ", "genres": ["Strategy", "General", "General"], "meta_score": 52, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/764f8d23e2a425825ec03121ebf62a89-98.jpg", "descriptions": "It's time to leave the vastness of space behind and play out your destiny in the biggest land battle this universe has ever known. In Star Trek: New Worlds, you'll experience this classic universe as never seen before -- on land in full 3-D.  [Interplay]"}, {"name": "Sniper: Ghost Warrior 2", "details_link": "https://www.metacritic.com/game/pc/sniper-ghost-warrior-2", "publisher": "City Interactive", "release_date": "Mar 11 2013", "developers": ["City Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 52, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/e986a3ce82928d6b3bcd5d8b94daa1eb-98.jpg", "descriptions": "Sniper: Ghost Warrior 2 takes the precision of its notorious predecessor to new heights.  Powered by the CryENGINE 3 engine, the missions of Ghost Warrior 2 are graphically innovative and more challenging as you once again step into the ghillie suit of a special ops sniper to throw hot leadSniper: Ghost Warrior 2 takes the precision of its notorious predecessor to new heights.  Powered by the CryENGINE 3 engine, the missions of Ghost Warrior 2 are graphically innovative and more challenging as you once again step into the ghillie suit of a special ops sniper to throw hot lead at the enemy.… Expand"}, {"name": "Yu-Gi-Oh! Zexal: World Duel Carnival", "details_link": "https://www.metacritic.com/game/3ds/yu-gi-oh!-zexal-world-duel-carnival", "publisher": "Konami", "release_date": "Sep 25 2014", "developers": ["Konami"], "platforms": "3DS", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle"], "meta_score": 52, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/1c58fa434c4c72ccb0ff52983173b8a3-98.jpg", "descriptions": "Play as yourself or one of eleven playable characters from the series, like Yuma, Astral, Tori, Shark and more, each with their own storyline and earn an invite to the World Duel Carnival where you can battle with more than 40 Duelists from the TV show! Players can enjoy a Story Mode and aPlay as yourself or one of eleven playable characters from the series, like Yuma, Astral, Tori, Shark and more, each with their own storyline and earn an invite to the World Duel Carnival where you can battle with more than 40 Duelists from the TV show! Players can enjoy a Story Mode and a Free Duel Mode where they can play with more than 5,700 cards.\r -The very first Yu-Gi-Oh! ZEXAL video game and the first Yu-Gi-Oh! video game available for the Nintendo 3DS handheld system.\r-Twelve playable characters, each with a unique storyline that can be experienced through Story Mode.\r-Battle with more than 40 colorful Duelists.\r-Customize your Deck with more than 5,700 cards from the official Yu-Gi-Oh! TRADING CARD GAME.\r-In-game animated cinematics, and exciting Monster summon effects bring Duels to life.\r-Explore all the options in Free Duel Mode and customize card sleeves, game mats, and even Deck Lists to Duel for hours.… Expand"}, {"name": "Escape Dead Island", "details_link": "https://www.metacritic.com/game/pc/escape-dead-island", "publisher": "Deep Silver", "release_date": "Nov 18 2014", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Third-Person", "Modern"], "meta_score": 52, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/5/d25f48b10454edda7188f486dacd41c8-98.jpg", "descriptions": "Zombies are an even bigger threat now that you’re playing as a character that is no longer immune. You must be on the lookout for not only Shamblers, but also other new and familiar zombie types that are even more dangerous. Do not forget to take pictures of each type, but be careful thatZombies are an even bigger threat now that you’re playing as a character that is no longer immune. You must be on the lookout for not only Shamblers, but also other new and familiar zombie types that are even more dangerous. Do not forget to take pictures of each type, but be careful that you do not get bitten when you do.… Expand"}, {"name": "Rygar: The Battle of Argus", "details_link": "https://www.metacritic.com/game/wii/rygar-the-battle-of-argus", "publisher": "Tecmo", "release_date": "Jan 28 2009", "developers": ["Tecmo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 52, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/84bcfb09694b0d0a437adc6d36e8b585-98.jpg", "descriptions": "Grab your \"Diskarmor\" and swing into action on the Wii as the legendary warrior, Rygar! Immerse yourself in Greco-Roman mythology as you journey through the sundered Island of Argus. Intuitive use of the Wii Remote allows you to deftly and effectively control the use of the powerfulGrab your \"Diskarmor\" and swing into action on the Wii as the legendary warrior, Rygar! Immerse yourself in Greco-Roman mythology as you journey through the sundered Island of Argus. Intuitive use of the Wii Remote allows you to deftly and effectively control the use of the powerful Diskarmor to destroy enemies and maneuver on, around, over, and under obstacles to save Princess Harmonia! [Tecmo]… Expand"}, {"name": "Need for Speed Undercover", "details_link": "https://www.metacritic.com/game/psp/need-for-speed-undercover", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["Piranha Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "PSP"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 52, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/d7fcf65f06b2295f10b45ff71cc3a698-98.jpg", "descriptions": "Need for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a uniqueNeed for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a unique technology that generates incredible high-performance moves at 180 miles per hour during breathtaking highway battles. A mix of computer graphics and live-action movies immerses gamers in the rich world of the Tri-City Bay Area. The city’s open-world environment features over 80 miles of roads, including an enormous highway system that sets the stage for highway battles. These high-speed, high-stake chase sequences push players to the limit as they fight off cops and opponents while whipping through traffic at 180 miles per hour. An intelligent new A.I. mechanic delivers a realistic and high-energy action driving experience. Going back to the franchise’s roots, Need for Speed Undercover features more aggressive and intelligent cops whose sole purpose is to take down the player quickly and by any means necessary. Need for Speed Undercover also features the series' signature car customization, real-world damage and realistic driving physics. The game includes some of the hottest licensed cars such as the Audi R8, BMW M6 and Lexus IS-F. [Electronic Arts]… Expand"}, {"name": "Strobophagia | Rave Horror", "details_link": "https://www.metacritic.com/game/pc/strobophagia-rave-horror", "publisher": "Green Tile Digital", "release_date": "Oct 28 2020", "developers": ["Green Tile Digital"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/50e3913fb91d4d73cf215b4297b087f3-98.jpg", "descriptions": "An occult forest rave. Strange rituals. Enigmatic organiser. An ancient evil. Pure Psychedelic Horror"}, {"name": "Worlds of Magic", "details_link": "https://www.metacritic.com/game/pc/worlds-of-magic", "publisher": "Wastelands Interactive", "release_date": "Sep 20 2014", "developers": ["Wastelands Interactive"], "platforms": "PC", "genres": ["General", "Strategy", "Miscellaneous", "Turn-Based", "General", "4X"], "meta_score": 52, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/8c79b5161f7e2347483f5873140dcecf-98.jpg", "descriptions": "Worlds of Magic is a 4X turn-based strategy game. Players explore and conquer a vast variety of procedurally generated universes, using military and magical power to overcome their foes. Found cities, raise armies, research and cast spells, hire powerful heroes, and create powerful magicalWorlds of Magic is a 4X turn-based strategy game. Players explore and conquer a vast variety of procedurally generated universes, using military and magical power to overcome their foes. Found cities, raise armies, research and cast spells, hire powerful heroes, and create powerful magical artifacts. … Expand"}, {"name": "Jaws Unleashed", "details_link": "https://www.metacritic.com/game/playstation-2/jaws-unleashed", "publisher": "Majesco Games", "release_date": "May 23 2006", "developers": ["Appaloosa Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 52, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/2676f286b1b08ddb74c0276738fce74c-98.jpg", "descriptions": "In Majesco's Jaws, players assume the role of a Great White shark driven to a predacious frenzy by the sonic emanations of underwater oil drilling equipment. To defend their underwater territory, players undertake a campaign to drive the raiders away while simultaneously solving a series ofIn Majesco's Jaws, players assume the role of a Great White shark driven to a predacious frenzy by the sonic emanations of underwater oil drilling equipment. To defend their underwater territory, players undertake a campaign to drive the raiders away while simultaneously solving a series of action-based puzzles designed to thwart the player. Taking the game to realistic heights is Appaloosa's advanced game engine that produces stunning underwater visuals and realistic physics that enable the Great White to perform a variety of leaping, twisting assaults, thus rendering havens such as dive platforms and boats vulnerable to attack. [Majesco]… Expand"}, {"name": "Resident Evil: Operation Raccoon City", "details_link": "https://www.metacritic.com/game/playstation-3/resident-evil-operation-raccoon-city", "publisher": "Capcom", "release_date": "Mar 20 2012", "developers": ["Slant Six"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Shooter", "Sci-Fi", "Action", "Action Adventure", "Horror", "Horror", "Shooter", "Third-Person", "Arcade"], "meta_score": 52, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/a690bf9d6c8dc15d944fd8bd4c9e688b-98.jpg", "descriptions": "It is September 1998 and the action centres on the ill-fated Raccoon City and the horrific consequences of the deadly T-virus outbreak, developed at the Umbrella facility. With a cover up required, Umbrella orders an elite team into Raccoon City to destroy all evidence of the outbreak andIt is September 1998 and the action centres on the ill-fated Raccoon City and the horrific consequences of the deadly T-virus outbreak, developed at the Umbrella facility. With a cover up required, Umbrella orders an elite team into Raccoon City to destroy all evidence of the outbreak and eliminate any survivors. Meanwhile, the US Government has quarantined the city and dispatched its own team of elite soldiers to determine the source of the mysterious outbreak. You are an Umbrella Security Services soldier (U.S.S.), competing alone or in up to four player co-op in a battle against all the competing forces at play in Raccoon City. Expect the return of original Resident Evil enemies, iconic landmarks such as the Raccoon City Police Department and fan favourite characters, including Leon S. Kennedy, who, as a rookie police officer in Raccoon City, is on your hit list to eliminate. Three Corner Conflict: Bio-Organic Weapons (B.O.W) and zombies create an unpredictable third force and additional challenge on the battlefield, adding chaos to the shooter game play. Campaign Mode - both single player and up to 4 player co-op: You are part of the Umbrella Security Service. Protect the truth behind the T-Virus outbreak by any means necessary. Fight Online: Robust and fully featured online multiplayer modes. Define your Play Style: Gain new abilities and skills unique to your playable character as your experience level increases. International Team Development: a high quality, fully loaded, third person co-op / multiplayer shooter developed in collaboration between Capcom Japan development studios and an experienced Western multiplayer specialist studio. [Capcom]… Expand"}, {"name": "Auto Modellista", "details_link": "https://www.metacritic.com/game/xbox/auto-modellista", "publisher": "Capcom", "release_date": "Jan 20 2004", "developers": ["Capcom"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-8 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 52, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/4ffd2e0a178ffad5bab21f9e7b50e65c-98.jpg", "descriptions": "Handle the road like a pro with your own customizable racing machine or your choice of more than 60 top-of-the-line models. Race vehicles from manufacturers, including Toyota, Nissan, Honda, Subaru, and Mitsubishi, against up to eight drivers online or up to two drivers in split-screen mode.Handle the road like a pro with your own customizable racing machine or your choice of more than 60 top-of-the-line models. Race vehicles from manufacturers, including Toyota, Nissan, Honda, Subaru, and Mitsubishi, against up to eight drivers online or up to two drivers in split-screen mode. You'll tear past spectators, maneuver your way through tight mountain passes, and round each corner of the race track in your dream car at lightning speeds. … Expand"}, {"name": "Pax Romana", "details_link": "https://www.metacritic.com/game/pc/pax-romana", "publisher": "DreamCatcher Interactive", "release_date": "Nov  6 2003", "developers": ["Galilea Multimedia"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 52, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/4123b3b143e8be16eba3fd1b704ba2a4-98.jpg", "descriptions": "Pax Romana is an historical strategy game set in ancient Rome. There are two sides to this epic game ? political and strategic. The strategic side is very much a battle of cunning and well-planned military tactics, whereas the political side involves the manipulation of senators and generalsPax Romana is an historical strategy game set in ancient Rome. There are two sides to this epic game ? political and strategic. The strategic side is very much a battle of cunning and well-planned military tactics, whereas the political side involves the manipulation of senators and generals alike, as politicians seek to gain military and financial power. Both sides to the game require sharp wits and the ability to manipulate one?s peers, especially in the multi-player version. The game features an intelligent and intuitive interface with five real time game speeds and multiplayer functionality for up to 6 players. Ultimately the victor is the player who uses his political influence, wealth or military force to become the leader of Rome ? and then only if Rome herself is victorious! [DreamCatcher]… Expand"}, {"name": "Seven Games of the Soul", "details_link": "https://www.metacritic.com/game/pc/seven-games-of-the-soul", "publisher": "Cryo Interactive", "release_date": "Nov 30 2000", "developers": ["Arxel Tribe"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 52, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/7/72d994b8ce9cb6ede43476cb471ac49f-98.jpg", "descriptions": "The real problem with Seven Games of the Soul is that it's not only nonsensical, but it's also pretentious."}, {"name": "Leisure Suit Larry: Wet Dreams Don't Dry", "details_link": "https://www.metacritic.com/game/switch/leisure-suit-larry-wet-dreams-dont-dry", "publisher": "Assemble Entertainment", "release_date": "Jun 13 2019", "developers": ["CrazyBunch"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 52, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/a17795f58dd177a6a3e09f1698c2663c-98.jpg", "descriptions": "Hey ladies, I’m back in business! My new adventure, Leisure Suit Larry - Wet Dreams Don’t Dry, takes me – whatever the route or twist of fate – from the end of the ’80s directly into the 21st century and wow, how the world has changed."}, {"name": "Blades of Time", "details_link": "https://www.metacritic.com/game/xbox-360/blades-of-time", "publisher": "Konami", "release_date": "Mar  6 2012", "developers": ["Gaijin Entertainment"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 52, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/1a0244e44bb9959dc12f131f88fc7afc-98.jpg", "descriptions": "In Blades of Time, players don the persona of the gorgeous gunsword-wielding treasure hunter, Ayumi. Blessed with beauty and a trigger happy finger, she's on a mission to find lost bounties in a mysterious and dangerous island. Quickly, she learns this island isn't just trees, berries andIn Blades of Time, players don the persona of the gorgeous gunsword-wielding treasure hunter, Ayumi. Blessed with beauty and a trigger happy finger, she's on a mission to find lost bounties in a mysterious and dangerous island. Quickly, she learns this island isn't just trees, berries and gold – but something more sinister lies beneath the surface. As the wonderment of the island becomes to reveal itself, she learns this land can gift her powers man can only dream of, but also she's not alone on this island! Thank goodness she brought her own weapons. Ayumi then proceeds to battle against menacing villains on the island by destroying them and everything in her path while looking to acquire magical powers that only the strongest warrior can possess.… Expand"}, {"name": "Crescent Pale Mist", "details_link": "https://www.metacritic.com/game/playstation-3/crescent-pale-mist", "publisher": "Sony Online Entertainment", "release_date": "Nov  9 2010", "developers": ["Rockin' Android"], "platforms": "PlayStation 3", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 52, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/e9c3393566cb5c53cee3e204e1168c59-98.jpg", "descriptions": "In the beautiful and explosive side-scrolling dimension of Gasyukal, players must control mysterious and volatile magic to charge through six chapters of non-stop action battles.  Only players who maneuver the twists and turns through levels of would-be assassins, powerful sorcerers andIn the beautiful and explosive side-scrolling dimension of Gasyukal, players must control mysterious and volatile magic to charge through six chapters of non-stop action battles.  Only players who maneuver the twists and turns through levels of would-be assassins, powerful sorcerers and supernatural monstrosities can save the world!… Expand"}, {"name": "Gangs of London", "details_link": "https://www.metacritic.com/game/psp/gangs-of-london", "publisher": "SCEA", "release_date": "Oct  3 2006", "developers": ["SCEE London Studio"], "platforms": "PSP", "num_players": "1-5 ", "genres": ["Action Adventure", "Adventure", "Third-Person", "Open-World", "Modern", "Modern"], "meta_score": 52, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/d650310b2f06243729061794d1777861-98.jpg", "descriptions": "Action meets strategy as you take on London's fiercest gangs in a bid for domination of the capital. With the opportunity to play as one of five gangs, you have to use brains and brawn to overcome the rival criminal factions and gain control of the city's underworld. Become the guv'nor ofAction meets strategy as you take on London's fiercest gangs in a bid for domination of the capital. With the opportunity to play as one of five gangs, you have to use brains and brawn to overcome the rival criminal factions and gain control of the city's underworld. Become the guv'nor of the Cockney, Triad, Yardie, Russian or Pakistani gangs and take on the capital over a number of unique and challenging game modes: Core Action Game - Choose the gang you want to lead, be prepared to fight dirty and use your head to stay one step ahead of the competition. Each mission is separated with stunning graphic-novel style narratives that guide you through the background story of criminal masterminds fighting for the right to be called Mr Big - London's number one gangster. Gangs of London also offers a turn-based strategy game which brings something completely new to PSP. Using a combination of skill, nerve and chance, gamers can take on up to four other gamers on a single PSP - or compete against the PSP controlled AI. Free Roaming mode allows you to explore and tackle the streets of London on your own terms – take your pick of character, vehicle, weapons, mission objectives, weather conditions and police levels, but be careful when exploring enemy turf. [SCEE]… Expand"}, {"name": "Anima: Gate of Memories", "details_link": "https://www.metacritic.com/game/playstation-4/anima-gate-of-memories", "publisher": "Edge Entertainment", "release_date": "Jun  7 2016", "developers": ["Edge Entertainment", "Anima Project"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 52, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/dec2c5e101ffed9c73ca4152751852fe-98.jpg", "descriptions": "Anima Gate of Memories is a third person action RPG in which the player will explore a vast world filled with dangers and wonders. In it you take control of two characters who are trap in a war in the shadows, a secret conflict that will engulf the world into chaos."}, {"name": "Crystal Defenders", "details_link": "https://www.metacritic.com/game/xbox-360/crystal-defenders", "publisher": "Square Enix", "release_date": "Mar 11 2009", "developers": ["TOSE"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Simulation", "General", "General"], "meta_score": 52, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/6cb776f6a57a68019e4cdfdb6993d193-98.jpg", "descriptions": "[Xbox Live Arcade]  Protect your party's crystals from encroaching monster hordes in Crystal Defenders, a defensive strategy game featuring characters from Final Fantasy Tactics A2. Deploy your various units in strategic locations to prevent the enemy from escaping the area with your[Xbox Live Arcade]  Protect your party's crystals from encroaching monster hordes in Crystal Defenders, a defensive strategy game featuring characters from Final Fantasy Tactics A2. Deploy your various units in strategic locations to prevent the enemy from escaping the area with your crystals. Favorite characters: Popular characters such as Black Mages and Soldiers are used from Final Fantasy Tactics A2. Use them to protect your crystals. Tons of gameplay: Over 300 stages of action are included with three different game versions. Try W1 to learn game basics, W2 where Power Crystals are introduced for deeper, more detailed strategies, and W3 that features complex maps and fierce monsters to challenge even the most seasoned players. Fun and intuitive: The simple, multi-faceted game system is easy for a novice to pick up, and hard for a veteran to put down. [Square Enix]… Expand"}, {"name": "WinBack 2: Project Poseidon", "details_link": "https://www.metacritic.com/game/xbox/winback-2-project-poseidon", "publisher": "Koei", "release_date": "Apr 25 2006", "developers": ["Cavia Inc."], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/2fd16ad7f7364b65df1b3b18d8880b64-98.jpg", "descriptions": "In a world where terror takes many forms, a new weapon threatens to shake the balance of power. Freedom's last hope rests in the hands of three new operatives, who must race against time to recover this doomsday device. The fate of the world hangs by a thread, and a few ticks of the clockIn a world where terror takes many forms, a new weapon threatens to shake the balance of power. Freedom's last hope rests in the hands of three new operatives, who must race against time to recover this doomsday device. The fate of the world hangs by a thread, and a few ticks of the clock means the difference between justice and annihilation. WINBACK 2 brings to the series a new \"route\" system that lets players experience each mission from the perspective of different operatives. There are 30 intense missions, multiple difficulty levels, and new weapons including the highly-anticipated sniper rifle. The new Winback assault team is comprised of three young, yet combat-proven operatives led by Craig Contrell. Each team member is qualified in six different weapon types and highly-adept at CQB (Close Quarter Battle). They are masters of target identification, engagement and shot placement. In the hands of the player, all of these techniques will be put to the test. The game's unique shooting action is spread across 30 high-risk operations situated in challenging urban environments and conveyances.… Expand"}, {"name": "Spare Parts", "details_link": "https://www.metacritic.com/game/xbox-360/spare-parts", "publisher": "Electronic Arts", "release_date": "Jan 19 2011", "developers": ["EA Bright Light"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/4e176746444d9f208298f57b38570641-98.jpg", "descriptions": "Spare Parts tells the story of courageous robots Mar-T and Chip, who find themselves dumped out with the trash on a strange planet. Working together in co-op mode (either local or online), the mechanical duo must find a way to repair an abandoned space ship and escape the planet before evilSpare Parts tells the story of courageous robots Mar-T and Chip, who find themselves dumped out with the trash on a strange planet. Working together in co-op mode (either local or online), the mechanical duo must find a way to repair an abandoned space ship and escape the planet before evil Lord Krung can dispatch his henchmen to destroy them. Searching the hostile environments for ship parts and currency, Mar-T and Chip will also collect upgradable action parts – such as Rocket Boots -  to unlock new abilities that will aid them as they rescue other stranded robots, and battle countless enemies including the relentless Krofax troopers, hostile spider monkeys and even a Super Huge Mega Laser!… Expand"}, {"name": "SoulCalibur Legends", "details_link": "https://www.metacritic.com/game/wii/soulcalibur-legends", "publisher": "Namco Bandai Games America", "release_date": "Nov 20 2007", "developers": ["Namco Bandai Games"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 52, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/94796a3006bd130076a4da4ce0bcc56b-98.jpg", "descriptions": "In Soulcalibur Legends, follow the 16th century exploits of Siegfried and Soulcalibur characters, new and old as they find themselves on a quest for ultimate power in order to save an empire from destruction. Using the Wii Remote and Nunchuk as their weapons of choice, players perform movesIn Soulcalibur Legends, follow the 16th century exploits of Siegfried and Soulcalibur characters, new and old as they find themselves on a quest for ultimate power in order to save an empire from destruction. Using the Wii Remote and Nunchuk as their weapons of choice, players perform moves and combos using orchestrated slashes and movements. Sword fighting capabilities are pushed to the limit as gamers unleash special attacks to crush scores of enemies and large bosses. Earn honored titles such as Knight or Soldier as you master special attacks acquired throughout the adventure while battling through diverse stages and environments. [Namco Bandai Games]… Expand"}, {"name": "Commandos 2 HD Remaster", "details_link": "https://www.metacritic.com/game/switch/commandos-2-hd-remaster", "publisher": "Kalypso", "release_date": "Dec  4 2020", "developers": ["Yippee Entertainment LTD"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 52, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/6/e82c4d315d35894b8718b941b1b13fee-98.jpg", "descriptions": "Relive the real-time tactics masterpiece that defined the genre like no other: Originally developed by the legendary Pyro Studios, Commandos 2 - HD Remaster is a true homage to one of gaming's most celebrated masterpieces. Experience Commandos 2 Men of Courage like never before in highRelive the real-time tactics masterpiece that defined the genre like no other: Originally developed by the legendary Pyro Studios, Commandos 2 - HD Remaster is a true homage to one of gaming's most celebrated masterpieces. Experience Commandos 2 Men of Courage like never before in high definition with reworked controls, UI and tutorial.Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of notoriously demanding missions set in World War II. Go covert into various environments based on authentic World War II locations and lead your team of commandos against overwhelming odds, operate covertly and turn the tide of war.… Expand"}, {"name": "Last Encounter", "details_link": "https://www.metacritic.com/game/switch/last-encounter", "publisher": "Exordium Games", "release_date": "Feb 21 2020", "developers": ["Exordium Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/74b22b9967980d3d567ea8356de297f1-98.jpg", "descriptions": "Last Encounter is a twin-stick action roguelite in deep space following a group of heroes trying to prevent the unavoidable by cloning their ships and designing their weapons with swappable components."}, {"name": "Fimbul", "details_link": "https://www.metacritic.com/game/playstation-4/fimbul", "publisher": "EuroVideo Medien", "release_date": "Feb 28 2019", "developers": ["Zaxis"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 52, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/6/709e494d388d4142db5ae96266ce23e8-98.jpg", "descriptions": "Fimbul combines intense Viking battles with a deep story that unfolds through in-game comics to bring the frozen world of the Norse sagas to life. Immerse yourself in the blistering winter preceding Ragnarok — The Fimbul Winter."}, {"name": "Unbox: Newbie's Adventure", "details_link": "https://www.metacritic.com/game/switch/unbox-newbies-adventure", "publisher": "Merge Games", "release_date": "Nov 21 2017", "developers": ["Prospect Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 52, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/16f8fa549c895b44174b99a5eb282147-98.jpg", "descriptions": "Unbox is a 90s style 3D platformer about the ultimate postal service, self-delivering cardboard boxes! Unbox has giant worlds full of challenges, collectibles and boxy boss battles!"}, {"name": "Warhammer 40,000: Eternal Crusade", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-eternal-crusade", "publisher": "Bandai Namco Games", "release_date": "Sep 23 2016", "developers": ["Behaviour Interactive Inc.", "Behaviour Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 52, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/2/f99dcf99a37f200a98fd6e8f976dea7c-98.jpg", "descriptions": "Warhammer 40,000: Eternal Crusade features a persistent world where players must choose from one of four factions and work together to take down opposing forces."}, {"name": "TerRover", "details_link": "https://www.metacritic.com/game/playstation-3/terrover", "publisher": "Sony Online Entertainment", "release_date": "Sep  7 2010", "developers": ["Creat Studios"], "platforms": "PlayStation 3", "genres": ["Driving", "Racing", "Rally / Offroad", "Rally / Offroad"], "meta_score": 52, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/a8648e004f99d19585b0649c802e480b-98.jpg", "descriptions": "TerRover launches players into a surreal mash-up of unique cartoon graphics and a 2-D physics universe available exclusively on the PlayStation Network. TerRoverâ€™s gameplay is based on navigating a terrain rover through over forty stages of puzzling arcade levels in five differentTerRover launches players into a surreal mash-up of unique cartoon graphics and a 2-D physics universe available exclusively on the PlayStation Network. TerRoverâ€™s gameplay is based on navigating a terrain rover through over forty stages of puzzling arcade levels in five different vivid 2-D art styles including the icy vistas of Congelata, the all-tech surfaces of Mechanica, the strange vegetation and terrains of Acor and Aura, and the treacherous volcanoes and lava of Volcanus! Drivers must use the vehicleâ€™s wheel rotation, pivot center, gravity system and various weapons to overcome challenging obstacles and barriers. TerRover features three local multiplayer modes for up to four people, leaderboards and PlayStation Network trophies.… Expand"}, {"name": "Ant Nation", "details_link": "https://www.metacritic.com/game/wii/ant-nation", "publisher": "Konami", "release_date": "Jul 13 2009", "developers": ["Kouyousha"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Strategy", "General", "Real-Time", "General"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/9e85563bba8a36aa841f1781e078708a-98.jpg", "descriptions": "[WiiWare]  The beloved childhood pastime of lazy Sundays spent with a magnifying glass and an ant farm finally arrives in its most mischievous form via the WiiWare service. You must train your colony of Super Ants using a devilishly fun toolset. Zap, torch and manipulate your ants to make[WiiWare]  The beloved childhood pastime of lazy Sundays spent with a magnifying glass and an ant farm finally arrives in its most mischievous form via the WiiWare service. You must train your colony of Super Ants using a devilishly fun toolset. Zap, torch and manipulate your ants to make them numerous enough and tough enough to survive a variety of increasingly difficult challenges. [Nintendo]… Expand"}, {"name": "Dynasty Warriors: Gundam 2", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-gundam-2", "publisher": "Namco Bandai Games America", "release_date": "Apr 21 2009", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "genres": ["Action", "Beat-'Em-Up"], "meta_score": 52, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/15a3f8e2488ed2a504d481a9b38baafa-98.jpg", "descriptions": "In the future, rebel space colonies launch a brutal war of independence with a series of coordinated orbital strikes against Earth. The chaotic assault signals the dawn of a new age of combat and the ultimate instrument of warfare is born, the Mobile Suit. Dynasty Warriors: Gundam 2 combinesIn the future, rebel space colonies launch a brutal war of independence with a series of coordinated orbital strikes against Earth. The chaotic assault signals the dawn of a new age of combat and the ultimate instrument of warfare is born, the Mobile Suit. Dynasty Warriors: Gundam 2 combines the devastating power of the Mobile Suit, the rich legacy of the Gundam universe and the furious Tactical Action game play of the Dynasty Warriors series. The game thrusts players into incredible battles against legions of enemy Mobile Suits on distant planetary surfaces and in the far reaches of outer space. For the first time, Dynasty Warriors: Gundam 2 lets players engage in melee battles against colossal enemies such as the Psycho Gundam. The massive Psycho Gundam can quickly reconfigure their bodies into titanic mobile fortresses which can move with remarkable speed. However, highly-trained pilots can utilize their own Mobile Suit’s speed, agility, and of course firepower to defeat these deadly juggernauts. Dynasty Warriors: Gundam 2 also includes new stories featuring mecha from the latest Gundam anime, plus mecha from Char’s Counter Attack and more. With mecha parts collected throughout the course of the game, players can adapt a Mobile Suit which can be piloted into combat. [Namco Bandai Games]… Expand"}, {"name": "DreamWorks Over the Hedge: Hammy Goes Nuts!", "details_link": "https://www.metacritic.com/game/ds/dreamworks-over-the-hedge-hammy-goes-nuts!", "publisher": "Activision", "release_date": "Oct 24 2006", "developers": ["Amaze Entertainment"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/c1853cc4349dd26927934b10e6ef662a-98.jpg", "descriptions": "Over the Hedge: Hammy Goes Nuts! is an all-new adventure based on the woodland creatures from DreamWorks Animation's hit film Over the Hedge. Fan favorite Hammy the squirrel leads RJ the raccoon, Verne the turtle and all-new forest friends on another daring trip into the 'burbs. When Hammy’sOver the Hedge: Hammy Goes Nuts! is an all-new adventure based on the woodland creatures from DreamWorks Animation's hit film Over the Hedge. Fan favorite Hammy the squirrel leads RJ the raccoon, Verne the turtle and all-new forest friends on another daring trip into the 'burbs. When Hammy’s beloved cable TV goes out, his buddies have to scramble through the neighborhood to restore the signal - and Hammy’s happiness. [Activision]… Expand"}, {"name": "The Dukes of Hazzard: Return of the General Lee", "details_link": "https://www.metacritic.com/game/playstation-2/the-dukes-of-hazzard-return-of-the-general-lee", "publisher": "Ubisoft", "release_date": "Sep 28 2004", "developers": ["Ratbag"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 52, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/6a59e6169ec9862a1a3065c6661d51d3-98.jpg", "descriptions": "Set in Hazzard County, players step into the shoes of Bo and Luke Duke as they race to win prize money in order to save the local orphanage from Boss Hogg's latest crooked scheme. With the help of the ever-popular Daisy Duke, Uncle Jesse and Cooter, the good ol' boys go up against theSet in Hazzard County, players step into the shoes of Bo and Luke Duke as they race to win prize money in order to save the local orphanage from Boss Hogg's latest crooked scheme. With the help of the ever-popular Daisy Duke, Uncle Jesse and Cooter, the good ol' boys go up against the villainous Boss Hogg, his bumbling cohorts Sheriff Rosco P. Coltrane and Deputy Enos in order to win the Hazzard County Derby. Just like the television show, The Dukes of Hazzard: Return of the General Lee is filled with wild off-road action, gravity-defying stunts and adrenaline-pumping car chases. Dukes World: The game captures all the joyriding thrills and homespun action of the original television show. Dukes Celebrity: Full cast represented from the show, with voice-overs and likenesses from John Schneider (Bo Duke), Tom Wopat (Luke Duke), Catherine Bach (Daisy Duke), James Best (Roscoe P. Coltrane), Ben Jones (Cooter) and Sonny Shroyer (Enos Strate). Variety of Playable Vehicles: Players can control a variety of vehicles including the General Lee, the Black Charger, Uncle Jesse's Pickup, Daisy's Road Runner, Cooter's Tow Truck, Rosco and Enos's Police Cruisers, and Boss Hogg's limousine. Variety of Gameplay: Features a single-player Adventure Mode containing over 18 missions and an unlockable multiplayer mode that features destruction derby battles, head-to-head competition and cooperative play. [Ubisoft]… Expand"}, {"name": "Crouching Tiger, Hidden Dragon", "details_link": "https://www.metacritic.com/game/xbox/crouching-tiger-hidden-dragon", "publisher": "Ubisoft", "release_date": "Dec  9 2003", "developers": ["Genki"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 52, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/a7754b588a306248cc1d7ea444ea5354-98.jpg", "descriptions": "Relive the epic story from the film in the game of Crouching Tiger, Hidden Dragon.  By stepping into the roles of each of the main characters--Li Mu Bai, Yu Shu Lien, Jen, and \"Dark Cloud\" Lo--you can unleash a variety of fighting techniques, weapons, stunts, and moves againstRelive the epic story from the film in the game of Crouching Tiger, Hidden Dragon.  By stepping into the roles of each of the main characters--Li Mu Bai, Yu Shu Lien, Jen, and \"Dark Cloud\" Lo--you can unleash a variety of fighting techniques, weapons, stunts, and moves against brutally gifted enemies.  Characters improve in skill throughout the game, learn new moves, and earn bonuses and rewards as they master the art of Wudan-style fighting.… Expand"}, {"name": "Monsters, Inc.", "details_link": "https://www.metacritic.com/game/playstation-2/monsters-inc", "publisher": "SCEA", "release_date": "Mar 19 2002", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 52, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/5329fc808ed6c5275baeee535016b1e7-98.jpg", "descriptions": "Monsters Inc. is the largest scream processing factory in the monster world. Their patented, state-of-the-art door track delivery system is quick and efficient, automatically connecting a child's closet door to their system so the Scare Team can go in and collect the screams. Enjoy animatedMonsters Inc. is the largest scream processing factory in the monster world. Their patented, state-of-the-art door track delivery system is quick and efficient, automatically connecting a child's closet door to their system so the Scare Team can go in and collect the screams. Enjoy animated antics and chaos across 15 stages in an adventure platformer. Includes enhanced DVD content featuring behind-the-scenes interviews, deleted scenes, Pixar artwork, sketches and short films. [SCEA]… Expand"}, {"name": "Again: Interactive Crime Novel", "details_link": "https://www.metacritic.com/game/ds/again-interactive-crime-novel", "publisher": "Tecmo", "release_date": "Apr  2 2010", "developers": ["Cing"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Edutainment", "Edutainment", "Visual Novel"], "meta_score": 52, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/3767175f82c9534d665fdafee63f8f7f-98.jpg", "descriptions": "Again is an interactive crime novel from the developers of Hotel Dusk and Trace Memory."}, {"name": "Dead Rising 3: Operation Broken Eagle", "details_link": "https://www.metacritic.com/game/xbox-one/dead-rising-3-operation-broken-eagle", "publisher": "Microsoft Game Studios", "release_date": "Jan 21 2014", "platforms": "Xbox One", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 52, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/096495e55c7cfe5932c7baf53ac01d91-98.jpg", "descriptions": "Dead Rising 3: Operation Broken Eagle puts you in control of Spec Ops Commander Adam Kane on a mission that challenges everything he believes â€“ to capture the missing President of the United States while battling the zombie apocalypse. This side story features a new mission, new weapons,Dead Rising 3: Operation Broken Eagle puts you in control of Spec Ops Commander Adam Kane on a mission that challenges everything he believes â€“ to capture the missing President of the United States while battling the zombie apocalypse. This side story features a new mission, new weapons, new vehicle, and more.… Expand"}, {"name": "Seven Samurai 20XX", "details_link": "https://www.metacritic.com/game/playstation-2/seven-samurai-20xx", "publisher": "Sammy Studios", "release_date": "Mar 12 2004", "developers": ["Dimps Corporation"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 52, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/3e093da70ec9ccd47081d04099223ef9-98.jpg", "descriptions": "Inspired by the greatest samurai masterpiece of all time, Seven Samurai 20XX engages players with an experience that combines intense melee-style samurai combat with an epic story that takes the timeless tale into the future. Using a variety of swordplay styles, players employ numerousInspired by the greatest samurai masterpiece of all time, Seven Samurai 20XX engages players with an experience that combines intense melee-style samurai combat with an epic story that takes the timeless tale into the future. Using a variety of swordplay styles, players employ numerous single and double katana attacks and an arsenal of moves that grows with their mastery of the samurai way. Inspired by Akira Kurosawa's classic The Seven Samurai, with involvement from Kurosawa Production and the late director's son, Hisao. Third-person 3D action focused on high-intensity, melee-style combat, with four play modes and adjustable fighting styles. Epic story that takes the timeless tale into the future, with humans facing a treacherous enemy using an army of mechanical beasts and humanoids. 40+ unique characters, with concept and design work by Moebius, legendary Blueberry comic artists and character designer on such films as The Fifth Element and Willow. Opening and ending theme music composed by Ryuichi Sakamoto, Academy Award winning composer on The Last Emperor. [Sammy Studios]… Expand"}, {"name": "Pirates of the Caribbean: Dead Man's Chest", "details_link": "https://www.metacritic.com/game/psp/pirates-of-the-caribbean-dead-mans-chest", "publisher": "Buena Vista Games", "release_date": "Jun 27 2006", "developers": ["Griptonite Games"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 52, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/b5f84f60719c254973dfb7873ba7b2b4-98.jpg", "descriptions": "Players will be able to play as Captain Jack Sparrow, Will Turner and Elizabeth Swann as they explore and brawl across land and sea on a memorable quest in search of the legendary Dead Man's Chest. The game features thrilling moments from the movie and expands the fantasy of the franchise byPlayers will be able to play as Captain Jack Sparrow, Will Turner and Elizabeth Swann as they explore and brawl across land and sea on a memorable quest in search of the legendary Dead Man's Chest. The game features thrilling moments from the movie and expands the fantasy of the franchise by offering exciting new adventures and locations inspired by the rich \"Pirates of the Caribbean\" universe. [Buena Vista Games]… Expand"}, {"name": "Resident Evil: Operation Raccoon City", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-operation-raccoon-city", "publisher": "Capcom", "release_date": "Mar 20 2012", "developers": ["Slant Six"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Shooter", "Sci-Fi", "Action", "Action Adventure", "Horror", "Horror", "Shooter", "Third-Person", "Arcade"], "meta_score": 52, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/bf0eaf800f9cb771cc49f18f0f35877e-98.jpg", "descriptions": "It is September 1998 and the action centres on the ill-fated Raccoon City and the horrific consequences of the deadly T-virus outbreak, developed at the Umbrella facility. With a cover up required, Umbrella orders an elite team into Raccoon City to destroy all evidence of the outbreak andIt is September 1998 and the action centres on the ill-fated Raccoon City and the horrific consequences of the deadly T-virus outbreak, developed at the Umbrella facility. With a cover up required, Umbrella orders an elite team into Raccoon City to destroy all evidence of the outbreak and eliminate any survivors. Meanwhile, the US Government has quarantined the city and dispatched its own team of elite soldiers to determine the source of the mysterious outbreak. You are an Umbrella Security Services soldier (U.S.S.), competing alone or in up to four player co-op in a battle against all the competing forces at play in Raccoon City. Expect the return of original Resident Evil enemies, iconic landmarks such as the Raccoon City Police Department and fan favourite characters, including Leon S. Kennedy, who, as a rookie police officer in Raccoon City, is on your hit list to eliminate. Three Corner Conflict: Bio-Organic Weapons (B.O.W) and zombies create an unpredictable third force and additional challenge on the battlefield, adding chaos to the shooter game play. Campaign Mode - both single player and up to 4 player co-op: You are part of the Umbrella Security Service. Protect the truth behind the T-Virus outbreak by any means necessary. Fight Online: Robust and fully featured online multiplayer modes. Define your Play Style: Gain new abilities and skills unique to your playable character as your experience level increases. International Team Development: a high quality, fully loaded, third person co-op / multiplayer shooter developed in collaboration between Capcom Japan development studios and an experienced Western multiplayer specialist studio. [Capcom]… Expand"}, {"name": "Mighty No. 9", "details_link": "https://www.metacritic.com/game/playstation-4/mighty-no-9", "publisher": "Deep Silver", "release_date": "Jun 21 2016", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 52, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/0/b2648bfffd8ecefd131f96be4622e832-98.jpg", "descriptions": "Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots,Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots, and the only one not infected by a mysterious computer virus that has caused mechanized creatures the world over to go berserk. Run, jump, blast, and transform your way through six stages (or more, via stretch goals) you can tackle in any order you choose, using weapons and abilities stolen from your enemies to take down your fellow Mighty Number robots and confront the final evil that threatens the planet. Once, you worked together, side-by-side but now, your fellow Mighty No. robots have lashed out, taking over key strategic locations across the globe and infesting them with their minions. You have no choice: the other Mighty Numbers...Must. Be. Destroyed.… Expand"}]