[{"name": "Titanfall 2", "details_link": "https://www.metacritic.com/game/pc/titanfall-2", "publisher": "Electronic Arts", "release_date": "Oct 28 2016", "developers": ["Respawn Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/fdf3ea933ba8423141db39d8a6ab6fdd-98.jpg", "descriptions": "In single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. StrandedIn single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. Stranded behind enemy lines and facing overwhelming odds, players must team up with a veteran Titan to uphold a mission they were never meant to carry out. In multiplayer, Respawn is continuing to evolve their gameplay to provide a more robust experience that delivers expanded depth and variety that includes six new Titans, deeper Pilot abilities, more customization options, and a robust progression system that is sure to satisfy fans. [Electronic Arts]… Expand"}, {"name": "Luigi's Mansion: Dark Moon", "details_link": "https://www.metacritic.com/game/3ds/luigis-mansion-dark-moon", "publisher": "Nintendo", "release_date": "Mar 24 2013", "developers": ["Next Level Games"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/6c336951e91de07172e87f507d525760-98.jpg", "descriptions": "(Also known as \"Luigi's Mansion 2\" in the UK/EU) Luigi is back on a mission to remove a bunch of stubborn ghosts from some spooky mansions. Armed with his trusty Poltergust ghost-sucking vacuum cleaner, Mario's brother takes center stage to capture these pesky phantoms."}, {"name": "DJ Hero 2", "details_link": "https://www.metacritic.com/game/xbox-360/dj-hero-2", "publisher": "Activision", "release_date": "Oct 19 2010", "developers": ["FreeStyleGames"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/1f5cd34480069549d68b3eb98dacd413-98.jpg", "descriptions": "Activision's turntable-based rhythm game is coming back for an encore."}, {"name": "Guitar Hero III: Legends of Rock", "details_link": "https://www.metacritic.com/game/wii/guitar-hero-iii-legends-of-rock", "publisher": "Activision", "release_date": "Oct 28 2007", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/29da543825fb1fd42ed69124630294de-98.jpg", "descriptions": "Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses,Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses, The Rolling Stones, Beastie Boys, Muse and Pearl Jam, with added songs as made legendary by Kiss, Alice Cooper and Heart. Now drop that air guitar, tune your exclusive new Les Paul Guitar Controller and shred the night away with Guitar Hero III: Legends of Rock. [Activision]… Expand"}, {"name": "Psychonauts", "details_link": "https://www.metacritic.com/game/playstation-2/psychonauts", "publisher": "Majesco Games", "release_date": "Jun 21 2005", "developers": ["BudCat"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/e72bda8cc74a9b59c256da13f81e0b20-98.jpg", "descriptions": "Psychonauts is a wildly surreal action adventure game where personal paranormal powers are unlocked in order to plunge into the minds of bizarre characters. Journey deep into these crazy worlds of infinite possibility to thwart the secret plan of an evil madman and realize the ultimate dreamPsychonauts is a wildly surreal action adventure game where personal paranormal powers are unlocked in order to plunge into the minds of bizarre characters. Journey deep into these crazy worlds of infinite possibility to thwart the secret plan of an evil madman and realize the ultimate dream of joining an elite force of psychic superheroes, the Psychonauts. Delve into people's minds as Raz, a powerful young cadet at psychic summer camp. While working on his levitation merit badge, Raz discovers that someone is kidnapping psychic children and stealing their brains. In order to foil this evil plot and earn the title of Psychonaut, Raz must project himself into the minds of one bizarre character after another to battle their nightmares and mental demons. He does all this while continuing to earn his psychic merit badges in Telekinesis, Clairvoyance, Pyrokinesis and more.… Expand"}, {"name": "Guitar Hero 5", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-5", "publisher": "Activision", "release_date": "Sep  1 2009", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 86, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/306b6cfe4d3d2f30dd358593592d241f-98.jpg", "descriptions": "For the first time ever, players can customize the make-up of their band by rocking with any combination of instruments in-game: whether it be two guitars and two drums, or three guitars and a microphone, any combination is possible, allowing players to experience music their own way. BrandFor the first time ever, players can customize the make-up of their band by rocking with any combination of instruments in-game: whether it be two guitars and two drums, or three guitars and a microphone, any combination is possible, allowing players to experience music their own way. Brand new, innovative, easy-to-use gameplay modes like Party Play and RockFest put fun, competition and control at center stage as fans tailor the Guitar Hero experience to match their personal style and interests. For extended hours of entertainment, downloadable content from Guitar Hero World Tour is compatible with the game and can automatically be updated to include all of the upgrades and enhancements of Guitar Hero 5. Guitar Hero 5 features the strongest, most varied set list to-date comprised of master tracks from 85 of the hottest bands of today and the biggest classic acts including; Kings of Leon, The Rolling Stones, The White Stripes, Santana, Vampire Weekend, Tom Petty, Johnny Cash, Bob Dylan, plus more than 25 artists from a variety of music genres that are making their music video game debut. Among the first-time-ever features of Guitar Hero 5 are: Party Play, where players can jump in or drop out of gameplay seamlessly; RockFest, a comprehensive competitive experience available featuring five new head-to-head modes playable online or in your living room; and the ability to play the entire set-list from the first time the game is turned on. Guitar Hero 5 refines the player experience, enhances the art style and redesigns core features such as GHMusic StudioSM, making it the most accessible, fun-to-play and authentic experience for seasoned music gamers as well as first-time players. New innovations such as Band Moments, where bands are rewarded for hitting special note streams together and song challenges where gamers are tasked to play through a song a specific way, add a new competitive layer of excitement and accomplishment to the music rhythm genre. [Activision]… Expand"}, {"name": "AI: The Somnium Files", "details_link": "https://www.metacritic.com/game/switch/ai-the-somnium-files", "publisher": "Spike Chunsoft", "release_date": "Sep 17 2019", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 86, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/5a12731da25e43afd8188c34cef6b9d7-98.jpg", "descriptions": "One rainy night in November, a woman's body is found\rat an abandoned theme park, mounted on a\rmerry-go-round horse. She had been stabbed\r\nrepeatedly, and her left eye was gouged out.\r\n\r\nKaname Date of the Metropolitan Police Department\r\narrives on the scene. He recognizes the woman.One rainy night in November, a woman's body is found\rat an abandoned theme park, mounted on a\rmerry-go-round horse. She had been stabbed\rrepeatedly, and her left eye was gouged out.\r Kaname Date of the Metropolitan Police Department\rarrives on the scene. He recognizes the woman.\rSuddenly, a crash rings out through the rain...\r AI: THE SOMNIUM FILES chronicles an investigation\rthrough both dreams and reality.\rA thrilling neo-noir detective adventure following\rDate and his partner is about to unfold.… Expand"}, {"name": "Battlefield 3: Back to Karkand", "details_link": "https://www.metacritic.com/game/pc/battlefield-3-back-to-karkand", "publisher": "Electronic Arts", "release_date": "Dec 13 2011", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/7ab08aa4a0205d4f4a46c1f0942795e8-98.jpg", "descriptions": "Battlefield 3: Back to Karkand is a massive themed expansion pack featuring four of the most loved maps from Battlefield 2, boldly reimagined for Battlefield 3 with the power and destruction of the Frostbite 2 engine. It also gives you classic weapons and vehicles from Battlefield 2, uniqueBattlefield 3: Back to Karkand is a massive themed expansion pack featuring four of the most loved maps from Battlefield 2, boldly reimagined for Battlefield 3 with the power and destruction of the Frostbite 2 engine. It also gives you classic weapons and vehicles from Battlefield 2, unique dog tags, and all-new Assignments.… Expand"}, {"name": "Dragon Quest XI: Echoes of an Elusive Age", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-quest-xi-echoes-of-an-elusive-age", "publisher": "Square Enix", "release_date": "Sep  4 2018", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/1ab6336a882aeeda43b0bcc32a97bd9e-98.jpg", "descriptions": "DRAGON QUEST XI: Echoes of an Elusive Age tells a captivating tale of a hunted hero and is the long-awaited role-playing game from series creator Yuji Horii, character designer Akira Toriyama and composer Koichi Sugiyama. While it is the eleventh mainline entry in the critically acclaimedDRAGON QUEST XI: Echoes of an Elusive Age tells a captivating tale of a hunted hero and is the long-awaited role-playing game from series creator Yuji Horii, character designer Akira Toriyama and composer Koichi Sugiyama. While it is the eleventh mainline entry in the critically acclaimed series, DRAGON QUEST XI is a completely standalone experience that features entirely new characters, a beautifully detailed world, finely tuned turn-based combat, and an immersive story that promises to appeal to longtime fans and franchise newcomers alike.… Expand"}, {"name": "F-Zero: Maximum Velocity", "details_link": "https://www.metacritic.com/game/game-boy-advance/f-zero-maximum-velocity", "publisher": "Nintendo", "release_date": "Jun 12 2001", "developers": ["Nd Cube"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/2e6c7cbc0a89d9217cb85f1a282ad598-98.jpg", "descriptions": "All galactic speed limits are about to be broken! F-Zero® Maximum Velocity has arrived, and the future of racing has never looked so sweet. Brand-new vehicles and Game Boy Advance original tracks await, so whether you're a Super NES® veteran or a race rookies, you'll need someAll galactic speed limits are about to be broken! F-Zero® Maximum Velocity has arrived, and the future of racing has never looked so sweet. Brand-new vehicles and Game Boy Advance original tracks await, so whether you're a Super NES® veteran or a race rookies, you'll need some practice laps. And even if you do master the Grand Prix circuit, you'll still have to beat your friends to the finish line. That's right, race fans--with the Game Boy Advance Game Link® cable you can take on up to three rival racers, so put the pedal to the metal and get busy boosting, bumping and jumping your way to intergalactic glory!… Expand"}, {"name": "Dying Light: The Following", "details_link": "https://www.metacritic.com/game/xbox-one/dying-light-the-following", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  9 2016", "developers": ["Techland"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/94ecc0728c1fd778d0ea52f032ac7e3b-98.jpg", "descriptions": "Dying Light: The Following is a significant expansion to Dying Light and the untold chapter of Kyle Crane’s story. Take to a vast new area that will transform your Dying Light experience through new game mechanics, environments and challenges on top of the established core of the game."}, {"name": "Destiny: The Taken King", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-the-taken-king", "publisher": "Activision", "release_date": "Sep 15 2015", "developers": ["Bungie"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 86, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/2829791388bdce5b47584a334f1f05e0-98.jpg", "descriptions": "To battle the Darkness and the Taken army, players get brand new subclasses with new supers. Warlocks now harness the power of an electric storm, Hunters carve a bow formed from gravitational void energy, and Titans summon a flaming hammer that can sear their adversaries from a range orTo battle the Darkness and the Taken army, players get brand new subclasses with new supers. Warlocks now harness the power of an electric storm, Hunters carve a bow formed from gravitational void energy, and Titans summon a flaming hammer that can sear their adversaries from a range or deliver a devastating melee impact.… Expand"}, {"name": "Heroes of the Storm", "details_link": "https://www.metacritic.com/game/pc/heroes-of-the-storm", "publisher": "Blizzard Entertainment", "release_date": "Jun  2 2015", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Up to 10 ", "genres": ["Action", "Strategy", "Real-Time", "General", "MOBA"], "meta_score": 86, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/f90c162a27d20e49edb93ddcfc0edcaa-98.jpg", "descriptions": "This free-to-play online team brawler assembles a diverse cast of characters from Blizzard’s far-flung realms of science fiction and fantasy, including the Warcraft, StarCraft, and Diablo universes, and challenges them to compete in epic, adrenaline-charged battles. Heroes of the StormThis free-to-play online team brawler assembles a diverse cast of characters from Blizzard’s far-flung realms of science fiction and fantasy, including the Warcraft, StarCraft, and Diablo universes, and challenges them to compete in epic, adrenaline-charged battles. Heroes of the Storm solicits players to customize heroes to suit their style and then team up with friends for some all-out mayhem. The game features an array of gameplay modes for players of every skill level, including Cooperative, in which players team up against computer-controlled opponents, and Quick Match, an accessible way to jump in and play versus others. Experienced players can also join forces against other teams of players in highly competitive, draft-style ranked play. [Blizzard]… Expand"}, {"name": "DiRT 4", "details_link": "https://www.metacritic.com/game/xbox-one/dirt-4", "publisher": "Codemasters", "release_date": "Jun  6 2017", "developers": ["Codemasters", "Deep Silver"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/74a004122927e43816de4ecea1ab88ba-98.jpg", "descriptions": "Dirt 4 puts you at the wheel of the most powerful machines ever made as you face the toughest roads and circuits on the planet in rally, rallycross, and landrush."}, {"name": "Code:Realize - Guardian of Rebirth", "details_link": "https://www.metacritic.com/game/playstation-vita/coderealize---guardian-of-rebirth", "publisher": "Aksys Games", "release_date": "Oct 20 2015", "developers": ["Otomate"], "platforms": ["Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/ea86197c94fc429de826b1656599fe71-98.jpg", "descriptions": "Restricted to an abandoned mansion on the outskirts of London in fulfillment of a promise to her father, lonely Cardia lives day to day isolated from the world. Her body carries a deadly poison that rots or melts anything her skin touches, prompting the locals to call her a “monster.” HerRestricted to an abandoned mansion on the outskirts of London in fulfillment of a promise to her father, lonely Cardia lives day to day isolated from the world. Her body carries a deadly poison that rots or melts anything her skin touches, prompting the locals to call her a “monster.” Her last conversation with her father two years ago, telling her to stay out of sight and never fall in love, is the furthest back she can remember. One day, her quiet solitude is interrupted as the Royal Guards break in to capture her. It is then that Cardia meets Arsène Lupin, a chivalrous thief, who helps her escape the soldiers’ clutches. She soon finds herself on a journey with Lupin to locate her father, who holds the answers to her mysterious condition. The two are soon joined by four more interesting and handsome gentlemen…… Expand"}, {"name": "Tom Clancy's Rainbow Six Vegas", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-rainbow-six-vegas", "publisher": "Ubisoft", "release_date": "Jun 26 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "14  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/6de98fc5afc8fe935015b57c3415109f-98.jpg", "descriptions": "The stakes are high when the world's most elite counter-terrorism unit enters Las Vegas, where over 36.7 million men, women and children visit each year. \"Sin City,\" the home of the famous Las Vegas Strip, flashy hotels, high-rolling casinos and world-famous celebrities, becomes the settingThe stakes are high when the world's most elite counter-terrorism unit enters Las Vegas, where over 36.7 million men, women and children visit each year. \"Sin City,\" the home of the famous Las Vegas Strip, flashy hotels, high-rolling casinos and world-famous celebrities, becomes the setting for a terrorist threat of global proportions. What happens when one of the world's most famous cities is held hostage by terrorists? [Ubisoft]… Expand"}, {"name": "Civilization III: Conquests", "details_link": "https://www.metacritic.com/game/pc/civilization-iii-conquests", "publisher": "Atari", "release_date": "Nov  4 2003", "developers": ["Firaxis Games"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "4X"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/838825b974edc1748e233fff247e676f-98.jpg", "descriptions": "Civilization III: Conquests provides Civ fans with intriguing new civilizations, units, wonders, technologies, terrain features, special abilities, and more to help them triumph in eight professionally designed conquests throughout history. These new scenarios will challenge novice andCivilization III: Conquests provides Civ fans with intriguing new civilizations, units, wonders, technologies, terrain features, special abilities, and more to help them triumph in eight professionally designed conquests throughout history. These new scenarios will challenge novice and experienced players alike, in new and unique ways! Conquests also provides enhanced multiplayer and editor support. [Atari]… Expand"}, {"name": "Turok 2: Seeds of Evil", "details_link": "https://www.metacritic.com/game/nintendo-64/turok-2-seeds-of-evil", "publisher": "Acclaim", "release_date": "Oct 21 1998", "developers": ["Iguana Entertainment"], "platforms": ["PC", "Nintendo 64"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/e99a2e40da7787162dbfea270810b63c-98.jpg", "descriptions": "Only evil this dark could bring him back. Only a game this big can do him justice. Turok 2: Seeds of Evil! Pick off distant enemies with deadly sniper weapons, and enjoy ferocious multi-player deathmatches!"}, {"name": "Path of Exile", "details_link": "https://www.metacritic.com/game/pc/path-of-exile", "publisher": "Grinding Gear Games", "release_date": "Jan 25 2013", "developers": ["Grinding Gear Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/2226db47f6e1fc3116091cb1a07ceaac-98.jpg", "descriptions": "Path of Exile is an online Action RPG set in the dark fantasy world of Wraeclast. They're a small independent team of hardcore gamers based in New Zealand and have created Path of Exile as the game that they'd want to play themselves. It is designed around a strong barter-based online itemPath of Exile is an online Action RPG set in the dark fantasy world of Wraeclast. They're a small independent team of hardcore gamers based in New Zealand and have created Path of Exile as the game that they'd want to play themselves. It is designed around a strong barter-based online item economy, deep character customisation, competitive PvP and ladder races. The game is completely free and will never be \"pay to win\". [Grinding Gear Games]… Expand"}, {"name": "Returnal", "details_link": "https://www.metacritic.com/game/playstation-5/returnal", "publisher": "PlayStation Studios", "release_date": "Apr 30 2021", "developers": ["Housemarque"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/917155c153f3d6691b94fc08d3aad527-98.jpg", "descriptions": "Returnal transforms roguelike gameplay into a third-person shooter where players fight to survive a hostile planet that changes with every death. Players can switch instinctively between firing modes by using a single adaptive trigger and can get right back into the action after dying. PS5’sReturnal transforms roguelike gameplay into a third-person shooter where players fight to survive a hostile planet that changes with every death. Players can switch instinctively between firing modes by using a single adaptive trigger and can get right back into the action after dying. PS5’s immersive 3D audio brings the alien world to life around the player, helping players navigate the intense positional combat.… Expand"}, {"name": "Battlefield: Bad Company 2 Vietnam", "details_link": "https://www.metacritic.com/game/pc/battlefield-bad-company-2-vietnam", "publisher": "EA Games", "release_date": "Dec 18 2010", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/67209f10e60f97f515098c5ffc2562b9-98.jpg", "descriptions": "Set in the 1960s, this DLC adds 4 new multiplayer maps, 15 new weapons, and six vehicles."}, {"name": "Guilty Gear Xrd: Rev 2", "details_link": "https://www.metacritic.com/game/playstation-4/guilty-gear-xrd-rev-2", "publisher": "Arc System Works", "release_date": "May 26 2017", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/d126d7610b6c0b0d8c461f6aaecc75dd-98.jpg", "descriptions": "Guilty Gear Xrd Rev 2 includes all previously released DLC from  -REVELATOR- as well as new fighters, modes, moves, story chapters and more. It's never been a better time to be a 2.5D brawler in the post apocalypse. Hone your skills with an eclectic cast of 25 insane fighters and prove yourGuilty Gear Xrd Rev 2 includes all previously released DLC from  -REVELATOR- as well as new fighters, modes, moves, story chapters and more. It's never been a better time to be a 2.5D brawler in the post apocalypse. Hone your skills with an eclectic cast of 25 insane fighters and prove your mettle as the ultimate fighting master.… Expand"}, {"name": "OlliOlli2: Welcome to Olliwood", "details_link": "https://www.metacritic.com/game/playstation-4/olliolli2-welcome-to-olliwood", "publisher": "roll7", "release_date": "Mar  3 2015", "developers": ["roll7"], "platforms": ["PC", "PlayStation Vita", "Xbox One", "PlayStation 4"], "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skate / Skateboard"], "meta_score": 86, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/9b58462d12b9a14ab69bf52bc8e2076f-98.jpg", "descriptions": "OlliOlli2: Welcome to Olliwood plucks the iconic skater from the street and dropping him squarely in the middle of the Big Screen’s most bodacious cinematic locations."}, {"name": "Assault Android Cactus+", "details_link": "https://www.metacritic.com/game/switch/assault-android-cactus+", "publisher": "Witch Beam", "release_date": "Mar  8 2019", "developers": ["Witch Beam"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/1b44bb029054c51712c063ad1f200116-98.jpg", "descriptions": "Experience an arcade style twin stick shooter set in a vivid sci fi universe. Junior Constable Cactus is outside her pay grade when she responds to a distress call and ends up stranded on a crippled space freighter under attack by its own robot workers. With a draining battery mechanicExperience an arcade style twin stick shooter set in a vivid sci fi universe. Junior Constable Cactus is outside her pay grade when she responds to a distress call and ends up stranded on a crippled space freighter under attack by its own robot workers. With a draining battery mechanic instead of lives, Assault Android Cactus+ challenges you to think fast and shoot faster. Charge head first into an army of refitted robots, transforming stages and massive boss showdowns. … Expand"}, {"name": "Assassin's Creed II", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-ii", "publisher": "Ubisoft", "release_date": "Mar  9 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/c5d98c5752c41ec3b14f6271b2bac14d-98.jpg", "descriptions": "Assassin's Creed II is the product of over two years of intensive development by the original creative team behind the Assassin's Creed brand. In a vast open world environment, the game invites players to incarnate Ezio, a privileged young noble in Renaissance Italy who's been betrayed byAssassin's Creed II is the product of over two years of intensive development by the original creative team behind the Assassin's Creed brand. In a vast open world environment, the game invites players to incarnate Ezio, a privileged young noble in Renaissance Italy who's been betrayed by the rival ruling families of Italy. Ezio's subsequent quest for vengeance plunges players into an epic story that offers more variety in missions, surprising and engaging new gameplay elements, diverse weapons and a profound character progression that appeal to fans of the original Assassin's Creed as well as entice players new to the brand. [Ubisoft]… Expand"}, {"name": "Forza Motorsport 7", "details_link": "https://www.metacritic.com/game/xbox-one/forza-motorsport-7", "publisher": "Microsoft Game Studios", "release_date": "Sep 29 2017", "developers": ["Turn 10"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 24 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/749c9a72c91848567459e9be459e56df-98.jpg", "descriptions": "Experience the thrill of motorsport at the limit. Enjoy graphics at 60fps and native 4K resolution in HDR. Collect and race more than 700 cars, including the largest collection of Ferraris, Porsches, and Lamborghinis ever. Challenge yourself across 30 famous destinations and 200 ribbons,Experience the thrill of motorsport at the limit. Enjoy graphics at 60fps and native 4K resolution in HDR. Collect and race more than 700 cars, including the largest collection of Ferraris, Porsches, and Lamborghinis ever. Challenge yourself across 30 famous destinations and 200 ribbons, where race conditions change every time you return to the track. [Microsoft]… Expand"}, {"name": "Sumire", "details_link": "https://www.metacritic.com/game/switch/sumire", "publisher": "GameTomo", "release_date": "May 27 2021", "developers": ["GameTomo"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 86, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/2d77adf7d6205afe30c1d545ecf212e3-98.jpg", "descriptions": "One Day, One Life. Embark on a mysterious journey to help Sumire achieve her deepest wishes, before the day ends and the sky turns to twilight. Sumire is an indie narrative adventure, featuring a one-day journey through a picturesque Japanese village. In this enchanted place, a disenchantedOne Day, One Life. Embark on a mysterious journey to help Sumire achieve her deepest wishes, before the day ends and the sky turns to twilight. Sumire is an indie narrative adventure, featuring a one-day journey through a picturesque Japanese village. In this enchanted place, a disenchanted girl named Sumire meets a mischievous spirit who makes her a deal to fulfill her most desired wish.\rBut in order to see this wish come true, she must complete a series of tasks in return, before night falls and this special day reaches its end.… Expand"}, {"name": "Huntdown", "details_link": "https://www.metacritic.com/game/switch/huntdown", "publisher": "Coffee Stain Studios", "release_date": "May 12 2020", "developers": ["Coffee Stain Studios", "Easy Trigger Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/ef31e2df4be6cd3bccf9886eaca623c0-98.jpg", "descriptions": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy."}, {"name": "NHL 08", "details_link": "https://www.metacritic.com/game/playstation-3/nhl-08", "publisher": "Electronic Arts", "release_date": "Sep 11 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/a0e335229e6bcd9c6f82d4758097dbd4-98.jpg", "descriptions": "The Skill Stick gave you the power to deke the goalie in NHL 07 – now you can own the 1-on-1 matchup and undress opposing defenseman with complete control Use your stick to push the puck into space and walk around your defender. Once you're all alone in front, improved stick handling andThe Skill Stick gave you the power to deke the goalie in NHL 07 – now you can own the 1-on-1 matchup and undress opposing defenseman with complete control Use your stick to push the puck into space and walk around your defender. Once you're all alone in front, improved stick handling and shooting accuracy will give you the toolset to beat your goaltender for that decisive goal. Dynamic AI adjusts to your every move both on offense and defense, promising to challenge even the most skilled hockey players. The intelligent CPU scouts your tendencies like a coach and makes the necessary adjustments to shut down your money plays, forcing you to adjust your style of play. New analog speed control of the left stick gives you the variance you need to glide into the zone with control or get a burst of speed to step up on a defender. With new skating animations and responsiveness, you have the control to perform crossovers to maintain speed or carve tight turns for an immediate change in direction. 29 AHL teams – the top developmental league for the NHL – are exclusively featured and fully playable. Develop your talent with their minor affiliate until you are ready to call them up for the show. Be the GM and manage your team from the ground up while staying under the salary cap. [Electronic Arts]… Expand"}, {"name": "ENDER LILIES: Quietus of the Knights", "details_link": "https://www.metacritic.com/game/pc/ender-lilies-quietus-of-the-knights", "publisher": "Binary Haze Interactive", "release_date": "Jun 22 2021", "developers": ["Live Wire Films", "Live Wire"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/129e221ccf8881c9e0ca89ecdb2dc3ec-98.jpg", "descriptions": "ENDER LILIES is a dark fantasy 2D Action RPG about unraveling the mysteries of a destroyed kingdom. On this sorrowful path, encounter horrific enemies against whom a moment of inattention could be fatal. Overcome the hardships of your journey and reach the truth with the fallen knights."}, {"name": "Mortal Kombat X", "details_link": "https://www.metacritic.com/game/xbox-one/mortal-kombat-x", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 14 2015", "developers": ["Warner Bros. Interactive Entertainment", "NetherRealm Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Action", "Fighting", "2D", "3D"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/beed1039437c732b1be53d810ce74c46-98.jpg", "descriptions": "Mortal Kombat X combines cinematic presentation with all new gameplay to deliver the most brutal Kombat experience ever, offering a new fully-connected experience that launches players into a persistent online contest where every fight matters in a global battle for supremacy.  For the firstMortal Kombat X combines cinematic presentation with all new gameplay to deliver the most brutal Kombat experience ever, offering a new fully-connected experience that launches players into a persistent online contest where every fight matters in a global battle for supremacy.  For the first time, Mortal Kombat X gives players the ability to choose from multiple variations of each character impacting both strategy and fighting style. Players step into an original story showcasing some of the game’s most prolific characters including Scorpion and Sub-Zero, while introducing new challengers that represent the forces of good and evil and tie the tale together.… Expand"}, {"name": "Football Manager 2019", "details_link": "https://www.metacritic.com/game/pc/football-manager-2019", "publisher": "Sega", "release_date": "Nov  2 2018", "developers": ["Sports Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 86, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/1f94caeb8def8f566b5bcdbcbfe4ce6b-98.jpg", "descriptions": "In Football Manager 2019 YOU are the author of your club's success: you define the tactics and style of play, and drive player recruitment to build the ultimate squad. You take an active role on the training ground, developing your squad and fine-tuning the preparations for upcomingIn Football Manager 2019 YOU are the author of your club's success: you define the tactics and style of play, and drive player recruitment to build the ultimate squad. You take an active role on the training ground, developing your squad and fine-tuning the preparations for upcoming matches.Then, when Match Day arrives, you take your place on the touchline, overseeing proceedings as your players cross that magical white line. Now, your footballing vision is put to the test! Will the perfect substitution or tactical tweak be the difference between an agonising defeat or an ecstatic victory?Features:* Test your skills in 50 of the biggest footballing countries.* Climb to the top of the table and beyond with any one of world's top 2500 clubs.* Play the transfer market and scout more than 500,000 real players and staff.* Watch your unique football vision play-out on our acclaimed 3D engine.… Expand"}, {"name": "Gunman Clive HD Collection", "details_link": "https://www.metacritic.com/game/wii-u/gunman-clive-hd-collection", "publisher": "Horberg Productions", "release_date": "Sep  3 2015", "developers": ["Horberg Productions"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 86, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/91adeee1dd8842a039928a56463ba069-98.jpg", "descriptions": "In the year of 18XX, the west is overrun by thugs and outlaws. A group of bandits have kidnapped Mayor Johnsons daughter and are spreading havoc across the land. Gunman Clive must rescue the girl and bring order to the west, then finish the fight in Gunman Clive 2. His battle against theIn the year of 18XX, the west is overrun by thugs and outlaws. A group of bandits have kidnapped Mayor Johnsons daughter and are spreading havoc across the land. Gunman Clive must rescue the girl and bring order to the west, then finish the fight in Gunman Clive 2. His battle against the bandits takes him all around the world and beyond. … Expand"}, {"name": "Persona 4 Arena", "details_link": "https://www.metacritic.com/game/playstation-3/persona-4-arena", "publisher": "Atlus", "release_date": "Aug  7 2012", "developers": ["Arc System Works"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 86, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/20467e86df5823e8a48424b1e5cb5e5d-98.jpg", "descriptions": "Persona 4 Arena uses hand-drawn, high definition 2D anime-style fighters and colorful, over-the-top special effects to bring to life a roster of fighters from Persona 3 and Persona 4."}, {"name": "Viewtiful Joe 2", "details_link": "https://www.metacritic.com/game/gamecube/viewtiful-joe-2", "publisher": "Capcom", "release_date": "Nov 18 2004", "developers": ["Clover Studio"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/a658a5e5426efd5c81aea81dfdff88af-98.jpg", "descriptions": "Joe and Silvia are back in this sequel to Viewtiful Joe. This time you have more style, new special moves, and more than 40 new enemies to defeat. Now Joe's trusty aircraft transforms into various shapes to support his activities throughout the game's many stages. In addition to Joe, you canJoe and Silvia are back in this sequel to Viewtiful Joe. This time you have more style, new special moves, and more than 40 new enemies to defeat. Now Joe's trusty aircraft transforms into various shapes to support his activities throughout the game's many stages. In addition to Joe, you can play as Silva, Joe's girlfriend. Call upon the powers of Joe and Silvia, and get ready to both solve new puzzles and save the day.… Expand"}, {"name": "BlazBlue: Central Fiction - Special Edition", "details_link": "https://www.metacritic.com/game/switch/blazblue-central-fiction---special-edition", "publisher": "Arc System Works", "release_date": "Feb  7 2019", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/f0ceb7147b385e003ef30d266134e72f-98.jpg", "descriptions": "BlazBlue: Central Fiction is the newest installment in the storied BlazBlue franchise and stands alone as the pinnacle of next gen 2D fighters! Like a well-timed 2D punch, BlazBlue: Central Fiction bashes massive amounts of content and innovation into one slick title that hits hard and keepsBlazBlue: Central Fiction is the newest installment in the storied BlazBlue franchise and stands alone as the pinnacle of next gen 2D fighters! Like a well-timed 2D punch, BlazBlue: Central Fiction bashes massive amounts of content and innovation into one slick title that hits hard and keeps the pummeling steady! Prepare yourself for a brand new story, new characters, levels, modes, system mechanics and more! Choose from over 33 unimaginable fighters as you battle for 2D supremacy!… Expand"}, {"name": "Day of the Tentacle Remastered", "details_link": "https://www.metacritic.com/game/pc/day-of-the-tentacle-remastered", "publisher": "Double Fine Productions", "release_date": "Mar 21 2016", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/c47228bd88aa786e4b96e614af895ca6-98.jpg", "descriptions": "Dr. Fred’s mutated purple tentacle is about to take over the world, and only you can stop him. Originally released by LucasArts in 1993 as a sequel to Ron Gilbert’s Maniac Mansion, Day of the Tentacle is a mind-bending, time travel, cartoon puzzle adventure game in which three unlikelyDr. Fred’s mutated purple tentacle is about to take over the world, and only you can stop him. Originally released by LucasArts in 1993 as a sequel to Ron Gilbert’s Maniac Mansion, Day of the Tentacle is a mind-bending, time travel, cartoon puzzle adventure game in which three unlikely friends work together to prevent an evil mutated purple tentacle from taking over the world. Now, over 20 years later, Day of the Tentacle is back in a remastered edition that features all new hand-drawn, high resolution artwork, with remastered audio, music and sound effects (which the original 90s marketing blurb described as ‘zany!’). Players are able to switch back and forth between classic and remastered modes, and mix and match audio, graphics and user interface to their heart’s desire. We’ve also included a concept art browser, and recorded a commentary track with the game’s original creators Tim Schafer, Dave Grossman, Larry Ahern, Peter Chan, Peter McConnell and Clint Bajakian.… Expand"}, {"name": "The Elder Scrolls IV: Shivering Isles", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-iv-shivering-isles", "publisher": "Bethesda Softworks", "release_date": "Mar 26 2007", "developers": ["Bethesda Softworks"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/e22a29af220cb05b6be42f540c77509a-98.jpg", "descriptions": "Shivering Isles features more than 30 hours of new gameplay and allows you to explore an entirely new plane of Oblivion – the realm of Sheogorath, the Daedric Prince of Madness. Shivering Isles adds to the existing world of Oblivion so you can continue playing with your existing saveShivering Isles features more than 30 hours of new gameplay and allows you to explore an entirely new plane of Oblivion – the realm of Sheogorath, the Daedric Prince of Madness. Shivering Isles adds to the existing world of Oblivion so you can continue playing with your existing save game/character, or create an all new character just to explore the new content. Within the Realm of Sheogorath, players can explore the two extreme sides of the god's madness – the sublimely creative and the completely psychotic. Something is happening to the Shivering Isles and Sheogorath himself looks to you to be his champion and defend his realm and its inhabitants from destruction. Do you have the strength to survive his trials, tame a realm fraught with paranoia and despair, and wear the mantle of a God? The Shivering Isles features a bizarre landscape split between the two sides – Mania and Dementia-filled with vast, twisting dungeons mirroring the roots of the trees they are buried within. You'll encounter more than a dozen new creatures including hideous insects, Flesh Atronachs, skeletal Shambles, amphibious Grummites. Throughout your adventure, you will discover all new items, ingredients, spells, and more, and have the talented craftsmen of Crucible and Bliss forge new armor and weapons just for you. [Bethesda Softworks]… Expand"}, {"name": "Assassin's Creed Odyssey", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-odyssey", "publisher": "Ubisoft", "release_date": "Oct  2 2018", "developers": ["Ubisoft", "Ubisoft Quebec"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 86, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/03968fff532c284d714fe31c4e5975ea-98.jpg", "descriptions": "Write your own epic odyssey and become a legendary Spartan hero. Forge your destiny in a world on the brink of tearing itself apart. Influence how history unfolds in an ever-changing world shaped by your choices.Features:\n\n* LEGENDARY SPARTAN HERO - Embark on your journey from outcast toWrite your own epic odyssey and become a legendary Spartan hero. Forge your destiny in a world on the brink of tearing itself apart. Influence how history unfolds in an ever-changing world shaped by your choices.Features:* LEGENDARY SPARTAN HERO - Embark on your journey from outcast to legendary Spartan hero.* ANCIENT GREECE AWAITS - Explore an entire country full of unexpected encounters in untamed environments and bustling ancient cities.* CHOOSE YOUR PATH - Your choices shape the world around you. Play in a living world that constantly reacts to your every decision.* FIGHT EPIC BATTLES - Charge into epic clashes between Sparta and Athens in battles pitting 150v150 soldiers against each other.* SAIL THE AEGEAN SEA - Recruit crewmembers and customize your ship as you explore and battle your way on the open seas.… Expand"}, {"name": "Cyberpunk 2077", "details_link": "https://www.metacritic.com/game/pc/cyberpunk-2077", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Dec 10 2020", "developers": ["CD Projekt Red Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/e6f3e91d6de4757b3a81886b520b5739-98.jpg", "descriptions": "Cyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. Assume the role of V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality. You can customize your character’sCyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. Assume the role of V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality. You can customize your character’s cyberware, skillset and playstyle, and explore a vast city where the choices you make shape the story and the world around you. Become a cyberpunk, an urban mercenary equipped with cybernetic enhancements and build your legend on the streets of Night City. Take the riskiest job of your life and go after a prototype implant that is the key to immortality.… Expand"}, {"name": "Madden NFL 06", "details_link": "https://www.metacritic.com/game/gamecube/madden-nfl-06", "publisher": "EA Sports", "release_date": "Aug  8 2005", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "GameCube"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/79a099eb5e6ab30745105caba4297a26-98.jpg", "descriptions": "With its new modes and enhancements, Madden NFL 06 offers an authentic football experience. Among the game's offensive enhancements are \"QB Vision Control,\" which gives each quarterback a unique field of vision, and \"QB Precision Placement,\" which lets you throw the ballWith its new modes and enhancements, Madden NFL 06 offers an authentic football experience. Among the game's offensive enhancements are \"QB Vision Control,\" which gives each quarterback a unique field of vision, and \"QB Precision Placement,\" which lets you throw the ball more accurately. In the new NFL Superstar mode, you can experience the life of an NFL player by earning one of more than 60 personas ranging from MVP to movie star.… Expand"}, {"name": "Xenoblade Chronicles 3D", "details_link": "https://www.metacritic.com/game/3ds/xenoblade-chronicles-3d", "publisher": "Nintendo", "release_date": "Apr 10 2015", "developers": ["Monster Games Inc."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/da01ef319c18fffedfc8c22a1db4de60-98.jpg", "descriptions": "Join the battle for Bionis to repel the invasion of a terrifying mechanical army and uncover the secrets of a mystical sword called the Monado in Xenoblade."}, {"name": "Fire Emblem Fates: Birthright", "details_link": "https://www.metacritic.com/game/3ds/fire-emblem-fates-birthright", "publisher": "Nintendo", "release_date": "Feb 19 2016", "developers": ["Intelligent Systems"], "platforms": "3DS", "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 86, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/87354ecee85f7cf67facec27e88856c0-98.jpg", "descriptions": "Two kingdoms at war – the peace-loving Hoshido and the glory-seeking Nohr. It is up to the player to decide which side to fight for. As the prince/princess of Hoshido, who was raised by Nohr royal family, you will be torn between two families you love. Whichever path you take, you will faceTwo kingdoms at war – the peace-loving Hoshido and the glory-seeking Nohr. It is up to the player to decide which side to fight for. As the prince/princess of Hoshido, who was raised by Nohr royal family, you will be torn between two families you love. Whichever path you take, you will face different types of challenges.… Expand"}, {"name": "DiRT Rally", "details_link": "https://www.metacritic.com/game/pc/dirt-rally", "publisher": "Codemasters", "release_date": "Dec  7 2015", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/f204a610e6ab9c2a08389fa6ba97fbd9-98.jpg", "descriptions": "DiRT Rally captures the essence of what makes rally unique – that sense of trying to remain in control of your emotions, as you hurtle along at breakneck speed, aiming to squeeze everything out of your car whilst knowing that one crash could irreparably harm your stage time."}, {"name": "Sonic Mania", "details_link": "https://www.metacritic.com/game/switch/sonic-mania", "publisher": "Sega", "release_date": "Aug 15 2017", "developers": ["Tantalus"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 86, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/cbf429c726c4df87893d49fba45a5834-98.jpg", "descriptions": "Sonic Mania brings fans back into the 2D world of platform games with nostalgic pixel-style art and core \"classic\" gameplay by reimagining iconic Zones and Acts from Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic CD and Sonic The Hedgehog 3 and Knuckles, and adding in completely new ZonesSonic Mania brings fans back into the 2D world of platform games with nostalgic pixel-style art and core \"classic\" gameplay by reimagining iconic Zones and Acts from Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic CD and Sonic The Hedgehog 3 and Knuckles, and adding in completely new Zones with all-new Acts and boss fights into the mix. [Nintendo]… Expand"}, {"name": "Rocket League", "details_link": "https://www.metacritic.com/game/pc/rocket-league", "publisher": "505 Games", "release_date": "Jul  5 2015", "developers": ["Psyonix"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Sports", "Racing", "Team", "Soccer", "Futuristic", "Arcade"], "meta_score": 86, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/86c5eda872514f55a8a5f6f1e40fdaea-98.jpg", "descriptions": "Soccer meets driving once again in this physics-based multiplayer-focused sequel to Supersonic Acrobatic Rocket-Powered Battle-Cars. Choose a variety of high-flying vehicles equipped with huge rocket boosters to score aerial goals and pull-off game-changing saves."}, {"name": "The Legend of Zelda: Twilight Princess HD", "details_link": "https://www.metacritic.com/game/wii-u/the-legend-of-zelda-twilight-princess-hd", "publisher": "Nintendo", "release_date": "Mar  4 2016", "developers": ["Tantalus", "Tantatus", "Nintendo"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/711695383d3f9af87330fddcbfb3a38e-98.jpg", "descriptions": "A dark force, shrouded in twilight, has invaded the vast land of Hyrule. To restore light to the world, team up with the mysterious creature Midna and embrace the darkness to transform into a divine wolf. Fight through labyrinthine dungeons, survive puzzling traps in this legendary ZeldaA dark force, shrouded in twilight, has invaded the vast land of Hyrule. To restore light to the world, team up with the mysterious creature Midna and embrace the darkness to transform into a divine wolf. Fight through labyrinthine dungeons, survive puzzling traps in this legendary Zelda adventure. The Legend of Zelda: Twilight Princess is set in a world bursting with life—but also shadow. A dark figure from the Twilight Realm has invaded the world of light. As Link, a farmhand turned cursed beast, join forces with the impish Midna and trusted (albeit unusual) allies to survive a quest that'll take you to the farthest corners of Hyrule and beyond… to the Twilight Realm. This emotional adventure is now on the Wii U console with improved visuals and controls—and new challenges. Choose Hero Mode to take 2x normal damage, or tap the Wolf Link amiibo figure to unlock the tough Cave of Shadows. [Nintendo.com]… Expand"}, {"name": "F1 2021", "details_link": "https://www.metacritic.com/game/pc/f1-2021", "publisher": "Electronic Arts", "release_date": "Jul 16 2021", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 86, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/9/9c01f04da87e86a92fa98e20b387854c-98.jpg", "descriptions": "Every story has a beginning in F1® 2021, the official videogame of the 2021 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Enjoy the stunning new features of F1® 2021, including the thrilling story experience ‘Braking Point’, two-player Career, and get even closer to the grid with ‘Real-Season Start’.Every story has a beginning in F1® 2021, the official videogame of the 2021 FIA FORMULA ONE WORLD CHAMPIONSHIP™. Enjoy the stunning new features of F1® 2021, including the thrilling story experience ‘Braking Point’, two-player Career, and get even closer to the grid with ‘Real-Season Start’."}, {"name": "Mini Metro", "details_link": "https://www.metacritic.com/game/switch/mini-metro", "publisher": "Radial Games Corp.", "release_date": "Aug 30 2018", "developers": ["Radial Games Corp.", "Dinosaur Polo Club"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/8a8d133c3f38065e47c0126516ddecf2-98.jpg", "descriptions": null}, {"name": "Dark Souls Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/dark-souls-remastered", "publisher": "Namco Bandai Games", "release_date": "May 25 2018", "developers": ["From Software"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 86, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/6ac4855a606717857c8750bd34075a09-98.jpg", "descriptions": "Embark upon an epic dark fantasy in a universe stricken by decline and the Curse. Explore its intricate world design - full of hidden passages, dungeons and secrets - and uncover its deeply rooted lore."}, {"name": "Injustice 2", "details_link": "https://www.metacritic.com/game/pc/injustice-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 30 2017", "developers": ["QLOC"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 86, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/5af05b877b1d0fdeeef6688bce1368ab-98.jpg", "descriptions": "Every battle defines you.\r Power up and build the ultimate version of your favorite DC legends in INJUSTICE 2. With a massive selection of DC Super Heroes and Super-Villains, INJUSTICE 2 allows you to equip every iconic character with unique and powerful gear earned throughout the game.Every battle defines you.\r Power up and build the ultimate version of your favorite DC legends in INJUSTICE 2. With a massive selection of DC Super Heroes and Super-Villains, INJUSTICE 2 allows you to equip every iconic character with unique and powerful gear earned throughout the game. Experience an unprecedented level of control over how your favorite characters look, how they fight, and how they develop across a huge variety of game modes. This is your super Hero. Your Journey. Your Injustice.… Expand"}, {"name": "The Legend of Heroes: Trails of Cold Steel", "details_link": "https://www.metacritic.com/game/playstation-3/the-legend-of-heroes-trails-of-cold-steel", "publisher": "XSEED Games", "release_date": "Dec 22 2015", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 86, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/584c07561b1ccc854b1bcc4274adacbd-98.jpg", "descriptions": "At the elite Thors Military Academy, Erebonias best and brightest learn everything from the art of war to the liberal arts. Rean Schwarzer, a new student, learns that hes been selected as a member of the newly-minted Class VII, made up of students from both noble and commoner backgrounds.At the elite Thors Military Academy, Erebonias best and brightest learn everything from the art of war to the liberal arts. Rean Schwarzer, a new student, learns that hes been selected as a member of the newly-minted Class VII, made up of students from both noble and commoner backgrounds.\r Class VII has no shortage of issues to overcome, but Rean and his classmates will have to work past their differences and hone their skills, because theyll need more than just top marks to make the grade  theyll need to safeguard their country from those who would plunge it into war.\r - A World of Lore  Return to the Zemurian continent, setting of the Trails in the Sky titles, with a new adventure for old and new fans alike.\r - Tactical Thinking  Execute your strategies in exciting turn-based battles where timing and distance can make the difference between victory and defeat.\r - Combat Links  Link any two characters in battle, enabling unique synergies between them.… Expand"}, {"name": "Resogun: Heroes", "details_link": "https://www.metacritic.com/game/playstation-4/resogun-heroes", "publisher": "SCEA", "release_date": "Jun 24 2014", "developers": ["Housemarque"], "platforms": "PlayStation 4", "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 86, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/ec327f6c426fae86cf5d9fab4a394d02-98.jpg", "descriptions": "In Demolition, take the fight to Avernus at night, armed only with a proximity bomb that recharges after each use. No other weapons, boost or overdrive here. What you do have is the Wrecking Ball. When it’s caught in the explosion of your proximity bomb, it will fly off around AvernusIn Demolition, take the fight to Avernus at night, armed only with a proximity bomb that recharges after each use. No other weapons, boost or overdrive here. What you do have is the Wrecking Ball. When it’s caught in the explosion of your proximity bomb, it will fly off around Avernus destroying everything it hits… including you.… Expand"}, {"name": "Tetris Party", "details_link": "https://www.metacritic.com/game/wii/tetris-party", "publisher": "Tetris Online, Inc", "release_date": "Oct 20 2008", "developers": ["Hudson Soft"], "platforms": "Wii", "num_players": "1-6 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 86, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/76273770718614e230c8a79f153fc817-98.jpg", "descriptions": "[WiiWare]  Tetris Party is a deceptively simple, addictive puzzle game that is sure to keep you and all of your friends and family entertained for hours on end. The WiiWare game features 10 never-before-seen single-player and multiplayer variations of Tetris, including Field Climber, Stage[WiiWare]  Tetris Party is a deceptively simple, addictive puzzle game that is sure to keep you and all of your friends and family entertained for hours on end. The WiiWare game features 10 never-before-seen single-player and multiplayer variations of Tetris, including Field Climber, Stage Racer, Shadow and Wii Balance Board-enabled modes (Wii Balance Board accessory sold with Wii Fit). Several of the modes give users the chance to take advantage of the unique point-and-shoot capabilities of the Wii Remote controller. The party doesn't stop there, though. Take the Tetris fun online via Nintendo Wi-Fi Connection, where you can play multiplayer Tetris against up to five friends at a time. You can also see how your Tetris Party skills stack up against the rest of the world using the global ranking system. [Nintendo]… Expand"}, {"name": "ESPN College Hoops 2K5", "details_link": "https://www.metacritic.com/game/playstation-2/espn-college-hoops-2k5", "publisher": "Sega", "release_date": "Nov 17 2004", "developers": ["Visual Concepts"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 86, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/cb1683b3842ea27692cb1b3e308e1eb7-98.jpg", "descriptions": "Capturing the true spirit and pageantry of collegiate roundball is one of the most important aspects in a college basketball title, and ESPN College Hoops 2K5 improves upon its stellar presentation to give gamers the ultimate college hoops experience. Smarter crowd intelligence and enhancedCapturing the true spirit and pageantry of collegiate roundball is one of the most important aspects in a college basketball title, and ESPN College Hoops 2K5 improves upon its stellar presentation to give gamers the ultimate college hoops experience. Smarter crowd intelligence and enhanced audio options deliver the perfect college ambiance, while ESPN anchors Jay Bilas and Mike Patrick return with a textbook full of commentary to illustrate the emotional tide of every tip-off. The game features completely new online features to satisfy even the most die-hard collegiate basketball junkies. Fans across North America benefit from new online leagues and tournaments, comprehensive statistics tracking, living rosters, and much more. [Sega]… Expand"}, {"name": "Allegiance", "details_link": "https://www.metacritic.com/game/pc/allegiance", "publisher": "Microsoft Game Studios", "release_date": "Mar 31 2000", "developers": ["Microsoft Game Studios"], "platforms": "PC", "num_players": "Up to 32 ", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 86, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/f83505001bdcae87cef03bef1a24029c-98.jpg", "descriptions": "Allegiance, the multiplayer space-combat game from the minds of Microsoft Research, combines the challenges of tactical squadron-based combat, intense one-on-one space dogfights, and amazing graphical and sound effects into a space-action experience like nothing you've seen before. [Microsoft]"}, {"name": "Cadence of Hyrule: Crypt of the NecroDancer Featuring The Legend of Zelda", "details_link": "https://www.metacritic.com/game/switch/cadence-of-hyrule-crypt-of-the-necrodancer-featuring-the-legend-of-zelda", "publisher": "Nintendo", "release_date": "Jun 13 2019", "developers": ["Brace Yourself Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/04b9af7d38d2c8120fabbeb2ecb3e16f-98.jpg", "descriptions": "In the latest rhythmic action-adventure from Brace Yourself Games, you can enjoy the gameplay of Crypt of the Necrodancer in the setting of The Legend of Zelda series. As Linkor even as Princess Zeldayou'll explore the randomly generated overworld and dungeons on a quest to save Hyrule.In the latest rhythmic action-adventure from Brace Yourself Games, you can enjoy the gameplay of Crypt of the Necrodancer in the setting of The Legend of Zelda series. As Linkor even as Princess Zeldayou'll explore the randomly generated overworld and dungeons on a quest to save Hyrule. Every beat of each remixed, The Legend of Zelda tune is a chance to move, attack, defend, and more, so stay one step ahead of each enemy and bossor face the music. From modern-looking Lynels to the Hyrulean Soldiers of old, you must master the instinctive movements of each pixel-art enemy, and strategically outstep them in rhythmic combat. So equip yourself with an arsenal of iconic Legend of Zelda items, as well as the spells and weapons from Crypt of the Necrodancer. You must be prepared to face Hyrule's most wicked bosses, which have been transformed by magic, granting them mighty, new forms!\r * A rhythmic action-adventure game in the world of the Legend of Zelda series\r* Explore the randomly generated overworld and dungeons to save Hyrule as Link or Princess Zelda\r Use items from the Legend of Zelda series, plus spells and weapons from the Crypt of the Necrodancer game\r* Outstep legendary enemies and bosses in rhythmic combat\r* Keep the beat with 25 remixed classic Legend of Zelda tunes… Expand"}, {"name": "Monster Hunter Generations", "details_link": "https://www.metacritic.com/game/3ds/monster-hunter-generations", "publisher": "Capcom", "release_date": "Jul 15 2016", "developers": ["Capcom"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/9cec4bc1215546ce978e88b45ca15125-98.jpg", "descriptions": "Monster Hunter Generations is the most customizable Monster Hunter experience to date, and serves as a fitting tribute to the last decade of the series with a blend of brand new areas and monsters, and returning fan-favorites that have been updated and adapted to the newest generation ofMonster Hunter Generations is the most customizable Monster Hunter experience to date, and serves as a fitting tribute to the last decade of the series with a blend of brand new areas and monsters, and returning fan-favorites that have been updated and adapted to the newest generation of gameplay. Monster Hunter Generations introduces new gameplay mechanics including Styles and Hunter Arts that can further refine a very personalized playstyle. Mount monsters from mid-air using the Aerial style or make the most out of the advantageous Hunter Arts abilities with the Striker style. Hunter Arts are visually striking, indispensable combat skills and power-ups that hunters using any style or weapon can equip. Along the hunter's journey, players must defend each of the game's four villages from new major threats—the Fated Four. With hundreds of quests in store, there are tons of challenges to tackle in a solo adventure, and also via local or online play with up to three other hunters. [Nintendo]… Expand"}, {"name": "Radiant Historia", "details_link": "https://www.metacritic.com/game/ds/radiant-historia", "publisher": "Atlus", "release_date": "Feb 22 2011", "developers": ["Atlus"], "platforms": ["3DS", "DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/67a2f26784623cb920597b54045c071b-98.jpg", "descriptions": "In the midst of an unending war for dominance between two super-powers, Special Intelligence Agent Stocke is assigned to a routine escort mission that goes horribly awry."}, {"name": "Shantae: Risky's Revenge", "details_link": "https://www.metacritic.com/game/ds/shantae-riskys-revenge", "publisher": "WayForward", "release_date": "Oct  4 2010", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Wii U", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "The sequel to the critically acclaimed Shantae is here!"}, {"name": "Castlevania: Portrait of Ruin", "details_link": "https://www.metacritic.com/game/ds/castlevania-portrait-of-ruin", "publisher": "Konami", "release_date": "Dec  5 2006", "developers": ["Konami"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Platformer", "Platformer", "Action RPG", "2D", "2D", ""], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/9ea39ee2559bb01f75d460be16e5ae5b-98.jpg", "descriptions": "Take control of two heroes, Jonathan Morris, a vampire killer and his close friend Charlotte Orlean, a girl with tremendous magical ability. Amidst the chaos of World War II, two mysterious sisters emerge, working to resurrect Dracula and David and Charlotte are all that stand in their way.Take control of two heroes, Jonathan Morris, a vampire killer and his close friend Charlotte Orlean, a girl with tremendous magical ability. Amidst the chaos of World War II, two mysterious sisters emerge, working to resurrect Dracula and David and Charlotte are all that stand in their way. Two new playable characters, each with their own unique style of play and abilities. Strategically switch between characters in the heat of the action. Call on your partner and execute Summon Attacks to decimate your enemies. Collect items, weapons and magic as you explore the castle. Explore several environments new to the series, such as the Desert, abandoned cities and more. [Konami]… Expand"}, {"name": "Chivalry 2", "details_link": "https://www.metacritic.com/game/playstation-5/chivalry-2", "publisher": "Deep Silver", "release_date": "Apr 23 2021", "developers": ["Torn Banner Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 64 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 85, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/99ebaff4bbf064899bae3d5936396d2a-98.jpg", "descriptions": "Chivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era - from the thunder of cavalry charges, to storms of flaming arrows, sprawling castle sieges and more. Catapults tear the earth apartChivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era - from the thunder of cavalry charges, to storms of flaming arrows, sprawling castle sieges and more. Catapults tear the earth apart as players lay siege to castles, set fire to villages and slaughter filthy peasants in the return of grand Team Objective maps. Ride to war on horseback and claim glory by your blade. Are ye a heroic warrior, or a blood-soaked murderer? Keep fighting and gurgling out battlecries even when wounded, bleeding out and missing limbs.  Enhanced player expression brings thousands of hilarious new voice-lines and deep character customization. A revamped, faster and more fluid combat system offers an expanded range of creative choices, allowing players to perfect their playstyle. Immersive sound and effects ensure every blow lands with the sickening thud of steel sinking into bone.… Expand"}, {"name": "Risk of Rain 2", "details_link": "https://www.metacritic.com/game/pc/risk-of-rain-2", "publisher": "Hopoo Games", "release_date": "Aug 11 2020", "developers": ["Hopoo Games"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/21881a02c21e07ae01ed0db045e2c0d8-98.jpg", "descriptions": "The classic multiplayer roguelike, Risk of Rain, returns with an extra dimension and more challenging action. Play solo, or team up with up to three friends to fight your way through hordes of monsters, unlock new loot, and find a way to escape the planet."}, {"name": "Tom Clancy's Splinter Cell: Conviction", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-splinter-cell-conviction", "publisher": "Ubisoft", "release_date": "Apr 13 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/1c94ac3462ad643c76e7c0346b4ff264-98.jpg", "descriptions": "Improvise. Adapt. Overcome. You are a fugitive, ruthlessly hunted by the very government you used to serve. Your only choice is to improvise to survive. Experience original gameplay based on improvisation in which your environment is your top weapon. Always on your toes, you need to react onImprovise. Adapt. Overcome. You are a fugitive, ruthlessly hunted by the very government you used to serve. Your only choice is to improvise to survive. Experience original gameplay based on improvisation in which your environment is your top weapon. Always on your toes, you need to react on the fly to any changing situations and use the environment and the crowds around you to create diversions and deter your enemies. As a fugitive, quick thinking and adaptation are essential to turn the situation to your advantage. A gameplay experience delivering 100% adrenaline includes close combat and shooting sequences. To survive, build an underground network of allies who will help you obtain high-tech gadgets and stay one step ahead of your pursuers as you struggle to unmask the forces that frame you. [Ubisoft]… Expand"}, {"name": "Aggressive Inline", "details_link": "https://www.metacritic.com/game/playstation-2/aggressive-inline", "publisher": "Acclaim", "release_date": "May 28 2002", "developers": ["Z-Axis", "Ltd."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skating"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/b2ad44ebeb1962c626177696b2f7d52b-98.jpg", "descriptions": "Features the top pros in the industry like 2001 Gravity Games and X Games Vert Champion Taïg Khris, 2001 X Games Street Champion Jaren Grob, the founding father of Inline Skating, Chris Edwards in additon to Franky Morales, Shane Yost, Matt Lindenmuth, Eito Yasutoko, Sven Boekhorst, MattFeatures the top pros in the industry like 2001 Gravity Games and X Games Vert Champion Taïg Khris, 2001 X Games Street Champion Jaren Grob, the founding father of Inline Skating, Chris Edwards in additon to Franky Morales, Shane Yost, Matt Lindenmuth, Eito Yasutoko, Sven Boekhorst, Matt Salerno and Sam Fogarty. Introduces the Juice Meter and Action Button with up to 60 objectives and 15 cinematic events per each of 7 huge levels. Soundtrack includes bands such as Hoobastank, Black Sheep, Pharcyde, Reel Big Fish, Sublime. [Acclaim]… Expand"}, {"name": "The Talos Principle", "details_link": "https://www.metacritic.com/game/pc/the-talos-principle", "publisher": "Devolver Digital", "release_date": "Dec 11 2014", "developers": ["Croteam"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Adventure", "3D", "First-Person"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/9572a7ea80d4263b433491d1b416d9bc-98.jpg", "descriptions": "In The Talos Principle, players assume the role of a sentient artificial intelligence placed within a simulation of humanity?s greatest ruins and linked together through an arcane cathedral. Players are tasked with solving a series of increasingly complex puzzles woven into a metaphysicalIn The Talos Principle, players assume the role of a sentient artificial intelligence placed within a simulation of humanity?s greatest ruins and linked together through an arcane cathedral. Players are tasked with solving a series of increasingly complex puzzles woven into a metaphysical parable about intelligence and meaning in an inevitably doomed world.… Expand"}, {"name": "Cities: Skylines", "details_link": "https://www.metacritic.com/game/pc/cities-skylines", "publisher": "Paradox Interactive", "release_date": "Mar 10 2015", "developers": ["Colossal Order"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["City Building", "Modern", "Strategy", "Management", "Government"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/6b31ec0c7827c256c526d90376129c70-98.jpg", "descriptions": "Developed by Colossal Order, Cities: Skylines offers sprawling landscapes and maps with endless sandbox gameplay and new ways to expand your city. Key to progression is the ability to influence your city’s policy by incorporating taxation into districts. All this plus the ability to mod theDeveloped by Colossal Order, Cities: Skylines offers sprawling landscapes and maps with endless sandbox gameplay and new ways to expand your city. Key to progression is the ability to influence your city’s policy by incorporating taxation into districts. All this plus the ability to mod the game to suit your play style.… Expand"}, {"name": "DiRT Rally", "details_link": "https://www.metacritic.com/game/playstation-4/dirt-rally", "publisher": "Codemasters", "release_date": "Apr  5 2016", "developers": ["Codemasters"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/03eca8d920bfe58101b49a04ef8ea0bb-98.jpg", "descriptions": "DiRT Rally features 39 of the most iconic and relevant cars from yesteryear through to modern day, representing the cars that the players want, and the ones that make the most sense for the surfaces they race on. Six rallies with over 70 stages. Head to the muddy paths of Wales, the dustyDiRT Rally features 39 of the most iconic and relevant cars from yesteryear through to modern day, representing the cars that the players want, and the ones that make the most sense for the surfaces they race on. Six rallies with over 70 stages. Head to the muddy paths of Wales, the dusty trails of Greece and the icy tarmac of Monte Carlo. Take on the legendary hillclimb of Pikes Peak, the snowy thrills of Sweden, and the epic scenery of Finland. DiRT Rally has the iconic locations to test your nerve and delight your senses. Race at the Lydden Hill, Holjes and Hell tracks in six of the fastest off-road cars and take on your friends in bumper-to-bumper multiplayer racing. … Expand"}, {"name": "Total War: WARHAMMER III", "details_link": "https://www.metacritic.com/game/pc/total-war-warhammer-iii", "publisher": "Sega", "release_date": "Feb 17 2022", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 85, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/c5cb90288fe527b5f3f0600809a0911c-98.jpg", "descriptions": "Far beyond the world and its petty wars there exists a dimension of pure, malevolent magic: The Realm of Chaos. It is a terrible place, incomprehensible to the mortal mind. It whispers promises of power, but to behold it is to be seduced by it. To relinquish your soul to it. To become it.Far beyond the world and its petty wars there exists a dimension of pure, malevolent magic: The Realm of Chaos. It is a terrible place, incomprehensible to the mortal mind. It whispers promises of power, but to behold it is to be seduced by it. To relinquish your soul to it. To become it.\r The four Ruinous Powers rule over this place, ever seeking to slip their bonds and engulf the world in a tide of daemonic corruption. Nurgle, the plague god; Slaanesh, the lord of excess; Tzeentch, the changer of ways; and Khorne, the god of blood and slaughter.\r On the border between the worlds, two mighty kingdoms stand sentinel: the stern warriors of Kislev and the vast empire of Grand Cathay. But each is beset by its own trials, and now both have cause to cross the threshold and send their armies into the Realm of Chaos.\r The world stands on a precipice. A single push will plunge it into cataclysm. And there is one who schemes to achieve just that, an ancient figure who desires nothing less than to wield supreme power. But to succeed, he will need a champion...… Expand"}, {"name": "Project Gotham Racing 4", "details_link": "https://www.metacritic.com/game/xbox-360/project-gotham-racing-4", "publisher": "Microsoft Game Studios", "release_date": "Oct  2 2007", "developers": ["Bizarre Creations"], "platforms": "Xbox 360", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/229bc7490060ea47dcdeb08197259bb7-98.jpg", "descriptions": "Right from the starting line, Bizarre's vision for \"PGR 4\" was to create an emotionally-charged racing experience, where players become attached to their careers, profiles and vehicles. There are several new features that embody this emotional experience, the most significant being the newRight from the starting line, Bizarre's vision for \"PGR 4\" was to create an emotionally-charged racing experience, where players become attached to their careers, profiles and vehicles. There are several new features that embody this emotional experience, the most significant being the new career mode. Drivers are rewarded with a growing fanbase that'll cheer them on, react to their every move and support them through victory. One of the new gameplay elements is the dynamic weather system. Now racing through a track can mean facing an unexpected rain storm or snow flurries in the middle of a race. This results in changing physics when powering around a corner on the wet or icy surface in Shanghai and St. Petersburg or any of the game's 10 other locations. So, if you think driving on a dry track is boring... Flair and driving style now are just as important as technical skill, as players passing their opponent at full speed pump their fists and exhibit more emotion as they earn recognition with the revised Kudos system. The Kudos are worthwhile too, because the new A.I. personalities are be able to perform bold new driving maneuvers as they race side by side with other drivers. [Microsoft]… Expand"}, {"name": "Metroid Prime: Hunters", "details_link": "https://www.metacritic.com/game/ds/metroid-prime-hunters", "publisher": "Nintendo", "release_date": "Mar 20 2006", "developers": ["Nintendo", "Nintendo Software Technology"], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/7c0923428d851adba6ed72e769c7efcf-98.jpg", "descriptions": "Who is the Galaxy's Most Elite Bounty Hunter? Before Metroid Prime Hunters, the answer was easy. Now that six other ferocious bounty hunters have gathered to challenge Samus, the title is up for grabs. Engage in intense four-player deathmatches either locally or against players from aroundWho is the Galaxy's Most Elite Bounty Hunter? Before Metroid Prime Hunters, the answer was easy. Now that six other ferocious bounty hunters have gathered to challenge Samus, the title is up for grabs. Engage in intense four-player deathmatches either locally or against players from around the world with Nintendo Wi-Fi Connection. Battle with seven elite bounty hunters, each with unique alternate forms and specialty weapons. Customize your multiplayer matches with over 20 expertly designed arenas and seven intense modes of play. Unlock multiplayer features by completing an all-new single-player mission in Adventure Mode. [Nintendo]… Expand"}, {"name": "Return to Monkey Island", "details_link": "https://www.metacritic.com/game/playstation-5/return-to-monkey-island", "publisher": "Devolver Digital", "release_date": "Nov  8 2022", "developers": ["Terrible Toybox"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/bb85543877b4d55c872ad51c20119930-98.jpg", "descriptions": "It's been many years since Guybrush Threepwood was last locked in a battle of wits with his nemesis, the zombie pirate LeChuck. His true love, Elaine Marley, has turned her focus away from governing and Guybrush himself is adrift and unfulfilled, having never found the Secret of MonkeyIt's been many years since Guybrush Threepwood was last locked in a battle of wits with his nemesis, the zombie pirate LeChuck. His true love, Elaine Marley, has turned her focus away from governing and Guybrush himself is adrift and unfulfilled, having never found the Secret of Monkey Island. Hip, young pirate leaders led by Captain Madison have shuffled the old guard from power, Melee Island has taken a turn for the worse, and famed businessman Stan has been imprisoned for 'marketing-related crimes'.Banter with old friends and new faces on familiar islands now under dangerous new leadership. Then, take to the high seas and explore the new and unknown as you work your way out of tough predicaments. Clever puzzles, bizarre situations, and devastating ripostes are all that stand between Guybrush and glory.… Expand"}, {"name": "Thumper", "details_link": "https://www.metacritic.com/game/switch/thumper", "publisher": "Drool", "release_date": "May 18 2017", "developers": ["Drool"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/f3b5bfbd2b8a211034dc19b924bf594b-98.jpg", "descriptions": "Thumper is rhythm violence: classic rhythm-action, blistering speed, and brutal physicality."}, {"name": "Crypt of the NecroDancer", "details_link": "https://www.metacritic.com/game/playstation-4/crypt-of-the-necrodancer", "publisher": "Brace Yourself Games", "release_date": "Feb  2 2016", "developers": ["Brace Yourself Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Role-Playing", "Rhythm", "General", "Action RPG", "Music"], "meta_score": 85, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/b287020f84da82b099ef41a07327bc1c-98.jpg", "descriptions": "Crypt of the NecroDancer is a hardcore rhythm-based roguelike game. Can you survive this deadly dungeon of dance, slay the NecroDancer, and recapture your still beating heart? Or will you be a slave to the rhythm for all eternity? Players must move on the beat to navigate procedurallyCrypt of the NecroDancer is a hardcore rhythm-based roguelike game. Can you survive this deadly dungeon of dance, slay the NecroDancer, and recapture your still beating heart? Or will you be a slave to the rhythm for all eternity? Players must move on the beat to navigate procedurally generated dungeons while battling dancing skeletons, zombies, dragons, and more! Groove with the game's epic dance soundtrack, or select songs from your own MP3 collection! You can even play with a dance pad to really shake your bones!… Expand"}, {"name": "OlliOlli World", "details_link": "https://www.metacritic.com/game/xbox-series-x/olliolli-world", "publisher": "Private Division", "release_date": "Feb  8 2022", "developers": ["roll7"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 85, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/da2e8da3c9a4a84f1a30487f918bc796-98.jpg", "descriptions": "OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana.OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana. Traverse a delightful and weird world as you take on missions, challenges, and make new friends along the way. Customize your character’s looks, tricks, and style while you experience explorable levels with multiple paths that provide an array of opportunities for player expression. Challenge the world in Leagues or dare a friend to beat your best tricks on one of millions of sharable levels. Experience the accessibility, depth, and player freedom as you dive into the signature flow state gameplay of OlliOlli World.\r OlliOlli World marks the third entry in the critically-acclaimed OlliOlli series from Roll7, the BAFTA and multi-award-winning independent studio.\r Key Features:\r • Welcome to Radlandia!: Take a trip across a lush skateboarding utopia that is filled to the brim with eccentric characters and vibrant locations that are begging to be explored. Find your grind in Inflatable Alley or blaze down Los Vulgas to discover new paths, fresh side quests, rad rewards, and epic trick opportunities. All perfectly complemented by a hand-picked compilation of IDM and Electronica tracks. \r\r• Play at your level: Super tight controls combine with highly refined gameplay to ensure a silky smooth ride. Not a Pro? Don’t worry – OlliOlli World welcomes you with open arms, allowing new players to tear down streets and pull off sick method grabs without fear of faceplanting the curb. Think you’ve got what it takes? Achieve mastery through millions of unique levels in sandbox mode or compete against rivals around the globe in leagues with a hugely deep combo system with over 100 moves to master and combine in your battle for the highest score.\r • Freedom of expression: Cruise through Radlandia's epic skate-haven and prove your skills to unlock special rewards that let you customize your character’s looks, tricks and style. Want to skate in your flip flops… go for it. Want to wear a bumble bee onesie …ok then… no judgement. In OlliOlli World as long as you’re on board anything goes! … Expand"}, {"name": "Metroid: Samus Returns", "details_link": "https://www.metacritic.com/game/3ds/metroid-samus-returns", "publisher": "Nintendo", "release_date": "Sep 15 2017", "developers": ["Mercury Steam"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", ""], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/5fd72748f09eb43b6f579d7475992c91-98.jpg", "descriptions": "A classic Metroid adventure returns, rebuilt from the ground up. Brave the hostile terrain of an alien planet teeming with vicious life forms as legendary bounty hunter Samus Aran. Her mission? Terminate the Metroid menace in this masterful reimagining of her 1991 Game Boy adventure. SamusA classic Metroid adventure returns, rebuilt from the ground up. Brave the hostile terrain of an alien planet teeming with vicious life forms as legendary bounty hunter Samus Aran. Her mission? Terminate the Metroid menace in this masterful reimagining of her 1991 Game Boy adventure. Samus Arans arsenal has been enhanced with new moves and abilities that are sure to help her face the deadly surprises that await. This intense, side-scrolling action platformer is a great entry point into the Metroid franchise and perfect for returning fans as well, and its available only on the Nintendo 3DS family of systems.\r Features: \r\r*    This intense, side-scrolling action platformer has been completely remade with engaging and immersive 3D visuals and a rich, atmospheric color palette.\r*    Classic Metroid II: Return of Samus gameplay is joined by a wealth of new content, including a set of brand new abilities that utilizes a mysterious energy resource called Aeion, a powerful melee counterattack, and 360-degree Free Aim Mode. \r*    There are plenty of secrets to findand if you uncover enough of them, you may even start to unravel the mystery of Planet SR388s past. \r*    Two new amiibo figures*Samus Aran and Metroidwill be released as a set alongside the game. This game is also compatible with the Zero Suit Samus and Samus amiibo from the Super Smash Bros. series. Functionality details will be revealed at a later date. \r*    While supplies last, fans will be able to purchase a special edition of the game, which includes a physical copy of the game, a sound-selection CD featuring 25 tracks from across the Metroid franchise, and a reversible title-sheet insert for the game case.… Expand"}, {"name": "OlliOlli2: Welcome to Olliwood", "details_link": "https://www.metacritic.com/game/playstation-vita/olliolli2-welcome-to-olliwood", "publisher": "roll7", "release_date": "Mar  3 2015", "developers": ["roll7"], "platforms": ["PC", "PlayStation 4", "Xbox One", "PlayStation Vita"], "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skate / Skateboard"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/9b58462d12b9a14ab69bf52bc8e2076f-98.jpg", "descriptions": "OlliOlli2: Welcome to Olliwood plucks the iconic skater from the street and dropping him squarely in the middle of the Big Screen’s most bodacious cinematic locations."}, {"name": "Dragon Quest VIII: Journey of the Cursed King", "details_link": "https://www.metacritic.com/game/3ds/dragon-quest-viii-journey-of-the-cursed-king", "publisher": "Square Enix", "release_date": "Jan 20 2017", "developers": ["TOSE", "Cygames"], "platforms": ["iPhone/iPad", "PlayStation 2", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/e08f9e791d9357d3db9cf29645d8e567-98.jpg", "descriptions": "Uncover the story of the Cursed King as you save the world from a twisted magician in this genre-defining role-playing game. Across the vast world you'll wage turn-based battles against more than 250 monsters designed by famed artist Akira Toriyama. As you level up, upgrade your warriors'Uncover the story of the Cursed King as you save the world from a twisted magician in this genre-defining role-playing game. Across the vast world you'll wage turn-based battles against more than 250 monsters designed by famed artist Akira Toriyama. As you level up, upgrade your warriors' skills to learn mighty attacks. Untold possibilities await. After setting off into the unknown, you'll find monsters roaming the field—these are no mere random encounters. There's a satisfying rhythm to traveling, fighting monsters, earning items, crafting something useful with them using an alchemy Pot, and returning to battle, stronger than ever. To some, it's pitch-perfect RPG gameplay, complete with additional content outside the main storyline. In the Monster Arena, you'll form and battle teams of monsters to climb the ranks. It's but one of many features that makes this RPG a classic among classics. [Nintendo.com]… Expand"}, {"name": "Judgment", "details_link": "https://www.metacritic.com/game/xbox-series-x/judgment", "publisher": "Sega", "release_date": "Apr 23 2021", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/9383a3ce65c451bb2b91787e59b1752d-98.jpg", "descriptions": "From the makers of the acclaimed Yakuza series, Ryu Ga Gotoku Studio, Judgment is the dramatic tale of a disgraced lawyer seeking redemption in a world rife with corruption and despair. Investigate the seedy Red Light District of Kamurocho by stepping into the mind of private detectiveFrom the makers of the acclaimed Yakuza series, Ryu Ga Gotoku Studio, Judgment is the dramatic tale of a disgraced lawyer seeking redemption in a world rife with corruption and despair. Investigate the seedy Red Light District of Kamurocho by stepping into the mind of private detective Takayuki Yagami and utilize innovative investigation systems to uncover the secrets that lie deep within Kamurocho's corrupt underbelly. Experience visceral combat with two unique combat styles. Take down groups of thugs with sweeping blows in Crane Style, then switch to Tiger to overwhelm a single foe with a series of powerful strikes. Practice mixing-and-matching styles in combat in conjunction with a wide variety of skills, weapons, and powerful (and hilarious) EX Actions to unlock a whole new dimension in combat.… Expand"}, {"name": "Midnight Club 3: DUB Edition Remix", "details_link": "https://www.metacritic.com/game/playstation-2/midnight-club-3-dub-edition-remix", "publisher": "Rockstar Games", "release_date": "Mar 13 2006", "developers": ["Rockstar San Diego"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 85, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/4/2b57bf15f63b2c65d7fe8711b4a70d09-98.jpg", "descriptions": "The Midnight Club is back and bigger than ever. Take on street racing's toughest competitors as you tear through the living city sprawls of Detroit, San Diego, Atlanta and now Tokyo at breakneck speeds. Personalize the huge assortments of all new additional rides with the latest rims, kitsThe Midnight Club is back and bigger than ever. Take on street racing's toughest competitors as you tear through the living city sprawls of Detroit, San Diego, Atlanta and now Tokyo at breakneck speeds. Personalize the huge assortments of all new additional rides with the latest rims, kits and upgrades hot off the street. Midnight Club 3: DUB Edition Remix is the definitive urban racing experience, giving you the ultimate freedom to choose your own route to the finish line. [Rockstar Games]… Expand"}, {"name": "NHL 08", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-08", "publisher": "Electronic Arts", "release_date": "Sep 12 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/387778858ae50333ddaa1e8cc97d7c01-98.jpg", "descriptions": "The Skill Stick gave you the power to deke the goalie in NHL 07 – now you can own the 1-on-1 matchup and undress opposing defenseman with complete control Use your stick to push the puck into space and walk around your defender. Once you're all alone in front, improved stick handling andThe Skill Stick gave you the power to deke the goalie in NHL 07 – now you can own the 1-on-1 matchup and undress opposing defenseman with complete control Use your stick to push the puck into space and walk around your defender. Once you're all alone in front, improved stick handling and shooting accuracy will give you the toolset to beat your goaltender for that decisive goal. Dynamic AI adjusts to your every move both on offense and defense, promising to challenge even the most skilled hockey players. The intelligent CPU scouts your tendencies like a coach and makes the necessary adjustments to shut down your money plays, forcing you to adjust your style of play. New analog speed control of the left stick gives you the variance you need to glide into the zone with control or get a burst of speed to step up on a defender. With new skating animations and responsiveness, you have the control to perform crossovers to maintain speed or carve tight turns for an immediate change in direction. 29 AHL teams – the top developmental league for the NHL – are exclusively featured and fully playable. Develop your talent with their minor affiliate until you are ready to call them up for the show. Be the GM and manage your team from the ground up while staying under the salary cap. [Electronic Arts]… Expand"}, {"name": "Ni no Kuni: Wrath of the White Witch", "details_link": "https://www.metacritic.com/game/playstation-3/ni-no-kuni-wrath-of-the-white-witch", "publisher": "Namco Bandai Games", "release_date": "Jan 22 2013", "developers": ["Level 5"], "platforms": ["Switch", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/15e36d69bd3323c5164afd9797099124-98.jpg", "descriptions": "Ni no Kuni: Wrath of the White Witch, is a tale of a young boy named Oliver who embarks on a journey into a parallel world to bring his mother back from the dead. Along the way, Oliver makes friends and adopts many of the incredible creatures that live in the world, raising them to battleNi no Kuni: Wrath of the White Witch, is a tale of a young boy named Oliver who embarks on a journey into a parallel world to bring his mother back from the dead. Along the way, Oliver makes friends and adopts many of the incredible creatures that live in the world, raising them to battle other creatures with him as he takes on threatening enemies. Developed by LEVEL-5 with animation by the Studio Ghibli, Ni no Kuni: Wrath of the White Witch combines unique animated visuals, signature storytelling and a sweeping score into an epic role-playing adventure.… Expand"}, {"name": "Citizen Sleeper", "details_link": "https://www.metacritic.com/game/xbox-series-x/citizen-sleeper", "publisher": "Fellow Traveller", "release_date": "May  5 2022", "developers": ["Jump Over The Age"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Western-Style"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/bf2e2d99de2132ce2d75d5f555700416-98.jpg", "descriptions": "Live the life of an escaped worker, washed-up on a lawless station at the edge of an interstellar society. Inspired by the flexibility and freedom of Tabletop RPGs, explore the station, choose your friends, escape your past and change your future.\rLIFE ON ERLIN'S EYE\rAn abandoned stationLive the life of an escaped worker, washed-up on a lawless station at the edge of an interstellar society. Inspired by the flexibility and freedom of Tabletop RPGs, explore the station, choose your friends, escape your past and change your future.\rLIFE ON ERLIN'S EYE\rAn abandoned station on the edge of a system in crisis. Run down, chaotic, unruly, and alive—it was founded by idealists in the shadow of a corporate collapse. Now it is held together by anarchic alliances, ramshackle factions and a shared desire to be free from the gravity of corporate control.\r DO THE WORK. GET PAID. SURVIVE.\rEvery cycle you get up and choose what to do with your time. Toil in the yards, or take a bar shift. Search the markets for rare components or grab some street food. Make or break alliances, uncover truths and escape those that hunt you. Learn to survive and ultimately thrive, one cycle at a time.\r TURN UP FOR YOUR FRIENDS\rThe station plays host to characters from all walks of life, trying to eke out an existence among the stars. Salvagers, engineers, hackers, bartenders, street-food vendors, each has a history which brought them here. You choose which of them you wish to help, and together you will shape your future.\r ACCESS THEIR SECRETS\rHack into the station’s cloud to access decades of digital data, uncover new areas and unlock secrets. This is your unique power, and with it you can change your future. Corporate secrets, rogue AIs and troves of lost data await those willing to dive into the depths of the station’s networks.\r YOU WERE MADE TO DIE\rEssen-Arp: to them you are just property, one more asset in a portfolio that stretches across the stars. You are the product of an abusive system, in a universe where humanity’s expansion is marked by exploitation and extraction. Escape the makers of your decaying body, and chart your own path in a richly imagined, deeply relevant sci-fi world which explores ideas of precarity, personhood and freedom.… Expand"}, {"name": "Kingdom Two Crowns", "details_link": "https://www.metacritic.com/game/switch/kingdom-two-crowns", "publisher": "Raw Fury", "release_date": "Dec 11 2018", "developers": ["Raw Fury", "Noio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/57701c18aa49c121cb11fa0785c63d19-98.jpg", "descriptions": "In Kingdom Two Crowns, players must work in the brand-new solo or co-op campaign mode to build their kingdom and secure it from the threat of the Greed. Experience new technology, units, enemies, mounts, and secrets in the next evolution of the award-winning micro strategy franchise."}, {"name": "The Wolf Among Us: Episode 1 - Faith", "details_link": "https://www.metacritic.com/game/playstation-3/the-wolf-among-us-episode-1---faith", "publisher": "Telltale Games", "release_date": "Oct 15 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Adventure", "Fantasy", "General", "Fantasy", "Point-and-Click"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/e2d347992c7d3571af398471d1e74a8f-98.jpg", "descriptions": "The Wolf Among Us is a 5-episode series from the creators of The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist inThe Wolf Among Us is a 5-episode series from the creators of The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist in our world. As Bigby Wolf - THE big bad wolf in human form - you discover that the brutal, bloody murder of a Fable is just a taste of things to come, in a game series where your every decision can have enormous consequences. Your choices matter: it’s not only WHAT you choose to do that will affect how your story plays out, but WHEN you choose to do it. A mature and gritty take on characters from fairy tales, legends and folklore who have escaped into our world. These are not the characters you’d see on a little child’s lunchbox. Play as Bigby Wolf: formerly the most feared monster among the Fables, now Sheriff of Fabletown and protector of those he used to hunt. He must restrain the beast within if he is to earn the trust of those around him. Choose Bigby’s actions carefully. Will you approach a situation calmly or unleash your inner rage? The way you act will determine how others respond to you. Set before the events seen in the first issue of the comics – you don’t have to know the characters or the world to play. [Telltale Games]\r… Expand"}, {"name": "Deep Rock Galactic", "details_link": "https://www.metacritic.com/game/pc/deep-rock-galactic", "publisher": "Ghost Ship Games", "release_date": "May 13 2020", "developers": ["Ghost Ship Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/2ab67a04814817434fc8d88f979c2719-98.jpg", "descriptions": "Deep Rock Galactic is a 1-4 player co-op FPS featuring badass space Dwarves, 100% destructible environments, procedurally-generated caves, and endless hordes of alien monsters."}, {"name": "UFC Undisputed 2010", "details_link": "https://www.metacritic.com/game/playstation-3/ufc-undisputed-2010", "publisher": "THQ", "release_date": "May 25 2010", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/9b3d71302d4980938adb7a5cb2a487c1-98.jpg", "descriptions": "UFC Undisputed 2010 is the only mixed martial arts (MMA) videogame this year that delivers the action, intensity and prestige of the Ultimate Fighting Championship. Players navigate a roster of more than 100 prolific UFC fighters, each fully rendered to convey a photorealistic appearance.UFC Undisputed 2010 is the only mixed martial arts (MMA) videogame this year that delivers the action, intensity and prestige of the Ultimate Fighting Championship. Players navigate a roster of more than 100 prolific UFC fighters, each fully rendered to convey a photorealistic appearance. Prominent UFC personalities, including commentators Joe Rogan and Mike Goldberg, veteran voice of the Octagon Bruce Buffer, the Octagon Girls, referees, trainers and more, return to showcase an authentic and memorable UFC videogame experience. Enhanced combat offers players a new Sway System with full upper body and head movement that allows for the dodging of attacks. On the ground, a new Posture System enables players to deliver stronger, fight-ending strikes from every position. In addition, players manage Octagon control with new strikes, submissions, transitions and cage positions, as well as experience added realism with the introduction of Southpaw stance. Players also enjoy customizable freedom with created fighters by combining moves from numerous MMA disciplines, including new moves taken from Sambo, Karate and Greco-Roman Wrestling, to become true mixed martial artists. [THQ]… Expand"}, {"name": "Octopath Traveler II", "details_link": "https://www.metacritic.com/game/playstation-5/octopath-traveler-ii", "publisher": "Square Enix", "release_date": "Feb 24 2023", "developers": ["Square Enix", "Acquire"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/a3a6a741618e7e00edaf377b937c4cfe-98.jpg", "descriptions": "This game is a brand-new entry in the OCTOPATH TRAVELER series, the first installment of which was initially released in 2018 and sold over 3 million copies worldwide. It takes the series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, to even greater heights.\rIn the world ofThis game is a brand-new entry in the OCTOPATH TRAVELER series, the first installment of which was initially released in 2018 and sold over 3 million copies worldwide. It takes the series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, to even greater heights.\rIn the world of Solistia, eight new travelers venture forth into an exciting new era.\rWhere will you go? What will you do? Whose tale will you bring to life?\rEvery path is yours to take.\rEmbark on an adventure all your own.\r 1. Begin your adventure as one of eight new travelers, each with their own origins, motivations, and unique skills.\r 2. The series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, have reached even greater heights.\r 3. The story takes place in Solistia, where diverse cultures thrive from east to west and the industries of the new era flourish. You can sail the seas and explore every corner of a world that changes from day to night.\r 4. Each traveler has a unique set of Path Actions they can use to battle townspeople, obtain items, take others along in their travels, and more. Where will you go? What will you do? Every path is yours to take.\r 5. Familiar mechanics from the original game have been preserved, like the freedom to develop your travelers’ jobs and skills, as well as the Break and Boost system that made battles so exhilarating. New mechanics have also been added.… Expand"}, {"name": "Prince of Persia: The Two Thrones", "details_link": "https://www.metacritic.com/game/playstation-2/prince-of-persia-the-two-thrones", "publisher": "Ubisoft", "release_date": "Dec  1 2005", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/77442d78c56a8edbc4f518d16b8c3078-98.jpg", "descriptions": "The Prince of Persia, a seasoned warrior, returns from the Island of Time to Babylon with his love, Kaileena. Instead of the peace that he longs for, he finds his homeland ravaged by war and the kingdom turned against him. The Prince is rapidly captured and Kaileena has no choice but toThe Prince of Persia, a seasoned warrior, returns from the Island of Time to Babylon with his love, Kaileena. Instead of the peace that he longs for, he finds his homeland ravaged by war and the kingdom turned against him. The Prince is rapidly captured and Kaileena has no choice but to sacrifice herself and unleash the Sands of Time in order to save him. Now cast out on the streets and hunted as a fugitive, the Prince soon discovers that past battles have given rise to a deadly Dark Prince, whose spirit gradually possesses him. Play and master two distinct characters: Wield the powers and weapons of two master warriors with different combat styles, attitudes, and histories. Choose your way to fight: Master the expanded Free-Form Fighting system to destroy enemies in your own style; strangle enemies from afar with the deadly Daggertail; or surprise them with full-speed one-shot kills using a brand new stealth art. The choice is yours. Battle freely through Babylon: Dominate enemies on the perilous rooftops, dodge through chaotic streets, and ambush pursuers in dark, underground passageways. Immerse yourself in a dramatic story: Experience unparalleled depth in storytelling as you fight your way through a twisting tale filled with adrenaline, tension and discovery. Manipulate time to surprise enemies: Execute powerful attacks against entire armies by slowing down or rewinding time, or surprise them by using some all-new Sands of Time powers. Experience a masterful blend of gameplay: True to the Prince of Persia; franchise, the game provides a variety of action combat, agility and story-driven puzzles - all masterfully blended together into a rich gaming experience. [Ubisoft]… Expand"}, {"name": "Guilty Gear -Strive-", "details_link": "https://www.metacritic.com/game/pc/guilty-gear--strive-", "publisher": "Arc System Works", "release_date": "Jun 11 2021", "developers": ["Arc System Works"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 32 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/1f2f1d0fe05f8ad0c01870d77eb76863-98.jpg", "descriptions": "“Guilty Gear -Strive-“ is the latest entry in the Guilty Gear fighting game franchise. Created by Daisuke Ishiwatari and developed by Arc System Works, “Guilty Gear -Strive-“ upholds the series’ reputation for groundbreaking hybrid 2D/3D cell-shaded graphics and intense, rewarding gameplay.“Guilty Gear -Strive-“ is the latest entry in the Guilty Gear fighting game franchise. Created by Daisuke Ishiwatari and developed by Arc System Works, “Guilty Gear -Strive-“ upholds the series’ reputation for groundbreaking hybrid 2D/3D cell-shaded graphics and intense, rewarding gameplay. There is a fully voiced story mode diving deep into the Guilty Gear universe, new characters joining fan favorites, and robust rollback net code. The cutting-edge 2D/3D hybrid graphics pioneered in the Guilty Gear series have been raised to the next level in “Guilty Gear -Strive-“. The new artistic direction and improve character animations will go beyond anything you’ve seen before in a fighting game!… Expand"}, {"name": "Plants vs. Zombies", "details_link": "https://www.metacritic.com/game/playstation-3/plants-vs-zombies", "publisher": "PopCap", "release_date": "Feb  8 2011", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["Strategy", "Real-Time", "General", "General", "Fantasy", "Defense"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/43f7ebe655edc138ff5cd6e2637f82dc-98.jpg", "descriptions": "Zombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like aZombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like a setting sun, creeping fog and a swimming pool add to the challenge, and with five game modes to dig into, the fun never dies!… Expand"}, {"name": "NBA Live 2004", "details_link": "https://www.metacritic.com/game/xbox/nba-live-2004", "publisher": "EA Sports", "release_date": "Oct 14 2003", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/37a927866a511c76cc4b743f715f8100-98.jpg", "descriptions": "Step up your game with NBA Live 2004.  With brand-new 10-Man Freestyle, authentic gameplay and stunning graphics, NBA Live 2004 delivers a complete basketball experience.  Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk or locking down onStep up your game with NBA Live 2004.  With brand-new 10-Man Freestyle, authentic gameplay and stunning graphics, NBA Live 2004 delivers a complete basketball experience.  Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk or locking down on \"D,\" the revamped EA Sports Freestyle Controller puts you in total control.  With a dramatically enhanced Dynasty Mode, the ability to take the court at all NBA arenas and all-new commentary from Marv Albert and Mike Fratello, NBA Live 2004 looks to step up the authenticity.… Expand"}, {"name": "NHL 2004", "details_link": "https://www.metacritic.com/game/xbox/nhl-2004", "publisher": "EA Sports", "release_date": "Sep 22 2003", "developers": ["EA Black Box"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 85, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/461bbb5c7888a06df084748c575fb1f5-98.jpg", "descriptions": "It's been called the fastest sport on Earth--and the faster the players, the tougher the contact.  NHL 2004 brings professional hockey to life like never before, with crisp passes, searing slap-shots, and a variety of new ways to check your opponent to regain control of the puck.  NHL 2004It's been called the fastest sport on Earth--and the faster the players, the tougher the contact.  NHL 2004 brings professional hockey to life like never before, with crisp passes, searing slap-shots, and a variety of new ways to check your opponent to regain control of the puck.  NHL 2004 is the hockey fan's dream come true, with the addition of international leagues, Bruise Control fighting system, online play, and a Dynasty Mode that lets you build a powerhouse.'.… Expand"}, {"name": "Hitman 2: Silent Assassin", "details_link": "https://www.metacritic.com/game/playstation-2/hitman-2-silent-assassin", "publisher": "Eidos Interactive", "release_date": "Oct  1 2002", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/6faa3f770f4c6e8bc7a60fd2a703f718-98.jpg", "descriptions": "Enter the realm of a retired assassin, forced back into action by treason. You may be a hired killer but you still have a sense of loyalty and justice. Visit the dark recesses of a world corrupted by crime, greed, degradation and dishonor. And a past that catches up with you. Trust no one -Enter the realm of a retired assassin, forced back into action by treason. You may be a hired killer but you still have a sense of loyalty and justice. Visit the dark recesses of a world corrupted by crime, greed, degradation and dishonor. And a past that catches up with you. Trust no one - if the price is right, the finger of your most trusted ally will be on the trigger. Your targets may hide in the most remote areas of the planet, but their destruction is never prevented - only postponed. Learn your trade - master your tools - overcome your obstacles - outsmart your enemies - eliminate your targets. Remember: rash decisions bleed consequences. Know when to strike instantly, know when to take your time. Chance favors the prepared. Failure is not an option. [Eidos Interactive]… Expand"}, {"name": "Falcon 4.0", "details_link": "https://www.metacritic.com/game/pc/falcon-40", "publisher": "Atari", "release_date": "Nov 30 1998", "developers": ["Atari", "MicroProse"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/0da7a61b31bc3e5997e89f25d2aff293-98.jpg", "descriptions": "Falcon 4.0 is an extremely detailed Simulation integrating a fully dynamic, realtime Air, land, and sea war in which you take part as an F-16 pilot. Running on any OS platform capable of supporting Directx 5.0 and above. Falcon 4.0 not only simulates a fantastic and versatile fighter, butFalcon 4.0 is an extremely detailed Simulation integrating a fully dynamic, realtime Air, land, and sea war in which you take part as an F-16 pilot. Running on any OS platform capable of supporting Directx 5.0 and above. Falcon 4.0 not only simulates a fantastic and versatile fighter, but also a very versatile product. With 4 years of hard work behind it, it is the ultimate Simulation experience for all enthusiasts. [Falcon 4.0 HQ]… Expand"}, {"name": "Tom Clancy's Rainbow Six", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six", "publisher": "Red Storm Entertainment", "release_date": "Aug 21 1998", "developers": ["Red Storm Entertainment"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/72dedd6c269dd607a5ad8891c11533e9-98.jpg", "descriptions": "The most revolutionary action/strategy game of its kind. Nothing comes closer to offering an exciting combination of strategy, team-building, realistic three-dimensional graphics and true-to-life special forces action. The ultimate goal is to save yourself and the world from deadlyThe most revolutionary action/strategy game of its kind. Nothing comes closer to offering an exciting combination of strategy, team-building, realistic three-dimensional graphics and true-to-life special forces action. The ultimate goal is to save yourself and the world from deadly terrorists. You must successfully complete 17 unique missions. If you die, the game isn't over. The World is. [Red Storm Entertainment]… Expand"}, {"name": "Oddworld: Abe's Oddysee", "details_link": "https://www.metacritic.com/game/playstation/oddworld-abes-oddysee", "publisher": "GT Interactive", "release_date": "Aug 31 1997", "developers": ["Oddworld Inhabitants"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "PlayStation"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/f37f69a662f7d53bc48992d3e6051d60-98.jpg", "descriptions": "In a lush of diabolical danger where everyone wants to eat you, you're the skinny guy with no weapons. Run, jump, hide, scramble and talk your way past the ugliest bunch of carnivorous crustaceans ever created. Unlock Abe's special powers then figure out your foes, and you might save yourIn a lush of diabolical danger where everyone wants to eat you, you're the skinny guy with no weapons. Run, jump, hide, scramble and talk your way past the ugliest bunch of carnivorous crustaceans ever created. Unlock Abe's special powers then figure out your foes, and you might save your race. Don't, and you're dinner! Enter Oddworld's surreal, sensory overload of pure gaming and claim your destiny.… Expand"}, {"name": "Wasteland 3", "details_link": "https://www.metacritic.com/game/pc/wasteland-3", "publisher": "InXile Entertainment", "release_date": "Aug 28 2020", "developers": ["InXile Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/9c0a717da60a61d575adca6eed1803b0-98.jpg", "descriptions": "In Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed PatriarchIn Wasteland 3 you take command of a squad of Desert Rangers, lawmen and women in a post-nuclear world, trying to rebuild society from the ashes. More than a century after the bombs fell, you’re fighting a losing battle to keep your beloved Arizona alive. Then the self-proclaimed Patriarch of Colorado radios, promising aid if you'll do a job he can only entrust to an outsider—rescue his land from the ambitions of his three bloodthirsty children. You’re dispatched on a desperate quest from the scorching deserts to the snowy mountains to start from scratch, building a new base, finding a snow-worthy vehicle, training new recruits, and fighting your way through hostile frozen wastes. All the while, you'll have to decide who to trust in this land torn apart by corruption, intrigue, warring factions, crazed cultists, cutthroat gangs, and bitter sibling rivalries. Build a reputation for yourself by making decisions that will profoundly impact Colorado, its inhabitants and the story you experience. Will you be Colorado’s savior or its worst nightmare? Wasteland 3 is a squad-based RPG from inXile entertainment, featuring challenging tactical turn-based combat and a deep, reactive story full of twists, turns, and brutal ethical decisions that will keep you hooked whether you’re a Wasteland veteran or new to the series. Create a squad of up to six Rangers and customize them with perks and abilities geared to your playstyle. You even get your own battle truck, which you can upgrade into a hardened war beast, bristling with weapons, to help mow down your enemies. … Expand"}, {"name": "Madden NFL 2005", "details_link": "https://www.metacritic.com/game/pc/madden-nfl-2005", "publisher": "EA Sports", "release_date": "Sep 14 2004", "developers": ["BudCat"], "platforms": ["PlayStation 2", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 85, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/1d20835225ee4ab89ed4282d55a55944-98.jpg", "descriptions": "Force the action on defense in Madden NFL 2005. New defensive tools allow you to make more plays and be in on all of the action. The all-new Hit Stick lets you lay the big hit to turn the momentum of the game in your favor. Modify pre-snap assignments, including double teams andForce the action on defense in Madden NFL 2005. New defensive tools allow you to make more plays and be in on all of the action. The all-new Hit Stick lets you lay the big hit to turn the momentum of the game in your favor. Modify pre-snap assignments, including double teams and player-specific match ups, for any defensive player on the field. With the new Storyline Central, you get the inside scoop around the league from radio host Tony Bruno, along with local and national newspapers, to help you make critical franchise decisions. New Hit Stick ? Change the momentum of a game by using the right analog stick to make a huge hit, force a turnover, and send the crowd into a frenzy. Time it just right or you'll get burned for a big play. Enhanced Franchise Mode ? Players now react to everything that happens in the franchise?reward a hard-working player by naming him team captain or trade away unhappy players. The new game-by-game progression system rewards players for their performance during the season. Your team's crowd is now customizable with new Create-a-Fan. Be on the lookout for team-specific super fans via all-new 3D fan scenes. New EA SPORTS Online ? Take on the best Madden players in quick tournaments, or compete in a mini-game of Rushing Attack. Improved EA SPORTS Fair Play keeps the playing field level. [Electronic Arts]… Expand"}, {"name": "Legend of Grimrock II", "details_link": "https://www.metacritic.com/game/pc/legend-of-grimrock-ii", "publisher": "Almost Human", "release_date": "Oct 15 2014", "developers": ["Almost Human"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "Western-Style"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/3879f32c2742226faa2ab65d6f49b8d6-98.jpg", "descriptions": "Legend of Grimrock 2 is a dungeon crawling RPG with a modern execution but an old-school heart. A gaggle of 4 prisoners have shipwrecked on the secluded Isle of Nex. The island is chock full of ancient crumbled ruins, mysterious shrines and a vast underground network of dungeons."}]