[{"name": "Tales of Hearts R", "details_link": "https://www.metacritic.com/game/playstation-vita/tales-of-hearts-r", "publisher": "Bandai Namco Games", "release_date": "Nov 11 2014", "developers": ["7thChord"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/c2c1aba6adb26f5344d76ac438b20d4a-98.jpg", "descriptions": "Kor Meteor is a youngster surviving in a small village by the sea who trains with his grandfather in the ways of the sword. Impressed by Kor’s increasing skills, his grandfather leaves to him an atypical weapon known as a Soma. Kor meets a young lady, Kohaku Hearts who is in search of a SomaKor Meteor is a youngster surviving in a small village by the sea who trains with his grandfather in the ways of the sword. Impressed by Kor’s increasing skills, his grandfather leaves to him an atypical weapon known as a Soma. Kor meets a young lady, Kohaku Hearts who is in search of a Soma weapon along with her brother Hisui. Amidst their search, a mysterious witch surfaces and casts a spell on Kohaku’s Spiria, the embodiment of her heart and soul. Kor tries to lift the spell by connecting to her Spiria but inadvertently shatters her Spiria Core, the font of all her emotions. Kor, armed only with the Soma left to him by his grandfather, must now embark on a journey to discover a way to make Kohaku’s Spiria whole once again.… Expand"}, {"name": "LEGO Marvel Super Heroes 2", "details_link": "https://www.metacritic.com/game/switch/lego-marvel-super-heroes-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 14 2017", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/0133b95f68f421c0888cf82c0dc24648-98.jpg", "descriptions": "With a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the MarvelWith a completely original branching storyline, LEGO® Marvel Super Heroes 2  introduces amazing new gameplay features, including the ability for characters to manipulate time and a four-player competitive Super Hero battling mode. With a huge array of brand new characters from the Marvel Universe, including old favorites in new guises, this game is sure to thrill both LEGO and Marvel fans, as well as newcomers to the series.… Expand"}, {"name": "1000 Tiny Claws", "details_link": "https://www.metacritic.com/game/psp/1000-tiny-claws", "publisher": "Mediatonic", "release_date": "Oct  4 2011", "developers": ["Mediatonic"], "platforms": "PSP", "genres": ["Action", "General", "General"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/8c2876b75e9b2d3e373a3603292e51cd-98.jpg", "descriptions": "1000 Tiny Claws is the third PlayStation Minis game from developer Mediatonic."}, {"name": "RoboBlitz", "details_link": "https://www.metacritic.com/game/xbox-360/roboblitz", "publisher": "Microsoft Game Studios", "release_date": "Nov 28 2006", "developers": ["Naked Sky Entertainment"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/74bec3f9a136b91dfe1d077b8e733632-98.jpg", "descriptions": "[Xbox Live Arcade]  RoboBlitz is a humorous, physics-driven action game full of inventive gizmos, weapons, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates. Set in[Xbox Live Arcade]  RoboBlitz is a humorous, physics-driven action game full of inventive gizmos, weapons, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates. Set in seven distinct environments, RoboBlitz features 19 levels of puzzle-solving and high-intensity action. [Naked Sky Entertainment]… Expand"}, {"name": "Sam & Max: The Devil's Playhouse - Episode 4: Beyond the Alley of the Dolls", "details_link": "https://www.metacritic.com/game/pc/sam-max-the-devils-playhouse---episode-4-beyond-the-alley-of-the-dolls", "publisher": "Telltale Games", "release_date": "Jul 20 2010", "developers": ["Telltale Games"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "3D", "Compilation", "Third-Person"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/59be9c445cf8dda808f6cb1457b57f17-98.jpg", "descriptions": "The new season Sam & Max: The Devil's Playhouse is the biggest, strangest and most epic to date. As the saga begins, an otherworldy power for controlling matter and space calls to the strongest and strangest who might wield it - intergalactic warlords and eldritch gods, under-dwellers andThe new season Sam & Max: The Devil's Playhouse is the biggest, strangest and most epic to date. As the saga begins, an otherworldy power for controlling matter and space calls to the strongest and strangest who might wield it - intergalactic warlords and eldritch gods, under-dwellers and scholars of the arcane.… Expand"}, {"name": "Temtem", "details_link": "https://www.metacritic.com/game/switch/temtem", "publisher": "Humble Games", "release_date": "Sep  6 2022", "developers": ["Crema Games"], "platforms": ["PC", "PlayStation 5", "Xbox Series X", "Switch"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Trainer"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/0c19d67577cb9d1d13609877c24d2f59-98.jpg", "descriptions": "Every kid dreams about becoming a Temtem tamer; exploring the six islands of the Airborne Archipelago, discovering new species, and making good friends along the way. Now it's your turn to embark on an epic adventure and make those dreams come true.\r Catch new Temtem on Omninesia'sEvery kid dreams about becoming a Temtem tamer; exploring the six islands of the Airborne Archipelago, discovering new species, and making good friends along the way. Now it's your turn to embark on an epic adventure and make those dreams come true.\r Catch new Temtem on Omninesia's floating islands, battle other tamers on the sandy beaches of Deniz or trade with your friends in Tucma's ash-covered fields. Defeat the ever-annoying Clan Belsoto and end its plot to rule over the Archipelago, beat all eight Dojo Leaders, and become the ultimate Temtem tamer!… Expand"}, {"name": "TouchMaster 2", "details_link": "https://www.metacritic.com/game/ds/touchmaster-2", "publisher": "Midway", "release_date": "Oct 21 2008", "developers": ["Midway Studios - San Diego"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/dd1c65d389b35aff1d195ff126efb097-98.jpg", "descriptions": "The wide variety of highly interactive mini-games that made Midway’s TouchMaster a favorite in bars and arcades across the country returns again with TouchMaster 2 for the Nintendo DS.  With 20 new games, including exciting twists on some familiar classics, with new spins on Mahki, Poker andThe wide variety of highly interactive mini-games that made Midway’s TouchMaster a favorite in bars and arcades across the country returns again with TouchMaster 2 for the Nintendo DS.  With 20 new games, including exciting twists on some familiar classics, with new spins on Mahki, Poker and Solitaire, TouchMaster 2 offers addictive fun for gamers of all ages. TouchMaster 2’s new collection includes extremely fun and exciting card, action, strategy, puzzle and picture games. Play a quick round to beat your high-score or find some real competition playing head-to-head against other players. TouchMaster 2, the personal arcade that fits snug in the palm of your hands. [Midway]… Expand"}, {"name": "Mary Skelter: Nightmares", "details_link": "https://www.metacritic.com/game/playstation-vita/mary-skelter-nightmares", "publisher": "Idea Factory", "release_date": "Sep 19 2017", "developers": ["Compile Heart"], "platforms": ["PC", "Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Roguelike"], "meta_score": 76, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/9afe703d1f6f869455773a28146e4bb6-98.jpg", "descriptions": "Escape from the living prison jail in Mary Skelter: Nightmares for the PlayStation Vita system. The Nightmare monster actively stalks the player as you run through the dungeon, so you must use the dungeons' gimmicks to impede its movements. This dungeon RPG features a turn- based battleEscape from the living prison jail in Mary Skelter: Nightmares for the PlayStation Vita system. The Nightmare monster actively stalks the player as you run through the dungeon, so you must use the dungeons' gimmicks to impede its movements. This dungeon RPG features a turn- based battle system that includes class change, a strategic blood-licking transform system, and a blood-rubbing system to power up your party. As you solve the dungeons' mysteries and satisfy the prison's desires, you just might make it out alive.\r FEATURES:\r Walking Nightmares - The dungeon-crawling RPG genre gets a twist when special enemies can chase you through the dungeons. Lay traps to make your escape, or try to face them down.\r Blood-drenched Transformations - Characters can transform with stronger stats and extra skills, but if they fight too much they may enter Blood Skelter Mode, where they go completely berserk.\r Everyone's got a Job - Strategise your dungeon battles by assigning different classes to your characters, unlocking new skills, stats, and character portraits.… Expand"}, {"name": "Sports Champions", "details_link": "https://www.metacritic.com/game/playstation-3/sports-champions", "publisher": "SCEA", "release_date": "Sep  7 2010", "developers": ["SCEA", "Zindagi Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General", "Individual", "Athletics"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/45a7197bce480f7a609b6043c5440bbf-98.jpg", "descriptions": "Sports Champions Sports Champions will let you and your friends physically engage in an array of competitive sporting activities as you go head to head in six events. Use your motion controller as a racket in table tennis as you conduct high speed exchanges against your challenger; or igniteSports Champions Sports Champions will let you and your friends physically engage in an array of competitive sporting activities as you go head to head in six events. Use your motion controller as a racket in table tennis as you conduct high speed exchanges against your challenger; or ignite the arena as your motion controller becomes a sword and swing your arm forward to battle your opponent.… Expand"}, {"name": "Max & the Magic Marker", "details_link": "https://www.metacritic.com/game/wii/max-the-magic-marker", "publisher": "Press Play", "release_date": "Mar  8 2010", "developers": ["Press Play"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "Wii"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/9fff293912bd3ff22c8aaf911a24d6c4-98.jpg", "descriptions": "[WiiWare]  In the game Max has a magic marker, that makes it possible for him to draw anything he wants – and it becomes real! Unfortunately the monster he drew also became real – so he's got to find and catch it before it causes too much trouble. [Press Play]"}, {"name": "Tomb Raider: Underworld", "details_link": "https://www.metacritic.com/game/xbox-360/tomb-raider-underworld", "publisher": "Eidos Interactive", "release_date": "Nov 18 2008", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/7614953912b0da51565578ae04c5b19d-98.jpg", "descriptions": "Master your surroundings: Reach new heights with the broadest range of acrobatic abilities and utilize objects within the environment to uncover new paths to explore. Explore epic and unknown worlds: Discover ancient mysteries of the underworld hidden within the coast of Thailand, frozenMaster your surroundings: Reach new heights with the broadest range of acrobatic abilities and utilize objects within the environment to uncover new paths to explore. Explore epic and unknown worlds: Discover ancient mysteries of the underworld hidden within the coast of Thailand, frozen islands of the Arctic Sea, the jungles of Mexico, and more. Each level is an elaborate multi-stage puzzle masked within an interactive environmental playground offering more flexibility over how the area is solved. New range of combat options: Choose to pacify or kill, target multiple enemies at once with the new dual-target system, and shoot with one hand while suspended with the other. New state-of-the-art gear: Utilize the latest technology in Lara's upgraded inventory to navigate the world including: Active Sonar map: A revolutionary new tool that emits an active sonar ping to create a 3D image of Lara's surroundings, perfect for uncovering hidden items and locations; Multi-purpose grapple: A claw-like device with a high-tension cable designed for climbing, rappelling, performing wall runs and manipulating objects within the environment; All-terrain hybrid motorbike: A unique vehicle design built to drive on everything from mud to snow and ice. [Eidos Interactive]… Expand"}, {"name": "Jurassic World Evolution", "details_link": "https://www.metacritic.com/game/xbox-one/jurassic-world-evolution", "publisher": "Frontier Developments", "release_date": "Jun 12 2018", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/3d2a2a3d8e10ea34e4e126923b57b534-98.jpg", "descriptions": "Place yourself at the heart of the Jurassic franchise and build your own Jurassic World.Take charge of operations on the legendary islands of the Muertes archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for Science, Entertainment or Security interests in anPlace yourself at the heart of the Jurassic franchise and build your own Jurassic World.Take charge of operations on the legendary islands of the Muertes archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for Science, Entertainment or Security interests in an uncertain world where life always finds a way.Bioengineer dinosaurs that think, feel and react intelligently to the world around them. Play with life itself to give your dinosaurs unique behaviours, traits and appearances, then contain and profit from them to fund your global search for lost dinosaur DNA.Control the big picture with deep management tools or go hands-on to confront challenges on the ground or in the air. Expand your islands and choose your own journey in an all-new narrative featuring iconic characters from across the franchise and decades of Jurassic lore at your fingertips.… Expand"}, {"name": "American Truck Simulator", "details_link": "https://www.metacritic.com/game/pc/american-truck-simulator", "publisher": "Excalibur Publishing Limited", "release_date": "Feb  2 2016", "developers": ["SCS Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/e5bc7b8f69b61bc23d301cf631a84b88-98.jpg", "descriptions": "Experience legendary American trucks and deliver various cargoes across sunny California and sandy Nevada. American Truck Simulator takes you on a journey through the breathtaking landscapes and widely recognized landmarks around the States."}, {"name": "The Outer Worlds: Murder on Eridanos", "details_link": "https://www.metacritic.com/game/pc/the-outer-worlds-murder-on-eridanos", "publisher": "Private Division", "release_date": "Mar 17 2021", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/86fdd104eec7b9cdac0384a2be5314f9-98.jpg", "descriptions": "The second and final expansion to the sci-fi role-playing game. The core of Murder on Eridanos is to solve a crime… and murder is just the beginning of what you will find. You will have to interrogate witnesses, learn about potential alibis, and argue who you believe is responsible. ThisThe second and final expansion to the sci-fi role-playing game. The core of Murder on Eridanos is to solve a crime… and murder is just the beginning of what you will find. You will have to interrogate witnesses, learn about potential alibis, and argue who you believe is responsible. This also leads to some entertaining outcomes as it is up to you to decide what to do. Do you falsely accuse an innocent spectator? Do you present a poor case with lack of evidence? How will others respond? What happens if you try to convince people that you somehow are responsible for the murder? Yes, even that is possible. [Obsidian]… Expand"}, {"name": "Floor Kids", "details_link": "https://www.metacritic.com/game/switch/floor-kids", "publisher": "Merj Media", "release_date": "Dec  7 2017", "developers": ["Merj Media"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/0968f1b6b6b6e177078e0c58dd52469d-98.jpg", "descriptions": "Floor Kids is a new breakdance battle game featuring unique freestyle gameplay, rhythm challenges, and multiplayer sessions. Discover stylized hand-drawn graphics by award-winning animator JonJon set to an original soundtrack by world-renowned scratch DJ/producer Kid Koala. InnovativeFloor Kids is a new breakdance battle game featuring unique freestyle gameplay, rhythm challenges, and multiplayer sessions. Discover stylized hand-drawn graphics by award-winning animator JonJon set to an original soundtrack by world-renowned scratch DJ/producer Kid Koala. Innovative controls allow you the freedom to play the way you like with a dynamic scoring system that rewards your moves based on musicality, originality, and style. Build up your crew of bboys and bgirls, unlocking new characters and locations as you cross the city, busting hundreds of different moves and countless combinations on your journey from the corner to the club. Bring Your Skills. Build Your Crew. Find Your Style.… Expand"}, {"name": "Wonderbook: Diggs Nightcrawler", "details_link": "https://www.metacritic.com/game/playstation-3/wonderbook-diggs-nightcrawler", "publisher": "SCEA", "release_date": "Nov 12 2013", "developers": ["Exient Entertainment"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/78869920a299bd531c9015ad68377c64-98.jpg", "descriptions": "Diggs Nightcrawler is a film-noir inspired, detective story developed exclusively for Wonderbook for PlayStation 3 in partnership with the Academy Award winning Moonbot Studio. Players will partner up with Diggs Nightcrawler, a bookworm detective, in his quest to solve the mysterious crimesDiggs Nightcrawler is a film-noir inspired, detective story developed exclusively for Wonderbook for PlayStation 3 in partnership with the Academy Award winning Moonbot Studio. Players will partner up with Diggs Nightcrawler, a bookworm detective, in his quest to solve the mysterious crimes in Library City. Use the unique Wonderbook to manipulate the world and discover surprises around every corner and over every page.… Expand"}, {"name": "Ghostbusters: The Video Game", "details_link": "https://www.metacritic.com/game/wii/ghostbusters-the-video-game", "publisher": "Atari", "release_date": "Jun 16 2009", "developers": ["Red Fly Studio"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/9483fbedcc8025bceb7eaffd4448e4e0-98.jpg", "descriptions": "The Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a varietyThe Ghostbusters are back in an all new story penned by the original creators. With Manhattan newly overrun by ghosts and other supernatural creatures, it's up to you to take on the role of a new recruit joining the original film cast of the famous Ghostbusters team. Equipped with a variety of unique weapons and gadgets, you will hunt, fight and capture a wide range of uncanny phantasms and demons in an all new funny and frightening battle to save New York City from its latest paranormal plague. To deliver a special gaming experience to the tremendous Ghostbusters’ fan base around the world, the game features the original film cast from the classic Ghostbusters films, Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson, back again for the first time in more than 20 years. Supporting the ghost busting crew are the talents of Annie Potts, Brian Doyle Murray and William Atherton. [Sierra Entertainment]… Expand"}, {"name": "Star Wars Jedi Knight: Jedi Academy", "details_link": "https://www.metacritic.com/game/xbox/star-wars-jedi-knight-jedi-academy", "publisher": "LucasArts", "release_date": "Nov 19 2003", "developers": ["Vicarious Visions"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/be47ba892a00987ee7aac3d6b87865b0-98.jpg", "descriptions": "As a new student of Luke Skywalker's Jedi Academy, follow an ancient tradition and learn the powers--and dangers--of the Force.  Star Wars Jedi Knight:  Jedi Academy allows you to immerse yourself in the classic Star Wars universe as you take on the role of a student eager to learn the waysAs a new student of Luke Skywalker's Jedi Academy, follow an ancient tradition and learn the powers--and dangers--of the Force.  Star Wars Jedi Knight:  Jedi Academy allows you to immerse yourself in the classic Star Wars universe as you take on the role of a student eager to learn the ways of the Force from Master Luke Skywalker.  The game features customizable characters, all-new weapons, vehicles, and environments, and multiplayer modes.  You'll interact with famous classic Star Wars locations and characters while facing the ultimate choice: Fight for good and freedom on the light side or follow the path of power and evil to the dark side.  … Expand"}, {"name": "Mortal Kombat vs. DC Universe", "details_link": "https://www.metacritic.com/game/playstation-3/mortal-kombat-vs-dc-universe", "publisher": "Midway", "release_date": "Nov 16 2008", "developers": ["Midway"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/7f2d645e5ed30ee99a0eb56c37910317-98.jpg", "descriptions": "For the first time ever Scorpion, Sub-Zero and the Mortal Kombat warriors battle with Batman, Superman and other popular DC Universe Super Heroes. Choose your side and challenge your opponents with a new fighting system including Freefall Kombat and Klose Kombat along with dynamicFor the first time ever Scorpion, Sub-Zero and the Mortal Kombat warriors battle with Batman, Superman and other popular DC Universe Super Heroes. Choose your side and challenge your opponents with a new fighting system including Freefall Kombat and Klose Kombat along with dynamic multi-tiered environments. Plus, pick your favorite character from MK or DCU and pursue a fighting adventure in the new single player mode with an intertwined storyline and two unique perspectives. [Midway]… Expand"}, {"name": "Jak X: Combat Racing", "details_link": "https://www.metacritic.com/game/playstation-2/jak-x-combat-racing", "publisher": "SCEA", "release_date": "Oct 18 2005", "developers": ["Naughty Dog"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "6  Online", "genres": ["Driving", "Mission-based"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/c968e90d0d067158e91cd1d68dccfd62-98.jpg", "descriptions": "After Jak stopped the Dark Maker menace in his last adventure, cities were rebuilt, people flourished and sports reemerged to fill the void. Combat Racing became the biggest sport of all, as the excitement of high-speed competition brought crowds to the track. Kras City led the way, withAfter Jak stopped the Dark Maker menace in his last adventure, cities were rebuilt, people flourished and sports reemerged to fill the void. Combat Racing became the biggest sport of all, as the excitement of high-speed competition brought crowds to the track. Kras City led the way, with people flocking to the dangerous city of death and intrigue. When Jak and Daxter receive a mysterious invite to Kras City for the reading of Krew's Last Will and Testament, they find they have been joined by familiar faces such as Ashelin, Keira, Samos and Torn. When Krew reveals in his recording will that everyone present, including his daughter, Rayn, has been poisoned, everyone is shocked. Krew gives everyone an ultimatum -- the only way to get the poison antidote in time is to race for him in the next Kras City Grand Championship, or they will all die. Now, Jak and his friends are forced into a high-speed contest for their lives, as they are swept up into a deadly plot to win the biggest racing event on the planet -- against the best drivers in the world. With a deadly objective ahead of them, Jak and his friends take to the treacherous terrain as they are thrown into the driver's seat and find themselves racing against time in order to save the world. [SCEA]… Expand"}, {"name": "Dead Space 3", "details_link": "https://www.metacritic.com/game/playstation-3/dead-space-3", "publisher": "Electronic Arts", "release_date": "Feb  5 2013", "developers": ["Visceral Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Action Adventure", "Shooter", "Shooter", "Linear", "Third-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 76, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/3eaffddf3a950df22b46287009e9b0cd-98.jpg", "descriptions": "Dead Space 3 embodies deep space terror. Players take a thrilling ride through space that takes them to a hostile new planet, Tau Volantis. Fortunately, they are not alone this time around. The fully integrated drop-in/drop-out co-op feature gives players the option to play alone or team-upDead Space 3 embodies deep space terror. Players take a thrilling ride through space that takes them to a hostile new planet, Tau Volantis. Fortunately, they are not alone this time around. The fully integrated drop-in/drop-out co-op feature gives players the option to play alone or team-up with a friend anytime. Players that choose to take down the terror together experience additional story details, side missions and gameplay mechanics only found when playing as John Carver.… Expand"}, {"name": "Shadow Warrior 3: Definitive Edition", "details_link": "https://www.metacritic.com/game/pc/shadow-warrior-3-definitive-edition", "publisher": "Devolver Digital", "release_date": "Feb 16 2023", "developers": ["Flying Wild Hog"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/ba9fa20b48db47ca28474d97959ee522-98.jpg", "descriptions": "This updated version of Shadow Warrior 3--a free upgrade for existing owners--features a host of new items: a Survival mode, arenas, and weapon skins. This edition also introduces a New Game Plus mode, hardcore difficulty, and two visual options (60 frames-per-second performance or 4K visual)."}, {"name": "Assassin's Creed Valhalla: Dawn of Ragnarok", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-valhalla-dawn-of-ragnarok", "publisher": "Ubisoft", "release_date": "Mar 10 2022", "developers": ["Ubisoft Sofia"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/1009ff23dd53331bd7902b3c6936aae0-98.jpg", "descriptions": "In the most ambitious expansion in franchise history, Eivor must embrace their destiny as Odin, the Norse god of Battle and Wisdom. Unleash new divine powers as you embark on a desperate quest through a breathtaking world. Complete a legendary Viking saga and save your son in the face of theIn the most ambitious expansion in franchise history, Eivor must embrace their destiny as Odin, the Norse god of Battle and Wisdom. Unleash new divine powers as you embark on a desperate quest through a breathtaking world. Complete a legendary Viking saga and save your son in the face of the gods’ doom.… Expand"}, {"name": "The Wonderful 101: Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/the-wonderful-101-remastered", "publisher": "PlatinumGames", "release_date": "May 19 2020", "developers": ["PlatinumGames"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Action", "General"], "meta_score": 76, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/826dbeac559350df3f3378d5cbf567fb-98.jpg", "descriptions": "A team of heroes from around the world must UNITE to protect the earth from vicious alien invaders! This band of 100 Wonderful Ones works together using their fantastic abilities to create a variety of forms. Whether it be a giant fist or a sharp blade, they'll use their wits and power toA team of heroes from around the world must UNITE to protect the earth from vicious alien invaders! This band of 100 Wonderful Ones works together using their fantastic abilities to create a variety of forms. Whether it be a giant fist or a sharp blade, they'll use their wits and power to overcome the enemy's pitfalls and perils! And the final member of this team of courageous heroes... is you.Features:* Over 100 unique and dazzling heroes, each with their own backstories and emblems!* Change weapons in a flash with the 'Unite Morph' system! Draw shapes to switch between swords, whips, hammers, and more to battle with strategy and flair!* Unite Morphs can be more than just weapons! Build hang gliders and bridges to cross chasms, and bounce and blast your way to great heights! Use your smarts as well as your strength to solve puzzles and persevere!* Don't forget - a hero's true calling is protection! Rescue the citizens you come across and your bravery will inspire them to UNITE UP! For a limited time, of course.* Your missions will take around the world! Through cities, across the ocean floor, deep in the jungle, and to a host of exciting locations!… Expand"}, {"name": "Shenmue I & II", "details_link": "https://www.metacritic.com/game/pc/shenmue-i-ii", "publisher": "Sega", "release_date": "Aug 21 2018", "developers": ["Sega", "d3t Ltd"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/bc03b2004650e9d7462a59aa670c7d6c-98.jpg", "descriptions": "A tale of revenge.In 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father's death and sets out tracing LanA tale of revenge.In 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father's death and sets out tracing Lan Di's path.The first game in the series, Shenmue begins the tale as Ryo travels around Yokosuka, Japan, gathering clues about his father's murder and dealing with nefarious gangsters along the way.The sequel Shenmue II continues Ryo's quest, this time crossing the sea to Hong Kong, China. Ryo ventures deeper into the criminal underworld, meeting martial arts masters who aid him on his journey and offer insight into his father's death, and unravels the mysteries of the Dragon Mirror that his father kept hidden.Gameplay:* Take the role of Ryo Hazuki.* Explore a 3D open world searching for clues, examining objects, and talking to NPCs.* Battle enemies and bosses making full use of the moves of Hazuki-style jujitsu.* Beat quick-time events (QTEs) and mini-games.Key features:The best Shenmue experiencePioneering Dreamcast classics available for the first time on PCUpdated user interfaceChoice of modern or classic controlsJapanese audio available for the first time for a global audienceFully scalable screen resolutionsAn epic legendA tale of revenge on a grand scaleSolve the mystery of your father's murderAn experience never to be forgottenThe world feels aliveTalk to anyone, scour the world for cluesNPCs live independent lives on their own scheduleFaithful recreations of 1980s Japan and Hong Kong, ChinaDistract yourself with arcade games, collectibles, duck racing, and more… Expand"}, {"name": ".hack//G.U. Last Recode", "details_link": "https://www.metacritic.com/game/playstation-4/hackgu-last-recode", "publisher": "Bandai Namco Games", "release_date": "Nov  3 2017", "developers": ["CyberConnect2"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/542f5dc4d805982a299e4910efc2e9fa-98.jpg", "descriptions": ".hack//G.U. is back. Log back into the .hack//G.U. trilogy and return to \"The World,\" as Haseo tracks down Tri-Edge in .hack//G.U. Last Recode, now with enhanced graphics, improved gameplay, and brand new modes! This collection includes all 3 original .hack//G.U. titles, Rebirth, Reminisce,.hack//G.U. is back. Log back into the .hack//G.U. trilogy and return to \"The World,\" as Haseo tracks down Tri-Edge in .hack//G.U. Last Recode, now with enhanced graphics, improved gameplay, and brand new modes! This collection includes all 3 original .hack//G.U. titles, Rebirth, Reminisce, and Redemption, all fully restored and remastered for PS4.\r Immerse yourself in \"The World,\" a MMORPG, and find out what is real and what is reality in .hack//G.U. Set in 2017, years after the events of the first .hack series, \"The World\" has now been rebuilt. Follow Haseo as logs into \"The World\" and hunts PKs (Player Killers), in order to gain strength and track down Tri-Edge, a strong PK who attacked his friend, Shino, in the game and put her into a coma in real life. Relive the drama and epic battles in 1080p and 60fps, and improved battle balance and pacing for the definitive .hack//G.U. experience.… Expand"}, {"name": "Redout", "details_link": "https://www.metacritic.com/game/xbox-one/redout", "publisher": "505 Games", "release_date": "Aug 29 2017", "developers": ["34BigThings"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Racing", "General", "Arcade", "Futuristic"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/2c5114d79299e85b03ac7121149827af-98.jpg", "descriptions": "NEXT GENERATION AG RACING IS HERE! Redout is a tribute to the old racing monsters such as F-Zero, WipeOut, Rollcage, and POD. It is designed to be an uncompromising, fast, tough and satisfying driving experience, soaked in that vertigo that stands at the core of the arcade racing genre. TheNEXT GENERATION AG RACING IS HERE! Redout is a tribute to the old racing monsters such as F-Zero, WipeOut, Rollcage, and POD. It is designed to be an uncompromising, fast, tough and satisfying driving experience, soaked in that vertigo that stands at the core of the arcade racing genre. The floating system and driving models are based on physics: each turn, slope, hard braking, acceleration, each turn and twist of the track will apply a unique force to the ship. A sharp low-polygon style blends meshes and terrains with the latest state-of-the-art shading and lighting effects provided by the Unreal Engine 4, creating beautiful and instantly recognisable aesthetics. Breezy coastlines, eerie frozen landscapes, vast desert plains: the melancholic, dystopian atmosphere of a semi abandoned Earth is the background for the most high-speed, tense and beautiful futuristic racing clashes.… Expand"}, {"name": "Unit 4", "details_link": "https://www.metacritic.com/game/xbox-one/unit-4", "publisher": "Gamera Games", "release_date": "May 24 2017", "developers": ["Gamera Games", "Gamera Interactive", "Gamera Game"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/f2031d70d9ba62dbed0e84bfbd991fde-98.jpg", "descriptions": "Perform impossible tricks, play with your friends and get ready to save the universe. Play as an elite squad of agents with amazing skills in this 4-player cooperative, fast-paced action game where you’ll face off with huge bosses and evils aliens."}, {"name": "Watch Dogs: Bad Blood", "details_link": "https://www.metacritic.com/game/playstation-4/watch-dogs-bad-blood", "publisher": "Ubisoft", "release_date": "Sep 30 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/aded1b452ec0a41e98e7ca3aa698ed8d-98.jpg", "descriptions": "Assume the role of T-Bone Grady, the legendary and eccentric hacker and Aiden Pearce's trusted comrade. Now on the run from Blume, T-Bone must make the decision to run and start a new life or fight Blume to save an old friend. Face your shady past on your road to redemption. [Ubisoft]"}, {"name": "Madden NFL 25", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-25", "publisher": "Electronic Arts", "release_date": "Aug 27 2013", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade", "Sim"], "meta_score": 76, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/c24e8aa936866e14902bf0822139720b-98.jpg", "descriptions": "The most significant change in Connected Franchise is the introduction of Owner mode. Take control of your franchise and manage all aspects of the day-to-day operation of your team. Create yourself as an owner or take on the persona of one of the NFL’s 32 current head honchos. Hire and fireThe most significant change in Connected Franchise is the introduction of Owner mode. Take control of your franchise and manage all aspects of the day-to-day operation of your team. Create yourself as an owner or take on the persona of one of the NFL’s 32 current head honchos. Hire and fire personnel, set prices on everything from parking to concessions, manage stadium upgrades or even build a new one if your current facility just isn’t cutting it. Or, if you’d prefer a truly fresh start for your team, you can relocate your franchise to a new city and try to build a new fanbase from scratch.… Expand"}, {"name": "Super Monday Night Combat", "details_link": "https://www.metacritic.com/game/pc/super-monday-night-combat", "publisher": "Uber Entertainment", "release_date": "Apr 19 2012", "developers": ["Uber Entertainment"], "platforms": "PC", "genres": ["Action", "Strategy", "Shooter", "Real-Time", "Third-Person", "MOBA", "MOBA", "Modern"], "meta_score": 76, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/7/6bdd342646cd61a5d4660319c87cd556-98.jpg", "descriptions": "Uber Entertainment follows up on its original class-based shooter with a new freemium business model, new classes, modes, maps, and more."}, {"name": "Who's That Flying?!", "details_link": "https://www.metacritic.com/game/psp/whos-that-flying!", "publisher": "SCEA", "release_date": "Nov 16 2010", "developers": ["Mediatonic"], "platforms": ["iPhone/iPad", "PC", "PSP"], "genres": ["Adventure", "General", "Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 76, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/ce7cce0b82c58abe8428f741b0572331-98.jpg", "descriptions": "\"Who's That Flying?!\" is a left-to- right side-scrolling shoot'em-up where the player takes control of the \"Guardian of Earth\" to fight off hordes of Doom Beast that threaten to escape and destroy the cities of Earth over five unique stages."}, {"name": "Resident Evil Archives: Resident Evil", "details_link": "https://www.metacritic.com/game/wii/resident-evil-archives-resident-evil", "publisher": "Capcom", "release_date": "Jun 23 2009", "developers": ["Capcom"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 76, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/4/1e7e8604216719d544bcdd41c8fa945d-98.jpg", "descriptions": "You take control of S.T.A.R.S. Alpha team members Chris Redfield and Jill Valentine (both recently seen in the smash hit, Resident Evil 5). Your mission is to investigate the ominous mansion at the core of the horrific disaster and uncover the secrets behind a radical, genetic researchYou take control of S.T.A.R.S. Alpha team members Chris Redfield and Jill Valentine (both recently seen in the smash hit, Resident Evil 5). Your mission is to investigate the ominous mansion at the core of the horrific disaster and uncover the secrets behind a radical, genetic research facility. With unspeakable horrors lurking around every corner, the ultimate test will be to make it out alive! Relive the thrills and terror that defined the genre of Survival Horror and launched a franchise that has sold over 40 million games worldwide. [Capcom]… Expand"}, {"name": "Sniper Elite", "details_link": "https://www.metacritic.com/game/pc/sniper-elite", "publisher": "Namco", "release_date": "Oct 27 2005", "developers": ["Rebellion"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/1d007bd870a2204b88438569a40bc21b-98.jpg", "descriptions": "In Sniper Elite, players assume the role of an American sniper, disguised as a German soldier and dropped into war torn 1945 Berlin by the American OSS to gather intelligence on the top-secret German Atomic research. If his mission fails, control of the world's Atomic technology will fallIn Sniper Elite, players assume the role of an American sniper, disguised as a German soldier and dropped into war torn 1945 Berlin by the American OSS to gather intelligence on the top-secret German Atomic research. If his mission fails, control of the world's Atomic technology will fall into the hands of Stalin and the Soviet Army, throwing the world's political climate into chaos. In the undercover mission, players utilize their sniper training to gain access to key positions by taking out machine guns, armored vehicles, guard posts and sentries through stealth and pinpoint accuracy. Like a true sniper, players must follow their wits and instincts and utilize both first and third-person perspectives to negotiate through 28 open-ended levels in war-torn Berlin. In taking aim at enemy soldiers, players need to consider gravity, wind speed, heart rate, breathing and posture to successfully hit their target in one of the most authentic sniping mechanics ever devised. Players can even take up the fight or go head-to-head with a friend in the cooperative or competitive offline play modes, or even engage in a game of worldwide cat-and-mouse with up to eight players online. [Namco]… Expand"}, {"name": "Midway Arcade Treasures", "details_link": "https://www.metacritic.com/game/playstation-2/midway-arcade-treasures", "publisher": "Midway", "release_date": "Nov 18 2003", "developers": ["Midway"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/ca29bfa8e4648e6b762ad12789c6b2f0-98.jpg", "descriptions": "Midway Arcade Treasures is jam packed with over 20 classic arcade games including all-time favorites SpyHunter, Defender, Gauntlet, Joust and more for the first-time on next generation consoles. Take a trip down memory lane with more than 20 video games you loved to play at the arcade.Midway Arcade Treasures is jam packed with over 20 classic arcade games including all-time favorites SpyHunter, Defender, Gauntlet, Joust and more for the first-time on next generation consoles. Take a trip down memory lane with more than 20 video games you loved to play at the arcade. Including, the fast pace action of SpyHunter, the multi-player collaboration of Gauntlet, the space age adventure of Defender, and the dueling combat of Joust; the Midway Arcade Treasures has hundreds of hours of classic gameplay action. And that?s not all! This ultimate arcade collection also contains cool DVD content with game histories, creator interviews and top secrets from back in the day. [Midway]… Expand"}, {"name": "Lufia: The Ruins of Lore", "details_link": "https://www.metacritic.com/game/game-boy-advance/lufia-the-ruins-of-lore", "publisher": "Atlus Co.", "release_date": "May  6 2003", "developers": ["Taito Corporation"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/26ae9a2696e85ba3bd588d8b663a2245-98.jpg", "descriptions": "This exciting new chapter in the Lufia saga follows the adventures of Eldin, Torma, and Rami, a group of friends and would-be hunters as they set out in search of treasure, only to discover that fate has much more in store for them! Will they be able to solve the mysteries of the ancientThis exciting new chapter in the Lufia saga follows the adventures of Eldin, Torma, and Rami, a group of friends and would-be hunters as they set out in search of treasure, only to discover that fate has much more in store for them! Will they be able to solve the mysteries of the ancient ruins and stop the power-hungry leader Ragule from resurrecting the ancient beast, or will Ragules ambitions be realized at the expense of mankind? Prepare for the Adventure of a Lifetime! … Expand"}, {"name": "BloodRayne", "details_link": "https://www.metacritic.com/game/xbox/bloodrayne", "publisher": "Majesco Games", "release_date": "Oct 15 2002", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/75621a678151bc8e54e1b4ddbe996e55-98.jpg", "descriptions": "BloodRayne is a killing machine. The Brimstone Society calls upon this half-vampire, half-human agent to take on two missions in the years between the world wars. At the root of these missions is one man who searches for powerful occult artifacts that would bring Germany into a new age ofBloodRayne is a killing machine. The Brimstone Society calls upon this half-vampire, half-human agent to take on two missions in the years between the world wars. At the root of these missions is one man who searches for powerful occult artifacts that would bring Germany into a new age of domination. As BloodRayne, you must stop this man's elite Nazi army from releasing terrorizing creatures onto the world. With melee attacks, weapons, and bloodsucking abilities, your enemies won't stand a chance.… Expand"}, {"name": "MX Superfly", "details_link": "https://www.metacritic.com/game/gamecube/mx-superfly", "publisher": "THQ", "release_date": "Jun 25 2002", "developers": ["Pacific Coast Power & Light"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/5a237371143597e2fa0dcda9c0ce5bf0-98.jpg", "descriptions": "The excitement of motocross racing and freestyle is now available in MX Superfly. The game features expanded career modes, all-new minigames, top-notch pros, and unbelievable stunts including a freestyle track editor. Reap the rewards of racing through an entire season of intense motocrossThe excitement of motocross racing and freestyle is now available in MX Superfly. The game features expanded career modes, all-new minigames, top-notch pros, and unbelievable stunts including a freestyle track editor. Reap the rewards of racing through an entire season of intense motocross action while upgrading your gear and bike along the way. For free ride action, you can compete in the new freestyle career mode, dazzling the crowd with new tricks and dangerous maneuvers. Or simply ride the open terrain searching for secret areas without the burden of competition.… Expand"}, {"name": "Star Wars Starfighter: Special Edition", "details_link": "https://www.metacritic.com/game/xbox/star-wars-starfighter-special-edition", "publisher": "LucasArts", "release_date": "Nov 26 2001", "developers": ["Secret Level"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/9feeb7322a4c24074d99670151a770eb-98.jpg", "descriptions": "Courage, skill, and honor are the three primary qualities you must bring to Star Wars Starfighter, a flight adventure that features intense air and space combat. Join three starfighter pilots in a series of harrowing missions to save Naboo and the galaxy from the oppressive abuses of theCourage, skill, and honor are the three primary qualities you must bring to Star Wars Starfighter, a flight adventure that features intense air and space combat. Join three starfighter pilots in a series of harrowing missions to save Naboo and the galaxy from the oppressive abuses of the Trade Federation. You'll pilot the Naboo N-1 and a variety of never-before-seen craft through real-world environments. Your fighting skills will be put to the test in more than 14 intense missions.… Expand"}, {"name": "BreakNeck (2000)", "details_link": "https://www.metacritic.com/game/pc/breakneck-2000", "publisher": "SouthPeak Games", "release_date": "Jun 21 2000", "developers": ["Synetic"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 76, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/aa055ca514b3ff23bdf577737e59af6a-98.jpg", "descriptions": "Want to be hurled into the most stunning racing environments ever seen on PC? Want to race with over 40 vehicles, across 24 tracks in seven different scenarios? Want to feel the road under your wheels? Want to feel the recoil as you unleash a missile? Your life needs BreakNeck. The speed isWant to be hurled into the most stunning racing environments ever seen on PC? Want to race with over 40 vehicles, across 24 tracks in seven different scenarios? Want to feel the road under your wheels? Want to feel the recoil as you unleash a missile? Your life needs BreakNeck. The speed is spine-crushing!  [SouthPeak Interactive]… Expand"}, {"name": "Tak: The Great Juju Challenge", "details_link": "https://www.metacritic.com/game/gamecube/tak-the-great-juju-challenge", "publisher": "THQ", "release_date": "Sep 19 2005", "developers": ["Avalanche Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/3b48d9e07c49f6d738c46e62e75db93f-98.jpg", "descriptions": "The third chapter in THQ's Tak series lets the player reprise the role of Tak, a shaman who uses magic to defeat enemies. Tak: The Great Juju Challenge features a new cooperative mode in which two players can solve puzzles together."}, {"name": "Scott Pilgrim vs. the World: The Game - Complete Edition", "details_link": "https://www.metacritic.com/game/playstation-4/scott-pilgrim-vs-the-world-the-game---complete-edition", "publisher": "Ubisoft", "release_date": "Jan 14 2021", "developers": ["Ubisoft", "Engine Software"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/eae0b0c34399fedd0b5d8f08630af7f5-98.jpg", "descriptions": "Play as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesomePlay as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesome mini-games to see who ends up on top! Can you defeat Ramona's League of Evil Exes as you try to win her heart? Epic battles with Lucas Lee, Gideon Graves, and more await Scott Pilgrim and his friends. Zombie hordes? Dodgeball? Battle Royale? Just a few of the things you'll find playing through this Complete Edition. Compete in sub-space mini-games, experience a killer soundtrack, and much more as you re-live the beloved story of Scott Pilgrim vs. the World.… Expand"}, {"name": "Star Ocean: Second Evolution", "details_link": "https://www.metacritic.com/game/psp/star-ocean-second-evolution", "publisher": "Square Enix", "release_date": "Jan 19 2009", "developers": ["TOSE"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/df7af7f25d2236d9dd37baac7b865266-98.jpg", "descriptions": "Following the exploits of humankind’s journey across the stars, the STAR OCEAN saga comes to life in the completely remastered STAR OCEAN: Second Evolution, exclusively for the PSP system. Now with a revised game engine, an improved battle system and fully voiced, all-new animated scenesFollowing the exploits of humankind’s journey across the stars, the STAR OCEAN saga comes to life in the completely remastered STAR OCEAN: Second Evolution, exclusively for the PSP system. Now with a revised game engine, an improved battle system and fully voiced, all-new animated scenes displayed in 16:9 widescreen, players can experience their journey through the rich STAR OCEAN universe like never before. [Square Enix]… Expand"}, {"name": "Victoria II", "details_link": "https://www.metacritic.com/game/pc/victoria-ii", "publisher": "Paradox Interactive", "release_date": "Aug 13 2010", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/bce73042153540cd9b8d42349bf9533b-98.jpg", "descriptions": "Created by the developers of Europa Universalis and Hearts of Iron, Victoria 2 is a grand strategy game set during the colonial era of the 19th century and is scheduled for release in Q3 2010. Gamers will guide their nation from the era of absolute monarchies in the early 19th century,Created by the developers of Europa Universalis and Hearts of Iron, Victoria 2 is a grand strategy game set during the colonial era of the 19th century and is scheduled for release in Q3 2010. Gamers will guide their nation from the era of absolute monarchies in the early 19th century, through expansion and colonization in hopes of becoming a truly great power by the dawn of the 20th century.… Expand"}, {"name": "Bonsai Barber", "details_link": "https://www.metacritic.com/game/wii/bonsai-barber", "publisher": "Nintendo", "release_date": "Mar 30 2009", "developers": ["Zoonami Ltd."], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/1d56060043868e1d5e94f47f1e0d8ce1-98.jpg", "descriptions": "[WiiWare]  The village residents are hungry for the latest in foliage fashion, and it's up to you, the new barber, to fix them up. Use the tools of your trade: scissors, clippers, spray can, and more in this humorous, first-of-its-kind \"first-person-groomer\" game. Bonsai Barber features a[WiiWare]  The village residents are hungry for the latest in foliage fashion, and it's up to you, the new barber, to fix them up. Use the tools of your trade: scissors, clippers, spray can, and more in this humorous, first-of-its-kind \"first-person-groomer\" game. Bonsai Barber features a colorful cast of 12 intriguing customers, including a temperamental shallot starlet (don't call her an onion), an oddball strawberry boffin, a cactus cowboy, a daredevil carrot, and a suave banana with top-secret clearance. Each day, five customers arrive to test your stylistic skill. If the customer requests a specific style, you'll plow that furrow, or you can rely on your expertise to pick from more than 30 popular fashions. Or, why not turn over a new leaf? Be creative and see how they react. They're a demanding bunch, so if you miss an appointment, you'll hear about it-on your Wii Message Board. If you do a good job, you may receive a gift or even a postcard from an exotic destination as your happy customers travel to distant lands and show off their exquisite coifs. [Nintendo]… Expand"}, {"name": "Dear Esther", "details_link": "https://www.metacritic.com/game/pc/dear-esther", "publisher": "The Chinese Room", "release_date": "Apr 26 2012", "developers": ["The Chinese Room"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Fantasy"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/bd2f1d933acc77096e4c500b2a329e01-98.jpg", "descriptions": "Dear Esther is a first-person ghost story. Rather than traditional game-play the focus here is on exploration, uncovering the mystery of a lonely island, of who you are and why you are here. Fragments of story are randomly uncovered when exploring the various locations of the island, makingDear Esther is a first-person ghost story. Rather than traditional game-play the focus here is on exploration, uncovering the mystery of a lonely island, of who you are and why you are here. Fragments of story are randomly uncovered when exploring the various locations of the island, making every each journey a unique experience.… Expand"}, {"name": "Stubbs the Zombie in Rebel Without a Pulse", "details_link": "https://www.metacritic.com/game/xbox/stubbs-the-zombie-in-rebel-without-a-pulse", "publisher": "Aspyr", "release_date": "Oct 18 2005", "developers": ["Wideload Games Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/1973d4ad0fcf9d90648544bec9d9f59e-98.jpg", "descriptions": "Stubbs the Zombie has been disturbed from his eternal rest 50 years after his death, and you can help him get revenge on those that woke him. Roam the city of Punchbowl while using your zombie powers to take control of its inhabitants. You can turn citizens into zombies, possess them, or useStubbs the Zombie has been disturbed from his eternal rest 50 years after his death, and you can help him get revenge on those that woke him. Roam the city of Punchbowl while using your zombie powers to take control of its inhabitants. You can turn citizens into zombies, possess them, or use your other undead abilities in battle. You'll fight civilians, police, and militia on your way to getting your revenge on the city's designer, Andrew Monday. Stubbs the Zombie in Rebel Without a Pulse is a third-person action game that uses an updated version of the Halo game engine.… Expand"}, {"name": "Shin Megami Tensei III: Nocturne HD Remaster", "details_link": "https://www.metacritic.com/game/switch/shin-megami-tensei-iii-nocturne-hd-remaster", "publisher": "Sega", "release_date": "May 25 2021", "developers": ["Atlus"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/54e54008a9d5af1a1f99c67b8d37f22a-98.jpg", "descriptions": "Reawaken your inner demon in a modernized version of the acclaimed ATLUS classic, Shin Megami Tensei III Nocturne HD Remaster. What begins as a normal day in Tokyo turns out to be everything but, when the Conception – an ethereal apocalypse – is invoked. The remains of the world areReawaken your inner demon in a modernized version of the acclaimed ATLUS classic, Shin Megami Tensei III Nocturne HD Remaster. What begins as a normal day in Tokyo turns out to be everything but, when the Conception – an ethereal apocalypse – is invoked. The remains of the world are swallowed by chaos, as a demonic revolution descends into a broken city. Caught between a battle of Gods and demons, the choices you make can bring life, rebirth, or death, and determine who triumphs. This genre-defining, infamously punishing RPG is back and now includes:\rRemastered 3D models and backgrounds\rAdditional difficulty settings for players of all skill levels\rSuspend save -- save your progress whenever you need!\rVoiced audio -- choose between Japanese and English VO\r… Expand"}, {"name": "Alan Wake: The Signal", "details_link": "https://www.metacritic.com/game/xbox-360/alan-wake-the-signal", "publisher": "Microsoft Game Studios", "release_date": "Jul 27 2010", "developers": ["Remedy Entertainment"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "Horror", "Survival"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/32ae7de8cc1c7846d56971192eec993b-98.jpg", "descriptions": "In this first downloadable content pack we find Wake facing a threat unlike anything he's ever encountered before -- and yet one he's intimately familiar with. In order to make sense of it all, he must follow the Signal."}, {"name": "de Blob 2", "details_link": "https://www.metacritic.com/game/ds/de-blob-2", "publisher": "THQ", "release_date": "Feb 22 2011", "developers": ["Halfbrick Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "DS"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/407ad955caed3013eaf86820ca9ce308-98.jpg", "descriptions": "This is the follow-up title to 2008's popular hit de Blob."}, {"name": "The Godfather", "details_link": "https://www.metacritic.com/game/playstation-2/the-godfather", "publisher": "Electronic Arts", "release_date": "Mar 21 2006", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/cbad7a173c2766c995e7b1890bbd609a-98.jpg", "descriptions": "The book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mobThe book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mob character in the game, putting themselves into the action while reliving classic moments from the fiction and experiencing original missions alongside memorable characters from the film.  After a life of small-time jobs and petty thefts the player is accepted into the Corleone family, America's most famous criminal organization. It is up to the player to carry out orders, earn respect and make New York City their own. Featuring non-linear action-adventure gameplay, The Godfather offers gamers countless choices for solving the family’s problems with brutal violence, skillful diplomacy, or a cunning mixture of both. From mob hits and bank heists to drive-bys and extortion, step deep inside the world of The Godfather where intimidation and negotiation are your tickets to the top.  Players use their powers of loyalty and fear to earn respect through interactions with characters in the world.  Decisions made by the player in the game have lasting consequences, just as it was in the mob underworld featured in The Godfather fiction. James Caan, Robert Duvall, and the late Marlon Brando provided voice acting and likenesses for the game. [Electronic Arts]… Expand"}, {"name": "Not A Hero: Super Snazzy Edition", "details_link": "https://www.metacritic.com/game/xbox-one/not-a-hero-super-snazzy-edition", "publisher": "Team17", "release_date": "May 24 2016", "developers": ["roll7"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/c6c05c9a59285c4c4b33a74906fb292f-98.jpg", "descriptions": "Professional assassin turned amateur campaign manager Steve is charged with cleaning up the city by an anthropomorphic rabbit and mayoral candidate from the future named BunnyLord. Now Steve and his expanding roster of dubious heroes must wield their unique skills to shoot, slide, dive, andProfessional assassin turned amateur campaign manager Steve is charged with cleaning up the city by an anthropomorphic rabbit and mayoral candidate from the future named BunnyLord. Now Steve and his expanding roster of dubious heroes must wield their unique skills to shoot, slide, dive, and take cover behind a political platform built on ethics, accountability, and an inordinate amount of gunfire. Eliminate the criminal underworld of the city’s three major districts and persuade undecided voters to your cause, tackling the issues that matter by putting a gun in the mouth of those issues.… Expand"}, {"name": "Unravel", "details_link": "https://www.metacritic.com/game/xbox-one/unravel", "publisher": "Electronic Arts", "release_date": "Feb  9 2016", "developers": ["Coldwood Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/fa1d010afc9aeb40248e5153ef8f5c7b-98.jpg", "descriptions": "Yarny's mission is to mend broken bonds and the yarn represents the love and connection between people. The player will use Yarny's thread to do things such as swinging across gaps or rappelling down trees. Te game will also challenge gamers to use the thread in clever and creative ways.Yarny's mission is to mend broken bonds and the yarn represents the love and connection between people. The player will use Yarny's thread to do things such as swinging across gaps or rappelling down trees. Te game will also challenge gamers to use the thread in clever and creative ways. [Electronic Arts]… Expand"}, {"name": "The Dream Machine", "details_link": "https://www.metacritic.com/game/pc/the-dream-machine", "publisher": "Cockroach Inc.", "release_date": "Dec 14 2010", "developers": ["Cockroach Inc."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "General", "General", "Point-and-Click"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/262e2aabc1d68c69a50ae8f0f7ee0f5b-98.jpg", "descriptions": "A point-and-click adventure where you play as a couple, Victor and Alicia, who have recently moved into their new apartment only to discover an unsettling secret about their new home."}, {"name": "MX vs. ATV Reflex", "details_link": "https://www.metacritic.com/game/xbox-360/mx-vs-atv-reflex", "publisher": "THQ", "release_date": "Dec  1 2009", "developers": ["Rainbow Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/42c9d3706dc456a2ea7a99e1addffa9f-98.jpg", "descriptions": "MX vs. ATV Reflex marks the return of the off-road racing franchise and features the all-new Rhythm Racing 2.0 physics engine, Rider Reflex control system and real-time terrain deformation. The Rider Reflex control system provides unparalleled precision and fluidity by separating machineMX vs. ATV Reflex marks the return of the off-road racing franchise and features the all-new Rhythm Racing 2.0 physics engine, Rider Reflex control system and real-time terrain deformation. The Rider Reflex control system provides unparalleled precision and fluidity by separating machine steering from body positioning, which allows the independently controlled rider to shift his weight, perform death-defying stunts and avoid potentially devastating wrecks.  Unprecedented terrain deformation creates ever-changing courses as off-road vehicles carve lines and deep ruts that have a real-time impact on gameplay and remain persistent through the full length of each race. [THQ]… Expand"}, {"name": "TT Isle of Man: Ride On The Edge 2", "details_link": "https://www.metacritic.com/game/xbox-one/tt-isle-of-man-ride-on-the-edge-2", "publisher": "Bigben Interactive", "release_date": "Mar 19 2020", "developers": ["KT Racing"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 75, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/bacf4162e7be64261cbd3365851522a2-98.jpg", "descriptions": "Without a shadow of a doubt it is one of the most dangerous motorbike races in the world. In TT Isle of Man – Ride On the Edge 2, you prove your worth in different championships before setting out to conquer the Snaefell Mountain Course, a 60 km-long track with both winding and straightWithout a shadow of a doubt it is one of the most dangerous motorbike races in the world. In TT Isle of Man – Ride On the Edge 2, you prove your worth in different championships before setting out to conquer the Snaefell Mountain Course, a 60 km-long track with both winding and straight sections that will push your riding skills to the limit. TT 2 features 17 additional tracks, 18 different motorbikes including classic models, and the official riders. And now it’s more realistic than ever, thanks to entirely revamped physics and faithfully reproduced rider movements. Fine-tune your motorbike, upgrade its performance and monitor its data in real time so you can stay competitive. TT2 also offers a brand-new open world, a biker's paradise where you can test your bike settings and gain the experience you'll need to win the TT Isle of Man title!… Expand"}, {"name": "Darksiders II: Deathinitive Edition", "details_link": "https://www.metacritic.com/game/xbox-one/darksiders-ii-deathinitive-edition", "publisher": "Nordic Games Publishing", "release_date": "Oct 30 2015", "developers": ["Gunfire Games", "Kaiko"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/56da89120d0c98207e6d633552b6f72d-98.jpg", "descriptions": "Darksiders II follows the actions of Death, one of the four horsemen of the Apocalypse, in a tale that runs parallel to the events in the original Darksiders game. This journey propels Death across an expansive game world as he tries to redeem his brother, War, the horseman blamed forDarksiders II follows the actions of Death, one of the four horsemen of the Apocalypse, in a tale that runs parallel to the events in the original Darksiders game. This journey propels Death across an expansive game world as he tries to redeem his brother, War, the horseman blamed for prematurely starting the Apocalypse in Darksiders.… Expand"}, {"name": "Super Monkey Ball: Banana Mania", "details_link": "https://www.metacritic.com/game/playstation-5/super-monkey-ball-banana-mania", "publisher": "Sega", "release_date": "Oct  2 2021", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/40c6426d55c2f1fcd1d91c98b25680bb-98.jpg", "descriptions": "Go Bananas with your favorite monkey gang in the ultimate Super Monkey Ball adventure. Roll through wondrous worlds with AiAi and friends as you race to stop monkey mad scientist Dr. Bad-Boon from blowing up Jungle Island! Join the all-star monkey team of AiAi, MeeMee, GonGon, Baby, YanYanGo Bananas with your favorite monkey gang in the ultimate Super Monkey Ball adventure. Roll through wondrous worlds with AiAi and friends as you race to stop monkey mad scientist Dr. Bad-Boon from blowing up Jungle Island! Join the all-star monkey team of AiAi, MeeMee, GonGon, Baby, YanYan and Doctor as you bounce, tilt, and roll your way across hundreds of delightfully crafted levels and mazes. It’s monkey business for the gang - play solo or with friends as you take down Dr. Bad-Boon and steal back your beloved bananas!\rFeatures:\r The ultimate Super Monkey Ball Experience – More than 300 stages from Super Monkey Ball, Super Monkey Ball 2 and Super Monkey Ball Deluxe. \r Go Bananas with 12 fun minigames including Monkey Racing, Monkey Soccer, Monkey Bowling, Monkey Baseball and much more! \r Challenge your friends as you compete for top banana on the online leaderboards!\r  Assemble your all-star monkey team of up to 4 friends and work together to save Jungle Island with 4-player local co-op. \r Immerse yourself in the Super Monkey Ball world with creative comic book-style story telling in Story Mode.\r  Want to be the coolest monkey on the block? Customize your character and Super Monkey Ball to make it your own!\r… Expand"}, {"name": "Sherlock Holmes: Chapter One", "details_link": "https://www.metacritic.com/game/xbox-series-x/sherlock-holmes-chapter-one", "publisher": "Frogwares", "release_date": "Nov 16 2021", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X"], "genres": ["Action Adventure", "Adventure", "General", "3D", "Open-World", "First-Person"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/3d8ed9df5b49313d42181f2978574bf5-98.jpg", "descriptions": "In this story-driven detective thriller, a young Sherlock Holmes struggles to prove himself as he navigates an exotic, dangerous island in the Mediterranean to investigate the mystery of his mother’s death."}, {"name": "Trigger Witch", "details_link": "https://www.metacritic.com/game/switch/trigger-witch", "publisher": "EastAsiaSoft", "release_date": "Jul 29 2021", "developers": ["Rainbite"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/82f94fcd266fdf56518a8121015df714-98.jpg", "descriptions": "Magic and firearms make a deadly combo. Recalling the visual style and intuitive gameplay of 16-bit action-adventure classics, Trigger Witch puts an ultra-violent spin on cute and colorful pixel art. With a compelling and original narrative, puzzling environments to explore, a dynamicMagic and firearms make a deadly combo. Recalling the visual style and intuitive gameplay of 16-bit action-adventure classics, Trigger Witch puts an ultra-violent spin on cute and colorful pixel art. With a compelling and original narrative, puzzling environments to explore, a dynamic soundtrack, twin-stick shooter mechanics and a vast array of enemies to blast into smithereens, this is a tale that will grip you from start to bloody finish. From the creators of Reverie, Trigger Witch is a stylized 2D twin-stick action game set in an odd open world where magic is outdated and firearms are the new way of life. Players assume the role of Colette, a prospective graduate from the Stock, an academy for Witchcraft and Triggery. After a mysterious man invades her realm, events are set in motion that turn Colette’s life upside-down, casting her as the sole heroine with enough firepower to restore peace.… Expand"}, {"name": "Smelter", "details_link": "https://www.metacritic.com/game/switch/smelter", "publisher": "DANGEN Entertainment", "release_date": "Apr 22 2021", "developers": ["X Plus"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "Platformer", "General", "2D"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/e9b8b72ea0a3a7c98b6931ad65f1f6cd-98.jpg", "descriptions": "Time To Get Eve’n\r You are Eve, fresh out of Eden and armed with a living suit of armor. Explore a dangerous new world, battle its bizarre denizens and expand your empire in a desperate journey to find Adam.\r\n\r\nSmelter is a strategy, action-platformer combo inspired by classics from theTime To Get Eve’n\r You are Eve, fresh out of Eden and armed with a living suit of armor. Explore a dangerous new world, battle its bizarre denizens and expand your empire in a desperate journey to find Adam.\r Smelter is a strategy, action-platformer combo inspired by classics from the 16-bit era. Lead Smelter and his faithful Zirm forces by expanding Smelter’s territory across the Rumbly Lands in top-down strategy levels, then dive into thrilling side-scrolling action stages after annexing key locations. Build, attack and advance your army -- unlock, upgrade and unleash elemental action skills against vicious enemies, perilous environments and dangerous bosses. Release the power of Smelter!\r STORY\rAfter the untimely destruction of the Garden, Eve finds herself in an unfamiliar world with her beloved Adam nowhere to be found. In her search for Adam, she encounters Smelter, an unusually over-confident, winged creature with the powerful ability to transform and fuse with others, giving them incredible powers.\r Offering his apparently “invaluable” assistance, Smelter transforms and fuses with Eve. They depart on a journey to the treacherous Rumbly Lands. There, they expand Smelter’s territory, allowing them to reach further into the various domains to find out what happened to her Adam, hoping to find him in one piece and find a way back home to their peaceful lives...… Expand"}, {"name": "Superliminal", "details_link": "https://www.metacritic.com/game/switch/superliminal", "publisher": "Pillow Castle Games", "release_date": "Jul  7 2020", "developers": ["Pillow Castle Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 9.6, "image": "https://static.metacritic.com/images/products/games/6/ecf9838412c248378638db43bb134a5e-98.jpg", "descriptions": "Perception is reality. Escape from a mind-bending dream where everything is exactly as it seems.\r As you fall asleep with the TV on at 3AM, you remember catching a glimpse of the commercial from Dr.Pierce’s Somnasculpt dream therapy program. By the time you open your eyes, you’re alreadyPerception is reality. Escape from a mind-bending dream where everything is exactly as it seems.\r As you fall asleep with the TV on at 3AM, you remember catching a glimpse of the commercial from Dr.Pierce’s Somnasculpt dream therapy program. By the time you open your eyes, you’re already dreaming - beginning the first stages of this experimental program. Welcome to Superliminal.\r Superliminal is a first-person puzzle game based on forced perspective and optical illusions. Puzzles in this game give you a sense of the unexpected. Players need to change their perspective and think outside the box to wake up from the dream.\r… Expand"}, {"name": "The Mummy Demastered", "details_link": "https://www.metacritic.com/game/playstation-4/the-mummy-demastered", "publisher": "WayForward", "release_date": "Oct 24 2017", "developers": ["WayForward"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/371e778de1ddadd08b66e5ba5d00c924-98.jpg", "descriptions": "A powerful ancient evil has arisen, and the war to save humanity has begun. The Mummy Demastered throws you into a 16-bit-inspired battle against the undead in a 2D, nonlinear, action-packed adventure."}, {"name": "Armello", "details_link": "https://www.metacritic.com/game/pc/armello", "publisher": "League of Geeks", "release_date": "Sep  1 2015", "developers": ["League of Geeks"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "General", "Board / Card Game"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/d6426c0f980f20ad492653f405e88541-98.jpg", "descriptions": "A swashbuckling adventure that combines the strategic play of card and board games with RPG elements. Wage single and multiplayer strategy battles as you adventure across the land of Armello on your quest for the throne."}, {"name": "Poker Night 2", "details_link": "https://www.metacritic.com/game/pc/poker-night-2", "publisher": "Telltale Games", "release_date": "Apr 26 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/3ca7b2d27ca4c8a3d3f65d4fde46ea6a-98.jpg", "descriptions": "Poker Night 2 is the sequel to Poker Night where you play poker with a bunch of \"weirdos\" officially licensed, triple 'A' characters such as Claptrap, Brock Samson, Ash Williams, and Sam."}, {"name": "Borderlands 2: Sir Hammerlock's Big Game Hunt", "details_link": "https://www.metacritic.com/game/pc/borderlands-2-sir-hammerlocks-big-game-hunt", "publisher": "2K Games", "release_date": "Jan 15 2013", "developers": ["Gearbox Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/f15c095a47f774e423c745d6df7cacd5-98.jpg", "descriptions": "In this DLC, players encounter uncharted territory deep in the swamps of Pandora where a very large Hyperion ship has crashed down. The wreckage is believed to have stockpiles of cash and booty. But watch yourself because mutant creatures, and armies of savages also had their interest piquedIn this DLC, players encounter uncharted territory deep in the swamps of Pandora where a very large Hyperion ship has crashed down. The wreckage is believed to have stockpiles of cash and booty. But watch yourself because mutant creatures, and armies of savages also had their interest piqued by the ship. As ferocious and dangerous as they may seem, the mysterious Professor Nakayama claims to be their diabolical leader, and he’s calling all the shots. This add-on includes new guns, new loot, new bosses, a new location, a new vehicle and new skins & heads.… Expand"}, {"name": "Capcom Classics Collection Reloaded", "details_link": "https://www.metacritic.com/game/psp/capcom-classics-collection-reloaded", "publisher": "Capcom", "release_date": "Oct 24 2006", "developers": ["Capcom", "Klein Computer Entertainment"], "platforms": "PSP", "num_players": "Up to 3 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/e2dfeae90acec1f7f5d28eee97d99d0f-98.jpg", "descriptions": "(Also known as \"Capcom Classics Collection Volume 2\")  Capcom Classics Collection Reloaded offers arcade classics which can all be enjoyed alone or via multiplayer using the PSP system's wireless ad hoc mode. Game sharing abilities not only pushes Reloaded over the compilation echelon, but(Also known as \"Capcom Classics Collection Volume 2\")  Capcom Classics Collection Reloaded offers arcade classics which can all be enjoyed alone or via multiplayer using the PSP system's wireless ad hoc mode. Game sharing abilities not only pushes Reloaded over the compilation echelon, but presents the opportunity to be challenged just like the good ole arcade days. For those wanting to experience the games in their original presentation, the screen settings can be changed to suit just that. Relive Capcom's history and savor bonus features by earning credits towards Reloaded's themed slot machine to unlock a buffet of goods including original art, playing tips and secret codes. More than 15 arcade-perfect classics on a single UMD including Eco Fighers, King of Dragons, and Knights of the Round. A wealth of added features including game history, playing tips, original artwork, and new secret codes. Customizable controls to suit any gaming style. [Capcom]… Expand"}, {"name": "PowerWash Simulator", "details_link": "https://www.metacritic.com/game/xbox-series-x/powerwash-simulator", "publisher": "Square Enix Collective", "release_date": "Jul 14 2022", "developers": ["FuturLab"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 6 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 75, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/921bdd1ad8e7ea2d7de5ed3aaca1c922-98.jpg", "descriptions": "Release the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. Build up yourRelease the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish. Build up your business in Career Mode and complete a variety of dirty jobs across the dusty town of Muckingham. There's no right or wrong; no time pressure or final score, just you and the tools you need to soak away your stress. Want a clean start? Chill out and replay your favourite jobs in Free Play.… Expand"}, {"name": "Shantae and the Seven Sirens", "details_link": "https://www.metacritic.com/game/xbox-one/shantae-and-the-seven-sirens", "publisher": "WayForward", "release_date": "May 28 2020", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/e16f6f881672628e3ed7b123135f227c-98.jpg", "descriptions": "New locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble inNew locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. Key Features:* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!* 4K-resolution hand-painted visuals (on 4K devices only)!* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!* Collect and power up with monster cards!* Enjoy minigames, acquire magic and items, and uncover secrets!* Gorgeously animated TV-style cutscenes!… Expand"}, {"name": "Unruly Heroes", "details_link": "https://www.metacritic.com/game/switch/unruly-heroes", "publisher": "Magic Design Studios", "release_date": "Jan 23 2019", "developers": ["Magic Design Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/987d08e17222dd000c805db9599e9885-98.jpg", "descriptions": "Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players,Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players, but you can decide to play online in fierce Player vs Player modes. Who will be your favorite character?… Expand"}, {"name": "Infinite Minigolf", "details_link": "https://www.metacritic.com/game/playstation-4/infinite-minigolf", "publisher": "Zen Studios", "release_date": "Jul 25 2017", "developers": ["Zen Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/326c1778acaa489114c5babd8611a342-98.jpg", "descriptions": "A never-ending minigolf experience. Take part in tournaments and challenges, use arcade-style powerups, and experience unique gameplay, graphics, and more."}, {"name": "Tiny & Big: Grandpa's Leftovers", "details_link": "https://www.metacritic.com/game/pc/tiny-big-grandpas-leftovers", "publisher": "Black Pants", "release_date": "Jun 19 2012", "developers": ["Black Pants"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/f0cc2114053c9426dc428c9035ecc510-98.jpg", "descriptions": "Tiny & Big, a comic styled jump and slice platformer, gives you the unique ability to shape a whole world at your will! You are Tiny, a nerdy inventor who tries to reclaim his most beloved possession: Grandpa's white, fine rib underpants! On his journey through a forsaken desert he willTiny & Big, a comic styled jump and slice platformer, gives you the unique ability to shape a whole world at your will! You are Tiny, a nerdy inventor who tries to reclaim his most beloved possession: Grandpa's white, fine rib underpants! On his journey through a forsaken desert he will meet mysterious creatures, no clowns, a taxi robot and his arch enemy: Big!… Expand"}, {"name": "A Total War Saga: Thrones of Britannia", "details_link": "https://www.metacritic.com/game/pc/a-total-war-saga-thrones-of-britannia", "publisher": "Sega Europe", "release_date": "May  2 2018", "developers": ["Creative Assembly"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 75, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/f6b05929b06513ab81b013a30c71652e-98.jpg", "descriptions": "From the multi-award-winning strategy series, A Total War Saga: Thrones of Britannia combines huge real-time battles with engrossing turn-based campaign, set at a critical flashpoint in history. Anglo-Saxons, Gaelic clans and Viking settlers clash for control. What Kingdom will you build?"}, {"name": "WWE 2K14", "details_link": "https://www.metacritic.com/game/xbox-360/wwe-2k14", "publisher": "2K Games", "release_date": "Oct 29 2013", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/4f032485fa89a8c140d07d19244bdae3-98.jpg", "descriptions": "WWE 2K14 is 2K Sports'first release in the flagship WWE videogame franchise, WWE 2K14. 2K promises the most electrifying, authentic and comprehensive WWE video game experience to date. Become Immortal."}, {"name": "Mary Skelter 2", "details_link": "https://www.metacritic.com/game/switch/mary-skelter-2", "publisher": "Idea Factory", "release_date": "Oct 22 2019", "developers": ["Compile Heart"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike", "Japanese-Style"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a00a065344444b92e6e669b08dfc0e68-98.jpg", "descriptions": "The Nightmare continues in Mary Skelter 2! In this first-person dungeon crawler, play as fairy tale-inspired characters called Blood Maidens, each with deeply customizable character-specific classes. Balance between power and madness in turn-based battles with a blood-fueled transformationThe Nightmare continues in Mary Skelter 2! In this first-person dungeon crawler, play as fairy tale-inspired characters called Blood Maidens, each with deeply customizable character-specific classes. Balance between power and madness in turn-based battles with a blood-fueled transformation system, and escape a living prison while indestructible Nightmares give chase in real time. This game also includes the first installment of the series, Mary Skelter: Nightmares.… Expand"}, {"name": "Puzzle Quest: Galactrix", "details_link": "https://www.metacritic.com/game/ds/puzzle-quest-galactrix", "publisher": "D3Publisher", "release_date": "Feb 24 2009", "developers": ["Infinite Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/0c18a599a516a8acb9d0cfd5fed26832-98.jpg", "descriptions": "Play as a rogue pilot and gain skills, craft items, and maneuver among political factions as you attempt to end a possible genocide. Use Puzzle Quests’s signature RPG/puzzle gameplay to command a fleet of ships as you scour the galaxy for clues, interact with alien species, and battle toPlay as a rogue pilot and gain skills, craft items, and maneuver among political factions as you attempt to end a possible genocide. Use Puzzle Quests’s signature RPG/puzzle gameplay to command a fleet of ships as you scour the galaxy for clues, interact with alien species, and battle to save the human race. Welcome to the Puzzle Game of the Future. [D3Publisher of America]… Expand"}, {"name": "Sam & Max Save the World Remastered", "details_link": "https://www.metacritic.com/game/switch/sam-max-save-the-world-remastered", "publisher": "Skunkape Games", "release_date": "Dec  2 2020", "developers": ["Skunkape Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 75, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/0/90c80ea772ed1d66a435add82bf32bf0-98.jpg", "descriptions": "Sam is a six-foot canine detective with a love of justice. Max is a hyperkinetic rabbity-thing with a taste for mayhem.\r Together, they’re the Freelance Police. And they’re about to save the world.\r\n\r\nIn 2006, the comic book crime-fighting duo Sam & Max starred in the first full-fledgedSam is a six-foot canine detective with a love of justice. Max is a hyperkinetic rabbity-thing with a taste for mayhem.\r Together, they’re the Freelance Police. And they’re about to save the world.\r In 2006, the comic book crime-fighting duo Sam & Max starred in the first full-fledged episodic game from Telltale, the studio that went on to make The Walking Dead and Batman: The Enemy Within.\r Now everyone’s favorite dog and rabbity-thing are back in Sam & Max Save the World Remastered, a new version of their first season of episodic games that has been lovingly updated by a small group of the original developers with the blessing of Sam & Max creator Steve Purcell.\r It’s just another day at the office for the self-proclaimed Freelance Police when the Commissioner calls in with a disturbing report: former child stars are running amok in the street! What starts as an open-and-shut case of idiotic vandalism balloons into an all-out conspiracy as Sam and Max encounter one miscreant after another who have been mysteriously hypnotized. (You can tell from the “spinny thing” they do with their eyes.)\r Who’s the source of this malfeasance, and what is their dastardly plan? Cracking this case will require Sam’s nose for detective work, Max’s lack of conscience, an assortment of inventory items, and a little help from neighbors Sybil Pandemik, Bosco, and Jimmy Two-Teeth. From Sam & Max’s street to the White House lawn, inside the internet, and all the way to the moon, this baffling mystery gets weirder and funnier as it unfolds.\r Return to the adventure game that was once called “gaming’s first sitcom” and is today known as “the remaster you didn’t know you were waiting for.” With enhanced graphics, Joy-Con™ and touch screen support, an original jazz score with five new tracks, and the same brain-tickling puzzles and offbeat humor that won it IGN’s Best Adventure GOTY award back in the day, Sam & Max Save the World Remastered is a modern classic that will be right at home in your Nintendo Switch™ library.… Expand"}, {"name": "Midnight Fight Express", "details_link": "https://www.metacritic.com/game/pc/midnight-fight-express", "publisher": "Humble Games", "release_date": "Aug 23 2022", "developers": ["Jacob Dzwinel"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear", "Action", "Beat-'Em-Up", "3D"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/ad888fb04dd278b4d4fdfd0f09c12dff-98.jpg", "descriptions": "A former member of the criminal underworld is lured back into “the life” by a mysterious drone claiming they have until sunrise to prevent a citywide criminal takeover together."}, {"name": "Knights of Honor II: Sovereign", "details_link": "https://www.metacritic.com/game/pc/knights-of-honor-ii-sovereign", "publisher": "THQ Nordic", "release_date": "Dec  6 2022", "developers": ["Black Sea Studios", "Black Sea Games"], "platforms": "PC", "num_players": "Up to 6 ", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/6cf658a386bb525cdf65173d8be45d2e-98.jpg", "descriptions": "Become the King and wrestle over control of Europe in this fresh take on medieval real-time grand strategy.Knights of Honor II: Sovereign includes all the depth players desire while being the gate-way game to the grand strategy genre, presenting the world as a living, breathing miniature,Become the King and wrestle over control of Europe in this fresh take on medieval real-time grand strategy.Knights of Honor II: Sovereign includes all the depth players desire while being the gate-way game to the grand strategy genre, presenting the world as a living, breathing miniature, alive and ripe for the taking. Choose your royal court carefully and determine the destiny of your people, be it riches, conquest, intrigue, trade, or defeat! Raise armies to defend your lands or take war to the enemy - even jump into battle directly in action-packed RTS combat.The path is open: become the true Sovereign of your people.… Expand"}, {"name": "The Escapists 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-escapists-2", "publisher": "Team17", "release_date": "Aug 22 2017", "developers": ["Mouldy Toof Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/79b5e40835d494e123605ec4209b59ab-98.jpg", "descriptions": "Craft, steal, brawl, and escape. It’s time to bust out of the toughest prisons in the world as you return to the life of an inmate in The Escapists 2. Have you got what it takes to escape?"}, {"name": "Madden NFL 13", "details_link": "https://www.metacritic.com/game/wii-u/madden-nfl-13", "publisher": "EA Sports", "release_date": "Nov 13 2012", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "1-5 ", "genres": ["Sim", "Sports", "Traditional", "Team", "Football", "Sim"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/35edc5d8dacfc748465f9a2c24f10b62-98.jpg", "descriptions": "Build your own legacy as a player or a coach—or relive the glory of an all-time legend—in Connected Careers. Engulf yourself in the Madden NFL experience with features exclusive to Wii U, including streamlined play-calling, personnel management, and more—all directed from the innovate touchBuild your own legacy as a player or a coach—or relive the glory of an all-time legend—in Connected Careers. Engulf yourself in the Madden NFL experience with features exclusive to Wii U, including streamlined play-calling, personnel management, and more—all directed from the innovate touch screen on the Wii U GamePad.… Expand"}, {"name": "Dragon Quest Monsters: Joker", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-monsters-joker", "publisher": "Square Enix", "release_date": "Nov  6 2007", "developers": ["TOSE"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "General", "General", "Trainer"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/a5da45872b3cd5fe35760ad1d1738da8-98.jpg", "descriptions": "Joker is the first game in the series to have online play, via Nintendo Wi-Fi. The battle system is similar to previous Dragon Quest Monsters games. The player has three monsters in a party which can be given direct orders or set to one of 4 AI settings. A player's main character does notJoker is the first game in the series to have online play, via Nintendo Wi-Fi. The battle system is similar to previous Dragon Quest Monsters games. The player has three monsters in a party which can be given direct orders or set to one of 4 AI settings. A player's main character does not directly participate in battles with the exception of using items when directed as such. The sole method of encountering enemies is to run into them on the overworld.… Expand"}, {"name": "Borderlands: The Pre-Sequel", "details_link": "https://www.metacritic.com/game/pc/borderlands-the-pre-sequel", "publisher": "2K Games", "release_date": "Oct 13 2014", "developers": ["2K Australia"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/a973fe832f0f00abbe23b495b1081c2a-98.jpg", "descriptions": "Inject yourself into the Borderlands universe and shoot ‘n’ loot your way through a new adventure that launches you onto Pandora’s moon in Borderlands: The Pre-Sequel."}, {"name": "Prey: Mooncrash", "details_link": "https://www.metacritic.com/game/pc/prey-mooncrash", "publisher": "Bethesda Softworks", "release_date": "Jun 10 2018", "developers": ["Arkane Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Shooter", "Action RPG", "First-Person", "Arcade"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/f01994a350ed2aef1ce5ba1462f7856d-98.jpg", "descriptions": "Fight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for PreyFight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for Prey will offer a fun, infinitely replayable challenge to test even the most skilled players.… Expand"}, {"name": "Resident Evil: The Umbrella Chronicles", "details_link": "https://www.metacritic.com/game/wii/resident-evil-the-umbrella-chronicles", "publisher": "Capcom", "release_date": "Nov 13 2007", "developers": ["Cavia Inc."], "platforms": ["PlayStation 3", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Rail", "Light Gun", "Rail"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/079d182561be1517d1e2376924429ecf-98.jpg", "descriptions": "Resident Evil: The Umbrella Chronicles is a brand new game in the Resident Evil franchise, with familiar locales from the entire series, created specifically for the unique characteristics of the Wii hardware. This action/shooter hybrid reveals the back story behind the fall of the UmbrellaResident Evil: The Umbrella Chronicles is a brand new game in the Resident Evil franchise, with familiar locales from the entire series, created specifically for the unique characteristics of the Wii hardware. This action/shooter hybrid reveals the back story behind the fall of the Umbrella Corporation by exploring locations from Resident Evil 0, 1, 2 and 3 as well as new never-before-seen locations, such as Umbrella's stronghold. Resident Evil: The Umbrella Chronicles combines first-person, light-gun style combat with interactive pathways, multiple weapons and new enemies to create an entirely new Resident Evil experience that could only be delivered on the Wii. [Capcom]… Expand"}, {"name": "Star Control: Origins", "details_link": "https://www.metacritic.com/game/pc/star-control-origins", "publisher": "Stardock", "release_date": "Sep 20 2018", "developers": ["Stardock"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 75, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/469c18a006a432dde4f1b5aeb1fbe6a0-98.jpg", "descriptions": "Explore the galaxy, investigate new worlds, contact new civilizations, and battle hostile aliens in Star Control: Origins. You are the captain of Earth's brand new, state-of-the-art ship, The Vindicator. Your mission is to gather together allies to fight an ancient alien menace thatExplore the galaxy, investigate new worlds, contact new civilizations, and battle hostile aliens in Star Control: Origins. You are the captain of Earth's brand new, state-of-the-art ship, The Vindicator. Your mission is to gather together allies to fight an ancient alien menace that threatens to annihilate the human race.… Expand"}, {"name": "SteamWorld Dig: A Fistful of Dirt", "details_link": "https://www.metacritic.com/game/switch/steamworld-dig-a-fistful-of-dirt", "publisher": "Image & Form", "release_date": "Feb  1 2018", "developers": ["Image & Form"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D", ""], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/73ec2fb5e17dab701c9d4dbc329e0825-98.jpg", "descriptions": "The clock has stopped around the turn of the 19th century, and humankind has prematurely blown itself to bits. The remaining scraps are huddling in caves beneath the surface, and steam-powered robots have taken over the Wild West."}, {"name": "Rock Band VR", "details_link": "https://www.metacritic.com/game/pc/rock-band-vr", "publisher": "Mad Catz", "release_date": "Oct  6 2016", "developers": ["Harmonix Music Systems"], "platforms": "PC", "genres": ["Action", "Rhythm", "Music"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/7f875e5806fffcf77cb2365172b4d435-98.jpg", "descriptions": null}, {"name": "Edna & Harvey: Harvey's New Eyes", "details_link": "https://www.metacritic.com/game/pc/edna-harvey-harveys-new-eyes", "publisher": "Daedalic Entertainment", "release_date": "Oct 16 2012", "developers": ["Daedalic Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/07540bfe9272776b443adb4bff870b0f-98.jpg", "descriptions": "Lilli, a young girl at a convent school, is the gameï¿½s main character. At first glance the best-behaved little girl in the world, she executes all her chores in a diligent manner, no matter how unfair they may be. Her innocent, imperturbable way of carrying out theLilli, a young girl at a convent school, is the gameï¿½s main character. At first glance the best-behaved little girl in the world, she executes all her chores in a diligent manner, no matter how unfair they may be. Her innocent, imperturbable way of carrying out the orders of others has something both tragic and eerie about it. Any angry thoughts, any childlike disobedience is buried deep beneath a seemingly impenetrable surface of sweetness. But how long will these feelings stay hidden? And where do the friendly little gnomes come from that paint over everything unpleasant in Lilliï¿½s vicinity with a pleasant pink color? Are they real or just a product of her subconscious?… Expand"}, {"name": "NiGHTS into Dreams...", "details_link": "https://www.metacritic.com/game/playstation-3/nights-into-dreams", "publisher": "Sega", "release_date": "Oct  2 2012", "developers": ["Sonic Team"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "3D", "Action", "General", "Platformer", "3D"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/030430ed8a83344fc44c334d37a13a6d-98.jpg", "descriptions": "The Sega Saturn 3D classic returns with HD graphics, trophies, leaderboards, and an optional original Saturn mode."}, {"name": "Yakuza", "details_link": "https://www.metacritic.com/game/playstation-2/yakuza", "publisher": "Sega", "release_date": "Sep  5 2006", "developers": ["Amusement Vision"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/1c812ebda6e0a4dc8d609767c05581cf-98.jpg", "descriptions": "(Known in Japan as \"Ryu Ga Gotoku\")  In a society where respect and honor holds great importance, there is an even higher regard for these traits within the one organization that is most feared by all: the Yakuza. Kiryu Kazuma – a former rising star in the Yakuza who is rebuilding his life(Known in Japan as \"Ryu Ga Gotoku\")  In a society where respect and honor holds great importance, there is an even higher regard for these traits within the one organization that is most feared by all: the Yakuza. Kiryu Kazuma – a former rising star in the Yakuza who is rebuilding his life after serving a 10-year prison term for murder – suddenly finds himself caught in a spiraling underworld plot involving a mysterious girl known as Haruka and a missing $100 million. Kazuma must use his fists and his wits to stay alive as he unravels the complex web of truth and lies that surrounds the notorious Yakuza. Yakuza delivers a balance of action and adventure with its immersive storyline and stylish fighting mechanics created specifically for the game. Players can string together attack combinations to take out multiple enemies in sidewalk showdowns, while defending the Yakuza territory and reputation by picking up weapons to crush opponents. Kazuma can also \"educate\" delinquent debtors through visceral shakedowns by grabbing and smashing them against walls and tables, then delivering final skull-shattering blows when the Heat Gauge is maximized. With a customizable status gauge, players can increase strength, stamina, and skills through combat. [Sega]… Expand"}, {"name": "Area 51", "details_link": "https://www.metacritic.com/game/playstation-2/area-51", "publisher": "Midway", "release_date": "Apr 25 2005", "developers": ["Midway Studios - Austin"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/08655aa90968e8211b66c7788adc86b7-98.jpg", "descriptions": "Featuring online play, Area 51 is set in the U.S. government's most top-secret and secure facility located in the Nevada desert. Players take on the role of Lt. Nick Cross, a hazardous biological waste specialist sent to investigate. During his investigation, Lt. Cross stumbles across alienFeaturing online play, Area 51 is set in the U.S. government's most top-secret and secure facility located in the Nevada desert. Players take on the role of Lt. Nick Cross, a hazardous biological waste specialist sent to investigate. During his investigation, Lt. Cross stumbles across alien creatures and becomes infected with a biological mutagen that eventually transforms him into something not quite human. To save the earth and himself, Lt. Cross must fight to solve the enigma of Area 51. Features extensive Single-Player Campaign: Battle through corridors of Area 51 and attempt to discover the secrets of the extraterrestrial menace before it is too late. Engage in an epic adventure through eight massive sections of a secretive complex. Equip yourself with more than 15 types of human and alien weapons and other equipment as you explore dark corridors. An infectious mutagen gives Lt. Nick Cross alien-enhanced physical abilities but is also slowly transforming him into an alien. Find the cure before it's too late and humanity is lost. Compete against your friends via a four-player split screen and system link through numerous multiplayer game modes including Death Match. Battle online where you can easily access the many systems allowing you to find your friends and set up your own matches. [Midway]… Expand"}, {"name": "Pure Pool", "details_link": "https://www.metacritic.com/game/playstation-4/pure-pool", "publisher": "Ripstone", "release_date": "Jul 29 2014", "developers": ["VooFoo Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Alternative", "Other", "Sports", "Miscellaneous", "Parlor", "Individual", "Billiards"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/c94139d8ee3080d0e404572972152646-98.jpg", "descriptions": "Bring the pool hall home in this recreation of the much-loved sport. Rack up the table with visuals and take your shot at becoming a pool legend. Hone your skills against computer-controlled opponents or your mates - and when your friends take a break, Pure Pool can copy their play style."}, {"name": "Shadow of the Tomb Raider", "details_link": "https://www.metacritic.com/game/playstation-4/shadow-of-the-tomb-raider", "publisher": "Square Enix", "release_date": "Sep 12 2018", "developers": ["Eidos Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/eb1871a05f2889873e4d2ced448192cd-98.jpg", "descriptions": "Experience Lara Croft's defining moment as she becomes the Tomb Raider. In Shadow of the Tomb Raider, Lara must master a deadly jungle, overcome terrifying tombs, and persevere through her darkest hour. As she races to save the world from a Maya apocalypse, Lara will ultimately be forgedExperience Lara Croft's defining moment as she becomes the Tomb Raider. In Shadow of the Tomb Raider, Lara must master a deadly jungle, overcome terrifying tombs, and persevere through her darkest hour. As she races to save the world from a Maya apocalypse, Lara will ultimately be forged into the Tomb Raider she is destined to be.\r FEATURES:\r * Survive and Thrive In the Deadliest Place on Earth: Master an unforgiving jungle setting in order to survive. Explore underwater environments filled with crevasses and deep tunnel systems.\r * Become One With the Jungle: Outgunned and outnumbered, Lara must use the jungle to her advantage. Strike suddenly and disappear like a jaguar, use mud as camouflage, and instill fear in enemies to sow chaos.\r * Discover Dark and Brutal Tombs: Tombs are more terrifying than ever before, requiring advanced traversal techniques to reach them, and once inside they are filled with deadly puzzles.\r * Uncover Living History: Discover a hidden city and explore the biggest hub space ever found in a Tomb Raider game.… Expand"}, {"name": "Outlast 2", "details_link": "https://www.metacritic.com/game/pc/outlast-2", "publisher": "Red Barrels", "release_date": "Apr 25 2017", "developers": ["Red Barrels"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/9c8ea46b1a1314b73bb1fc72e7b4f929-98.jpg", "descriptions": "Outlast 2 introduces you to Sullivan Knoth and his followers, who left our wicked world behind to give birth to Temple Gate, a town, deep in the wilderness and hidden from civilization. Knoth and his flock are preparing for the tribulations of the end of times and you’re right in the thick of it."}, {"name": "Gunfire Reborn", "details_link": "https://www.metacritic.com/game/xbox-series-x/gunfire-reborn", "publisher": "505 Games", "release_date": "Oct 27 2022", "platforms": ["iPhone/iPad", "PC", "Xbox One", "Xbox Series X"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/bf7f34349478c088e41139bc353758a1-98.jpg", "descriptions": "Gunfire Reborn is an Adventure level-based game featured with FPS, Roguelite and RPG. Players can control heros with different abilities to experience diverse Build gameplay, use randomly dropped weapons to adventure in random levels. This game can be played by single player, or Co-op up toGunfire Reborn is an Adventure level-based game featured with FPS, Roguelite and RPG. Players can control heros with different abilities to experience diverse Build gameplay, use randomly dropped weapons to adventure in random levels. This game can be played by single player, or Co-op up to four.In this game, players' experience in each level is random. Every restart means brand new experience. You will meet different heroes' talents, weapons and items, different checkpoints and combat rhythms in different levels. Game Features:* FPS+Roguelite+RPG combined gameplay, construct diverse Build through death cycle for differnt experience * Elaborate, yet randomized stage experience * Over 100 different items and various weapons * Many heroes and multiple game plus with different game mechanism * Unique art style* Co-op level-based adventure… Expand"}, {"name": "SnowRunner", "details_link": "https://www.metacritic.com/game/switch/snowrunner", "publisher": "Focus Home Interactive", "release_date": "May 18 2021", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Simulation", "Racing", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/b8b5e1f389cad2a350d251b74956f466-98.jpg", "descriptions": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.Overcome mud,SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.Overcome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.… Expand"}, {"name": "The Climb 2", "details_link": "https://www.metacritic.com/game/pc/the-climb-2", "publisher": "Crytek", "release_date": "Mar  4 2021", "developers": ["Crytek"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/fce119467c8a97cfab03fa7e1d85c70d-98.jpg", "descriptions": "The Climb brings alive the excitement and thrill of rock climbing in incredible virtual reality. Players will scale new heights and explore stunning environments in a new gaming experience developed exclusively for VR, using the power of CRYENGINE™. [Oculus Quest 2]"}, {"name": "DOOM 64", "details_link": "https://www.metacritic.com/game/playstation-4/doom-64", "publisher": "Bethesda Softworks", "release_date": "Mar 20 2020", "developers": ["Night Dive Studios"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/3dd6921196365776611a1ec362942ab3-98.jpg", "descriptions": "You killed the Demons once, they were all dead. Or so you thought... A single Demon Entity escaped detection. Systematically it altered decaying, dead carnage back into grotesque living tissue. The Demons have returned - stronger and more vicious than ever before. You mission is clear, thereYou killed the Demons once, they were all dead. Or so you thought... A single Demon Entity escaped detection. Systematically it altered decaying, dead carnage back into grotesque living tissue. The Demons have returned - stronger and more vicious than ever before. You mission is clear, there are no options: kill or be killed!… Expand"}, {"name": "Code Vein", "details_link": "https://www.metacritic.com/game/xbox-one/code-vein", "publisher": "Bandai Namco Games", "release_date": "Sep 27 2019", "developers": ["Shift", "Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/9bba440bc6c98c99e30c4385b97d0063-98.jpg", "descriptions": "In the not too distant future, a mysterious disaster has brought collapse to the world as we know it. Towering skyscrapers, once symbols of prosperity, are now lifeless graves of humanity's past pierced by the Thorns of Judgment. At the center of the destruction lies a hidden society ofIn the not too distant future, a mysterious disaster has brought collapse to the world as we know it. Towering skyscrapers, once symbols of prosperity, are now lifeless graves of humanity's past pierced by the Thorns of Judgment. At the center of the destruction lies a hidden society of Revenants called Vein. This final stronghold is where the remaining few fight to survive, blessed with Gifts of power in exchange for their memories and a thirst for blood. Give into the bloodlust fully and risk becoming one of the Lost, fiendish ghouls devoid of any remaining humanity. Wandering aimlessly in search of blood, the Lost will stop at nothing to satisfy their hunger. Team up and embark on a journey to the ends of hell to unlock your past and escape your living nightmare in Code Vein.… Expand"}]