[{"name": "The Swords of Ditto", "details_link": "https://www.metacritic.com/game/playstation-4/the-swords-of-ditto", "publisher": "Devolver Digital", "release_date": "Apr 24 2018", "developers": ["One Bit Beyond"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/7f762a953ff863e96fd63467373cb846-98.jpg", "descriptions": "The Swords of Ditto is a compact action RPG that creates a unique adventure for each new hero of legend in the relentless fight against the evil Mormo."}, {"name": "Puzzle Quest 2", "details_link": "https://www.metacritic.com/game/ds/puzzle-quest-2", "publisher": "D3Publisher", "release_date": "Jun 22 2010", "developers": ["Infinite Interactive"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "DS"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/93955e0ab44febc79f88d08028ee85a0-98.jpg", "descriptions": "Featuring a hallmark blend of match-3 gem matching and fantasy, Puzzle Quest 2 offers a captivating, rewarding, and accessible journey for players of all skill levels as they make their way to reclaim the once peaceful village of Verloren from the evil clutch of the demon Gorgon. Get closerFeaturing a hallmark blend of match-3 gem matching and fantasy, Puzzle Quest 2 offers a captivating, rewarding, and accessible journey for players of all skill levels as they make their way to reclaim the once peaceful village of Verloren from the evil clutch of the demon Gorgon. Get closer to the Puzzle Quest action than ever before with a more intimate viewpoint of the world, and with all new character classes: Sorcerer, Templar, Barbarian, or Assassin. [Infinite Interactive]… Expand"}, {"name": "Batman: The Telltale Series - Episode 1: Realm of Shadows", "details_link": "https://www.metacritic.com/game/pc/batman-the-telltale-series---episode-1-realm-of-shadows", "publisher": "Telltale Games", "release_date": "Aug  2 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/6c5bc1d8f143463d5c27658ea61f19bb-98.jpg", "descriptions": "Rendered to look like a living, breathing comic book, Telltale's vision of Batman featureS a cast of talent including Troy Baker in the role of Bruce Wayne, Travis Willingham as Harvey Dent, Erin Yvette as Vicki Vale, Enn Reitel as Alfred Pennyworth, Murphy Guyer as Lieutenant James Gordon,Rendered to look like a living, breathing comic book, Telltale's vision of Batman featureS a cast of talent including Troy Baker in the role of Bruce Wayne, Travis Willingham as Harvey Dent, Erin Yvette as Vicki Vale, Enn Reitel as Alfred Pennyworth, Murphy Guyer as Lieutenant James Gordon, Richard McGonagle as Carmine Falcone, and Laura Bailey as Selina Kyle. [Telltale]… Expand"}, {"name": "Tanuki Sunset", "details_link": "https://www.metacritic.com/game/xbox-series-x/tanuki-sunset", "publisher": "Digerati Distribution", "release_date": "Nov  4 2022", "developers": ["Rewind Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Other"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/d8614c11b0ffaa731809668e8c613712-98.jpg", "descriptions": "Tanuki Sunset is a third-person longboarding game where players follow Tanuki, a rad raccoon with a longboard and a dream to land on the cover of the #1 magazine in Sunset Island: FISH!Players must master longboard drifting to make their way from mountains ranges, through the city and downTanuki Sunset is a third-person longboarding game where players follow Tanuki, a rad raccoon with a longboard and a dream to land on the cover of the #1 magazine in Sunset Island: FISH!Players must master longboard drifting to make their way from mountains ranges, through the city and down to the beach of Sunset Island. Throughout the journey players will guide Tanuki to perform rad tricks, jump-off ramps, all while avoiding cars and multiple obstacles. Collecting Tanuki Bits along the way is important to redeem for items and gear at Bob's Skate Shop, where players can customize Tanuki's outfit and longboard to better suit their personal style.… Expand"}, {"name": "Hot Wheels Unleashed", "details_link": "https://www.metacritic.com/game/playstation-4/hot-wheels-unleashed", "publisher": "Koch Media", "release_date": "Sep 30 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/9d203aeda5162e2a6533005d6260d97e-98.jpg", "descriptions": "Drive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe isDrive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe is here! Prove you're the best and unlock Premium cars and extraordinary items and with the livery editor make your ride a one-of-a-kind masterpiece of speed. Race like everyone's watching! Get ready for pure fun and show off your driving skills! Drift like a pro, charge your boost and blast through the loops to beat time, rivals and gravity itself! Are you up for a challenge? Boom, jackpot: race side by side a friend in the 2-player local split-screen mode or face up to 12 players online in a worldwide event. The harder the challenge, the more glorious the triumph! Unleash your creativity! Massive, themed playgrounds are ready to host the most immersive races. Have fun on and off the track with these beautifully detailed and interactive environments, where any object can play a role and be an actual part of your circuit! You can even build a racetrack inside your very own room, a space to customize with furniture and the items you will collect during your journey. And thanks to the incredibly powerful editor, building the craziest tracks has never been easier! Bend and stretch the iconic Orange track piece to create your unique design and then add special Boosters, loops, obstacles, and exclusive interactive elements to build your own racing paradise. Share your creations with the world Or enjoy tracks made by other crazy players like you. Now it's time to unleash the fun! … Expand"}, {"name": "Double Kick Heroes", "details_link": "https://www.metacritic.com/game/switch/double-kick-heroes", "publisher": "Headbang Club", "release_date": "Aug 13 2020", "developers": ["Headbang Club"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Shooter", "Shoot-'Em-Up", "Horizontal", "Action", "Rhythm", "Music"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/8f272e7cba33397158fa533e5ccb9963-98.jpg", "descriptions": "Butcher loads of zombies in Rhythm with METAL! Survive the wasteland fighting an epic freakshow!\r Double Kick Heroes mixes a shoot'em up with a rhythm game!\r\n\r\nMerging face-melting heavy metal rhythm riffs, with a high-octane zombie crushing shoot 'em up, Double Kick Heroes is like no gameButcher loads of zombies in Rhythm with METAL! Survive the wasteland fighting an epic freakshow!\r Double Kick Heroes mixes a shoot'em up with a rhythm game!\r Merging face-melting heavy metal rhythm riffs, with a high-octane zombie crushing shoot 'em up, Double Kick Heroes is like no game you've ever seen before!\r You must survive on the highway to hell by killing monsters with your gundillac! Struggle through the 30 levels of total madness and escape from this nightmare! Only the power of Metal can save your band!… Expand"}, {"name": "Railway Empire: Switch Edition", "details_link": "https://www.metacritic.com/game/switch/railway-empire-switch-edition", "publisher": "Kalypso", "release_date": "Jun 19 2020", "developers": ["Kalypso"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/c355fc2b5c1ccbb366e96fd9ba700bc4-98.jpg", "descriptions": "United States, 1830: The New World is in its ascendancy. Industry is booming, and the race is on to establish the most dominant and powerful rail empire in all of North America. It's time to outthink and outmaneuver your competitors as you lead your company into the 20th century!\r InUnited States, 1830: The New World is in its ascendancy. Industry is booming, and the race is on to establish the most dominant and powerful rail empire in all of North America. It's time to outthink and outmaneuver your competitors as you lead your company into the 20th century!\r In Railway Empire, you will create an elaborate and wide-ranging rail network, purchase over 40 different trains modelled in extraordinary detail, and buy or build railway stations, maintenance buildings, factories and tourist attractions to keep your travel network ahead of the competition. You'll also need to hire and manage your workforce if you want to ensure an efficient train service, whilst also develop over 300 technologies ranging from mechanical improvements to the trains themselves to workplace infrastructures and advanced amenities as you progress through five eras of technological innovations. However, you can't just build and research your way to the top -- the competition never sleeps, and to keep your business on track you'll have to survive against up to three rival tycoons. To get to the top you may have to resort to more cutthroat tactics as you attack and sabotage your opponents through raids and industrial espionage.… Expand"}, {"name": "Dungeon Defenders: Awakened", "details_link": "https://www.metacritic.com/game/pc/dungeon-defenders-awakened", "publisher": "Chromatic Games", "release_date": "May 28 2020", "developers": ["Chromatic Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Strategy", "Real-Time", "Action RPG", "Defense"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/02e5e872aac3ce88de2efaa93c2ecfe0-98.jpg", "descriptions": "Dungeon Defenders: Awakened is co-op Tower Defense combined with epic Action RPG combat. You’re able to join forces with up to four players to take on a never-ending army of orcs, demons, and dragons! Are your defenses strong enough to save the world of Etheria?"}, {"name": "NASCAR Heat 4", "details_link": "https://www.metacritic.com/game/xbox-one/nascar-heat-4", "publisher": "704Games", "release_date": "Sep 10 2019", "developers": ["Monster Games Inc.", "704Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/9a5bfdd3538c7df394d400c9021a246b-98.jpg", "descriptions": "NASCAR Heat 4 is the official video game of NASCAR. Looking and sounding better than ever with updated user interface, graphics and engine audio, race across 38 tracks in all three NASCAR National Series plus the fan-favorite Xtreme Dirt Tour."}, {"name": "Bomber Crew", "details_link": "https://www.metacritic.com/game/xbox-one/bomber-crew", "publisher": "Curve Digital Games", "release_date": "Jul 10 2018", "developers": ["Runner Duck"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Flight", "Real-Time", "General", "Combat"], "meta_score": 74, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/780f277fdddb2d2823c9760997aacb85-98.jpg", "descriptions": "Take to the skies in this immersive flight simulation where each mission is a high-risk expedition. Manage everything from fuel, ammo, hydraulics and more in your very own physics-based bomber, which can be customized with an array of liveries and paint jobs."}, {"name": "Culdcept Revolt", "details_link": "https://www.metacritic.com/game/3ds/culdcept-revolt", "publisher": "NIS America", "release_date": "Oct  3 2017", "developers": ["Omiya Soft"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Board / Card Game", "Card Battle"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/e7b4b1079de81b5596713cc01179e9fa-98.jpg", "descriptions": "As the series celebrates its 20th Anniversary, the addictive card game-meets-board game is back, bigger and better than ever with hundreds of new cards, inventive boards, and exciting multiplayer. Follow Allen, a new recruit for the rebel Free Bat forces as you fight for freedom from theAs the series celebrates its 20th Anniversary, the addictive card game-meets-board game is back, bigger and better than ever with hundreds of new cards, inventive boards, and exciting multiplayer. Follow Allen, a new recruit for the rebel Free Bat forces as you fight for freedom from the tyranny of Count. Build your deck, create new strategies, and dominate the board in Culdcept Revolt! With all the classic elements veterans love yet a gentle learning curve for newcomers, Culdcept Revolt is the best Culdcept yet.… Expand"}, {"name": "Summon Night 5", "details_link": "https://www.metacritic.com/game/psp/summon-night-5", "publisher": "GAIJINWORKS", "release_date": "Dec 15 2015", "developers": ["Felistella"], "platforms": "PSP", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/954e2ea3aacd21843312eda5739ad951-98.jpg", "descriptions": "When worlds collide and everything is turned upside-down, a new order must be created to keep chaos at bay.\r BandaiNamcos Summon Night 5 is the continuing story of that order-keeping society, the Eucross, and the adventures their Summoners have keeping their world and the disparate racesWhen worlds collide and everything is turned upside-down, a new order must be created to keep chaos at bay.\r BandaiNamcos Summon Night 5 is the continuing story of that order-keeping society, the Eucross, and the adventures their Summoners have keeping their world and the disparate races from the Otherworlds in balance. Players can choose to experience the story as rookie Summoners Folth or Arca, and one of four possible partners (their Cross), giving the games dialogue and feel a unique flavor on up to eight different playthroughs. What players see, and how the characters react depends on what characters are chosen at the beginning of each playthrough. But whatever choices a player makes, theyre in for a charming and sometimes tense Strategy-RPG adventure as they gradually unravel a plot that threatens the balance the Eucross is sworn to protect.\r The game features beautiful 2D and 3D art with battles presented in user-adjustable isometric perspective, and gorgeous animation that is a hallmark of BandaiNamco productions.… Expand"}, {"name": "The Elder Scrolls Online: Tamriel Unlimited", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-online-tamriel-unlimited", "publisher": "Bethesda Softworks", "release_date": "Jun  9 2015", "developers": ["ZeniMax Media"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Massively Multiplayer", "genres": ["First-Person", "First-Person", "Massively Multiplayer Online", "Fantasy", "Role-Playing", "Massively Multiplayer"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/536503997d40d51471839ddd79a0e227-98.jpg", "descriptions": "The Elder Scrolls Online: Tamriel Unlimited includes all the gameplay from the original PC/Mac game, plus all the updates and content additions, including the new Justice and Champion systems.  All existing PC/Mac game accounts, open or closed, will be updated to the Tamriel UnlimitedThe Elder Scrolls Online: Tamriel Unlimited includes all the gameplay from the original PC/Mac game, plus all the updates and content additions, including the new Justice and Champion systems.  All existing PC/Mac game accounts, open or closed, will be updated to the Tamriel Unlimited edition in March and former players will be invited back to the game at that time to experience all that is new in the world. New players will make a one-time purchase of the game and play, without restrictions, for as long as they like – without game subscription fees. Tamriel Unlimited will be supported with special, optional downloadable content available for purchase and an in-game Crown Store for convenience and customization items. Regular updates and new gameplay will be offered to all players to enjoy free of additional charges. [Bethesda]… Expand"}, {"name": "Pro Evolution Soccer 2014", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2014", "publisher": "Konami", "release_date": "Nov 12 2013", "developers": ["Konami"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 74, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/5d26db45631840001882908425c67923-98.jpg", "descriptions": "Pro Evolution Soccer 2014 centers everything on the ball including how it moves and how players use it. First touch and sublime control are what set certain players apart from others. The ability to not only read a pass, but to be one step ahead and to know what is needed to gain yards on anPro Evolution Soccer 2014 centers everything on the ball including how it moves and how players use it. First touch and sublime control are what set certain players apart from others. The ability to not only read a pass, but to be one step ahead and to know what is needed to gain yards on an encroaching defender. Trueball Tech allows the player to trap or knock on a pass using the analogue stick with detailed bar-centric physics determining the weight shift of the player and the height and speed of the pass, as to how the player's body will automatically shape to receive it. The Pro Evolution Soccer series has long since treated the ball as an individual entity, allowing the player huge amounts of freedom to pass into space, run on to a knocked-on counter, or produces short triangular passes to make space. Trueball Tech adds even more freedom, with full 360-degree control within several yards around the player and the ability to shield the ball from opposing players, use deft controls to wrong-foot them, and intuitive methods to master close control.… Expand"}, {"name": "Dance Dance Revolution Universe", "details_link": "https://www.metacritic.com/game/xbox-360/dance-dance-revolution-universe", "publisher": "Konami", "release_date": "Feb 27 2007", "developers": ["Konami"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 74, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/1f4718cc50cbb0e5571a600b95f952e6-98.jpg", "descriptions": "Dance Dance Revolution UNIVERSE, takes dancing to a whole new dance floor - offering features and options not possible until now. Over 65 new songs, including songs and dance remixes exclusive for the Xbox 360, licensed songs, and popular hits. New HOW TO PLAY, TRIAL and SUPER EASY modesDance Dance Revolution UNIVERSE, takes dancing to a whole new dance floor - offering features and options not possible until now. Over 65 new songs, including songs and dance remixes exclusive for the Xbox 360, licensed songs, and popular hits. New HOW TO PLAY, TRIAL and SUPER EASY modes aimed at first-time players and beginners. All-new nonstop megamixes now offer \"DJ continuous mixes\" of multiple songs just like a real dance club. New Relay mode lets friends and family play DDR like a marathon race, allowing players to switch off to other teammates and keep the dance party going all night long . Enhancements to the common modes and features from the original DDR series, including Workout Mode, Edit Mode, Quest Mode, Party Mode and more. Xbox Live enabled online competitions, download new songs and dance steps, upload content, compete head-to-head, view internet ranking, instant messaging/email, talk live and more. [Konami]… Expand"}, {"name": "Armello", "details_link": "https://www.metacritic.com/game/playstation-4/armello", "publisher": "League of Geeks", "release_date": "Sep  1 2015", "developers": ["League of Geeks"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/aaf9746eb96635b73d18f6114390bae0-98.jpg", "descriptions": "Armello is a swashbuckling adventure that combines RPG elements with the strategic play of card and board games, creating a personal, story-fuelled experience."}, {"name": "Pump It Up: Exceed", "details_link": "https://www.metacritic.com/game/xbox/pump-it-up-exceed", "publisher": "Mastiff", "release_date": "Aug 29 2005", "developers": ["Andamiro U.S.A. Corp."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/2dfcc3b75f1874a25c8ade0f2fcf90e4-98.jpg", "descriptions": "Mastiff Games brings the popular dance pad arcade game Pump It Up to consoles with Pump It Up: Exceed. There are more than 100 songs to choose from and five levels of difficulty. You can unlock new content, like new songs and modifiers, which can adjust gameplay in a variety of ways. Pump ItMastiff Games brings the popular dance pad arcade game Pump It Up to consoles with Pump It Up: Exceed. There are more than 100 songs to choose from and five levels of difficulty. You can unlock new content, like new songs and modifiers, which can adjust gameplay in a variety of ways. Pump It Up: Exceed has two-player modes with two mats and a one-player, two-mat mode. The Xbox version includes downloadable content, such as additional songs and a step editor that allows you to program your own song routines.… Expand"}, {"name": "Arma 3", "details_link": "https://www.metacritic.com/game/pc/arma-3", "publisher": "Bohemia Interactive", "release_date": "Mar  5 2013", "developers": ["Bohemia Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Simulation", "General", "General"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/b0fb0dc6026fad7755bae602a6166278-98.jpg", "descriptions": "Tensions rise as NATO peacekeeping forces begin to leave The Republic of Altis: a strategic fault-line between crumbling European influence and a powerful, resurgent East. But when a key radar facility drops off the grid, a Mediterranean flashpoint risks escalating into global conflict."}, {"name": "Drox Operative", "details_link": "https://www.metacritic.com/game/pc/drox-operative", "publisher": "Soldak Entertainment", "release_date": "Nov 29 2012", "developers": ["Soldak Entertainment"], "platforms": "PC", "genres": ["Action", "Role-Playing", "General", "Action RPG", "Action RPG"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/c74b97ea38450891e70e155671d66266-98.jpg", "descriptions": null}, {"name": "Galaga Legions", "details_link": "https://www.metacritic.com/game/xbox-360/galaga-legions", "publisher": "Namco Bandai Games", "release_date": "Aug 20 2008", "developers": ["Namco Bandai Games"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/7c325350e0134bab71400e312de0dd91-98.jpg", "descriptions": "[Xbox Live Arcade]  This isn't just a boring remake. Featuring table-turning game dynamics, super-slick visuals, and vast waves of enemies, this is the definitive version of the arcade shooter classic. Classic Galaga action redefined: Galaga, the classic top-down arcade shooter released by[Xbox Live Arcade]  This isn't just a boring remake. Featuring table-turning game dynamics, super-slick visuals, and vast waves of enemies, this is the definitive version of the arcade shooter classic. Classic Galaga action redefined: Galaga, the classic top-down arcade shooter released by Namco in 1981, is many fans' favorite arcade game of all time. Now, completely updated and revitalized, Galaga Legions bursts onto the scene with new game dynamics and spectacular graphics. New achievements are offered for you to conquer. Show the world your old-school Galaga skills are new school enough to beat them. [Namco Bandai Games]… Expand"}, {"name": "The Sims 2: FreeTime", "details_link": "https://www.metacritic.com/game/pc/the-sims-2-freetime", "publisher": "Electronic Arts", "release_date": "Feb 26 2008", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/265e4b2ecf6b5f6c32a8b67895f0dfed-98.jpg", "descriptions": "It's all about fun, personal development for your Sims in The Sims 2 FreeTime. Sims can follow their individual interests, whether it's immersing themselves in books, becoming an award-winning foodie, flying a remote-controlled helicopter or playing the violin. Gifted mechanics can repairIt's all about fun, personal development for your Sims in The Sims 2 FreeTime. Sims can follow their individual interests, whether it's immersing themselves in books, becoming an award-winning foodie, flying a remote-controlled helicopter or playing the violin. Gifted mechanics can repair and then drive their newly-renovated sports cars. Sims can rake in oodles of Simoelons with skillfully crafted pottery or by writing a mesmerizing novel. Cool careers bring happiness and fulfillment to your Sims and your storytelling opportunities expand. New cool career options await, including oceanography, architecture, and entertainment. Now by honing their talents, your Sims can unlock a secondary aspiration making them even more unique. Your Sims can discover the activities that they’re most passionate about! Sims can now participate in contests to win prizes and Simoleons, or they can master interests, practice and improve their skills, and get in “the zone!” Your Sims can enrich their lives by creating items to use or sell, like pottery or cars. These new hobbies can strengthen friendships and uncover secret lots. New Lifetime Aspiration Meter. Your Sims can measure the progress of their aspirations over a lifetime and unlock special rewards and interactions! Five New Career Tracks and their Reward Objects. Oceanographers can earn a koi pond, entertainers can get their own star of fame, architects can use their own drafting table, dancers can receive a ballet barre and intelligence agents can use an audio augmenter earpiece. All New Objects and Outfits. The Sims 2 FreeTime introduces brand new items, including a basketball hoop, pottery wheel, toddler activity table, modular synthesizer, hobby train table and much more. Your Sims can also have new outfits to match their hobbies and activities, including a special outfit that was designed and created by a player of The Sims 2 that will be produced by H&M. Requires The Sims 2, The Sims 2 Special DVD Edition, The Sims 2 Holiday Edition or The Sims 2 Deluxe for PC to play. [Electronic Arts]… Expand"}, {"name": "Tak: The Great Juju Challenge", "details_link": "https://www.metacritic.com/game/playstation-2/tak-the-great-juju-challenge", "publisher": "THQ", "release_date": "Sep 19 2005", "developers": ["Avalanche Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/006740bc3139b83be4f541b74c8c5da3-98.jpg", "descriptions": "The third chapter in THQ's Tak series lets the player reprise the role of Tak, a shaman who uses magic to defeat enemies. Tak: The Great Juju Challenge features a new cooperative mode in which two players can solve puzzles together."}, {"name": "Record of Lodoss War: Deedlit in Wonder Labyrinth", "details_link": "https://www.metacritic.com/game/pc/record-of-lodoss-war-deedlit-in-wonder-labyrinth", "publisher": "Why so serious?", "release_date": "Mar 27 2021", "developers": ["Why so serious?", "WSS Playground", "Team Ladybug"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/4cd8316c70f2679228f105589ea523ba-98.jpg", "descriptions": "Record of Lodoss War-Deedlit in Wonder Labyrinth is a 2D-syle Metroidvania (action-exploration) game based on Record of Lodoss War. Immerse yourself in the gorgeous pixel animations, and take advantage of abilities such as swapping weapons, and get help from elemental spirits on your journeyRecord of Lodoss War-Deedlit in Wonder Labyrinth is a 2D-syle Metroidvania (action-exploration) game based on Record of Lodoss War. Immerse yourself in the gorgeous pixel animations, and take advantage of abilities such as swapping weapons, and get help from elemental spirits on your journey to solve the arcane mysteries of the labyrinth.\r… Expand"}, {"name": "They Bleed Pixels", "details_link": "https://www.metacritic.com/game/pc/they-bleed-pixels", "publisher": "Spooky Squid Games", "release_date": "Aug 29 2012", "developers": ["Spooky Squid Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/56d67623604f24c21de811258d5b1c8d-98.jpg", "descriptions": "Featuring a distinct visual style that blends pixel art with paper and ink textures, They Bleed Pixels is a singular mix of intense platforming and fierce beat-em-up action. It tells the story of a young girl haunted by a mysterious book and her violent Lovecraftian nightmares.\r They BleedFeaturing a distinct visual style that blends pixel art with paper and ink textures, They Bleed Pixels is a singular mix of intense platforming and fierce beat-em-up action. It tells the story of a young girl haunted by a mysterious book and her violent Lovecraftian nightmares.\r They Bleed Pixels uses a simple one-button combat scheme with surprising depth at its core. Button mashing is discouraged while kicking shadowy monsters into saws, pits and spikes is rewarded thanks to a unique checkpoint earning system: instead of being evenly distributed at set locations, players must earn and place checkpoints through stylish kills. The more and better you kill, the faster you fill your checkpoint meter. Avoid combat or button mash mindlessly and you'll find checkpoints uncomfortably far apart.… Expand"}, {"name": "Tumble", "details_link": "https://www.metacritic.com/game/playstation-3/tumble", "publisher": "SCEE", "release_date": "Sep 14 2010", "developers": ["Supermassive Games"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "General", "General"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/ec9d31b3168812c790a42ee6f79e8708-98.jpg", "descriptions": "A unique and accessible 3D puzzle/brain teaser that can be played alone or with other players, either competitively or collaboratively."}, {"name": "Guitar Hero: Smash Hits", "details_link": "https://www.metacritic.com/game/wii/guitar-hero-smash-hits", "publisher": "Activision", "release_date": "Jun 16 2009", "developers": ["Beenox"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/a5c928076c8672ccc6b8f3abd573f8db-98.jpg", "descriptions": "Guitar Hero Smash Hits takes the most exciting, recognizable and fun to play music from genre-defining titles Guitar Hero, Guitar Hero II, Guitar Hero Encore: Rocks the 80s and Guitar Hero III: Legends of Rock, which were previously available for guitar-only in-game play, and delivers themGuitar Hero Smash Hits takes the most exciting, recognizable and fun to play music from genre-defining titles Guitar Hero, Guitar Hero II, Guitar Hero Encore: Rocks the 80s and Guitar Hero III: Legends of Rock, which were previously available for guitar-only in-game play, and delivers them as a compelling and dynamic full band experience. Featuring 48 master recordings, Guitar Hero Smash Hits delivers exciting online and offline gameplay modes including Band Career and 8-player \"Battle of the Bands,: which allows two full bands to compete head-to-head online. Players' rock n' roll fantasies turn to realities as they create their rocker, compose original music and share it with the world through the innovative Music Studio, GHTunesSM and robust Rock Star Creator gameplay modes first introduced in Guitar Hero World Tour. The tracklist includes:  Killer Queen (Queen), I Love Rock N Roll (Joan Jett and The Blackhearts), Bark At The Moon (Ozzy), Them Bones (Alice in Chains), Killing in the Name (Rage Against The Machine), Message In A Bottle (The Police), Carry On My Wayward Son (Kansas) Free Bird (Lynyrd Skynyrd), I Wanna Rock (Twisted Sister), Nothin But A Good Time (Poison), Barracuda (Heart), Through the Fire and Flames (DragonForce). [Activision]… Expand"}, {"name": "Prince of Persia: The Forgotten Sands", "details_link": "https://www.metacritic.com/game/xbox-360/prince-of-persia-the-forgotten-sands", "publisher": "Ubisoft", "release_date": "May 18 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/6af0827a8289ddce18a7ee0b40e3b2ff-98.jpg", "descriptions": "Prince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancientPrince of Persia: The Forgotten Sands is the next chapter in the Sands of Time universe. Visiting his brother's kingdom following his adventure in Azad, the Prince finds the royal palace under siege from a mighty army bent on its destruction. When the decision is made to use the ancient power of the Sand in a desperate gamble to save the kingdom from total annihilation, the Prince embarks on an epic adventure in which he learns to bear the mantle of true leadership, and discover that great power often comes with a great cost. [Ubisoft]… Expand"}, {"name": "Partisans 1941", "details_link": "https://www.metacritic.com/game/pc/partisans-1941", "publisher": "Daedalic Entertainment", "release_date": "Oct 14 2020", "developers": ["Alter Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/9be0776a5d56c2c6b6db3cc6dfb6c9de-98.jpg", "descriptions": "Partisans 1941 is a real-time tactics game with stealth elements, set on the eastern front of WW II. As an army commander behind enemy lines you gather a group of Partisans to wage guerilla warfare against the German occupants."}, {"name": "The Red Solstice", "details_link": "https://www.metacritic.com/game/pc/the-red-solstice", "publisher": "Ironward", "release_date": "Jul  9 2015", "developers": ["Ironward"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "General"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/92a173b4bce5502fa4f2ea62e9708c8b-98.jpg", "descriptions": "A tactical eight-player co-op survival game set in the distant future on Mars. Join the fight and lead your customized squad as you roam freely over huge maps, completing random objectives and dealing with random events. The goal is to strategize, survive and conquer by any means necessary."}, {"name": "Bejeweled 2", "details_link": "https://www.metacritic.com/game/playstation-3/bejeweled-2", "publisher": "PopCap", "release_date": "Jan 29 2009", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "PlayStation 3"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/ad1eef4ce09031146753bcf8da05acf4-98.jpg", "descriptions": "[Playstation Network]  Experience the classic gem-swapping puzzler. Bejeweled 2 lovers can now earn over 10 unique PS3 trophies and play Bejeweled 2 on the PSP via remote play. Swap gems to match 3 or more, and delight in four different game modes and explosive new gem types. With amazing[Playstation Network]  Experience the classic gem-swapping puzzler. Bejeweled 2 lovers can now earn over 10 unique PS3 trophies and play Bejeweled 2 on the PSP via remote play. Swap gems to match 3 or more, and delight in four different game modes and explosive new gem types. With amazing planetary backdrops and awesome special effects in 1080p, Bejeweled 2 will dazzle you. [Sony]… Expand"}, {"name": "Turnip Boy Commits Tax Evasion", "details_link": "https://www.metacritic.com/game/switch/turnip-boy-commits-tax-evasion", "publisher": "Graffiti Games", "release_date": "Apr 22 2021", "developers": ["Snoozy Kazoo"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/a730b4d8052ceeceec42f086ae28fdbb-98.jpg", "descriptions": "Play as an adorable, yet trouble-making turnip. Avoid paying taxes, solve plantastic puzzles, and take on massive beasts in a journey to tear down a corrupt vegetable government! Take control of an adorable turnip who happens to be an absolute menace to society. After failing to pay taxesPlay as an adorable, yet trouble-making turnip. Avoid paying taxes, solve plantastic puzzles, and take on massive beasts in a journey to tear down a corrupt vegetable government! Take control of an adorable turnip who happens to be an absolute menace to society. After failing to pay taxes and getting evicted from your home, you must go on an epic quest to pay back your massive debt to Mayor Onion. Garden tools to solve plantastic puzzles, meet eccentric vegetables and fruits, and take on treacherous fights. Along the journey uncover what’s spoiling this garden community and rise to tear down the corrupt vegetable government!\r… Expand"}, {"name": "Famicom Detective Club: The Missing Heir", "details_link": "https://www.metacritic.com/game/switch/famicom-detective-club-the-missing-heir", "publisher": "Nintendo", "release_date": "May 14 2021", "developers": ["Nintendo", "Mages."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/2d80d78c64a6a6b0453374858ad28225-98.jpg", "descriptions": "Solve a murder mystery surrounding a wealthy Japanese family. Hunt for clues, talk to suspects, and explore the Japanese countryside after tragedy strikes the wealthy Ayashiro family. Filled with suspense, this tale follows an amnesia-stricken detective trying to unravel his own past amidstSolve a murder mystery surrounding a wealthy Japanese family. Hunt for clues, talk to suspects, and explore the Japanese countryside after tragedy strikes the wealthy Ayashiro family. Filled with suspense, this tale follows an amnesia-stricken detective trying to unravel his own past amidst the horrors of a harrowing murder investigation. Play at home, on the go, or in your favorite reading nook—only on the Nintendo Switch™ system. Play Famicom Detective Club in English for the first time.\r Originally released in Japan only, the Famicom Detective Club™: The Missing Heir game has been localized with English text and modernized for Nintendo Switch. While the graphics, music, and sound effects have been recreated, players can choose the original 8-bit soundtrack. Discover a piece of Nintendo history with the Famicom Detective Club series of games.\r Buy one Famicom Detective Club game, get the other at a discount\r Famicom Detective Club: The Missing Heir is the first entry in the series. The game’s prequel, Famicom Detective Club: The Girl Who Stands Behind, is also available on Nintendo eShop. If you purchase one of these games on Nintendo eShop, you can get $10 off the other when also purchased on Nintendo eShop.… Expand"}, {"name": "Minecraft Dungeons", "details_link": "https://www.metacritic.com/game/xbox-one/minecraft-dungeons", "publisher": "Mojang AB", "release_date": "May 26 2020", "developers": ["Mojang AB"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World", "Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/25ce149355e886f43ea61f08265aa949-98.jpg", "descriptions": "What exactly is Minecraft: Dungeons? It's an all-new action-adventure game inspired by classic dungeon crawlers, where you'll constantly discover new weapons and items that will help you defeat a ruthless swarm of new-and-nasty mobs. You'll fight or flee through canyons, swamps and of courseWhat exactly is Minecraft: Dungeons? It's an all-new action-adventure game inspired by classic dungeon crawlers, where you'll constantly discover new weapons and items that will help you defeat a ruthless swarm of new-and-nasty mobs. You'll fight or flee through canyons, swamps and of course mines. You can brave the dungeons alone, or team up with friends. Up to four players can battle together through action-packed, treasure-stuffed, wildly varied levels, all in an epic quest to save the villagers and take down the evil Arch-Illager.… Expand"}, {"name": "Pro Evolution Soccer 2009", "details_link": "https://www.metacritic.com/game/xbox-360/pro-evolution-soccer-2009", "publisher": "Konami", "release_date": "Nov 11 2008", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/1e308d9919a89c5a06f8bb8b654faa50-98.jpg", "descriptions": "Known by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor theKnown by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor the game to their own tastes, while new stylish moves, innovative control schemes and key online elements further the realism. [Konami]… Expand"}, {"name": "Medal of Honor: Allied Assault - Spearhead", "details_link": "https://www.metacritic.com/game/pc/medal-of-honor-allied-assault---spearhead", "publisher": "Electronic Arts", "release_date": "Nov 12 2002", "developers": ["EA LA", "Dreamworks Games"], "platforms": "PC", "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/48d82cf8f33a61158644424fcbf7d987-98.jpg", "descriptions": "This Expansion Pack for Medal of Honor Allied Assault features nine expansive single-player levels ranging from behind enemy lines in Normandy to the Battle of the Bulge and the fall of Berlin. Over 12 new multiplayer levels including the Arnhem Bridge and the streets of Berlin. NewThis Expansion Pack for Medal of Honor Allied Assault features nine expansive single-player levels ranging from behind enemy lines in Normandy to the Battle of the Bulge and the fall of Berlin. Over 12 new multiplayer levels including the Arnhem Bridge and the streets of Berlin. New multi-player modes emphasizing more robust team multi-player and team objective-based gameplay. New weapons including the British Enfield Mark 1 rifle, the Sten submachine gun, smoke grenades, and the Soviet PPSh-41 submachine gun. Work with squads of American, British and Soviet troops to complete single-player objectives. New soldier models, skins and voices including British and Soviet troops. [Electronic Arts]… Expand"}, {"name": "Master of Orion: Conquer the Stars", "details_link": "https://www.metacritic.com/game/pc/master-of-orion-conquer-the-stars", "publisher": "MicroProse", "release_date": "Aug 25 2016", "developers": ["NGD Studios"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/bb66cc598bc9902953ffe56f8d6dff6a-98.jpg", "descriptions": "Discover Master of Orion as it was always meant to be: A fully orchestrated score, interstellar warfare and exploration against the backdrop of animated far flung galaxies. Confront hostile civilizations, negotiate with mysterious aliens, share knowledge with allies and uncover this newlyDiscover Master of Orion as it was always meant to be: A fully orchestrated score, interstellar warfare and exploration against the backdrop of animated far flung galaxies. Confront hostile civilizations, negotiate with mysterious aliens, share knowledge with allies and uncover this newly imagined universe. … Expand"}, {"name": "Neverwinter", "details_link": "https://www.metacritic.com/game/pc/neverwinter", "publisher": "Perfect World Entertainment", "release_date": "Jun 20 2013", "developers": ["Cryptic Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "General", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 74, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/ef6c3035dd0c7129a88df3335ccf9b51-98.jpg", "descriptions": "Once a bustling location, Neverwinter has faced a great many disasters in the past hundred years. Rule of the city remains unclear following the unfortunate demise of the last Lord of Neverwinter and factions still battle for dominance after the all-consuming Spellplague took a high toll onOnce a bustling location, Neverwinter has faced a great many disasters in the past hundred years. Rule of the city remains unclear following the unfortunate demise of the last Lord of Neverwinter and factions still battle for dominance after the all-consuming Spellplague took a high toll on the population. Even Neverwinter’s dead are beginning to rise from their graves and march upon the city they once called home.… Expand"}, {"name": "Life is Strange 2", "details_link": "https://www.metacritic.com/game/switch/life-is-strange-2", "publisher": "Square Enix", "release_date": "Feb  2 2023", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 74, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/7/f5acec2a1f3dafee06711dbd2cafe354-98.jpg", "descriptions": "The long awaited sequel to the award winning Life is Strange returns with a new 5-part narrative adventure from DONTNOD Entertainment.After a tragic incident, brothers Sean and Daniel Diaz run away from home. Fearing the police, and dealing with Daniel's new telekinetic power, the boysThe long awaited sequel to the award winning Life is Strange returns with a new 5-part narrative adventure from DONTNOD Entertainment.After a tragic incident, brothers Sean and Daniel Diaz run away from home. Fearing the police, and dealing with Daniel's new telekinetic power, the boys flee to Mexico for safety. Suddenly, sixteen year-old Sean is responsible for Daniel's safety, shelter, and teaching him right from wrong. As Sean, your choices shape the fates of the Diaz brothers, and the lives of everyone they meet. The road to Mexico is long and filled with danger. This is the trip that could bond Sean and Daniel forever... or tear their brotherhood apart.… Expand"}, {"name": "Let's Build a Zoo", "details_link": "https://www.metacritic.com/game/switch/lets-build-a-zoo", "publisher": "Merge Games", "release_date": "Sep 29 2022", "developers": ["Merge Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/2c7d237b5352d2fb9d19117d78f60f7f-98.jpg", "descriptions": "It's time to build a zoo! Let out your wild side, and create your own animal empire with this cute, expansive management sim. Import and breed rare creatures, hire the right staff, keep your visitors happy, and deal with plenty of weird and wonderful events. Then try your hand at DNAIt's time to build a zoo! Let out your wild side, and create your own animal empire with this cute, expansive management sim. Import and breed rare creatures, hire the right staff, keep your visitors happy, and deal with plenty of weird and wonderful events. Then try your hand at DNA Splicing, and stitch together over 300,000 different types of animal, ranging from the majestic Giraffephant to the peaceful PandOwl!Let's Build a Zoo lets you import a variety of animals from other Zoos around the world! Breed your animals and start families to expand your wildlife and fill your enclosures. But if that doesn't suit you... you could just create animals instead! With DNA splicing at your finger tips, you have the power to bind together over 300,000 different types of animal, creating monstrosities and oddities as you go! Ever wondered what a ChicKaka would look like? Now you can find out!… Expand"}, {"name": "PowerWash Simulator", "details_link": "https://www.metacritic.com/game/pc/powerwash-simulator", "publisher": "Square Enix", "release_date": "Jul 14 2022", "developers": ["FuturLab"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/9f0f589398d859fd0a894991399f6fbe-98.jpg", "descriptions": "Release the Pressure with PowerWash Simulator! Wash away your worries with the soothing sounds of high-pressure water. Fire up your power washer and blast away every speck of dirt and grime you can find, all with the simple satisfaction of power-washing to a sparkling finish."}, {"name": "Sonic Colors: Ultimate", "details_link": "https://www.metacritic.com/game/xbox-one/sonic-colors-ultimate", "publisher": "Sega", "release_date": "Sep  7 2021", "developers": ["Sega", "Blind Squirrel Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox Series X", "Xbox One"], "genres": ["Action", "Platformer", "2D", "3D"], "meta_score": 74, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/0de559366334a29786990f12bae07c2b-98.jpg", "descriptions": "The evil Dr. Eggman has built an interstellar amusement park – but he’s powering it with a captured alien race called “Wisps.” Use Sonic’s speed to free the Wisps and gain their amazing powers as you explore six colorful unique worlds."}, {"name": "Sega Ages: G-LOC Air Battle", "details_link": "https://www.metacritic.com/game/switch/sega-ages-g-loc-air-battle", "publisher": "Sega", "release_date": "Apr 30 2020", "developers": ["M2", "Sanritsu"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/4303d3565884b76163e1a7400998b090-98.jpg", "descriptions": "The enemy has started its attack. They've mobilized their air force and land forces for a major assault. You're stationed on an aircraft carrier on the front line, and it's up to you to show them what an ace pilot can really do! Fly into the madness in your experimental G-LOC superfighter,The enemy has started its attack. They've mobilized their air force and land forces for a major assault. You're stationed on an aircraft carrier on the front line, and it's up to you to show them what an ace pilot can really do! Fly into the madness in your experimental G-LOC superfighter, and put an end to the Future World Army.… Expand"}, {"name": "The Elder Scrolls Online: Elsweyr", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-online-elsweyr", "publisher": "Bethesda Softworks", "release_date": "Jun  4 2019", "developers": ["ZeniMax Media"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 74, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/3afd00d15dd915e6bc5f934b49b6df1d-98.jpg", "descriptions": "Once thought lost to the mists of time, fearsome Dragons now soar the skies of Elsweyr, leaving scorched ruin in their wake. In The Elder Scrolls Online: Elsweyr, you must discover the dark purpose behind their rampage in a new epic story and prevent the destruction of the Khajiiti homeland.Once thought lost to the mists of time, fearsome Dragons now soar the skies of Elsweyr, leaving scorched ruin in their wake. In The Elder Scrolls Online: Elsweyr, you must discover the dark purpose behind their rampage in a new epic story and prevent the destruction of the Khajiiti homeland. Take heart, for these scaled monstrosities are not invincible, and with the right planning, tactics, and tools they can be brought to the ground and even killed. Coordination and skill are key to overcoming the Dragons, but if you succeed, you'll reap rewards not found anywhere else in Nirn. Beware the skies, walker.… Expand"}, {"name": "Overwhelm", "details_link": "https://www.metacritic.com/game/switch/overwhelm", "publisher": "Alliance", "release_date": "Apr  4 2019", "developers": ["Ruari O'Sullivan"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/991bea6b40fb07fae4f6eb5abcaf3e85-98.jpg", "descriptions": "OVERWHELM is an action horror-world platformer where enemies power-up and you don’t. Horror-world Exploration: Explore the oppressive caverns of the hive, guided only by a sparse map. Enemies can appear from anywhere at any time. Bosses Give Enemies Power-Ups: As you defeat each of the fiveOVERWHELM is an action horror-world platformer where enemies power-up and you don’t. Horror-world Exploration: Explore the oppressive caverns of the hive, guided only by a sparse map. Enemies can appear from anywhere at any time. Bosses Give Enemies Power-Ups: As you defeat each of the five unique bosses, their abilities get distributed to the enemies of the world with escalating difficulty. Tactile, Tense Combat: Combat is crunchy and fast. One hit and you die. Three deaths and the run is over. Defeat bosses in different orders to optimize your playthrough. … Expand"}, {"name": "SNK 40th Anniversary Collection", "details_link": "https://www.metacritic.com/game/playstation-4/snk-40th-anniversary-collection", "publisher": "NIS America", "release_date": "Mar 19 2019", "developers": ["Digital Eclipse", "SNK"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/e97344caddeba69453eea07ca5584484-98.jpg", "descriptions": "2018 marks the 40th anniversary of legendary studio SNK! To celebrate this extraordinary milestone, a variety of classic arcade games from SNK's golden age are coming back together in one anthology on Nintendo Switch. SNK 40th Anniversary Collection is packed full of retro games and a2018 marks the 40th anniversary of legendary studio SNK! To celebrate this extraordinary milestone, a variety of classic arcade games from SNK's golden age are coming back together in one anthology on Nintendo Switch. SNK 40th Anniversary Collection is packed full of retro games and a treasure trove of features!FEATURES:* Collection of classics in your hands! Take a piece of SNK history with you wherever you go on Nintendo Switch. Choose from over a dozen titles and experience an intense blast from the past!* Modern Meets Retro! Rewind and save at any time while you're playing, enjoy updated graphics at 1080p resolution, and experience redesigned control schemes for a modern feel!* Enter the SNK Museum: A history of SNK and its games await in the Museum Mode. Explore the legacy of one of Japan's leading developers with high definition artwork and original promotional assets!… Expand"}, {"name": "The Council", "details_link": "https://www.metacritic.com/game/playstation-4/the-council", "publisher": "Focus Home Interactive", "release_date": "Mar 13 2018", "developers": ["Big Bad Wolf"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/f5539df234063919ae8ef32ba4c77eb4-98.jpg", "descriptions": "The Council is an episodic game like no other. Delivering a fresh take on the narrative adventure, your choices and character growth truly matter."}, {"name": "Cat Quest", "details_link": "https://www.metacritic.com/game/playstation-4/cat-quest", "publisher": "PQube", "release_date": "Nov 14 2017", "developers": ["The Gentlebros"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/0d057eb7db9a91af0b39c2785359d4c6-98.jpg", "descriptions": "Cat Quest is an open world RPG set in the pawsome world of cats! In search of your catnapped sister you pounce into the massive continent of Felingard -- a world crafted in the style of overworld maps of yore and purrrring with cat-tastic characters, stories, and puns!Leap into a grandCat Quest is an open world RPG set in the pawsome world of cats! In search of your catnapped sister you pounce into the massive continent of Felingard -- a world crafted in the style of overworld maps of yore and purrrring with cat-tastic characters, stories, and puns!Leap into a grand adventure in purrsuit of the evil Drakoth and your catnapped sister! Explore Felingard's huge overworld map, risk life and limb delving into dungeons for epic loot, and lend a paw to a furry cast of characters in a flurry of side quests.… Expand"}, {"name": "Oriental Empires", "details_link": "https://www.metacritic.com/game/pc/oriental-empires", "publisher": "Iceberg Interactive", "release_date": "Sep 14 2017", "developers": ["Shining Pixel Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/b2e263d9b40aabce2586d68e7ee4398a-98.jpg", "descriptions": "A turn based 4X strategy game, recreating the civilizations of ancient China. Develop your land, build great cities, raise huge armies and fight epic battles, with hundreds of soldiers fighting right on the game map. Advance your technologies, culture and religion to create one of mankind’sA turn based 4X strategy game, recreating the civilizations of ancient China. Develop your land, build great cities, raise huge armies and fight epic battles, with hundreds of soldiers fighting right on the game map. Advance your technologies, culture and religion to create one of mankind’s biggest empires. … Expand"}, {"name": "Minecraft: Story Mode Season Two - Episode 2: Giant Consequences", "details_link": "https://www.metacritic.com/game/pc/minecraft-story-mode-season-two---episode-2-giant-consequences", "publisher": "Telltale Games", "release_date": "Aug 15 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/e2a0564a588610ff621c595b8d973577-98.jpg", "descriptions": "Now that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more...complicated. With more responsibilities and less time for adventure, old friendships have started to fade -- at least until Jesse's hand getsNow that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more...complicated. With more responsibilities and less time for adventure, old friendships have started to fade -- at least until Jesse's hand gets stuck in a creepy gauntlet that belongs to an ancient underwater temple. Together with old pals and new comrades alike, Jesse embarks on a brand new journey filled with tough choices, good times, and at least one temperamental llama.… Expand"}, {"name": "Mirage: Arcane Warfare", "details_link": "https://www.metacritic.com/game/pc/mirage-arcane-warfare", "publisher": "Torn Banner Studios", "release_date": "May 23 2017", "developers": ["Torn Banner Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 74, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/493e54ae7386b43370d32f33e69056f8-98.jpg", "descriptions": "Mirage is a skill-based multiplayer FPS that lets you tear your enemies limb from limb with destructive magic and melee combat. Experiment and find your perfect playstyle between six diverse classes including stealthy assassins, hulking brutes, powerful mages and more. With an unparalleledMirage is a skill-based multiplayer FPS that lets you tear your enemies limb from limb with destructive magic and melee combat. Experiment and find your perfect playstyle between six diverse classes including stealthy assassins, hulking brutes, powerful mages and more. With an unparalleled focus on truly feeling in control of your magic and sword, Mirage demands combat creativity and will challenge you like never before.… Expand"}, {"name": "Stories: The Path of Destinies", "details_link": "https://www.metacritic.com/game/pc/stories-the-path-of-destinies", "publisher": "Spearhead Games", "release_date": "Apr 12 2016", "developers": ["Spearhead Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/b2ee459d36b65f76a45dbfdc8f227bf0-98.jpg", "descriptions": "Welcome to Stories: The Hidden Path, an action-RPG set in a vibrant universe filled with floating islands, majestic airships, and flamboyant magic."}, {"name": "Fallout 4: Automatron", "details_link": "https://www.metacritic.com/game/xbox-one/fallout-4-automatron", "publisher": "Bethesda Softworks", "release_date": "Mar 22 2016", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 74, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/659b815fcaeaeab06f4f79498bf26a9e-98.jpg", "descriptions": "The mysterious Mechanist has unleashed a horde of evil robots into the Commonwealth, including the devious Robobrain. Hunt them down and harvest their parts to build and mod your own custom robot companions. Choose from hundreds of mods; mixing limbs, armor, abilities, and weapons like theThe mysterious Mechanist has unleashed a horde of evil robots into the Commonwealth, including the devious Robobrain. Hunt them down and harvest their parts to build and mod your own custom robot companions. Choose from hundreds of mods; mixing limbs, armor, abilities, and weapons like the all-new lightning chain gun. Even customize their paint schemes and choose their voices!… Expand"}, {"name": "Mega Coin Squad", "details_link": "https://www.metacritic.com/game/xbox-one/mega-coin-squad", "publisher": "Big Pixel Studios", "release_date": "May 20 2015", "developers": ["Big Pixel Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/3adc5e8a044810f36fbcb555eb149e96-98.jpg", "descriptions": "Tackle 16 levels in the solo quest for the Mega Coins in this manic 2D platformer from Big Pixel Studios and Adult Swim Games. Or invite your friends round to rob them of victory -- and their coins -- in four different local multiplayer modes."}, {"name": "Dragon Age: Inquisition - Jaws Of Hakkon", "details_link": "https://www.metacritic.com/game/pc/dragon-age-inquisition---jaws-of-hakkon", "publisher": "Electronic Arts", "release_date": "Mar 24 2015", "developers": ["BioWare"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG", "Western-Style"], "meta_score": 74, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/feb02c40242956d509657ec8cecf5c81-98.jpg", "descriptions": "Learn the fate of the last Inquisitor and the powerful dragon he pursued. Enter an overgrown wilderness chock full of Avvar, fiercely independent hunters who settled in the southern mountains of Thedas. Explore their culture to uncover what happened to the last Inquisitor and the dragon heLearn the fate of the last Inquisitor and the powerful dragon he pursued. Enter an overgrown wilderness chock full of Avvar, fiercely independent hunters who settled in the southern mountains of Thedas. Explore their culture to uncover what happened to the last Inquisitor and the dragon he tracked. Discover an ancient Tevinter fortress that hides a powder-keg secret. In this new adventure, playable within the Dragon Age: Inquisition campaign, you will face powerful foes, gain legendary armor and weapons, and confront an ancient god of war bent on destroying the world.… Expand"}, {"name": "Pro Evolution Soccer 2011", "details_link": "https://www.metacritic.com/game/psp/pro-evolution-soccer-2011", "publisher": "Konami", "release_date": "Nov  2 2010", "developers": ["Konami"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/7501b3bf0dcf143608a4554a270b2cfd-98.jpg", "descriptions": "The PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-lifeThe PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-life soccer. Central to its total freedom of play, PRO EVOLUTION SOCCER 2011 introduces a power bar for each player that allows the user to determine the exact strength and placement of every pass and shot. Balls can now be spread absolutely anywhere with surgical precision, with long balls into space, short passes to feet, and intricate one-twos allowing the player to dictate play and control the tempo of a match. … Expand"}, {"name": "NFL Fever 2004", "details_link": "https://www.metacritic.com/game/xbox/nfl-fever-2004", "publisher": "Microsoft Game Studios", "release_date": "Aug 27 2003", "developers": ["Microsoft Game Studios"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 74, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/c2f1b96a1520e073ea6c5745b36ef5cc-98.jpg", "descriptions": "NFL Fever is back and better than ever.  The third installment of the Microsoft's exclusive football title for the Xbox, NFL Fever 2004 features XSN Sports support for online play, customizable teams and leagues, and a revamped AI.  For the first time in the series, you can create your ownNFL Fever is back and better than ever.  The third installment of the Microsoft's exclusive football title for the Xbox, NFL Fever 2004 features XSN Sports support for online play, customizable teams and leagues, and a revamped AI.  For the first time in the series, you can create your own leagues, build your own rivalries, and stay plugged into your stats online on your PDA.  The game also features significant offensive and defensive adjustments, animated NFL coaches, a brand-new offensive playbook, reworked stadiums, and \"Read and Lead\" advanced passing.  From traditional single-player and multiplayer gaming to league tournament play on Xbox Live, NFL Fever 2004 takes its game to the next level.… Expand"}, {"name": "All-Star Baseball 2004", "details_link": "https://www.metacritic.com/game/xbox/all-star-baseball-2004", "publisher": "Acclaim", "release_date": "Feb 23 2003", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/402e16b183cb10759bcb0438f6626362-98.jpg", "descriptions": "Not only does All-Star Baseball 2004 simulate professional baseball, but it also gives you a look into baseball's history and homes. Now, in addition to today's baseball stars, you can play history's greatest players, from the MLB to the Negro Leagues. Take a panoramic tour of each stadiumNot only does All-Star Baseball 2004 simulate professional baseball, but it also gives you a look into baseball's history and homes. Now, in addition to today's baseball stars, you can play history's greatest players, from the MLB to the Negro Leagues. Take a panoramic tour of each stadium while learning about interesting facts and features. If you're new to the game, all-star Derek Jeter will guide and instruct you in the new Rookie mode tutorial.… Expand"}, {"name": "Rocky", "details_link": "https://www.metacritic.com/game/xbox/rocky", "publisher": "Ubisoft", "release_date": "Nov 17 2002", "developers": ["Rage Software"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/5279a07187bca0d7c8f1edc0ba109bd6-98.jpg", "descriptions": "Jump into the ring as Rocky Balboa and go head-to-head against 29 tough opponents, including Apollo Creed, Clubber Lang, Ivan Drago, and Tommy Gunn. Mickey and company train you from the streets of Philadelphia to the world heavyweight championship bout. Master Rocky's powerful punch combosJump into the ring as Rocky Balboa and go head-to-head against 29 tough opponents, including Apollo Creed, Clubber Lang, Ivan Drago, and Tommy Gunn. Mickey and company train you from the streets of Philadelphia to the world heavyweight championship bout. Master Rocky's powerful punch combos and fast flurries. Practices your skills in Sparring mode and then test them out in the Knockout Tournament against 15 other players. Based on the movie trilogy, Rocky tests your dedication, skill, and heart through various gameplay modes.… Expand"}, {"name": "Phantom Crash", "details_link": "https://www.metacritic.com/game/xbox/phantom-crash", "publisher": "Phantagram", "release_date": "Nov  4 2002", "developers": ["Genki"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/a08de7bc7a5836c3ec38f6f337b81226-98.jpg", "descriptions": "In the wake of massive air pollution and economic disaster in Tokyo, Japan has relocated its capital. Old Tokyo has become the battleground for a new breed of public entertainment called Rumbling. Observing from a massive airborne viewing station, spectators watch Scoobees battle to theIn the wake of massive air pollution and economic disaster in Tokyo, Japan has relocated its capital. Old Tokyo has become the battleground for a new breed of public entertainment called Rumbling. Observing from a massive airborne viewing station, spectators watch Scoobees battle to the death. More than just high-speed, heavily armed Mechs, Scoobees have an unprecendented stealth capability--turning invisible at will for brief periods of time. The stakes are high. The enemies are ruthless. The action is intense.… Expand"}, {"name": "Robotech: Battlecry", "details_link": "https://www.metacritic.com/game/xbox/robotech-battlecry", "publisher": "TDK Mediactive", "release_date": "Sep 25 2002", "developers": ["Vicious Cycle"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/f2a5960c367e2a43190c4f9ab6eaf173-98.jpg", "descriptions": "The Veritech fighter--a mecha capable of fighting on land, in air, and in outer space--is the only weapon you have against the forces of the alien, Zentraedi. As the intrepid fighter pilot Jack Archer, you'll control this powerful robot through more than 40 missions. With each of the 40The Veritech fighter--a mecha capable of fighting on land, in air, and in outer space--is the only weapon you have against the forces of the alien, Zentraedi. As the intrepid fighter pilot Jack Archer, you'll control this powerful robot through more than 40 missions. With each of the 40 Veritech fighters, you can switch from ground to hover and flight modes instantly. Battlecry's combination of fast-paced gameplay, freedom of movement, and dramatic storyline make for a unique combat experience.… Expand"}, {"name": "Cossacks: The Art of War", "details_link": "https://www.metacritic.com/game/pc/cossacks-the-art-of-war", "publisher": "cdv Software", "release_date": "Mar 31 2002", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/5c25ea2d934fd392103301af56f67eac-98.jpg", "descriptions": "The focus of this expansion to \"Cossacks: European Wars\" is on an improved and more dynamic single player mode with adjustable difficulty. In addition to that the internet play and community features were greatly improved allowing players to check out each others histories and reviewThe focus of this expansion to \"Cossacks: European Wars\" is on an improved and more dynamic single player mode with adjustable difficulty. In addition to that the internet play and community features were greatly improved allowing players to check out each others histories and review recorded games. New units, nations, ships, a map editor, joining forces with the computer and exchanging resources all together take Cossacks to a new level. [CDV]… Expand"}, {"name": "Mario Party 3", "details_link": "https://www.metacritic.com/game/nintendo-64/mario-party-3", "publisher": "Nintendo", "release_date": "May  6 2001", "developers": ["Hudson"], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/dc1a9df66e27f1d7662ca99a534a0f5f-98.jpg", "descriptions": "Mario and friends are throwing a party and you're invited. It's their biggest bash yet, with seventy totally new Mini-Games and five brand new adventure boards. You'll be the life of the party as you punch, pound and stampede right over your opponents in a multiplayer melee or goMario and friends are throwing a party and you're invited. It's their biggest bash yet, with seventy totally new Mini-Games and five brand new adventure boards. You'll be the life of the party as you punch, pound and stampede right over your opponents in a multiplayer melee or go head-to-head in the new two-player duel mode. You can even unlock new characters in the one-player challenge. With so much fun and excitement, this is  a bash you'll just have to crash!… Expand"}, {"name": "Delta Force: Land Warrior", "details_link": "https://www.metacritic.com/game/pc/delta-force-land-warrior", "publisher": "NovaLogic", "release_date": "Nov  7 2000", "developers": ["NovaLogic"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/297b2c6a1fa587b0e3069745563ffe04-98.jpg", "descriptions": "Engage the enemy in expansive indoor and vast outdoor environments; select from a team of diverse characters, each with their own special abilities; advanced new rifles, systems, machine guns, and grenade launchers; developed from the same engine used to train the U.S. Army elite LandEngage the enemy in expansive indoor and vast outdoor environments; select from a team of diverse characters, each with their own special abilities; advanced new rifles, systems, machine guns, and grenade launchers; developed from the same engine used to train the U.S. Army elite Land Warrior soldiers.  [NovaLogic]… Expand"}, {"name": "Army Men: Air Attack 2", "details_link": "https://www.metacritic.com/game/playstation/army-men-air-attack-2", "publisher": "3DO", "release_date": "Sep 26 2000", "developers": ["3DO"], "platforms": ["PlayStation 2", "PlayStation"], "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 74, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/dde5d694001a1c0379aa63431646987c-98.jpg", "descriptions": "Plastro, the nefarious leader of the Tan army, has enlisted the help of the villainous Baron von Beige to help him set a trap for Captain Blade! The Alpha Wolf Squadron once again 'takes to the skies' with an onslaught of new missions, improved helicopters and more pyrotechnic weaponry thanPlastro, the nefarious leader of the Tan army, has enlisted the help of the villainous Baron von Beige to help him set a trap for Captain Blade! The Alpha Wolf Squadron once again 'takes to the skies' with an onslaught of new missions, improved helicopters and more pyrotechnic weaponry than ever before. Join the Air Cavalry as they face a host of challenging foes in their efforts to stop the General's evil plans.… Expand"}, {"name": "Quake", "details_link": "https://www.metacritic.com/game/nintendo-64/quake", "publisher": "Midway", "release_date": "Mar 24 1998", "developers": ["Midway Studios - San Diego"], "platforms": ["PC", "Nintendo 64"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/54ea0812161ff402ab44ce7880da7e52-98.jpg", "descriptions": "Heart-pounding gameplay, spectacular graphics and brain-shattering sound effects - guaranteed to have players jumping out of their skins! Incorporates the ferocity of the single-player game with the ultimate bloodlust of the two-player splitscreen Deathmatch. A true 3D polygonal environmentHeart-pounding gameplay, spectacular graphics and brain-shattering sound effects - guaranteed to have players jumping out of their skins! Incorporates the ferocity of the single-player game with the ultimate bloodlust of the two-player splitscreen Deathmatch. A true 3D polygonal environment that includes the most horrific creatures to grace a console. Startling dynamic lighting, levels designed by the masters, and an arsenal of the most awesome weaponry to match.… Expand"}, {"name": "Bomberman", "details_link": "https://www.metacritic.com/game/psp/bomberman", "publisher": "Konami", "release_date": "Sep 12 2006", "developers": ["Hudson"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "General", "Action"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/98b066fe0cf059db270132030a98f800-98.jpg", "descriptions": "Bomberman arrives on the PSP with nostalgic gameplay and a new twist for the next generation of wireless, mobile gaming. An ominous black shadow is creeping towards Bomberman's planet, and sudden attacks by a mysterious robot army have brain-washed the inhabitants of surrounding planets,Bomberman arrives on the PSP with nostalgic gameplay and a new twist for the next generation of wireless, mobile gaming. An ominous black shadow is creeping towards Bomberman's planet, and sudden attacks by a mysterious robot army have brain-washed the inhabitants of surrounding planets, causing mass chaos. Bomberman must embark on a new adventure through the galaxy to restore peace and order. Normal Mode: the latest Bomberman complete with a new story and 100 levels featuring a new Item Stock system allowing for the collection and strategic use of more items. Classic Mode: based on original classic Bomberman featuring over 50 different levels. Multiplayer Battle Mode: up to 4 players can fight for survival in a variety of highly customizable games across 20 different stages via wireless ad hoc mode. Game Sharing: Up to 4 players can battle from 1 UMD game disc. [Konami]… Expand"}, {"name": "Kessen III", "details_link": "https://www.metacritic.com/game/playstation-2/kessen-iii", "publisher": "Koei", "release_date": "Feb 22 2005", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Historic"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/ea0e8763113e1f77c109924d7df2b000-98.jpg", "descriptions": "Kessen III marks the franchise's return to Japanese history and aesthetics. It is the middle of the turbulent Sengoku or \"warring states\" period. Endless chaos and plunder have consumed the islands of Japan. A young teenager, known for his extravagant appearance and unconventional attitudeKessen III marks the franchise's return to Japanese history and aesthetics. It is the middle of the turbulent Sengoku or \"warring states\" period. Endless chaos and plunder have consumed the islands of Japan. A young teenager, known for his extravagant appearance and unconventional attitude emerges from Central Japan- he is Nobunaga Oda. While elders admonished him, his contemporaries admired him. Blessed with an indomitable vision and fearless constitution, the soon-to-be legendary Nobunaga will stand against legions of warriors in order to resurrect a land filled with chaos and sorrow. KESSEN III now features non-linear stage selection, an officer and troop development system, and a process that allows players to equip officers with over 450 weapons, helmets, and samurai armor. The game's deep and compelling narrative will unfold throughout 120 combined minutes of movie sequences, accompanied by a stirring musical score from legendary composer Reijiro Koroku. [KOEI]… Expand"}, {"name": "What Did I Do to Deserve This, My Lord!? 2", "details_link": "https://www.metacritic.com/game/psp/what-did-i-do-to-deserve-this-my-lord!-2", "publisher": "NIS America", "release_date": "Apr 29 2010", "developers": ["Acquire"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "General", "General"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/4bb564c8044342bb78da6b5062e79af8-98.jpg", "descriptions": "The sequel to Holy Invasion of Privacy, Badman! What Did I Do To Deserve This?"}, {"name": "Harvestella", "details_link": "https://www.metacritic.com/game/switch/harvestella", "publisher": "Square Enix", "release_date": "Nov  4 2022", "developers": ["Square Enix", "Live Wire"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/1/760f9a26331af51997c68d9dd3e9f28b-98.jpg", "descriptions": "In a vibrant and colourful world, players will tend their crops, befriend the townsfolk, overcome threats, discover the origins of the world and the truth behind the calamity along the way. The story begins when the player wakes up in the middle of \"Quietus,\" a calamity that comes with eachIn a vibrant and colourful world, players will tend their crops, befriend the townsfolk, overcome threats, discover the origins of the world and the truth behind the calamity along the way. The story begins when the player wakes up in the middle of \"Quietus,\" a calamity that comes with each change of season and threatens all life. \"Quietus\" A season of death that comes at the turn of each season. Crops wither and the dust of death prevents people from even walking outside. It is said that the duration of Quietus is getting longer each year.\r \"World\"\rPlayers will be able to explore the various cities and dungeons of the world: \"Nemea Town,\" where cherry blossoms bloom all year round, \"Seaside Town Shatolla,\" with a lively bar scene, \"Lethe Village,\" with its beautiful colors of the four seasons, and the snow-covered \"Holy Capital Argene.\" In order for players to reach the \"Seaslight,\" the four giant crystals that govern the seasons, they must cross a beautiful yet rugged path.… Expand"}, {"name": "Game of Thrones: Episode Two - The Lost Lords", "details_link": "https://www.metacritic.com/game/pc/game-of-thrones-episode-two---the-lost-lords", "publisher": "Telltale Games", "release_date": "Feb  3 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/4adeee82eed916e8ce394875358820b4-98.jpg", "descriptions": "The Lost Lords is the second of six installments in the Game of Thrones: A Telltale Games Series."}, {"name": "Outriders", "details_link": "https://www.metacritic.com/game/xbox-series-x/outriders", "publisher": "Square Enix", "release_date": "Apr  1 2021", "developers": ["People Can Fly"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/0323f591717054042bcaa64d5bb296ea-98.jpg", "descriptions": "Outriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leaveOutriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leave behind the slums and shanty towns of the First City and traverse forests, mountains and desert in the pursuit of a mysterious signal. Combining intense gunplay with violent powers and an arsenal of increasingly twisted weaponry and gear-sets, Outriders offers countless hours of gameplay from one of the finest shooter developers in the industry People Can Fly.… Expand"}, {"name": "Call of Duty: Ghosts", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-ghosts", "publisher": "Activision", "release_date": "Nov  5 2013", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One", "Xbox 360"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 73, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/9/05a56af2076d7cc3885ac2e1631e36ee-98.jpg", "descriptions": "This installment in the Call of Duty series features a fresh dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. 10 years after a devastating mass event, the nation's borders and the balance of global power have beenThis installment in the Call of Duty series features a fresh dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. 10 years after a devastating mass event, the nation's borders and the balance of global power have been permanently changed. As what's left of the nation's Special Operations forces, a mysterious group known only as \"Ghosts\" leads the fight back against a newly emerged, technologically-superior global power. In Call of Duty: Ghosts you don't just create a class, you create a soldier. Choose the head, body type, head-gear and equipment, and you can even create a female soldier for the first time. With over 20,000 possible combinations, you can create the soldier you've always wanted. And each soldier you create will also have his or her own load outs.… Expand"}, {"name": "Scrapland", "details_link": "https://www.metacritic.com/game/xbox/scrapland", "publisher": "Enlight Software", "release_date": "Feb 28 2005", "developers": ["Mercury Steam"], "platforms": ["PC", "Xbox"], "num_players": "4  Online", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/6c7eb69c948fd8e13b9c0af7115ee592-98.jpg", "descriptions": "Enter a futuristic world where humans are feared. In Scrapland, you'll play the role of D-Tritus, an intergalactic traveler who finds himself involved in a series of mysterious murders. To solve this mystery that plagues the city of Chimera, you must use your ability to transform into any ofEnter a futuristic world where humans are feared. In Scrapland, you'll play the role of D-Tritus, an intergalactic traveler who finds himself involved in a series of mysterious murders. To solve this mystery that plagues the city of Chimera, you must use your ability to transform into any of the 15 character types--each with its own unique powers and skills. There are also hundreds of vehicles in Scrapland, and you have the skills to pilot each one. … Expand"}, {"name": "Pursuit Force: Extreme Justice", "details_link": "https://www.metacritic.com/game/psp/pursuit-force-extreme-justice", "publisher": "SCEA", "release_date": "Jan 29 2008", "developers": ["Bigbig Studios"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/d5250185e72a0f2a96a10a90c613fd3f-98.jpg", "descriptions": "More over-the-top than its predecessor, Pursuit Force: Extreme Justice has players taking the role of a commander who is the highest ranking operational officer as well as four new playable characters, all of whom are responsible for tracking down and bringing to justice five hardcore streetMore over-the-top than its predecessor, Pursuit Force: Extreme Justice has players taking the role of a commander who is the highest ranking operational officer as well as four new playable characters, all of whom are responsible for tracking down and bringing to justice five hardcore street gangs in and around Capital City. As a member of a special police unit known as the Pursuit Force, this time around players engage in high-speed action to traverse land, air and sea in their continued battle to rid the city of crime which includes three new gangs. Featuring more than 50 criminal cases set among seven distinct environments, players have access to 12 different vehicle types which include hovercrafts and boss vehicles that are each unique and specifically designed for boss encounter missions. Extreme Justice also offers an expanded weapons arsenal to assist players in the pursuit of justice. Pursuit Force: Extreme Justice also introduces multiplayer capabilities to the franchise with up to four players in Ad Hoc mode. [SCEA]… Expand"}, {"name": "The Cruel King and the Great Hero", "details_link": "https://www.metacritic.com/game/switch/the-cruel-king-and-the-great-hero", "publisher": "NIS America", "release_date": "Mar 15 2022", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/fba7a22c5d5fd4f18a6e5a293547da3e-98.jpg", "descriptions": "The Wicked King and the Noble Hero is an RPG with a human child named Yuu and the dragon that acts as her foster parent.\r In the game, the world was ruled by the dragon overlord, and it was defeated by the hero. But instead of killing the dragon, the hero decided just to cut off its hornsThe Wicked King and the Noble Hero is an RPG with a human child named Yuu and the dragon that acts as her foster parent.\r In the game, the world was ruled by the dragon overlord, and it was defeated by the hero. But instead of killing the dragon, the hero decided just to cut off its horns where his power came from, and the two became friends. One day, the hero returns to the dragon with his daughter named Yuu asking to look after her.\r The dragon telling to Yuu about her father's feat and then she decided to become a hero like her father.… Expand"}, {"name": "Severed Steel", "details_link": "https://www.metacritic.com/game/pc/severed-steel", "publisher": "Digerati Distribution", "release_date": "Sep 17 2021", "developers": ["Greylock Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/83545d4bf8d94d876c1440350f285ee3-98.jpg", "descriptions": "Severed Steel is a single-player FPS featuring a fluid stunt system, destructible voxel environments, loads of bullet time, and a unique one-armed protagonist. It's you, your trigger finger, and a steel-toed boot against a superstructure full of bad guys. Chain together wall runs, dives,Severed Steel is a single-player FPS featuring a fluid stunt system, destructible voxel environments, loads of bullet time, and a unique one-armed protagonist. It's you, your trigger finger, and a steel-toed boot against a superstructure full of bad guys. Chain together wall runs, dives, flips, and slides to take every last enemy down. Play as Steel, a nimble, one-armed sharpshooter on a mission. There is no reloading - pick your shots well and be ready to pry a loaded weapon from your enemies' cold dead hands.… Expand"}, {"name": "Batman: The Telltale Series - Episode 4: Guardian of Gotham", "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-telltale-series---episode-4-guardian-of-gotham", "publisher": "Telltale Games", "release_date": "Nov 22 2016", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/fb029b3e8318734d61305342b70c42b2-98.jpg", "descriptions": "Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. The fate of Bruce Wayne, his dark persona, Batman, and Gotham hang in the balance."}, {"name": "Phantom Doctrine", "details_link": "https://www.metacritic.com/game/pc/phantom-doctrine", "publisher": "Good Shepherd Entertainment", "release_date": "Aug 14 2018", "developers": ["CreativeForge Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/6666af1f1730c7be480e1a1130ca4a77-98.jpg", "descriptions": "Set in 1983 during the Cold War, Phantom Doctrine is an alternate history thriller in which players lead The Cabal, a secret organization dedicated to fighting a global conspiracy committed to controlling the world by pitting world leaders and nations against one another."}, {"name": "Namco Museum Battle Collection", "details_link": "https://www.metacritic.com/game/psp/namco-museum-battle-collection", "publisher": "Namco", "release_date": "Aug 23 2005", "developers": ["TOSE"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/2f68ca26ede400a84e36687f47097045-98.jpg", "descriptions": "(Known in Japan as \"Namco Museum\")   Offering new and original versions of some of Namco's most beloved arcade classics including \"Galaga,\" \"Pac-Man\" and \"Dig Dug,\" the U.S. release of Namco Museum Battle Collection includes exclusive titles such as \"Xevious,\" \"Bosconian,\" \"Mappy,\" \"Tower of(Known in Japan as \"Namco Museum\")   Offering new and original versions of some of Namco's most beloved arcade classics including \"Galaga,\" \"Pac-Man\" and \"Dig Dug,\" the U.S. release of Namco Museum Battle Collection includes exclusive titles such as \"Xevious,\" \"Bosconian,\" \"Mappy,\" \"Tower of Druaga,\" \"Dragon Buster,\" \"Grobda,\" \"Dig Dug 2,\" \"King & Balloon\" and others bring the total to more than 20 individual games. [Namco]… Expand"}, {"name": "Yggdra Union: We'll Never Fight Alone", "details_link": "https://www.metacritic.com/game/psp/yggdra-union-well-never-fight-alone", "publisher": "Atlus", "release_date": "Sep 16 2008", "developers": ["Sting"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "General", "Historic", "Tactics"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/6fc3f388ee9d622caba3f8dfce497d28-98.jpg", "descriptions": "Yggdra Union is a card-based strategy RPG for the PSP. For years, strategy RPG fans have accepted repetitive, non-interactive battle sequences as the genre standard; few games have dared to break the mold. Yggdra Union blows through, shattering the mold into tiny, unrecognizable bits.Yggdra Union is a card-based strategy RPG for the PSP. For years, strategy RPG fans have accepted repetitive, non-interactive battle sequences as the genre standard; few games have dared to break the mold. Yggdra Union blows through, shattering the mold into tiny, unrecognizable bits. Experience a fresh mix of turn-based strategy and real-time action, constantly engaging the player and providing intense gameplay combined with tactical card-based combat. Originally released for Game Boy Advance, Yggdra Union is remade and loaded with enhancements, including fully remastered audio and visuals (featuring the artwork of famed character designer and manga artist Satoko Kiyuzuki), fully-voiced dialogue in both Japanese and English, a widescreen aspect ratio, additional difficulty settings, new unlockable content, and more... all exclusive to the PSP system. [Atlus USA]… Expand"}, {"name": "NBA Live 08", "details_link": "https://www.metacritic.com/game/xbox-360/nba-live-08", "publisher": "EA Sports", "release_date": "Oct  1 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 73, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/3d8fedfc3f1fc0458eb9022f77a762b3-98.jpg", "descriptions": "Taking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay mechanic is mapped to the right analog stick and gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that letTaking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay mechanic is mapped to the right analog stick and gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that let you dominate on the perimeter. Pass the ball inside and win the battle in the post with all-new 'own the paint' post play for the big men down low. Use the new shot-countershot control to string together combos of fakes and shots to fool your defender into committing and create space for the game-defining bucket. NBA Live 08 introduces hot spots, where real NBA shot data is used to illuminate the locations on the floor where your players are most effective. Couple this with all-new signature go-to moves that capture the essence of the NBA's best, and you can now play the game on a console like you see it from the stands. [Electronic Arts]… Expand"}, {"name": "Naruto: Ultimate Ninja 2", "details_link": "https://www.metacritic.com/game/playstation-2/naruto-ultimate-ninja-2", "publisher": "Namco Bandai Games", "release_date": "Jun 12 2007", "developers": ["CyberConnect2"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/97f81f02e34744819eb3e0a5ec88651d-98.jpg", "descriptions": "In Naruto: Ultimate Ninja 2 gamers can play through monumental events in the NARUTO storyline all while earning points toward upgrading their character's strength, defense, agility, chakra and special abilities. Players can walk the path of NARUTO in the new all-new mode, Ultimate Road, thatIn Naruto: Ultimate Ninja 2 gamers can play through monumental events in the NARUTO storyline all while earning points toward upgrading their character's strength, defense, agility, chakra and special abilities. Players can walk the path of NARUTO in the new all-new mode, Ultimate Road, that will allow them to play through all of the pivotal events in the storyline, as well as unlock an original story, as more and more pieces of the NARUTO saga unfold. More than 60 exciting missions and seven challenging mini games push potential ninja to their limit. Players can assume the role of Naruto, Sasake, Kakashi, Rock Lee, Gara, Kiba and other favorites while taking on daunting tasks like battling the sand ninja and working their way through the Chunin exam, the test to move up in the ninja ranks. Ninja in training can perfect their skills in Practice mode then put their training to the test against a friend in the VS mode. With a vast amount of unlockable features such as playable characters, movies, music, collectible cards and more NARUTO fans will be busy. [Namco Bandai Games]… Expand"}, {"name": "Sherlock Holmes: Crimes & Punishments", "details_link": "https://www.metacritic.com/game/playstation-4/sherlock-holmes-crimes-punishments", "publisher": "Focus Home Interactive", "release_date": "Sep 30 2014", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/ea6a267aac2d925564f139ab85265f71-98.jpg", "descriptions": "It is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of theIt is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of the detective written in the pure tradition of Conan Doyle's novels. Each case offers real freedom to players, who will have to make important moral choices instead of simply enforcing justice by the book. All decisions have an influence in the game, so bear the weight of your choices!… Expand"}, {"name": "Disc Jam", "details_link": "https://www.metacritic.com/game/switch/disc-jam", "publisher": "High Horse Entertainment", "release_date": "Feb  8 2018", "developers": ["High Horse Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/f60ac018891e510b9c530a39880f2fde-98.jpg", "descriptions": "A fast-paced action-sports game that pits 2-4 players against each other in a unique combination of air hockey and tennis. Players scramble to retrieve and throw a glowing disc while unleashing devastating abilities and defending variable-point end zones. An exciting blend of strategy andA fast-paced action-sports game that pits 2-4 players against each other in a unique combination of air hockey and tennis. Players scramble to retrieve and throw a glowing disc while unleashing devastating abilities and defending variable-point end zones. An exciting blend of strategy and skill, this arcade-inspired title boasts a zany roster of characters to compete with friends both on the couch and online.… Expand"}, {"name": "Ladykiller in a Bind", "details_link": "https://www.metacritic.com/game/pc/ladykiller-in-a-bind", "publisher": "Love Conquers All Games", "release_date": "Oct 10 2016", "developers": ["Love Conquers All Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Adventure", "Visual Novel"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/e831981661e04a986d2b92a9943401fb-98.jpg", "descriptions": "My Twin Brother Made Me Crossdress As Him And Now I Have To Deal With A Geeky Stalker And A Domme Beauty Who Want Me In A Bind!! or, Ladykiller in a Bind. Can you survive seven days trapped on a cruise ship with your brother’s classmates and enemies, forced into a game of high stakes socialMy Twin Brother Made Me Crossdress As Him And Now I Have To Deal With A Geeky Stalker And A Domme Beauty Who Want Me In A Bind!! or, Ladykiller in a Bind. Can you survive seven days trapped on a cruise ship with your brother’s classmates and enemies, forced into a game of high stakes social manipulation? An erotic visual novel by the creators of Analogue: A Hate Story about social manipulation, crossdressing, and girls tying up other girls.… Expand"}, {"name": "Disney/Pixar Toy Story 3", "details_link": "https://www.metacritic.com/game/pc/disneypixar-toy-story-3", "publisher": "Disney Interactive Studios", "release_date": "Jun 15 2010", "developers": ["Avalanche Software"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation 5", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/204e4fd704ea181cd500b614f9a5289c-98.jpg", "descriptions": "Unleash your imagination in this new open world and play with Andy's toys your way. As Buzz, Woody, or Jessie, you choose what activities you want to do and the order you wish to do them. The more you use your imagination and create your own story, the more you get rewarded. [Disney Interactive]"}, {"name": "New International Track & Field", "details_link": "https://www.metacritic.com/game/ds/new-international-track-field", "publisher": "Konami", "release_date": "Jul 22 2008", "developers": ["Sumo Digital"], "platforms": "DS", "num_players": "4  Online", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/f2c708bb2dc290acbeca1c5224ff49c8-98.jpg", "descriptions": "The classic sporting game series of Track and Field celebrates its' 25th Anniversary by coming to the Nintendo DS. All the excitement and fun of the original titles is brought up to date with a bright and stylish new look, more events and online play. The gameplay was developed to take fullThe classic sporting game series of Track and Field celebrates its' 25th Anniversary by coming to the Nintendo DS. All the excitement and fun of the original titles is brought up to date with a bright and stylish new look, more events and online play. The gameplay was developed to take full advantage of the touch screen and stylus, thus providing gamers with a unique experience on the DS. Players can either dip into single events or take on the challenge of the sporting career mode. Test your skills against the world via Nintendo Wi-Fi Connect and see if you have what it takes to become the best in the world. Going beyond mere online play New International Track and Field features online tournaments and worldwide rankings. More than 20 athletic challenges including 100 meter sprint, high jump, archery, pole vaulting, and javelin. Massive online feature set – 4 player game sharing, worldwide rankings, and online tournaments. 15+ characters that are both original to the game and fan favorite Konami characters. 6 of Konami characters have a Challenge Event that will test your skills in unique and entertaining ways. Customize you athlete with new costumes and other cool items. Voice Boost – Use the microphone on the DS to give your character a boost by shouting words of encouragement. The louder you are, the bigger the boost. [Konami]… Expand"}, {"name": "FlatOut 2", "details_link": "https://www.metacritic.com/game/playstation-2/flatout-2", "publisher": "Vivendi Games", "release_date": "Aug  1 2006", "developers": ["Bugbear"], "platforms": ["PC", "PlayStation 2"], "num_players": "6  Online", "genres": ["Driving", "Demolition Derby"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/158002c063e46648a7b5bf59fdaf6b63-98.jpg", "descriptions": "Featuring an enhanced version of the original's physics engine with even faster driving track designs, FlatOut 2 also boasts numerous improvements, enhancements and additions to make the title the definitive FlatOut experience. Twice as many vehicles, a more sophisticated career mode,Featuring an enhanced version of the original's physics engine with even faster driving track designs, FlatOut 2 also boasts numerous improvements, enhancements and additions to make the title the definitive FlatOut experience. Twice as many vehicles, a more sophisticated career mode, additional race environments, double the number of tracks, twice as many mini-games along with brand new and much requested online multiplayer modes are just some of the exhaustive features that are included in FlatOut 2. With more than 5,000 fully destructible objects on every track as well as 40 deformable parts on each vehicle, physical interaction in a racing game is taken to unprecedented heights. With a greater emphasis placed on causing destruction on the track by offering greater rewards, game play will be even more frantic than ever. Drivers will need to tear into competitors' cars, trash the local scenery, litter the track with obstacles, while at the same time trying to concentrate on their own race in a bid to cross the line first. The ever-popular Ragdoll mini-games from the original FlatOut game make a welcome return and are better than ever with 12 Ragdoll events, a Ragdoll Championship and full online support. New Ragdoll events include basketball, baseball and royal flush cards. [Empire Interactive]… Expand"}, {"name": "Medal of Honor Heroes 2", "details_link": "https://www.metacritic.com/game/wii/medal-of-honor-heroes-2", "publisher": "Electronic Arts", "release_date": "Nov 13 2007", "developers": ["EA Canada"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/91351bbb7232f6a85857bb244d22210a-98.jpg", "descriptions": "It's June 6th, 1944, and the war is in your hands. Step into the boots of OSS Operative John Berg and infiltrate Normandy from behind enemy lines to undermine the Nazi regime. Choose to tackle all-new missions in traditional single player campaign or engage in massive, 32-player online,It's June 6th, 1944, and the war is in your hands. Step into the boots of OSS Operative John Berg and infiltrate Normandy from behind enemy lines to undermine the Nazi regime. Choose to tackle all-new missions in traditional single player campaign or engage in massive, 32-player online, continuous-joining multiplayer battles where you can jump into the battle at any time. The Wii version also features full support of the Wii Zapper, allowing for a more immersive WWII action than ever. In addition to a full-fledged single player campaign, Medal of Honor Heroes 2 also features an all-new mode designed specifically for the Wii that simplifies gameplay for players of all skills levels for easy pick-up-and-play action. This mode plays like an old-school rail shooter - the Wii moves you around, while you do your part - taking enemies out and achieving objectives. [Electronic Arts]… Expand"}, {"name": "Aragami: Shadow Edition", "details_link": "https://www.metacritic.com/game/switch/aragami-shadow-edition", "publisher": "Merge Games", "release_date": "Feb 21 2019", "developers": ["Lince Works"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/52e09dcae73f429990f0f9953b211d4d-98.jpg", "descriptions": "You are Aragami, an undead warrior with the power to control the shadows. You've been summoned back to the world of the living by Yamiko, a girl imprisoned in the city fortress of Kyuryu. Embark on a dark journey full of blood and secrets to recover the broken fragments of your memories.You are Aragami, an undead warrior with the power to control the shadows. You've been summoned back to the world of the living by Yamiko, a girl imprisoned in the city fortress of Kyuryu. Embark on a dark journey full of blood and secrets to recover the broken fragments of your memories. Infiltrate the occupied city of Kyuryu with your supernatural powers and fight light with shadows. Uncover a story about twin souls bound together by destiny that surpasses time and memories.… Expand"}, {"name": "Super Mario Maker for Nintendo 3DS", "details_link": "https://www.metacritic.com/game/3ds/super-mario-maker-for-nintendo-3ds", "publisher": "Nintendo", "release_date": "Dec  2 2016", "developers": ["Nintendo"], "platforms": ["Wii U", "3DS"], "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/29ab9a1e970607752b6e6c465bbf831c-98.jpg", "descriptions": "Get ready to play a near-infinite number of side-scrolling 2D Mario courses anytime, anywhere. Earn in-game medals in 100 built-in courses and access recommended courses from the Super Mario Maker game on the Wii U console. Plus, design courses and share them with other players via theGet ready to play a near-infinite number of side-scrolling 2D Mario courses anytime, anywhere. Earn in-game medals in 100 built-in courses and access recommended courses from the Super Mario Maker game on the Wii U console. Plus, design courses and share them with other players via the StreetPass feature and local wireless. Want your cannons to shoot coins? Go for it. In this game, you call the shots, and simple touch-screen controls and interactive tutorials make designing courses a snap. Learn design tips and tricks from Mary O. and Yamamura, then share your masterpieces via the StreetPass feature and local wireless. Collaborating has never been easier now that you can share incomplete courses with other players. Finish off a course together and a special icon will commemorate the collaboration. That's one of many reasons that this is the must-play portable Mario™ game for inventive groups of friends and anyone yearning for never-ending Super Mario magic. [Nintendo]… Expand"}, {"name": "The Deadly Tower of Monsters", "details_link": "https://www.metacritic.com/game/pc/the-deadly-tower-of-monsters", "publisher": "Atlus", "release_date": "Jan 19 2016", "developers": ["ACE Team"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/e3a827f790731a6f510c028c3ec51bb1-98.jpg", "descriptions": "Engage your ray guns, crystal swords, and laser whips, and get ready for thrills and chills. With 3 movie stars playing out decidedly B-level sci-fi exploits, Dick Starspeed, Scarlet Nova, and Robot will have you ready to jump off the side of the tower—right into adventure."}, {"name": "Resident Evil: Revelations 2 - Episode 1: Penal Colony", "details_link": "https://www.metacritic.com/game/pc/resident-evil-revelations-2---episode-1-penal-colony", "publisher": "Capcom", "release_date": "Feb 24 2015", "developers": ["Capcom"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/28fe3de06e5d931fb651f0a4a6c26da1-98.jpg", "descriptions": "The first episode is entitled Penal Colony. Claire Redfield, one of the only survivors of the Raccoon City incident of 1998, has since joined an NGO called Terra Save, whose mission is to assist victims of biological weaponry. During an event at Terra Save’s HQ, a mysterious force abductsThe first episode is entitled Penal Colony. Claire Redfield, one of the only survivors of the Raccoon City incident of 1998, has since joined an NGO called Terra Save, whose mission is to assist victims of biological weaponry. During an event at Terra Save’s HQ, a mysterious force abducts Claire and her co-workers and moves them to a creepy deserted island.… Expand"}, {"name": "The Testament of Sherlock Holmes", "details_link": "https://www.metacritic.com/game/pc/the-testament-of-sherlock-holmes", "publisher": "Frogwares", "release_date": "Sep 25 2012", "developers": ["Frogwares", "Spiders"], "platforms": ["PlayStation 3", "Switch", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/b9717d4c22774fb2f95a16f175e00f74-98.jpg", "descriptions": "The famous detective Sherlock Holmes is back on the PC and Xbox 360 for a great adventure and probably the most dangerous investigation of his entire career."}, {"name": "Europa Universalis: Rome", "details_link": "https://www.metacritic.com/game/pc/europa-universalis-rome", "publisher": "Paradox Interactive", "release_date": "Apr 15 2008", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "32  Online", "genres": ["Strategy", "General", "General"], "meta_score": 73, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/5a8894a094bde59c49f4e7744494e09b-98.jpg", "descriptions": "Europa Universalis: Rome will cover the time period from the first Punic War to the start of the true Empire. Players will have thousand of gameplay choices ranging from country, culture, provincial and character options to name but a few, making each and every game infinitely customizableEuropa Universalis: Rome will cover the time period from the first Punic War to the start of the true Empire. Players will have thousand of gameplay choices ranging from country, culture, provincial and character options to name but a few, making each and every game infinitely customizable and truly unique. Fully 3D map with integrated graphics and detailed topography. Start at any date between 280 B.C. and 27 B.C. Choose between 10 different cultures, including the Roman, Celtic, Greek and Egyptian civili­zations, with more than 53 playable factions on a map spanning hundreds of provinces. Watch your characters develop new traits through political intrigue and various interactions with thousands of other characters. Trade, negotiate or fight with your neighbours and advance your technologies to unite the Mediterranean World. Robust multiplayer allows you to challenge up to 32 players either competitively or in co-op mode. [Paradox Interactive]… Expand"}, {"name": "11-11: Memories Retold", "details_link": "https://www.metacritic.com/game/pc/11-11-memories-retold", "publisher": "Bandai Namco Games", "release_date": "Nov  8 2018", "developers": ["Digixart Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/9b3a5b8cd48dd82e3930b044fb048f06-98.jpg", "descriptions": "11th November 1916, a young photographer leaves Canada to join the Western Front in Europe. The same day, a German technician is told that his son is missing in action on the front… They will discover the reality of war, crossing paths, on the front, and the rear, trying to preserve their11th November 1916, a young photographer leaves Canada to join the Western Front in Europe. The same day, a German technician is told that his son is missing in action on the front… They will discover the reality of war, crossing paths, on the front, and the rear, trying to preserve their humanity for their loved ones in the face of disastrous events… If they can come back. At 11am the 11th Day of the 11th Month of year 1918, they will face the biggest decision of their lives… This is the moving story of the end of World War One. [Bandai Namco]… Expand"}, {"name": "Hammerin' Hero", "details_link": "https://www.metacritic.com/game/psp/hammerin-hero", "publisher": "Atlus", "release_date": "Apr  7 2009", "developers": ["Irem"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/1902536cfab991154e28aae012c72bb9-98.jpg", "descriptions": "Hammerin' Hero marks the triumphant return of Gen, everyone's favorite justice-bringing carpenter! Help Gen fight off Hyosuke Kuromoku and his evil construction company before they can evict Gen's neighbors from their homes!  Gen will have to use a variety of jobs-from DJ to baseballHammerin' Hero marks the triumphant return of Gen, everyone's favorite justice-bringing carpenter! Help Gen fight off Hyosuke Kuromoku and his evil construction company before they can evict Gen's neighbors from their homes!  Gen will have to use a variety of jobs-from DJ to baseball player-through 12 diverse stages if he hopes to thwart the all-out attack of the Kurokomu Group and win the hearts of the people, even if it sometimes means giving them the tough love they need to solve their own problems. Wacky side-scrolling beat 'em up - Play as Gen-san as he hammers away at corporate evil across Japan and the world in this vibrant, action-packed platformer.  The comic adventure unfolds fully-voiced in English and Japanese. Be more than a hammerin' hero - Choose from a variety of jobs, including sushi chef, baseball player, and diver, to give Gen different costumes and attacks as he fights through 12 crazy stages. Along the way, make allies in battle, collect loads of items, and even unlock two more playable characters! Ad-hoc multiplayer - 2 players can play together and compete for the best score on each level over ad-hoc wireless play.  Why hammer alone when you can hammer with a friend? [Atlus USA]… Expand"}, {"name": "Dead or Alive Xtreme Beach Volleyball", "details_link": "https://www.metacritic.com/game/xbox/dead-or-alive-xtreme-beach-volleyball", "publisher": "Tecmo", "release_date": "Jan 22 2003", "developers": ["Team Ninja"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Volleyball"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/e13bae20f7fe52027857eaec05ae7cf5-98.jpg", "descriptions": "The girls of Dead or Alive are back and better than ever in Dead or Alive Xtreme Beach Volleyball.  But this time around the girls are throwing on their bikinis to go head-to-head in outrageous games of beach volleyball.  It's time to get up close with the ladies as they set and spike theirThe girls of Dead or Alive are back and better than ever in Dead or Alive Xtreme Beach Volleyball.  But this time around the girls are throwing on their bikinis to go head-to-head in outrageous games of beach volleyball.  It's time to get up close with the ladies as they set and spike their way to the championship title on the tropical beach resort, Zack Island.  The points you receive on the court enable you to customize your characters with over 100 swimsuits and accessories.  At night, Zack Island becomes a haven for nightlife activities including an island casino and a radio station with all your favorite sand and surf tunes.… Expand"}, {"name": "Shadow Warrior", "details_link": "https://www.metacritic.com/game/pc/shadow-warrior", "publisher": "Devolver Digital", "release_date": "Sep 26 2013", "developers": ["Flying Wild Hog"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/6e952422fdb83dfd6072ca803c699086-98.jpg", "descriptions": "Shadow Warrior is reimagining of 3D Realms' cult classic shooter from developer Flying Wild Hog (Hard Reset) and independent game label Devolver Digital (Serious Sam 3: BFE, Hotline Miami, LUFTRAUSERS) for PC and next-gen consoles.  Blending the viciously over-the-top gunplay of itsShadow Warrior is reimagining of 3D Realms' cult classic shooter from developer Flying Wild Hog (Hard Reset) and independent game label Devolver Digital (Serious Sam 3: BFE, Hotline Miami, LUFTRAUSERS) for PC and next-gen consoles.  Blending the viciously over-the-top gunplay of its predecessor with the elegant precision of the powerful katana, Shadow Warrior promises to be an imaginative take on the classic arcade-style shooter.… Expand"}, {"name": "NBA Live 19", "details_link": "https://www.metacritic.com/game/playstation-4/nba-live-19", "publisher": "Electronic Arts", "release_date": "Sep  7 2018", "developers": ["EA Sports", "EA Tiburon"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/ec41348c8e711fa0c42d068b06b15c36-98.jpg", "descriptions": "Create your own player and rise to legend status in THE ONE. Play on different courts across the world, Build Your Squad, and challenge others for global dominance in THE LEAGUE and on THE STREETS. With new ways to develop your player and play the game, experience the most authentic feel NBACreate your own player and rise to legend status in THE ONE. Play on different courts across the world, Build Your Squad, and challenge others for global dominance in THE LEAGUE and on THE STREETS. With new ways to develop your player and play the game, experience the most authentic feel NBA LIVE has ever had.… Expand"}]