[{"name": "Friday The 13th: The Game - Ultimate Slasher Switch Edition", "details_link": "https://www.metacritic.com/game/switch/friday-the-13th-the-game---ultimate-slasher-switch-edition", "publisher": "Gun Media", "release_date": "Aug 13 2019", "developers": ["Black Tower Studios", "Nighthawk Interactive"], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/928b4113f490adb69a9104cf4e7247e7-98.jpg", "descriptions": "Play as Jason Voorhees. For the first time on Switch, you will have the opportunity to play as Jason Voorhees, the most famous killer in horror. Stalk your prey, ambush them whenever you see fit and strike fear in the hearts of so many hapless victims as you become the legend himself! FridayPlay as Jason Voorhees. For the first time on Switch, you will have the opportunity to play as Jason Voorhees, the most famous killer in horror. Stalk your prey, ambush them whenever you see fit and strike fear in the hearts of so many hapless victims as you become the legend himself! Friday the 13th: The Game will include a variety of kills, new and familiar, that will help you set the tone for the Jason Voorhees that you want to be. You’ll even get to unlock various Jason incarnations from the movies. Jason will be equipped with a terrifying array of abilities, giving you the control of a hunter at the height of his game. These are his woods, and he knows them all too well. Jason will not only feed off the fear of his victims, but will become stronger as the night progresses. The darker the night, the more terrifying Jason becomes.… Expand"}, {"name": "Darksiders III", "details_link": "https://www.metacritic.com/game/xbox-one/darksiders-iii", "publisher": "THQ Nordic", "release_date": "Nov 27 2018", "developers": ["Gunfire Games", "THQ Nordic"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/2b98e3221f870a291e47fb8c75662aca-98.jpg", "descriptions": "Return to an apocalyptic Earth in Darksiders III, a hack-n-slash Action Adventure where players assume the role of FURY in her quest to hunt down and dispose of the Seven Deadly Sins. The most unpredictable and enigmatic of the Four Horsemen, FURY must succeed where many have failed - toReturn to an apocalyptic Earth in Darksiders III, a hack-n-slash Action Adventure where players assume the role of FURY in her quest to hunt down and dispose of the Seven Deadly Sins. The most unpredictable and enigmatic of the Four Horsemen, FURY must succeed where many have failed - to bring balance to the forces that now ravage Earth. Darksiders III is the long-anticipated, third chapter in the critically-acclaimed Darksiders franchise.… Expand"}, {"name": "Dragon Ball: Xenoverse", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-ball-xenoverse", "publisher": "Bandai Namco Games", "release_date": "Feb 24 2015", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/a487fb4b16ede5a761ec083375b49ab1-98.jpg", "descriptions": "DRAGON BALL XENOVERSE brings all the frenzied battles between Goku and his fiercest rivals, such as Vegeta, Frieza, Cell and many more, with new gameplay design. Players revisit all famous battles from the series through their own custom-created Avatars, which are connected to Trunks andDRAGON BALL XENOVERSE brings all the frenzied battles between Goku and his fiercest rivals, such as Vegeta, Frieza, Cell and many more, with new gameplay design. Players revisit all famous battles from the series through their own custom-created Avatars, which are connected to Trunks and many other characters. With the help of Trunks, travel through time and intervene with the past to restore Dragon Ball history. DRAGON BALL XENOVERSE take the universe from series' creator Akira Toriyama by storm and breaks tradition with a new world setup, the mysterious Toki Toki City.… Expand"}, {"name": "Kitaria Fables", "details_link": "https://www.metacritic.com/game/switch/kitaria-fables", "publisher": "PQube", "release_date": "Sep  2 2021", "developers": ["Twin Hearts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Action RPG", "Management", "Business / Tycoon"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/9b5ca6982132af89d26655f04c8957d1-98.jpg", "descriptions": "Action Adventure fused with RPG and Farming elements. Armed with sword, bow and spellbook, fight against a rising darkness threatening the world. Plunder dungeons in search of relics and resources, tend to your farm to make provisions and potions, and take on quests solo, or with a friend."}, {"name": "Fairy Tail", "details_link": "https://www.metacritic.com/game/switch/fairy-tail", "publisher": "Koei Tecmo Games", "release_date": "Jul 31 2020", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/138e4853c4859e09bd7af45a9c3ccb81-98.jpg", "descriptions": "Fight for Your Guild with Powerful Magical Abilities in FAIRY TAIL FAIRY TAIL, based on Hiro Mashima's best-selling manga and anime series of the same name, follows the spell-binding plot from \"The Grand Magic Games\" story arc -- enabling gamers to re-live, or experience for the firstFight for Your Guild with Powerful Magical Abilities in FAIRY TAIL FAIRY TAIL, based on Hiro Mashima's best-selling manga and anime series of the same name, follows the spell-binding plot from \"The Grand Magic Games\" story arc -- enabling gamers to re-live, or experience for the first time, the exciting episodes of this fan-favorite storyline. Not only will they be able to experience stories previously told in the manga and anime, but they will even be able to enjoy never before seen story and quest elements.Throughout their journey, players will be able to form a party from a selection of over ten iconic characters, including: the fire dragon slayer, Natsu Dragneel; the celestial mage, Lucy Heartfilia; the ice-make mage, Gray Fullbuster; the fairy queen 'Titania', Erza Scarlet; and the young sky dragon slayer, Wendy Marvell. With a wealth of guild members to recruit to their party, players can form their own dream team even including an unlikely group of allies for their own unique adventure.The fiery and intense magical battles from the series are breathtakingly brought to life in FAIRY TAIL's environment; with a diverse range of magic available for the extraordinary characters to wield. Renowned moves from the series light up the screen, with some characters such as Natsu being able to take advantage of mode changes like utilizing the eye-popping Lightning Fire Dragon Mode. In addition, some guild members will be available to support in battle; including the Fairy Tail Guild Master, Makarov Dreyar, who can be called in to provide powerful aid on the battlefield.In FAIRY TAIL, completing battles and quests will not only level up party members, it will lead to character bonding scenarios, provide options to upgrade the guild, and eventually raise the 'Guild Rank' enabling players to take on more challenging missions in their quest to become the greatest guild in Fiore.… Expand"}, {"name": "Dead or Alive 5 Last Round", "details_link": "https://www.metacritic.com/game/pc/dead-or-alive-5-last-round", "publisher": "Koei Tecmo Games", "release_date": "Mar 30 2015", "developers": ["Team Ninja"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Fighting", "3D"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/080e0225a31ef60cb7ba7ad23585b5c1-98.jpg", "descriptions": "2 new playable characters join the fray to make 34 fighters. Master the signature DOA fighting system through the textured story and tutorial modes, unlock more costumes than ever before in each of the offline training modes, and compete with the best fighters in the world in the online2 new playable characters join the fray to make 34 fighters. Master the signature DOA fighting system through the textured story and tutorial modes, unlock more costumes than ever before in each of the offline training modes, and compete with the best fighters in the world in the online training modes. Fight as ninjas, assassins, roughnecks & wrestlers as you knock your opponents off an exotic waterfall, into an exploding oil rig and more.… Expand"}, {"name": "Megabyte Punch", "details_link": "https://www.metacritic.com/game/pc/megabyte-punch", "publisher": "Reptile", "release_date": "May 14 2012", "developers": ["Reptile"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "General", "Platformer", "2D"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/daee9c01efcb1a706cb6b5630c818991-98.jpg", "descriptions": "Megabyte Punch is a fighting/beat 'em up game in which you build your own fighter!As you travel through different environments, you battle other creatures to get their parts. Parts have their own powers and bonuses, like gun arms for a shoot ability or powerful hips for a devastatingMegabyte Punch is a fighting/beat 'em up game in which you build your own fighter!As you travel through different environments, you battle other creatures to get their parts. Parts have their own powers and bonuses, like gun arms for a shoot ability or powerful hips for a devastating pelvic thrust attack. Then, using the abilities of your customized fighter, you can compete in the tournament or battle against other players in a destructible arena.The game takes place in an computer world where you protect the Heartcore of your village against the likes of the Valk Empire and the dreaded Khoteps in 6 different levels with each 3 stages and a boss fight!… Expand"}, {"name": "Biology Battle", "details_link": "https://www.metacritic.com/game/xbox-360/biology-battle", "publisher": "Novaleaf Game Studios", "release_date": "Nov 18 2008", "developers": ["Novaleaf Game Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "General"], "meta_score": 69, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3//images/products/games/3/59cc228-98.jpg", "descriptions": "[Xbox Live Community Game]  Biology Battle is a unique take on the classic space shooter genre."}, {"name": "SingStar Rocks!", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-rocks!", "publisher": "SCEA", "release_date": "Nov 14 2006", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/da945aba11f5c09ff9321f80965c7605-98.jpg", "descriptions": "Rock your world with official tracks from Franz Ferdinand, Kasabian, Bloc Party, Razorlight, and Nirvana as SingStar returns! This is the ultimate line-up - other bands making the SingStar shortlist include Stereophonics, Jet, The Subways, The Rolling Stones, The Bravery, Blur and many more.Rock your world with official tracks from Franz Ferdinand, Kasabian, Bloc Party, Razorlight, and Nirvana as SingStar returns! This is the ultimate line-up - other bands making the SingStar shortlist include Stereophonics, Jet, The Subways, The Rolling Stones, The Bravery, Blur and many more. Complete with the original videos, SingStar Rocks! captures the spirit and energy of the very best gigs - and gives you the chance to experience what it's like to be the headline act. So if you think you have the attitude and the style to front some of the world's most credible live bands, then SingStar Rocks! will have you performing the ultimate gig line-up - wherever you and your PlayStation 2 happen to be. [SCEE]… Expand"}, {"name": "MotoGP", "details_link": "https://www.metacritic.com/game/psp/motogp", "publisher": "Namco Bandai Games", "release_date": "Sep 26 2006", "developers": ["Namco Bandai Games"], "platforms": "PSP", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/2b58aa3dddbaef3bd7499c1133ed7210-98.jpg", "descriptions": "Racing fans can take the excitement of Moto Grand Prix racing with them wherever they go as the game boasts thrilling new features including the new 2005 roster, unlockable rewards, and a wireless multiplayer mode that allows up to eight players to race against each other. The game boastsRacing fans can take the excitement of Moto Grand Prix racing with them wherever they go as the game boasts thrilling new features including the new 2005 roster, unlockable rewards, and a wireless multiplayer mode that allows up to eight players to race against each other. The game boasts the new 2005 MotoGP roster which includes famous Riders such as Valentino Rossi, Marco Melandri, Nick Hayden, Troy Bayliss, Carlos Checa, Alex Barros and Shinya Nakano. Players face new challenges in this portable installment in order to unlock cool rewards such as one-on-one mode, hidden riders, Moto GP movies, and more. Players go head-to-head in time trial, arcade, one-on-one, and wireless multiplayer mode where up to eight players can race against one another at the same time. [Namco Bandai]… Expand"}, {"name": "Serious Sam: Next Encounter", "details_link": "https://www.metacritic.com/game/gamecube/serious-sam-next-encounter", "publisher": "Global Star Software", "release_date": "Apr 12 2004", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/256e7ce49522c7e91fd4f4ad2c89445e-98.jpg", "descriptions": "An abandoned mothership of Sirian origin is sending strange signals from the past, and there's only one man with the guns big enough to investigate: Sam \"Serious\" Stone. If Mental's forces beat Sam to this powerful time-traveling artifact, it's last call for humanity! \r\rThis is serious."}, {"name": "Wrath Unleashed", "details_link": "https://www.metacritic.com/game/xbox/wrath-unleashed", "publisher": "LucasArts", "release_date": "Feb 10 2004", "developers": ["Double Helix Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/1d4e275fabd5cc8700769ec4f0d9e725-98.jpg", "descriptions": "Join an epic contest between darkness and light. Wrath Unleashed puts you in a fantastic, deadly world of mythological creatures and giant floating arenas.  Take part in intense fighting action, thought-provoking strategy and vicious head-to-head mayhem.  Wrath Unleashed features nineJoin an epic contest between darkness and light. Wrath Unleashed puts you in a fantastic, deadly world of mythological creatures and giant floating arenas.  Take part in intense fighting action, thought-provoking strategy and vicious head-to-head mayhem.  Wrath Unleashed features nine different terrain types, 15 multiplayer maps and over a dozen single player maps.  This unique action-strategy game pits up to four players and an array of all-powerful fantasy creatures against each other.  And you'll need to unleash every bit of your wrath upon the world to win.… Expand"}, {"name": "Jurassic Park: Operation Genesis", "details_link": "https://www.metacritic.com/game/xbox/jurassic-park-operation-genesis", "publisher": "VU Games", "release_date": "Mar 26 2003", "developers": ["Blue Tongue Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Strategy", "Tycoon"], "meta_score": 69, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/b00d17a6233adc0096d7b9b4a88d7af6-98.jpg", "descriptions": "Now is your chance to fulfill Dr. John Hammond's dream by successfully designing and managing the ultimate dinosaur theme park.  Jurassic Park: Operation Genesis allows gamers to create the most amazing theme park the world has ever seen.  With its 3D action and sim elements, OperationNow is your chance to fulfill Dr. John Hammond's dream by successfully designing and managing the ultimate dinosaur theme park.  Jurassic Park: Operation Genesis allows gamers to create the most amazing theme park the world has ever seen.  With its 3D action and sim elements, Operation Genesis gives players two games in one.  Either build your own dinosaur theme park or engage in 12 action-packed missions that will truly test your gaming skills.  Welcome to Jurassic Park, the way you want it.  … Expand"}, {"name": "Downforce", "details_link": "https://www.metacritic.com/game/playstation-2/downforce", "publisher": "Titus Software", "release_date": "Jun 14 2002", "developers": ["SmartDog"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/7aeb725d07094e8e748664ed4b447da6-98.jpg", "descriptions": "A new extreme anything goes racing league of racecars thrust to extreme speeds by super-exotic technologies such as Heavy Element Drive Engines, Directional Thrusters, Vectored Jet Engines, and Electro Magnetic Brakes. [Titus]"}, {"name": "Diner Dash", "details_link": "https://www.metacritic.com/game/xbox-360/diner-dash", "publisher": "Big Fish Games", "release_date": "Nov 18 2009", "developers": ["GameLab"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/fa4e51cf34daa3f2a91d6713acaa7489-98.jpg", "descriptions": "[Xbox Live Arcade]  Diner Dash, the number one PC time-management game has landed onto Xbox LIVE! Guide Flo, a former office-worker turned restaurateur, as she builds up her diner empire. Go online and face players in head to head matches to see who's the best Flo. Join up with a friend or[Xbox Live Arcade]  Diner Dash, the number one PC time-management game has landed onto Xbox LIVE! Guide Flo, a former office-worker turned restaurateur, as she builds up her diner empire. Go online and face players in head to head matches to see who's the best Flo. Join up with a friend or another player online for a Team Dash game where your team takes on six other players to see whose diner is the best in town. Fresh look: Fresh looks are the special of the day, as Flo, her customers, and her restaurants come to life in three dimensions and in high definition graphics. Fast action: Take on all the different diners with 10 levels in each. Seat patrons, take their order, deliver their food, take their payment, and bus their table as efficiently as possible within the time limit allowed. Your customers will lose patience and leave if they aren't satisfied. Remember, service with a smile! Pick up and play: Two all-new control schemes are designed specifically for your controller, a point and click style with hotkeys, and an arcade style where you directly control Flo as she runs around. Multiplayer: Hop online for some brand-new eight-person multiplayer in Team Dash Mode, and 1-on-1 in Head to Head Mode. [Hudson Entertainment]… Expand"}, {"name": "Major League Baseball 2K11", "details_link": "https://www.metacritic.com/game/xbox-360/major-league-baseball-2k11", "publisher": "2K Sports", "release_date": "Mar  8 2011", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 64 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/49986518657376ccd1463c2793c6dfdf-98.jpg", "descriptions": "Major League Baseball 2K11 is the next iteration in the 2K baseball series."}, {"name": "Pokemon Mystery Dungeon: Rescue Team DX", "details_link": "https://www.metacritic.com/game/switch/pokemon-mystery-dungeon-rescue-team-dx", "publisher": "Nintendo", "release_date": "Mar  6 2020", "developers": ["Spike Chunsoft"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/509c469dc8e605dedda38e88da310b07-98.jpg", "descriptions": "You can meet and recruit Pokémon in a dungeon-crawling adventure within their world! Build a rescue team to take on mysterious, changing dungeons and strategically plan your moves as you venture forth to make the Pokémon world a safer place…and uncover your true purpose along the way.\r AsYou can meet and recruit Pokémon in a dungeon-crawling adventure within their world! Build a rescue team to take on mysterious, changing dungeons and strategically plan your moves as you venture forth to make the Pokémon world a safer place…and uncover your true purpose along the way.\r As you recruit Pokémon, these trusty teammates will need somewhere to stay, so build camps to house, manage, and strengthen your Pokémon friends. Think hard about who is right for the job and how to approach each mysterious dungeon as you prepare a rescue team. You’ll move a single square at a time or use Auto mode to speed up movement until you engage other Pokémon in turn-based battles—but don’t forget about Pokémon strengths and weaknesses! This version adds gorgeous watercolor-inspired graphics, and more! Get comfortable in being a Pokémon, there’s a lot of work to do.… Expand"}, {"name": "Domination (2005)", "details_link": "https://www.metacritic.com/game/pc/domination-2005", "publisher": "DreamCatcher Interactive", "release_date": "Mar  3 2005", "developers": ["Wargaming.net"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 69, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/5/310f7471f5a8581ab8b8b7881d6575e3-98.jpg", "descriptions": "Domination features a renewed global conflict between the Free Nations Union and the Phantom League on distant planets, including sci-fi land, sea and air warfare at a grand-strategy level. From the award winning developers of \"Massive Assault,\" Domination deepens the \"Massive Assault\"Domination features a renewed global conflict between the Free Nations Union and the Phantom League on distant planets, including sci-fi land, sea and air warfare at a grand-strategy level. From the award winning developers of \"Massive Assault,\" Domination deepens the \"Massive Assault\" player experience through increased gameplay options and all new strategic challenges. [DreamCatcher Interactive]… Expand"}, {"name": "Dynasty Warriors 5", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-5", "publisher": "Koei", "release_date": "Mar 29 2005", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/30cc4748a5a226410b55e39cf032f754-98.jpg", "descriptions": "The fifth full installment of the Dynasty Warriors series of action games will again be based on Luo Guanzhong's historic novel, \"Romance of the Three Kingdoms\" taking players back in time and onto the battlefields of Ancient China. In the game, players experience the thrill of fightingThe fifth full installment of the Dynasty Warriors series of action games will again be based on Luo Guanzhong's historic novel, \"Romance of the Three Kingdoms\" taking players back in time and onto the battlefields of Ancient China. In the game, players experience the thrill of fighting single-handedly against nearly endless legions of enemy soldiers in historic battles that shaped an empire. More details to follow. [KOEI]… Expand"}, {"name": "Invizimals: The Alliance", "details_link": "https://www.metacritic.com/game/playstation-vita/invizimals-the-alliance", "publisher": "SCEA", "release_date": "Sep 30 2014", "developers": ["Novarama"], "platforms": "PlayStation Vita", "num_players": "Up to 4 ", "genres": ["Card Battle", "Strategy", "Miscellaneous", "Turn-Based", "Card Battle"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/e4c90dd055d89f1b1c042f90c619708f-98.jpg", "descriptions": "Prepare yourself for fun on the run as the hunt for Invizimals becomes ubiquitous. Little and mysterious, these creatures live all around us but only your PS Vita can see them. Follow Invizimals through your garden, on the bus or in the playground, capturing your favourites to build aPrepare yourself for fun on the run as the hunt for Invizimals becomes ubiquitous. Little and mysterious, these creatures live all around us but only your PS Vita can see them. Follow Invizimals through your garden, on the bus or in the playground, capturing your favourites to build a collection of 140 classic and new creatures. Link up with players of Invizimals: The Lost Kingdom on PS3 via the Cross-Play feature, stage frenzied four-player battles and trade even more Invizimals. [Playstation Europe]… Expand"}, {"name": "Safecracker: The Ultimate Puzzle Adventure", "details_link": "https://www.metacritic.com/game/pc/safecracker-the-ultimate-puzzle-adventure", "publisher": "The Adventure Company", "release_date": "Aug  2 2006", "developers": ["Kheops Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Puzzle", "Puzzle", "General", "Puzzle", "Point-and-Click", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/7e7e461a7b4052ff02a92d5bccea0720-98.jpg", "descriptions": "You are hired by the wealthy family of a recently deceased billionaire to search for the last will and testament of their late relative, Duncan Walter Adams, who was “eccentric” to say the least.  He has hidden the deed to his riches in one of the safes scattered in his magnificent mansion.You are hired by the wealthy family of a recently deceased billionaire to search for the last will and testament of their late relative, Duncan Walter Adams, who was “eccentric” to say the least.  He has hidden the deed to his riches in one of the safes scattered in his magnificent mansion.  The deceased billionaire also happened to be an avid safe collector and you have been hired to crack all 35 of them!  The stakes are high and the clues are scarce.  You will need your experience, wits, deductive reasoning and puzzle solving skills to earn your pay check. [Adventure Company]… Expand"}, {"name": "Armies of Exigo", "details_link": "https://www.metacritic.com/game/pc/armies-of-exigo", "publisher": "EA Games", "release_date": "Nov 30 2004", "developers": ["Black Hole Games"], "platforms": "PC", "num_players": "12  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/1cb30e658ef16c3cd08035f0f275eb37-98.jpg", "descriptions": "Worlds collide in Armies of Exigo, a fantasy RTS where the boundaries of the battlefield are broken and war is waged both above and below the ground. This game takes strategy to new depths as elves, beasts, knights, and creatures of the darkness are locked in an epic battle for survival. InWorlds collide in Armies of Exigo, a fantasy RTS where the boundaries of the battlefield are broken and war is waged both above and below the ground. This game takes strategy to new depths as elves, beasts, knights, and creatures of the darkness are locked in an epic battle for survival. In the world of Exigo, where peace and prosperity have reigned for years, the empires of man and beast faces their greatest threat yet. A sinister force known as The Fallen has awaken to strike where the inhabitants of this world least expect - from underground. Users will take control of massive armies, wage wars in the forests and river valleys of the surface, then descend into the caverns and catacombs of the underworld to face off against the dark evil. [Electronic Arts]… Expand"}, {"name": "Serial Cleaners", "details_link": "https://www.metacritic.com/game/xbox-series-x/serial-cleaners", "publisher": "505 Games", "release_date": "Sep 22 2022", "developers": ["Draw Distance"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/d1e0f8ca1892a55a74581264885db69d-98.jpg", "descriptions": "New York City, New Year's Eve 1999. An unlikely team of four professional cleaners for the mob gathers to drink and reminisce about their careers at the turn of the millenium. As the details of their stories stop matching up, the ugly truth behind their cooperation begins to reveal itself.New York City, New Year's Eve 1999. An unlikely team of four professional cleaners for the mob gathers to drink and reminisce about their careers at the turn of the millenium. As the details of their stories stop matching up, the ugly truth behind their cooperation begins to reveal itself. What starts as a celebration of a decade of shared history slowly turns into a tense and dangerous standoff.An homage to 90s cinema - from Tarantino's classics through cult crime thrillers to B-movie action favorites and more - Serial Cleaners remixes those familiar places, characters and scenes into its own unique spin on a decade full of brightly colored optimism... and the grime underneath it all. Choose your path through the non-linear story by picking the part of the narrative you want to hear next, and then approach each mission as carefully or brazenly as you like. Utilize stealth, exploration and speed as the situation and your preferred experience warrants it. Get rid of the bodies and other damning evidence to wipe the decade's slate clean before the new millenium comes!… Expand"}, {"name": "Lawn Mowing Simulator", "details_link": "https://www.metacritic.com/game/pc/lawn-mowing-simulator", "publisher": "Curve Digital", "release_date": "Aug 10 2021", "developers": ["Skyhook Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life", "Career"], "meta_score": 69, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/ec53443e1aeb6d3bff5ea8f2e30768b2-98.jpg", "descriptions": "Experience the beauty and detail of mowing the Great British countryside in Lawn Mowing Simulator, the only simulator that allows you to ride an authentic and expansive roster of real-world licensed lawn mowers from prestigious manufacturers; Toro, SCAG and STIGA as you manage your mowing business."}, {"name": "Monster Energy Supercross - The Official Videogame 4", "details_link": "https://www.metacritic.com/game/pc/monster-energy-supercross---the-official-videogame-4", "publisher": "Koch Media", "release_date": "Mar 11 2021", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/0167cc872d79e5cec86063c5a8ae021a-98.jpg", "descriptions": "Cross is Super Again. The official videogame of the Monster Energy AMA Supercross Championship is back with its fourth edition, the most extreme ever.\r A SUPER CAREER\r\nMake your way along the path that will lead you to success. A new career mode will put your abilities to the test in orderCross is Super Again. The official videogame of the Monster Energy AMA Supercross Championship is back with its fourth edition, the most extreme ever.\r A SUPER CAREER\rMake your way along the path that will lead you to success. A new career mode will put your abilities to the test in order to bring out the champion inside you!\rLearn new riding abilities in the ''Future'' category; refine them and obtain new sponsors in the ''Rookie'' category. Become a real ''Pro'' by taking your riding style to the limit and challenging the toughest adversaries in the 450SX class.\r CREATOR OF YOUR OWN FUN\rUnbridle your imagination with the new editor. Build unique tracks with the modules inspired by the official tracks and share your creations with the community.\r THE NEW COMPOUND\rExplore, seek out new adventures, train, and challenge your friends in the new compound. Hurtle through fantastic island scenarios. Satisfy your desire for thrills!\r SUPER RIDERS, SUPER TRACKS\rChoose your favorite rider from an army of over 100 riders as you range over the 450SX and 250SX categories. Race in the 11 stadiums and on the 17 tracks of the season.\r FULL CUSTOMIZATION… Expand"}, {"name": "Manticore: Galaxy on Fire", "details_link": "https://www.metacritic.com/game/switch/manticore-galaxy-on-fire", "publisher": "Koch Media", "release_date": "Apr 19 2018", "developers": ["Deep Silver"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Space", "Combat"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/f775fc81bdf7286cfa175a6ff9fda246-98.jpg", "descriptions": "Write your legacy in gunfire and smoke as you take down the galaxy's most wanted criminals in action-packed dogfights! Rise to become the hero of the Neox Sector – a deadly fringe world terrorized by ruthless crime lords and their no-good underlings. [Nintendo]"}, {"name": "Eiyuu Senki: The World Conquest", "details_link": "https://www.metacritic.com/game/playstation-3/eiyuu-senki-the-world-conquest", "publisher": "Fruitbat Factory", "release_date": "Nov 24 2015", "developers": ["5pb", "Tenco"], "platforms": ["PC", "PlayStation 3"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/22be42727afad55fa454fa822303ad61-98.jpg", "descriptions": "In Eiyuu Senki - The World Conquest, the player finds themselves in an alternate world populated with famous characters of history and legend - who also all happen to be beautiful maidens - and must fight their way to world domination."}, {"name": "Hitman HD Trilogy", "details_link": "https://www.metacritic.com/game/xbox-360/hitman-hd-trilogy", "publisher": "Square Enix", "release_date": "Jan 29 2013", "developers": ["Io Interactive"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Miscellaneous", "Compilation", "Compilation"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/21955212a9510da8229228ae5de08fa0-98.jpg", "descriptions": "Experience more than 40 missions across 3 classic Hitman games, each re-mastered in HD. Whether you're a longtime fan or new to the franchise, this is your opportunity to take on the contracts that defined the series and fully established Agent 47 as the notorious  assassin."}, {"name": "Call of Duty: Black Ops II - Vengeance", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops-ii---vengeance", "publisher": "Activision", "release_date": "Jul  2 2013", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Arcade"], "meta_score": 69, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/3/1faef224816aabe517f56e46843cfaf2-98.jpg", "descriptions": "Vengeance includes four new Multiplayer maps (Cove, Detour, Rush, Uplink), the new Zombies adventure \"Buried,\" and a new bonus Zombies weapon, the Ray Gun Mark II."}, {"name": "Screencheat", "details_link": "https://www.metacritic.com/game/playstation-4/screencheat", "publisher": "Surprise Attack", "release_date": "Mar  1 2016", "developers": ["Samurai Punk"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/9a4f96457b8eaa581f21eed300ca5557-98.jpg", "descriptions": "Screencheat is the ridiculous split-screen shooter where everyone is invisible so you have to screencheat (Screencheat - verb: to look at your opponents screens. Stop screencheating you cheater!). Master a wide variety of one-hit kill weapons including a blunderbuss, a car engine that shootsScreencheat is the ridiculous split-screen shooter where everyone is invisible so you have to screencheat (Screencheat - verb: to look at your opponents screens. Stop screencheating you cheater!). Master a wide variety of one-hit kill weapons including a blunderbuss, a car engine that shoots bouncing plasma balls and a teddy bear loaded with explosives. Train your skills in the solo time trials then engage in fast and frantic combat with up to eight players locally on the couch or online. With colourful maps, unique modes and a huge number of customisation options including wacky mutators, Screencheat is the ultimate party FPS.… Expand"}, {"name": "Giana Sisters: Twisted Dreams", "details_link": "https://www.metacritic.com/game/xbox-360/giana-sisters-twisted-dreams", "publisher": "bitComposer Games", "release_date": "Mar 20 2013", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/4fa210386e4521bfe1dd55bdec965aec-98.jpg", "descriptions": "Giana Sisters: Twisted Dreams is a challenging fast-paced platformer with a twist. Players can warp Giana's dream into a nightmarish world of wonder, changing her abilities and interactions. Players must use their skills, speed, brains, and powers to defeat the dangers that populate herGiana Sisters: Twisted Dreams is a challenging fast-paced platformer with a twist. Players can warp Giana's dream into a nightmarish world of wonder, changing her abilities and interactions. Players must use their skills, speed, brains, and powers to defeat the dangers that populate her twisted dreams!… Expand"}, {"name": "Syndicate (2012)", "details_link": "https://www.metacritic.com/game/pc/syndicate-2012", "publisher": "Electronic Arts", "release_date": "Feb 21 2012", "developers": ["Starbreeze"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "General", "General", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/7cebabbbf4c69928a6d575eee0e518a5-98.jpg", "descriptions": "2069 - No longer governed by politicians, the world is divided into regions controlled by mega-corporations known as Syndicates. These Syndicates have revolutionized the way consumers interact with the digital world. Consumers no longer require a device to access the world's data and control2069 - No longer governed by politicians, the world is divided into regions controlled by mega-corporations known as Syndicates. These Syndicates have revolutionized the way consumers interact with the digital world. Consumers no longer require a device to access the world's data and control their technology - they can achieve this with the blink of an eye after a neural chip implant. Civilians clamored to be \"chip'd\" and to enjoy all that their selected syndicate has to offer. Housing, medical, banking, insurance, education, entertainment, and employment.  One complete package - one complete lifestyle. In return, the syndicates gained unprecedented insights, and control, over individuals and their behavior. With insufficient government oversight, business has become war. The Syndicates stop at nothing for ultimate market dominance. On the front lines of this war are the Agents, the syndicates' bio-engineered and chip-augmented enforcers. They can breach anything in the wired dataverse including their enemies, their weapons, and the environment surrounding them, making them the most efficient and deadly technological weapons in the world. Assume the role of Miles Kilo, Eurocorp's latest prototype Agent, and embark on a brutal action adventure of corruption and revenge. [Electronic Arts]… Expand"}, {"name": "Tornado Outbreak", "details_link": "https://www.metacritic.com/game/playstation-3/tornado-outbreak", "publisher": "Konami", "release_date": "Sep 29 2009", "developers": ["Loose Cannon Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/89c77ce4a25d159276194d49dfec7f64-98.jpg", "descriptions": "Harness the power of a raging tornado and battle the forces of evil in an effort to save to world. Sinister forces have deceived you to believe that your destructive behavior will save an epic hero. In reality, you’re working for evil. Take control of a dynamic tornado as you tear throughHarness the power of a raging tornado and battle the forces of evil in an effort to save to world. Sinister forces have deceived you to believe that your destructive behavior will save an epic hero. In reality, you’re working for evil. Take control of a dynamic tornado as you tear through open environments chewing up the landscape and spitting out everything in your path. The more you destroy, the bigger you grow as you work against time based, collection and point challenges in the search for hidden element and enemies from another world. Watch the debris fly as you leave a trail of destruction, as you battle bosses and defeat the forces of evil. The world is your playground, tear it up. [Konami]… Expand"}, {"name": "Big Bang Pro Wrestling", "details_link": "https://www.metacritic.com/game/switch/big-bang-pro-wrestling", "publisher": "SNK", "release_date": "Mar 30 2022", "developers": ["SNK"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/c73dbe63d342118069706ec61984b0ca-98.jpg", "descriptions": "It's about to pop off! Muscle-bound wrestlers take the stage for a bombastic all-out brawl! Easy controls allow you to pull off sick and devastating special moves from the push of a button!\r -10 fighters to choose from including fledging newbies, masked wrestlers, and hulking heavyweights!It's about to pop off! Muscle-bound wrestlers take the stage for a bombastic all-out brawl! Easy controls allow you to pull off sick and devastating special moves from the push of a button!\r -10 fighters to choose from including fledging newbies, masked wrestlers, and hulking heavyweights! The ring is calling you!\r -Each wrestler comes with their own personalized Finishing Move. Fulfill the proper conditions and let it rip to win the fight!\r -Change up the rules with exciting modes like Coffin Death Match where your goal is to toss your opponent into a coffin. Or, try to steal away the reward in Reward Death Match to really stick it to your opponent!\r *The instruction manual featured within the game is from the original NEOGEO Pocket Color version. Therefore, the control explanations may differ from those on Nintendo Switch.\r*Local \"VS MATCH\" is possible, but online functions are disabled.… Expand"}, {"name": "Dead Synchronicity: Tomorrow Comes Today", "details_link": "https://www.metacritic.com/game/playstation-4/dead-synchronicity-tomorrow-comes-today", "publisher": "Daedalic Entertainment", "release_date": "Oct  4 2016", "developers": ["Fictiorama Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/0de1d3fa7125632bc5e57c803b943cbd-98.jpg", "descriptions": "The story of Michael, a man who must recover his identity and decode the two events that brought the world to the edge of collapse. The first one is the so-called “Great Wave,” an inexplicable chain of natural disasters. The second is a pandemic that turned humans into “the Dissolved,”The story of Michael, a man who must recover his identity and decode the two events that brought the world to the edge of collapse. The first one is the so-called “Great Wave,” an inexplicable chain of natural disasters. The second is a pandemic that turned humans into “the Dissolved,” infected beings that eventually dissolve into blood.… Expand"}, {"name": "The Amazing Spider-Man", "details_link": "https://www.metacritic.com/game/xbox-360/the-amazing-spider-man", "publisher": "Activision", "release_date": "Jun 26 2012", "developers": ["Beenox"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Action Adventure", "General", "Open-World"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/f7eada3518570554f2121c50e59b0ab8-98.jpg", "descriptions": "Take control of Spider-Man’s powers with Manhattan as your playground. Set briefly after the events of the new film, The Amazing Spider-Man injects New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge of significant threats.Take control of Spider-Man’s powers with Manhattan as your playground. Set briefly after the events of the new film, The Amazing Spider-Man injects New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge of significant threats. Players use real-time navigational and combat choices to fight crime and execute Spidey’s signature acrobatic moves in ways never seen previously. Discover the rest of Peter Parker’s untold story in the all-new epilogue story to Columbia Pictures' 2012 theatrical release. Battle all-new versions of classic Super Villains as well as original, larger than life enemies while racing to save Manhattan.… Expand"}, {"name": "Maid of Sker", "details_link": "https://www.metacritic.com/game/pc/maid-of-sker", "publisher": "Wales Interactive", "release_date": "Jul 28 2020", "developers": ["Wales Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/ba8d931f4e2aa1b2c01684b9849add11-98.jpg", "descriptions": "Maid of Sker is a first-person survival horror, set in a remote hotel with a gory and macabre history from British folklore. Brave the nightmares of the Quiet Ones. Do not panic…don’t even breathe!"}, {"name": "Cossacks II: Battle for Europe", "details_link": "https://www.metacritic.com/game/pc/cossacks-ii-battle-for-europe", "publisher": "cdv Software", "release_date": "Jun 28 2006", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/58d7f072f1e0b51fee9a02d30480d113-98.jpg", "descriptions": "The Cossacks II: Battle for Europe add-on continues the renowned Cossacks II: Napoleonic Wars game. It depicts the rather short historic period of the Napoleonic wars. The Napoleon wars changed Europe for good, leading to the formation of empires and putting an end to almost a thousand yearsThe Cossacks II: Battle for Europe add-on continues the renowned Cossacks II: Napoleonic Wars game. It depicts the rather short historic period of the Napoleonic wars. The Napoleon wars changed Europe for good, leading to the formation of empires and putting an end to almost a thousand years of constant strife between small states that had shattered Europe. The game provides mass-scale battles between thousands-strong armies of the nations involved in conflicts during this period. The theatres of operation introduce France, Britain, Austria, Russia, Prussia, Egypt and three nations not represented in the original game – Spain, the Grand Duchy of Warsaw (Poland) and the Confederation of the Rhine. The developers did their best to reconstruct the largest battles and historical events of the Napoleonic wars. The game reconstructs in detail the soldiers' uniforms, weapons and architecture of each nation. Each nation's army has its unique units and possibilities. The game includes over 180 units, 190 buildings, and 1200 flora and fauna elements. When developing the combat system, the peculiarities of early 19th century warring were taken into account, as was the value of formations, provisions and troop morale. Tactical tricks utilized by military commanders of the time are fully reflected in the game. An \"honest\" system of bullet and cannonball ballistics, based on physics, is an innovative addition to the Cossacks engine. [CDV Software]… Expand"}, {"name": "Trailblazers", "details_link": "https://www.metacritic.com/game/pc/trailblazers", "publisher": "Rising Star Games", "release_date": "May  8 2018", "developers": ["Supergonk Ltd.", "Supergonk"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/21b8f6ef19aa3c542db72f863446a6ef-98.jpg", "descriptions": "Paint the track with dynamic racing lines, boost on your team's colour and blaze your way to victory!"}, {"name": "It's Quiz Time", "details_link": "https://www.metacritic.com/game/playstation-4/its-quiz-time", "publisher": "Vision Games Publishing LTD", "release_date": "Nov 28 2017", "developers": ["Vision Games Publishing LTD"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/2d6ed04145ac730ec96949b7c4086b25-98.jpg", "descriptions": "Go head to head with the brand-new quiz game on PS4. Featuring our witty and devious AI game host Salli, take on It’s Quiz Time’s catalogue of over 25,000 questions. Face off against up to 8 players using your smartphone, or grab your controller and put yourself to the test."}, {"name": "Liberation Maiden", "details_link": "https://www.metacritic.com/game/3ds/liberation-maiden", "publisher": "Level 5", "release_date": "Oct 25 2012", "developers": ["Grasshopper Manufacture"], "platforms": ["iPhone/iPad", "3DS"], "num_players": "1 Player", "genres": ["General", "Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/ac62b7249371bafce9e909cacc691c09-98.jpg", "descriptions": "LIBERATION MAIDEN is a full-scale 3D sci-fi shooter created by critically acclaimed developer Goichi Suda, better known as SUDA51, from Grasshopper Manufacture, creators of fan-favorites Lollipop Chainsaw, No More Heroes, Shadows of the Damned and many more.  Set 100 years in the future inLIBERATION MAIDEN is a full-scale 3D sci-fi shooter created by critically acclaimed developer Goichi Suda, better known as SUDA51, from Grasshopper Manufacture, creators of fan-favorites Lollipop Chainsaw, No More Heroes, Shadows of the Damned and many more.  Set 100 years in the future in  New Japan, LIBERATION MAIDEN puts players in the role of Shoko Ozora, piloting a humanoid robot called Kamui.  The game brings AAA production values to the downloadable market in an unprecedented collaboration of all-star creators in music, art, and design, including breathtaking animation by the acclaimed animation studio, bones.… Expand"}, {"name": "Sonic & Knuckles", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-knuckles", "publisher": "Sega", "release_date": "Sep  9 2009", "developers": ["Sonic Team"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/a1f8cf8d4bd81467f1ceff9c5f966598-98.jpg", "descriptions": "[Xbox Live Arcade]  The blue hedgehog and the red echidna were sworn adversaries in Sonic 3, but in the platform adventure Sonic & Knuckles, Knuckles realizes that he's been just a pawn in the schemes of Dr. Eggman (aka Dr. Robotnik). Knuckles, the former adversary, now supports Sonic to[Xbox Live Arcade]  The blue hedgehog and the red echidna were sworn adversaries in Sonic 3, but in the platform adventure Sonic & Knuckles, Knuckles realizes that he's been just a pawn in the schemes of Dr. Eggman (aka Dr. Robotnik). Knuckles, the former adversary, now supports Sonic to chase the common enemy, and each must use their strengths to acquire the priceless Master Emerald and save Angel Island. Sonic or Knuckles: Play as Sonic and let loose on Dr. Eggman wth amazing new powers, or play as Knuckles and tackle Dr. Eggman with bare-fisted attacks, high speed glides, and wall-climbing abilities. New adventures: Eight new zones and two different adventures await. Combine games: For the first time since the SEGA Genesis, combine with Sonic 3 to play as Sonic, Knuckles, even Tails, and unlock new secrets! Combine it with Sonic 2 and play with Knuckles and all his signature moves. [Sega]… Expand"}, {"name": "Sea of Solitude", "details_link": "https://www.metacritic.com/game/playstation-4/sea-of-solitude", "publisher": "Electronic Arts", "release_date": "Jul  5 2019", "developers": ["Jo-Mei Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Linear", "Third-Person"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/a07a6252c01811b4c703ddf8551b17f3-98.jpg", "descriptions": "When humans get too lonely, they turn into monsters \r\rSea of Solitude takes you on a personal journey of a young woman's loneliness. Set sail across a beautiful and evolving world, where nothing is quite what it seems. Meet fantastical creatures and monsters, learn their stories, and solveWhen humans get too lonely, they turn into monsters \r\rSea of Solitude takes you on a personal journey of a young woman's loneliness. Set sail across a beautiful and evolving world, where nothing is quite what it seems. Meet fantastical creatures and monsters, learn their stories, and solve challenges. Explore a flooded city, either by boat, on foot, or by swimming through the water itself. Dare to look what lies beneath the surface, in a haunting struggle of darkness and light, and discover what it truly means to be human. \r\rKEY FEATURES \r\r- AN EMOTIONAL JOURNEY Sea of Solitude embarks players on a nuanced and intimate action-adventure, experienced through the mind of Kay, as she struggles to overcome her inner loneliness. Players must help Kay see below the surface and beyond, guiding her through her Sea of Solitude, in this deeply touching tale of darkness and light. \r\r- A METAPHORICAL WORLD As her journey evolves, Kay's dark and stormy environment begins to transform, with light and color shining into the world. Water levels rise and fall to reflect her own state of mind, transforming the flooded city landscape into new areas for the player to explore, with new challenges to face. \r\r- FACE THE MONSTERS WITHIN Encounter fantastical creatures, solve puzzles, and rid the world of tainted memories. Meet a variety of beautiful and terrifying monsters, each with their own struggles of loneliness to tell. Through confronting these monsters, Kay will not only learn more about them, but also herself, and what it means to be human.… Expand"}, {"name": "Earthworm Jim", "details_link": "https://www.metacritic.com/game/ds/earthworm-jim", "publisher": "Gameloft", "release_date": "May 10 2010", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "PC", "DS"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/2e37d53371860254f1323c0d4ad3b640-98.jpg", "descriptions": "[DSiWare]  The classic action platformer returns on the Nintendo DSi with a never-before-seen feature."}, {"name": "Shelter", "details_link": "https://www.metacritic.com/game/pc/shelter", "publisher": "Might and Delight", "release_date": "Aug 28 2013", "developers": ["Might and Delight"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/19807fe4f920ac22e6bf45efd83ddb00-98.jpg", "descriptions": "As the mother of a litter of cubs you are forced out from familiar and safe surroundings to find new shelter in a beautiful, but dangerous world. The harsh reality of nature plays a pivotal role in the game whilst at the same time Shelter aims to pay a homage to the great outdoors and allAs the mother of a litter of cubs you are forced out from familiar and safe surroundings to find new shelter in a beautiful, but dangerous world. The harsh reality of nature plays a pivotal role in the game whilst at the same time Shelter aims to pay a homage to the great outdoors and all its imposing beauty.… Expand"}, {"name": "Boom Boom Rocket", "details_link": "https://www.metacritic.com/game/xbox-360/boom-boom-rocket", "publisher": "Electronic Arts", "release_date": "Apr 11 2007", "developers": ["Bizarre Creations"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/ff022dc60c5cc341aaac0ef0ddcdef1f-98.jpg", "descriptions": "[Xbox Live Arcade]  In Boom Boom Rocket, players trigger rockets to the beat of the music while traveling through a 3D cityscape. The better the player times the explosions, the more spectacular the fireworks effects. The fireworks are choreographed to 10 original tracks created by Ian[Xbox Live Arcade]  In Boom Boom Rocket, players trigger rockets to the beat of the music while traveling through a 3D cityscape. The better the player times the explosions, the more spectacular the fireworks effects. The fireworks are choreographed to 10 original tracks created by Ian Livingstone. Players can play in single player mode or go head-to-head against a friend on the same console. The game features three modes of gameplay: Normal, Speed and multiplayer head-to-head. Each song is choreographed into three skill levels to ensure that everyone can join in the fun. Successfully chain fireworks to fill the bonus meter and activate the psychedelic bonus mode for extra points. Players can unlock new firework designs by mastering each music track. You can also utilize the connected online element and see how their scores compare with other players on the Boom Boom Rocket leaderboard. [Electronic Arts]… Expand"}, {"name": "Metal Slug 4 & 5", "details_link": "https://www.metacritic.com/game/xbox/metal-slug-4-5", "publisher": "SNK Playmore", "release_date": "Aug 21 2005", "developers": ["BrezzaSoft"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/007eb2280640348d3ebb192beb9d8344-98.jpg", "descriptions": "Now you can play two of your arcade favorites without any quarters, since Metal Slug 4 and 5 have come to the PlayStation 2 in one complete package. Join Marco and a cast of other Metal Slug characters as they battle corrupt forces in the air, on the sea, and on land. Use power-ups, specialNow you can play two of your arcade favorites without any quarters, since Metal Slug 4 and 5 have come to the PlayStation 2 in one complete package. Join Marco and a cast of other Metal Slug characters as they battle corrupt forces in the air, on the sea, and on land. Use power-ups, special weapons, health, and ammo to try to keep up with each game's nonstop action and challenging enemies. Of course, you can also test-drive the next generation of Metal Slug vehicles.… Expand"}, {"name": "My Memory of Us", "details_link": "https://www.metacritic.com/game/pc/my-memory-of-us", "publisher": "IMGN.PRO", "release_date": "Oct  9 2018", "developers": ["Juggler Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/5bff057a6a76c533dd52e40c2b1ed9fb-98.jpg", "descriptions": "My Memory of Us is a reminiscence of a friendship between a boy and a girl. A friendship made during tough times. Times of terror, pain, and exclusion in a world where people were forced to live in two artificially detached worlds."}, {"name": "Marvel vs. Capcom: Infinite", "details_link": "https://www.metacritic.com/game/pc/marvel-vs-capcom-infinite", "publisher": "Capcom", "release_date": "Sep 19 2017", "developers": ["Capcom"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/360dcb7079566f5d3b736419ccced6f3-98.jpg", "descriptions": "The epic clash between two storied universes returns with Marvel vs. Capcom: Infinite, the next era of the action-fighting game series. Marvel and Capcom universes collide like never before as iconic characters team up for action-packed player-versus-player combat."}, {"name": "Death to Spies", "details_link": "https://www.metacritic.com/game/pc/death-to-spies", "publisher": "Atari", "release_date": "Oct 16 2007", "developers": ["Haggard Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/8287aa4bb4460c73bcfebd72d3dff34a-98.jpg", "descriptions": "Smersh is the Russian for \"Death to Spies\" and was the name of a set of counterintelligence departments in the Soviet Army formed during World War II. Their mission was to secure the rear of the active Red Army by arresting traitors, deserters, spies and criminal elements. During the warSmersh is the Russian for \"Death to Spies\" and was the name of a set of counterintelligence departments in the Soviet Army formed during World War II. Their mission was to secure the rear of the active Red Army by arresting traitors, deserters, spies and criminal elements. During the war these agents became the main force combating the German intelligence service. The game's main character is a captain in the 4th department of the Soviet counterintelligence service. He is a professional spy trained to execute dangerous operations on his own. During missions he has to complete various tasks in the heart of enemy territory including stealing important documents, eliminating different enemy officers or high-ranking officials, kidnapping and sabotage. Game missions are based on real historical events and operations which were executed by the military intelligence and counterintelligence during the war. [1C Company]… Expand"}, {"name": "Vader Immortal: A Star Wars VR Series", "details_link": "https://www.metacritic.com/game/playstation-4/vader-immortal-a-star-wars-vr-series", "publisher": "Disney Interactive Studios", "release_date": "Aug 25 2020", "developers": ["ILMxLab"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/ce9226abdb1e7710256bd66d3466c415-98.jpg", "descriptions": "Step into a galaxy far, far away and experience the first Star Wars story designed exclusively for virtual reality. Descend into Darth Vader’s mysterious fortress alongside new allies and encounter fearsome enemies, including the Sith Lord himself. Be at the center of a story in which youStep into a galaxy far, far away and experience the first Star Wars story designed exclusively for virtual reality. Descend into Darth Vader’s mysterious fortress alongside new allies and encounter fearsome enemies, including the Sith Lord himself. Be at the center of a story in which you hold the key to the galaxy’s salvation… or destruction. … Expand"}, {"name": "Erica", "details_link": "https://www.metacritic.com/game/playstation-4/erica", "publisher": "Sony Interactive Entertainment", "release_date": "Aug 19 2019", "developers": ["Flavourworks"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/f78c5f5868465403413554b0bfe79264-98.jpg", "descriptions": "Enter a dangerous and shadowy world of murder and cultists in this pioneering interactive thriller, exclusive to PS4, that asks you to reach into the game world and take control of the narrative."}, {"name": "The Legend of Spyro: A New Beginning", "details_link": "https://www.metacritic.com/game/xbox/the-legend-of-spyro-a-new-beginning", "publisher": "Sierra Entertainment", "release_date": "Oct 10 2006", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/94c857c1cd9f67098860a31b6e6db342-98.jpg", "descriptions": "The Legend of Spyro: A New Beginning explores the true origins of Spyro as you embark on a dangerous, combat-driven quest that will bring you face to face with the Dark Master's ultimate creation, Cynder. Experience the true power of the purple dragon as you unleash devastating fury attacks,The Legend of Spyro: A New Beginning explores the true origins of Spyro as you embark on a dangerous, combat-driven quest that will bring you face to face with the Dark Master's ultimate creation, Cynder. Experience the true power of the purple dragon as you unleash devastating fury attacks, upgradeable breaths and ground to aerial melee combos in a frenzied battle with hordes of menacing enemies and bone-chilling bosses. It's an epic and cinematic gameplay experience.… Expand"}, {"name": "The Chant", "details_link": "https://www.metacritic.com/game/playstation-5/the-chant", "publisher": "Deep Silver", "release_date": "Nov  3 2022", "developers": ["Brass Token"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/f0b76c613c53cf4e50fcab5b77cad8b7-98.jpg", "descriptions": "A single-player, third person horror action-adventure game set on a remote island spiritual retreat. A peaceful weekend soon turns to dread after a group chant opens The Gloom, a psychedelic dimension of terror that feeds off negative energy. Interact with a recurring cast of characters,A single-player, third person horror action-adventure game set on a remote island spiritual retreat. A peaceful weekend soon turns to dread after a group chant opens The Gloom, a psychedelic dimension of terror that feeds off negative energy. Interact with a recurring cast of characters, untangle the complex history of the island, and witness terrifying revelations about the cosmos. Only you can fight off the creatures, reason with the survivors, and unravel the legacy of a cult from the 1970s to reverse the ritual.Features:* EXPLORE AN ISLAND FILLED WITH COSMIC DREAD: Interact with the other members of the retreat as they slowly become consumed by their own negative energy.* Survive against an array of prismatic creatures and cultists released from The Gloom as you piece together the weird history of the island.* FIGHT OR FLIGHT: You must choose your fights and battle for survival with spiritual weapons and abilities. Collect, craft, and manage your resources to take your chances in close combat - or succumb to panic and flee.* MIND BODY SPIRIT: Balance is everything. Steel your mind against horror and panic; Protect your body against physical threats; Elevate your spirit to meditate and access supernatural abilities.* MODERN PSYCHEDELIC HORROR: Inspired by the psychedelic horror of the 1970s, experience a landscape of colored lighting and an electronic rock soundtrack, composed by the award-winning Paul Ruskay.… Expand"}, {"name": "Daemon X Machina", "details_link": "https://www.metacritic.com/game/switch/daemon-x-machina", "publisher": "Nintendo", "release_date": "Sep 13 2019", "developers": ["First Studio", "Marvelous First Studio"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/60a52a2ba61a65be660ef7826971923d-98.jpg", "descriptions": "The future of mech-actions games is here. Defend the planet and defeat corrupted A.I. controlled robots using your Arsenal, a fully customizable mechanized battle suit. Choose and equip your Arsenal with a multitude of weapons, obtain more from downed enemy Arsenals, and swap them on the flyThe future of mech-actions games is here. Defend the planet and defeat corrupted A.I. controlled robots using your Arsenal, a fully customizable mechanized battle suit. Choose and equip your Arsenal with a multitude of weapons, obtain more from downed enemy Arsenals, and swap them on the fly to suit your strategy in the face of ever-changing threats that may bring the end of the world. It was the greatest disaster in recorded history The moon tore apart, turning the sky into a kaleidoscope of red light that illuminated all who watched from below. Survive this apocalyptic new age as a mercenary and pilot powerful mechs in this brand-new action game from Kenichiro Tsukuda (Armored Core) and mech designer Shoji Kawamori (Super Dimensional Fortress Macross).\r Features:\r * The player's avatar is customizable with a variety of options\r* Each Arsenal can be equipped with different weapons on its arms and shoulders, as well as reserve weaponry on its back that can be swapped out during battle\r* Defeated enemies drop ammo and weapons, which the player can obtain and use on the fly\r* Online and local wireless multiplayer modes support up to 4 players… Expand"}, {"name": "Mega Man X: Command Mission", "details_link": "https://www.metacritic.com/game/playstation-2/mega-man-x-command-mission", "publisher": "Capcom", "release_date": "Sep 21 2004", "developers": ["Valuewave Co.,Ltd."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 69, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/9b1c7c288a0f691991e29a24fc321ec7-98.jpg", "descriptions": "In Mega Man X Command Mission, Mega Man must infiltrate Giga City Island to thwart the evil plans of the Liberion Army who have initiated a riot on the isle. By choosing from a selection of seven different playable characters, gamers can construct a three-member attack force using Mega Man,In Mega Man X Command Mission, Mega Man must infiltrate Giga City Island to thwart the evil plans of the Liberion Army who have initiated a riot on the isle. By choosing from a selection of seven different playable characters, gamers can construct a three-member attack force using Mega Man, Zero, Axl, or characters new to the Mega Man universe, to help bring peace to the region once and for all. It is up to gamers, to create a dream team of Mega Man?s allies and reploid friends to stop the destructive battle that has begun to wage itself on Giga City Island. Mega Man X Command Mission features exciting action RPG-style combat and a revolutionary \"Cross Order System\" that allows flawless execution of special and finishing attack moves on enemies. Character building will be a crucial aspect of the game. Using super-energy metals called \"Force Metals,\" weapons, abilities and attack moves can be upgraded, vastly improving the overall performance of characters. [Capcom]… Expand"}, {"name": "Cities XL", "details_link": "https://www.metacritic.com/game/pc/cities-xl", "publisher": "Monte Cristo Multimedia", "release_date": "Oct  8 2009", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 69, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/2/0497a4a74923d0e4d434f64bb41f5ad7-98.jpg", "descriptions": "CITIES XL allows gamers to develop cities on realistic 3D maps using an incredible collection of unique structures and monuments based on American, Asian and European-influenced architectural styles. The maps feature a variety of environments: mountains, hills, canyons, beaches and islands,CITIES XL allows gamers to develop cities on realistic 3D maps using an incredible collection of unique structures and monuments based on American, Asian and European-influenced architectural styles. The maps feature a variety of environments: mountains, hills, canyons, beaches and islands, all set in different climates from tropical to desert, Mediterranean to temperate. Players must create the right combinations of social services, leisure activities, special events and other job opportunities within their cities in order to feed, clothe, employ and entertain their citizens. Be it planning and building a new zoo, public park, residential neighborhood or transit system - there's always a fresh and exciting challenge for would-be city managers and mayors in CITIES XL. The game's online features and services allow players to create interconnected cities on virtual and persistent planets. Mayors can share and trade with one another, specialize their economy and team up with befriended cities to create sprawling metropolises. Life on the planet is punctuated by events and competitions - a concert held in one town may, for example, be attended by visitors from other areas who can also enjoy a walk around the city to admire the urban creations of multiple players. By combining a fantastic single-player game with the social and multiplayer aspects of an MMO, CITIES XL shapes the future of the genre by offering more variety, bigger cities and multiple gameplay layers. [Monte Cristo]… Expand"}, {"name": "WWE 2K17", "details_link": "https://www.metacritic.com/game/playstation-4/wwe-2k17", "publisher": "2K Sports", "release_date": "Oct 11 2016", "developers": ["Yuke's"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/d1682e0c916ac1beac1717abb813d992-98.jpg", "descriptions": "Features thousands of new moves and animations, backstage and in-arena brawling, and the biggest roster of WWE and NXT Superstars and Legends to date. Now more than ever, you will feel like you are commanding an actual WWE broadcast! POWERFUL CREATION SUITE. Create and develop your customFeatures thousands of new moves and animations, backstage and in-arena brawling, and the biggest roster of WWE and NXT Superstars and Legends to date. Now more than ever, you will feel like you are commanding an actual WWE broadcast! POWERFUL CREATION SUITE. Create and develop your custom WWE with the deepest Creation Suite to date, featuring new creation options such as Create a Video and Create a Victory. New features and additional content allow you to create custom Superstars, Arenas, and Championships. The power is in your hands to create your WWE. MyCAREER AND WWE UNIVERSE WITH NEW PROMO ENGINE. The all-new Promo Engine brings the drama and personality of the WWE Superstars to life in MyCAREER and WWE Universe modes. Choose your words wisely and smack talk your opponents, start rivalries or form alliances. Your words will shape your characters as they rise through the ranks of NXT and WWE, to become WWE Hall of Famers. [2K Sports]… Expand"}, {"name": "New Tales from the Borderlands", "details_link": "https://www.metacritic.com/game/pc/new-tales-from-the-borderlands", "publisher": "2K Games", "release_date": "Oct 21 2022", "developers": ["Gearbox Software"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/8/b8a1aa48f2a4ca023116dcf2c5c980db-98.jpg", "descriptions": "Take a stand against ruthless corporate overlords in this narrative-driven adventure! Within the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives. Help these three lovable losers as they endeavor to change the world (andTake a stand against ruthless corporate overlords in this narrative-driven adventure! Within the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives. Help these three lovable losers as they endeavor to change the world (and maybe even save it)! Face down a planetary invasion, vicious vault monster, and cold-hearted capitalist in this cinematic thrill ride where what happens next is up to you! Meet a motley cast full of misfits, assassin bots, and talking guns in this race to the top! It's time to fight back against exploitation and corporate greed. It's time to make Mayhem your business. … Expand"}, {"name": "Kao the Kangaroo", "details_link": "https://www.metacritic.com/game/xbox-series-x/kao-the-kangaroo", "publisher": "Tate Multimedia", "release_date": "May 27 2022", "developers": ["Tate Multimedia"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/6dd28e1acd981804127263afb5a26003-98.jpg", "descriptions": "Join Kao on his biggest adventure yet! This time the brave kangaroo has to find his missing sister and solve the mystery of what happened to his long-gone father. He will need to travel the world and confront the famous fighting masters, who are influenced by the mysterious, dark power. OnJoin Kao on his biggest adventure yet! This time the brave kangaroo has to find his missing sister and solve the mystery of what happened to his long-gone father. He will need to travel the world and confront the famous fighting masters, who are influenced by the mysterious, dark power. On the course of his journey, Kao will learn under the guidance of his master - Walt, how to become not only an awesome fighter but also a clever one who uses his head as much as his fists.… Expand"}, {"name": "Last Stop", "details_link": "https://www.metacritic.com/game/xbox-series-x/last-stop", "publisher": "Annapurna Interactive", "release_date": "Jul 22 2021", "developers": ["Variable State"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/e91290a49724dd71a7dd1217998d2b57-98.jpg", "descriptions": "Last Stop is a single-player third-person narrative adventure game set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis. An anthology drama, Last Stop is three stories in one. What connects these three strangers?Last Stop is a single-player third-person narrative adventure game set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis. An anthology drama, Last Stop is three stories in one. What connects these three strangers? Where will fate lead them?… Expand"}, {"name": "Spacebase Startopia", "details_link": "https://www.metacritic.com/game/pc/spacebase-startopia", "publisher": "Kalypso", "release_date": "Mar 26 2021", "developers": ["Realmforge Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["General", "Strategy", "Real-Time", "Command"], "meta_score": 69, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/0/7b1d65051d626a449b129f30161526e4-98.jpg", "descriptions": "SPACEBASE STARTOPIA is an original mix of economic simulation and empire building strategy paired with classic RTS fights. In addition to the single player Campaign and Skirmish mode, there’s also a competitive and co-op multiplayer mode for up to 4 players. And as if maintaining the 3 SpaceSPACEBASE STARTOPIA is an original mix of economic simulation and empire building strategy paired with classic RTS fights. In addition to the single player Campaign and Skirmish mode, there’s also a competitive and co-op multiplayer mode for up to 4 players. And as if maintaining the 3 Space Station Decks, entertaining the 8 Alien races and defending against invaders were not enough of a challenge, the dynamic narrator AI is not going to mince matters and commentates the events.… Expand"}, {"name": "Felix the Reaper", "details_link": "https://www.metacritic.com/game/xbox-one/felix-the-reaper", "publisher": "Daedalic Entertainment", "release_date": "Oct 17 2019", "developers": ["Kong Orange"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/a218d9cb0a72bfabda17f5294371ea32-98.jpg", "descriptions": "Felix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as a field reaper will enable him to one day meet her. Hence he’s taken the job of making sure people die — and taught himself to dance to impressFelix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as a field reaper will enable him to one day meet her. Hence he’s taken the job of making sure people die — and taught himself to dance to impress the love of his life.… Expand"}, {"name": "Monster Energy Supercross - The Official Videogame", "details_link": "https://www.metacritic.com/game/xbox-one/monster-energy-supercross---the-official-videogame", "publisher": "Milestone S.r.l", "release_date": "Feb 13 2018", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/036a98407b217d94dda21130e42da689-98.jpg", "descriptions": "Race with the official riders from 250SX and 450SX on the official tracks, Daytona included, to experience one of the most spectacular and entertaining racing competition ever! Customize your rider and bike as you like, with countless possibilities, with more than 80 official brands and 300Race with the official riders from 250SX and 450SX on the official tracks, Daytona included, to experience one of the most spectacular and entertaining racing competition ever! Customize your rider and bike as you like, with countless possibilities, with more than 80 official brands and 300 items available, and challenge yourself in conquering the top of the leaderboard.Race alone or against players from all over the world thought different offline and online game modes! Feel the rush of adrenaline, enter the arena and be the King of Supercross!… Expand"}, {"name": "Farming Simulator 17", "details_link": "https://www.metacritic.com/game/pc/farming-simulator-17", "publisher": "Focus Home Interactive", "release_date": "Oct 24 2016", "developers": ["Giants Software"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/74d96c7466b4e8f8e7de46025576136a-98.jpg", "descriptions": "Farming Simulator 17, developed by Giants Software, invites you into the challenging world of a modern day farmer. Take on all the challenges of farming life, including animal husbandry, crops, sales, and woodcutting. You decide how you want to manage and grow your farm in a huge, open world."}, {"name": "8-Bit Armies", "details_link": "https://www.metacritic.com/game/pc/8-bit-armies", "publisher": "Petroglyph", "release_date": "Apr 22 2016", "developers": ["Petroglyph"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/06d428588ca52618fa7fe582f72b9377-98.jpg", "descriptions": "8-Bit Armies is Petroglyph's first game in the 8-Bit RTS series. It commemorates the first Command & Conquer games with its accessible gameplay mechanics while providing a fun and timeless art style that introduces new players to the genre. A unique console controller scheme makes it easier8-Bit Armies is Petroglyph's first game in the 8-Bit RTS series. It commemorates the first Command & Conquer games with its accessible gameplay mechanics while providing a fun and timeless art style that introduces new players to the genre. A unique console controller scheme makes it easier than ever to build bases and command large armies without complex button memorization.\r FEATURES:\r * Jump right in with easy to understand modern military units and structures.\r* Play cooperatively or versus the AI choosing from multiple difficulty options.\r* Use classic RTS Base-Building mechanics to construct the ultimate HQ from which to attack your foes.\r* Explore a variety of locales, destroying everything that gets in your way with devastating superweapons.\r* Two campaigns with a total of 40 single-player combat missions for many hours of gameplay.\r* Join your friends to play 12 co-op missions against a variety of AI opponents.\r* Gather up to 8 online players to team up in one of the dozen multiplayer/skirmish maps.… Expand"}, {"name": "Bloodsports.TV", "details_link": "https://www.metacritic.com/game/pc/bloodsportstv", "publisher": "Fatshark AB", "release_date": "Mar 30 2015", "developers": ["Fatshark AB", "Fatshark"], "platforms": "PC", "genres": ["Action", "Strategy", "Real-Time", "General", "MOBA"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/3eb35d7313743dd261866cfc932ad866-98.jpg", "descriptions": "Co-op action set in a deadly post-apocalyptic Sweden."}, {"name": "The Marvellous Miss Take", "details_link": "https://www.metacritic.com/game/pc/the-marvellous-miss-take", "publisher": "Rising Star Games", "release_date": "Nov 20 2014", "developers": ["Wonderstruck Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/42282640a41f91ca51ec21390301f60a-98.jpg", "descriptions": "In the bustling heart of London, a once magnificent art collection has been unscrupulously poached and split up among private collectors. Meet Sophia Take, the rightful heir to the misappropriated masterpieces. Help Sophia to reclaim her inheritance on an exciting and daring adventure acrossIn the bustling heart of London, a once magnificent art collection has been unscrupulously poached and split up among private collectors. Meet Sophia Take, the rightful heir to the misappropriated masterpieces. Help Sophia to reclaim her inheritance on an exciting and daring adventure across the capital!… Expand"}, {"name": "Home (2012)", "details_link": "https://www.metacritic.com/game/pc/home-2012", "publisher": "Benjamin Rivers", "release_date": "Jun  1 2012", "developers": ["Benjamin Rivers"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Horror", "General", "Horror"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/5f67ebb9e5d7941f391b753fd220f237-98.jpg", "descriptions": "Home is a unique horror adventure set in a beautifully-realized pixel world. It's a murder mystery with a twist - because you decide what ultimately happens."}, {"name": "Earth Defense Force: Insect Armageddon", "details_link": "https://www.metacritic.com/game/pc/earth-defense-force-insect-armageddon", "publisher": "D3Publisher", "release_date": "Dec 14 2011", "developers": ["Vicious Cycle"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/61a1b27b49ca5a99b6013cf59ab8268f-98.jpg", "descriptions": "Taking place in the fictional city of New Detroit, Earth Defense Force: Insect Armageddon is a completely new game developed by Vicious Cycle that takes on the concept of Earth Defense Force 2017 (Japanese Title \"Earth Defense Force 3\" developed by SANDLOT).  Insect ArmageddonTaking place in the fictional city of New Detroit, Earth Defense Force: Insect Armageddon is a completely new game developed by Vicious Cycle that takes on the concept of Earth Defense Force 2017 (Japanese Title \"Earth Defense Force 3\" developed by SANDLOT).  Insect Armageddon continues to follow the rich history of casual fun and addictive gameplay that made the franchise a cult classic.  Insect Armageddon also adds a new aspect to the Earth Defense Force  series that was born in Japan, with additional elements for all EDF soldiers to experience.  The Campaign mode that lets up to three players team up online to battle the insects and aliens across a completely destroyable city.  Every EDF soldier is armed with over 150 weapons and four upgradeable armor sets and engages in nonstop arcade action that is the fastest and deadliest in the series.  In addition, the game also features a six-player Survival mode that pits a human squad against a nonstop onslaught of the largest enemies the aliens have to offer.  New Detroit's giant bug problem is unavoidable, and mankind's last hope lies with the Earth Defense Force to defend the world from the insect swarm, even if it means blowing up the entire city as part of the extermination process.… Expand"}, {"name": "Fishing Resort", "details_link": "https://www.metacritic.com/game/wii/fishing-resort", "publisher": "XSEED Games", "release_date": "Nov 22 2011", "developers": ["Prope"], "platforms": "Wii", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/846069cb0d21df05883eaa907015f4c4-98.jpg", "descriptions": "Players are free to fish wherever there is water, and a variety of locales are available, from tropical ocean fishing on the high sea to ice fishing atop the islandï¿½s mountains. With over 20 fish-related mini games and over 200 varieties of fish availablePlayers are free to fish wherever there is water, and a variety of locales are available, from tropical ocean fishing on the high sea to ice fishing atop the islandï¿½s mountains. With over 20 fish-related mini games and over 200 varieties of fish available ï¿½ not to mention four-player competitive modes and online leaderboards, which show players how they stack up against other anglers around the world ï¿½ thereï¿½s plenty of content for both casual players and completionists alike.\r Players start out in Fishing Resort by customizing their own unique character, and can choose to make a cartoon-style character of themselves, or someone entirely different. Add in over 200 items such as shoes, clothes, sunglasses, backpacks, hats and much more, and each player is given the tools to create an entirely unique character with which to explore the island. Fishing is accomplished by mimicking real-life fishing motions using the Wii Remoteï¿½ to cast and moving the Nunchukï¿½ in a circular motion to reel in fish, which range from pond guppies to massive marlins over 10-feet in length!… Expand"}, {"name": "Romance of the Three Kingdoms XI", "details_link": "https://www.metacritic.com/game/playstation-2/romance-of-the-three-kingdoms-xi", "publisher": "Koei", "release_date": "Feb  6 2007", "developers": ["Koei"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/8425a10671f0a8b27987be91ac95a4a7-98.jpg", "descriptions": "Set during the end of the Han Dynasty and the 2nd and 3rd centuries A.D., RTK XI features an artistic style evocative of classical Chinese ink-paintings, and with debates and duels now rendered in real-time 3D animation, RTK XI pushes the boundaries and blurs the line between video games andSet during the end of the Han Dynasty and the 2nd and 3rd centuries A.D., RTK XI features an artistic style evocative of classical Chinese ink-paintings, and with debates and duels now rendered in real-time 3D animation, RTK XI pushes the boundaries and blurs the line between video games and art in this stunning recreation of the mood and feel of ancient China. Players need to dig deep within to prove themselves adept at both the military and political arts in order to bring China under one rule. Domestic affairs, diplomacy and warfare are all conducted on a single vast 3D relief map, dramatically bringing to life the epic scale of the adventure that lies before them. As the ruler of a kingdom, each player has complete control over their territories. More than 40 base commands give players the power to govern cities, manage their personnel, practice diplomacy, and much more. Complete freedom to develop markets, shipyards, outposts, forts and military units expand on the already substantial benchmarks established by previous editions of the series. Finally, players watch the era come to life through the unique individual personalities of the more than 780 officers and supporting characters that they meet and interact with while engaged in one of RTK XI's ten gripping scenarios. [Koei]… Expand"}, {"name": "Greg Hastings' Tournament Paintball Max'd", "details_link": "https://www.metacritic.com/game/xbox/greg-hastings-tournament-paintball-maxd", "publisher": "Activision", "release_date": "Oct 18 2005", "developers": ["WXP"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "14  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/17ab79eb4ba6de486c66a84e688dacc9-98.jpg", "descriptions": "Build Your Field - Design and play your own custom fields with the Field Editor. Selecting from three field sizes, thirty-seven different object/bunker types, and ten object textures/skins just gets you started. Now feature yourself in your own MAX'D world by placing your bunkers in anBuild Your Field - Design and play your own custom fields with the Field Editor. Selecting from three field sizes, thirty-seven different object/bunker types, and ten object textures/skins just gets you started. Now feature yourself in your own MAX'D world by placing your bunkers in an almost infinite number of positions and layouts on the field. You're the MAX'D designer, and the field is your gaming universe. Take the opportunity to angle your bunkers using the Rotate feature, tap the Mirror feature for the quick ability to add bunker symmetry to both sides of the field, and use the Size Editor to bring each bunker to your desired scale. Ready to pimp it to the world? Upload your custom fields on Xbox LIVE! to stake your reputation as an online field designer. Control Your Team - Mastermind your teammates' movements at the start of the game with the ground-breaking FPS feature - Breakout Manager. You can direct your AI teammates to break for specific bunkers, select teammates to ether run or shoot, and identify the critical Sweet Spot for your Break Shooters to target the other team and take them out early. Split Screen and Co-Op - Play up to four players on the same Xbox. Career Mode Co-Op lets you join with friends to bust up the pros. Or make them bow to your skills first-hand by taking them on head-to-head.… Expand"}, {"name": "Powerdrome", "details_link": "https://www.metacritic.com/game/xbox/powerdrome", "publisher": "Mud Duck Productions", "release_date": "Jun 16 2004", "developers": ["Argonaut Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/5da0554249c35c22f7dbff528052b326-98.jpg", "descriptions": "The future of street racing has arrived with ramps, tunnels, and speeds of 1,000 miles per hour. Powerdrome takes you to this world and straps you into a supersonic flying craft. On the tracks and through the streets, you'll race against a variety of characters--each with their ownThe future of street racing has arrived with ramps, tunnels, and speeds of 1,000 miles per hour. Powerdrome takes you to this world and straps you into a supersonic flying craft. On the tracks and through the streets, you'll race against a variety of characters--each with their own personality, racing style, and friends or foes. Develop your driving skills, learn new tricks, and continue to shave seconds off your best times as your experience evolves. Once you have honed your skills, race against your friends and find out how good you really are.… Expand"}, {"name": "Worms 3D", "details_link": "https://www.metacritic.com/game/gamecube/worms-3d", "publisher": "Acclaim", "release_date": "Mar 11 2004", "developers": ["Team17"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Strategy", "General"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/0a84ef95b4c29c748d8f3fd417ca2fc3-98.jpg", "descriptions": "Join the party as worm battles ensue across 3D worlds. Worms 3D pits four players--each with a customizable team of worms--against one another in fully deformable landscapes. All the bizarre weapons from the Worms series--including Banana Bomb, flying Super Sheep, Earthquakes, Air Strikes,Join the party as worm battles ensue across 3D worlds. Worms 3D pits four players--each with a customizable team of worms--against one another in fully deformable landscapes. All the bizarre weapons from the Worms series--including Banana Bomb, flying Super Sheep, Earthquakes, Air Strikes, and Holy Hand Grenade--appear for your destructive pleasure. Wreak havoc in turn-based multiplayer action or unlock landscapes, sound sets, challenges, and secret missions in the immersive single-player mode. … Expand"}, {"name": "Sonic Battle", "details_link": "https://www.metacritic.com/game/game-boy-advance/sonic-battle", "publisher": "THQ", "release_date": "Jan  5 2004", "developers": ["Sonic Team"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/fa3c191c6b9530e60d9777310a720daf-98.jpg", "descriptions": "Who would win in a fight--Sonic, Tails, or Knuckles?  You determine the answer in Sonic Battle, a game that pits Sonic and his friends against each other in furious arena combat.  The game features eight playable characters, each with their own strengths and weaknesses, plus one mysteryWho would win in a fight--Sonic, Tails, or Knuckles?  You determine the answer in Sonic Battle, a game that pits Sonic and his friends against each other in furious arena combat.  The game features eight playable characters, each with their own strengths and weaknesses, plus one mystery fighter to unlock.  With three types of special attacks and ground, aerial, and defense fighting techniques, you can customize your character to suit your fighting style.  Up to four friends can link their systems together using the Game Boy Advance Game Link cable for team battles, and then combine special attacks into devastating combos.  … Expand"}, {"name": "XGRA: Extreme-G Racing Association", "details_link": "https://www.metacritic.com/game/gamecube/xgra-extreme-g-racing-association", "publisher": "Acclaim", "release_date": "Nov 24 2003", "developers": ["Acclaim Studios Cheltenham"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/640b7911fa205211bf2a67b08a80b284-98.jpg", "descriptions": "Pull a few more Gs in the next installment of the Extreme-G series, XGRA: Extreme-G Racing Association.  This futuristic racing game features all-new gameplay modes, features, weapons, bikes, controls, and unlockable content.  Choose from unique characters on eight different teams and buildPull a few more Gs in the next installment of the Extreme-G series, XGRA: Extreme-G Racing Association.  This futuristic racing game features all-new gameplay modes, features, weapons, bikes, controls, and unlockable content.  Choose from unique characters on eight different teams and build your career through variable missions and storylines.  Unlock new game modes, tracks, faster bikes, and character-enhancing cybernetic implants.  Race in a variety of race tracks with destructible objects including bridges and spectators.  Experience the future of racing.… Expand"}, {"name": "Kya: Dark Lineage", "details_link": "https://www.metacritic.com/game/playstation-2/kya-dark-lineage", "publisher": "Atari", "release_date": "Nov 18 2003", "developers": ["Eden Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 69, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/04dec644018389b9495b5f2e61d16d72-98.jpg", "descriptions": "Plunged into a mysterious world, Kya must seek her way through multiple dangers to find her brother and a way back home. She discovers the Nativs, a peaceful tribe, oppressed by the Wolfens - the menacing army of the evil Brazul. Kya must lead the rebellion of the Nativs for their freedom.Plunged into a mysterious world, Kya must seek her way through multiple dangers to find her brother and a way back home. She discovers the Nativs, a peaceful tribe, oppressed by the Wolfens - the menacing army of the evil Brazul. Kya must lead the rebellion of the Nativs for their freedom. Mastering magical powers, Kya can liberate the Wolfens from their mystical imprisonment and restore their true Nativ identity. Steal your way through or fight head-to-head with hordes of Wolfens using original combat moves and magical strikes. Soar against various vertiginous wind currents on breathtaking flights. Slide down extreme entwined turbulent tracks, through challenging obstacles and lush environments. Journey through unbelievable acrobatic freefalls as you get closer to Kya?s quest to save her brother and defeat the Fortress of Brazul.  [Atari]… Expand"}, {"name": "POD: Speedzone", "details_link": "https://www.metacritic.com/game/dreamcast/pod-speedzone", "publisher": "Ubisoft", "release_date": "Dec  5 2000", "developers": ["Ubisoft Romania"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/6cfbc9d7c70d611b2bc020ae338bad68-98.jpg", "descriptions": "Slip onto SegaNet and blast into POD SpeedZone, the fastest arcade racer for your Sega Dreamcast online. Pilot 8 futuristic cars across 6 surreal, mercilessly interactive tracks. Hone your maneuvers and master the weapons offline - then prove your racing chops in the POD online circuit. GetSlip onto SegaNet and blast into POD SpeedZone, the fastest arcade racer for your Sega Dreamcast online. Pilot 8 futuristic cars across 6 surreal, mercilessly interactive tracks. Hone your maneuvers and master the weapons offline - then prove your racing chops in the POD online circuit. Get fast - before the SpeedZone leaves you in the dust.… Expand"}, {"name": "Submarine Titans", "details_link": "https://www.metacritic.com/game/pc/submarine-titans", "publisher": "Strategy First", "release_date": "Aug  3 2000", "developers": ["Ellipse Studios"], "platforms": "PC", "num_players": "Up to 24 ", "genres": ["Strategy", "Real-Time", "General", "General", "Command"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/fd67a9675b1211520624a034dcae4f25-98.jpg", "descriptions": "Submarine Titans dares you to go where no real-time strategy game has gone before -- deep into the three-dimensional heart of a fantastical underwater universe.  [Strategy First]"}, {"name": "SpongeBob SquarePants: Battle for Bikini Bottom - Rehydrated", "details_link": "https://www.metacritic.com/game/playstation-4/spongebob-squarepants-battle-for-bikini-bottom---rehydrated", "publisher": "THQ Nordic", "release_date": "Jun 23 2020", "developers": ["Purple Lamp Studios"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/8/0b7aeed9411d6a7eb9ada6b7943b6974-98.jpg", "descriptions": "Are you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course youAre you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course you do! Want to underpants bungee jump? Why wouldn't you! Want to join forces in a brand new multiplayer mode? The battle is on!GAME FEATURES- Play as SpongeBob, Patrick and Sandy and use their unique sets of skills- Thwart Plankton's evil plan to rule Bikini Bottom with his army of wacky robots- Meet countless characters from the beloved seriesREMAKE FEATURES- Faithful remake of one of the best SpongeBob games ever created- High-end visuals, modern resolutions and carefully polished gameplay- Brand new horde mode multiplayer for up to two players, online and offline- Restored content that was cut from the original game like the Robo Squidward boss fight and more… Expand"}, {"name": "Maneater", "details_link": "https://www.metacritic.com/game/playstation-4/maneater", "publisher": "Deep Silver", "release_date": "May 22 2020", "developers": ["Tripwire Interactive", "Blindside Interactive"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/1cb0b8a0c337ca2962860bb6a3410f3c-98.jpg", "descriptions": "Experience the ultimate power fantasy as the apex predator of the seas - a terrifying SHARK! Maneater is a single player, open world action RPG (ShaRkPG) where YOU are the shark. Starting as a small shark pup you are tasked with surviving the harsh world while eating your way up theExperience the ultimate power fantasy as the apex predator of the seas - a terrifying SHARK! Maneater is a single player, open world action RPG (ShaRkPG) where YOU are the shark. Starting as a small shark pup you are tasked with surviving the harsh world while eating your way up the ecosystem. To do this you will explore a large and varied open world encountering diverse enemies - both human and wildlife. Find the right resources and you can grow and evolve far beyond what nature intended, allowing the player to tailor the shark to their play style. This is fortunate, because to get revenge on the cruel fisherman that dismembered you will take evolving into a massive shark, an apex predator of legends. Eat. Explore. Evolve.… Expand"}, {"name": "Conan Exiles", "details_link": "https://www.metacritic.com/game/pc/conan-exiles", "publisher": "Funcom", "release_date": "May  8 2018", "developers": ["Funcom"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 40 ", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/5e026b960eaf02f5a9caa7a5e7788688-98.jpg", "descriptions": "Conan Exiles is an open-world survival game set in the brutal lands on Conan the Barbarian."}, {"name": "Kingdom Hearts Re: Chain of Memories", "details_link": "https://www.metacritic.com/game/playstation-2/kingdom-hearts-re-chain-of-memories", "publisher": "Square Enix", "release_date": "Dec  2 2008", "developers": ["Jupiter Corporation"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/6d6ae22e25aa55cd5bedae0459265e3c-98.jpg", "descriptions": "Sora, Donald and Goofy travel down a long road that meanders through endless fields, and come to a crossroads. As Sora stands in the crossroads, he gazes up at the night sky and thinks of his lost friends. Just then, a mysterious man approaches from down one of the branching paths. \"AheadSora, Donald and Goofy travel down a long road that meanders through endless fields, and come to a crossroads. As Sora stands in the crossroads, he gazes up at the night sky and thinks of his lost friends. Just then, a mysterious man approaches from down one of the branching paths. \"Ahead lies something you need,\" he says, \"but to claim it, you must lose something dear.\" The man vanishes before a single path, leading to a castle that eerily resembles a girl's drawing... In the coming journey, what will Sora and his companions gain, and what will they lose? In addition to Sora, players can control Riku in this adventure that bridges the gap between KINGDOM HEARTS and KINGDOM HEARTS II \rA full 3D remake of the original GBA release, KINGDOM HEARTS Re:Chain of Memories offers a refreshing rendition of the hit title for the PlayStation 2 system. The talented voice cast from the North American releases of KINGDOM HEARTS and KINGDOM HEARTS II, including David Gallagher and Haley Joel Osment, return to breathe new life into the beloved characters. The mini-game catalog has been completely renewed, now with four brand new experiences accompanying the main adventure. [Square Enix]… Expand"}, {"name": "MySims", "details_link": "https://www.metacritic.com/game/wii/mysims", "publisher": "EA Games", "release_date": "Sep 18 2007", "developers": ["EA Redwood Shores"], "platforms": ["PC", "Wii"], "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/3f36419534956de9a564348994a53766-98.jpg", "descriptions": "Explore a whole new world with MySims - it's your world to transform. Move to a town that has been struggling lately. With a little creativity and some help from the locals, you can make this place thrive. Improve the town to attract new characters, from the Italian Chef and Florist to theExplore a whole new world with MySims - it's your world to transform. Move to a town that has been struggling lately. With a little creativity and some help from the locals, you can make this place thrive. Improve the town to attract new characters, from the Italian Chef and Florist to the Kickboxing Instructor and DJ. Discover what the residents want and need, so that you can help them enjoy life in their town. Design a hot tub or a jukebox from scratch, build homes and businesses from the roof to the front door. Uncover special decorations and patterns as you explore the growing town. From the furniture and objects to the buildings to the town as a whole – each of your creations is unique. In MySims, what you make... makes all the difference. Your town is your own unique creation, from the flower shop to building a mad scientist's laboratory, and beyond. It's your call who lives there and who moves out. Who will you befriend? Who will you ignore? Socialize with the locals and uncover all sorts of useful or surprising treasures hidden throughout the town. It's a cinch to personalize your Sims appearance from head to toe with the Wii & Nintendo DS controls. Unlock cool new clothing and accessories as you befriend the neighbors. Decorate with your very own furniture and accessories, then customize your creations with things you can grow, harvest, or discover around town. [Electronic Arts]… Expand"}, {"name": "Shadowgate", "details_link": "https://www.metacritic.com/game/pc/shadowgate", "publisher": "Reverb Triple XP", "release_date": "Aug 21 2014", "developers": ["Zojoi Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/efbec9f0dc43243137ee30f43d44e2df-98.jpg", "descriptions": "Nearly 30 years after the original version premiered on the Macintosh, Shadowgate returns, fully re-imagined and updated for todayâ€™s gaming landscape. With 4K-capable resolutions, Shadowgate not only features a stunning level of hand-painted detail but also tons of new mind-bending puzzlesNearly 30 years after the original version premiered on the Macintosh, Shadowgate returns, fully re-imagined and updated for todayâ€™s gaming landscape. With 4K-capable resolutions, Shadowgate not only features a stunning level of hand-painted detail but also tons of new mind-bending puzzles and more objects to interact with to help you on your quest. There are also plenty of throwbacks to the original version, so veterans and newcomers alike will all relish their journey through Shadowgateâ€¦ if they survive.… Expand"}, {"name": "Band of Bugs", "details_link": "https://www.metacritic.com/game/xbox-360/band-of-bugs", "publisher": "NinjaBee", "release_date": "Jun 20 2007", "developers": ["NinjaBee"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 68, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/ffe23ae33ae55faf933d8deca2847743-98.jpg", "descriptions": "[Xbox Live Arcade]  Maal is an unhappy bug who needs structure and a purpose in his life, so he joins the royal army under the tutelage of the battle-hardened mantis warrior Tiernan. Now, he must begin his quest to save the Queen and the kingdom. NinjaBee's Band of Bugs puts you in Maal's[Xbox Live Arcade]  Maal is an unhappy bug who needs structure and a purpose in his life, so he joins the royal army under the tutelage of the battle-hardened mantis warrior Tiernan. Now, he must begin his quest to save the Queen and the kingdom. NinjaBee's Band of Bugs puts you in Maal's shoes ... er, footpads, and sets you in the middle of a fast-playing, accessible, tactical strategy game designed specifically for Xbox LIVE Arcade. This turn-based tactics game expands the genre by providing a unique Level Editor, allowing gamers to create levels and play them online with friends. One of the few turn-based tactics games available, Band of Bugs provides gameplay deep enough to be satisfying to established fans of the genre, but friendly enough to appeal to all types of casual gamers. The game includes a story-based campaign and stand-alone missions as well as several unique multiplayer modes:  Elimination, Escape, and Capture. The game has fifty levels, but also features a Level Editor allowing you to design custom scenarios and play them solo or over Xbox LIVE with your friends. [Microsoft]… Expand"}, {"name": "Joint Task Force", "details_link": "https://www.metacritic.com/game/pc/joint-task-force", "publisher": "Sierra Entertainment", "release_date": "Sep 12 2006", "developers": ["HD Interactive", "Most Wanted Entertainment"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Modern", "Modern", "Tactics"], "meta_score": 68, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/d212e91d836c018d517c8a2030250019-98.jpg", "descriptions": "Joint Task Force portrays a future that could easily become reality: In 2007, neither the US, UN nor NATO have the power to pacify the numerous combat hot spots blazing around the globe. To quell the global rise of terrorism, dictators and insurgents, Western Leaders create the Joint TaskJoint Task Force portrays a future that could easily become reality: In 2007, neither the US, UN nor NATO have the power to pacify the numerous combat hot spots blazing around the globe. To quell the global rise of terrorism, dictators and insurgents, Western Leaders create the Joint Task Force – an ultramodern and highly elite military squad. The player takes control of the JTF to combat various oppressive regimes around the world. [HD Publishing]… Expand"}, {"name": "Painkiller: Hell Wars", "details_link": "https://www.metacritic.com/game/xbox/painkiller-hell-wars", "publisher": "DreamCatcher Interactive", "release_date": "Jul 24 2006", "developers": ["People Can Fly"], "platforms": ["PC", "Xbox"], "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Fantasy"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/107ac11d3925581bd2325bcf53cd0c97-98.jpg", "descriptions": "You play as Daniel Garner, a seemingly regular guy who as just been killed in a horrific car accident. Trapped in a dark and unwelcoming world between heaven and hell, you struggling to uncover the reasons why you've been denied entry into heaven. Awaiting your purification, you must fightYou play as Daniel Garner, a seemingly regular guy who as just been killed in a horrific car accident. Trapped in a dark and unwelcoming world between heaven and hell, you struggling to uncover the reasons why you've been denied entry into heaven. Awaiting your purification, you must fight through a seemingly endless number of demon soldiers as you to attempt to stop an imminent unholy war.… Expand"}, {"name": "Gang Beasts", "details_link": "https://www.metacritic.com/game/playstation-4/gang-beasts", "publisher": "Double Fine Productions", "release_date": "Dec 12 2017", "developers": ["Boneloaf"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "General", "Party / Minigame"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/8505f7de0da9e3ab966ee26f9e498d47-98.jpg", "descriptions": "Gang Beasts is a silly local multiplayer party game with doughy ragdoll physics and horrific environmental hazards. In the current pre-alpha players can grab, push, pull, punch, and throw their friends from wrestling rings, speeding trucks, and suspended platforms."}, {"name": "Layers of Fear 2", "details_link": "https://www.metacritic.com/game/playstation-4/layers-of-fear-2", "publisher": "Gun Media", "release_date": "May 28 2019", "developers": ["Bloober Team"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/f1ccda863401165b4256055d7c9f3bf4-98.jpg", "descriptions": "Layers of Fear 2 is a first-person psychological horror game with an emphasis on exploration and story. Players control a Hollywood actor who heeds the call of an enigmatic director to take on the lead role in a film shot aboard an ocean liner. Beware, for all may not truly be what it seems."}, {"name": "WWE 2K17", "details_link": "https://www.metacritic.com/game/xbox-one/wwe-2k17", "publisher": "2K Sports", "release_date": "Oct 11 2016", "developers": ["Yuke's"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/928f86fbf8e4811688351c30def93bf3-98.jpg", "descriptions": "Features thousands of new moves and animations, backstage and in-arena brawling, and the biggest roster of WWE and NXT Superstars and Legends to date. Now more than ever, you will feel like you are commanding an actual WWE broadcast! POWERFUL CREATION SUITE. Create and develop your customFeatures thousands of new moves and animations, backstage and in-arena brawling, and the biggest roster of WWE and NXT Superstars and Legends to date. Now more than ever, you will feel like you are commanding an actual WWE broadcast! POWERFUL CREATION SUITE. Create and develop your custom WWE with the deepest Creation Suite to date, featuring new creation options such as Create a Video and Create a Victory. New features and additional content allow you to create custom Superstars, Arenas, and Championships. The power is in your hands to create your WWE. MyCAREER AND WWE UNIVERSE WITH NEW PROMO ENGINE. The all-new Promo Engine brings the drama and personality of the WWE Superstars to life in MyCAREER and WWE Universe modes. Choose your words wisely and smack talk your opponents, start rivalries or form alliances. Your words will shape your characters as they rise through the ranks of NXT and WWE, to become WWE Hall of Famers. [2K Sports]… Expand"}, {"name": "Art Style: Rotozoa", "details_link": "https://www.metacritic.com/game/wii/art-style-rotozoa", "publisher": "Nintendo", "release_date": "Jun 21 2010", "developers": ["Skip Ltd."], "platforms": "Wii", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/eb50995d88a3fcfca25c9bf51a6bc30d-98.jpg", "descriptions": "[WiiWare; Also known as \"Art Style: Penta Tentacles\"]  Control a circular creature-like organism known as a rotozoan and nimbly make your way through level after level of primordial ooze. Comprised of only three distinct parts (colored sides, tentacles and life force), the focus of your[WiiWare; Also known as \"Art Style: Penta Tentacles\"]  Control a circular creature-like organism known as a rotozoan and nimbly make your way through level after level of primordial ooze. Comprised of only three distinct parts (colored sides, tentacles and life force), the focus of your rotozoan life is simple: grow your tentacles. After playing a few levels and learning the basics of your microscopic world, you begin to unlock additional modes of play and the ability to choose the number of tentacles on your rotozoan. Each mode has its own specific purpose: reach a particular length with your tentacles or grow them to the greatest length possible. In either mode, growing your tentacles means absorbing enemies known as goobugs by touching them. There's just one catch: Successfully absorbing a goobug depends on matching its color to your tentacle. Also, longer tentacles can more easily come in contact with incorrectly colored goobugs (causing damage to the tentacle and decreasing your life force), and the goobugs themselves multiply and begin adapting to your movement. Luckily, objects such as the restorative heart item and special attack-enabling cyclone item can be found floating in the ooze to help your rotozoan survive. With atmospheres ranging from peaceful to intensely challenging, Art Style: Rotozoa offers a wide variety of levels. Victory can only be achieved through quick, precise movement and the ability to remain calm under pressure. Are you ready to take on the goobugs? Games in the Art Style series feature elegant design, polished graphics and pick-up-and-play controls, creating an experience focused purely on fun and engaging game play.… Expand"}, {"name": "Pokemon Ranger: Guardian Signs", "details_link": "https://www.metacritic.com/game/ds/pokemon-ranger-guardian-signs", "publisher": "Nintendo", "release_date": "Oct  4 2010", "developers": ["Creatures Inc."], "platforms": "DS", "genres": ["Role-Playing", "General", "General"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/3594d28eef4c3bd4e78db913dd2dbc2d-98.jpg", "descriptions": "Guardian Signs is the third installment in the Pokemon Ranger series."}, {"name": "Madballs in Babo: Invasion", "details_link": "https://www.metacritic.com/game/xbox-360/madballs-in-babo-invasion", "publisher": "Playbrains", "release_date": "Jul 15 2009", "developers": ["Playbrains"], "platforms": ["PC", "Xbox 360"], "num_players": "16  Online", "genres": ["Action", "General", "General"], "meta_score": 68, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/19fc68298a5b476c4caac4a0f8373e23-98.jpg", "descriptions": "[Xbox Live Arcade]  Combat revolved! In Madballs in … Babo: Invasion, campaign across distant worlds either solo or with four-player online co-op, taking no prisoners in your wake. Challenge your friends (and your enemies) to see who's the baddest ball on the planet in no-holds-barred[Xbox Live Arcade]  Combat revolved! In Madballs in … Babo: Invasion, campaign across distant worlds either solo or with four-player online co-op, taking no prisoners in your wake. Challenge your friends (and your enemies) to see who's the baddest ball on the planet in no-holds-barred 16-player multiplayer arenas with freaky characters or with your own Xbox 360 Avatar! Or really push your limits and try your hand at Invasion Mode where combatants create the very worlds where they wage war. Dozens of unique character classes, weapons, special abilities, worlds, unlocks, secrets, maps, and game modes give you limitless gameplay! [Microsoft]… Expand"}, {"name": "Harry Potter and the Goblet of Fire", "details_link": "https://www.metacritic.com/game/xbox/harry-potter-and-the-goblet-of-fire", "publisher": "Electronic Arts", "release_date": "Nov  8 2005", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-3 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/5/ad33c9dec4151681d9494783eeb247ca-98.jpg", "descriptions": "Harry, Ron, and Hermione are back in Harry Potter and the Goblet of Fire, a game based on J.K. Rowling's fourth book. The game follows Harry, the wizard-in-training, as he confronts a fire-breathing dragon, rescues friends from the icy depths of the Black Lake, and navigates the twistingHarry, Ron, and Hermione are back in Harry Potter and the Goblet of Fire, a game based on J.K. Rowling's fourth book. The game follows Harry, the wizard-in-training, as he confronts a fire-breathing dragon, rescues friends from the icy depths of the Black Lake, and navigates the twisting corridors of a maze. As Harry, Ron, or Hermione, you can cast a variety of spells in both single-player and cooperative modes.… Expand"}, {"name": "King's Quest Chapter 2: Rubble Without a Cause", "details_link": "https://www.metacritic.com/game/playstation-4/kings-quest-chapter-2-rubble-without-a-cause", "publisher": "Sierra Games", "release_date": "Dec 15 2015", "developers": ["The Odd Gentlemen"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/70874cabdc84013a77c8a17a3c6a5279-98.jpg", "descriptions": "Kings Quest - Chapter 1: A Knight to Remember is required to play this content and is sold separately.\r Kings Quest - Rubble Without A Cause is the second of five chapters in the new, critically acclaimed reimagining of the classic Kings Quest game series. In this latest adventure, KingKings Quest - Chapter 1: A Knight to Remember is required to play this content and is sold separately.\r Kings Quest - Rubble Without A Cause is the second of five chapters in the new, critically acclaimed reimagining of the classic Kings Quest game series. In this latest adventure, King Graham takes players back to his first test as ruler of Daventry. When a mischievous horde of goblins takes his kingdom hostage, a newly crowned and woefully unprepared Graham must rise up to free his people and prove himself the leader he was destined to become.\r Will Graham and his friends unearth a way to escape their rock-brained captors? Will he take for granite everything he learned as an adventurer? Does he have the stones to reclaim his mantle & lead his kingdom to safety? Will the hat make it out ok?… Expand"}, {"name": "BioShock Infinite: Clash in the Clouds", "details_link": "https://www.metacritic.com/game/xbox-360/bioshock-infinite-clash-in-the-clouds", "publisher": "2K Games", "release_date": "Jul 30 2013", "developers": ["Irrational Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/9c8baa1dc9666b0946fc693802ffde57-98.jpg", "descriptions": "This first add-on pack puts an intense focus on BioShock Infinite combat. Combine weapons, Vigors, Gear, Tears, and Sky-Lines in ways you never thought possible as you square off against impossible odds. This pack features 60 challenges in four brand-new environments. Complete Blue RibbonThis first add-on pack puts an intense focus on BioShock Infinite combat. Combine weapons, Vigors, Gear, Tears, and Sky-Lines in ways you never thought possible as you square off against impossible odds. This pack features 60 challenges in four brand-new environments. Complete Blue Ribbon Challenges and unlock concept art, Voxophones, Kinetoscopes, and more in The Columbian Archeological Society. Climb the Leaderboards and earn new achievements.… Expand"}, {"name": "Madden NFL 09", "details_link": "https://www.metacritic.com/game/psp/madden-nfl-09", "publisher": "Electronic Arts", "release_date": "Aug 12 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/92133705abec0383e1d852b3b2205bfc-98.jpg", "descriptions": "Celebrating 20 Years of Innovation, Madden NFL 09 combines Wi-Fi multiplayer games and Rec Room mini-games with all-new EA Sports Family Play, featuring an easy-to-use game control system. With an all-new tri-level playcalling system, plus the new Last-Minute Miracle mini-game, the franchiseCelebrating 20 Years of Innovation, Madden NFL 09 combines Wi-Fi multiplayer games and Rec Room mini-games with all-new EA Sports Family Play, featuring an easy-to-use game control system. With an all-new tri-level playcalling system, plus the new Last-Minute Miracle mini-game, the franchise takes its next leap in bringing you football on the go with Madden NFL 09. Now anybody can dominate the game like a pro with all-new EA Sports Rookie Mode. Simplified playcalling controls and an easy-to-use passing system promise to make Madden NFL 09 the most accessible PSP football game ever. Players of all skill levels can be competitive by calling plays from three unique playbooks, ranging from Easy to Advanced. Intelligent Coach Tips provide instant feedback to help you become a better player on the fly. Deliver Big Hits with Ease - Dominate on the defensive side of the ball with an all-new one-button control scheme featuring assisted player movement allowing new players to enjoy early success. New Player Indicators - Find the open man with the help of new open receiver icons identifying who's open or covered. Wide-open receivers help you out even more, calling for the ball by waving their arms. Player indicators also tell you when to evade an approaching defender or perform a crushing tackle. [Electronic Arts]… Expand"}, {"name": "Tom Clancy's EndWar", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-endwar", "publisher": "Ubisoft", "release_date": "Feb 24 2009", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Strategy", "Real-Time", "Military", "Military", "Tactics"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/6d9afb9406b32af813906adb8d0d5159-98.jpg", "descriptions": "2011 - 2014. The world enjoys an unprecedented era of peace as enhanced defense technology eliminates the threat of nuclear war. But can it last? 2020. Constant depletion of resources has international tensions at a breaking point. One spark will ignite what no one thought could happen...a2011 - 2014. The world enjoys an unprecedented era of peace as enhanced defense technology eliminates the threat of nuclear war. But can it last? 2020. Constant depletion of resources has international tensions at a breaking point. One spark will ignite what no one thought could happen...a third and final world war. Strategy for the next generation: Led by creative director Michael de Plater (Rome Total War), EndWar promises to redefine strategy gaming. Designed for next-gen consoles EndWar creates a theatre of war, immersing you in the drama of World War III in a way you never thought possible. Fight For Your Nation: Pick a side US, Europe, Russia - the fate of the world is in your hands. If you don't step in to save your homeland, who will? Command Your Army: Grow your army into the most powerful force on the planet. Your army is completely customizable, and experience breeds strength - your units grow more powerful with every campaign you fight. Light Up The City of Lights: Tom Clancy's World War III won't be won by capturing remote deserts or grasslands but by striking countries in the heart. Paris, Moscow, Washington D.C. will all erupt in flames as you battle your way through the fully destructive playground. A Whole New Kind of Massive: EndWar is an online multiplayer experience unlike anything you've ever encountered. 16 player matchups? Try hundreds. 30 minute battles? Try persistent matchups lasting for months at a time. This isn't a skirmish, it's World War III. Talk Your Way to Victory: Put the controller aside and start shouting commands. EndWar can be played almost entirely via voice command. [Ubisoft]… Expand"}]