[{"name": "World Championship Poker", "details_link": "https://www.metacritic.com/game/playstation-2/world-championship-poker", "publisher": "Crave", "release_date": "Nov 18 2004", "developers": ["Coresoft"], "platforms": "PlayStation 2", "num_players": "6  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 60, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/a30ce8d75ef4032f4141d95730105841-98.jpg", "descriptions": "From Texas Hold'em to Seven-Card Stud and Omaha High-Low, poker is being played by an estimated 50 to 70 million people worldwide, and tournament action can be found on television almost every night of the week. With World Championship Poker, Crave puts players in the fast and freewheelingFrom Texas Hold'em to Seven-Card Stud and Omaha High-Low, poker is being played by an estimated 50 to 70 million people worldwide, and tournament action can be found on television almost every night of the week. With World Championship Poker, Crave puts players in the fast and freewheeling world of high-stakes poker on their own next generation console and handheld system. Features over 18 different poker games, including Texas Hold’em, Five Card Draw and Pineapple. Poker tutorials, as well as hints and tips on strategy. Six tournament locations, ranging from a TV studio to a Mississippi riverboat. Fully customizable characters with over 80 different options to mold a player’s look. Multi-Player via GameSpy. Eye-Toy support for the PlayStation 2 computer entertainment system as well as text and voice chat support. [Crave]… Expand"}, {"name": "WWE 2K Battlegrounds", "details_link": "https://www.metacritic.com/game/playstation-4/wwe-2k-battlegrounds", "publisher": "2K Games", "release_date": "Sep 18 2020", "developers": ["Saber Interactive"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 60, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/40be4b8e97641627a527a9ea3e01c571-98.jpg", "descriptions": "The world of WWE is your battleground with all-new, over the top, in-your-face arcade action as your favorite WWE Superstars and Legends battle it out in outlandish interactive environments around the world. Compete with your friends in your favorite match types with an arsenal ofThe world of WWE is your battleground with all-new, over the top, in-your-face arcade action as your favorite WWE Superstars and Legends battle it out in outlandish interactive environments around the world. Compete with your friends in your favorite match types with an arsenal of exaggerated maneuvers, special abilities, and devastating power-ups, including Steel Cage, Royal Rumble, Fatal Four Way and more, as Mauro Ranallo and Jerry \"The King\" Lawler call all the mayhem! Are you ready to enter the battleground?… Expand"}, {"name": "Dokapon Journey", "details_link": "https://www.metacritic.com/game/ds/dokapon-journey", "publisher": "Atlus", "release_date": "Apr 14 2009", "developers": ["Suzak"], "platforms": "DS", "genres": ["Role-Playing", "General", "General"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/941969ea75e09cb9af060f9759268bcf-98.jpg", "descriptions": "The Kingdom of Dokapon is in peril! Desperate to do away with the monster invasion that has overrun his land, the King has offered his crown and the hand of his daughter, Princess Penny, to whoever can restore peace once again.  Heroes from distant lands rise to the call, but with multipleThe Kingdom of Dokapon is in peril! Desperate to do away with the monster invasion that has overrun his land, the King has offered his crown and the hand of his daughter, Princess Penny, to whoever can restore peace once again.  Heroes from distant lands rise to the call, but with multiple adventurers offering to assist in the struggle, each eagerly eyeing the prizes that await the champion of Dokapon, they must now fight amongst themselves to save the kingdom and claim their reward. Irresistible board game-RPG combination - This board game and RPG fusion will make you think strategy like never before on Nintendo DS!  Customization, strategy, and depth are all yours as you squeeze battling, leveling up, conquering towns, and much more into each turn. Playing dirty is the name of the game - This is all-out, winner-take-all competition, where the system favors those that know how to fight dirty!  Jump into someone else's fight, finish off the enemy, and snatch the experience.  Mow down your competition and take a reward from their inventory.  Use special items to slow down or injure those who get in your way. Total multiplayer experience - The zany head-to-head-to-head (-to-head) competition of board games is in full force whether you play alone or in a group! Assign control of each character to a human or one of three computer play styles.  Get your friends together, and up to 4 can play in single- or multi-card mode. [Atlus USA]… Expand"}, {"name": "Final Fantasy Crystal Chronicles: Remastered Edition", "details_link": "https://www.metacritic.com/game/switch/final-fantasy-crystal-chronicles-remastered-edition", "publisher": "Square Enix", "release_date": "Aug 27 2020", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 60, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/21ed49c7465afcd9d35b680216e1c1a6-98.jpg", "descriptions": "The Return of a Masterpiece\r FINAL FANTASY CRYSTAL CHRONICLES is back and more beautiful than ever on Nintendo Switch and PlayStation 4, fifteen years after the classic original.\r\n\r\nFINAL FANTASY CRYSTAL CHRONICLES Remastered Edition follows a young group, known as the Crystal Caravans, asThe Return of a Masterpiece\r FINAL FANTASY CRYSTAL CHRONICLES is back and more beautiful than ever on Nintendo Switch and PlayStation 4, fifteen years after the classic original.\r FINAL FANTASY CRYSTAL CHRONICLES Remastered Edition follows a young group, known as the Crystal Caravans, as they embark on an epic journey to search for myrrh, a precious and rare liquid needed to cleanse and maintain a crystal protecting their world from the deadly gas, miasma.\r Team up with faraway friends to take down fearsome foes! Enlist comrades to your crystal caravan in an online multiplayer mode for up to four players.… Expand"}, {"name": "Atlantis Quest", "details_link": "https://www.metacritic.com/game/pc/atlantis-quest", "publisher": "Got Game Entertainment", "release_date": "Mar  2 2006", "developers": ["TERMINAL Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Matching", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/64db7280a91fa78f8153f3cf9ba22e0e-98.jpg", "descriptions": "Embark on a journey around ancient Greece, Babylon, Carthage, Egypt, and Rome in search of one of the greatest mysteries of all time - the lost city of Atlantis. In this classic style matching game with a dazzling new twist, you must discover pieces of ancient artifacts to help you find aEmbark on a journey around ancient Greece, Babylon, Carthage, Egypt, and Rome in search of one of the greatest mysteries of all time - the lost city of Atlantis. In this classic style matching game with a dazzling new twist, you must discover pieces of ancient artifacts to help you find a way to your destination. Includes 76 exciting levels, thrilling power-up items, and numerous extra features. [Got Game Entertainment]… Expand"}, {"name": "Ribbit King", "details_link": "https://www.metacritic.com/game/gamecube/ribbit-king", "publisher": "Bandai", "release_date": "Jun  8 2004", "developers": ["Bandai"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/1248ede9a5d5d03e4f00a2d5b50b45f6-98.jpg", "descriptions": "In Ribbit King, the fate of the planet rests on your ability to get frogs into holes. This is the game of Frolf, and, as Scooter, you must play it across 20 different courses on five different worlds. Power supplies are running out, and to save them, you must win the coveted Super Ribbinite.In Ribbit King, the fate of the planet rests on your ability to get frogs into holes. This is the game of Frolf, and, as Scooter, you must play it across 20 different courses on five different worlds. Power supplies are running out, and to save them, you must win the coveted Super Ribbinite. Choose from 13 odd characters and more than 10 frogs to collect items and points through Frolfing matches. Become the Frolfing Champion in Story mode or Versus mode, which supports up to four players.… Expand"}, {"name": "Total Immersion Racing", "details_link": "https://www.metacritic.com/game/xbox/total-immersion-racing", "publisher": "Empire Interactive", "release_date": "Nov 18 2002", "developers": ["Razorworks Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/5dde5b0a78faf83bcfeb6a2dfdd5be86-98.jpg", "descriptions": "Immerse yourself in a new racing experience that features the latest driving technology, real-world racetracks and cars, and challenging gameplay. In Total Immersion Racing, you'll start on a career path that brings you from the lowest ranks of racing all the way to the world championship.Immerse yourself in a new racing experience that features the latest driving technology, real-world racetracks and cars, and challenging gameplay. In Total Immersion Racing, you'll start on a career path that brings you from the lowest ranks of racing all the way to the world championship. Get behind the wheel of one of 18 licensed cars, and race against drivers who have their own personalities, driving styles, memories, behaviors, and grudges to bear. If you upset the wrong opponent, don't be surprised if he responds many races later.… Expand"}, {"name": "Le Mans 24 Hours", "details_link": "https://www.metacritic.com/game/pc/le-mans-24-hours", "publisher": "Atari", "release_date": "Jun  1 2002", "developers": ["Atari", "Infogrames", "Melbourne House"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Automobile"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/4d4af4e9eac640cd5e3ad1353eff7523-98.jpg", "descriptions": "Race over 70 licensed cars including 30 new vehicles from the Le Mans 2000 Race. Blast through 12 real-world tracks. 24 hours of intense action with unique Day-to-Night-to-Day racing: endure real-time weather and surface effects for ultimate realism. Fully immersive environments includingRace over 70 licensed cars including 30 new vehicles from the Le Mans 2000 Race. Blast through 12 real-world tracks. 24 hours of intense action with unique Day-to-Night-to-Day racing: endure real-time weather and surface effects for ultimate realism. Fully immersive environments including new animated drivers and pit crew, advanced AI, new car settings and real-time lighting. Compete in 5 challenging game modes and experience the new Le Mans 2000 Race. [Infogrames]… Expand"}, {"name": "The Powerpuff Girls: Mojo Jojo A-Go-Go", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-powerpuff-girls-mojo-jojo-a-go-go", "publisher": "Bam Entertainment", "release_date": "Nov 27 2001", "developers": ["Sennari Interactive"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 60, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/21ec7a59bba0c6f5af8396488e3ac931-98.jpg", "descriptions": "While the game can't be recommended as highly as the incredible cartoon it's based on, Powerpuff Girls: Mojo-Jojo A-Go-Go is a capable shooter in its own right."}, {"name": "Risen", "details_link": "https://www.metacritic.com/game/xbox-360/risen", "publisher": "Deep Silver", "release_date": "Feb 22 2010", "developers": ["Piranha Bytes"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/dc751d9cf33f978957233e6f2d1b7d1c-98.jpg", "descriptions": "An epic story in an authentic world hand-crafted with an eye for detail and populated by \"real\", plausible characters. A Mysterious Volcanic Island The heavy tremors on the island bode ill for its inhabitants. Ancient temples have risen from the ground recently, bizarre creatures areAn epic story in an authentic world hand-crafted with an eye for detail and populated by \"real\", plausible characters. A Mysterious Volcanic Island The heavy tremors on the island bode ill for its inhabitants. Ancient temples have risen from the ground recently, bizarre creatures are terrorising the area. Fear and terror is spreading among the population. The End of All Hope? A group of powerful men who call themselves \"The Inquisitors\" have taken it upon them-selves to put an end to these events. They send an exhibition to this remote island, but a storm takes hold of the ship and destroys it at sea. A Hero Will Come - As if by a miracle, the player survives the shipwreck and is stranded on the volcanic island alone. He finds himself amidst a chaos of rebellion, tyranny and mystic rituals. He must now decide to which side the pendulum of fate will swing. [Deep Silver]… Expand"}, {"name": "Dynasty Warriors: Gundam", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-gundam", "publisher": "Namco Bandai Games", "release_date": "Aug 28 2007", "developers": ["Koei", "Omega Force"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/2f8606c0809465a28f866803f82b4eb7-98.jpg", "descriptions": "(Known as \"Gundam Musou\" in Japan)  In the future, rebel space colonies launch a brutal war for independence with a series of orbital strikes against the Earth. War is reinvented as advanced ECM renders long range sensors and communications virtually useless. In this chaos, a frightening new(Known as \"Gundam Musou\" in Japan)  In the future, rebel space colonies launch a brutal war for independence with a series of orbital strikes against the Earth. War is reinvented as advanced ECM renders long range sensors and communications virtually useless. In this chaos, a frightening new weapon, the Mobile Suit, is born.  Agile, heavily armed and armored - optimized for short range combat with melee attacks and a wide array of weapons, the Mobile Suit is the ultimate instrument in this new age of warfare.  The time has come to pick a side, choose a weapon and prove your supremacy. Dynasty Warriors:GUNDAM takes gamers through an intergalactic conflict where the only hope for survival is to annihilate the encroaching opposing forces. It's a one-versus-many as gamers fight at lightning speed aboard their favorite Mobile Suit, the ultimate weapon of war. Gamers can explore the rich and detailed setting of the Gundam multi-verse from a myriad of perspectives. Assume the role of legendary heroes and villains while strategically enhancing their power, skills, and abilities. Play out the legendary scenes from the rich storyline and marvel at the subtle twists viewed through the eyes of each character. Furthermore, unlock Mobile Suits and Pilots from different Gundam universe time lines while accomplishing secret missions adding limitless replayability. With a variety of game types including Official, Original and Versus Mode, gamers must overcome impossible odds to bring their Mobile Suits to victory. [Namco Bandai / Koei]… Expand"}, {"name": "Obscure: The Aftermath", "details_link": "https://www.metacritic.com/game/playstation-2/obscure-the-aftermath", "publisher": "Ignition Entertainment", "release_date": "Mar 25 2008", "developers": ["Hydravision"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Horror"], "meta_score": 60, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/9dda0a95aac1a4b3a19e4366e5739c10-98.jpg", "descriptions": "(Also known as \"Obscure II\")  Two years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked(Also known as \"Obscure II\")  Two years ago, at Leafmore High, a group of young teenagers were trapped inside their school and hunted by monsters that had been released by the maniac headmaster. Some of them survived that terrible night, while others perished. Now, the survivors have picked up their lives and joined college. But all is not right on Fallcreek University; strange black flowers have suddenly sprung up everywhere on the campus. While experimenting with these flowers in class, a dangerous substance is discovered that induces strange but vivid dreams. But a handful of students find out that there is more to the flowers than anyone could have expected; when the seeds finally germinate, a bad trip suddenly turns into a horrible reality... Features 6 charismatic characters with unique skills; unique coop mode: second player can join in at any time; highly detailed and rich 3D environment; find clues and solve various rddles and mysteries; and a vast variety of weapons and horrifying monsters. [Playlogic]… Expand"}, {"name": "Devil May Cry HD Collection", "details_link": "https://www.metacritic.com/game/playstation-4/devil-may-cry-hd-collection", "publisher": "Capcom", "release_date": "Mar 13 2018", "developers": ["Pipeworks Software", "Inc.", "NeoBards Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/33c4d7d26d867137918752fa3cdee1ef-98.jpg", "descriptions": "Devil May Cry HD Collection brings the first three original Devil May Cry titles; Devil May Cry, Devil May Cry 2, and Devil May Cry 3: Dante's Awakening Special Edition together in one high definition package for the first time."}, {"name": "Luxor: The Wrath of Set", "details_link": "https://www.metacritic.com/game/psp/luxor-the-wrath-of-set", "publisher": "MumboJumbo", "release_date": "Nov 17 2006", "developers": ["MumboJumbo"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/e80128b6ae2ac7c890060090096bef2b-98.jpg", "descriptions": "LUXOR: Wrath of Set is any easily accessible title that features an addictive style of gameplay combined with slick graphics and detailed levels that continue to challenge you as you go. Luxor is an action/puzzler that takes the player on a thrilling adventure across Ancient Egypt. Isis hasLUXOR: Wrath of Set is any easily accessible title that features an addictive style of gameplay combined with slick graphics and detailed levels that continue to challenge you as you go. Luxor is an action/puzzler that takes the player on a thrilling adventure across Ancient Egypt. Isis has enlisted you to battle Set and his evil minions. Use your scarab to shoot and destroy the approaching spheres before they reach the pyramids. Use Isis' magic by catching talismans, gems, and Ankh coins. Featuring a rousing soundtrack and full of exhilarating action, the only question is: Can you thwart Set's diabolical plans? [MumboJumbo]… Expand"}, {"name": "Gardening Mama", "details_link": "https://www.metacritic.com/game/ds/gardening-mama", "publisher": "Majesco Games", "release_date": "Mar 31 2009", "developers": ["Taito Corporation"], "platforms": "DS", "genres": ["Simulation", "Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Virtual", "General", "Career"], "meta_score": 60, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/a2f642764982137d1e199f700e97ff98-98.jpg", "descriptions": "Cooking Mama's stepped out of her kitchen and into nature for some gardening fun! Join Mama from the award-winning, multi-million selling Cooking Mama franchise as she grows, harvests and enjoys the literal fruits of her labor in the first ever gardening game for Nintendo DS. Use the stylusCooking Mama's stepped out of her kitchen and into nature for some gardening fun! Join Mama from the award-winning, multi-million selling Cooking Mama franchise as she grows, harvests and enjoys the literal fruits of her labor in the first ever gardening game for Nintendo DS. Use the stylus as your master garden tool to take care of flowers, fruit trees and vegetables in Mama's garden. Growing live products means that you may experience unexpected results based on your care--flowers can bloom different colors, fruit trees can grow different fruits, etc. Multiple modes of play include: Let's Grow It--Grow many kinds of flowers, fruits and vegetables. Manage your garden as it seeds, blooms fruit, bears fruit and matures. Fertilizer and soil conditions will affect your results. Let's Enjoy It--Produce items from the flowers, fruits and vegetables you have raised (i.e. grow strawberries and make strawberry jam; grow flowers and press them into an album; grow pumpkins to make jack-o-lanterns, etc.)\rLet's Do Gardening--Follow Mama's expert guidance as you decorate various chapel, house and store gardens while making gardening goods like pergolas and hanging baskets, and planting flower beds and trees. Let's Harvest multiplayer--Compete against up to four friends online to harvest fruits and vegetables. The winner harvests the most! Treasure Box--Keep the products you've made from your gardening and trade those creations with friends online. Dress Up--Change Mama's costume and customize your game layout and design. The better your score in the other modes, the nicer items you can earn to customize. [Majesco]… Expand"}, {"name": "Ratatouille", "details_link": "https://www.metacritic.com/game/gamecube/ratatouille", "publisher": "THQ", "release_date": "Jun 26 2007", "developers": ["Asobo Studio"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 60, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/c482f12ef8de0a1bd678888b459c14c3-98.jpg", "descriptions": "Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6 action-packed worlds filled with dangerous enemies, heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down.… Expand"}, {"name": "Toy Soldiers: War Chest", "details_link": "https://www.metacritic.com/game/xbox-one/toy-soldiers-war-chest", "publisher": "Ubisoft", "release_date": "Aug 11 2015", "developers": ["Krome Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Strategy", "General"], "meta_score": 60, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/b0baa059eef609ac4b9bac8da6c0838e-98.jpg", "descriptions": "Leaving the battlefields of past eras behind, players face off against rival toy armies to determine who rules the battlefield."}, {"name": "Legend of the Guardians: The Owls of Ga'Hoole", "details_link": "https://www.metacritic.com/game/xbox-360/legend-of-the-guardians-the-owls-of-gahoole", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 14 2010", "developers": ["Krome Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 60, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/054159a66cdb478fff8e5f5b68ed6f7d-98.jpg", "descriptions": "The game invites kids and fans of the film and the popular Guardians of Ga'Hoole book series to join an unlikely band of heroes as they take on the role of a Guardian, a winged warrior and protector of the owl world, in an epic story of good versus evil. Legend of the Guardians: The Owls ofThe game invites kids and fans of the film and the popular Guardians of Ga'Hoole book series to join an unlikely band of heroes as they take on the role of a Guardian, a winged warrior and protector of the owl world, in an epic story of good versus evil. Legend of the Guardians: The Owls of Ga'Hoole - The Videogame allows players to customize and control their owl on a thrilling journey across mythic terrains… Expand"}, {"name": "Oh...Sir! The Insult Simulator", "details_link": "https://www.metacritic.com/game/playstation-4/ohsir!-the-insult-simulator", "publisher": "Gambitious", "release_date": "May 30 2017", "developers": ["Vile Monarch"], "platforms": ["iPhone/iPad", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Simulation", "General"], "meta_score": 60, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/eeb544d3cc5f2ec86a65f34cbdfd1bba-98.jpg", "descriptions": "The parrot is back from the dead bringing countless new insults for your disposal, Sir! Remember that silly game that parted lovers, destroyed families and turned friends into enemies? Here’s its console incarnation."}, {"name": "Magicka: Vietnam", "details_link": "https://www.metacritic.com/game/pc/magicka-vietnam", "publisher": "Paradox Interactive", "release_date": "Apr 12 2011", "developers": ["Arrowhead Game Studios"], "platforms": "PC", "genres": ["Fantasy", "Action Adventure", "General", "Fantasy", "Linear"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/2350741fea0f88e572093d2874523954-98.jpg", "descriptions": "Magicka: Vietnam delivers over-the-top action as players take on the role of four meek and physically inept wizards as they try to do what so many 80’s action stars have done in the past: blow stuff up."}, {"name": "Risen 2: Dark Waters", "details_link": "https://www.metacritic.com/game/xbox-360/risen-2-dark-waters", "publisher": "Deep Silver", "release_date": "Jul 31 2012", "developers": ["Piranha Bytes"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/7bc9b225adeb9dcdfa1da5a95075adf5-98.jpg", "descriptions": "Set several years after the end of Risen, raging titans have devastated the world and pushed humanity to the brink of existence. Subsequently, monstrous creatures have risen from the watery depths of the sea and their attacks have brought all seafaring to a grinding halt. The hero, now aSet several years after the end of Risen, raging titans have devastated the world and pushed humanity to the brink of existence. Subsequently, monstrous creatures have risen from the watery depths of the sea and their attacks have brought all seafaring to a grinding halt. The hero, now a member of the Inquisition, is sent out to find out how to stop the chaos caused by these creatures from the deep.  His quest begins with rumors that the pirates who frequent the southern islands are the only ones who know a way to get rid of the creatures once and for all and end their reign of terror.… Expand"}, {"name": "Rave Master", "details_link": "https://www.metacritic.com/game/gamecube/rave-master", "publisher": "Konami", "release_date": "Mar  8 2005", "developers": ["Konami"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/8308c7899f5748f4d682eb6eebeb8073-98.jpg", "descriptions": "Now you can fight as your favorite character from Rave Master, the animated series. In Rave Master, you must defeat your enemies with your arsenal of weapons, attack combos, and special moves. The game features single-player challenges, a story edit mode, and a four-player versus mode.Now you can fight as your favorite character from Rave Master, the animated series. In Rave Master, you must defeat your enemies with your arsenal of weapons, attack combos, and special moves. The game features single-player challenges, a story edit mode, and a four-player versus mode. Immerse yourself in the visual and audio effects taken directly from the animated show.… Expand"}, {"name": "Sonic Rivals 2", "details_link": "https://www.metacritic.com/game/psp/sonic-rivals-2", "publisher": "Sega", "release_date": "Nov 13 2007", "developers": ["Backbone Entertainment"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Driving", "Racing", "Arcade", "On-foot", "Other", "On-foot"], "meta_score": 60, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/558d1104bf23583baf09d0c54ccd658f-98.jpg", "descriptions": "The gloves are off and Sonic and his rivals are gearing up for an intense head-to-head competition exclusively on the PSP. This sequel to Sonic’s 2D action platformer features all-new \"jostling\" controls for tighter competition and a brand new Battle mode that allows you and a friend to jumpThe gloves are off and Sonic and his rivals are gearing up for an intense head-to-head competition exclusively on the PSP. This sequel to Sonic’s 2D action platformer features all-new \"jostling\" controls for tighter competition and a brand new Battle mode that allows you and a friend to jump into six different Multiplayer challenges by sharing one disc. With three new characters, 12 new stages and upgraded signature moves for each character, the enhanced Rivals experience brings a whole new level of handheld fun to the PSP system. Battle Mode: Select from six ways to thrash your rival buddies: Knockout, Ring Battle, Race, King of the Hill, Capture the Chao, and Tag. Single Disc Game Sharing: Grab a friend and jump into the Multiplayer action with just a single disc using the Wi-Fi function. New Storyline. The Chao seem to be disappearing and all eight rivals must work fast to find out who is behind it. Three New Playable Characters: Miles “Tails” Prower and two other new characters round out the cast of eight rivals. Free Play Mode: Free from rivalry, experience the game in old-school Sonic-style. In this Single-player mode, you can enjoy the challenging map at your own pace. Expanded Card Collection: Collect 150 new cards for loads of new options to customize your playable characters. [Sega]… Expand"}, {"name": "Fight Crab", "details_link": "https://www.metacritic.com/game/pc/fight-crab", "publisher": "Playism", "release_date": "Jul 29 2020", "developers": ["Nussoft", "Calappa Games"], "platforms": ["Switch", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/8d0b8d8ce777fdbf41d6d0205dd267c1-98.jpg", "descriptions": "Welcome to Fight Crab. A new 3D action game where you take control of a crab, and fight off other giant enemy crabs. Physics allows for crabs to move powerfully and quickly in this hardcore battle arena. Freely control your pincers to use weapons and develop your own crab fighting style."}, {"name": "Rory McIlroy PGA Tour", "details_link": "https://www.metacritic.com/game/xbox-one/rory-mcilroy-pga-tour", "publisher": "EA Sports", "release_date": "Jul 14 2015", "developers": ["EA Tiburon"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Traditional", "Sports", "Individual", "Golf", "Sim"], "meta_score": 60, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/ea8a09fc8d058f417e76c589cb42fba6-98.jpg", "descriptions": "Gameplay offers multiple ways to play, including arcade controls where the left stick is used to control power and accuracy, with the ability to add spin to the shot while the ball is in the air. In addition to the arcade controls, the return of 3-Click swings appeals to nostalgic gamers whoGameplay offers multiple ways to play, including arcade controls where the left stick is used to control power and accuracy, with the ability to add spin to the shot while the ball is in the air. In addition to the arcade controls, the return of 3-Click swings appeals to nostalgic gamers who prefer to set power and accuracy by tapping a button rather than moving a thumbstick. Those looking for an extra challenge can turn on Tour settings. When playing with Tour controls, the length of your backswing and speed of your follow through determine power, while the club path through the ball will be the most important factor in accounting for accuracy. Fans can also mix and match all three settings to create their own custom gameplay style. Courses themselves also affect how your shots are played, as firmer, links-style courses like St. Andrews provides more bounce and roll, while softer courses such as TPC Sawgrass have less bounce and be more receptive to spin. [EA Sports]… Expand"}, {"name": "Magic: Duels of the Planeswalkers 2015", "details_link": "https://www.metacritic.com/game/pc/magic-duels-of-the-planeswalkers-2015", "publisher": "Wizards of the Coast", "release_date": "Jul 16 2014", "developers": ["Wizards of the Coast"], "platforms": ["iPhone/iPad", "Xbox 360", "Xbox One", "PC"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle"], "meta_score": 60, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/6/14c7ce8ac0f55abb8864d7be225f385f-98.jpg", "descriptions": "Track down bigger game on a bold new adventure with Magic 2015—Duels of the Planeswalkers. Command powerful creatures and wield devastating spells to defeat your opponents in this game of strategy. Hone your skills as you battle your way across the planes of the Multiverse. Beware though,Track down bigger game on a bold new adventure with Magic 2015—Duels of the Planeswalkers. Command powerful creatures and wield devastating spells to defeat your opponents in this game of strategy. Hone your skills as you battle your way across the planes of the Multiverse. Beware though, Planeswalker. Your biggest danger lies ahead. Garruk Wildspeaker, the greatest hunter known, has fallen under the curse of the Chain Veil. He now mercilessly stalks his own kind. Find him and stop him ... before he finds you.… Expand"}, {"name": "Batman: Arkham Origins Blackgate - Deluxe Edition", "details_link": "https://www.metacritic.com/game/pc/batman-arkham-origins-blackgate---deluxe-edition", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  1 2014", "developers": ["Armature Studio"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Fantasy", "", "Metroidvania"], "meta_score": 60, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/78c177c47aa74198786b7c08906fb396-98.jpg", "descriptions": "Blackgate Prison Is Under New Management\r Batman: Arkham Origins Blackgate - Deluxe Edition amplifies the 2.5-D game with new maps, enemy encounters, difficulty levels, batsuits, and enhanced visuals. A companion game to Batman: Arkham Origins, players can continue the storyline of theBlackgate Prison Is Under New Management\r Batman: Arkham Origins Blackgate - Deluxe Edition amplifies the 2.5-D game with new maps, enemy encounters, difficulty levels, batsuits, and enhanced visuals. A companion game to Batman: Arkham Origins, players can continue the storyline of the console version and discover more details of the Dark Knights past. Featuring stealth gameplay, free-flow combat, and Batmans famed arsenal of gadgets, the genuine Arkham experience is reproduced in a deep, action packed side-scrolling adventure.… Expand"}, {"name": "Crash: Mind Over Mutant", "details_link": "https://www.metacritic.com/game/xbox-360/crash-mind-over-mutant", "publisher": "Activision", "release_date": "Oct  7 2008", "developers": ["Radical Entertainment"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/f63a780273040b4ab16ff574d3baf46c-98.jpg", "descriptions": "In Crash Bandicoot: Mind over Mutant, a rejuvenated Neo Cortex is taking over the world one brain at a time!  Cortex and N. Brio devise a new kind of evil - a text-messaging, do-anything device which controls both mutant and bandicoot minds. Armed with his quick-wits and lightening agility,In Crash Bandicoot: Mind over Mutant, a rejuvenated Neo Cortex is taking over the world one brain at a time!  Cortex and N. Brio devise a new kind of evil - a text-messaging, do-anything device which controls both mutant and bandicoot minds. Armed with his quick-wits and lightening agility, Crash must free his friends, the titans and save the day. Not only does Crash gain the ability to control his enemies when he jacks them – now he can store his favorite monsters in his pocket, upgrade them and utilize their powers when they are most advantageous. Wumpa Island  becomes a \"free-romping\" environment, allowing players to travel and explore through intersecting worlds, with different gameplay options available depending on what creature you've brought along for the ride. Your co-op partner is Crash's sister, Coco, playable for the first time in the cooperative mode. Not only does Coco make the game that much more inviting for girls to pick up and play, she also brings with her a new tactile \"treasure hunt\" ability. [Sierra Entertainment]… Expand"}, {"name": "Shaun White Snowboarding", "details_link": "https://www.metacritic.com/game/xbox-360/shaun-white-snowboarding", "publisher": "Ubisoft", "release_date": "Nov 16 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "16  Online", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 60, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/604578e68548d06529d1989512db133a-98.jpg", "descriptions": "Developed in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride. OpenDeveloped in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride. Open World Mountains: Choose how you ride in open-world mountains across the world. Conquer extreme peak conditions, create your own paths in the back country, or compete with fellow riders in the terrain parks. Your Friends Are Always Around: Play in a world where your friends are always around. Do your own runs on mountains populated by real gamers, or join your friends for a quick session from any mountain. More than Just Snowboarding: Have fun with your friends on and off the board! Throw snowballs, hike to access secret spots, film your friends doing ripping tricks. You can also upload your videos online to share with the world. Ride Your Way: Express yourself through tricks, riding styles, and highly customizable avatars – both in single-player and in the online world. Use the intuitive dual analog control to pull off a huge variety of tricks that express your style. Next-Gen Technology: Built on the Assassin's Creed engine, this game creates a massive world with gorgeous visuals and realistic NPC interactions. This is also the first time a snowboarding game is completely driven by physics instead of animation. Authentic Snowboarding: Ubisoft has worked closely with Shaun White to infuse the gaming experience with authenticity, personality and humor. Shaun is a friend and mentor in the game, and will help you with your skills. And, if you are deemed worthy, you may even be able to play as Shaun in the game. [Ubisoft]… Expand"}, {"name": "Agatha Christie: Murder on the Orient Express", "details_link": "https://www.metacritic.com/game/pc/agatha-christie-murder-on-the-orient-express", "publisher": "DreamCatcher Interactive", "release_date": "Nov 21 2006", "developers": ["AWE Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/ee90014999f5ff18da95283f9b5f686c-98.jpg", "descriptions": "Agatha Christie: Murder on the Orient Express beckons travelers to climb aboard a luxury train and become part of a murder mystery where the player and Hercule Poirot must rely on their superior detective skills to find the killer in a heinous murder.  The game remains true to the style andAgatha Christie: Murder on the Orient Express beckons travelers to climb aboard a luxury train and become part of a murder mystery where the player and Hercule Poirot must rely on their superior detective skills to find the killer in a heinous murder.  The game remains true to the style and tone of the novel, but a surprising new ending will keep players at the edge of their seats.  Agatha Christie fans will be delighted to know that Actor David Suchet will play the vocal role of Belgian Detective Hercule Poirot – a role Suchet made famous through his well-known portrayals of the character in an array of television appearances over the past 20 years. [DreamCatcher Interactive]… Expand"}, {"name": "True Crime: New York City", "details_link": "https://www.metacritic.com/game/xbox/true-crime-new-york-city", "publisher": "Activision", "release_date": "Nov 15 2005", "developers": ["Exakt"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 60, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/93dc7f89d87163becf8392b12446922d-98.jpg", "descriptions": "Be a good cop or a bad cop in the streetwise action game True Crime: New York City. You can explore the authentically modeled streets of New York City as a police officer tracking down criminals and administering justice. The game features a diverse weapon set, as well as a mixed offering ofBe a good cop or a bad cop in the streetwise action game True Crime: New York City. You can explore the authentically modeled streets of New York City as a police officer tracking down criminals and administering justice. The game features a diverse weapon set, as well as a mixed offering of fighting styles that you can use to take out those who stand in your way. In addition to combat on foot, the game features driving sequences and shootouts. Laurence Fishburne, Christopher Walken, and Mickey Rourke contribute their voice talent to the game as well.… Expand"}, {"name": "Captain America: Super Soldier", "details_link": "https://www.metacritic.com/game/xbox-360/captain-america-super-soldier", "publisher": "Sega", "release_date": "Jul 19 2011", "developers": ["Next Level Games"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/f2f0167f155ebb96c2cc76a1b7044294-98.jpg", "descriptions": "Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once,Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once, deflecting incoming fire back at enemies, solving puzzles, and scaling walls. Players will be able to launch shield-first into the fray with the superior force of the world's first Super-Soldier at their fingertips and they'll need every bit of that strength to overcome a castle that's both an acrobatic playground for the Captain's physical prowess and a house of mystery with enemies and danger at every turn.… Expand"}, {"name": "Star Wars Trilogy: Apprentice of the Force", "details_link": "https://www.metacritic.com/game/game-boy-advance/star-wars-trilogy-apprentice-of-the-force", "publisher": "Ubisoft", "release_date": "Sep 21 2004", "developers": ["Ubisoft"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/c08776d0ce00ec227910e203b9c7b539-98.jpg", "descriptions": "For the first time, the Star Wars movie trilogy arrives on the Game Boy Advance. Now you can experience the most memorable scenes from the first three Star Wars movies: A New Hope, The Empire Strikes Back, and Return of the Jedi. Follow Luke as he becomes a Jedi, fights Darth Vader and BobaFor the first time, the Star Wars movie trilogy arrives on the Game Boy Advance. Now you can experience the most memorable scenes from the first three Star Wars movies: A New Hope, The Empire Strikes Back, and Return of the Jedi. Follow Luke as he becomes a Jedi, fights Darth Vader and Boba Fett, escapes from the rancor beast, and destroys the Death Star. In both single- and multiplayer modes, you can discover Jedi abilities and powers, ride a variety of vehicles, and more.… Expand"}, {"name": "Wars and Warriors: Joan of Arc", "details_link": "https://www.metacritic.com/game/pc/wars-and-warriors-joan-of-arc", "publisher": "Enlight Software", "release_date": "Feb  7 2004", "developers": ["Enlight Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 60, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/656f47e47528252d6a091ce887247ebf-98.jpg", "descriptions": "Play as Joan of Arc. Live out the most exciting years in the life of Joan of Arc, the ultimate female warrior, in the ultimate epic battles! As you progress through her campaigns, other great military medieval leaders will join your cause and bring their own unique fighting abilities andPlay as Joan of Arc. Live out the most exciting years in the life of Joan of Arc, the ultimate female warrior, in the ultimate epic battles! As you progress through her campaigns, other great military medieval leaders will join your cause and bring their own unique fighting abilities and characteristics into the fray. Fight Epic Battles. Orchestrate your troops through eight massive maps featuring formidable strongholds, lavishly detailed cities and myriad landscapes, from rolling hills to thick forests and flowing rivers. Experience firsthand the sheer intensity and savage brutality of medieval castle sieges brought to life in amazing lifelike 3D. Engage in Intense Action Fighting. Slash and slay enemies from a thrilling third-person perspective view. Wield the sword to your advantage by executing unique combo attacks with perfect timing to devastate the enemy. Acquire New Weapons. Train yourself to master new fighting techniques to unleash your full fighting capabilities, then acquire an increasingly devastating arsenal of weaponry to overwhelm your foes. [Enlight Software]… Expand"}, {"name": "Adventure Pinball: Forgotten Island", "details_link": "https://www.metacritic.com/game/pc/adventure-pinball-forgotten-island", "publisher": "Electronic Arts", "release_date": "Mar 21 2001", "developers": ["Digital Extremes"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/60e0c8bb9f39e3984f6db856528cc3d8-98.jpg", "descriptions": "Electronic Arts utilizes the Unreal 3-D game engine, wild animation, and quick camera movements to create a pinball game unlike anything you've seen before."}, {"name": "Zombie Revenge", "details_link": "https://www.metacritic.com/game/dreamcast/zombie-revenge", "publisher": "Sega", "release_date": "Dec 31 1999", "developers": ["Sega"], "platforms": "Dreamcast", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 60, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/779b0d2c61b5ca224fc1f1ae009aaee0-98.jpg", "descriptions": "It takes both firepower and fist-power to wipe out the ultimate army: a legion of hideous, killer Zombies. Beat these bio-engineered super-warriors, and save the country from their horror."}, {"name": "The Caligula Effect: Overdose", "details_link": "https://www.metacritic.com/game/switch/the-caligula-effect-overdose", "publisher": "NIS America", "release_date": "Mar 12 2019", "developers": ["Engine Software", "Aquria"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/e33e78e5fbb65d264b30d2fff717ecde-98.jpg", "descriptions": "Mobius. An idyllic world that exists for the sake of letting people forget about the pain and problems of reality. In this world created by a sentient virtual idol, μ (Mu), reality and fantasy has become blurred, allowing people to relive their high school years in bliss. Yet in thisMobius. An idyllic world that exists for the sake of letting people forget about the pain and problems of reality. In this world created by a sentient virtual idol, μ (Mu), reality and fantasy has become blurred, allowing people to relive their high school years in bliss. Yet in this seemingly beautiful and perfect world, something is amiss. Escape from this false paradise with your fellow students and return to reality in The Caligula Effect: Overdose.… Expand"}, {"name": "GoldenEye: Rogue Agent", "details_link": "https://www.metacritic.com/game/playstation-2/goldeneye-rogue-agent", "publisher": "EA Games", "release_date": "Nov 22 2004", "developers": ["EA LA"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/8d9e26affedc2844b6bea3fbb1e2480a-98.jpg", "descriptions": "As an aspiring 00 agent dismissed from MI6 for reckless brutality, the player is hired as an enforcer by Auric Goldfinger, the wealthy super-villain with a lust for all things gold. Goldfinger is locked in a ruthless war against his archenemy, the brilliant scientist Dr. No. The prize isAs an aspiring 00 agent dismissed from MI6 for reckless brutality, the player is hired as an enforcer by Auric Goldfinger, the wealthy super-villain with a lust for all things gold. Goldfinger is locked in a ruthless war against his archenemy, the brilliant scientist Dr. No. The prize is control of the world's greatest criminal organization. A brutal encounter with Dr. No costs the player an eye, but Goldfinger's technicians replace it with a gold-hued, synthetic eye, earning the player the name 'GoldenEye'. Players have the ability to customize and upgrade their villain persona and wreak havoc as they make their unrelenting rise through the ranks. Players will cross paths with such legendary allies and enemies as Oddjob, Scaramanga, Xenia Onatopp, and, of course, Pussy Galore on globe-spanning missions of vengeance and demolition. Players will travel to famous and original Bond locations from the mountains of Switzerland to the streets of Hong Kong and from Fort Knox to Dr. No's Crab Key lair in the Caribbean. Enemies will react intelligently in combat situations and use the environment to their advantage for intense and unpredictable shootouts. [Electronic Arts]… Expand"}, {"name": "PokePark 2: Wonders Beyond", "details_link": "https://www.metacritic.com/game/wii/pokepark-2-wonders-beyond", "publisher": "Nintendo", "release_date": "Feb 27 2012", "developers": ["Creatures Inc."], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 60, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/0860250f0532deeb6151e51205676bbe-98.jpg", "descriptions": "Now you can play as Pikachu, Oshawott, Snivy, or Tepig in Pokepark 2: Wonders Beyond."}, {"name": ".hack//G.U. vol. 3//Redemption", "details_link": "https://www.metacritic.com/game/playstation-2/hackgu-vol-3redemption", "publisher": "Namco Bandai Games America", "release_date": "Sep 10 2007", "developers": ["CyberConnect2"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 60, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/a9180a125ea8ebf5f7cfd1862ba87075-98.jpg", "descriptions": "Continuing where the second installment left off, in .hack//G.U. Vol. 3: Redemption Haseo discovers that old enemies have returned and some friends have turned against him. And with the mysterious evil that once lurked only within the confines of the MMO now causing havoc in the real world,Continuing where the second installment left off, in .hack//G.U. Vol. 3: Redemption Haseo discovers that old enemies have returned and some friends have turned against him. And with the mysterious evil that once lurked only within the confines of the MMO now causing havoc in the real world, Haseo and his friends must overcome impending doom and restore balance to both realities. In .hack//G.U. Vol. 3: Redemption, players can utilize an enhanced battle system in which both Haseo and his Avatar Skeith will evolve into new forms to utilize more powerful attacks. Haseo can also obtain a new Awakening mode to deliver extreme damage to enemies.  Having so much more power isn’t fun if you can’t share it! Players can now choose from 22 unique characters to join Haseo's party, explore two new towns, and conquer two new dungeons.  With new enemies, more steam bike parts and steam bike missions, new cards for the popular Crimson VS card battle game, and the final tier of the Arena Battles, players won’t want to log out of .hack//G.U. Vol. 3: Redemption. [Namco Bandai Games]… Expand"}, {"name": "The Peanuts Movie: Snoopy's Grand Adventure", "details_link": "https://www.metacritic.com/game/xbox-one/the-peanuts-movie-snoopys-grand-adventure", "publisher": "Activision", "release_date": "Nov  3 2015", "developers": ["Activision", "Behaviour Interactive"], "platforms": ["3DS", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/c1ec3c7808d8cbd2085cc16625cdc8ef-98.jpg", "descriptions": "In The Peanuts Movie: Snoopy’s Grand Adventure, Snoopy explores the fantastical worlds of his imagination to track down Charlie Brown and his friends in an intricate game of hide-and-seek."}, {"name": "The Complex", "details_link": "https://www.metacritic.com/game/playstation-4/the-complex", "publisher": "Wales Interactive", "release_date": "Mar 31 2020", "developers": ["Wales Interactive"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 60, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/68017ada51ac231ad207532835a2b756-98.jpg", "descriptions": "The Complex is an interactive sci-fi thriller movie from the publishers of Late Shift and The Bunker. After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. Your actions and your relationship with otherThe Complex is an interactive sci-fi thriller movie from the publishers of Late Shift and The Bunker. After a major bio-weapon attack on London, two scientists find themselves in a locked-down laboratory with time, and air, running out. Your actions and your relationship with other characters will lead you to one of eight suspenseful endings.… Expand"}, {"name": "The Spiderwick Chronicles", "details_link": "https://www.metacritic.com/game/ds/the-spiderwick-chronicles", "publisher": "Sierra Entertainment", "release_date": "Feb  5 2008", "developers": ["Stormfront Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "Console-style RPG", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/195ba66a3fa52ee00308e40ee643de15-98.jpg", "descriptions": "The Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon andThe Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon and Mallory Grace, putting gamers in their shoes as they discover a hidden world of fantastical creatures - sprites, ogres, goblins, brownies and more. [Sierra Entertainment]… Expand"}, {"name": "James Cameron's Avatar: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/james-camerons-avatar-the-game", "publisher": "Ubisoft", "release_date": "Dec  1 2009", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 60, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/eda51e236f00e4dd2e3771e0e1324611-98.jpg", "descriptions": "Based on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video gamesBased on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video games before. When conflict erupts between the RDA Corporation, a space-faring consortium in search of valuable resources, and the Na'vi, players find themselves thrust into a fight for the heart of a planet and the fate of a civilization. [Ubisoft]… Expand"}, {"name": "Zoo Tycoon 2 DS", "details_link": "https://www.metacritic.com/game/ds/zoo-tycoon-2-ds", "publisher": "THQ", "release_date": "Feb  4 2008", "developers": ["Altron"], "platforms": ["PC", "DS"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 60, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/676244fe3d1d503dabab1ea06a3626b3-98.jpg", "descriptions": "In Zoo Tycoon 2 DS, players create the zoo of their dreams while collecting and caring for their favorite animals from every continent. The game features three game modes including Zoo Designer Mode, Zoo Director Mode and all new Zookeeper Mode which gives players the ability to view andIn Zoo Tycoon 2 DS, players create the zoo of their dreams while collecting and caring for their favorite animals from every continent. The game features three game modes including Zoo Designer Mode, Zoo Director Mode and all new Zookeeper Mode which gives players the ability to view and care for three-dimensional versions of animals. Zoo Tycoon 2 DS also features new animals and environments, as well as complete use of the touch screen and DS Stylus for all zoo activities, ranging from zoo construction to purchasing animals. Players can also exchange zoo data with friends via multicard play and compete to see who can build the best zoo. [THQ]… Expand"}, {"name": "Sheltered 2", "details_link": "https://www.metacritic.com/game/pc/sheltered-2", "publisher": "Team17", "release_date": "Sep 21 2021", "developers": ["Unicube"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 60, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/9/88c19cda04587c2a5ba6522006b04fd2-98.jpg", "descriptions": "It's been twenty years since the world as we knew it ended. The last of humanity splintered into opposing factions. Will you unite or conquer?Building upon the original 2015 fan-favourite, Sheltered 2 brings new challenges and deeper strategic gameplay. You are tasked with creating aIt's been twenty years since the world as we knew it ended. The last of humanity splintered into opposing factions. Will you unite or conquer?Building upon the original 2015 fan-favourite, Sheltered 2 brings new challenges and deeper strategic gameplay. You are tasked with creating a leader and building up your faction whilst managing resources and tackling threats both natural and human. Everything from starvation and dehydration to radiation poisoning and enemy raids can prove fatal.Sheltered 2's new Factions system is pivotal to a base's success. Send out expeditions to explore the vast wasteland and forge relationships, or bitter rivalries with other camps. Trade resources to grow and thrive together; or go head-to-head with rivals in an expanded combat system and grow your foothold in the wasteland. Will you ally with or dominate the other factions?… Expand"}, {"name": "Cooking Mama 5: Bon Appetit!", "details_link": "https://www.metacritic.com/game/3ds/cooking-mama-5-bon-appetit!", "publisher": "Majesco Games", "release_date": "Sep 16 2014", "developers": ["Cooking Mama Limited"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Miscellaneous", "General", "Virtual", "Career"], "meta_score": 60, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/5aa52c06c9a72eb5613942265b5ae86a-98.jpg", "descriptions": "Nothing Tastes like Mama's Home Cooking. The original kitchen diva that created the cooking genre is set to school you with 60 brand new mouth-watering recipes and over 30 household mini-games. Cook your way through classic fare, exotic cultural dishes and sweet treats to delight the palate.Nothing Tastes like Mama's Home Cooking. The original kitchen diva that created the cooking genre is set to school you with 60 brand new mouth-watering recipes and over 30 household mini-games. Cook your way through classic fare, exotic cultural dishes and sweet treats to delight the palate. Stylus-based activities will keep you busy around the house and prove to Mama that you've got the culinary chops to play in her kitchen.… Expand"}, {"name": "Helix", "details_link": "https://www.metacritic.com/game/wii/helix", "publisher": "Ghostfire Games", "release_date": "Aug 25 2008", "developers": ["Ghostfire Games"], "platforms": "Wii", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 60, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/d0dbd02681ebcac2892336ce3eed895a-98.jpg", "descriptions": "[WiiWare]  Helix is an innovative music-rhythm game designed for the Wii console. Use the Wii Remote controller to do dozens of exciting moves, including punches, circles, back fists, hooks and more. Be mesmerized by the eye-popping background visuals, which pulse to the beat of the music.[WiiWare]  Helix is an innovative music-rhythm game designed for the Wii console. Use the Wii Remote controller to do dozens of exciting moves, including punches, circles, back fists, hooks and more. Be mesmerized by the eye-popping background visuals, which pulse to the beat of the music. Enjoy incredible replay value with 26 songs to play and three difficulty levels. Try to unlock all of the songs. This game is great for getting exercise plus having fun. No buttons are required, so it's easy for anyone to pick up but difficult for even the best players to master. [Nintendo]… Expand"}, {"name": "Yu-Gi-Oh! GX Tag Force 2", "details_link": "https://www.metacritic.com/game/psp/yu-gi-oh!-gx-tag-force-2", "publisher": "Konami", "release_date": "Sep 18 2007", "developers": ["Konami"], "platforms": "PSP", "num_players": "Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 60, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/ec343c21d549fa32c78e4a3259a2589b-98.jpg", "descriptions": "A new year at the Duel Academy has begun and the Tag Duel Tournament is the year's most anticipated event. Champion duelists from all around the world have accepted invitations to this tournament. Explore the Duel Academy and find your perfect partner to combine your decks to become anA new year at the Duel Academy has begun and the Tag Duel Tournament is the year's most anticipated event. Champion duelists from all around the world have accepted invitations to this tournament. Explore the Duel Academy and find your perfect partner to combine your decks to become an unstoppable fighting machine! [Konami]… Expand"}, {"name": "King Arthur", "details_link": "https://www.metacritic.com/game/gamecube/king-arthur", "publisher": "Konami", "release_date": "Nov 18 2004", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/1c899d95c5cf599c51432a95e48fb4e7-98.jpg", "descriptions": "Live the true story behind the epic legend of King Arthur and the Knights of the Round Table. Based on the King Arthur movie from producer Jerry Bruckheimer, the King Arthur game lets you take control of one of five heroes, including Arthur, Lancelot, and Guinevere, each with unique weaponsLive the true story behind the epic legend of King Arthur and the Knights of the Round Table. Based on the King Arthur movie from producer Jerry Bruckheimer, the King Arthur game lets you take control of one of five heroes, including Arthur, Lancelot, and Guinevere, each with unique weapons and skills. With three modes of battle, motion-captured fighting sequences and moves, and cutscenes from the film, King Arthur re-creates the events of this legendary tale.… Expand"}, {"name": "Monster House", "details_link": "https://www.metacritic.com/game/gamecube/monster-house", "publisher": "THQ", "release_date": "Jul 18 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/26dc69b71e69fada5520493a925b3de0-98.jpg", "descriptions": "Oh no! Old man Nebbercracker's house is eating anything and anyone who gets near it, and Halloween is almost here! So grab your Water Blaster, gather up your courage, and get ready to explore the Monster House™ to find out its secrets."}, {"name": "GoldenEye: Rogue Agent", "details_link": "https://www.metacritic.com/game/gamecube/goldeneye-rogue-agent", "publisher": "EA Games", "release_date": "Nov 22 2004", "developers": ["EA LA"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "2  Online", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/54c9647985ed68ce6e306d256f5846fc-98.jpg", "descriptions": "Why save the world when you can rule it? GoldenEye: Rogue Agent transports you to the dark side of the Bond universe as an aspiring 00 agent dismissed from MI6 for reckless brutality. You can customize and upgrade your villain persona and wreak havoc as you make your unrelenting rise throughWhy save the world when you can rule it? GoldenEye: Rogue Agent transports you to the dark side of the Bond universe as an aspiring 00 agent dismissed from MI6 for reckless brutality. You can customize and upgrade your villain persona and wreak havoc as you make your unrelenting rise through the ranks. You'll cross paths with such legendary allies and enemies as Oddjob, Scaramanga, Xenia Onatopp, and Pussy Galore on worldwide missions of vengeance and demolition. GoldenEye: Rogue Agent integrates single-player and multiplayer split-screen across all game modes.… Expand"}, {"name": "AC/DC Live: Rock Band Track Pack", "details_link": "https://www.metacritic.com/game/playstation-3/acdc-live-rock-band-track-pack", "publisher": "Electronic Arts", "release_date": "Nov  2 2008", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 60, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/eaaabd2abbbd892c098b2f068e7e9c28-98.jpg", "descriptions": "This exclusive deal marks the first time ever the band has included an entire album for video game play, with 18 live tracks from their prolific live performances becoming available in one electrifying, standalone game. The AC/DC LIVE: Rock Band Track Pack allows players to experience thisThis exclusive deal marks the first time ever the band has included an entire album for video game play, with 18 live tracks from their prolific live performances becoming available in one electrifying, standalone game. The AC/DC LIVE: Rock Band Track Pack allows players to experience this amazing set list with Rock Band, Rock Band 2 or other compatible music game peripherals. AC/DC LIVE: Rock Band Track Pack features the master recordings from the best of the band’s live performances. The live recording was specially remixed for Rock Band by Mike Fraser. The game features 18 tracks, with more than 99 minutes of game play for each instrument. All tracks from the AC/DC LIVE: Rock Band Track Pack are also available for play in Rock Band and Rock Band 2 by entering a special export authentication code for the Xbox 360 and PS3 versions. [Harmonix]… Expand"}, {"name": "Defiance", "details_link": "https://www.metacritic.com/game/xbox-360/defiance", "publisher": "Trion Worlds", "release_date": "Apr  2 2013", "developers": ["Trion Worlds"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Sci-Fi", "Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/347a6e3e8594fd05e2285fdc45b0de2e-98.jpg", "descriptions": "Arktech. Some will die for it – everyone kills for it. Join a futuristic online open-world shooter where thousands of players scour a transformed Earth competing for alien technology. Hunt alone or with other people as you improve your skills and level up unlocking powerful weapons that helpArktech. Some will die for it – everyone kills for it. Join a futuristic online open-world shooter where thousands of players scour a transformed Earth competing for alien technology. Hunt alone or with other people as you improve your skills and level up unlocking powerful weapons that help you survive the massive battles that await you. Defiance is the first multiplatform shooter MMO which interconnects with a global television program by cable channel Syfy.… Expand"}, {"name": "Fatal Frame: Maiden of Black Water", "details_link": "https://www.metacritic.com/game/xbox-series-x/fatal-frame-maiden-of-black-water", "publisher": "Koei Tecmo Games", "release_date": "Oct 28 2021", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Wii U", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 60, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/a2b92b6b31c57a743d5f5ec4242c0181-98.jpg", "descriptions": "The Fatal Frame series lives again!\r Fatal Frame: Maiden of Black Water is comprised of three interconnected stories that converge to uncover the truth behind a recent string of tragic deaths in a forest marred by a history of suicides. As one of three people with the power of the CameraThe Fatal Frame series lives again!\r Fatal Frame: Maiden of Black Water is comprised of three interconnected stories that converge to uncover the truth behind a recent string of tragic deaths in a forest marred by a history of suicides. As one of three people with the power of the Camera Obscura and the ability to see the shadows of those spirited away, youll explore the ruins of an eerie inn, a shrine filled with life-size dolls, and a lake full of dead priestesses. Each shadowy location is connected by a stream of water flowing throughout the mountain, and this once holy water is tied to the darkest mystery of allthe history of death and darkness on Mt. Hikami.\r Features:\r *    Survive this horrifying new entry in the Fatal Frame series\r*    Explore sinister locales like an underground cave for human sacrifices and a shrine for life-sized dolls\r*    Use the Wii U GamePad controller as your Camera Obscurayour only defense against fatal ghosts\r*    Mt. Hikami is coursing with inexplicably dangerous water; stay dry or die\r*    Investigate and stay alive on the deadly Mt. Hikami… Expand"}, {"name": "The Town of Light", "details_link": "https://www.metacritic.com/game/xbox-one/the-town-of-light", "publisher": "Wired Productions", "release_date": "Jun  6 2017", "developers": ["LKA Interactive", "LKA"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/0675eda77a9f946fdf66fb712ee8650f-98.jpg", "descriptions": "Journey through the eyes of Renée, a 16-year-old girl who suffers from the symptoms of mental illness. She is searching for answers to the many questions from her past, while exploring the place where she spent most of her youth. Guide Renée through a dark and emotional journey where theJourney through the eyes of Renée, a 16-year-old girl who suffers from the symptoms of mental illness. She is searching for answers to the many questions from her past, while exploring the place where she spent most of her youth. Guide Renée through a dark and emotional journey where the lines between entertainment, storytelling, and reality blur.… Expand"}, {"name": "Puzzle Scape", "details_link": "https://www.metacritic.com/game/psp/puzzle-scape", "publisher": "Got Game Entertainment", "release_date": "Jun 18 2007", "developers": ["Farmind Ltd"], "platforms": "PSP", "num_players": "1-8 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/5f75e998b53417fe36f653eba6dc6a0c-98.jpg", "descriptions": "Players arrange blocks of different colors into chains that are exploded by 2x2 same colored blocks. Eliminating the blocks creates level-ups and the player can gather a variety of power-ups by creating long chains. Level-ups introduce new elements into visually amazing backgroundPlayers arrange blocks of different colors into chains that are exploded by 2x2 same colored blocks. Eliminating the blocks creates level-ups and the player can gather a variety of power-ups by creating long chains. Level-ups introduce new elements into visually amazing background landscapes. Game mode defines the rules of the game. In architect mode, the player tries to build objectives as fast as possible, and in artist mode, the goal is to play for survival and high score. In artist mode, the scenery is built according to how gamers play Puzzle Scape, while the architect mode has pre-defined objectives. There are four different themes: cells, flowers, machines and dreams. Both single player-modes can be played in cooperation or in Duel mode over wireless connection. Puzzle Scape also features up to eight-player multiplayer fun in Bomb Run mode, where each player plays the same scene trying to be the first to destroy enough blocks to win the game. In addition, Puzzle Scape enables players to send the demo of the game to a friend. [O3 Entertainment]… Expand"}, {"name": "Tomb Raider Underworld: Beneath the Ashes", "details_link": "https://www.metacritic.com/game/xbox-360/tomb-raider-underworld-beneath-the-ashes", "publisher": "Eidos Interactive", "release_date": "Feb 24 2009", "developers": ["Crystal Dynamics"], "platforms": "Xbox 360", "genres": ["Action Adventure", "Adventure", "General", "General", "Modern"], "meta_score": 60, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "[Downloadable Content]  Beneath the Ashes is the first of two brand new downloadable levels in the continuing Tomb Raider adventures of Lara Croft. Offering a new adventure specifically designed to extend the Tomb Raider: Underworld experience, Tomb Raider Underworld: Beneath the Ashes sends[Downloadable Content]  Beneath the Ashes is the first of two brand new downloadable levels in the continuing Tomb Raider adventures of Lara Croft. Offering a new adventure specifically designed to extend the Tomb Raider: Underworld experience, Tomb Raider Underworld: Beneath the Ashes sends Lara back to the remains of Croft Manor where she uncovers a massive series of never-before-seen caverns and age old crypts used by her father to protect and hide a deadly source of power. In addition to an entirely new area to explore, the pack also contains six new costumes and deliver an additional 125 achievement points. [Microsoft]… Expand"}, {"name": "Ryse: Son of Rome", "details_link": "https://www.metacritic.com/game/xbox-one/ryse-son-of-rome", "publisher": "Microsoft Game Studios", "release_date": "Nov 22 2013", "developers": ["Crytek"], "platforms": ["PC", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/6e50e7ba207c98b4098ebe8c972f6d66-98.jpg", "descriptions": "Ryse: Son of Rome plunges you into the chaos and depravity of the late Roman Empire. The game tells the story of Marius Titus who witnesses the murder of his family at the hands of barbarians. Seeking revenge, Marius must embark on a perilous journey of revenge, betrayal, and divineRyse: Son of Rome plunges you into the chaos and depravity of the late Roman Empire. The game tells the story of Marius Titus who witnesses the murder of his family at the hands of barbarians. Seeking revenge, Marius must embark on a perilous journey of revenge, betrayal, and divine intervention. He joins the Roman army in Britannia and quickly rises through the ranks to become a General. As his war against the barbarians escalates, his quest unravels: to find his vengeance, he has to return to Rome. As Marius, you’ll engage in brutal combat and lead your forces into massive battles to save Rome from threats to its very existence.… Expand"}, {"name": "Dragon Quest II: Luminaries of the Legendary Line", "details_link": "https://www.metacritic.com/game/switch/dragon-quest-ii-luminaries-of-the-legendary-line", "publisher": "Square Enix", "release_date": "Sep 27 2019", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 60, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/24e407af4cd52c0257a3a639f2d43c9a-98.jpg", "descriptions": "The second instalment in the celebrated Dragon Quest series finally comes to mobile! Explore fair lands and foul dungeons in this all-time classic RPG!Every wondrous weapon, spectacular spell and awesome adversary in this rich fantasy world is yours to discover in a single standaloneThe second instalment in the celebrated Dragon Quest series finally comes to mobile! Explore fair lands and foul dungeons in this all-time classic RPG!Every wondrous weapon, spectacular spell and awesome adversary in this rich fantasy world is yours to discover in a single standalone package. Download it once, and there's nothing else to buy, and nothing else to download!In-game text is available in English only. PrologueA century has passed since the events of DRAGON QUEST, during which time three new nations have been founded by the offspring of the great hero of Alefgard.But the peace they have long enjoyed is no more. Demon hosts summoned forth from the darkness by the fallen High Priest Hargon have brought the land to the brink of ruin once again.Now, the young prince of Midenhalla descendant of the legendary warrior Erdrickmust set out to find the two other heirs to the heroic bloodline so that together they might defeat the nefarious Hargon and restore peace to their world. Game Features* Whether you're keen to pick up where the first part of the Erdrick Trilogy left off, or are entirely new to the series, DRAGON QUEST II: Luminaries of the Legendary Line is sure to take you on an unforgettable journey.* In this early example of an open-world adventure, players are free to wander the wilds, brave monster-infested dungeons, or take to the seas in search of new landsdiscovering ever more powerful abilities and valuable treasures along the way!*Simple, Intuitive ControlsThe game's controls are designed to work perfectly with the vertical layout of any modern mobile device, and the position of the movement button can be changed to facilitate both one- and two-handed play.* Experience the multi-million selling series, beloved both in Japan and beyond, and see how the masterful talents of series creator Yuji Horii first combined with the revolutionary synthesizer sounds of Koichi Sugiyama and the wildly popular manga illustrations of Akira Toriyama to create a gaming sensation.… Expand"}, {"name": "The Secret Saturdays: Beasts of the 5th Sun", "details_link": "https://www.metacritic.com/game/wii/the-secret-saturdays-beasts-of-the-5th-sun", "publisher": "D3Publisher", "release_date": "Oct 20 2009", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/f21e96336573e82118f844947acccadf-98.jpg", "descriptions": "Based on the hit The Secret Saturdays TV series on Cartoon Network, you will take control of Zak and the Saturday family as they explore the globe to discover and protect lost Cryptids and stop Argost from destroying the Earth."}, {"name": "Conflict: Vietnam", "details_link": "https://www.metacritic.com/game/xbox/conflict-vietnam", "publisher": "Global Star Software", "release_date": "Oct  5 2004", "developers": ["Pivotal Games"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Historic"], "meta_score": 60, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/71238917fc4d557f93180b29ccad7d8e-98.jpg", "descriptions": "In a conflict that lasted 11 years and took more than three million lives, four men experience the longest 28 days ever. Cut off behind enemy lines during the 1968 Tet Offensive with no way to contact help, four young, barely trained soldiers realize that their only hope for survival is toIn a conflict that lasted 11 years and took more than three million lives, four men experience the longest 28 days ever. Cut off behind enemy lines during the 1968 Tet Offensive with no way to contact help, four young, barely trained soldiers realize that their only hope for survival is to head into the heart of darkness. Now, with few rations and dwindling ammunition, you must guide these soldiers across 100 miles of ruthless terrain crawling with unseen enemies. As you drive a wide range of vehicles, shoot era-specific weapons, and avoid enemy booby traps, remember--you're not trying to win any war--you're just trying to make it home alive. … Expand"}, {"name": "Sega Smash Pack", "details_link": "https://www.metacritic.com/game/game-boy-advance/sega-smash-pack", "publisher": "THQ", "release_date": "Sep 23 2002", "developers": ["CodeFire"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/7299709c4f74ee23ad0d059e67a4bd78-98.jpg", "descriptions": "Sega Smash Pack for the Game Boy Advance could have been better."}, {"name": "Star X", "details_link": "https://www.metacritic.com/game/game-boy-advance/star-x", "publisher": "Bam Entertainment", "release_date": "Apr 17 2002", "developers": ["Graphic State"], "platforms": "Game Boy Advance", "genres": ["Action", "Shooter", "Rail"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/05011b3341801774788a0d261767311b-98.jpg", "descriptions": "You are THE only survivor of a doomed diplomatic envoy, sent to befriend a new alien race. The peace talks were brief! The 'Karask' are not here to co-exist; they are here for 'hard merchandise' - SLAVES. As your party is slaughtered to keep the truth hidden, you take to the skies, pursuedYou are THE only survivor of a doomed diplomatic envoy, sent to befriend a new alien race. The peace talks were brief! The 'Karask' are not here to co-exist; they are here for 'hard merchandise' - SLAVES. As your party is slaughtered to keep the truth hidden, you take to the skies, pursued by a never relenting hostile force. Only your quick wits and skill as a pilot will preserve your people's freedom.… Expand"}, {"name": "Atari Anniversary Edition", "details_link": "https://www.metacritic.com/game/dreamcast/atari-anniversary-edition", "publisher": "Infogrames", "release_date": "Jul  2 2001", "developers": ["Digital Eclipse"], "platforms": ["PC", "Dreamcast"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/eea6e75400f21aab64c067f1b58e7ad5-98.jpg", "descriptions": "Atari produced many memorable arcade games during video gaming's early days and now the best have been gathered together in a new compilation.  In Arcade Anniversary Edition, you relive the fast action, sights, and sounds of 12 classic Atari games:  Asteroids, Asteroids Deluxe, Battlezone,Atari produced many memorable arcade games during video gaming's early days and now the best have been gathered together in a new compilation.  In Arcade Anniversary Edition, you relive the fast action, sights, and sounds of 12 classic Atari games:  Asteroids, Asteroids Deluxe, Battlezone, Centipede, Crystal Castles, Gravitar, Millipede, Missile Command, Pong, Super Breakout, Tempest, and Warlords.  Each Atari title is faithfully reproduced down to the last detail, and each one is just as easy and fun to play as the original.… Expand"}, {"name": "Black Mirror", "details_link": "https://www.metacritic.com/game/pc/black-mirror", "publisher": "THQ Nordic", "release_date": "Nov 28 2017", "developers": ["KING Art"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 60, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/180c78b407b3962ea70edf62e5261fe5-98.jpg", "descriptions": "Scotland, 1926. Following the death of his father, David Gordon visits his ancestral home for the first time in his life. A life that is soon threatened by the dark secrets that claimed the sanity of many Gordons before him. Black Mirror Castle demands an offering."}, {"name": "Buku Sudoku", "details_link": "https://www.metacritic.com/game/xbox-360/buku-sudoku", "publisher": "Microsoft Game Studios", "release_date": "May 28 2008", "developers": ["Absolutist Ltd", "Absolutist"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/29b1eac83de78fe455a33a42b9baf38e-98.jpg", "descriptions": "[Xbox Live Arcade]  Experience the excitement of the world's hottest number game sensation. Buku Sudoku takes the pen-and-paper puzzler high-tech with HD graphics, helpful tutorials, single- and multiplayer game modes, multiple grid sizes, and the option to display hints, highlight errors,[Xbox Live Arcade]  Experience the excitement of the world's hottest number game sensation. Buku Sudoku takes the pen-and-paper puzzler high-tech with HD graphics, helpful tutorials, single- and multiplayer game modes, multiple grid sizes, and the option to display hints, highlight errors, undo moves, and even solve puzzles. 1,200 puzzles give you plenty of opportunity to challenge your own brain, play cooperatively with friends, race head-to-head to see who can complete a board first, or compete in the new battle mode, where completing a line, row, or square will remove numbers from your opponent's board. It's Sudoku however you like to play it. [Merscom]… Expand"}, {"name": "Guilty Gear Dust Strikers", "details_link": "https://www.metacritic.com/game/ds/guilty-gear-dust-strikers", "publisher": "Majesco Games", "release_date": "Apr 25 2006", "developers": ["Arc System Works"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 60, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/636820521e783894f3718519be0c4b89-98.jpg", "descriptions": "The no holds barred, sci-fi fighting franchise is reborn on the Nintendo DS. Guilty Gear Dust Strikers features all 21 Guilty Gear characters from previous versions (including SolBadbuy, Potemkin, May, Dizzy and others) in a battle that takes place on multiple levels across both DS screens.The no holds barred, sci-fi fighting franchise is reborn on the Nintendo DS. Guilty Gear Dust Strikers features all 21 Guilty Gear characters from previous versions (including SolBadbuy, Potemkin, May, Dizzy and others) in a battle that takes place on multiple levels across both DS screens. Navigate different types of floors and traps as you battle against the computer or via wireless multi-player connections. 6 modes of play  including Arcade, Story, VS Battle and mini games. Customize the Robo-Ky character with various move sets in the Robo-Ky factory mode. Battle your friends in 4-player wireless versus matches where the last person standing moves on. Master 10 mini-games like Billiards, Arm-Wrestling and Sword Practice that unlock more Robo-Ky moves. Beware of poison, fire, thunder and bomb traps set to damage unaware opponents. Special moves like Psych Burst, Dust Attack and Roman Cancel all return in Guilty Gear Dust Strikers. [Majesco]… Expand"}, {"name": "The Shoot", "details_link": "https://www.metacritic.com/game/playstation-3/the-shoot", "publisher": "SCEA", "release_date": "Oct 19 2010", "developers": ["Cohort Studios"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shooter", "Third-Person", "Light Gun", "Light Gun", "Modern"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/dc0af06aef57a56dd194b28270e561bf-98.jpg", "descriptions": "The Shoot is a first-person oriented shooter game for PlayStation 3 that uses the PlayStation Move controller and the PlayStation Eye peripheral to create a unique motion-controlled arcade gaming experience. Set amidst a movie-themed game setting, players use a single PlayStation Move The Shoot is a first-person oriented shooter game for PlayStation 3 that uses the PlayStation Move controller and the PlayStation Eye peripheral to create a unique motion-controlled arcade gaming experience. Set amidst a movie-themed game setting, players use a single PlayStation Move controller to target appropriately movie-themed enemies and to interact with the gameworld, while the PlayStation Eye camera monitors their location for enemies bent on returning fire of their own. Additional features include two-player support, 480p and 720p HD video support and more.  … Expand"}, {"name": "Dusk Diver 2", "details_link": "https://www.metacritic.com/game/playstation-5/dusk-diver-2", "publisher": "Idea Factory", "release_date": "Aug 30 2022", "developers": ["Wanin International"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Action RPG", "Beat-'Em-Up", "3D"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/15dfedad258d982ffb28cfd926e12ba2-98.jpg", "descriptions": "Yang Yumo, a college student with a daily part-time job. Her body had been suffering from the aftermath of the Youshanding incident a year back.In an ordinary day, Choas Beasts reappeared in the streets of Youshanding, and Yumo had to once again step onto the battlefield!\n\nA journey ofYang Yumo, a college student with a daily part-time job. Her body had been suffering from the aftermath of the Youshanding incident a year back.In an ordinary day, Choas Beasts reappeared in the streets of Youshanding, and Yumo had to once again step onto the battlefield!A journey of adventure and guardianship is about to unfold!!The fully enhanced Ximending action game sequel! New characters! New scenes! New customizations! It's the all new Dusk Diver 2!!… Expand"}, {"name": "The Bunker", "details_link": "https://www.metacritic.com/game/switch/the-bunker", "publisher": "Wales Interactive", "release_date": "Apr  9 2018", "developers": ["Channel 4"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 60, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/3/80592cf5053095b4a90fbdf395223fb5-98.jpg", "descriptions": "As the last remaining survivor in a nuclear bunker, Johns daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self-destruct. The Bunker is a live-action psychological horror game starring Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful)As the last remaining survivor in a nuclear bunker, Johns daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self-destruct. The Bunker is a live-action psychological horror game starring Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful) with writing talent behind The Witcher, Broken Sword and SOMA.… Expand"}, {"name": "Spectra (2015)", "details_link": "https://www.metacritic.com/game/pc/spectra-2015", "publisher": "Mastertronic", "release_date": "Jul 10 2015", "developers": ["Gateway Interactive"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Futuristic", "Racing", "Arcade", "Automobile"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/45a24bb160b0668ee57b18fd3d10730a-98.jpg", "descriptions": "Spectra is a twitch racing game. Blast your nimble ship down intricate ribbons of light in time to the dynamic beats and original soundtrack by chiptune artist legend Chipzel."}, {"name": "The Dwarves", "details_link": "https://www.metacritic.com/game/playstation-4/the-dwarves", "publisher": "Nordic Games Publishing", "release_date": "Dec  1 2016", "developers": ["Nordic Games Publishing"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "General"], "meta_score": 60, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/4265efb4df20831b37d4a5016bce27d5-98.jpg", "descriptions": "The Dwarves is a fantasy role-playing game with a strong story and tactically challenging real-time battles. 15 playable heroes, each with individual skills, are to be deployed cleverly. Take on superior numbers of orcs, ogres, älfs, bögnilim, zombies, dark mages, and many more foes, to giveThe Dwarves is a fantasy role-playing game with a strong story and tactically challenging real-time battles. 15 playable heroes, each with individual skills, are to be deployed cleverly. Take on superior numbers of orcs, ogres, älfs, bögnilim, zombies, dark mages, and many more foes, to give them the low-down.… Expand"}, {"name": "Lifeless Planet: Premier Edition", "details_link": "https://www.metacritic.com/game/playstation-4/lifeless-planet-premier-edition", "publisher": "Stage 2 Studios", "release_date": "Jul 19 2016", "developers": ["Stage 2 Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/9262c928b78b14ad2e2b12e32c0513f0-98.jpg", "descriptions": "Lifeless Planet is a new 3D PC action adventure, independently developed by David Board and Alaska-based Stage 2 Studios and to be published world-wide by Lace Mamba Global in Q4 2012. The game puts players in the moon-boots of a volunteer astronaut on a one-way mission to a life-bearingLifeless Planet is a new 3D PC action adventure, independently developed by David Board and Alaska-based Stage 2 Studios and to be published world-wide by Lace Mamba Global in Q4 2012. The game puts players in the moon-boots of a volunteer astronaut on a one-way mission to a life-bearing planet far outside our solar system. But after a rough landing, the promise of a new Earth soon fades with the discovery that the planet he was to explore is now barren and inhospitable.… Expand"}, {"name": "NBA Live 16", "details_link": "https://www.metacritic.com/game/xbox-one/nba-live-16", "publisher": "EA Sports", "release_date": "Sep 29 2015", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 60, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/fce9bd01beb1fb71e4504d6c09f2fe49-98.jpg", "descriptions": "LIVE Pro-Am is a fast-paced way to Rise Together with your friends. Pro-Am features LIVE Run and Summer Circuit, two online multiplayer modes that let you compete on iconic indoor and outdoor courts across North America. Play 5-on-5 street ball in LIVE Run. Meet NBA greats on the courts thatLIVE Pro-Am is a fast-paced way to Rise Together with your friends. Pro-Am features LIVE Run and Summer Circuit, two online multiplayer modes that let you compete on iconic indoor and outdoor courts across North America. Play 5-on-5 street ball in LIVE Run. Meet NBA greats on the courts that made them famous in Summer Circuit. … Expand"}, {"name": "Create", "details_link": "https://www.metacritic.com/game/xbox-360/create", "publisher": "EA Games", "release_date": "Nov 16 2010", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/b3a44ec6c752f393a6a1049f39adcb63-98.jpg", "descriptions": "The more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the sceneThe more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the scene to life. On the PlayStation 3, Xbox 360, PC, and MAC players can share any of their creations, solutions or challenges with the community through the console and also via the official Create website at www.create.ea.com. Friends can download and remix solutions and set challenges for other players to download and complete. Imaginations will run wild this holiday!… Expand"}, {"name": "Wario: Master of Disguise", "details_link": "https://www.metacritic.com/game/ds/wario-master-of-disguise", "publisher": "Nintendo", "release_date": "Mar  5 2007", "developers": ["Suzak"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 60, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/c73dc4863fdd6b0ae454162f0c9a9506-98.jpg", "descriptions": "When Wario sees a TV series about a thieving master of disguises, he dives through the television screen, steals the theif's quick-change wand and takes over the entire show. Episode after episode, he breaks into exotic locations, such as a luxury liner, watery ruins and an Egyptian pyramid.When Wario sees a TV series about a thieving master of disguises, he dives through the television screen, steals the theif's quick-change wand and takes over the entire show. Episode after episode, he breaks into exotic locations, such as a luxury liner, watery ruins and an Egyptian pyramid. Draw Wario's 8 disguises: By sketching a symbol on Wario, the player puts Wario in outfits that give him powers, such as Theif Wario's tackles and Cosmic Wario's laster blasts. The player also uses the stylus to wield powers. Explore enviornments: Wario travels the globe in ten missions that span nine exotic locations. The player must attack many enemies found in each location and also use Wario's disguises to get past puzzling obstacles. Play mini-games to unlock chests: To pick the lock of each chest, the player must play one of eight stylus-driven mini-games that grow more difficult as the game progresses. [Nintendo]… Expand"}, {"name": "Foreclosed", "details_link": "https://www.metacritic.com/game/playstation-5/foreclosed", "publisher": "Merge Games", "release_date": "Aug 12 2021", "developers": ["Antab"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/b50821f51f2367115a3bfed7d70a48db-98.jpg", "descriptions": "FORECLOSED is a narrative-driven action-shooter set in a Cyberpunk world filled with action, suspense, and experimental augmentations. Follow the story of Evan Kapnos, his identity recently Foreclosed, stripped of his job, his brain implants and his access to the city Block-chain, he mustFORECLOSED is a narrative-driven action-shooter set in a Cyberpunk world filled with action, suspense, and experimental augmentations. Follow the story of Evan Kapnos, his identity recently Foreclosed, stripped of his job, his brain implants and his access to the city Block-chain, he must now escape before his identity and implants are auctioned off.\r An Interactive Graphic Novel and Immersive Narrative\r FORECLOSED combines the playability of video games with the sleek visual aesthetic of comic books. Everything from game-play to cinematics are experienced within the stylistic framework of a graphic novel. Full screen and comic panel perspectives are seamlessly blended as you move throughout FORECLOSED's Cyberpunk city, uncovering a gripping conspiracy story. Cutscenes are also interactive and transition smoothly between alternative game-play styles.\r Firmware Upgrades\r Discover and unlock new abilities with an RPG-like skill system. Upgrade your weapon's potential with futuristic customisations and enhance your brain with implants which provide almost super-human abilities!\r Hi-Tech Combat\r Utilize experimental augmentations, weapons and tech to fight back against your enemies. Modify your Symbiotic Pistol with Explosive Rounds for maximum damage, or, go silent and equip the Stealth Bullets mod. Learn to control your augmentations to fight opponents and manipulate your surroundings. Acquire superhero-like abilities such as telekinesis to launch your enemies into the air or hurl huge objects at groups. Hack into different systems to create traps or even overload the implants in your enemies heads.… Expand"}, {"name": "Conglomerate 451", "details_link": "https://www.metacritic.com/game/pc/conglomerate-451", "publisher": "1C Entertainment", "release_date": "Feb 21 2020", "developers": ["RuneHeads"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Western-Style"], "meta_score": 60, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/1c9b48c0a87deddfbe1e43ce4ee30fbf-98.jpg", "descriptions": "Conglomerate 451 is a grid-based, dungeon crawling first-person RPG with roguelike elements set in a cyberpunk world."}, {"name": "SkateBIRD", "details_link": "https://www.metacritic.com/game/xbox-one/skatebird", "publisher": "Glass Bottom Games", "release_date": "Sep 16 2021", "developers": ["Glass Bottom Games"], "platforms": ["PC", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 60, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/3/d26e6b67831ebd8bd98403c7219d4b37-98.jpg", "descriptions": "Grind on bendy straws, kickflip over staplers, and carve killer lines through cardboard and sticky tape parks. Above all else, skate birds try their best!"}, {"name": "Tennis World Tour 2", "details_link": "https://www.metacritic.com/game/pc/tennis-world-tour-2", "publisher": "Nacon", "release_date": "Sep 24 2020", "developers": ["Big Ant Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 60, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/5a11e9258401a7e93a45f96e430fc6f2-98.jpg", "descriptions": "Play as the world's top players, master each surface, perfect your game and strive to dominate the world circuit. Choose from multiple game modes, with singles and doubles games, local and online."}, {"name": "Bakugan Battle Brawlers", "details_link": "https://www.metacritic.com/game/xbox-360/bakugan-battle-brawlers", "publisher": "Activision", "release_date": "Oct 20 2009", "developers": ["Now Production"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/49329cc6563bdb361d9e8b6514d2a2e6-98.jpg", "descriptions": "Bakugan is based on the story of Dan and his friends whose lives were forever changed when mysterious cards fell from the sky.  Creating a game from the cards where powerful creatures known as Bakugan battle, it wasn’t long before they discovered that their hobby was much more than just aBakugan is based on the story of Dan and his friends whose lives were forever changed when mysterious cards fell from the sky.  Creating a game from the cards where powerful creatures known as Bakugan battle, it wasn’t long before they discovered that their hobby was much more than just a simple pastime.  Utilizing special game cards Bakugan battle masters roll spheres onto the cards, which activate and transform into Bakugan “battle brawling” action figures. [Activision]… Expand"}, {"name": "Resident Evil 6", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-6", "publisher": "Capcom", "release_date": "Mar 29 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Survival"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/f8eff24f73528f69f093efcb97ca7957-98.jpg", "descriptions": "Resident Evil 6 is a Survival-Horror game that continues the struggle against the series' signature zombie inducing bio-terror, while raising the bar with all new game functionality. Players enjoy a diverse play experience, highlighted by the ability to select between three scenariosResident Evil 6 is a Survival-Horror game that continues the struggle against the series' signature zombie inducing bio-terror, while raising the bar with all new game functionality. Players enjoy a diverse play experience, highlighted by the ability to select between three scenarios featuring multiple characters and intertwined storylines. Within these scenarios both stories and action cross paths. Additional features include zombies as well as new enemies, upgradable firepower and characters, vehicle based options, the mini-game based Mercenaries mode, and single-player and co-op play options.… Expand"}, {"name": "James Noir's Hollywood Crimes", "details_link": "https://www.metacritic.com/game/3ds/james-noirs-hollywood-crimes", "publisher": "Ubisoft", "release_date": "Nov  1 2011", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "3DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/b12022e3d9f5cf2ef32130b587fa9161-98.jpg", "descriptions": "A brand new intellectual property developed exclusively for the Nintendo 3DS, James Noir's Hollywood Crimes makes the player the main character in a mind-twisting puzzle adventure taking place in an interactive 3D world, with 150 puzzles and mind games to solve."}, {"name": "A Game of Dwarves", "details_link": "https://www.metacritic.com/game/pc/a-game-of-dwarves", "publisher": "Paradox Interactive", "release_date": "Oct 23 2012", "developers": ["Zeal Game Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/3a54d0087a970eb5e3f6624178c7b365-98.jpg", "descriptions": "The gameplay consists of ordering the inhabitants of a dwarven settlement to dig, build and conduct research in order to strengthen the clan, whilst defending themselves from the terrible beasts from the depths into which they delve. The game generates a unique world each time a new levelThe gameplay consists of ordering the inhabitants of a dwarven settlement to dig, build and conduct research in order to strengthen the clan, whilst defending themselves from the terrible beasts from the depths into which they delve. The game generates a unique world each time a new level starts, making sure that the player needs to dynamically adapt their strategies and tactics during a session. As the player advances, the dwarves will level up and gain new skills, progressing from weak dwarflings to near immortal warriors or master craftsmen. There are also rare resources to be found deeper in the earth that grant access to better buildings and equipment. However, the deeper you dig the more dangerous foes you might unleash…… Expand"}, {"name": "Drawn to Life: Two Realms", "details_link": "https://www.metacritic.com/game/pc/drawn-to-life-two-realms", "publisher": "505 Games", "release_date": "Dec  7 2020", "developers": ["Digital Continue"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/99f8ef01a2fa332a8be5e81793f13fc2-98.jpg", "descriptions": "The quirky Raposa and your drawn hero return in Drawn to Life: Two Realms, the next installment in the beloved franchise! Uncover the mystery of the Shadow and save Mike and his friends."}, {"name": "Pirates of the Caribbean Online", "details_link": "https://www.metacritic.com/game/pc/pirates-of-the-caribbean-online", "publisher": "Disney Online", "release_date": "Oct 31 2007", "developers": ["Disney Online"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/4f3418417cd4aaa8d652c82ed2aa7187-98.jpg", "descriptions": "In Pirates of the Caribbean Online, players create and customize their own pirate, captain their own ship, and assemble a crew of their fellow rogues in an effort to become the Caribbean’s most legendary Pirate. Along the way, players will interact with characters made popular by the films,In Pirates of the Caribbean Online, players create and customize their own pirate, captain their own ship, and assemble a crew of their fellow rogues in an effort to become the Caribbean’s most legendary Pirate. Along the way, players will interact with characters made popular by the films, like Jack Sparrow, Will Turner and Elizabeth Swann, and will also encounter a host of new characters and enemies unique to the game.  To become the most notorious pirate, players must forge alliances, hunt for buried treasure, battle evil undead forces, and use cunning and strategy to outwit their foes. [Disney Online]… Expand"}, {"name": "Dead to Rights: Retribution", "details_link": "https://www.metacritic.com/game/playstation-3/dead-to-rights-retribution", "publisher": "Namco Bandai Games America", "release_date": "Apr 27 2010", "developers": ["Volatile Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 60, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/22ff24ef18adad3956c9b834be759f2a-98.jpg", "descriptions": "Thrusting players into a mature neo-noir crime drama as a vice cop Jack Slate and his canine companion Shadow, the game introduces new gameplay elements that unify the third person shooting and brawling genres for a brutal and relentless new action-driven experience. Returning to Grant City,Thrusting players into a mature neo-noir crime drama as a vice cop Jack Slate and his canine companion Shadow, the game introduces new gameplay elements that unify the third person shooting and brawling genres for a brutal and relentless new action-driven experience. Returning to Grant City, a boom town gone bust that is falling to the worst excesses of crime, greed and corruption; Dead to Rights: Retribution follows vice cop Jack Slate as he fights to expose shadowy figures that stops at nothing to exert their deadly influence over the crumbling metropolis. Dead to Rights: Retribution forms an original story portraying key events that shape and define Jack Slate's character including how he and Shadow first come together as partners against those who would bring the once great city to its knees. Introducing an innovative new hybrid combat system, Dead to Rights: Retribution puts the full combat potential of a highly trained, highly agitated law-enforcement officer into players’ hands. Use your sidearm to pick off enemies from a distance, take cover and blind-fire with the game’s new ranged combat mechanics, or push the issue by taking human shields, stealing weapons with special disarm moves or dishing out Jack’s own brutal brand of justice with deadly takedown moves. Jack is equally lethal in close-quarters combat, offering players branching melee combos, counterattacks and disarms as they take the fight to the criminal element of Grant City. Jack encounters a variety of ruthless gangs in the filthy slums and menacing alleys of Grant City, each with their own unique abilities and fighting style that test his resolve to crush their murderous stranglehold. Deadly on their own, Jack and Shadow are even more formidable as they team up to defeat the threats they uncover.  Players take full control of not only Jack, but also Shadow at various points in the game to stalk enemies or reach areas of the environment that are not accessible by one or the other. Shadow’s heightened senses make him skilled in detecting new threats or flushing out enemies from cover so that Jack can easily dispense with them. [Namco Bandai Games]… Expand"}, {"name": "The Incredibles: Rise of the Underminer", "details_link": "https://www.metacritic.com/game/playstation-2/the-incredibles-rise-of-the-underminer", "publisher": "THQ", "release_date": "Nov  1 2005", "developers": ["Heavy Iron Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 60, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/94040b71872d61f95f668009ddce31e9-98.jpg", "descriptions": "When the evil Underminer rises to the surface with a sinister plan to rule the world, it's up to Mr. Incredible and his super cool pal Frozone to save the day. While Mrs. Incredible, Violet, Dash, and Jack-Jack take care of things topside, Mr. Incredible and Frozone race underground to put aWhen the evil Underminer rises to the surface with a sinister plan to rule the world, it's up to Mr. Incredible and his super cool pal Frozone to save the day. While Mrs. Incredible, Violet, Dash, and Jack-Jack take care of things topside, Mr. Incredible and Frozone race underground to put a stop to the Underminer's dastardly plans and bury the diabolitical baddie once and for all! All-new action/adventure game. Play as Mr. Incredible or Frozone at anytime. Cooperative game-play with the ability to switch characters at any point in the game. Update your character's moves and abilities as you progress through the game. [THQ]… Expand"}, {"name": "Shaman King: Legacy of the Spirits, Sprinting Wolf", "details_link": "https://www.metacritic.com/game/game-boy-advance/shaman-king-legacy-of-the-spirits-sprinting-wolf", "publisher": "Konami", "release_date": "Feb  8 2005", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 60, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/2fa3ddad2eca35dcec37989e8da23a18-98.jpg", "descriptions": "Assume the role of Yoh Asakura in the ultimate quest to become Shaman King. Strategically change spirits during battles and use special items to defeat and capture your opponents. Build the strongest spirit party possible by gathering an array of spirits to prepare for the ultimate challenge."}, {"name": "Edge Of Eternity", "details_link": "https://www.metacritic.com/game/playstation-5/edge-of-eternity", "publisher": "Dear Villagers", "release_date": "Feb 10 2022", "developers": ["Midgar Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Japanese-Style"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/528403ce58bec2f403c7656f723a86de-98.jpg", "descriptions": "In a world torn asunder, the people of Heryon wage a desperate war against a mysterious invader, the Archelites. As this conflict against magic and technology grows to cataclysmic proportions, a new threat emerges from the battlefield.The Corrosion: the Archelites' most cruel weapon, aIn a world torn asunder, the people of Heryon wage a desperate war against a mysterious invader, the Archelites. As this conflict against magic and technology grows to cataclysmic proportions, a new threat emerges from the battlefield.The Corrosion: the Archelites' most cruel weapon, a terrible sickness that poisons the body, twists the limbs and warps people into horrible, misshapen abominations.A forlorn soldier in this godforsaken war, Daryon is ready to make the ultimate sacrifice for his country... until the day he receives a letter from his sister. Their mother has contracted the fateful disease, and they need him to find a cure.On that day, Daryon will have to make a choice that will change his life and the fate of his world forever.… Expand"}, {"name": "Payday 2", "details_link": "https://www.metacritic.com/game/switch/payday-2", "publisher": "Starbreeze", "release_date": "Feb 27 2018", "developers": ["Sumo Digital", "Overkill Software"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 60, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/09986aaa3157747bef440caa2c1c5d05-98.jpg", "descriptions": "Payday 2 is an action-packed, four-player co-op heist shooter that once again lets gamers don the masks of the original Payday crew - Dallas, Hoxton, Wolf and Chains. The new CrimeNet network offers a huge range of dynamic contracts and players are free to choose anything from small-timePayday 2 is an action-packed, four-player co-op heist shooter that once again lets gamers don the masks of the original Payday crew - Dallas, Hoxton, Wolf and Chains. The new CrimeNet network offers a huge range of dynamic contracts and players are free to choose anything from small-time convenience store hits or kidnappings, to cyber-crime or emptying out bank vaults. As the crew progresses the jobs become bigger, better and more rewarding. Along with earning more money and becoming a legendary criminal comes a new character customization and crafting system that lets crews build and customize their own guns and gear.… Expand"}, {"name": "Symmetry (2018)", "details_link": "https://www.metacritic.com/game/pc/symmetry-2018", "publisher": "IMGN.PRO", "release_date": "Feb 20 2018", "developers": ["Sleepless Clinic"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 60, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/e1d650ed0dc9fd9a3f8682a18095d04e-98.jpg", "descriptions": "A research spaceship reaches an abandoned planet. Nothing is what it seems here and the situation quickly slips out of control. Can the crew manage to survive and get back home?"}, {"name": "We Are The Dwarves", "details_link": "https://www.metacritic.com/game/pc/we-are-the-dwarves", "publisher": "Whale Rock Games", "release_date": "Feb 25 2016", "developers": ["Whale Rock Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/5fc56ce2461f9c4b36d8763ee4be3932-98.jpg", "descriptions": "Imagine an inverted galaxy, a dwarven race built off of stars and the danger of extinction as they begin to burn out. This is the setup as you embark on your journey to help 3 dwarven astronauts find the salvation for their race."}, {"name": "Bermuda Triangle: Saving the Coral", "details_link": "https://www.metacritic.com/game/ds/bermuda-triangle-saving-the-coral", "publisher": "Storm City Games", "release_date": "Feb  2 2010", "developers": ["Storm City Games"], "platforms": ["iPhone/iPad", "DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/fc8bcaa6bb8b466f6fc452e28b6bcdce-98.jpg", "descriptions": "A brilliantly colorful ocean-based puzzle game with a decidedly ‘green’ theme. Create chains of like-colored pods, and help feed and protect the ocean’s fragile coral! Battle pirates, sharks, and other obstacles in this fast moving, all-ages adventure game that’s both infinitely fun andA brilliantly colorful ocean-based puzzle game with a decidedly ‘green’ theme. Create chains of like-colored pods, and help feed and protect the ocean’s fragile coral! Battle pirates, sharks, and other obstacles in this fast moving, all-ages adventure game that’s both infinitely fun and environmentally friendly. [Storm City Games]… Expand"}, {"name": "Intellivision Lives!", "details_link": "https://www.metacritic.com/game/xbox/intellivision-lives!", "publisher": "Crave", "release_date": "Feb  2 2004", "developers": ["Realtime Associates"], "platforms": ["PlayStation 2", "Xbox"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/fb5396d7aea452f2fbd77c8c20a24788-98.jpg", "descriptions": "Relive the 80's with Intellivision Lives!  Play over 60 classic Intellivision games including Baseball, Astrosmash and Space Battle and several unreleased games.  Each game comes with historical information, fun facts and interviews with the original developers.  If that doesn't inspireRelive the 80's with Intellivision Lives!  Play over 60 classic Intellivision games including Baseball, Astrosmash and Space Battle and several unreleased games.  Each game comes with historical information, fun facts and interviews with the original developers.  If that doesn't inspire nostalgia, you can also watch original Intellivision commercials and archival footage.  All games are optimized for both the PS2 Dual Shock 2 and Xbox controllers.  Finally, all your all-time favorite Intellivision games in one package.… Expand"}, {"name": "Risk: Global Domination", "details_link": "https://www.metacritic.com/game/playstation-2/risk-global-domination", "publisher": "Atari", "release_date": "Nov  5 2003", "developers": ["Cyberlore Studios"], "platforms": "PlayStation 2", "num_players": "1-6 ", "genres": ["Strategy", "Wargame", "Turn-Based"], "meta_score": 60, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/e93f9446be55aca3e60fdb87768dac8b-98.jpg", "descriptions": "Using the same hands-on military planning found in the original RISK board game, players now see battles come to life in vivid 3D environments, get advice from historic military leaders, and earn medals and special dice for strategic accomplishments. [Infogrames]"}, {"name": "Digimon Battle Spirit", "details_link": "https://www.metacritic.com/game/game-boy-advance/digimon-battle-spirit", "publisher": "Bandai", "release_date": "Jan 13 2003", "developers": ["Dimps Corporation"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 60, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/afa0888a14567486fcf0b7c30aa7c424-98.jpg", "descriptions": "Battle your way through seven spectacular stages in this Digimon race against the clock! Fun for the entire family, Digimon BattleSpirit provides classic fighting fun for 1 or 2 players, as you compete as one of your favorite Digimon characters in an exciting, exhilarating, digivolving battle!"}, {"name": "Dragon Throne: Battle of Red Cliffs", "details_link": "https://www.metacritic.com/game/pc/dragon-throne-battle-of-red-cliffs", "publisher": "Strategy First", "release_date": "Mar 26 2002", "developers": ["Object"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/a31ac7c600bca388789cc2a289f9dda7-98.jpg", "descriptions": "Travel back in time to one of the most important battles in Chinese history with this sequel to \"Fate of the Dragon.\" The Battle of Red Cliffs was regarded as a great milestone in the Three Kingdoms period. In July, 208 AD, after pacifying the north, General Cao Cao mustered his troops andTravel back in time to one of the most important battles in Chinese history with this sequel to \"Fate of the Dragon.\" The Battle of Red Cliffs was regarded as a great milestone in the Three Kingdoms period. In July, 208 AD, after pacifying the north, General Cao Cao mustered his troops and headed south with the intent of unifying the realm. After a series of quick victories Cao Cao had become so arrogant that he completely underestimated his rivals Sun Quan and Liu Bei, and failed to take advantage this precious opportunity to unify the realm. On the contrary, he suffered a huge defeat even though his crack forces greatly outnumbered the opposing forces. After the Battle of Red Cliffs, the division of the realm into three parts began to take shape. [Strategy First]… Expand"}, {"name": "King's Field: The Ancient City", "details_link": "https://www.metacritic.com/game/playstation-2/kings-field-the-ancient-city", "publisher": "Agetec Inc.", "release_date": "Mar 25 2002", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "First-Person"], "meta_score": 60, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/786f3545b554a0037ae9111d2449ca30-98.jpg", "descriptions": "An accursed idol responsible for the destruction of an ancient race has resurfaced to wreak havoc once again among the kingdoms of man. You must return the idol to the Ancient City to break its curse, but monsters of unspeakable horror haunt the ruins. There is a palpable fear in the air ofAn accursed idol responsible for the destruction of an ancient race has resurfaced to wreak havoc once again among the kingdoms of man. You must return the idol to the Ancient City to break its curse, but monsters of unspeakable horror haunt the ruins. There is a palpable fear in the air of the Ancient City - even the monsters themselves fear the evil that has returned. Treasures beyond imagination await the warrior bold enough to attempt the journey, strong enough to face the minions of death, and wise enough to follow the path that leads to the essence of light! Use your sword arm well to rid the land of a potent curse! Be aware that should the sword fail, you have the magical arts to serve you in your quest. [Agetec]… Expand"}]