[
  {
    "name": "Call of Duty: Modern Warfare 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-modern-warfare-3",
    "publisher": "Activision",
    "release_date": "Nov  8 2011",
    "developers": [
      "Infinity Ward",
      "Sledgehammer Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 3.5,
    "image": "https://static.metacritic.com/images/products/games/3/462effa41817ea8751c7e0de90bac376-98.jpg",
    "descriptions": "Call of Duty: Modern Warfare 3 is a direct sequel to the previous game in the series, Call of Duty: Modern Warfare 2, with a campaign storyline continuing the struggle of U.S. forces against an invasion by the Russian Federation following the framing of an undercover U.S. agent in aCall of Duty: Modern Warfare 3 is a direct sequel to the previous game in the series, Call of Duty: Modern Warfare 2, with a campaign storyline continuing the struggle of U.S. forces against an invasion by the Russian FedeLration following the framing of an undercover U.S. agent in a terrorist attack on Moscow. Together with classic Call of Duty multi-character control, Modern Warfare 3 contains deep multiplayer support, including two-player Co-op Survival mode. The game also contains all-new Kill Streak categories and customizable strike packages that offer more options for player combat styles and strategies. … Expand"
  },
  {
    "name": "What Remains of Edith Finch",
    "details_link": "https://www.metacritic.com/game/playstation-4/what-remains-of-edith-finch",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Apr 25 2017",
    "developers": [
      "Giant Sparrow"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/964df5f603d32600674e6b43703a1e0f-98.jpg",
    "descriptions": "The game is a collection of short stories. Each of those stories focuses on the death of a different Finch family member and each is meant to look and feel different from the others, the way no two people in any family are alike. [Giant Sparrow]"
  },
  {
    "name": "Brothers in Arms: Road to Hill 30",
    "details_link": "https://www.metacritic.com/game/xbox/brothers-in-arms-road-to-hill-30",
    "publisher": "Ubisoft",
    "release_date": "Mar  1 2005",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Historic"
    ],
    "meta_score": 88,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/6efc4f702dd4450276af40291227d1a1-98.jpg",
    "descriptions": "Set during the famous airdrop before the invasion at Normandy, Brothers in Arms tells the story of Sgt. Matt Baker and his squad of 101st Airborne paratroopers, who were scattered over the French countryside. As Baker, you must use real military tactics to flank and kill your foes. DuringSet during the famous airdrop before the invasion at Normandy, Brothers in Arms tells the story of Sgt. Matt Baker and his squad of 101st Airborne paratroopers, who were scattered over the French countryside. As Baker, you must use real military tactics to flank and kill your foes. During the game, you must choose between the success of your mission and the lives of your men. Brothers in Arms boasts authentic battlefields and equipment, multiplayer gameplay, and a cast of more than 20 distinct soldiers.… Expand"
  },
  {
    "name": "Sekiro: Shadows Die Twice",
    "details_link": "https://www.metacritic.com/game/pc/sekiro-shadows-die-twice",
    "publisher": "Activision",
    "release_date": "Mar 22 2019",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 88,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/5ef9d7f3f47ab4eacb759821b775d2d0-98.jpg",
    "descriptions": "Your death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experienceYour death won’t come easily. Enter the world of late 1500s Sengoku Japan; a brutal, bloody period of constant life-and-death conflict. As tensions rise, a compelling new story unfolds amongst the chaos. Introducing Sekiro: Shadows Die Twice, a dark and twisted new gameplay experience developed by the renowned team at FromSoftware and published by Activision. Directed by Hidetaka Miyazaki, Sekiro: Shadows Die Twice is a third-person, action-adventure game with RPG elements. The single-player game puts players in the protagonist role of a hard-hearted warrior whose mission is to rescue his master, a young lord, and exact revenge on his arch nemesis. As “Sekiro,” or the “one-armed wolf,” players discover the many ways to strategically approach combat and engage enemies. [Activision]… Expand"
  },
  {
    "name": "Deus Ex: Human Revolution - Director's Cut",
    "details_link": "https://www.metacritic.com/game/wii-u/deus-ex-human-revolution---directors-cut",
    "publisher": "Square Enix",
    "release_date": "Oct 22 2013",
    "developers": [
      "Eidos Montreal",
      "Straight Right"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 88,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/9/89d164c908d4b5b459991c725e1aefcf-98.jpg",
    "descriptions": "In Deus Ex: Human Revolution you play Adam Jensen, a security specialist, handpicked to oversee the defense of one of America's most experimental biotechnology firms. But when a black ops team breaks in and kills the scientists you were hired to protect, everything you thought you knew aboutIn Deus Ex: Human Revolution you play Adam Jensen, a security specialist, handpicked to oversee the defense of one of America's most experimental biotechnology firms. But when a black ops team breaks in and kills the scientists you were hired to protect, everything you thought you knew about your job changes. At a time when scientific advancements are routinely turning athletes, soldiers and spies into super-enhanced beings, someone is working very hard to ensure mankind's evolution follows a particular path. You need to discover why - because the decisions you take and the choices you make will be the only things that can determine mankind's future. … Expand"
  },
  {
    "name": "Madden NFL 06",
    "details_link": "https://www.metacritic.com/game/playstation-2/madden-nfl-06",
    "publisher": "EA Sports",
    "release_date": "Aug  8 2005",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "4  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/0/9cca1d3726f8c0e1d5ddc7790e80cbed-98.jpg",
    "descriptions": "With enhancements to the passing game, defensive improvements, and expanded online options, Madden NFL 06 takes you onto the field and into the locker room like never before. The new \"QB Vision Control\" lets you scan the field, look off defenders, and make perfect throws withing yourWith enhancements to the passing game, defensive improvements, and expanded online options, Madden NFL 06 takes you onto the field and into the locker room like never before. The new \"QB Vision Control\" lets you scan the field, look off defenders, and make perfect throws withing your quarterbacks unique field of vision. \"QB Precision Placement\" allows you to put the ball exactly where you want it. Lead the receiver to an open area, throw it behind him so he can come back to it or throw a jump ball and let him go get it. [Electronic Arts]… Expand"
  },
  {
    "name": "Tetris Effect: Connected",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/tetris-effect-connected",
    "publisher": "Enhance Games",
    "release_date": "Nov 10 2020",
    "developers": [
      "Monstars Inc.",
      "Resonair"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Puzzle",
      "Stacking"
    ],
    "meta_score": 88,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/0/e2234d1e6af01cff05361926f4fcc6cb-98.jpg",
    "descriptions": "Tetris® Effect: Connected adds an all-new robust multiplayer expansion to the huge variety of addictive and innovative single-player modes that Tetris Effect is known for with all-new co-op and competitive online and local multiplayer modes. Tetris Effect is Tetris® like you've never seenTetris® Effect: Connected adds an all-new robust multiplayer expansion to the huge variety of addictive and innovative single-player modes that Tetris Effect is known for with all-new co-op and competitive online and local multiplayer modes. Tetris Effect is Tetris® like you've never seen it, or heard it, or felt it before—an incredibly addictive, unique, and breathtakingly gorgeous reinvention of one of the most popular puzzle games of all time, from the people who brought you the award-winning Rez Infinite and legendary puzzle game Lumines. Music, backgrounds, sounds, special effects—everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing, making any of the game's 30+ stages and 10+ modes something you'll want to experience over and over again. A challenge for the mind and a feast for all the senses, Tetris Effect: Connected is the perfect excuse to play Tetris again... and again...and again, and again, and again and again and again and again and again and again and... Game leverages Smart Delivery allowing access to both the Xbox One title and the Xbox Series X|S title when available.… Expand"
  },
  {
    "name": "Dishonored",
    "details_link": "https://www.metacritic.com/game/xbox-360/dishonored",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct  9 2012",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/0/7f3ae70363c02cf70db6f4cde688dcb3-98.jpg",
    "descriptions": "Dishonored is a tactile first-person action game that thrusts you into the role of a supernatural assassin driven by a thirst for revenge. With Dishonored’s flexible combat system, creatively eliminate your targets as you bring together the supernatural abilities, weapons and unusual gadgetsDishonored is a tactile first-person action game that thrusts you into the role of a supernatural assassin driven by a thirst for revenge. With Dishonored’s flexible combat system, creatively eliminate your targets as you bring together the supernatural abilities, weapons and unusual gadgets at your disposal. Hunt down your enemies under the cover of darkness or viciously attack them head on with weapons drawn. The results of each mission are a result of the choices you make. Win or lose, you must choose. Ozzy.… Expand"
  },
  {
    "name": "LIMBO",
    "details_link": "https://www.metacritic.com/game/pc/limbo",
    "publisher": "PLAYDEAD",
    "release_date": "Aug  2 2011",
    "developers": [
      "PLAYDEAD"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/2/c42f5f55dc8c5c59d091b5952d96ba08-98.jpg",
    "descriptions": "LIMBO, a black and white puzzle-platforming adventure, puts players in the role of a young boy traveling through an eerie and treacherous world in an attempt to discover the fate of his sister."
  },
  {
    "name": "Crusader Kings II: The Old Gods",
    "details_link": "https://www.metacritic.com/game/pc/crusader-kings-ii-the-old-gods",
    "publisher": "Paradox Interactive",
    "release_date": "May 28 2013",
    "developers": [
      "Paradox Development Studio"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General",
      "Historic"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/7/8d28c8d4a41c2232a77ebd73bfe41b3a-98.jpg",
    "descriptions": "Crusader Kings II: The Old Gods lets players step into the boots of a pagan chieftain, approaching the brutal backstabbing world of Crusader Kings through invasion, adventure, and holy war."
  },
  {
    "name": "Assassin's Creed: Brotherhood",
    "details_link": "https://www.metacritic.com/game/pc/assassins-creed-brotherhood",
    "publisher": "Ubisoft",
    "release_date": "Mar 22 2011",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 88,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/e7c0f058158bbf7d35d6debee76fa8a8-98.jpg",
    "descriptions": "The critically acclaimed single-player experience of Assassin's Creed is back and better than ever as Ezio returns in an epic struggle against the powerful Templar Order. Now a legendary Master Assassin, he must journey into Italy's greatest city, Rome, center of power, greed and corruptionThe critically acclaimed single-player experience of Assassin's Creed is back and better than ever as Ezio returns in an epic struggle against the powerful Templar Order. Now a legendary Master Assassin, he must journey into Italy's greatest city, Rome, center of power, greed and corruption to strike at the heart of the enemy. Defeating the corrupt tyrants entrenched there will require not only strength, but leadership, as Ezio commands an entire Brotherhood that will rally to his side. Only by working together can the Assassins defeat their mortal enemies.… Expand"
  },
  {
    "name": "Crash Team Racing",
    "details_link": "https://www.metacritic.com/game/playstation/crash-team-racing",
    "publisher": "SCEA",
    "release_date": "Sep 30 1999",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Kart"
    ],
    "meta_score": 88,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/7/1325609b1532891b5cb3462099f05d81-98.jpg",
    "descriptions": "It's a multi-player kart racing game starring your favorite bandicoot CRASH and a host of his friends...and foes! The stakes are high and the competition is fierce. Ready...Set...GO!!!"
  },
  {
    "name": "The Last of Us Part I",
    "details_link": "https://www.metacritic.com/game/playstation-5/the-last-of-us-part-i",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Sep  2 2022",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": [
      "PC",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General",
      "Linear"
    ],
    "meta_score": 88,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/0/e482c292d76eb52e010b35979f1366d2-98.jpg",
    "descriptions": "In a ravaged civilization, where infected and hardened survivors run rampant, Joel, a weary protagonist, is hired to smuggle 14-year-old Ellie out of a military quarantine zone. However, what starts as a small job soon transforms into a brutal cross-country journey. Includes the complete TheIn a ravaged civilization, where infected and hardened survivors run rampant, Joel, a weary protagonist, is hired to smuggle 14-year-old Ellie out of a military quarantine zone. However, what starts as a small job soon transforms into a brutal cross-country journey. Includes the complete The Last of Us single-player story and celebrated prequel chapter, Left Behind, which explores the events that changed the lives of Ellie and her best friend Riley forever.… Expand"
  },
  {
    "name": "DJ Hero 2",
    "details_link": "https://www.metacritic.com/game/wii/dj-hero-2",
    "publisher": "Activision",
    "release_date": "Oct 19 2010",
    "developers": [
      "FreeStyleGames"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 88,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/9/1c44393d2e948f5f63ed1145d711c1c5-98.jpg",
    "descriptions": "Activision's turntable-based rhythm game is coming back for an encore."
  },
  {
    "name": "Pinball FX 2: Marvel Pinball - Avengers Chronicles",
    "details_link": "https://www.metacritic.com/game/xbox-360/pinball-fx-2-marvel-pinball---avengers-chronicles",
    "publisher": "Zen Studios",
    "release_date": "Jun 20 2012",
    "developers": [
      "Zen Studios"
    ],
    "platforms": "Xbox 360",
    "genres": [
      "Action",
      "Miscellaneous",
      "Parlor",
      "Pinball",
      "Pinball"
    ],
    "meta_score": 88,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/98f7610a8b0a5e817d972d361cb83b0a-98.jpg",
    "descriptions": "Marvel Pinball: Avengers Chronicles features a four-table collection with tables based on the Avengers movie and comic crossovers World War Hulk, Infinity Gauntlet, and Fear Itself."
  },
  {
    "name": "Medal of Honor Frontline",
    "details_link": "https://www.metacritic.com/game/playstation-2/medal-of-honor-frontline",
    "publisher": "EA Games",
    "release_date": "May 28 2002",
    "developers": [
      "EA LA"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Historic"
    ],
    "meta_score": 88,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/40435161015b246e53890e372e7799ef-98.jpg",
    "descriptions": "Head back behind enemy lines with Lt. Jimmy Patterson in Medal of Honor Frontline. In this installment of the smash-hit Medal of Honor series, Lt. Patterson returns and must infiltrate the German frontline to steal the HO-IX flying wing, an experimental Nazi weapon so powerful it could turnHead back behind enemy lines with Lt. Jimmy Patterson in Medal of Honor Frontline. In this installment of the smash-hit Medal of Honor series, Lt. Patterson returns and must infiltrate the German frontline to steal the HO-IX flying wing, an experimental Nazi weapon so powerful it could turn the tide of World War II. [Electronic Arts]… Expand"
  },
  {
    "name": "Superbike 2001",
    "details_link": "https://www.metacritic.com/game/pc/superbike-2001",
    "publisher": "EA Sports",
    "release_date": "Oct  9 2000",
    "developers": [
      "Milestone S.r.l"
    ],
    "platforms": "PC",
    "num_players": "1-6 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Motorcycle",
      "Automobile",
      "Street",
      "Street"
    ],
    "meta_score": 88,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/5/bc622a8628adfca48f4ae2fcc51f085f-98.jpg",
    "descriptions": "Superbike 2001 delivers authentic Superbike racing from Superpole qualifying to the championship rounds. With the all new Training mode, novice riders are smoothly brought up to speed, while real telemetry and enhanced race management options give sim racing fans even more authenticity. [EA Sports]"
  },
  {
    "name": "Ultimate Fighting Championship",
    "details_link": "https://www.metacritic.com/game/dreamcast/ultimate-fighting-championship",
    "publisher": "Crave",
    "release_date": "Aug 29 2000",
    "developers": [
      "Anchor (Legacy)"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 88,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/5bd1e0a2cf275d8c896f10a5b655e667-98.jpg",
    "descriptions": "The Ultimate Fighting Championship (UFC) is the premier mixed martial arts event in the world. There are no flying chairs or unrealistic moves. Spectators expect and demand to see true-to-life combat. Now, the ultimate fighting event comes to the Dreamcast as the most realistic fighting gameThe Ultimate Fighting Championship (UFC) is the premier mixed martial arts event in the world. There are no flying chairs or unrealistic moves. Spectators expect and demand to see true-to-life combat. Now, the ultimate fighting event comes to the Dreamcast as the most realistic fighting game ever created.… Expand"
  },
  {
    "name": "Immortality",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/immortality",
    "publisher": "Half Mermaid",
    "release_date": "Aug 30 2022",
    "developers": [
      "Sam Barlow"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox Series X"
    ],
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 88,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/0/c0b9df907bca9ce918fea021a115664c-98.jpg",
    "descriptions": "Marissa Marcel was a film star. She made three movies. But none of the movies was ever released. And Marissa Marcel disappeared. An interactive trilogy from Sam Barlow, creator of Her Story."
  },
  {
    "name": "Mario Kart 8",
    "details_link": "https://www.metacritic.com/game/wii-u/mario-kart-8",
    "publisher": "Nintendo",
    "release_date": "May 30 2014",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Wii U",
    "num_players": "Up to 12 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Kart",
      "Kart",
      "Automobile"
    ],
    "meta_score": 88,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/b3d971bbd52b54c7d4821d02827ce335-98.jpg",
    "descriptions": "Mario Kart 8 introduces new racing circuit designs and antigravity karts that will have players driving upside down. Players will also enjoy a variety of series-favorite features, including the return of 12-player online competitive play, hang-gliders, underwater racing and motorbikes."
  },
  {
    "name": "Super Mario Maker",
    "details_link": "https://www.metacritic.com/game/wii-u/super-mario-maker",
    "publisher": "Nintendo",
    "release_date": "Sep 11 2015",
    "developers": [
      "Nintendo"
    ],
    "platforms": [
      "3DS",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/a505b22d59b1d61711def4e0ac987f62-98.jpg",
    "descriptions": "Play a countless number of intensely creative Super Mario levels from players around the globe. It’s easy enough to create your own levels with the Wii U GamePad controller that it may feel like you’re simply sketching out your ideas on paper, but you can now bring enemies and objects into aPlay a countless number of intensely creative Super Mario levels from players around the globe. It’s easy enough to create your own levels with the Wii U GamePad controller that it may feel like you’re simply sketching out your ideas on paper, but you can now bring enemies and objects into a playable course in ways you could only consider before. Violate the conventions of traditional Super Mario gameplay by blending enemies, traps and items into unexpected twists, like Piranha Plant-shooting cannons, power-up-tossing Lakitus, or even Hammer Bros. riding on Bowser while bouncing on trampolines. … Expand"
  },
  {
    "name": "NHL 11",
    "details_link": "https://www.metacritic.com/game/playstation-3/nhl-11",
    "publisher": "Electronic Arts",
    "release_date": "Sep  7 2010",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/2/fe9579148e3cb2dea99937fa7e1bd95f-98.jpg",
    "descriptions": "Celebrating its 20th year, the franchise that captured 22 ‘Sports Game of the Year’ awards has raised the bar yet again with NHL® 11. Powered by an all-new Real-Time Physics Engine, NHL 11 lets you create highlight reel moments as you experience adrenaline-pumping NHL action with biggerCelebrating its 20th year, the franchise that captured 22 ‘Sports Game of the Year’ awards has raised the bar yet again with NHL® 11. Powered by an all-new Real-Time Physics Engine, NHL 11 lets you create highlight reel moments as you experience adrenaline-pumping NHL action with bigger hits, broken sticks, and faster dangles. Whether you’re beginning your career in the Canadian Hockey League, dominating rivals in the EA SPORTS Hockey League, or assembling Hockey’s Ultimate Team, any moment can be a ‘WOW’ moment with NHL 11.… Expand"
  },
  {
    "name": "Divinity: Original Sin Enhanced Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/divinity-original-sin-enhanced-edition",
    "publisher": "Focus Home Interactive",
    "release_date": "Oct 27 2015",
    "developers": [
      "Larian Studios Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "2 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Western-Style"
    ],
    "meta_score": 88,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/d1f2fa0e5af5fabf2023f78be115b7f0-98.jpg",
    "descriptions": "Divinity Original Sin: Enhanced Edition is a much lauded Role-Playing-Game that blends deep customization and humor with dynamic turn based combat. Either in online co-op, split-screen co-op on your TV, or even alone, take advantage of a classless RPG system to create your heroes and conquerDivinity Original Sin: Enhanced Edition is a much lauded Role-Playing-Game that blends deep customization and humor with dynamic turn based combat. Either in online co-op, split-screen co-op on your TV, or even alone, take advantage of a classless RPG system to create your heroes and conquer the evils of Rivellon!\r Embark upon a journey with up to three companions as you bend the very fabric of time, where what seems like the case of a simple murder unravels into hours of quests facing fiendish foes, magical polymorphs, and dastardly bosses. As a Source Hunter, master the elements and use the environment to your advantage in dynamic combats mixing weather and magic to explode, poison, electrify, freeze and burn your enemies!… Expand"
  },
  {
    "name": "Dead Space",
    "details_link": "https://www.metacritic.com/game/playstation-3/dead-space",
    "publisher": "Electronic Arts",
    "release_date": "Oct 13 2008",
    "developers": [
      "EA Redwood Shores"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/7/56a791cb7b8849ee334179f7428e2114-98.jpg",
    "descriptions": "In the bold and often-bloody Dead Space gamers step into a third-person sci-fi survival horror experience that delivers psychological thrills and gruesome action. Set in the cold blackness of deep space, the atmosphere is soaked with a feeling of tension, dread and sheer terror. In DeadIn the bold and often-bloody Dead Space gamers step into a third-person sci-fi survival horror experience that delivers psychological thrills and gruesome action. Set in the cold blackness of deep space, the atmosphere is soaked with a feeling of tension, dread and sheer terror. In Dead Space, players step into the role of engineer Isaac Clarke – an ordinary man on a seemingly routine mission to fix the communications systems aboard a deep space mining ship. It is not long before Isaac awakes to a living nightmare when he learns that the ship's crew has been ravaged by a vicious alien infestation. He must fight through the dead silence and darkness of deep space to stay alive. [Electronic Arts]… Expand"
  },
  {
    "name": "Tekken 5",
    "details_link": "https://www.metacritic.com/game/playstation-2/tekken-5",
    "publisher": "Namco",
    "release_date": "Feb 24 2005",
    "developers": [
      "Namco"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/9d0f177d488d21add1ca6c1584bd8652-98.jpg",
    "descriptions": "Classic Tekken fighters like Nina Williams, Marshall Law and Paul Phoenix match fists with 3 Iron Fist Tournament newcomers: Asuka Kazama, Raven and Feng Wei. Face off in lush, interactive environments. Hurl your opponent into destructible objects and walls to deal massive damage. Dig in toClassic Tekken fighters like Nina Williams, Marshall Law and Paul Phoenix match fists with 3 Iron Fist Tournament newcomers: Asuka Kazama, Raven and Feng Wei. Face off in lush, interactive environments. Hurl your opponent into destructible objects and walls to deal massive damage. Dig in to the most customizable Tekken game ever. Earn fight money and use your winnings to outfit your characters with shades, hats, alternate costumes, secret items and more. Battle your way through an intense, action-adventure side-story. Rebuilt from the ground up, Tekken 5's graphics engine delivers the most exquisite visuals yet to PS2 3D fighting fans. Stunning CG ending movies reward victorious combatants. [Namco]… Expand"
  },
  {
    "name": "F.E.A.R.",
    "details_link": "https://www.metacritic.com/game/pc/fear",
    "publisher": "VU Games",
    "release_date": "Oct 17 2005",
    "developers": [
      "Monolith Productions"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/e90949f6d496ab2299c2cbd24b5b45ad-98.jpg",
    "descriptions": "F.E.A.R. (First Encounter Assault and Recon), is an intense first person close-quarters combat experience with rich atmosphere and an engaging storyline. The story begins as an unidentified paramilitary force infiltrates a multi-billion dollar aerospace compound. The government responds byF.E.A.R. (First Encounter Assault and Recon), is an intense first person close-quarters combat experience with rich atmosphere and an engaging storyline. The story begins as an unidentified paramilitary force infiltrates a multi-billion dollar aerospace compound. The government responds by sending in Special Forces, but loses contact as an eerie signal interrupts radio communications. When the interference subsides moments later, the team has been literally torn apart. As part of a classified strike team created to deal with threats no one else can handle, your mission is simple: Eliminate the intruders at any cost. Determine the origin of the signal. And contain this crisis before it spirals out of control. [Vivendi Universal]… Expand"
  },
  {
    "name": "Psychonauts",
    "details_link": "https://www.metacritic.com/game/xbox/psychonauts",
    "publisher": "Majesco Games",
    "release_date": "Apr 19 2005",
    "developers": [
      "Double Fine Productions"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 88,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/4/c1f504cdcae65833d21de3f5e2669712-98.jpg",
    "descriptions": "Psychonauts are operatives that possess psychic powers. When a crazy scientist begins abducting Psychonauts for their brains, it's up to you to put an end to it once and for all. Playing as new cadet Raz, you must develop your paranormal powers, which include telekinesis, fire-starting,Psychonauts are operatives that possess psychic powers. When a crazy scientist begins abducting Psychonauts for their brains, it's up to you to put an end to it once and for all. Playing as new cadet Raz, you must develop your paranormal powers, which include telekinesis, fire-starting, clairvoyance, and telepathy. Enter the minds of other people to collect figments of their imaginations, to resolve their emotional problems, and to unlock their memory vaults. As you progress in your missions, you'll earn even more psychic powers that will help you solve a variety of puzzles.… Expand"
  },
  {
    "name": "The Binding of Isaac: Rebirth",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-binding-of-isaac-rebirth",
    "publisher": "Nicalis",
    "release_date": "Nov  4 2014",
    "developers": [
      "Nicalis"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation Vita",
      "Wii U",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Horror",
      "Action",
      "Action Adventure",
      "Shooter",
      "Survival",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 88,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/7/5d2ba077281975b78bbf07d4ef768877-98.jpg",
    "descriptions": "Rebirth is a randomly generated action RPG shooter with emphatic Roguelike elements. Following Isaac on his journey gamers discover bizarre treasures that change Isaac’s form giving him extra-human abilities and enabling him to fend off droves of mysterious creatures, learn secrets and scrapRebirth is a randomly generated action RPG shooter with emphatic Roguelike elements. Following Isaac on his journey gamers discover bizarre treasures that change Isaac’s form giving him extra-human abilities and enabling him to fend off droves of mysterious creatures, learn secrets and scrap his way to safety. … Expand"
  },
  {
    "name": "DUSK",
    "details_link": "https://www.metacritic.com/game/switch/dusk",
    "publisher": "New Blood Interactive",
    "release_date": "Oct 28 2021",
    "developers": [
      "New Blood Interactive"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/4e521a1879b36c7a1cfae6a0fbfcab65-98.jpg",
    "descriptions": "DUSK -A retro FPS that looks and feels like the 90s. Inspired by Quake, Heretic, Hexen, Half-Life and Redneck Rampage."
  },
  {
    "name": "Tony Hawk's Pro Skater 1 + 2",
    "details_link": "https://www.metacritic.com/game/pc/tony-hawks-pro-skater-1-+-2",
    "publisher": "Activision",
    "release_date": "Sep  4 2020",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Sports",
      "Individual",
      "Skate / Skateboard"
    ],
    "meta_score": 88,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/2/e7dcb9f37f020227829232a5b69d2830-98.jpg",
    "descriptions": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more."
  },
  {
    "name": "FIFA 14",
    "details_link": "https://www.metacritic.com/game/xbox-one/fifa-14",
    "publisher": "EA Sports",
    "release_date": "Nov 19 2013",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "Up to 22 ",
    "genres": [
      "Sim",
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/0/582932037740b6dfc9b7faadfdb21356-98.jpg",
    "descriptions": "Shooting has been transformed. Players now have the intelligence to adjust their stride and approach angle to find the best position for hitting the back of the net. Well-hit balls feel satisfying and goals are rewarding. As well as quality strikes, players can now shoot while off balance orShooting has been transformed. Players now have the intelligence to adjust their stride and approach angle to find the best position for hitting the back of the net. Well-hit balls feel satisfying and goals are rewarding. As well as quality strikes, players can now shoot while off balance or rushed. … Expand"
  },
  {
    "name": "NHL 10",
    "details_link": "https://www.metacritic.com/game/xbox-360/nhl-10",
    "publisher": "EA Sports",
    "release_date": "Sep 15 2009",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/97360940cc2fa1c5737a020b302777b0-98.jpg",
    "descriptions": "The NHL franchise that has won 19 sports game of the year awards over the past two years begins a new era with gameplay innovations that promise to deliver a new standard of toughness, the emotion of playoff hockey on the ice and in the arena, and over 200 gameplay refinements that replicateThe NHL franchise that has won 19 sports game of the year awards over the past two years begins a new era with gameplay innovations that promise to deliver a new standard of toughness, the emotion of playoff hockey on the ice and in the arena, and over 200 gameplay refinements that replicate the skill and finesse that every fan sees throughout the NHL playoffs. A new first-person fighting engine enables players to trade punches with an NHL tough guy. Feel what its like to be on the ice in the skates of an NHL player to throw and dodge punches. Grab and tug an opponent's jersey to land a punch that ignites the fans and sparks your team to victory. Challenge a skill player and an opposing team tough guy will step in to settle the score. On ice toughness and intimidation is taken to a new level in NHL 10 where winning one-on-one battles for possession of the puck along the boards becomes a test of will and skill. Utilizing an all-new board physics engine, players can use their body to shield the puck on the boards and then kick-pass it to teammates. Bigger, stronger players pin opponents to the boards while fanatical fans bang on the glass, just like real life. Fore-check defenders, pressure the puck and finish checks to intimidate your opponent into mistakes. Players fatigue, bobble passes, and avoid collisions under threat of constant physical pressure. Inspire teammates, ignite the fans and change the momentum of a game by instigating scrums, drawing penalties, and mixing it up - all after the referee blows the whistle! [Electronic Arts]… Expand"
  },
  {
    "name": "BioShock 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/bioshock-2",
    "publisher": "2K Games",
    "release_date": "Feb  9 2010",
    "developers": [
      "2K Marin"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/bddaac06c3af71396b32218a004f57f0-98.jpg",
    "descriptions": "Set approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. You are the very first Big DaddySet approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. You are the very first Big Daddy as you travel through the decrepit and beautiful fallen city, chasing an unseen foe in search of answers and your own survival. Multiplayer in BioShock 2 provides a rich prequel experience that expands the BioShock gameplay. Set during the fall of Rapture, players assume the role of Plasmid test subject in the underwater city that was first explored in the original BioShock. Players will need to use all the elements of the game's toolset to survive as the full depth of the BioShock experience is refined and transformed into a unique multiplayer experience that can only be found in Rapture. [2K Games]… Expand"
  },
  {
    "name": "Kerbal Space Program",
    "details_link": "https://www.metacritic.com/game/pc/kerbal-space-program",
    "publisher": "SQUADTeam",
    "release_date": "Apr 27 2015",
    "developers": [
      "SQUADTeam",
      "Squad"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Sci-Fi",
      "Small Spaceship",
      "Small Spaceship",
      "Simulation",
      "Space",
      "Combat",
      "Civilian"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/bc5742da4962fdde19669f0c1cd51913-98.jpg",
    "descriptions": "In Kerbal Space Program you have to build a space-worthy ship, capable of flying its crew out into space without killing any of them. At your disposal is a collection of parts, which must be assembled to create a functional craft. Each part has its own function and will affect the way a shipIn Kerbal Space Program you have to build a space-worthy ship, capable of flying its crew out into space without killing any of them. At your disposal is a collection of parts, which must be assembled to create a functional craft. Each part has its own function and will affect the way a ship flies (or does not). So strap yourself in, and get ready to try some Rocket Science.… Expand"
  },
  {
    "name": "Tribes 2",
    "details_link": "https://www.metacritic.com/game/pc/tribes-2",
    "publisher": "Sierra Entertainment",
    "release_date": "Mar 28 2001",
    "developers": [
      "Dynamix"
    ],
    "platforms": "PC",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/fe6618fac422bf919d82418d597ce40b-98.jpg",
    "descriptions": "The sequel to Sierra's multiplayer phenomenon \"Starsiege: Tribes,\" 1999's 360 degree, team-based first-person shooter, \"Tribes 2\" lets up to 64 gamers simultaneously battle online in 40th century outdoor environments."
  },
  {
    "name": "Diddy Kong Racing",
    "details_link": "https://www.metacritic.com/game/nintendo-64/diddy-kong-racing",
    "publisher": "Nintendo",
    "release_date": "Nov 24 1997",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Kart"
    ],
    "meta_score": 88,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/3762bbd6bd37a06f82eabd74e8fb461f-98.jpg",
    "descriptions": "Timber the Tiger's parents picked a fine time to go on vacation. When they come back, they're going to be faced with an island trashed by the spiteful space bully Wizpig - unless the local animals can do something about it! So join Diddy Kong as he teams up with Timber the Tiger, Pipsy theTimber the Tiger's parents picked a fine time to go on vacation. When they come back, they're going to be faced with an island trashed by the spiteful space bully Wizpig - unless the local animals can do something about it! So join Diddy Kong as he teams up with Timber the Tiger, Pipsy the Mouse and Taj the Genie in an epic racing adventure unlike anything you've ever experienced before!… Expand"
  },
  {
    "name": "Star Fox 64",
    "details_link": "https://www.metacritic.com/game/nintendo-64/star-fox-64",
    "publisher": "Nintendo",
    "release_date": "Jul  1 1997",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Nintendo 64",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Shooter",
      "Rail"
    ],
    "meta_score": 88,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/4/612fb1b2298164d816d3dcfd55b0af8c-98.jpg",
    "descriptions": "The Lylat system has been invaded! Join Fox McCloud and his Star Fox team as they fight to save the galaxy from the clutches of the evil Andross. Travel to many different 3-D worlds. Battle the enemy in the air and on the ground and listen in as Fox McCloud interacts with a cast of characters."
  },
  {
    "name": "NHL 09",
    "details_link": "https://www.metacritic.com/game/xbox-360/nhl-09",
    "publisher": "Electronic Arts",
    "release_date": "Sep  9 2008",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/cc04aa00006a091397baa2339bea5e33-98.jpg",
    "descriptions": "NHL 09 builds on the momentum of last year, with innovative controls, added depth and new features designed to help newcomers jump into the series. The Skill Stick System evolves to bring an unparalleled level of control to the defensive side of the puck. The all new Defensive Skill StickNHL 09 builds on the momentum of last year, with innovative controls, added depth and new features designed to help newcomers jump into the series. The Skill Stick System evolves to bring an unparalleled level of control to the defensive side of the puck. The all new Defensive Skill Stick gives you the ability to sweep your stick to block passing lanes and lift an opponent's stick to prevent one-timers. Take your game online with 6 vs.6 team play, where 12 people can play together on 12 different consoles around the world. With new teams from the Russian, Czech Republic and German Elite leagues, NHL 09 connects hockey fans around the globe like never before. Players new to the series can now shoot, pass and check with ease. NHL 09 features Be A Pro, a game mode that puts you on the ice with a dynamic new 3rd person camera that allows you to play the role of one player. With a performance tracker grading your progress in more than 50 categories, you know exactly where you need to improve to become the next NHL superstar. [Electronic Arts]… Expand"
  },
  {
    "name": "Ori and the Blind Forest: Definitive Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/ori-and-the-blind-forest-definitive-edition",
    "publisher": "Microsoft Game Studios",
    "release_date": "Mar 11 2016",
    "developers": [
      "Moon Studios"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/3/f4be962d47f78b99090a0fd779f135ad-98.jpg",
    "descriptions": "Ori and the Blind Forest: Definitive Edition delivers a multitude of new areas, difficulty options, and gameplay upgrades that should appeal to both new and seasoned Ori players."
  },
  {
    "name": "AI: The Somnium Files - nirvanA Initiative",
    "details_link": "https://www.metacritic.com/game/pc/ai-the-somnium-files---nirvana-initiative",
    "publisher": "Spike Chunsoft",
    "release_date": "Jun 24 2022",
    "developers": [
      "Spike Chunsoft"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/0/901fde277df95d56f63c69b00fc0b0c3-98.jpg",
    "descriptions": "Six years ago, the right half of a corpse was discovered under mysterious circumstances. The left half was never found...until six years later, when it was discovered completely fresh with no signs of decay, as though the victim was alive until just recently. Now, newly-appointed SpecialSix years ago, the right half of a corpse was discovered under mysterious circumstances. The left half was never found...until six years later, when it was discovered completely fresh with no signs of decay, as though the victim was alive until just recently. Now, newly-appointed Special Agent Mizuki and her AI partner Aiba are tasked to solve the bizarre Half Body serial killings...… Expand"
  },
  {
    "name": "Streets of Rage 4: Mr. X Nightmare",
    "details_link": "https://www.metacritic.com/game/pc/streets-of-rage-4-mr-x-nightmare",
    "publisher": "DotEmu",
    "release_date": "Jul 15 2021",
    "developers": [
      "Lizardcube"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/39734d05908f164ef6ce4a72b415479f-98.jpg",
    "descriptions": "The fight continues in Wood Oak City. After the events of Streets of Rage 4, our heroes wanted to prepare themselves for future threats. Axel, Blaze and their mates will start a very special deranged training with the help of Dr. Zan, who built an AI program from the remnants of Mister X’sThe fight continues in Wood Oak City. After the events of Streets of Rage 4, our heroes wanted to prepare themselves for future threats. Axel, Blaze and their mates will start a very special deranged training with the help of Dr. Zan, who built an AI program from the remnants of Mister X’s brain that simulates every kind of danger they could be facing.\r With this new DLC, get ready for:\r • 3 new playable characters\r• A new Survival mode with weekly challenges\r• Character customization: build your own fighting style with new moves\r• New weapons and enemies! … Expand"
  },
  {
    "name": "NieR: Automata",
    "details_link": "https://www.metacritic.com/game/playstation-4/nier-automata",
    "publisher": "Square Enix",
    "release_date": "Mar  7 2017",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 88,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/2/199299cb57b2575571d52793cc02ca2d-98.jpg",
    "descriptions": "NieR Producer Yosuke Saito, director Taro Yoko and composer Keiichi Okabe return, teaming up with character designer Akihiko Yoshida and PlatinumGames to present the next entry in the saga – NieR: Automata."
  },
  {
    "name": "Meteos",
    "details_link": "https://www.metacritic.com/game/ds/meteos",
    "publisher": "Nintendo",
    "release_date": "Jun 28 2005",
    "developers": [
      "Q Entertainment"
    ],
    "platforms": "DS",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "Puzzle",
      "Matching",
      "Matching"
    ],
    "meta_score": 88,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/5fcab9f4c9910dd28b7de16a279e97f6-98.jpg",
    "descriptions": "\"Rez\" creator Tetsuya Mizuguchi brings us Meteos - a curious blend of block-dropping puzzle action with other gameplay elements with the goal to launch all of one's blocks into orbit."
  },
  {
    "name": "Zero Escape: Virtue's Last Reward",
    "details_link": "https://www.metacritic.com/game/3ds/zero-escape-virtues-last-reward",
    "publisher": "Aksys Games",
    "release_date": "Oct 23 2012",
    "developers": [
      "ChunSoft"
    ],
    "platforms": [
      "PlayStation Vita",
      "3DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "General",
      "Visual Novel"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/fa17136502d0fdfdcd0563ccf0778d1a-98.jpg",
    "descriptions": "Zero Escape: Virtue's Last Reward has players taking on the Nonary Game again, as it's back and more deadly than ever."
  },
  {
    "name": "Dishonored 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/dishonored-2",
    "publisher": "Bethesda Softworks",
    "release_date": "Nov 10 2016",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 88,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/5/dd750d44abf361b6d64136986a20bcd9-98.jpg",
    "descriptions": "Dishonored 2 takes your protagonist, Corvo Attano or Emily Kaldwin, to the coastal city of Karnaca where the choices you make will have significant impact on the world."
  },
  {
    "name": "NHL 09",
    "details_link": "https://www.metacritic.com/game/playstation-3/nhl-09",
    "publisher": "Electronic Arts",
    "release_date": "Sep  9 2008",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/6/ddce249356765aa0d78f152cc2ba732f-98.jpg",
    "descriptions": "NHL 09 builds on the momentum of last year, with innovative controls, added depth and new features designed to help newcomers jump into the series. The Skill Stick System evolves to bring an unparalleled level of control to the defensive side of the puck. The all new Defensive Skill StickNHL 09 builds on the momentum of last year, with innovative controls, added depth and new features designed to help newcomers jump into the series. The Skill Stick System evolves to bring an unparalleled level of control to the defensive side of the puck. The all new Defensive Skill Stick gives you the ability to sweep your stick to block passing lanes and lift an opponent's stick to prevent one-timers. Take your game online with 6 vs.6 team play, where 12 people can play together on 12 different consoles around the world. With new teams from the Russian, Czech Republic and German Elite leagues, NHL 09 connects hockey fans around the globe like never before. Players new to the series can now shoot, pass and check with ease. NHL 09 features Be A Pro, a game mode that puts you on the ice with a dynamic new 3rd person camera that allows you to play the role of one player. With a performance tracker grading your progress in more than 50 categories, you know exactly where you need to improve to become the next NHL superstar. [Electronic Arts]… Expand"
  },
  {
    "name": "Rise of the Tomb Raider: 20 Year Celebration",
    "details_link": "https://www.metacritic.com/game/playstation-4/rise-of-the-tomb-raider-20-year-celebration",
    "publisher": "Square Enix",
    "release_date": "Oct 11 2016",
    "developers": [
      "Crystal Dynamics",
      "Nixxes Software"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 88,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/8f5162e7ae59cd595c82a1833029967a-98.jpg",
    "descriptions": "Lara Croft embarks on her first Tomb Raiding expedition to the most treacherous and remote regions of Siberia. Rise of the Tomb Raider: 20 Year Celebration also includes the new “Blood Ties” single player content, VR support, new Co-op play for Endurance mode, and more. [Playstation.com]"
  },
  {
    "name": "Hyper Light Drifter",
    "details_link": "https://www.metacritic.com/game/switch/hyper-light-drifter",
    "publisher": "Abylight",
    "release_date": "Sep  6 2018",
    "developers": [
      "Heart Machine"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 88,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/91e68ee1f4223c7c93696b83c50827c3-98.jpg",
    "descriptions": "Echoes of a dark and violent past resonate throughout a savage land, steeped in treasure and blood. Hyper Light Drifter is an action adventure RPG in the vein of the best 16bit classics, with modernized mechanics and designs on a much grander scale.\r Drifters of this world are theEchoes of a dark and violent past resonate throughout a savage land, steeped in treasure and blood. Hyper Light Drifter is an action adventure RPG in the vein of the best 16bit classics, with modernized mechanics and designs on a much grander scale.\r Drifters of this world are the collectors of forgotten knowledge, lost technologies and broken histories. Our Drifter is haunted by an insatiable illness, traveling further into the lands of Buried Time, hoping to discover a way to quiet the vicious disease.… Expand"
  },
  {
    "name": "NHL 10",
    "details_link": "https://www.metacritic.com/game/playstation-3/nhl-10",
    "publisher": "EA Sports",
    "release_date": "Sep 15 2009",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/3/517e3388ff0267c4a1e5d2a46ecd7613-98.jpg",
    "descriptions": "The NHL franchise that has won 19 sports game of the year awards over the past two years begins a new era with gameplay innovations that promise to deliver a new standard of toughness, the emotion of playoff hockey on the ice and in the arena, and over 200 gameplay refinements that replicateThe NHL franchise that has won 19 sports game of the year awards over the past two years begins a new era with gameplay innovations that promise to deliver a new standard of toughness, the emotion of playoff hockey on the ice and in the arena, and over 200 gameplay refinements that replicate the skill and finesse that every fan sees throughout the NHL playoffs. A new first-person fighting engine enables players to trade punches with an NHL tough guy. Feel what its like to be on the ice in the skates of an NHL player to throw and dodge punches. Grab and tug an opponent's jersey to land a punch that ignites the fans and sparks your team to victory. Challenge a skill player and an opposing team tough guy will step in to settle the score. On ice toughness and intimidation is taken to a new level in NHL 10 where winning one-on-one battles for possession of the puck along the boards becomes a test of will and skill. Utilizing an all-new board physics engine, players can use their body to shield the puck on the boards and then kick-pass it to teammates. Bigger, stronger players pin opponents to the boards while fanatical fans bang on the glass, just like real life. Fore-check defenders, pressure the puck and finish checks to intimidate your opponent into mistakes. Players fatigue, bobble passes, and avoid collisions under threat of constant physical pressure. Inspire teammates, ignite the fans and change the momentum of a game by instigating scrums, drawing penalties, and mixing it up - all after the referee blows the whistle! [Electronic Arts]… Expand"
  },
  {
    "name": "Uncharted: Drake's Fortune",
    "details_link": "https://www.metacritic.com/game/playstation-3/uncharted-drakes-fortune",
    "publisher": "SCEA",
    "release_date": "Nov 16 2007",
    "developers": [
      "Naughty Dog",
      "SCE/WWS"
    ],
    "platforms": "PlayStation 3",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Linear"
    ],
    "meta_score": 88,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/8882c92bfba89d4c9f542e8f63cbb11c-98.jpg",
    "descriptions": "A 400-year-old clue in the coffin of Sir Francis Drake sets a modern-day fortune hunter on an exploration for the fabled treasure of El Dorado, leading to the discovery of a forgotten island in the middle of the Pacific Ocean. The search turns deadly when Nathan Drake becomes stranded on theA 400-year-old clue in the coffin of Sir Francis Drake sets a modern-day fortune hunter on an exploration for the fabled treasure of El Dorado, leading to the discovery of a forgotten island in the middle of the Pacific Ocean. The search turns deadly when Nathan Drake becomes stranded on the island and hunted by mercenaries. Outnumbered and outgunned, Drake and his companions must fight to survive as they begin to unravel the terrible secrets hidden on the Island.  Using maps and ancient artifacts, uncover clues and unravel mysteries to find a forgotten island and a treasure that was thought to have never existed. Explore exotic locations. Traverse through living jungles and spectacular 400-year-old ruins.  Drake's companions and allies play an important role in the adventure through cooperative mechanics, gun play and exploration. Experience fast-paced gunplay: use a variety of environmental elements for cover, shoot enemies off of moving vehicles in high speed chases and more. Use an array of hand-to-hand fighting moves to put your enemy off balance. Anything from wild haymaker punches to running drop-kicks. Naughty Dog's advanced animation techniques allow Nathan to switch seamlessly between movements and achieve a whole new level of believability in gameplay. Nathan can reload his weapon while dodging bullets and find cover behind a wall, all in one smooth natural motion. [SCEA]… Expand"
  },
  {
    "name": "Ori and the Will of the Wisps",
    "details_link": "https://www.metacritic.com/game/pc/ori-and-the-will-of-the-wisps",
    "publisher": "Microsoft Game Studios",
    "release_date": "Mar 11 2020",
    "developers": [
      "Moon Studios"
    ],
    "platforms": [
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/fb071eb430c986bc8f42f07da0a7339e-98.jpg",
    "descriptions": "The little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and theThe little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork. Set to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling.… Expand"
  },
  {
    "name": "The Banner Saga 3",
    "details_link": "https://www.metacritic.com/game/xbox-one/the-banner-saga-3",
    "publisher": "Versus Evil",
    "release_date": "Jul 26 2018",
    "developers": [
      "Stoic"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 88,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/9/b5266e0d4541afc3f2536497a2e56f6e-98.jpg",
    "descriptions": "The Banner Saga 3 is the epic conclusion to a sweeping viking saga six years in the making. This strategic RPG, acclaimed for its strong story and compelling characters has has won over 20 awards and been nominated for 4 BAFTA awards."
  },
  {
    "name": "Tom Clancy's Rainbow Six Vegas",
    "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-rainbow-six-vegas",
    "publisher": "Ubisoft",
    "release_date": "Nov 20 2006",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1-16 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Tactical",
      "Modern",
      "Modern"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/8/deeef5ef48e114a99c1f00dc93125336-98.jpg",
    "descriptions": "The stakes are high when the world's most elite counter-terrorism unit enters Las Vegas, where over 36.7 million men, women and children visit each year. \"Sin City,\" the home of the famous Las Vegas Strip, flashy hotels, high-rolling casinos and world-famous celebrities, becomes the settingThe stakes are high when the world's most elite counter-terrorism unit enters Las Vegas, where over 36.7 million men, women and children visit each year. \"Sin City,\" the home of the famous Las Vegas Strip, flashy hotels, high-rolling casinos and world-famous celebrities, becomes the setting for a terrorist threat of global proportions. What happens when one of the world's most famous cities is held hostage by terrorists? [Ubisoft]… Expand"
  },
  {
    "name": "Super Street Fighter II Turbo HD Remix",
    "details_link": "https://www.metacritic.com/game/xbox-360/super-street-fighter-ii-turbo-hd-remix",
    "publisher": "Capcom",
    "release_date": "Nov 26 2008",
    "developers": [
      "Backbone Entertainment",
      "Backbone Emeryville"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "2D",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/239772b020d137decab7c6908abd735f-98.jpg",
    "descriptions": "[Xbox Live Arcade]  The original MMA series is back! Super Street Fighter II Turbo HD Remix receives a whole new look while improving on the innovative fighting system of the original game. Updated with 1080p HD redrawn art, widescreen support and remixed music, SSFHD Remix offers a unique[Xbox Live Arcade]  The original MMA series is back! Super Street Fighter II Turbo HD Remix receives a whole new look while improving on the innovative fighting system of the original game. Updated with 1080p HD redrawn art, widescreen support and remixed music, SSFHD Remix offers a unique experience appealing to new fans and Street Fighter purists alike. Play at home versus a friend or test your skills online. A new Remixed mode incorporates new techniques for your favorite characters, and the original Super Street Fighter II Turbo mode is built-in for those who want to revisit the game's old school gameplay. [Capcom]… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2005",
    "details_link": "https://www.metacritic.com/game/xbox/tiger-woods-pga-tour-2005",
    "publisher": "EA Sports",
    "release_date": "Sep 20 2004",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "4  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/3/a48d2e47aaafd2b0f4400dd18dd02ae7-98.jpg",
    "descriptions": "Challenge professional golfer Tiger Woods to challenging matches in Tiger Woods PGA Tour 2005. This time, you can modify course dynamics and add longer trees, tighter fairways, undulations to greens, deeper bunkers, and more. The game's EA Sports Game Face features nonproportional boneChallenge professional golfer Tiger Woods to challenging matches in Tiger Woods PGA Tour 2005. This time, you can modify course dynamics and add longer trees, tighter fairways, undulations to greens, deeper bunkers, and more. The game's EA Sports Game Face features nonproportional bone scaling and texture blending to provide more realistic looks. After creating your own golfer and making a name for yourself, unlock the chance to tee off against some of golf's greatest legends, including Arnold Palmer, Jack Nicklaus, and Ben Hogan.… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2004",
    "details_link": "https://www.metacritic.com/game/pc/tiger-woods-pga-tour-2004",
    "publisher": "EA Sports",
    "release_date": "Sep 22 2003",
    "developers": [
      "Headgate"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/7/34f3487d88868190317a3e3031f729d6-98.jpg",
    "descriptions": "With the revolutionary new EA SPORTS Game Face, you can build yourself from scratch and take on the pros while improving your skills with each solid performance. Play as or against over a dozen top pros, including Tiger Woods, Vijay Singh, Justin Leonard, and new golfers like John Daly andWith the revolutionary new EA SPORTS Game Face, you can build yourself from scratch and take on the pros while improving your skills with each solid performance. Play as or against over a dozen top pros, including Tiger Woods, Vijay Singh, Justin Leonard, and new golfers like John Daly and Adam Scott. Five new courses have been added to all the old favorites like Pebble Beach Golf Links and St Andrews Golf Links. Graphical and gameplay enhancements mean more ball control and more realistic weather and terrain conditions. Expanded Career Mode lets you take your golfer through a World Tour to earn money and sponsorships. Go online for matches and tournaments, and climb the leaderboards. [EA Sports]… Expand"
  },
  {
    "name": "Warcraft III: The Frozen Throne",
    "details_link": "https://www.metacritic.com/game/pc/warcraft-iii-the-frozen-throne",
    "publisher": "Blizzard Entertainment",
    "release_date": "Jul  1 2003",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "1-12 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 88,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/5/440d68784e82e92b9b4ea004a5d1aa4d-98.jpg",
    "descriptions": "The Frozen Throne provides gamers with a vast new chapter in the epic Warcraft saga. In the single-player campaign, players revisit the war-torn world of Azeroth. Several months have passed since Archimonde and the Burning Legion were defeated at the battle of Mount Hyjal, yet a new threatThe Frozen Throne provides gamers with a vast new chapter in the epic Warcraft saga. In the single-player campaign, players revisit the war-torn world of Azeroth. Several months have passed since Archimonde and the Burning Legion were defeated at the battle of Mount Hyjal, yet a new threat has arisen throughout the land. One new Hero per race, each possessing powerful spells and magical abilities. A host of new units, each equipped with new abilities and spells, giving players the opportunity to create diverse strategic and tactical forms of combat. Player-built shops, unique for each race, equipped with items carefully designed to improve and aid the units of every race. Neutral Heroes, available for recruitment by all players, that can supplement and strengthen a player's army with all new spells and abilities. Expanded multiplayer options over Battle.net including multiple new game types, clan and tournament support. [Blizzard]… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2003",
    "details_link": "https://www.metacritic.com/game/xbox/tiger-woods-pga-tour-2003",
    "publisher": "Electronic Arts",
    "release_date": "Oct 27 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/8/7ac5bbdb2d61d6522757e5d354231c74-98.jpg",
    "descriptions": "From towering drives to picture-perfect putts, the essence of golf has been captured in Tiger Woods PGA Tour 2003.  The game features plenty of challenging courses such as Pebble Beach Golf Links and Royal Birkdale.  Plus, you can choose from a variety of professional golfers, each withFrom towering drives to picture-perfect putts, the essence of golf has been captured in Tiger Woods PGA Tour 2003.  The game features plenty of challenging courses such as Pebble Beach Golf Links and Royal Birkdale.  Plus, you can choose from a variety of professional golfers, each with their own strengths and weaknesses.  Hit the course as Tiger Woods or put your skills up against his in a one-on-one showdown, but either way, be prepared to bring your best game.  … Expand"
  },
  {
    "name": "Tactics Ogre: The Knight of Lodis",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/tactics-ogre-the-knight-of-lodis",
    "publisher": "Atlus Co.",
    "release_date": "May 11 2002",
    "developers": [
      "Quest"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/9/d24859a9ca10470ebf0acce624d17c1f-98.jpg",
    "descriptions": "Under the watchful eye of the Holy Lodis Empire, strange things are happening on the island of Ovis. Powerful forces have been set in motion, but their motives are masked by political intrigue. It is your mission to investigate these occurrences and discover the true intentions of thoseUnder the watchful eye of the Holy Lodis Empire, strange things are happening on the island of Ovis. Powerful forces have been set in motion, but their motives are masked by political intrigue. It is your mission to investigate these occurrences and discover the true intentions of those involved. The ending of the game will depend on the actions that the main character, Alphonse, takes. You will make many revelations as you proceed, but you must survive the unrelenting battles and cultivate your characters' abilities to unveil the ultimate truth.… Expand"
  },
  {
    "name": "Starcraft",
    "details_link": "https://www.metacritic.com/game/pc/starcraft",
    "publisher": "Blizzard Entertainment",
    "release_date": "Mar 31 1998",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "Command"
    ],
    "meta_score": 88,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/2/299287436d77bb79a9de85183b4e8970-98.jpg",
    "descriptions": "In the distant future a small group of human exiles have been doomed to fight for survival on the edge of the galaxy. Through military strength, espionage and deceit, a unified Terran government has maintained an uneasy peace. As resources run short, however, these Confederate nations findIn the distant future a small group of human exiles have been doomed to fight for survival on the edge of the galaxy. Through military strength, espionage and deceit, a unified Terran government has maintained an uneasy peace. As resources run short, however, these Confederate nations find themselves looking towards the rich worlds of their alien neighbors, the enigmatic Protoss. To further complicate matters, it seems that a previously unknown and deadly species known only as the Zerg has entered Protoss space and is destroying everything in its path. The time for war has come... As the military leader for your species, you must gather the resources you need to train and expand your forces and lead them to victory. 30 unique missions will challenge you across three different campaigns as you control the fate of the galaxy.… Expand"
  },
  {
    "name": "Assassin's Creed IV: Black Flag",
    "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-iv-black-flag",
    "publisher": "Ubisoft",
    "release_date": "Oct 29 2013",
    "developers": [
      "Ubisoft"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PlayStation 3"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/69a76847a614803717766e55d673ba24-98.jpg",
    "descriptions": "The year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroyThe year is 1715. Pirates rule the waters of the Caribbean and have established a lawless Republic. Among these outlaws is a lethal young captain named Edward Kenway. His notorious exploits earn the respect of legends like Blackbeard, but draw him into an ancient war that may destroy everything the pirates have built for themselves.… Expand"
  },
  {
    "name": "Battlefield: Bad Company 2",
    "details_link": "https://www.metacritic.com/game/playstation-3/battlefield-bad-company-2",
    "publisher": "EA Games",
    "release_date": "Mar  2 2010",
    "developers": [
      "EA DICE"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 24 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/9/6fd5c7840c1bd0f57512ca8667009453-98.jpg",
    "descriptions": "In this installment, the Bad Company crew again find themselves in the heart of the action, where they must use every weapon and vehicle at their disposal to survive. In Battlefield: Bad Company 2, the 'B' company fight their way through snowy mountaintops, dense jungles and dusty villages.In this installment, the Bad Company crew again find themselves in the heart of the action, where they must use every weapon and vehicle at their disposal to survive. In Battlefield: Bad Company 2, the 'B' company fight their way through snowy mountaintops, dense jungles and dusty villages. With a heavy arsenal of deadly weapons and a slew of vehicles to aid them, the crew set off on their mission and they are ready to blow up, shoot down, blast through, wipe out and utterly destroy anything that gets in their way. Total destruction is the name of the game, delivered as only the DICE next generation Frostbite engine can. [Electronic Arts]… Expand"
  },
  {
    "name": "The Last of Us: Left Behind",
    "details_link": "https://www.metacritic.com/game/playstation-3/the-last-of-us-left-behind",
    "publisher": "SCEA",
    "release_date": "Feb 14 2014",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 3"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "General",
      "Modern",
      "Linear"
    ],
    "meta_score": 88,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/3/2b37dde8ef83563b0e39854240709700-98.jpg",
    "descriptions": "Ellie returns as new light is shed on her relationship with Riley, her best friend from the military boarding school in which they both grew up. After inexplicably disappearing for weeks, Riley reappears in Ellie’s life with a surprising revelation. The two sneak out of their school for theEllie returns as new light is shed on her relationship with Riley, her best friend from the military boarding school in which they both grew up. After inexplicably disappearing for weeks, Riley reappears in Ellie’s life with a surprising revelation. The two sneak out of their school for the last time, leading to a series of events that might forever change their lives.… Expand"
  },
  {
    "name": "Tunic",
    "details_link": "https://www.metacritic.com/game/switch/tunic",
    "publisher": "Finji",
    "release_date": "Sep 27 2022",
    "developers": [
      "ISOMETRICORP Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action Adventure",
      "Action RPG",
      "Open-World"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/8595496f65ba8a54fca031531860a445-98.jpg",
    "descriptions": "TUNIC is an action adventure game about a tiny fox in a big world where you don't belong. Presented by Finji.\r Developed by Andrew Shouldice, TUNIC is a game shrouded in mystery and intrigue. Crafted to evoke feelings of classic action adventure games, TUNIC stars a heroic little fox asTUNIC is an action adventure game about a tiny fox in a big world where you don't belong. Presented by Finji.\r Developed by Andrew Shouldice, TUNIC is a game shrouded in mystery and intrigue. Crafted to evoke feelings of classic action adventure games, TUNIC stars a heroic little fox as they explore a foreign land that hides danger around every corner. Discover unique items, new combat techniques, and arcane secrets as our hero forges their way through intriguing new world. \r\rExplore a land filled with lost legends, ancient powers, and ferocious monsters in TUNIC, an isometric action game about a small fox on a big adventure. Stranded on a mysterious beach, armed with only your own curiosity, you will confront colossal beasts, collect strange and powerful items, and unravel long-lost secrets.\r * Explore a hostile and intricately-connected world of shady forests, sprawling ruins, and labyrinthine catacombs\r* Fight mighty bosses deep beneath the earth, high above the clouds, and in places stranger still\r* Collect the missing manual pages, bursting with hints and original full-colour illustrations\r* Discover hidden treasures to help you on your way\r* Unearth secret relics, secret techniques, secret puzzles, and listen, there's a lot of secrets!\r* Featuring sound design by Power Up Audio (Celeste, Darkest Dungeon, Subnautica: Below Zero)\r* And an original soundtrack by Lifeformed (Dustforce, Double Fine Adventure)\r Keep your wits about you and be brave, little fox!… Expand"
  },
  {
    "name": "Far Cry 3",
    "details_link": "https://www.metacritic.com/game/pc/far-cry-3",
    "publisher": "Ubisoft",
    "release_date": "Dec  4 2012",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/8/5d85507c8f39f0d8cb95d0f3d5a3fa60-98.jpg",
    "descriptions": "With Far Cry 3, players step into the shoes of Jason Brody, a man alone at the edge of the world, stranded on a mysterious tropical island. In this savage paradise where lawlessness and violence are the only sure thing, players dictate how the story unfolds, from the battles they choose toWith Far Cry 3, players step into the shoes of Jason Brody, a man alone at the edge of the world, stranded on a mysterious tropical island. In this savage paradise where lawlessness and violence are the only sure thing, players dictate how the story unfolds, from the battles they choose to fight to the allies or enemies they make along the way. As Jason Brody, players will slash, sneak, detonate and shoot their way across the island in a world that has lost all sense of right and wrong.… Expand"
  },
  {
    "name": "Dead Cells: Return to Castlevania",
    "details_link": "https://www.metacritic.com/game/pc/dead-cells-return-to-castlevania",
    "publisher": "Motion Twin",
    "release_date": "Mar  6 2023",
    "developers": [
      "Motion Twin"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/beb02db1bdb871d5d29553eabc7ccd66-98.jpg",
    "descriptions": "The inspiration behind it all returns to its 2D action roots! Castlevania's unforgettable characters & gothic setting meet the fast-paced combat of the award-winning roguelite Dead Cells in this unprecedented collaboration. A gateway to a striking castle has suddenly appeared, and anThe inspiration behind it all returns to its 2D action roots! Castlevania's unforgettable characters & gothic setting meet the fast-paced combat of the award-winning roguelite Dead Cells in this unprecedented collaboration. A gateway to a striking castle has suddenly appeared, and an imposing warrior called Richter asks you to help him vanquish the great evil within.\r Enticed by the promise of new loot rather than a sense of moral duty, you strike out through the grounds and corridors of the gothic castle to find and kill this mysterious Dracula...\r Slay hordes of his supernatural minions as you progress through our biggest DLC yet, including two levels, three bosses and a new storyline!… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 10",
    "details_link": "https://www.metacritic.com/game/wii/tiger-woods-pga-tour-10",
    "publisher": "Electronic Arts",
    "release_date": "Jun  8 2009",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/9cc2d67a5ab12960d936219eeb177e7b-98.jpg",
    "descriptions": "Tiger Woods PGA Tour 10 takes golf fans inside-the-ropes to experience the drama and emotion of tournament golf. In addition, the U.S. Open, a USGA championship, and the USGA’s Rules of Golf is available in Tiger Woods PGA Tour 10 for the first time in franchise history. As you hear the roarTiger Woods PGA Tour 10 takes golf fans inside-the-ropes to experience the drama and emotion of tournament golf. In addition, the U.S. Open, a USGA championship, and the USGA’s Rules of Golf is available in Tiger Woods PGA Tour 10 for the first time in franchise history. As you hear the roar of the crowd from the next hole over, can you handle the mounting pressure while you stand over your tournament-winning putt? Expanded crowds surround every hole; adding to the tension and excitement of each shot. A first for the franchise, real-time weather is reflected on every course, ensuring the in-game experience matches that of the current weather conditions. Tiger Woods PGA Tour 10 also features a television broadcast style presentation, which include instantaneous updates and a new announcer team of ESPN’s Scott Van Pelt and the Golf Channel’s Kelly Tilghman. [Electronic Arts]… Expand"
  },
  {
    "name": "Ratchet & Clank: Rift Apart",
    "details_link": "https://www.metacritic.com/game/playstation-5/ratchet-clank-rift-apart",
    "publisher": "PlayStation Studios",
    "release_date": "Jun 11 2021",
    "developers": [
      "Insomniac Games"
    ],
    "platforms": "PlayStation 5",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 88,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/1/55ecfef13c44fdf3f23d385d310a64e2-98.jpg",
    "descriptions": "Ratchet & Clank: Rift Apart is an intergalactic adventure from Insomniac Games that showcases what’s possible for games designed around PS5’s  SSD and DualSense wireless controller. Players seamlessly travel through different dimensions in mid-gameplay. The DualSense wireless controllerRatchet & Clank: Rift Apart is an intergalactic adventure from Insomniac Games that showcases what’s possible for games designed around PS5’s  SSD and DualSense wireless controller. Players seamlessly travel through different dimensions in mid-gameplay. The DualSense wireless controller brings combat to life, with haptic feedback and the adaptive triggers adding powerful sensations that increase immersion in combat.… Expand"
  },
  {
    "name": "DOOM Eternal",
    "details_link": "https://www.metacritic.com/game/xbox-one/doom-eternal",
    "publisher": "Bethesda Softworks",
    "release_date": "Mar 19 2020",
    "developers": [
      "id Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Switch",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "Up to 3 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/5/e2edd6022f418bf951ba01b19458eb65-98.jpg",
    "descriptions": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell.DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]… Expand"
  },
  {
    "name": "Star Wars Pinball: Balance of the Force",
    "details_link": "https://www.metacritic.com/game/xbox-360/star-wars-pinball-balance-of-the-force",
    "publisher": "Zen Studios",
    "release_date": "Oct 16 2013",
    "developers": [
      "Zen Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation Vita",
      "Wii U",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Miscellaneous",
      "Parlor",
      "Pinball",
      "Pinball"
    ],
    "meta_score": 88,
    "users_score": 6.1,
    "image": "https://static.metacritic.com/images/products/games/3/4089d2a85e761f947fc0e04fe924c74d-98.jpg",
    "descriptions": "Feel the disturbance in the Force in Star Wars Pinball: Balance of the Force, featuring three brand new Star Wars pinball tables. The pack includes Star Wars: Episode VI Return of the Jedi, Starfighter Assault, and a table dedicated to Darth Vader."
  },
  {
    "name": "World Soccer Winning Eleven 8 International",
    "details_link": "https://www.metacritic.com/game/pc/world-soccer-winning-eleven-8-international",
    "publisher": "Konami",
    "release_date": "Feb 16 2005",
    "developers": [
      "KCET"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/3/009f6763267c322ef96b053acbc22a97-98.jpg",
    "descriptions": "Winning Eleven 8 once again raises the bar with in-depth gameplay, improved realism and increased control. The game now features all the teams from the Italian, Spanish and Dutch leagues under the official license. Featuring 136 club teams and 57 national teams, Winning Eleven 8 offersWinning Eleven 8 once again raises the bar with in-depth gameplay, improved realism and increased control. The game now features all the teams from the Italian, Spanish and Dutch leagues under the official license. Featuring 136 club teams and 57 national teams, Winning Eleven 8 offers gamers control of up to 4,500 of the world's greatest soccer players. The game introduces a wealth of new moves and tricks including new free kick and penalty kick techniques, an innovative indirect free kick move and a new dribbling system that offers more control as gamers go one-on-one and try to pass opposing players. Also featured is the first-ever on-screen referee in the history of the series. Boasting an enhanced ref AI, the referee will run up and down the field reacting realistically and instinctively to fouls, giving advantage for minor infringements and even stepping in to calm things down when the action gets heated. Winning Eleven 8 also features improvements to the popular Master League, which now has more strategy through player development and injury, and a new 'My Best Eleven' option so fans can save their greatest teams. [Konami]… Expand"
  },
  {
    "name": "Rogue Legacy 2",
    "details_link": "https://www.metacritic.com/game/pc/rogue-legacy-2",
    "publisher": "Cellar Door Games",
    "release_date": "Apr 28 2022",
    "developers": [
      "Cellar Door Games"
    ],
    "platforms": [
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Role-Playing",
      "Platformer",
      "Roguelike",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/12287dbb323b6d9a9ad10e9eae5a7f1e-98.jpg",
    "descriptions": "Rogue Legacy 2 is what you'd get if you mashed Rogue Legacy and a sequel together. Every time you die, your children will succeed you, and each child is unique. Your daughter might be a Colourblind Archer, and your son could be a Pacifistic Chef. Either way, one of them is getting conscripted."
  },
  {
    "name": "Fight Night Round 2",
    "details_link": "https://www.metacritic.com/game/xbox/fight-night-round-2",
    "publisher": "EA Sports",
    "release_date": "Feb 28 2005",
    "developers": [
      "EA Sports"
    ],
    "platforms": "Xbox",
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Boxing"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/1/6d63387dbf3f997888fc2cdb806b9472-98.jpg",
    "descriptions": "The sequel to EA Sports' Fight Night 2004 maintains the original's analog control scheme and introduces a variety of new features. Now you have access to even more punches, including a new \"haymaker\" punch that is just powerful enough to knock down your opponent. Every hit countsThe sequel to EA Sports' Fight Night 2004 maintains the original's analog control scheme and introduces a variety of new features. Now you have access to even more punches, including a new \"haymaker\" punch that is just powerful enough to knock down your opponent. Every hit counts in this game, as injuries reduce a fighter's ability to defend himself. Your cut man can tend to your injuries in between rounds to help you survive your opponent's devastating punches.… Expand"
  },
  {
    "name": "Cuphead in the Delicious Last Course",
    "details_link": "https://www.metacritic.com/game/switch/cuphead-in-the-delicious-last-course",
    "publisher": "Studio MDHR",
    "release_date": "Jun 30 2022",
    "developers": [
      "Studio MDHR"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/2e7423c0d46b995104f9d912ce9ad6b0-98.jpg",
    "descriptions": "Another helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, andAnother helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, and Ms. Chalice’s unique abilities, players will take on a new cast of fearsome, larger than life bosses to assist the jolly Chef Saltbaker in Cuphead’s final challenging quest! … Expand"
  },
  {
    "name": "The Secret of Monkey Island: Special Edition",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-secret-of-monkey-island-special-edition",
    "publisher": "LucasArts",
    "release_date": "Jul 15 2009",
    "developers": [
      "LucasArts"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "General",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 88,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/1/794100b9002f14b2d5b381fd2f35fd78-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Pirates! Adventure! Monkeys! Relive the hilarious swashbuckling misadventures of the wannabe pirate Guybrush Threepwood as he attempts to become the most infamous pirate in the Caribbean! Back by popular demand, The Secret of Monkey Island: Special Edition faithfully[Xbox Live Arcade]  Pirates! Adventure! Monkeys! Relive the hilarious swashbuckling misadventures of the wannabe pirate Guybrush Threepwood as he attempts to become the most infamous pirate in the Caribbean! Back by popular demand, The Secret of Monkey Island: Special Edition faithfully re-imagines the internationally-acclaimed classic pirate adventure game from LucasArts in gorgeous HD detail. Featuring an all new re-imagined contemporary art style, hand-drawn and presented in 1080p, complete voice over by members of the original Monkey Island - franchise cast, a re-mastered musical score using live instruments, plus scene-for scene-hot swap to seamlessly transition between Special Edition and Classic modes at anytime. Embark on a bumbling misadventure in an attempt to become the most infamous pirate in the Caribbean, win the heart of the beautiful governor, Elaine Marley, and confront the evil ghost pirate, LeChuck! The game is all-new and re-imagined with a contemporary art style, hand-drawn and presented in 1080p. Complete voice over using original Monkey Island franchise cast members brings the story and characters to life like never before. Enjoy the re-mastered and re-recorded musical score using live instruments. Scene-for-scene hot swap lets you seamlessly transition between Special Edition and Classic modes at anytime during gameplay. The all-new intuitive game interface and controls provide a more interactive gameplay experience. Hint system: Not sure what to do next? The in-game puzzle hint system keeps the puzzles fresh and fun. [LucasArts]… Expand"
  },
  {
    "name": "Shovel Knight",
    "details_link": "https://www.metacritic.com/game/wii-u/shovel-knight",
    "publisher": "Yacht Club Games",
    "release_date": "Jun 26 2014",
    "developers": [
      "Yacht Club Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Xbox One",
      "Wii U"
    ],
    "genres": [
      "Platformer",
      "2D",
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/5c453348cdd4d31871e626aaed5e0438-98.jpg",
    "descriptions": "Shovel Knight is a sweeping classic action adventure game with memorable characters and an 8-bit retro aesthetic created by Yacht Club Games. You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this valley with two goals: to defeat the evilShovel Knight is a sweeping classic action adventure game with memorable characters and an 8-bit retro aesthetic created by Yacht Club Games. You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this valley with two goals: to defeat the evil Enchantress and save his lost beloved. He wields a ShovelBlade; a multipurpose weapon whose techniques have now been lost to the ages. Always honest and helpful, Shovel Knight is a shining example of the code of Shovelry: Slash Mercilessly and Dig Tirelessly. However, between Shovel Knight and his beloved stands a cadre of villainous knights. These terrible foes, known as The Order of No Quarter, have been dispatched to prevent Shovel Knight from reaching the Enchantress at any cost.… Expand"
  },
  {
    "name": "Rayman Origins",
    "details_link": "https://www.metacritic.com/game/playstation-vita/rayman-origins",
    "publisher": "Ubisoft",
    "release_date": "Feb 15 2012",
    "developers": [
      "UBlart Montpellier"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PlayStation Vita"
    ],
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/4/f13384985224c0c1568ef6e240cfe940-98.jpg",
    "descriptions": "Michel Ancel, celebrated creator of Rayman, Beyond Good & Evil and the Raving Rabbids returns to his roots to bring us Rayman Origins: a high-definition, 2D side-scrolling, platforming adventure!\rPlay Rayman Origins and discover or rediscover the magical universe and legendary 2D gameplayMichel Ancel, celebrated creator of Rayman, Beyond Good & Evil and the Raving Rabbids returns to his roots to bring us Rayman Origins: a high-definition, 2D side-scrolling, platforming adventure!\rPlay Rayman Origins and discover or rediscover the magical universe and legendary 2D gameplay that captured the hearts of fans...\rWhen the Glade of Dreams is overrun by \"nefurrious\" Darktoons, the Fairy Council hastily invokes Rayman to save the day; but the hero of light isn't quite all there...To help him, Rayman teams up with his best friend, Globox, and two crafty wizards, the Teensies. Together, the world's most hilarious team of heroes will need to restore peace to the Glade or watch as their beloved home vanishes like a bad dream... [Sony]… Expand"
  },
  {
    "name": "Project Gotham Racing 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/project-gotham-racing-3",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 16 2005",
    "developers": [
      "Bizarre Creations"
    ],
    "platforms": "Xbox 360",
    "num_players": "Up to 8 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 88,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/97c9ed2f5855bf423e3c6fdf4f8d597a-98.jpg",
    "descriptions": "The original Kudos challenge: Powersliding, pulling off a 360, getting airtime, staying on the race line, drafting, and getting up on two wheels will earn gamers Kudos points for their style and skill. Take the wheel of more than 80 authentically modeled and licensed supercars fromThe original Kudos challenge: Powersliding, pulling off a 360, getting airtime, staying on the race line, drafting, and getting up on two wheels will earn gamers Kudos points for their style and skill. Take the wheel of more than 80 authentically modeled and licensed supercars from manufacturers such as Ferrari, Dodge, and Lamborghini with fully modeled interiors, functioning dashboards and individually recorded engine roars. Drive in New York, Tokyo, and many other cities, all brought to life with motion-captured crowds of people. Show off in front of a global audience. With GothamTV, gamers can watch any player in the world on live news feeds, get live ticker-tape information when friends break records, and compete with anyone, anywhere, anytime. [Microsoft]… Expand"
  },
  {
    "name": "NBA 2K17",
    "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k17",
    "publisher": "2K Games",
    "release_date": "Sep 16 2016",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Sports",
      "Team",
      "Basketball",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/5/69e511eacd3793a9638b5dae38697af9-98.jpg",
    "descriptions": "NBA 2K17 promises to take the game to new heights and continue to blur the lines between video game and reality."
  },
  {
    "name": "Battlefield: Bad Company 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/battlefield-bad-company-2",
    "publisher": "EA Games",
    "release_date": "Mar  2 2010",
    "developers": [
      "EA DICE"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 24 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 88,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/1cce9b60dfac7579eec4911e69533932-98.jpg",
    "descriptions": "In this installment, the Bad Company crew again find themselves in the heart of the action, where they must use every weapon and vehicle at their disposal to survive. In Battlefield: Bad Company 2, the 'B' company fight their way through snowy mountaintops, dense jungles and dusty villages.In this installment, the Bad Company crew again find themselves in the heart of the action, where they must use every weapon and vehicle at their disposal to survive. In Battlefield: Bad Company 2, the 'B' company fight their way through snowy mountaintops, dense jungles and dusty villages. With a heavy arsenal of deadly weapons and a slew of vehicles to aid them, the crew set off on their mission and they are ready to blow up, shoot down, blast through, wipe out and utterly destroy anything that gets in their way. Total destruction is the name of the game, delivered as only the DICE next generation Frostbite engine can. [Electronic Arts]… Expand"
  },
  {
    "name": "The World Ends with You",
    "details_link": "https://www.metacritic.com/game/ds/the-world-ends-with-you",
    "publisher": "Square Enix",
    "release_date": "Apr 22 2008",
    "developers": [
      "Jupiter Corporation"
    ],
    "platforms": [
      "iPhone/iPad",
      "DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/73fbdf7c5420ba64e185f16be7b09504-98.jpg",
    "descriptions": "The story begins as our hero, Neku, wakes up amidst the hustle and bustle of Shibuya, Tokyo. Confused and disoriented, he receives a message on his phone warning him that he will cease to exist unless he completes a certain mission. With his life seemingly on the line, Neku plunges into theThe story begins as our hero, Neku, wakes up amidst the hustle and bustle of Shibuya, Tokyo. Confused and disoriented, he receives a message on his phone warning him that he will cease to exist unless he completes a certain mission. With his life seemingly on the line, Neku plunges into the back streets of the urban labyrinth... Experience the urban grit and neon of the coolest district in Tokyo with a distinctive, high quality style of in-game artwork. Meet an achingly hip cast of characters each with an interesting personality and stylish sense in fashion, music and culture. Highly innovative and intuitive combat system that makes full use of the Nintendo DS Touch Screen, Dual Screens and Microphone. Use psychic powers to read the thoughts of the population, put words into people's minds, and move objects to help you progress in your adventure. Immerse yourself in an amazing audio soundtrack featuring a diverse fusion of bleeding-edge hip-hop, rock, and techno. A tale of friendship, hope and overcoming your challenges, creatively told with a modern edge. Shop till you drop: Keep abreast of the latest Trends to stay one step ahead of the fashion scene and your enemies. Trade items with friends using Nintendo Wi-Fi Connection too. Action-packed minigame fun that can be enjoyed by up to four players via DS Wireless Play. Engage the Chance Encounter mode via DS Wireless Play to share data with fellow game users you bump into in the real world. [Square Enix]… Expand"
  },
  {
    "name": "Torchlight II",
    "details_link": "https://www.metacritic.com/game/pc/torchlight-ii",
    "publisher": "Runic Games",
    "release_date": "Sep 20 2012",
    "developers": [
      "Runic Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 88,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/5/20ce761ce0bffc52043bc2079c48a906-98.jpg",
    "descriptions": "Beyond the town of Torchlight lies a world shrouded in adventure and mystery. Guardian-warrior Syl appears in a prophetic dream, summoning the player to the Estherian Steppes. There, you meet with the Destroyer and soon venture across the continent of Vilderan, an exotic frontier besieged byBeyond the town of Torchlight lies a world shrouded in adventure and mystery. Guardian-warrior Syl appears in a prophetic dream, summoning the player to the Estherian Steppes. There, you meet with the Destroyer and soon venture across the continent of Vilderan, an exotic frontier besieged by forces of evil. A discovery unfolds, that the Alchemist, following his conquest of dark ember, disappeared on his quest to defeat the unknown corrupted force responsible for destroying the mystical race of Estherians. Aided by Syl, the remaining Estherian Guardians, and clues left behind by the missing Alchemist, you will find yourself battling a powerful enemy that threatens to unravel the elements of the entire world. Torchlight 2.… Expand"
  },
  {
    "name": "XCOM 2",
    "details_link": "https://www.metacritic.com/game/pc/xcom-2",
    "publisher": "2K Games",
    "release_date": "Feb  5 2016",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Tactics"
    ],
    "meta_score": 88,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/7/d8e98ec00beecf2724f44a262f4cb25c-98.jpg",
    "descriptions": "20 years have passed since world leaders unconditionally surrendered to alien forces and XCOM, the world's last line of defense, was left destroyed and scattered. Now the aliens hold dominion over the Earth, building shining cities that promise a brilliant future for humanity on the surface,20 years have passed since world leaders unconditionally surrendered to alien forces and XCOM, the world's last line of defense, was left destroyed and scattered. Now the aliens hold dominion over the Earth, building shining cities that promise a brilliant future for humanity on the surface, while hiding a sinister intent below and eliminating all who don't fall in like with their new order. Online those who live a the edges of the world have a modicum of freedom. Here, a force gathers once again to stand up for humanity. Consistently on the run, the remnant XCOM forces need to find a way to regroup, expose the nefarious truth behind the occupation, and eliminate the alien threat for good.… Expand"
  },
  {
    "name": "Dishonored 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/dishonored-2",
    "publisher": "Bethesda Softworks",
    "release_date": "Nov 10 2016",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 88,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/642adcf09369ac4cf0f7b33f2845e851-98.jpg",
    "descriptions": "Dishonored 2 takes your protagonist, Corvo Attano or Emily Kaldwin, to the coastal city of Karnaca where the choices you make will have significant impact on the world."
  },
  {
    "name": "13 Sentinels: Aegis Rim",
    "details_link": "https://www.metacritic.com/game/switch/13-sentinels-aegis-rim",
    "publisher": "Sega",
    "release_date": "Apr 12 2022",
    "developers": [
      "Vanillaware"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 88,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/0/d2bc3f5641aa67547713d4428c7a1ff8-98.jpg",
    "descriptions": "Vanillaware, the storytellers behind Odin Sphere and Dragon's Crown, craft a sci-fi mystery epic spanning thirteen intertwining stories. Uncover the truth and delve into a 2D sidescrolling adventure featuring gorgeous art and environments. Then, battle the kaiju in fast-paced, top-downVanillaware, the storytellers behind Odin Sphere and Dragon's Crown, craft a sci-fi mystery epic spanning thirteen intertwining stories. Uncover the truth and delve into a 2D sidescrolling adventure featuring gorgeous art and environments. Then, battle the kaiju in fast-paced, top-down combat. Customize the Sentinels with an arsenal of mechsuit weaponry, and fight to defend humanity! A departure from the studio's traditional fantasy style, the game takes place in a modern setting punctuated with giant mechs. Although the world may be bleak, Vanillaware's signature artistic shine and gorgeous aesthetics will bring the characters and story of 13 Sentinels to life. \r\rCHARACTERS:\r JURO KURABE\rA mild-mannered young high school student trying to live a normal life in the 80s. Rarely excited, he is fond of campy old Sci-Fi movies, with their giant robots and space invasions. But it seems like everyone in his life is trying to manipulate him for their own ominous ends...\r IORI FUYUSAKA\rShe believes she's an ordinary high school girl, with dreams and crushes and a sweet tooth. However, she finds herself at the center of a massive conspiracy, called on to stop an apocalypse before the world is doomed. What she's not sure about is: can she really answer the call? \r\rEI SEKIGAHARA \rA stoic young man with amnesia, Ei finds himself next to a dead body without any memories of his past. Declared a boy \"from another dimension\", he's constantly pursued by armed gunmen in black suits, and often finds himself in intense life-or-death situations. Through investing the clues and people in 1985, he chases the truth beyond his lost memories... \r\rKEITARO MIURA \rA dutiful young soldier from 1945, fiercely dedicated to defending his country. He'd lay down his life if it meant saving even a single soul. Chosen as part of a secret military program to pilot a new weapon called a \"Sentinel\", Miura soon discovers that his true enemies lie beyond World War II... \r\rMEGUMI YAKUSHIJI\rA shy, composed girl of few words, with a nurturing domestic side. While she's devoted to her beloved, Juro, he himself has lost all memory of their past relationship. Goaded on by a mysterious talking cat, she agrees to a \"contract\" -- willing to go to any length to restore the boy she loves. \r\rNATSUNO MINAMI \rA perky, friendly girl on her high school's track team who loves a good Sci-Fi story. When she discovers a small robot hiding in the school, it seems like a story out of one of her favorite movies. However, she finds herself drawn into a massive, apocalyptic conspiracy in which the dangers of her favorite shows becomes disturbingly real. \r\rNENJI OGATA\rA high school punk with a heart of gold. He prefers to punch first and ask questions later, so when he gets involved in a convoluted conspiracy, most of the geek-talk goes over his head. Still, he's determined to bust through and save the girl -- even if he's resigned to her thinking he's just another thug. \r\rRENYA GOUTO\rA cold, brilliant young man who will use any means necessary to find the truth. Gouto processes information and startling revelations with a calm, ready intelligence that baffles (or outpaces) the adults around him. He's no villain, but he knows what's at stake, and what must be done. \r\rRYOKO SHININOME \rAn aloof agent desperate to prove her worth to her unrequited love (and mentor) Tetsuya Ida. A mission gone wrong left Ryoko with traumatic brain damage, and dependent on a medicine of unclear origins. Still, she fights through the mental fog and pain to untangle the conspiracies... \r\rSHU AMIGUCHI \rAn easygoing late-80s high school playboy, quick to make friends and quick to flirt. Tries not to take life too seriously, whether it's on his side or not. But when his TV turns on by itself, and an idol starts talking to him through it, begging for his help unraveling a mystery...he rolls with it as best he can. \r\rTAKATOSHI HIJIYAMA\rA confident young Japanese soldier in the 1940s, displaced from his home and dropped into a city both foreign and familiar. Adrift, old-fashioned, and out of place, he struggles to make sense of all the changes in his world...and then, after months of living as a solitary vagrant, he finds the young man responsible for uprooting his life. \r\rTOMI KISARAGI\rA flippant, shy teenager. She often hangs out with her gal pals after school, getting snacks and chatting like any other, but she seems to know more than she lets on. Determined to investigate the mysteries of her fate, she surreptitiously follows whatever lead she can, only to discover even greater peril awaiting her...\r YUKI TAKAMIYA \rA surly delinquent who (reluctantly) infiltrates the school as a spy to save her best friend. Despite her disdain for her underhanded allies, she stubbornly seeks the truth when everyone else has something to hide. Tough and caustic, but she's got a protective streak and a sharp mind.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 1 + 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/tony-hawks-pro-skater-1-+-2",
    "publisher": "Activision",
    "release_date": "Sep  4 2020",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Sports",
      "Individual",
      "Skate / Skateboard"
    ],
    "meta_score": 88,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/12d3fd1f4dd7b0f58c11a18952083b46-98.jpg",
    "descriptions": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more."
  },
  {
    "name": "What Remains of Edith Finch",
    "details_link": "https://www.metacritic.com/game/switch/what-remains-of-edith-finch",
    "publisher": "Annapurna Interactive",
    "release_date": "Jul  4 2019",
    "developers": [
      "Giant Sparrow"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 88,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/4/7a05e6223f58c435d10d63a149e62866-98.jpg",
    "descriptions": "What Remains of Edith Finch is a collection of short stories about a cursed family in Washington State."
  },
  {
    "name": "Injustice 2: Legendary Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/injustice-2-legendary-edition",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Mar 27 2018",
    "developers": [
      "NetherRealm Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/0001363b4e55d7ae506b471ae57b17d2-98.jpg",
    "descriptions": null
  },
  {
    "name": "Celeste",
    "details_link": "https://www.metacritic.com/game/pc/celeste",
    "publisher": "Matt Makes Games Inc.",
    "release_date": "Jan 25 2018",
    "developers": [
      "Matt Makes Games Inc."
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/6/f6d9272b8b8b6cba1c61025f48dbd5e6-98.jpg",
    "descriptions": "Help Madeline survive her journey to the top of Celeste Mountain in this super-tight, hand-crafted platformer from the creators of TowerFall."
  },
  {
    "name": "Cuphead",
    "details_link": "https://www.metacritic.com/game/pc/cuphead",
    "publisher": "Studio MDHR",
    "release_date": "Sep 29 2017",
    "developers": [
      "Studio MDHR"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 88,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/2/970de1b382d316f61a6a7b2f4a55cb1d-98.jpg",
    "descriptions": "Cuphead is a classic run and gun action game primarily focused on boss battles. Inspired by the cartoons of the 1930s, the visuals and audio are carefully created with the same techniques of the era, i.e. traditional cel animation (hand drawn & hand inked), watercolor backgrounds, andCuphead is a classic run and gun action game primarily focused on boss battles. Inspired by the cartoons of the 1930s, the visuals and audio are carefully created with the same techniques of the era, i.e. traditional cel animation (hand drawn & hand inked), watercolor backgrounds, and original jazz recordings. Play as Cuphead or Mugman (in single player or co-op) as you traverse strange worlds, acquire new weapons, learn powerful super moves, and discover hidden secrets. [Studio MDHR]… Expand"
  },
  {
    "name": "Divinity: Original Sin Enhanced Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/divinity-original-sin-enhanced-edition",
    "publisher": "Focus Home Interactive",
    "release_date": "Oct 27 2015",
    "developers": [
      "Larian Studios Games"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Western-Style"
    ],
    "meta_score": 88,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/553f93f9e5e531a406f50bb6bdfd84ff-98.jpg",
    "descriptions": "Divinity Original Sin: Enhanced Edition is a much lauded Role-Playing-Game that blends deep customization and humor with dynamic turn based combat. Either in online co-op, split-screen co-op on your TV, or even alone, take advantage of a classless RPG system to create your heroes and conquerDivinity Original Sin: Enhanced Edition is a much lauded Role-Playing-Game that blends deep customization and humor with dynamic turn based combat. Either in online co-op, split-screen co-op on your TV, or even alone, take advantage of a classless RPG system to create your heroes and conquer the evils of Rivellon!\r Embark upon a journey with up to three companions as you bend the very fabric of time, where what seems like the case of a simple murder unravels into hours of quests facing fiendish foes, magical polymorphs, and dastardly bosses. As a Source Hunter, master the elements and use the environment to your advantage in dynamic combats mixing weather and magic to explode, poison, electrify, freeze and burn your enemies!… Expand"
  },
  {
    "name": "Minecraft: Xbox One Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/minecraft-xbox-one-edition",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 18 2014",
    "developers": [
      "4J Studios",
      "Mojang AB"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "Adventure",
      "3D",
      "Sandbox",
      "First-Person",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 88,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/1/54a58d8388bafd7e3248324cb64cda41-98.jpg",
    "descriptions": "Minecraft: Xbox One Edition is a game about placing blocks to build anything you can imagine and was revealed at E3 that it will be coming to the Xbox One."
  },
  {
    "name": "Guacamelee! Super Turbo Championship Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/guacamelee!-super-turbo-championship-edition",
    "publisher": "DrinkBox Studios",
    "release_date": "Jul  2 2014",
    "developers": [
      "DrinkBox Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 88,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/1/a1a4e13424619792c8c1860138e98039-98.jpg",
    "descriptions": "Guacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania styleGuacamelee! is a Metroid-vania style action-platformer set in a magical Mexican inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters. Guacamelee builds upon the classic open-world Metroid-vania style of games, by adding a strong melee combat component, a new dimension switching mechanic, and cooperative same-screen multiplayer for the entire story. The game also blurs the boundaries between combat and platforming by making many of the moves useful and necessary for both of these.… Expand"
  },
  {
    "name": "XCOM: Enemy Within",
    "details_link": "https://www.metacritic.com/game/xbox-360/xcom-enemy-within",
    "publisher": "2K Games",
    "release_date": "Nov 12 2013",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Sci-Fi",
      "Strategy",
      "Turn-Based",
      "Sci-Fi",
      "General",
      "Tactics"
    ],
    "meta_score": 88,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/8a3cea4596841a3204972b4d78bfed30-98.jpg",
    "descriptions": "XCOM: Enemy Within is the expansion to the 2012 Game of the Year award-winning strategy game XCOM: Enemy Unknown.  Enemy Within adds an array of new abilities, upgrades and weapons to combat new enemy and alien threats. This expansion pack also introduces new maps, new tactical and strategicXCOM: Enemy Within is the expansion to the 2012 Game of the Year award-winning strategy game XCOM: Enemy Unknown.  Enemy Within adds an array of new abilities, upgrades and weapons to combat new enemy and alien threats. This expansion pack also introduces new maps, new tactical and strategic gameplay, and new multiplayer content providing a fresh new gameplay experience.… Expand"
  },
  {
    "name": "NCAA Football 2005",
    "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-football-2005",
    "publisher": "EA Sports",
    "release_date": "Jul 15 2004",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/3/6a2e2ef3d793a39993e599f2ec3c6c1a-98.jpg",
    "descriptions": "Do you have what it takes to survive in college football's most hostile environments? For the first time in video game football history, the game-day atmosphere directly affects players' on-field performances. See if players have enough composure to withstand the pressure, and take advantageDo you have what it takes to survive in college football's most hostile environments? For the first time in video game football history, the game-day atmosphere directly affects players' on-field performances. See if players have enough composure to withstand the pressure, and take advantage of key personnel mismatches with the new Match-Up Stick. Add in fan celebrations like the Gator Chomp or Texas Hook 'Em Horns and you'll see that NCAA Football 2005 delivers the real emotion, collegiate atmosphere, and traditional gameplay of college football. Electrifying Stadium Atmosphere: Watch the visiting team fight crowd noise when calling audibles and hot routes. Pump up the crowd and build up your home field advantage to take opponents out of the game. Build your team's stadium atmosphere to rank among the elite stadiums in the country. See, hear and feel the immediate impact from hostile environments like LSU?s \"Death Valley,\" \"The Swamp\" at Florida, Michigan?s \"Big House,\" and Nebraska's \"Sea of Red.\" Deeper Dynasty Mode: Monitor discipline levels and grades to ensure your program's integrity, while recruiting promising high school athletes and converting them into skilled position players. Keep players happy with playing time or risk them transferring to one of your rivals in the off-season. New Gameplay Enhancements: Choose from new custom playbooks, offensive schemes, and defensive formations that include the 4-2-5 and 3-3-5 Stack. [Electronic Arts]… Expand"
  },
  {
    "name": "ESPN NHL Hockey",
    "details_link": "https://www.metacritic.com/game/xbox/espn-nhl-hockey",
    "publisher": "Sega",
    "release_date": "Sep  9 2003",
    "developers": [
      "Kush Games"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-10 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/1/f80e5d9e0d911d2b0aeded5bc3e828c2-98.jpg",
    "descriptions": "ESPN NHL Hockey brings you a complete NHL experience.  Play a single game or an entire season as any current NHL team, or a historic team, complete with vintage jerseys.  All the uniforms, arenas, player models, and environmental effects are meticulously detailed.  With an advanced graphicsESPN NHL Hockey brings you a complete NHL experience.  Play a single game or an entire season as any current NHL team, or a historic team, complete with vintage jerseys.  All the uniforms, arenas, player models, and environmental effects are meticulously detailed.  With an advanced graphics engine, an exclusive ESPN presentation system featuring Gary Thorne and Bill Clement, and exciting new modes to play such as the authentic Skills Competition, ESPN NHL Hockey leads the league in hockey realism.… Expand"
  },
  {
    "name": "NCAA Football 2004",
    "details_link": "https://www.metacritic.com/game/xbox/ncaa-football-2004",
    "publisher": "EA Sports",
    "release_date": "Jul 16 2003",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/f1fb3d494ff8332f6a9fadd122695f94-98.jpg",
    "descriptions": "Experience the spirit, atmosphere, and emotion of college football like NCAA Football 2004.  Whether you play as the one of the 36 new 1-AA teams or 20 classic teams from the last two decades, the game lets you celebrate the history of college football.  Feel the tradition of collegeExperience the spirit, atmosphere, and emotion of college football like NCAA Football 2004.  Whether you play as the one of the 36 new 1-AA teams or 20 classic teams from the last two decades, the game lets you celebrate the history of college football.  Feel the tradition of college football Saturdays with all-new pre-game introductions and experience the pageantry with new mascots, flag-waving cheerleaders, and cannons.  Other key features this season include improved college gameplay, EA Sports Online competition for the PlayStation 2, deeper Dynasty mode, and over 15 new teams and the all-new EA Sports Bio.  … Expand"
  },
  {
    "name": "FIFA Soccer 2003",
    "details_link": "https://www.metacritic.com/game/xbox/fifa-soccer-2003",
    "publisher": "EA Sports",
    "release_date": "Nov 12 2002",
    "developers": [
      "EA Canada"
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Soccer",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/b317ccaadf88b5f2cbc3a612c26a0141-98.jpg",
    "descriptions": "Master the fundamentals of soccer in FIFA Soccer 2003. With more ball control and player moves, this year's FIFA Soccer puts the The Total Club Championship within your grasp. Unleash the skills of the world's greatest players through new player animations and signature skill moves.Master the fundamentals of soccer in FIFA Soccer 2003. With more ball control and player moves, this year's FIFA Soccer puts the The Total Club Championship within your grasp. Unleash the skills of the world's greatest players through new player animations and signature skill moves. Experience pressure-cooker atmospheres as you take on Europe's elite teams in their own stadiums featuring actual team chants and songs. EA Sports Freestyle Control lets you produce a feint, one-touch pass, or skill move to leave your opponents standing.… Expand"
  },
  {
    "name": "Ratchet & Clank",
    "details_link": "https://www.metacritic.com/game/playstation-2/ratchet-clank",
    "publisher": "SCEA",
    "release_date": "Nov  4 2002",
    "developers": [
      "Insomniac Games"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 88,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/1/95b6ef1bc02d3200e5a43bec4f1786f3-98.jpg",
    "descriptions": "Set in a futuristic world filled with spaceships, robots and high-tech gadgets, Ratchet and Clank moves from planet to planet across a vast solar system. Ratchet lives on an abandoned backwater planet and dreams of someday striking out on a magnificent space adventure. Closer to the centerSet in a futuristic world filled with spaceships, robots and high-tech gadgets, Ratchet and Clank moves from planet to planet across a vast solar system. Ratchet lives on an abandoned backwater planet and dreams of someday striking out on a magnificent space adventure. Closer to the center of the galaxy, Chairman Drek rules a polluted planet, Orxon, inhabited by an ugly race called the Blarg. He too has dreams, but his concern is conquest and domination. Tired of his polluted world, Chairman Drek comes up with the ultimate solution - to build a new planet using the best parts from many of the other worlds in the galaxy. If he can't convince the inhabitants to part with a few thousand hectares of their worlds, the army of robots and Blarg warriors can eliminate any resistance.… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2003",
    "details_link": "https://www.metacritic.com/game/playstation-2/tiger-woods-pga-tour-2003",
    "publisher": "EA Sports",
    "release_date": "Oct 27 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Sim"
    ],
    "meta_score": 88,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/8/4bec378df5411247a820d207bb4ade6b-98.jpg",
    "descriptions": "Enhanced graphics and physics: Gameplay so lush and detailed, you feel as if you're actually on the course. 13 different courses: Play famous layouts like Pebble Beach Golf Links and Royal Birkdale, or try one of three original courses. 17 PGA TOUR pros: Play as or against Tiger Woods, TyEnhanced graphics and physics: Gameplay so lush and detailed, you feel as if you're actually on the course. 13 different courses: Play famous layouts like Pebble Beach Golf Links and Royal Birkdale, or try one of three original courses. 17 PGA TOUR pros: Play as or against Tiger Woods, Ty Tryon, Mark O'Meara, Brad Faxon and many others. Total Precision Swing: Take full control over your swing, from straight drives to hooks and draws. New Modes: SkillZone and Create-a-Course feature mini-games and custom layouts. [EA Sports]… Expand"
  }
]