[{"name": "Order Up!!", "details_link": "https://www.metacritic.com/game/3ds/order-up!!", "publisher": "Ignition Entertainment", "release_date": "Jun 21 2012", "developers": ["SuperVillain Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "3DS"], "genres": ["Action", "Simulation", "Miscellaneous", "General", "General", "General", "Virtual", "Career"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/a253489d9fc120b33b76f9a9b63d30fc-98.jpg", "descriptions": "Aspiring chefs, get ready to sharpen your knives and put your short order skills to the test in Order Up."}, {"name": "Blocks That Matter", "details_link": "https://www.metacritic.com/game/pc/blocks-that-matter", "publisher": "Swing Swing Submarine", "release_date": "Aug 19 2011", "developers": ["Swing Swing Submarine"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Platformer", "2D"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/24abfe27e4b61039dfd3ca53fd88e886-98.jpg", "descriptions": "You are the Tetrobot: a tiny robot that can drill blocks of matter one by one, collect them, and recycle them into new pieces of 4 blocks. You also have the possibility to destroy lines of 8+ blocks in a very retro russian game style. Sand, wood, stone, obsidian, iron, diamond: each matterYou are the Tetrobot: a tiny robot that can drill blocks of matter one by one, collect them, and recycle them into new pieces of 4 blocks. You also have the possibility to destroy lines of 8+ blocks in a very retro russian game style. Sand, wood, stone, obsidian, iron, diamond: each matter has its specific behaviour you'll have to use wisely and take advantage of them. So get ready to use your brain and combine your platforming and puzzle-solving skills in this incredible mashup!… Expand"}, {"name": "DC Universe Online", "details_link": "https://www.metacritic.com/game/pc/dc-universe-online", "publisher": "Sony Online Entertainment", "release_date": "Jan 11 2011", "developers": ["WBIE"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/2ab75526f6c1f3e904d8fcd623500993-98.jpg", "descriptions": "DC Universe Online is an MMO based on DC comic book universe and lets you fight along side or against DC superheroes."}, {"name": "The Getaway", "details_link": "https://www.metacritic.com/game/playstation-2/the-getaway", "publisher": "SCEA", "release_date": "Jan 19 2003", "developers": ["Team Soho"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/1aae6b725dd52d185162fb06495406f7-98.jpg", "descriptions": "It's morning in Covent Garden. A woman is shot dead in the street. In the distance, a child screams as a car disappears with a screech of tires. It is a crime that will spark a series of intense events in London and the most notorious gangs are implicated. Mark Hammond is about to be draggedIt's morning in Covent Garden. A woman is shot dead in the street. In the distance, a child screams as a car disappears with a screech of tires. It is a crime that will spark a series of intense events in London and the most notorious gangs are implicated. Mark Hammond is about to be dragged into a life he vowed he'd left forever. DC Frank Carter is caught on the wrong side of London's criminal underworld. Two men separated by the law but joined in their obsession to bring down London's crime supremo.… Expand"}, {"name": "The Wonderful 101: Remastered", "details_link": "https://www.metacritic.com/game/switch/the-wonderful-101-remastered", "publisher": "PlatinumGames", "release_date": "May 19 2020", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 5 ", "genres": ["Action", "General"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/79c5f02f29618032bff45cf41c322062-98.jpg", "descriptions": "Lead an army of 100 Wonderful Ones from around the world in this Unite Action spectacular! A team of heroes from around the world must UNITE to protect the earth from vicious alien invaders! This band of 100 Wonderful Ones works together using their fantastic abilities to create a variety ofLead an army of 100 Wonderful Ones from around the world in this Unite Action spectacular! A team of heroes from around the world must UNITE to protect the earth from vicious alien invaders! This band of 100 Wonderful Ones works together using their fantastic abilities to create a variety of forms. Whether it be a giant fist or a sharp blade, they’ll use their wits and power to overcome the enemy’s pitfalls and perils! And the final member of this team of courageous heroes—is you. From PlatinumGames, creators of the Bayonetta series, ASTRAL CHAIN, NieR:Automata, and Metal Gear Rising: Revengeance, comes The Wonderful 101: Remastered! This game will be PlatinumGames' first self-published title, and is a powered-up version of The Wonderful 101, originally released by Nintendo on September 15th, 2013 as a Wii U exclusive. The Wonderful 101: Remastered offers the unprecedented ability to control 100 heroes at once, with the flowing controls and dynamic action that are the PlatinumGames hallmark. It’s all brought together by a pulse pounding tale of heroic bravery and friendship standing tall against evil, and is PlatinumGames’ most ambitious offering to date. Hideki Kamiya, director of The Wonderful 101, has supervised this remaster and added numerous improvements to ensure that this game can be more easily and thoroughly enjoyed by all and on various platforms, and with improved visuals, framerate, and loading time for an enhanced experience on all fronts. … Expand"}, {"name": "NBA 2K8", "details_link": "https://www.metacritic.com/game/playstation-2/nba-2k8", "publisher": "2K Sports", "release_date": "Oct  2 2007", "developers": ["Visual Concepts"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "10  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/cc43ced4ca3b88346fd303411194b690-98.jpg", "descriptions": "Sprite Slam Dunk Contest - Live from Las Vegas, 2K is bringing you the Sprite Slam Dunk Contest, hosted by street legend Bobbito Garcia. Choose from hundreds of dunks and a vast array of props as you compete against the NBA's finest dunkers in this 4 player event. The Sprite Slam DunkSprite Slam Dunk Contest - Live from Las Vegas, 2K is bringing you the Sprite Slam Dunk Contest, hosted by street legend Bobbito Garcia. Choose from hundreds of dunks and a vast array of props as you compete against the NBA's finest dunkers in this 4 player event. The Sprite Slam Dunk Contest is also playable online; it's here that you can prove to the world that you are the greatest dunker there is. More Signature Style - Customizable Free Throws, Dribble Moves, and Dunks give users total control over the way their favorite players play on the court. All new signature shots from many of your favorite NBA players, including #1 draft choice Greg Oden, as well as individual post and dribble moves, makes NBA 2K8 the most authentic NBA simulation on the market. Off-Ball Control - Run quick on the fly sets to get your favorite player the ball in the best situation for him to get a quick bucket. Use the Get Open button for a fast play, or call for the exact situation you want with the Off-Ball Control menu. On offense, you now have the option to switch off the ball handler to other players where you can call for alley-oops, jostle for post-position, set screens, etc. [2K Sports]… Expand"}, {"name": "Chaos League", "details_link": "https://www.metacritic.com/game/pc/chaos-league", "publisher": "Strategy First", "release_date": "Mar  8 2005", "developers": ["Cyanide"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/9b3d93e8e6ea98eeb5ff593d1277b99e-98.jpg", "descriptions": "Chaos League is a new kind of game, combining Real-Time Strategy, RPG and Sports. In a fantasy heroic universe Chaos League offers new game-play possibilities. Don't look for notions of fair-play or the command \"Help opponent back on his feet\" because they don?t exist! However, if you'veChaos League is a new kind of game, combining Real-Time Strategy, RPG and Sports. In a fantasy heroic universe Chaos League offers new game-play possibilities. Don't look for notions of fair-play or the command \"Help opponent back on his feet\" because they don?t exist! However, if you've been longing to find in a sport's game such commands as \"Stamp\", \"High Facial Kick\", \"Holding on the Ground\", \"Force Passage\" or \"Ball of Fire\". Then at last you?ve found the game of your dreams. Take charge of a team; place 9 players in your half of the field, then go and put the ball in the opponent?s end-zone. Nothing easier! Except one small detail... there are a few opposition players determined to get the ball from you. On the pitch, as in the changing-rooms, there are no rules. Let yourself be carried away on the gentle airs of doping, corruption and hooliganism even before a match gets under way. Once on the pitch, if the ball doesn?t really interest you, then carry on destroying the opposition using all the underhand tricks at your disposal. If that doesn?t guarantee victory then magic and snares will come in useful. Even if massacring the opposition is encouraged, you?ll have to use far more subtle tactics to have a chance at winning. You?ll have to manage, as best you can, the individual talents of each of your players; take into account the mood of the spectators...to finally be able to get a few points on the scoreboard and make the opposition look foolish. It?s up to you whether you then comfort him or take advantage of him while he?s down to hit him with a few well chosen words. [Digital Jesters]… Expand"}, {"name": "Omega Five", "details_link": "https://www.metacritic.com/game/xbox-360/omega-five", "publisher": "Hudson Entertainment", "release_date": "Jan  9 2008", "developers": ["Natsume"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 72, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/bd355a87d51b40db7867aa514157fdd5-98.jpg", "descriptions": "[Xbox Live Arcade] Omega Five is a true next-gen, high-definition shooter, with the most awe-inspiring graphics around. Fly through dangerous 3-D environments in this side-scroller as enemies come at you from all sides, even the background. Grab an extra controller, choose your merc, and[Xbox Live Arcade] Omega Five is a true next-gen, high-definition shooter, with the most awe-inspiring graphics around. Fly through dangerous 3-D environments in this side-scroller as enemies come at you from all sides, even the background. Grab an extra controller, choose your merc, and engage in two-player local co-op play for more action. If you're a hardcore player, try your hand at the ultra-challenging ++ Mode, where you're only allowed one hit! Local co-op: Grab an extra controller and demolish enemies with a friend by your side. Dangerous environments: Enemies come at you from all sides, even from the background. Merc variety: Fight as Ruby, Tempest, or other characters, each of whom has three unique main weapons and special attacks. Unlockable extras: Discover new characters, game modes, and options. Intuitive controls: The modern control scheme uses the right analog stick to aim and fire. [Hudson]… Expand"}, {"name": "Race Pro", "details_link": "https://www.metacritic.com/game/xbox-360/race-pro", "publisher": "Atari", "release_date": "Feb 17 2009", "developers": ["SimBin"], "platforms": "Xbox 360", "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/944e42e8aba4e419c281ff47175c3924-98.jpg", "descriptions": "RACE Pro has something for everyone, allowing players of all levels to pick up and play, while offering challenging tracks and advanced modes for the more experienced players. RACE Pro offers a wealth of cars ranging from 200 to over 1000 horse power, as well as a host of championshipsRACE Pro has something for everyone, allowing players of all levels to pick up and play, while offering challenging tracks and advanced modes for the more experienced players. RACE Pro offers a wealth of cars ranging from 200 to over 1000 horse power, as well as a host of championships including WTCC (World Touring Car Championship), Formula 3000 and Formula BMW. GT cars from manufacturers including Aston Martin and Saleen take their place on the grid as well as production cars such as the Audi R8 and Dodge Viper SRT10. In addition, RACE Pro exclusively brings all the WTCC cars from manufacturers Alfa Romeo, BMW, Chevrolet and Seat to Xbox 360 for the very first time. For a blast of accessible fun, the Mini Cooper Challenge invites players of all abilities to take the wheel. Gamers and racing fans alike experience the thrill of racing these powerful cars on 13 real life tracks covering all continents, of which Macau, Porto and Pau are exclusive to RACE Pro, and US tracks Laguna Seca and Road America are brand new to SimBin fans. Online play via Xbox Live and System Link support lets up to 12 players take on equally high-powered opponents and test their skills to the limit to reach the finish line ahead of the pack. For friends closer to home, the brand new ‘Hot Seat’ feature puts players in the driving seat for a limited amount of time before passing the controller to the next player and so on, demanding exceptionally quick reactions and precision racing from even the most seasoned drivers. [Atari]… Expand"}, {"name": "Anno 2205", "details_link": "https://www.metacritic.com/game/pc/anno-2205", "publisher": "Ubisoft", "release_date": "Nov  2 2015", "developers": ["Blue Byte"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/dde5efdeaa0753daca4495d7c1da1c6c-98.jpg", "descriptions": "In Anno 2205, enlist with humankind‘s next step into the future with the promise to build a better tomorrow. You'll conquer Earth, establishing rich, bustling cities and grand industrial complexes, but to secure the prosperity of your people, you must travel into space."}, {"name": "NBA 06", "details_link": "https://www.metacritic.com/game/psp/nba-06", "publisher": "SCEA", "release_date": "Oct  4 2005", "developers": ["SCEA Sports Studio"], "platforms": ["PlayStation 2", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 72, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/349b63c899964de0e64718e24fb84f1c-98.jpg", "descriptions": "NBA '06 for PSP expands the franchise by featuring numerous gameplay advancements including enhanced Artificial Intelligence (A.I.), shooting mechanics, player animations, and new mini-games to create the most action-packed, realistic basketball experience to date for a portable device. NBANBA '06 for PSP expands the franchise by featuring numerous gameplay advancements including enhanced Artificial Intelligence (A.I.), shooting mechanics, player animations, and new mini-games to create the most action-packed, realistic basketball experience to date for a portable device. NBA '06 for PSP implements a trading card system where players can take highlight plays captured as virtual cards and keep them as collectibles or share with other gamers.  A new ladder challenge is also available, allowing players to compete in a mini-game or exhibition mode series in an attempt to reach the top of the ladder and earn special virtual trading card rewards. Supporting up to two players, either locally via Ad Hoc Mode or nationally via Infrastructure Mode, NBA '06 for PSP offers the opportunity to play a full season with trades, free agent lists, and injuries.  For quick gaming action, NBA '06 for PSP introduces two all-new classic schoolyard mini-games, HORSE and Dodgeball, along with returning favorites Paint Mode, PlayStation Skills Challenge, and 3-Point Contest. [SCEA]… Expand"}, {"name": "Lost Dimension", "details_link": "https://www.metacritic.com/game/playstation-vita/lost-dimension", "publisher": "Atlus", "release_date": "Jul 28 2015", "developers": ["Lancarse", "FuRyu"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita"], "genres": ["Adventure", "General"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/b9cea0b03745eb316020b24414440ad0-98.jpg", "descriptions": "Find the traitor who hides among your members!"}, {"name": "Commanders: Attack", "details_link": "https://www.metacritic.com/game/xbox-360/commanders-attack", "publisher": "Sierra Online", "release_date": "Feb 13 2008", "developers": ["Southend Interactive"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "General", "Tactics"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/2aec80fd2381c866eb538b6e15078618-98.jpg", "descriptions": "Commanders: Attack of the Genos is an accessible turn-based tactical battle game providing challenge for all levels of players. The genetically enhanced army of the Genos have decided to attack Earth. With your powerful Commander unit, use Missile Launchers, Bombers, Infantry, and otherCommanders: Attack of the Genos is an accessible turn-based tactical battle game providing challenge for all levels of players. The genetically enhanced army of the Genos have decided to attack Earth. With your powerful Commander unit, use Missile Launchers, Bombers, Infantry, and other attack units to cripple the enemy and defend your territory—online or off. Specialized attack units: Fifteen different units are provided to serve alongside your Commander unit. Use the units' unique powers to conquer the Genos. Fight fifteen different missions sprawling across three different landscapes, with two levels of difficulty for ease of play. Three intense multiplayer modes are included, allowing up to four players in Versus mode. Try the Team Play mode, or take on Skirmish with a friend on the same system. The game has two distinct endings to encourage replayability. The science-fiction setting features a gorgeous 30s Art Deco style. It's a blast from the past into the future. [Sierra Online]… Expand"}, {"name": "Just Dance 2022", "details_link": "https://www.metacritic.com/game/switch/just-dance-2022", "publisher": "Ubisoft", "release_date": "Nov  4 2021", "developers": ["Ubisoft"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 72, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/c626a4cf626d4b9a0c27db4b76122004-98.jpg", "descriptions": "Just Dance 2022, the ultimate dance game, is back with new universes and 40 hot new tracks from chart-topping hits like \"Believer\" by Imagine Dragons, \"Level Up\" by Ciara, and more."}, {"name": "Warhammer 40,000: Mechanicus", "details_link": "https://www.metacritic.com/game/switch/warhammer-40000-mechanicus", "publisher": "Kalypso", "release_date": "Jul 17 2020", "developers": ["Bulwark Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/38008627ea01332344e10d25c9ccd95f-98.jpg", "descriptions": "Take control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you'll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations usingTake control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you'll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations using the Noosphere technology and control your Tech-Priests every move.Your every decision will shape the missions ahead and ultimately decide the fate of the troops under your command. However, choose your path carefully - the Imperium depends on it.* AugmentFlesh is weak! Upgrade your Tech-Priests limbs with mechanical augments made from the blessed metals of the Omnissiah. Customize your team with hundreds of possibilities, creating a squad to suit your playstyle.* Difficult DecisionsMake tough decisions that will forge the future from your Ark Mechanicus, The Caestus Metalican, and send you towards alternate endings for a truly unique playthrough.* Experience the NoosphereUse the Adeptus Mechanicus' evolved human cognition to scan unexplored tombs for valuable data in order to gain a tactical advantage over your enemy.* The LibraryA compelling story written by Black Library author, Ben Counter, specifically crafted to fit the unique personality of the Adeptus Mechanicus faction.… Expand"}, {"name": "Monster Energy Supercross - The Official Videogame 2", "details_link": "https://www.metacritic.com/game/playstation-4/monster-energy-supercross---the-official-videogame-2", "publisher": "Milestone S.r.l", "release_date": "Feb  5 2019", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 72, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/df5c591b9a0df8a1766a001e93581645-98.jpg", "descriptions": "All the thrills of the Monster Energy AMA Supercross 2018 Championship. Live the life of a pro, put yourself to the test in the Compound, tackle challenges, manage your events and attract new sponsors to earn fame and unlock new content."}, {"name": "Regalia: Of Men and Monarchs - Royal Edition", "details_link": "https://www.metacritic.com/game/switch/regalia-of-men-and-monarchs---royal-edition", "publisher": "Crunching Koalas", "release_date": "Apr 12 2018", "developers": ["Pixelated Milk"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/88cdcbde4853f7a0f379c0285f5b8c66-98.jpg", "descriptions": "Regalia: Of Men And Monarchs is a tactical RPG set in a cheerful fantasy world full of weirdness and wonder. Assemble your party, go adventuring, manage your kingdom, make new friends, and defeat your opponents in challenging turn-based combat."}, {"name": "Block N Load", "details_link": "https://www.metacritic.com/game/pc/block-n-load", "publisher": "Jagex Games Studio", "release_date": "Apr 30 2015", "developers": ["Jagex Games Studio"], "platforms": "PC", "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/47f0cb1937106563ba40259386c56a90-98.jpg", "descriptions": "Build. Destroy. Attack. Defend. Tunnel. Trap. Catapult. Poison. Slice. Detonate. Sabotage. Win."}, {"name": "The Last Federation", "details_link": "https://www.metacritic.com/game/pc/the-last-federation", "publisher": "Arcen Games, LLC", "release_date": "Apr 18 2014", "developers": ["Arcen Games", "LLC"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "General"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/690fac433da10e7132cf298b1f9beb55-98.jpg", "descriptions": "From the creators of AI War: Fleet Command comes an all-new grand strategy title with turn-based tactical combat, set in a deep simulation of an entire solar system and its billions of inhabitants. You are the last of a murdered race, determined to unify or destroy the 8 others."}, {"name": "Just Dance 2014 (French)", "details_link": "https://www.metacritic.com/game/wii-u/just-dance-2014-french", "publisher": "Ubisoft", "release_date": "Oct  8 2013", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/d953ba2e8e8314be90138225a53a8608-98.jpg", "descriptions": "Just Dance 2014, the sequel to Just Dance 4, is bringing all new moves with features for every motion control platform and over 40 of the hottest tracks and dances."}, {"name": "Full Bore", "details_link": "https://www.metacritic.com/game/pc/full-bore", "publisher": "Whole Hog Games", "release_date": "Sep 29 2013", "developers": ["Whole Hog Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/6774dc2ca3c8480365e6dea38772007e-98.jpg", "descriptions": "A block puzzler with an exploratory twist, Full Bore throws the player into an open world filled with crumbling mines, arcane ruins, and technological wonders with only curiosity to lead the way.\r Full Bore is packed to the brim with secrets and hidden rooms, because in a world of blocks,A block puzzler with an exploratory twist, Full Bore throws the player into an open world filled with crumbling mines, arcane ruins, and technological wonders with only curiosity to lead the way.\r Full Bore is packed to the brim with secrets and hidden rooms, because in a world of blocks, puzzles could be anywhere.\r Full Bore is coming to Windows and Linux PCs this Summer!… Expand"}, {"name": "Loadout", "details_link": "https://www.metacritic.com/game/pc/loadout", "publisher": "Edge of Reality", "release_date": "May 15 2013", "developers": ["Edge of Reality"], "platforms": ["PlayStation 4", "PC"], "num_players": "", "genres": ["Shooter", "First-Person", "Modern", "Modern", "Action", "Shooter", "Third-Person", "Modern", "Arcade"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/ae11441a683cc714adb0bece68725d0d-98.jpg", "descriptions": "Loadout is a new “Free-2-Play” take on fast-paced, multiplayer shooters. Players create and customize their own outrageous weapons to carry into furious, over-the-top shooter action that promises to distinguish itself from the vast array of “modern combat” titles. Earn new weapon parts,Loadout is a new “Free-2-Play” take on fast-paced, multiplayer shooters. Players create and customize their own outrageous weapons to carry into furious, over-the-top shooter action that promises to distinguish itself from the vast array of “modern combat” titles. Earn new weapon parts, character customizations, equipment, and accessories as you gain prestige and wealth. The more you play, the more you can customize. There are seemingly endless possibilities to truly set yourself apart from your opponents. [Edge of Reality]… Expand"}, {"name": "Ridge Racer Unbounded", "details_link": "https://www.metacritic.com/game/pc/ridge-racer-unbounded", "publisher": "Namco Bandai Games", "release_date": "Mar 29 2012", "developers": ["Bugbear"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 72, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/add27f623051c58821d0df2f3c098263-98.jpg", "descriptions": "Ridge Racer Unbounded takes the Ridge Racer series in whole new direction by adding a dose of destruction to the familiar arcade gameplay."}, {"name": "Overlord: Raising Hell", "details_link": "https://www.metacritic.com/game/playstation-3/overlord-raising-hell", "publisher": "Codemasters", "release_date": "Jun 24 2008", "developers": ["4J Studios"], "platforms": ["PC", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/295399bbba150069c7369a90f6212a28-98.jpg", "descriptions": "Overlord: Raising Hell, the Action RPG set in a seriously warped fantasy world, has now arrived to PlayStation 3. With plenty of black humour and dark irony, this game immerses the player in twisted parodies of classic fantasy scenarios and characters. Your word is law as you become the allOverlord: Raising Hell, the Action RPG set in a seriously warped fantasy world, has now arrived to PlayStation 3. With plenty of black humour and dark irony, this game immerses the player in twisted parodies of classic fantasy scenarios and characters. Your word is law as you become the all powerful Overlord, a mysterious figure that has inherited the legacy of the evil after being raised from the dead. The game's key innovation is the introduction of an array of impish creatures – the Minions. Accompanied by a horde of these slavishly loyal rascals, the Overlord plays dirty tricks on anything that moves to become even more powerful. The gremlin-like critters will follow your every instruction no matter how despotic or, for the Minions, life threatening it is. The PS3 version of this game allows you to explore and conquer 5 extra supernatural realms. Defend the Overlord's tower against waves of enemy attack with seven additional online multiplayer maps, including the competitive 'Capture the Maiden' map and 'Protect Your Power'. The Challenge Pack also introduces a 'Legendary' mode, which challenges you by using your most aggressive minion managing skills to complete the single-player game under exceptional circumstances. [Codemasters]… Expand"}, {"name": "Ys: The Ark of Napishtim", "details_link": "https://www.metacritic.com/game/playstation-2/ys-the-ark-of-napishtim", "publisher": "Konami", "release_date": "Feb 22 2005", "developers": ["Falcom"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/3ee0a13cd4746b3469b5bfeecfb51a6c-98.jpg", "descriptions": "Washed ashore on an uncharted island, Adol Christin begins a new journey in Ys: The Ark of Napishtim. Lush environments, beautifully rendered characters and animated 3D backdrops combine to create the setting for Adol's newest adventure. In the world of Canaan, our red-headed hero must fightWashed ashore on an uncharted island, Adol Christin begins a new journey in Ys: The Ark of Napishtim. Lush environments, beautifully rendered characters and animated 3D backdrops combine to create the setting for Adol's newest adventure. In the world of Canaan, our red-headed hero must fight deadly monsters and menacing bosses with a variety of sword combinations, special attacks and magical spells creating a uniquely deep and compelling gameplay experience. Power-up three magical swords to gain special abilities and attacks. Combines real-time, fast-paced action and strategic boss battles. Original music composed specifically for the PS2 version of the game. Hidden, unlockable secrets that showcase the timeless legacy of Ys. [Konami]… Expand"}, {"name": "Samurai Warriors: Xtreme Legends", "details_link": "https://www.metacritic.com/game/playstation-2/samurai-warriors-xtreme-legends", "publisher": "Koei", "release_date": "Nov  9 2004", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 72, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/c57641689becf47d61ae503a93aae90e-98.jpg", "descriptions": "This Playstation 2 exclusive expansion pack introduces new characters, and new chapters to the story of the Samurai Warriors.  Players discover more impressive weapons as well as a variety of new items and fighting skills. Along with new content, Samurai Warriors: Extreme Legends also opensThis Playstation 2 exclusive expansion pack introduces new characters, and new chapters to the story of the Samurai Warriors.  Players discover more impressive weapons as well as a variety of new items and fighting skills. Along with new content, Samurai Warriors: Extreme Legends also opens up the original game's character growth system for continued character development, so that players can create more powerful warriors. Set in 16th century Japan, the fall of the Ashikaga Shogunate caused a series of major wars between individual warlords vying for power. This era in Japanese history became known as the Sengoku or \"warring states\" period. Samurai Warriors reveals the stories from this dramatic era and combines it with pure Tactical Action gameplay. [KOEI]… Expand"}, {"name": "Front Mission", "details_link": "https://www.metacritic.com/game/ds/front-mission", "publisher": "Square Enix", "release_date": "Oct 23 2007", "developers": ["Square Enix"], "platforms": "DS", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "Tactics"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/595e954eec7504b3faf681b1a9730c8f-98.jpg", "descriptions": "Discover the origins of the Front Mission series in this explosive handheld saga that was never before localized for North America. Reborn exclusively on the Nintendo DS. Front Mission introduces new features, such as dual screen presentation and multiplayer modes, that update the classicDiscover the origins of the Front Mission series in this explosive handheld saga that was never before localized for North America. Reborn exclusively on the Nintendo DS. Front Mission introduces new features, such as dual screen presentation and multiplayer modes, that update the classic that gave birth to seven beloved sequels. Using Touch Screen functionality, players command a squad of customizable mechs known as wanzers and direct them through turn-based skirmishes across the battlefields of the 21st century. [Square Enix]… Expand"}, {"name": "Thrillville", "details_link": "https://www.metacritic.com/game/psp/thrillville", "publisher": "LucasArts", "release_date": "Nov 21 2006", "developers": ["Frontier Developments"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Strategy", "City Building", "General", "Modern"], "meta_score": 72, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/1/cb5a44a208cf340fa543c93e311c6fda-98.jpg", "descriptions": "Thrillville allows gamers of all ages to easily build and customize the coaster of your dreams. Gone are the days of the complex PC techniques used in other coaster games. Rather, Thrillville's easy to use building mode has been designed specifically for the console platforms and makesThrillville allows gamers of all ages to easily build and customize the coaster of your dreams. Gone are the days of the complex PC techniques used in other coaster games. Rather, Thrillville's easy to use building mode has been designed specifically for the console platforms and makes building all 75-plus rides from wooden, corkscrew and inverted coasters to merry go rounds, trains and carnival rides, easy, and most importantly, fun. Imagination is the only height limit with Thrillville, where the fun ranges from racing on go-kart tracks you put together and playing mini-golf on courses you designed to joining friends for dozens of four-player party games, from bumper cars to arcade shoot-‘em-ups. You can also tour the park on foot – a first for theme-park titles – chatting and joking with all the guests to help them out and make sure they’re enjoying themselves. [LucasArts]… Expand"}, {"name": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe", "details_link": "https://www.metacritic.com/game/xbox/the-chronicles-of-narnia-the-lion-the-witch-and-the-wardrobe", "publisher": "Buena Vista Games", "release_date": "Nov 14 2005", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/f42c38fbc9e0ebc961b6359736964444-98.jpg", "descriptions": "The malevolent White Witch has cast a 100-year winter on the land of Narnia, and you can help Aslan free his people in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. As the four children from the movie, you can battle fantastical creatures such as Minotaurs, Cyclops,The malevolent White Witch has cast a 100-year winter on the land of Narnia, and you can help Aslan free his people in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. As the four children from the movie, you can battle fantastical creatures such as Minotaurs, Cyclops, Werewolves, and Wraiths. The game includes puzzle elements and is closely tied to the plot of the movie. Multiplayer cooperative play is also available.… Expand"}, {"name": "Tokobot", "details_link": "https://www.metacritic.com/game/psp/tokobot", "publisher": "Tecmo", "release_date": "Dec  5 2005", "developers": ["Tecmo"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/ea0fcbf4586de2891f718a1e1fca0cfb-98.jpg", "descriptions": "Players take on the role of the young hero Bolt, a quick thinking agent who has discovered some friendly, highly advanced robots called \"Tokobots\" during his explorations of ancient ruins.  With the help of the loyal Tokobots, Bolt will reveal mysteries and save the world from a horriblePlayers take on the role of the young hero Bolt, a quick thinking agent who has discovered some friendly, highly advanced robots called \"Tokobots\" during his explorations of ancient ruins.  With the help of the loyal Tokobots, Bolt will reveal mysteries and save the world from a horrible plot, as the Tokobots faithfully follow him on his journey, helping him to avoid obstacles, traps and enemies, by working together to create \"team combos\".  During these actions, the Tokobots team up to take on different combinations in order to simulate everything from a ladder that Bolt climbs to wings that allow him to fly over large obstacles.  The player will have to use strategy and skill to create these team combos in order to complete each level and succeed in the game. [Tecmo]… Expand"}, {"name": "Stubbs the Zombie in Rebel Without a Pulse", "details_link": "https://www.metacritic.com/game/pc/stubbs-the-zombie-in-rebel-without-a-pulse", "publisher": "Aspyr", "release_date": "Nov 21 2005", "developers": ["Wideload Games Inc."], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/58a532bab16f1bc8972e43f8f78e61fc-98.jpg", "descriptions": "Guaranteed to turn some heads, this third-person action game is an original IP by Bungie Studio veterans that uses an updated Halo engine to deliver a stirring tale of one man's hunger for love, justice...and brains. In this game, players take on the role of the rebel himself ? Stubbs, aGuaranteed to turn some heads, this third-person action game is an original IP by Bungie Studio veterans that uses an updated Halo engine to deliver a stirring tale of one man's hunger for love, justice...and brains. In this game, players take on the role of the rebel himself ? Stubbs, a wisecracking Zombie who takes on an ultra-modern city of the future using nothing but his own carcass and the weapons of his possessed enemies. The game?s tongue-in-cheek humor, innovative combat and strong storyline keep Stubbs the Zombie?s gameplay as bizarre and unpredictable as its namesake. On his quest, Stubbs lurches his way through numerous large and visually captivating indoor/outdoor environments in and around the gleaming city of Punchbowl, PA, a city built during the Eisenhower administration to show off the ultra-futuristic technology of the 21st century. Stubbs? brain-eating adventure brings him through bustling shopping districts and verdant farmlands to battle mad scientists, rural militiamen and the world's deadliest barbershop quartet.  His enemies have shotguns, tanks, and all manner of futuristic weaponry.  All Stubbs has is his own rotting corpse, a distinct lack of pain or conscience, and the ability to turn foes into zombie allies. What begins as one zombie?s search for revenge quickly escalates into an all-out war between the living and the dead - but this time it's the zombie fighting for truth, justice and the redemption of true love.  Yes, it's a love story too. [Aspyr Media]… Expand"}, {"name": "Baldur's Gate and Baldur's Gate II: Enhanced Editions", "details_link": "https://www.metacritic.com/game/switch/baldurs-gate-and-baldurs-gate-ii-enhanced-editions", "publisher": "Skybound Games", "release_date": "Oct 15 2019", "developers": ["Beamdog"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/d34dcdd6288247e6a37ad21f823bf39b-98.jpg", "descriptions": "Includes the original Baldur’s Gate: Enhanced Edition and its sequel, Baldur’s Gate II: Enhanced Edition, with all DLC and restored quest content, as well as the Baldur’s Gate: Siege of Dragonspear expansion, featuring new original content developed by Beamdog to bridge the two games."}, {"name": "NAIRI: Tower of Shirin", "details_link": "https://www.metacritic.com/game/switch/nairi-tower-of-shirin", "publisher": "HomeBearStudio", "release_date": "Nov 28 2018", "developers": ["HomeBearStudio"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/ae140ea4ab4ad1ba03914d7688a25639-98.jpg", "descriptions": "Follow Nairi, a troubled upper class girl, and Rex, a gangster-turned-scholar, as they uncover a dark mystery involving the mysterious Tower of Shirin! In a world brimming with with delightful, deadly, and dastardly creatures Nairi will need all her wits to outsmart bandit cats, befriendFollow Nairi, a troubled upper class girl, and Rex, a gangster-turned-scholar, as they uncover a dark mystery involving the mysterious Tower of Shirin! In a world brimming with with delightful, deadly, and dastardly creatures Nairi will need all her wits to outsmart bandit cats, befriend crime lord ducks, and escape a conspiracy as old as time. NAIRI: Tower of Shirin is a charming graphic adventure with adorable characters within a troubled world that is sure to delight people of all ages looking for a strong narrative and puzzle experience.… Expand"}, {"name": "Leo's Fortune", "details_link": "https://www.metacritic.com/game/xbox-one/leos-fortune", "publisher": "Tilting Point", "release_date": "Sep 11 2015", "developers": ["1337 & Senri LLC"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/d1541dace95524d33de031e4aff44568-98.jpg", "descriptions": "Leo's Fortune is a platform adventure game where you hunt down the cunning and mysterious thief that stole your gold. Beautifully hand-crafted levels bring the story of Leo to life in this epic adventure.VOYAGE through lush environments from mossy forests and arid deserts, to pirate citiesLeo's Fortune is a platform adventure game where you hunt down the cunning and mysterious thief that stole your gold. Beautifully hand-crafted levels bring the story of Leo to life in this epic adventure.VOYAGE through lush environments from mossy forests and arid deserts, to pirate cities and snowy mountains.SURVIVE vicious traps and solve physics-based puzzles through 24 levels of treacherous adventure.FOLLOW the trail of gold and uncover the truth behind Leo's stolen fortune.Finish Leo's Fortune to unlock Hard-core Mode: try to beat the whole game without dying to unlock a special prize!… Expand"}, {"name": "Samurai Shodown II", "details_link": "https://www.metacritic.com/game/xbox-360/samurai-shodown-ii", "publisher": "SNK Playmore", "release_date": "Sep 10 2008", "developers": ["SNK Playmore"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/cca9697593ae6ae3ced4dba84eaef60c-98.jpg", "descriptions": "[Xbox Live Arcade]  The classic fighting game Samurai Shodown II comes to Xbox Live Arcade in all its action-packed glory. Haohmaru is attacked by a sinister assailant. This would-be assassin has been clearly manipulated by an evil force, and promises with his last breath to own Haohmaru's[Xbox Live Arcade]  The classic fighting game Samurai Shodown II comes to Xbox Live Arcade in all its action-packed glory. Haohmaru is attacked by a sinister assailant. This would-be assassin has been clearly manipulated by an evil force, and promises with his last breath to own Haohmaru's soul. Haohmaru's mentor and fencing master insists that Haohmaru stay away from the evil forces and avoid confrontation, but this he cannot do. The two share a few drinks to celebrate their reunion after a long separation, but at dawn, Haohmaru slips out unannounced to embark on his journey. An audacious smile plays on his lips. New fighting techniques: Learn to parry, roll, duck, and hop. Sixteen unique playable characters are included. Choose your favorite and rise to the top. [Microsoft]… Expand"}, {"name": "Wonder Boy Anniversary Collection", "details_link": "https://www.metacritic.com/game/switch/wonder-boy-anniversary-collection", "publisher": "Bliss Brain", "release_date": "Jan 26 2023", "developers": ["Bliss Brain"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/7fb97bf769e9b9d0f43e0d24a9001196-98.jpg", "descriptions": "Featuring 21 versions of six of the most iconic Wonder Boy games ever released, this incredible compilation brings the influential platformer series to today's hardware. Through the 1980s and 1990s the Wonder Boy series gained a vast cult following thanks to its distinct blend of energeticFeaturing 21 versions of six of the most iconic Wonder Boy games ever released, this incredible compilation brings the influential platformer series to today's hardware. Through the 1980s and 1990s the Wonder Boy series gained a vast cult following thanks to its distinct blend of energetic platforming, action-RPG elements, and even shoot 'em up gameplay. And now you can enjoy a diverse spread of the Wonder Boy games that have left a powerful legacy throughout gaming, from the 1986 arcade original to 1994's Monster World IV.\r Whether you're a retro devotee wanting to catch up on this important piece of gaming history, a Wonder Boy fan looking to play your favourites on cutting edge hardware or are simply looking to experience the very best in nostalgic gameplay, Wonder Boy Anniversary Collection is about as essential as it gets.… Expand"}, {"name": "NASCAR The Game: Inside Line", "details_link": "https://www.metacritic.com/game/xbox-360/nascar-the-game-inside-line", "publisher": "Activision", "release_date": "Nov  6 2012", "developers": ["Eutechnyx"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 72, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/5/2a04d2ce72927302dd24f43ec4c2fd0c-98.jpg", "descriptions": "NASCAR The Game: Inside Line brings the NASCAR experience to consoles and lets you race with the top NASCAR Sprint Cup Series drivers, teams, and cars."}, {"name": "Tom Clancy's Rainbow Six 3: Athena Sword", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-3-athena-sword", "publisher": "Ubisoft", "release_date": "Mar  9 2004", "developers": ["Ubisoft Milan"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/8d4ebcf353c88c3fff7b6b48cb712d4f-98.jpg", "descriptions": "Command Team RAINBOW, the world's most elite, multinational squad of counter-terrorist operatives, as they track the desperate remnants of a dangerous terrorist organization into exotic regions of the Mediterranean to prevent their agenda of international anarchy and destruction. AthenaCommand Team RAINBOW, the world's most elite, multinational squad of counter-terrorist operatives, as they track the desperate remnants of a dangerous terrorist organization into exotic regions of the Mediterranean to prevent their agenda of international anarchy and destruction. Athena Sword boasts a host of standout features, including: All-new, eight-mission campaign in locations including Italy, Croatia, and Greece; Eight new Multiplayer levels; Five new multiplayer game modes; Three \"classic\" missions; Seven additional real-world weapons (for a whopping total of 64); Weapon sound effects from the team that worked on the blockbuster film The Matrix. [Ubi Soft]… Expand"}, {"name": "Commandos 3: Destination Berlin", "details_link": "https://www.metacritic.com/game/pc/commandos-3-destination-berlin", "publisher": "Eidos Interactive", "release_date": "Oct 14 2003", "developers": ["Pyro Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Military", "General", "Military", "Tactics"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/56a76623befb6736a5a0d236fa00a5e7-98.jpg", "descriptions": "Commandos 3: Destination Berlin is a game of real-time tactics that places you in command of an elite unit of Special Forces behind enemy lines. From the shores of France to the heart of the Third Reich, strike fast from land or sea with your small squad of guerrilla fighters, infiltratingCommandos 3: Destination Berlin is a game of real-time tactics that places you in command of an elite unit of Special Forces behind enemy lines. From the shores of France to the heart of the Third Reich, strike fast from land or sea with your small squad of guerrilla fighters, infiltrating hostile territories and conducting raids to disrupt the German war machine. [Eidos Interactive]… Expand"}, {"name": "Project Eden", "details_link": "https://www.metacritic.com/game/pc/project-eden", "publisher": "Eidos Interactive", "release_date": "Oct  8 2001", "developers": ["Core Design Ltd."], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/5f49bf7a354bfa0ce6808358fb03f7b2-98.jpg", "descriptions": "Designed by the team that created the original \"Tomb Raider,\" Project Eden puts the player in control of an elite 4-person team of Urban Protection Agency members called in to investigate a bizarre equipment malfunction at the Real Meat factory."}, {"name": "Spider-Man", "details_link": "https://www.metacritic.com/game/nintendo-64/spider-man", "publisher": "Activision", "release_date": "Nov 21 2000", "developers": ["Edge of Reality"], "platforms": "Nintendo 64", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/801a33c8cd5b26819677da66c5f28054-98.jpg", "descriptions": "He spins a web, swings across the sky and lands with a somersault onto the Daily Bugle building. Who is this masked hero? It's you! Fight, jump and web-sling as Spider-Man as you take on a legion of sinister villains. The city is depending on you."}, {"name": "Magic: The Gathering - Battlegrounds", "details_link": "https://www.metacritic.com/game/xbox/magic-the-gathering---battlegrounds", "publisher": "Atari", "release_date": "Nov 18 2003", "developers": ["Secret Level"], "platforms": ["PC", "Xbox"], "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/936ecf18ebd5c9b9ac19dee80c0b4288-98.jpg", "descriptions": "Magic: The Gathering - Battlegrounds brings the Magic world to life, as a real-time game that combines fighting and strategy.  As one of 17 powerful warriors competing in epic one-on-one battles, use your strength and sorcery to survive.  You can acquire over 70 different spells throughoutMagic: The Gathering - Battlegrounds brings the Magic world to life, as a real-time game that combines fighting and strategy.  As one of 17 powerful warriors competing in epic one-on-one battles, use your strength and sorcery to survive.  You can acquire over 70 different spells throughout your journey, which provide a variety of fighting combinations.  With single-player quests, downloadable content, 16 epic arenas, and intense multiplayer action via Xbox Live, experience the world of Magic like never before.… Expand"}, {"name": "LEGO DC Super-Villains", "details_link": "https://www.metacritic.com/game/xbox-one/lego-dc-super-villains", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 16 2018", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/d277efe37a54a7223cc4692b399c2d3c-98.jpg", "descriptions": "Players have the ability to create and play as an all-new Super-Villain throughout the game. Set in an expansive open world experience within the DC universe. It's up to you and a crazy group of misfits to uncover the intentions of earth's new wannabe superheroes."}, {"name": "Wayward Sky", "details_link": "https://www.metacritic.com/game/playstation-4/wayward-sky", "publisher": "Uber Entertainment", "release_date": "Oct 10 2016", "developers": ["Uber Entertainment"], "platforms": "PlayStation 4", "genres": ["Action", "General"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/e768057016e4042401c61a46d24345ef-98.jpg", "descriptions": "Risk life and limb as you explore a mysterious floating fortress in search of your kidnapped father in Wayward Sky on PlayStation VR. Assume the role of Bess, a young co-pilot who must navigate her way through puzzles and perilous pathways to find her father and escape the crumbling airborneRisk life and limb as you explore a mysterious floating fortress in search of your kidnapped father in Wayward Sky on PlayStation VR. Assume the role of Bess, a young co-pilot who must navigate her way through puzzles and perilous pathways to find her father and escape the crumbling airborne fortress. Guide the action with responsive motion controls and explore the unique environment from both third- and first-person perspectives. Specially crafted visuals and camera “blinks” transport you instantly from Bess’s point to view on board the fortress to high above the scene, looking down like a towering giant.\r… Expand"}, {"name": "Tony Hawk's Proving Ground", "details_link": "https://www.metacritic.com/game/xbox-360/tony-hawks-proving-ground", "publisher": "Activision", "release_date": "Oct 15 2007", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 72, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/22b48c9141548b303b4aa682055264dd-98.jpg", "descriptions": "For the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground featuresFor the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground features deeper customization than ever before, including a Video Editor with full-featured editing tools and visual effects for creating \"epic skate videos,\" and a fully customizable online Skate Lounge where players can skate with friends in the ultimate pad. In addition, players have the freedom to skate from single player to online seamlessly, as well as utilize new gameplay mechanics such as skateable terrain altering and building, and Bowl Carving. Tony Hawk’s Proving Ground also features even more Nail the Trick moves such as Nail the Grab and Nail the Manual intensifying the thrill of pulling off big tricks. [Activision]… Expand"}, {"name": "Bugsnax", "details_link": "https://www.metacritic.com/game/pc/bugsnax", "publisher": "Young Horses, Inc", "release_date": "Nov 12 2020", "developers": ["Young Horses", "Inc"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Adventure", "3D", "Open-World", "First-Person"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/121ac017029e9db21fabc31f66da10a9-98.jpg", "descriptions": "Explore whimsical Snaktooth Island in search of answersand a snack, maybe. \r\rIn this first-person adventure, you play as a journalist who receives a mysterious film from the disgraced explorer, Elizabert Megafig. She's invited you to Snaktooth Island to witness her latest and greatestExplore whimsical Snaktooth Island in search of answersand a snack, maybe. \r\rIn this first-person adventure, you play as a journalist who receives a mysterious film from the disgraced explorer, Elizabert Megafig. She's invited you to Snaktooth Island to witness her latest and greatest discovery: Bugsnax! Lured by the promise of a great story, you travel to the island to interview Elizabert and her group of misfit grumpuses. In the pursuit of your big scoop, you get caught up in hunting Bugsnax, feeding grumpuses, and solving the mysteries of the island\r * What are these half-bug half-snack creatures, really?\r* How do they affect the bodies of those who eat them?\r* And most importantly, why do they taste SO GOOD!?… Expand"}, {"name": "Tower 57", "details_link": "https://www.metacritic.com/game/pc/tower-57", "publisher": "11 bit studios", "release_date": "Nov 16 2017", "developers": ["Pixwerk"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/3548b2afab3184e216ec07dabb6a1069-98.jpg", "descriptions": "Tower 57 is a fast-paced neo-retro shooter where cooperation is as important as your ammo capacity. As a member of an extraordinary task force fight your way through a dieselpunk megatower and uncover its hidden secrets."}, {"name": "Disney/Pixar Cars 3: Driven to Win", "details_link": "https://www.metacritic.com/game/playstation-4/disneypixar-cars-3-driven-to-win", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 13 2017", "developers": ["Avalanche Software"], "platforms": ["PlayStation 3", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/ffa4f4eb088b691d351f3220314f7323-98.jpg", "descriptions": "Speed into the world of Cars as you determine your path to racing mastery in Cars 3: Driven to Win, the game inspired by the Disney Pixar film. Play with over 20 customizable characters including Lightning McQueen, Jackson Storm, Cruz Ramirez and the next generation of racers in over 20Speed into the world of Cars as you determine your path to racing mastery in Cars 3: Driven to Win, the game inspired by the Disney Pixar film. Play with over 20 customizable characters including Lightning McQueen, Jackson Storm, Cruz Ramirez and the next generation of racers in over 20 tracks set in iconic locations from the film such as Radiator Springs. Train and advance your abilities in 6 game modes and challenge your family and friends in the Battle Race to become the Ultimate Champion. On the road to becoming a Hall of Fame Driver, training and skill will give you an edge in a race that anyone can win.… Expand"}, {"name": "The Sims 3: University Life", "details_link": "https://www.metacritic.com/game/pc/the-sims-3-university-life", "publisher": "Electronic Arts", "release_date": "Mar  5 2013", "developers": ["The Sims Studio"], "platforms": "PC", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/ce8f0fbd76160d4526f7ad1bda8620c9-98.jpg", "descriptions": "The Sims 3 University Life opens a new chapter for young adult to elder Sims and anyone in between. Once a Sim is enrolled in university, they will pick from one of six majors and work towards earning a degree. From class activities to major-specific objects, The Sims 3 University Life willThe Sims 3 University Life opens a new chapter for young adult to elder Sims and anyone in between. Once a Sim is enrolled in university, they will pick from one of six majors and work towards earning a degree. From class activities to major-specific objects, The Sims 3 University Life will poise Sims for multiple benefits in their careers, including accelerated pay, higher career entry, new opportunities and more.… Expand"}, {"name": "Trash Panic", "details_link": "https://www.metacritic.com/game/playstation-3/trash-panic", "publisher": "SCEA", "release_date": "Jun  4 2009", "developers": ["SCEJ"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/3c4905d242d50d2755fa512ba4f7c92b-98.jpg", "descriptions": "[Playstation Network; also known as \"Gomibako\" in JPN]  Taking the puzzle video game genre one step further, Trash Panic is the newest PS3 downloadable exclusive that tasks players to compact as much garbage into a trash can before it overflows, and in the most eco-friendly way as possible.[Playstation Network; also known as \"Gomibako\" in JPN]  Taking the puzzle video game genre one step further, Trash Panic is the newest PS3 downloadable exclusive that tasks players to compact as much garbage into a trash can before it overflows, and in the most eco-friendly way as possible. Throughout each stage, random trash items will be delivered via crane to players who can then manipulate the speed and direction they fall using the DualShock 3 controller. The trash can will quickly reach full capacity unless the trash is broken down or dealt with by strategically using various elements given throughout each stage. Items will continue to be dropped until the player successfully compacts a certain number of items or ends up with an overflowing trash can. Each level will also feature a giant Boss item that players need to destroy in a certain amount of time to avoid getting penalized. At the end of each stage, each player will be rated by how eco-friendly or ego-friendly each stage was completed. The more eco-friendly, the higher the rating. Ratings help in unlocking various levels and modes. Spread across three different game modes, Trash Panic offers fun gaming for everyone. The Main Mode will take players progressively through six stages that increase in difficulty the further you advance. Vs. Mode allows two players to battle one another on the same screen. And lastly, Mission Mode offers mini-games for those who want to further their fun with a variety of waste management missions. Trash Panic also offers ways for players to show off their skills with trophy support and online learderboards. Additionally, players will have a recording option to upload up to 10 minutes of a gaming session onto YouTube to share with the rest of the world! [Sony]… Expand"}, {"name": "Return to PoPoLoCrois: A Story of Seasons Fairytale", "details_link": "https://www.metacritic.com/game/3ds/return-to-popolocrois-a-story-of-seasons-fairytale", "publisher": "XSEED Games", "release_date": "Mar  1 2016", "developers": ["Marvelous Inc."], "platforms": "3DS", "genres": ["Strategy", "General"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/f112a9e9483d0384faf83f432d3387f2-98.jpg", "descriptions": "Dive into the soil of a land corrupted by darkness. Restore life, fight evil, save the day, and return to PopoloCrois!\r Its Prince Pietro's 13th birthday, and all the people of PopoloCrois have come out to celebrate! But among them is a very special guest: Marmela, a representative from anDive into the soil of a land corrupted by darkness. Restore life, fight evil, save the day, and return to PopoloCrois!\r Its Prince Pietro's 13th birthday, and all the people of PopoloCrois have come out to celebrate! But among them is a very special guest: Marmela, a representative from an otherworldly kingdom called Galariland. Her country has been ravaged by shadowy creatures who corrupt the soil, preventing crops from growing -- and since this same phenomenon has been occurring in PopoloCrois as well, the king now seeks her counsel.\r Her expert opinion? Prince Pietro should visit Galariland personally as an ambassador for PopoloCrois, to see the damage first-hand and learn all the ways the Galari people are fighting back. But once he's there, he finds there's no way home, and his princely name holds little sway over the long-suffering people of this new world.\r It is up to you, as Prince Pietro, to make a life for yourself in Galariland while seeking a way home, doing everything you can in the meantime to cultivate the earth and new friendships alike.\r A fantastical fairytale adventure awaits!… Expand"}, {"name": "GripShift", "details_link": "https://www.metacritic.com/game/xbox-360/gripshift", "publisher": "Microsoft Game Studios", "release_date": "Dec 12 2007", "developers": ["Sidhe Interactive"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/a0e73938d930cc65e190b0a0414755ec-98.jpg", "descriptions": "[Xbox Live Arcade]  GripShift combines high-flying platform gaming with extreme stunt driving action. Test your reflexes and bend your brain as you stunt your way through 120 twisting Challenge Mode levels across four uniquely themed worlds. Collect power-ups, avoid traps, and beat the clock[Xbox Live Arcade]  GripShift combines high-flying platform gaming with extreme stunt driving action. Test your reflexes and bend your brain as you stunt your way through 120 twisting Challenge Mode levels across four uniquely themed worlds. Collect power-ups, avoid traps, and beat the clock as you compete for top leaderboard slots in single player mode, or deploy an arsenal of funky weapons and go head-to-head across 25 Race Mode tracks and 20 Deathmatch arenas in online multiplayer. Choose your driver, unlock faster vehicles, and customize your ride with new skins. GripShift is a gravity-defying thrill ride every racing fan must experience. [Microsoft]… Expand"}, {"name": "Tales of Zestiria", "details_link": "https://www.metacritic.com/game/playstation-4/tales-of-zestiria", "publisher": "Bandai Namco Games", "release_date": "Oct 20 2015", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/dd91fa85db78e5d4c2dda898dfcbddbf-98.jpg", "descriptions": "An unseen evil force known as Malevolence is spreading across the land, corrupting the world and causing humanity to falter. Players will embark on an epic journey as Sorey, a young pure-hearted adventurer whose destiny is to become The Shepard, an individual of great power that can banishAn unseen evil force known as Malevolence is spreading across the land, corrupting the world and causing humanity to falter. Players will embark on an epic journey as Sorey, a young pure-hearted adventurer whose destiny is to become The Shepard, an individual of great power that can banish Malevolence. Does Sorey have the courage and heart to wield this extraordinary responsibility for good, or will he fall prey to the evils of its power? TALES OF ZESTIRIA introduces a new version of its celebrated real-time battle system, allowing for faster combat with side dashes and new fusion technique combo opportunities.  Throughout his quest, Sorey will befriend humans and spirits known as Seraphim, unseen to most humans, to aide him on his journey.  Because of Sorey’s unique ability to communicate with the Seraphim he is able to fuse with their essence to create new elemental artes for strategic attacks to decimate foes.  … Expand"}, {"name": "The Journey Down: Chapter One", "details_link": "https://www.metacritic.com/game/pc/the-journey-down-chapter-one", "publisher": "SkyGoblin", "release_date": "May 18 2012", "developers": ["SkyGoblin"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/2e4c1bb070211a14eeaf1ea4afd34964-98.jpg", "descriptions": "The Journey Down is a classic point 'n click saga with a black African twist, owing much of its character and pattern design to traditional central African arts such as carvings and masks from the Makonde and Chokwe tribes. Mixed with an all original jazzy reggae soundtrack,The Journey Down is a classic point 'n click saga with a black African twist, owing much of its character and pattern design to traditional central African arts such as carvings and masks from the Makonde and Chokwe tribes. Mixed with an all original jazzy reggae soundtrack, feedback-oriented puzzles and tons of hand painted environments, the unique cultural fusion of The Journey Down is bound to draw you in.… Expand"}, {"name": "Naruto: Clash of Ninja Revolution 2", "details_link": "https://www.metacritic.com/game/wii/naruto-clash-of-ninja-revolution-2", "publisher": "D3", "release_date": "Oct 21 2008", "developers": ["Eighting"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/2327c22997a57f2e7d6d3809dccb2fe8-98.jpg", "descriptions": "NARUTO: Clash of Ninja Revolution 2 provides players with quality fighting game mechanics and a fast-paced gameplay experience on Wii. Set after Sasuke leaves the Leaf Village to gain more power from Orochimaru, the title offers a slew of playable characters, including those developedNARUTO: Clash of Ninja Revolution 2 provides players with quality fighting game mechanics and a fast-paced gameplay experience on Wii. Set after Sasuke leaves the Leaf Village to gain more power from Orochimaru, the title offers a slew of playable characters, including those developed especially for the storyline. Clash of Ninja Revolution 2 features destructible stages and four-player multiplayer battles, along with gameplay modes and characters not yet seen on the Clash of Ninja series. [D3Publisher]… Expand"}, {"name": "Submerged: Hidden Depths", "details_link": "https://www.metacritic.com/game/playstation-5/submerged-hidden-depths", "publisher": "Uppercut Games Pty Ltd", "release_date": "Mar 10 2022", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b16b818b2a1f95eed4b4281e04ff39c7-98.jpg", "descriptions": "A drowned city, crumbling tips of skyscrapers stubbornly standing above the waves. Deserted villages, now inhabited by enigmatic creatures. And beneath the surging ocean waits an anguished, angry presence.\r Submerged: Hidden Depths is a non-combat third-person “relaxploration” adventure,A drowned city, crumbling tips of skyscrapers stubbornly standing above the waves. Deserted villages, now inhabited by enigmatic creatures. And beneath the surging ocean waits an anguished, angry presence.\r Submerged: Hidden Depths is a non-combat third-person “relaxploration” adventure, set in the sunken ruins of a beautiful world. Take on the role of Miku and Taku – one cursed with a mysterious power that she wants to use for good, the other determined not to let it tear them apart.\r Boat across tranquil waters and storm-driven white-caps, explore and climb what remains of a once-towering city, and scour the buildings for the seeds of its salvation.… Expand"}, {"name": "Zarvot", "details_link": "https://www.metacritic.com/game/switch/zarvot", "publisher": "Snowhydra llc", "release_date": "Oct 18 2018", "developers": ["Snowhydra llc"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/b3971c1288d99a6f4d0728e4218a91b9-98.jpg", "descriptions": "This is a game of cubes. Tiny, adorable cubes with hopes, dreams, unrequited loves… and unlimited destructive power. In Story Mode, you’ll follow the adventures of Charcoal and Mustard as they search for the ultimate birthday present to cheer up their best friend, Red--who is feeling quiteThis is a game of cubes. Tiny, adorable cubes with hopes, dreams, unrequited loves… and unlimited destructive power. In Story Mode, you’ll follow the adventures of Charcoal and Mustard as they search for the ultimate birthday present to cheer up their best friend, Red--who is feeling quite blue. Take the subway to nine unique worlds where you’ll battle rogue bananas, evil milk cartons, and crayon box spiders--whatever it takes to make Red happy again.… Expand"}, {"name": "Shenmue I & II", "details_link": "https://www.metacritic.com/game/xbox-one/shenmue-i-ii", "publisher": "Sega", "release_date": "Aug 21 2018", "developers": ["Sega", "d3t Ltd"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/5afd236ab3b3659ee2aa998b6d71550f-98.jpg", "descriptions": "A tale of revenge.In 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father's death and sets out tracing LanA tale of revenge.In 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father's death and sets out tracing Lan Di's path.The first game in the series, Shenmue begins the tale as Ryo travels around Yokosuka, Japan, gathering clues about his father's murder and dealing with nefarious gangsters along the way.The sequel Shenmue II continues Ryo's quest, this time crossing the sea to Hong Kong, China. Ryo ventures deeper into the criminal underworld, meeting martial arts masters who aid him on his journey and offer insight into his father's death, and unravels the mysteries of the Dragon Mirror that his father kept hidden.Gameplay:* Take the role of Ryo Hazuki.* Explore a 3D open world searching for clues, examining objects, and talking to NPCs.* Battle enemies and bosses making full use of the moves of Hazuki-style jujitsu.* Beat quick-time events (QTEs) and mini-games.Key features:The best Shenmue experiencePioneering Dreamcast classics available for the first time on PCUpdated user interfaceChoice of modern or classic controlsJapanese audio available for the first time for a global audienceFully scalable screen resolutionsAn epic legendA tale of revenge on a grand scaleSolve the mystery of your father's murderAn experience never to be forgottenThe world feels aliveTalk to anyone, scour the world for cluesNPCs live independent lives on their own scheduleFaithful recreations of 1980s Japan and Hong Kong, ChinaDistract yourself with arcade games, collectibles, duck racing, and more… Expand"}, {"name": "Gurumin 3D: A Monstrous Adventure", "details_link": "https://www.metacritic.com/game/3ds/gurumin-3d-a-monstrous-adventure", "publisher": "Mastiff", "release_date": "Oct 13 2016", "developers": ["Falcom"], "platforms": ["PC", "3DS"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/b9de84853c337e1c654eb2a4361c8e1b-98.jpg", "descriptions": "Gurumin stars a strong-willed girl named Parin, who is sent to live with her grandfather in a small mining town while her parents are off excavating an ancient ruin. With no other children living in this town, Parin is surprised one day to encounter a young girl being tormented by a strayGurumin stars a strong-willed girl named Parin, who is sent to live with her grandfather in a small mining town while her parents are off excavating an ancient ruin. With no other children living in this town, Parin is surprised one day to encounter a young girl being tormented by a stray dog. After Parin drives off the mongrel, she is shocked to discover the young girl is actually a monster, and like all monsters, invisible to adults. Parin is soon invited to pass through a crack in the wall behind her home and enter Monster Village. Parin has just started making monster friends when evil spirits, known as the Phantoms, invade the village and monsternap most of the inhabitants. Parin soon learns of the Legendary Drill, a weapon hidden underneath the village and, in the right hands, powerful enough to destroy the Phantoms. Thus begins Parin's quest to reclaim the Legendary Drill and set the world right. Features Non-linear game play set in vast world with a variety of stages in different environments. 23 non-player characters, 48 unique enemies, and over 90 items to collect. Destroy everything in your path with your legendary drill: almost all objects are destructible, and many hide money and valuable items.… Expand"}, {"name": "Hitman GO: Definitive Edition", "details_link": "https://www.metacritic.com/game/pc/hitman-go-definitive-edition", "publisher": "Square Enix", "release_date": "Feb 23 2016", "developers": ["Square Enix Montreal"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 72, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/4ba0011b219f70e3c604c0f1cdb8b465-98.jpg", "descriptions": "Get your daily fix of Agent 47 with this elegant, strategy-based Hitman game!"}, {"name": "Pro Evolution Soccer 2010", "details_link": "https://www.metacritic.com/game/psp/pro-evolution-soccer-2010", "publisher": "Konami", "release_date": "Nov 10 2009", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 72, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/b60ef2e959ff0cae66f65a8521f6ff1c-98.jpg", "descriptions": "PES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccerPES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccer simulation, as it requires both strategic play and quick reactions, as in real life. In addition to key out-field elements, goalkeepers are more versatile and with abilities matching those of modern shot-stoppers. The game's referees have also been reworked, with smarter AI elements allowing them to make more balanced calls during matches. PES 2010 has undergone a major visual revamp, with its celebrated player likenesses and animations now even closer to those of real-life players - including live player expressions to be depicted with an improved lighting system which differentiates between various conditions! [Konami]… Expand"}, {"name": "Disney/Pixar Cars 2", "details_link": "https://www.metacritic.com/game/xbox-360/disneypixar-cars-2", "publisher": "Disney Interactive Studios", "release_date": "Jun 21 2011", "developers": ["Avalanche Software"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Mission-based", "General", "General", "Arcade", "Automobile"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/2657255e832bfbce2225878a5d94611a-98.jpg", "descriptions": "Inspired by the upcoming DisneyPixar animated film, Cars 2: The Video Game lets players jump into the Cars 2 universe with some of their favorite Cars personalities in exotic locations around the globe."}, {"name": "Shattered Horizon", "details_link": "https://www.metacritic.com/game/pc/shattered-horizon", "publisher": "Futuremark Games Studio", "release_date": "Nov  4 2009", "developers": ["Futuremark Games Studio"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/055918bb191d7bbb5a9fcf3f2e5c363b-98.jpg", "descriptions": "Shattered Horizon is the first game from Futuremark Games Studio that immerses you in the cold reality of combat in space. This multiplayer first-person shooter is played entirely in zero gravity. A catastrophic explosion on the Moon has filled near-Earth space with billions of tons of rockyShattered Horizon is the first game from Futuremark Games Studio that immerses you in the cold reality of combat in space. This multiplayer first-person shooter is played entirely in zero gravity. A catastrophic explosion on the Moon has filled near-Earth space with billions of tons of rocky debris. You and your friends will join intense 32 player battles to control hollowed-out asteroids, huge fragments of Moon rock and the ruined remains of the International Space Station. With simple and intuitive controls, you have complete freedom of movement in the distinctive zero gravity environments. Not only can you use your rocket pack to fly anywhere but you can also land on any surface to attack your enemies from unexpected angles. Shattered Horizon challenges you to take your FPS skills to the next level adapting what you have learned on the battlefield to create new tactics in a fully three dimensional battle space. With your rifle at the ready you can handle anything the enemy can throw at you. But if you let go of your gun, chances are you're already dead. [Steam]… Expand"}, {"name": "Layers of Fear 2", "details_link": "https://www.metacritic.com/game/switch/layers-of-fear-2", "publisher": "Bloober Team", "release_date": "May 20 2021", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/f804de30481a74396b3b2695ea0a53e1-98.jpg", "descriptions": "What part will you play?Layers of Fear 2 is a first-person psychological horror game with an emphasis on exploration and story. Players control a Hollywood actor who heeds the call of an enigmatic director to take on the lead role in a film shot aboard an ocean liner.\n\nExplore the worldWhat part will you play?Layers of Fear 2 is a first-person psychological horror game with an emphasis on exploration and story. Players control a Hollywood actor who heeds the call of an enigmatic director to take on the lead role in a film shot aboard an ocean liner.Explore the world around you. Discover your past, and expose the reason for your having been cast for this film.… Expand"}, {"name": "The Blackout Club", "details_link": "https://www.metacritic.com/game/playstation-4/the-blackout-club", "publisher": "Question", "release_date": "Jul 30 2019", "developers": ["Question"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/7891dacf25b3cc7973d2cde3f9a222b9-98.jpg", "descriptions": "The Blackout Club is a first-person co-op horror game centered around a group of teenage friends investigating a monstrous secret beneath the skin of their small town. Every night, everyone in town gets out of bed and sleepwalks. In the morning, they wake up with no recollection of whatThe Blackout Club is a first-person co-op horror game centered around a group of teenage friends investigating a monstrous secret beneath the skin of their small town. Every night, everyone in town gets out of bed and sleepwalks. In the morning, they wake up with no recollection of what happened or where they were…… Expand"}, {"name": "Aarklash: Legacy", "details_link": "https://www.metacritic.com/game/pc/aarklash-legacy", "publisher": "Cyanide", "release_date": "Sep 12 2013", "developers": ["Cyanide", "Cyanide Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "Real-Time", "General", "Tactics"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/bc837f784db16d2008d0095ff29122a4-98.jpg", "descriptions": "Aarklash: Legacy is a tactical role playing game centered around the principles of planification and strategy. Master tactical combat through the use of active pause to coordinate the various heroes and their skills. Play cleverly to defeat all the merciless creatures living in Aarklash.Aarklash: Legacy is a tactical role playing game centered around the principles of planification and strategy. Master tactical combat through the use of active pause to coordinate the various heroes and their skills. Play cleverly to defeat all the merciless creatures living in Aarklash. Learn their weaknesses and send them to their graves. Sharpen your skills/techniques and attempt to defeat the game in Ragnarok mode, if you dare.… Expand"}, {"name": "Dragon Ball Z: Budokai Tenkaichi 2", "details_link": "https://www.metacritic.com/game/wii/dragon-ball-z-budokai-tenkaichi-2", "publisher": "Atari", "release_date": "Nov 15 2006", "developers": ["Spike"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/a3424999fe8664fee05dc0f2c159f59a-98.jpg", "descriptions": "Combining action, fighting and light role-playing game elements, Dragon Ball Z: Budokai Tenkaichi 2 sends players into a rich story mode that spans the entire Dragon Ball, DBZ, and Dragon Ball GT series. The game takes the acrobatic and intense 3D flying and fighting dynamic made popular inCombining action, fighting and light role-playing game elements, Dragon Ball Z: Budokai Tenkaichi 2 sends players into a rich story mode that spans the entire Dragon Ball, DBZ, and Dragon Ball GT series. The game takes the acrobatic and intense 3D flying and fighting dynamic made popular in the first game and takes it to a new level with over 100 playable characters, 15 vast and vibrant 3D destructible environments, and nine different game modes, including intense single and multiplayer battles. Team up with Z-Warriors to complete exciting missions, ripped right from the TV show (the player can play with two warriors while in battle, and can switch warriors during the battle). Over 100 DBZ warriors, including many that have never been seen in previous DBZ games. Improved camera system, explosive environmental damage, and in-game transformations. The complete DBZ mythology, from Dragon Ball To Dragon Ball GT. Post customizable character codes to the Internet. [Atari]… Expand"}, {"name": "Mount & Blade", "details_link": "https://www.metacritic.com/game/pc/mount-blade", "publisher": "Paradox Interactive", "release_date": "Sep 16 2008", "developers": ["Taleworlds Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/97954bece81e190e521aef2098c16d60-98.jpg", "descriptions": "Calradia is a land at war, a land offering great riches and even greater dangers to the adventurers and mercenaries that flock to shed their blood on its soil. With unerring courage and a strong sword, an unknown stranger can make a name as a warrior. Raise a band of hardened soldiers,Calradia is a land at war, a land offering great riches and even greater dangers to the adventurers and mercenaries that flock to shed their blood on its soil. With unerring courage and a strong sword, an unknown stranger can make a name as a warrior. Raise a band of hardened soldiers, become the lord of several towns and castles, and perhaps one day you may wield the power to depose kings and crown new ones at a whim. Free-form sandbox gameplay. You are free to go anywhere and do anything you choose in a world that has more than a hundred unique locations, including villages, castles and towns. Unique horseback combat. You are able to attack your enemies on your horse, whether you’re swinging a sword, holding a lance or unleashing arrows. Highly advanced, sophisticated and intuitive sword-fighting system. Fight on horseback and on foot using an expansive variety of medieval weapons, each with their own unique characteristics, strengths and weaknesses. Be anything from a lonesome adventurer to a commander of armies or an owner of villages, castles or towns. Sophisticated AI that will provide a challenge both in combat and in the strategic realm. Freedom to interact with hundreds of characters, including kings, lords, ladies, commoners as well as heroes you can take on as companions, each with their own personality. [Paradox Interactive]… Expand"}, {"name": "Cognition: An Erica Reed Thriller Episode 1 - The Hangman", "details_link": "https://www.metacritic.com/game/pc/cognition-an-erica-reed-thriller-episode-1---the-hangman", "publisher": "Phoenix Online Studios", "release_date": "Oct 30 2012", "developers": ["Phoenix Online Studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/50d277f451d61ed5fbeed3eb63aab62a-98.jpg", "descriptions": "Three years ago, FBI agent Erica Reed lost her brother to a serial killer who was never caught. During this desperate investigation, she developed the strange and unpredictable power of post-cognition: by touching an object, she can see its past and the events that happened on, to, or aroundThree years ago, FBI agent Erica Reed lost her brother to a serial killer who was never caught. During this desperate investigation, she developed the strange and unpredictable power of post-cognition: by touching an object, she can see its past and the events that happened on, to, or around it. Though undeniably useful in her line of work, this skill makes her uneasy and has caused her problems professionally and personally. Now a new serial killer is on the move—one who leaves behind clues perfectly suited to Agent Reed's unique abilities. Has someone learned her secret? What do they want from her? More importantly: by working this case, will Erica finally uncover enough evidence to bring her brother's killer to justice?… Expand"}, {"name": "Team Sonic Racing", "details_link": "https://www.metacritic.com/game/playstation-4/team-sonic-racing", "publisher": "Sega", "release_date": "May 21 2019", "developers": ["Sumo Digital"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/45c3612ef6ce9cb297f7be946a381ed2-98.jpg", "descriptions": "Team Sonic Racing combines the best elements of arcade and fast and fast-paced competitive style racing as you face-off with friends in off with friends in intense multiplayer racing. Race together and work as a team by sharing power-ups and speed boosts. Take control of your racing style --Team Sonic Racing combines the best elements of arcade and fast and fast-paced competitive style racing as you face-off with friends in off with friends in intense multiplayer racing. Race together and work as a team by sharing power-ups and speed boosts. Take control of your racing style -- Choose from 3 distinct character types and unlock game changing vehicle customisation options to suit your racing style. Speed up. Gear Up -- Team Racing at Sonic Speed!… Expand"}, {"name": "The Silver Case 2425", "details_link": "https://www.metacritic.com/game/switch/the-silver-case-2425", "publisher": "NIS America", "release_date": "Jul  6 2021", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/f5909f12113564bae50a2d649b6c3dd0-98.jpg", "descriptions": "The Silver 2425 includes 2 games: The Silver Case and The 25th Ward: The Silver Case."}, {"name": "Backbone", "details_link": "https://www.metacritic.com/game/pc/backbone", "publisher": "Raw Fury", "release_date": "Jun  8 2021", "developers": ["EggNut"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/8e3956ed1c79053d20f8693d0cd914f5-98.jpg", "descriptions": "Backbone is a post-noir roleplaying detective adventure. Become raccoon private eye Howard Lotor as you interrogate a diverse cast of characters, collect evidence, and explore dystopian Vancouver, BC inhabited by animals."}, {"name": "Red Faction: Guerrilla Re-Mars-tered", "details_link": "https://www.metacritic.com/game/switch/red-faction-guerrilla-re-mars-tered", "publisher": "THQ Nordic", "release_date": "Jul  2 2019", "developers": ["Volition Inc.", "Kaiko"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/96c1c1b061dcb339035cd97e1d62c74f-98.jpg", "descriptions": "Set 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: GuerrillaSet 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: Guerrilla still defines the limits of destruction-based game-play with a huge open-world, fast-paced guerrilla-style combat, and true physics-based destruction.\r Features:\r * Open World Guerrilla Warfare - You decide who, when, where and how to battle. Utilize guerrilla tactics, improvised weaponry, and modified vehicles to lead insurgent attacks on EDF targets. Launch attacks based on your own gameplay style, take on missions in any order you choose, or engage in destructive activities to weaken the EDF's grip on Mars.\r* Strategic Destruction - Use destruction to your tactical advantage, setting ambushes or chain reaction explosions to attack enemy strongholds and permanently modify the game environment. Leverage fully-dynamic physics-based destruction to improvise on the fly: blow holes in a wall or floor to set an ambush or escape, take out a staircase to stop your pursuers, or drive vehicles through blown out walls.\r* Evolving & Emergent Gameplay - Carve your path through an ever-changing landscape as you improvise your combat tactics - mixing gameplay styles, vehicles, weapons and explosives to defeat the EDF.\r* Epic Sci-Fi Setting - Explore the huge, unforgiving Martian landscape, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos; then tear through the fully destructible open-world environments swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire.\r* Multiplayer Combat - There is no place to hide when you put your guerrilla warfare skills to the test in a variety of highly destructive multiplayer combat modes.\r Re-Mars-tered Features:\r > Fully reworked graphics Heavily reworked textures and graphic features adding for example specular maps.\r> Improved shadow rendering\r> Improved Lighting\r> Shader & Postprocessing rework\r> Native 4k support for the finest up to date mars destruction experience ever… Expand"}, {"name": "MXGP Pro", "details_link": "https://www.metacritic.com/game/xbox-one/mxgp-pro", "publisher": "Milestone S.r.l", "release_date": "Jul 10 2018", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/0a07ec7c784024c90c83f1db099781c0-98.jpg", "descriptions": "Create your rider and climb the ranks in Career mode. Jump in the Compound area: a bigger, wider training area with different terrain conditions. Test your skills facing 30 different challenges: a dedicated game mode to learn step by step the best motocross techniques in the most realisticCreate your rider and climb the ranks in Career mode. Jump in the Compound area: a bigger, wider training area with different terrain conditions. Test your skills facing 30 different challenges: a dedicated game mode to learn step by step the best motocross techniques in the most realistic way. This and much, much more thanks to the new, innovative PRO Physics.… Expand"}, {"name": "88 Heroes", "details_link": "https://www.metacritic.com/game/playstation-4/88-heroes", "publisher": "Rising Star Games", "release_date": "Mar 24 2017", "developers": ["Rising Star Games", "Bitmap Bureau"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/4614a455262c58a5ed44b359fe91b10b-98.jpg", "descriptions": "It’s 8:08 AM on August 8, 1988, and the evil Dr. H8 has brought the world to the brink of total annihilation. His demands are simple: pay $88 octillion within 88 minutes, or Dr. H8’s 88 thermo-nuclear warheads will wipe out the Earth! But who will save us in our time of need? The bravest?It’s 8:08 AM on August 8, 1988, and the evil Dr. H8 has brought the world to the brink of total annihilation. His demands are simple: pay $88 octillion within 88 minutes, or Dr. H8’s 88 thermo-nuclear warheads will wipe out the Earth! But who will save us in our time of need? The bravest? The boldest? No… the 88 Heroes.… Expand"}, {"name": "Mass Effect: Andromeda", "details_link": "https://www.metacritic.com/game/pc/mass-effect-andromeda", "publisher": "Electronic Arts", "release_date": "Mar 21 2017", "developers": ["BioWare"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/9938bf40cf28a73526c36f87b04ef90e-98.jpg", "descriptions": "The story opens after a 600-year journey to the Andromeda galaxy, as the crew begins searching for a new home for humanity. The dreams of easy settlement are quickly shattered, as worlds expected to be paradises are instead wastelands, and the Pathfinder discovers that not all inhabitants ofThe story opens after a 600-year journey to the Andromeda galaxy, as the crew begins searching for a new home for humanity. The dreams of easy settlement are quickly shattered, as worlds expected to be paradises are instead wastelands, and the Pathfinder discovers that not all inhabitants of the galaxy welcome humanity. Terrifying enemies will challenge players and their crew, forcing them to utilize destructible environments, vertical movement through boosted jumps, customizable weapons, Biotics and other tools in their arsenal to even the playing field in a combat system and character progression that is more thrilling and open than ever. Mass Effect: Andromeda also features a separate team-based online multiplayer mode where players can engage in fast, fluid and frenetic combat to work together and achieve success. Utilizing combat skills, strategies, weapons and abilities gained from the field, players must coordinate to take down overwhelming forces. [Electronic Arts]… Expand"}, {"name": "The Wardrobe", "details_link": "https://www.metacritic.com/game/pc/the-wardrobe", "publisher": "Adventure Productions", "release_date": "Feb 15 2017", "developers": ["C.I.N.I.C. Games", "CINIC Games"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/e51e12d806b5023c1d268ee49e3f6f06-98.jpg", "descriptions": "Inspired by the great ‘90s classics such as 'Monkey Island', 'Day of the Tentacle', 'Tony Tough' and 'Sam & Max: Hit the Road', \"The Wardrobe\" has a strong sense of humour, but isn't shy about dealing with mature and non-politically correct themes."}, {"name": "Penarium", "details_link": "https://www.metacritic.com/game/xbox-one/penarium", "publisher": "Team17", "release_date": "Sep 23 2015", "developers": ["Self Made Miracle"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/15bf4d20618391807b559af991e7f86f-98.jpg", "descriptions": "Penarium is a frantic 2D arena arcade game in which you take on the role of quirky antihero, Willy. Willy is trapped in a crazy circus show where he needs to run, jump, and avoid an array of killer death-traps while being cheered on by a sadistic crowd that’s out for blood — his blood. [SelfPenarium is a frantic 2D arena arcade game in which you take on the role of quirky antihero, Willy. Willy is trapped in a crazy circus show where he needs to run, jump, and avoid an array of killer death-traps while being cheered on by a sadistic crowd that’s out for blood — his blood. [Self Made Miracle]… Expand"}, {"name": "Renowned Explorers: International Society", "details_link": "https://www.metacritic.com/game/pc/renowned-explorers-international-society", "publisher": "Abbey Games", "release_date": "Sep  2 2015", "developers": ["Abbey Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/a098ce0c2a714df9d4379b8ab8960f51-98.jpg", "descriptions": null}, {"name": "Oddworld: Munch's Oddysee HD", "details_link": "https://www.metacritic.com/game/playstation-vita/oddworld-munchs-oddysee-hd", "publisher": "Oddworld Inhabitants", "release_date": "Dec 16 2014", "developers": ["Just Add Water"], "platforms": ["PlayStation 3", "Switch", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Sci-Fi", "3D", "Platformer", "2D", "Action Adventure", "General"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/d812a9e270f022153aabb368291bd7be-98.jpg", "descriptions": "Munch, the Gabbit with odditude and his sidekick Abe lead an off-beat revolution to save the world.  With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control the enemy,Munch, the Gabbit with odditude and his sidekick Abe lead an off-beat revolution to save the world.  With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control the enemy, arming themselves with wacky weapons, and acquiring power-ups for extra boosts.  You can switch between Munch and Abe at anytime to utilize each character's unique abilities and access certain areas.… Expand"}, {"name": "Lara Croft and the Temple of Osiris", "details_link": "https://www.metacritic.com/game/xbox-one/lara-croft-and-the-temple-of-osiris", "publisher": "Square Enix", "release_date": "Dec  9 2014", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "genres": ["Action", "Action Adventure", "Platformer", "Linear", "2D"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/e7ff90be90a636ae4cf3259231e96376-98.jpg", "descriptions": "Lara Croft and the Temple of Osiris is the sequel to Lara Croft and the Guardian of Light. In her new adventure, Lara Croft travels to Egypt and realized she must join forces with rival treasure hunter Carter Bell and imprisoned gods Horus and Isis to defeat the evil god Set. Featuring aLara Croft and the Temple of Osiris is the sequel to Lara Croft and the Guardian of Light. In her new adventure, Lara Croft travels to Egypt and realized she must join forces with rival treasure hunter Carter Bell and imprisoned gods Horus and Isis to defeat the evil god Set. Featuring a 4-player co-op story, players must work together to explore the temple, defeat hordes of enemies from the Egyptian underworld, solve devious puzzles, and avoid deadly traps. At the same time, players compete for treasure, powerful artifacts, and ultimate bragging rights. … Expand"}, {"name": "Just Dance 2015", "details_link": "https://www.metacritic.com/game/playstation-4/just-dance-2015", "publisher": "Ubisoft", "release_date": "Oct 21 2014", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/ffe63c24e1c17a3ff5fa10623c381a05-98.jpg", "descriptions": "Since its launch in 2009, the Just Dance franchise has become the world’s top selling dance video game and a mainstay of popular culture. And the game is back again this year with Just Dance 2015, bringing hot moves and new features to 40+ current hit songs and throwback favorite tunes. LetSince its launch in 2009, the Just Dance franchise has become the world’s top selling dance video game and a mainstay of popular culture. And the game is back again this year with Just Dance 2015, bringing hot moves and new features to 40+ current hit songs and throwback favorite tunes. Let loose with friends and family by dancing to hit songs like “Happy” by Pharrell Williams and “Burn” by Ellie Goulding. Staying true to the Just Dance personality, there are also legendary favorites like “Walk This Way” by Run DMC & Aerosmith and a chance to dance to Tetris moves!  Get ready for this year’s fun and quirky dance moves that have something for everyone in your family or group of friends.… Expand"}, {"name": "Borderlands: Claptrap's New Robot Revolution", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-claptraps-new-robot-revolution", "publisher": "2K Games", "release_date": "Sep 28 2010", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/6fbe5eb8b0fb5244310a7c5a1091a1bc-98.jpg", "descriptions": "Claptrap's New Robot Revolution invites recruits to attempt to beat down the deadly Claptrap revolution either as a lone gunman or in co-op teams of four treasure hunters using many of the more than 17 million unique weapons available in the game. Brave volunteers will find themselves caughtClaptrap's New Robot Revolution invites recruits to attempt to beat down the deadly Claptrap revolution either as a lone gunman or in co-op teams of four treasure hunters using many of the more than 17 million unique weapons available in the game. Brave volunteers will find themselves caught in the lethal cross hairs between the Hyperion Corporation's fortified armadas and the ever-growing army of homicidal Claptraps and \"Claptrap-ified\" enemies led by one of the most eagerly awaited characters in the franchise’s history - the cunning Ninja Assassin Claptrap.  … Expand"}, {"name": "Forgotten Realms: Demon Stone", "details_link": "https://www.metacritic.com/game/xbox/forgotten-realms-demon-stone", "publisher": "Atari", "release_date": "Nov 17 2004", "developers": ["Stormfront Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/304838379876358e954f9762871763ee-98.jpg", "descriptions": "A lone fighter, a brash sorcerer, a hot-tempered rogue... Three warriors, brought together by an unexplainable force, must now embark on a dangerous journey. You can take control of all three characters, switching between them to battle an onslaught of enemies. Use melee moves, projectileA lone fighter, a brash sorcerer, a hot-tempered rogue... Three warriors, brought together by an unexplainable force, must now embark on a dangerous journey. You can take control of all three characters, switching between them to battle an onslaught of enemies. Use melee moves, projectile power, and stealth attacks to defeat creatures from the world of Dungeons & Dragons. Set within the Forgotten Realms, Demon Stone's locations include Gemspark Mines, Jungles of Chult, Underdark, and more.… Expand"}, {"name": "Boyfriend Dungeon", "details_link": "https://www.metacritic.com/game/switch/boyfriend-dungeon", "publisher": "Kitfox Games", "release_date": "Aug 11 2021", "developers": ["Kitfox Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/d7175774eb7722616a19738715f797e7-98.jpg", "descriptions": "Romance your swords:\r - Date up to nine weapons, from dancing swords to heart-piercing daggers\r\n- Generated action-combat dunj and challenges! Stay sharp!\r\n- Various combat styles. For example, hit hard and dodge quickly with the dagger, or take on crowds with Lasersaber\r\n- Inclusive,Romance your swords:\r - Date up to nine weapons, from dancing swords to heart-piercing daggers\r- Generated action-combat dunj and challenges! Stay sharp!\r- Various combat styles. For example, hit hard and dodge quickly with the dagger, or take on crowds with Lasersaber\r- Inclusive, tasteful approach to gender and sexuality - male, female, and non-binary romance\r- Let's get to the point: take your weapon-babes on romantic outings, such as to the club or the beach\r For your summer job, you’re tasked with clearing the creatures in “the dunj”. Soon you discover weapons you find transform into cuties… and they’re SINGLE! (What a craaazy coincidence because you also happen to be up for grabs yourself.)\r Spend the cash you earn on romantic outings to forge precious moments with your lovers and work together to clear the rampant monster infestations, because after all, a couple that slays together, stays together.\r… Expand"}, {"name": "Purrfect Date", "details_link": "https://www.metacritic.com/game/pc/purrfect-date", "publisher": "Bossa Studios", "release_date": "Dec 15 2017", "developers": ["The Bae Team"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 72, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/0a8bdf0dc8860bcd0b71134e05f92d23-98.jpg", "descriptions": "Purrfect Date is a cross between a Visual Novel, a Dating Sim, and a dark British comedy. You, a human, will get to date cats and uncover the dark secrets of the mysterious Cat Island."}, {"name": "MotoGP 13", "details_link": "https://www.metacritic.com/game/xbox-360/motogp-13", "publisher": "MileStone Inc.", "release_date": "Jun 21 2013", "developers": ["MileStone Inc."], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 72, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/21b5231962ecca1250b9cb0b05c61f3f-98.jpg", "descriptions": "Speed. Emotion. Innovation. The full 2013 MotoGP season. Graphical excellence. The essential elements mixed with an adrenaline-fueled experience will characterize the brand new MotoGP 13, re-invented by Milestone.  With genre-leading redesigned graphics, Milestone's new project will bringSpeed. Emotion. Innovation. The full 2013 MotoGP season. Graphical excellence. The essential elements mixed with an adrenaline-fueled experience will characterize the brand new MotoGP 13, re-invented by Milestone.  With genre-leading redesigned graphics, Milestone's new project will bring players into the 2013 championship through the eyes of a real MotoGP rider. The main game modes are: Official MotoGP will additionally offer players the opportunity to experience the 2013 Worldwide Championship, try the exclusive IRTA Test or prove their ability in a Quick Race. Career, the newly revamped career mode, will put gamers into the shoes of the riders, as it runs from first until the final race of the season. This particular game-mode will mix-in third and first person elements as well. Multiplayer will re-create exciting events - inspired by reality - to MotoGP's classic elements, that will keep fans glued to their sofa.… Expand"}, {"name": "Steep", "details_link": "https://www.metacritic.com/game/pc/steep", "publisher": "Ubisoft", "release_date": "Dec  2 2016", "developers": ["Ubisoft Annecy"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Sports", "Individual", "Ski / Snowboard"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/aae7d0abb6236fbfda60b7f45a0158f3-98.jpg", "descriptions": "In Steep, players can use the innovative trail feature to relive their most inspiring rides and trailblazing achievements, and share them on social networks with friends. Along with sharing ride replays, players can also use this feature to challenge friends to outrace them on a shared path,In Steep, players can use the innovative trail feature to relive their most inspiring rides and trailblazing achievements, and share them on social networks with friends. Along with sharing ride replays, players can also use this feature to challenge friends to outrace them on a shared path, create epic stunts or set out to discover the massive mountain playground.… Expand"}, {"name": "Onion Assault", "details_link": "https://www.metacritic.com/game/switch/onion-assault", "publisher": "Horberg Productions", "release_date": "Jan 26 2023", "developers": ["Horberg Productions"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/8eaab4357f41200ad348fca9db858f2e-98.jpg", "descriptions": "Classic old school platforming action from the creator of Gunman Clive and Mechstermination Force. Defeat the evil army by throwing onions, or lifting and throwing enemies. Old school gameplay inspired by 8-bit classics. Full 3D graphics with a unique artstyle and custom engine. 16 levelsClassic old school platforming action from the creator of Gunman Clive and Mechstermination Force. Defeat the evil army by throwing onions, or lifting and throwing enemies. Old school gameplay inspired by 8-bit classics. Full 3D graphics with a unique artstyle and custom engine. 16 levels with a huge variety of different environments, obstacles, enemies and giant bosses.… Expand"}, {"name": "Kingdoms of Amalur: Re-Reckoning", "details_link": "https://www.metacritic.com/game/switch/kingdoms-of-amalur-re-reckoning", "publisher": "THQ Nordic", "release_date": "Mar 16 2021", "developers": ["Kaiko"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/8c34d0c6ddb0141fd724b34d3291f462-98.jpg", "descriptions": "The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, spawn creator Todd mcfarlane, and Elder Scrolls IV: oblivion lead designer Ken rolston, comes kingdoms of amalur: re-reckoning. Remastered with stunning visuals and refined gameplay re-reckoning delivers intense,The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, spawn creator Todd mcfarlane, and Elder Scrolls IV: oblivion lead designer Ken rolston, comes kingdoms of amalur: re-reckoning. Remastered with stunning visuals and refined gameplay re-reckoning delivers intense, customizable RPG combat inside a sprawling game world. Uncover the secrets of amalur, from the vibrant city of rathir to the vast region of dalentarth to the grim dungeons of the brigand Hall caverns. Rescue a world torn apart by a vicious war and control the keys to immortality as the first Warrior ever to be resurrected from the grips of death. * Build the ideal character for the most intense combat, choosing from a countless combinations of skills, abilities, weapons and pieces of armor* The revolutionary destiny system allows you to continuously evolve your character class to your style of play* Seamlessly Integrate magical and melee attacks as you take on scores of enemies in grand fight sequences and finish them Off with brutal fate shift kills* Extend your experience in amalur with all DLC from the original release, from teeth of naros to Legend of Dead kel and more!* Hundreds of hours of RPG play await! Travel from the vibrant city of rathir, to the vast region of dalentarth, and the grim dungeons of the brigand Hall caverns as you uncover the secrets of amalur!… Expand"}, {"name": "Mothergunship", "details_link": "https://www.metacritic.com/game/pc/mothergunship", "publisher": "Grip Digital", "release_date": "Jul 17 2018", "developers": ["Grip Digital"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/53814a42055faf41bd6af0309c94ddae-98.jpg", "descriptions": "MOTHERGUNSHIP mixes bullet-hell intensity with the shooting, customization, and traversal of the first-person genre. Fight your way through the alien fleets, facing randomized enemy and level mayhem as you clear rooms and take out some of the biggest bosses seen in the FPS genre."}, {"name": "Burly Men At Sea", "details_link": "https://www.metacritic.com/game/switch/burly-men-at-sea", "publisher": "Brain&Brain", "release_date": "Apr 12 2018", "developers": ["Seaven Studio", "Brain&Brain"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 72, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/04a3f2c418be6e7180747bb3f79ba2a2-98.jpg", "descriptions": "One of TIMEs top five games of 2016, Burly Men at Sea is a folktale about a trio of large, bearded fishermen who step away from the ordinary to seek adventure.\r Set in the waters of early 20th-century Scandinavia, the game's story branches through a series of encounters with creatures fromOne of TIMEs top five games of 2016, Burly Men at Sea is a folktale about a trio of large, bearded fishermen who step away from the ordinary to seek adventure.\r Set in the waters of early 20th-century Scandinavia, the game's story branches through a series of encounters with creatures from folklore. You play as storyteller and wayfinder, shaping the narrative around three ungainly heroes. Play through once for a single tale, then set sail again to uncover paths to new adventures.\r Named Best Story Game of 2016 by Rock, Paper, Shotgun, and nominee for Best 2D Visuals (Unity Awards 2016), SXSW Gamers Voice Award (2016), and Best Adventure Game/RPG (Intel Level Up 2016).… Expand"}, {"name": "Semispheres", "details_link": "https://www.metacritic.com/game/switch/semispheres", "publisher": "Vivid Helix", "release_date": "Sep 14 2017", "developers": ["Vivid Helix"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/c7691a9edf79a38cfb89929b180ade48-98.jpg", "descriptions": "Semispheres is a meditative parallel puzzle game that places dual realities at the heart of its challenge. Its unique single-player split-screen mechanic challenges your brain by putting you in control of two characters at the same time. Your left and right side must work together to unfoldSemispheres is a meditative parallel puzzle game that places dual realities at the heart of its challenge. Its unique single-player split-screen mechanic challenges your brain by putting you in control of two characters at the same time. Your left and right side must work together to unfold the mystery by solving clever puzzles in an entrancing ambience. Using portals and other abilities to avoid sentries, devise and execute your plan, reuniting the parallel worlds of Semispheres. [Nintendo]… Expand"}, {"name": "Senko no Ronde 2", "details_link": "https://www.metacritic.com/game/playstation-4/senko-no-ronde-2", "publisher": "Degica", "release_date": "Sep  7 2017", "developers": ["G.Rev"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/258eef225d599f1867aa13471ae3e476-98.jpg", "descriptions": "Senko no Ronde 2 is a unique mix of fighting game and bullet hell shooter in which players pilot powerful armed robots Rounders, and do battle in futuristic arenas."}, {"name": "Assassin's Creed Rogue", "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-rogue", "publisher": "Ubisoft", "release_date": "Nov 11 2014", "developers": ["Ubisoft Sofia"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/8390bc6eea0bdaa39a18f846abb8a6a5-98.jpg", "descriptions": "Within the tumult and rage of the French and Indian War, Shay Patrick Cormac, a bold young man and part of the Assassin Brotherhood, undergoes a dark transformation that forever alters the future of the colonies. As Shay, you feel the steady transformation from Assassin to Assassin hunterWithin the tumult and rage of the French and Indian War, Shay Patrick Cormac, a bold young man and part of the Assassin Brotherhood, undergoes a dark transformation that forever alters the future of the colonies. As Shay, you feel the steady transformation from Assassin to Assassin hunter and utilize your myriad skills to avenge those you once called brothers.… Expand"}, {"name": "LocoRoco Cocoreccho!", "details_link": "https://www.metacritic.com/game/playstation-3/locoroco-cocoreccho!", "publisher": "SCEA", "release_date": "Sep 20 2007", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "num_players": "1 Player", "genres": ["Puzzle", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/1ec86ebf265be790a7fe663fd42180cd-98.jpg", "descriptions": "All new LocoRoco game exclusively for PS3! Play as a butterfly and guide the cute little LocoRoco to safety. The LocoRocos respond to the environment, interact with each other, and sing along to the music. Running at 1080p, LocoRoco Cocoreccho! brings all new gameplay, use of the SIXAXISAll new LocoRoco game exclusively for PS3! Play as a butterfly and guide the cute little LocoRoco to safety. The LocoRocos respond to the environment, interact with each other, and sing along to the music. Running at 1080p, LocoRoco Cocoreccho! brings all new gameplay, use of the SIXAXIS wireless controller technology, mini-games, and online rankings. Control the butterfly to guide the cute little LocoRoco to safety! LocoRoco will try to follow the butterfly wherever it goes. Full HD at 1080p – Fly around a richly detailed environment to wake up and rescue up to 200 LocoRoco. Use the SIXAXIS controller to rock, launch, and bounce the LocoRoco. Additional Mini-games - Discover three addicting mini-games. [Sony]… Expand"}, {"name": "Lemony Snicket's A Series of Unfortunate Events", "details_link": "https://www.metacritic.com/game/game-boy-advance/lemony-snickets-a-series-of-unfortunate-events", "publisher": "Activision", "release_date": "Nov 10 2004", "developers": ["Griptonite Games"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/d6388fd4f41f26878fb8f9b76e18d6b8-98.jpg", "descriptions": "Based on the book series and the feature film, this game tells the tale of Violet, Klaus, and Sunny Baudelaire, whose parents perish in a fire. Soon after, they are sent to live with their sinister uncle, Count Olaf, in a cavernous mansion. Now you can help the Baudelaire orphans by usingBased on the book series and the feature film, this game tells the tale of Violet, Klaus, and Sunny Baudelaire, whose parents perish in a fire. Soon after, they are sent to live with their sinister uncle, Count Olaf, in a cavernous mansion. Now you can help the Baudelaire orphans by using their special skills to journey through 15 missions, from the deep catacombs beneath Olaf's mansion to the gloomy shores of Lake Lachrymose. Collect household items and assemble them into contraptions for puzzle-solving and combat. Wield those items to battle Olaf's minions.… Expand"}, {"name": "Tales of Legendia", "details_link": "https://www.metacritic.com/game/playstation-2/tales-of-legendia", "publisher": "Namco", "release_date": "Feb  7 2006", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/95a075f4cd03e009a0724b157ff8ebf2-98.jpg", "descriptions": "Tales of Legendia is an epic tale of love and heroism that explores the ties that bind us all.  Senel Coolidge, a young expert of the special skill called “eres,” was drifting in the misty ocean on a small boat with his younger sister Shirley. As food ran out and their strength deteriorated,Tales of Legendia is an epic tale of love and heroism that explores the ties that bind us all.  Senel Coolidge, a young expert of the special skill called “eres,” was drifting in the misty ocean on a small boat with his younger sister Shirley. As food ran out and their strength deteriorated, an island suddenly burst through the mist and approached the boat with astonishing speed.  The boat was engulfed by wild waves as Senel tried to steer it.  When they woke up on the shore, they realized it was not an ordinary island, but actually the deck of the mysterious giant ship called Legacy.  Have they stumbled upon an unknown civilization, or is the Legacy a relic of something long past? The 'Tales' series has been thrilling RPG fans around the world for nearly a decade.  While it follows a traditional RPG format, the series is set apart by its slick presentation and art, real-time interactive battle system and clever level designs and puzzles. [Namco]… Expand"}, {"name": "Mercenaries 2: World in Flames", "details_link": "https://www.metacritic.com/game/xbox-360/mercenaries-2-world-in-flames", "publisher": "EA Games", "release_date": "Aug 31 2008", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/52797a774a0e67151dbb8977c3cd61f8-98.jpg", "descriptions": "Mercenaries 2: World in Flames is an explosive open-world action game set in a massive, highly reactive, war-torn world. A power-hungry tyrant messes with Venezuela's oil supply, sparking an invasion that turns the country into a warzone. But for you, international crisis is all upside: YouMercenaries 2: World in Flames is an explosive open-world action game set in a massive, highly reactive, war-torn world. A power-hungry tyrant messes with Venezuela's oil supply, sparking an invasion that turns the country into a warzone. But for you, international crisis is all upside: You are a mercenary, and you profit from chaos. Mercenaries 2 features a slew of potential clients, all willing to pay you to do their dirty work. Dirty deeds, done for exorbitant fees. These are world powers with deep pockets, deep grudges, and enough arms and ammo to start World War III. This is your kind of environment. Mercenaries 2 features the latest and most dangerous in civilian and military tech, everything from shiny new sports cars, to the future-tech satellite-guided bunker-busting mini-nuke. Tanks, APCs, boats, luxury automobiles – you name it, you can have it delivered to you in real time. And if you run out of cash you can always 'acquire' the gear you need in the field. If you see it, you can buy it, steal it, or blow the living crap out of it. Play your own way, or play with the help of a friend in the new cooperative multiplayer mode. You are not a soldier. You don't have to play by anyone's rules. You have your own code: you will fulfill the terms of the contract, no matter what. Not everyone in the world of Mercenaries is as honorable. Everyone will try and screw you, given the chance. They think they can get away with it, because they don't know rule #1: EVERYBODY PAYS. [Pandemic Studios]… Expand"}, {"name": "Underrail", "details_link": "https://www.metacritic.com/game/pc/underrail", "publisher": "Stygian Software", "release_date": "Dec  5 2012", "developers": ["Stygian Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/21d2206d54ee8a031f0c7b53bbfe5d8e-98.jpg", "descriptions": "Underrail is an old-school turn-based isometric indie role playing game that focuses on exploration and combat. The game is set in a distant future, when the life on the Earth’s surface has long since been made impossible and the remnants of humanity now dwell in the Underrail, a vast systemUnderrail is an old-school turn-based isometric indie role playing game that focuses on exploration and combat. The game is set in a distant future, when the life on the Earth’s surface has long since been made impossible and the remnants of humanity now dwell in the Underrail, a vast system of metro station-states.… Expand"}]