[{"name": "Grim Fandango Remastered", "details_link": "https://www.metacritic.com/game/pc/grim-fandango-remastered", "publisher": "Double Fine Productions", "release_date": "Jan 26 2015", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person", "Fantasy"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/d2d0185f6b1dc527fe1e5caa1361b33a-98.jpg", "descriptions": "Something is rotten in the land of the Dead, and you are being played for a sucker. Please meet Manny Calavera, travel agent at the Department of Death. He sells luxury packages to souls on their 4-year trip to eternal rest. But there is trouble in paradise. Help Manny untangle himself fromSomething is rotten in the land of the Dead, and you are being played for a sucker. Please meet Manny Calavera, travel agent at the Department of Death. He sells luxury packages to souls on their 4-year trip to eternal rest. But there is trouble in paradise. Help Manny untangle himself from a conspiracy that threatens his very salvation. [Double Fine]… Expand"}, {"name": "Age of Empires II: Definitive Edition", "details_link": "https://www.metacritic.com/game/pc/age-of-empires-ii-definitive-edition", "publisher": "Xbox Game Studios", "release_date": "Nov 14 2019", "developers": ["Ensemble Studios", "Forgotten Empires LLC"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/c4d92daaaaaa5994b6ecb97ab4ee8ff4-98.jpg", "descriptions": "Age of Empires II: Definitive Edition celebrates the 20th anniversary of one of the most popular strategy games ever with stunning 4K Ultra HD graphics, a new and fully remastered soundtrack, and brand-new content, “The Last Khans” with 3 new campaigns and 4 new civilizations."}, {"name": "Spiritfarer", "details_link": "https://www.metacritic.com/game/pc/spiritfarer", "publisher": "Thunder Lotus Games", "release_date": "Aug 18 2020", "developers": ["Thunder Lotus Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Sandbox"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/4bbba54d5255a3a87d7bdfc7f269c56a-98.jpg", "descriptions": "A cozy management game about dying.  What will you leave behind?\rPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \r\rA unique, endlessly varied adventure!A cozy management game about dying.  What will you leave behind?\rPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \r\rA unique, endlessly varied adventure!\rFarm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.\r Learn how to say goodbye.\rExperience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?… Expand"}, {"name": "Sega Ages: Fantasy Zone", "details_link": "https://www.metacritic.com/game/switch/sega-ages-fantasy-zone", "publisher": "Sega", "release_date": "Jan 23 2020", "developers": ["M2", "Rutubo Games"], "platforms": ["3DS", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/d4803b664b27528c8450949f3f65f410-98.jpg", "descriptions": "Take command of the spaceship Opa-Opa and blast your way through various fantastical levels as you try to take out all the enemy bases in each stage. Once you've destroyed the bases, you'll have to beat the stage boss in order to move on to the next level. By using your guns and bombsTake command of the spaceship Opa-Opa and blast your way through various fantastical levels as you try to take out all the enemy bases in each stage. Once you've destroyed the bases, you'll have to beat the stage boss in order to move on to the next level. By using your guns and bombs wisely, you'll be able to take down your enemies and explore each of the crazy environments in this side-scroller. You can also buy upgraded weapons for your ship by accessing the shop.… Expand"}, {"name": "Mutant Mudds Deluxe", "details_link": "https://www.metacritic.com/game/wii-u/mutant-mudds-deluxe", "publisher": "Renegade Kid", "release_date": "Jun 13 2013", "developers": ["Renegade Kid"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/a133fa44874128e10e94e3a11406eaf3-98.jpg", "descriptions": "Love pixels? Fond of platformers? Is there a special place in your heart for the 8-bit and 16-bit era? Want to have fun? Yes!? Well, youve come to the right place, my friend. Mutant Mudds Deluxe is a 12-bit action platformer full of pixels and platforming fun!\r Our hero, Max, may be just aLove pixels? Fond of platformers? Is there a special place in your heart for the 8-bit and 16-bit era? Want to have fun? Yes!? Well, youve come to the right place, my friend. Mutant Mudds Deluxe is a 12-bit action platformer full of pixels and platforming fun!\r Our hero, Max, may be just a 2D sprite, but he can leap into the third dimension by jetting between the background and the foreground playfields with his trusty jetpack in this unique dimensionally-woven experience.\r Armed with a heavy-duty water cannon, Max has what he needs to vanquish his long-term nemesi: the Mutant Mudds. Max must blast and hover his way across the soiled landscape to seek out mysterious Water Sprites. Legend says collecting all of the mysterious Water Sprites will wash the filthy Mutant Mudds away for good!… Expand"}, {"name": "Psi-Ops: The Mindgate Conspiracy", "details_link": "https://www.metacritic.com/game/playstation-2/psi-ops-the-mindgate-conspiracy", "publisher": "Midway", "release_date": "Jun 14 2004", "developers": ["Midway"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/ca794fb65fa4fff1366262b477c7822c-98.jpg", "descriptions": "Your most powerful weapon is your mind in Psi-Ops: The Mindgate Conspiracy, an action/adventure game that utilizes extensive Psi (mind) powers combined with traditional weapons combat, providing gamers with unique gameplay attributes that clearly differentiate it from any other title in theYour most powerful weapon is your mind in Psi-Ops: The Mindgate Conspiracy, an action/adventure game that utilizes extensive Psi (mind) powers combined with traditional weapons combat, providing gamers with unique gameplay attributes that clearly differentiate it from any other title in the action/adventure genre. In order to combat a Psi terrorist movement set to overthrow world order, you, as an elite American Psi-operative soldier, must fight using Telekinesis, Mind Control, Pyrokinesis, Mind Drain, Aura View and Remote Viewing to win a very serious \"mind game\" against an army of brainwashed terrorist super soldiers and powerful Psi agents. [Midway]… Expand"}, {"name": "Thimbleweed Park", "details_link": "https://www.metacritic.com/game/pc/thimbleweed-park", "publisher": "Terrible Toybox", "release_date": "Mar 30 2017", "developers": ["Ron Gilbert and Gary Winnick"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/6aa6f1212b209add5bb60e4244cb4ce1-98.jpg", "descriptions": "Thimbleweed Park is the curious story of two washed up federal agents called in to investigate a dead body found in the river just outside of town, bloated and pixelated from a death come too soon."}, {"name": "The Lord of the Rings: The Battle for Middle-Earth II", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-the-battle-for-middle-earth-ii", "publisher": "EA Games", "release_date": "Mar  2 2006", "developers": ["EA LA"], "platforms": ["Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/c3500c8b605f24f8afe9334e007b024d-98.jpg", "descriptions": "Given a new agreement with The Saul Zaentz Company d/b/a Tolkien Enterprises that grants EA the rights to develop games based on the books, in addition to a separate agreement that allows for games based on the New Line Cinema films The Lord of the Rings, The Battle for Middle-earth II willGiven a new agreement with The Saul Zaentz Company d/b/a Tolkien Enterprises that grants EA the rights to develop games based on the books, in addition to a separate agreement that allows for games based on the New Line Cinema films The Lord of the Rings, The Battle for Middle-earth II will introduce players to depths of the fiction never before explored by EA. With all new content from J.R.R. Tolkien's original fiction, delve deeper than ever before and engage in new battles that go beyond the award-winning movie trilogy. Wage war in the North and assume command of the most storied civilizations in all of Middle-earth history -- the Elven and Dwarven armies -- or fight on the side of Evil with heroes and creatures that have never been seen in The Lord of the Rings films. Defend or overtake never before seen lands such as Dol Guldur, The Misty Mountains, and Mirkwood as you unleash powerful new weapons and abilities - summon dragons, cause volcanoes to erupt, or bring down a cataclysmic lightning strike. But beware, with greater power comes greater adversity. Your enemies, commanded by a powerful new AI system, possess a greater tactical edge and more powerful spells. Will your armies have the fortitude to persevere? [Electronic Arts]… Expand"}, {"name": "F1 2019", "details_link": "https://www.metacritic.com/game/playstation-4/f1-2019", "publisher": "Codemasters", "release_date": "Jun 25 2019", "developers": ["Codemasters"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/21bc0dfc2ef21726b282c832e9523bfc-98.jpg", "descriptions": "The official videogame of the 2019 FIA Formula One World Championship, F1 2019 challenges you to Defeat your Rivals in the most ambitious F1 game in Codemasters' history. The game is released a full two months earlier during the Formula 1 myWorld Grosser Preis von Osterreich 2019 weekendThe official videogame of the 2019 FIA Formula One World Championship, F1 2019 challenges you to Defeat your Rivals in the most ambitious F1 game in Codemasters' history. The game is released a full two months earlier during the Formula 1 myWorld Grosser Preis von Osterreich 2019 weekend and, unlike previous iterations, ahead of the British, German and Hungarian races.\r F1 2019 features all the official teams, drivers and all 21 circuits from the 2019 season. This year sees the inclusion of F2 with players being able to complete the 2018 season with the likes of George Russell, Lando Norris and Alexander Albon. The 2019 F2 season content will be made available as a free digital update during the season.\r Having established itself as one of the highest rated racing franchises of all time, F1 2019 builds on the success of previous iterations and delivers an experience that rivals the quality and production values of its real-life race counterpart. With greater emphasis on graphical fidelity, the environments have been significantly enhanced, and the tracks come to life like never before. Night races have been completely overhauled creating vastly improved levels of realism and the upgraded F1 broadcast sound and visuals add further realism to all aspects of the race weekend.… Expand"}, {"name": "Assault Android Cactus", "details_link": "https://www.metacritic.com/game/xbox-one/assault-android-cactus", "publisher": "Witch Beam", "release_date": "Nov  7 2017", "developers": ["Witch Beam"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 84, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/15db4d8e857a64808db7954555f25f74-98.jpg", "descriptions": "Assault Android Cactus is an intense arcade style twin stick shooter - pick from one of nine unique synthetic heroines and blast your way through overwhelming robots hordes to save the ship from its own workforce. Supports single player and local co-op game modes."}, {"name": "Tom Clancy's Splinter Cell Double Agent", "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-splinter-cell-double-agent", "publisher": "Ubisoft", "release_date": "Oct 24 2006", "developers": ["Ubisoft Montreal"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Action Adventure", "Modern"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/348ed6fd550f0264e40d4293ee3dddf5-98.jpg", "descriptions": "Veteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life asVeteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life as a double agent. As you infiltrate a terrorist organization in its American headquarters, you must carefully weigh the consequences of your actions. Kill too many criminals and you'll blow your cover. Hesitate too long and millions will die. Do whatever it takes to complete your mission, but get out alive. Dual objectives to fulfill: NSA government agents and terrorists will each want you to accomplish opposing tasks at the same time. Discover the tension of being a double agent: Use actual tactics employed by today’s real-life double agents to sabotage the terrorists' plans. Explore a branching storyline with multiple endings: Your choices have an impact on how the story and game play unfolds. Missions from all over the world, from Asia to Africa to the heart of the US. Experience extreme situations: underwater or in a sandstorm, hiding behind the dust or smoke – and even skydiving. Master the latest weapons and gadgets used by NSA government agents in addition to black-market terrorist weapons. [Ubisoft]… Expand"}, {"name": "Hitman 2", "details_link": "https://www.metacritic.com/game/xbox-one/hitman-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  9 2018", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/f46511d3ec9441b0e394211aea909b47-98.jpg", "descriptions": "Travel the globe and track your targets across exotic sandbox locations in Hitman 2. From sun-drenched streets to dark and dangerous rainforests, nowhere is safe from the world's most deadly assassin, Agent 47. Prepare to experience the ultimate spy thriller story -- your mission is toTravel the globe and track your targets across exotic sandbox locations in Hitman 2. From sun-drenched streets to dark and dangerous rainforests, nowhere is safe from the world's most deadly assassin, Agent 47. Prepare to experience the ultimate spy thriller story -- your mission is to eliminate the elusive Shadow Client and unravel his militia, but upon learning your target's true identity and the truth about 47's past, nothing will ever be the same.… Expand"}, {"name": "Life is Strange: True Colors", "details_link": "https://www.metacritic.com/game/xbox-series-x/life-is-strange-true-colors", "publisher": "Square Enix", "release_date": "Sep 10 2021", "developers": ["Deck Nine Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/790f7eb8f53d5df814afce967f919564-98.jpg", "descriptions": "A bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!\r Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees asA bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!\r Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees as blazing, colored auras.\r When her brother dies in a so-called accident, Alex must embrace her volatile power to find the truth and uncover the dark secrets buried by a small town.… Expand"}, {"name": "Def Jam: Fight for NY", "details_link": "https://www.metacritic.com/game/xbox/def-jam-fight-for-ny", "publisher": "EA Games", "release_date": "Sep 20 2004", "developers": ["Aki Corp."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 84, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/fcc4f4d596b3b735b874f93d803e9b0a-98.jpg", "descriptions": "Def Jam Fight for NY takes the battle for hip-hop domination into the fighting ring. More than 35 hip-hop artists and personalities--including Busta Rhymes, Carmen Electra, Lil' Kim, Ludacris, Method Man, Redman, Sean Paul, Slick Rick, and Snoop Dogg--face off in brutal wrestling matches. InDef Jam Fight for NY takes the battle for hip-hop domination into the fighting ring. More than 35 hip-hop artists and personalities--including Busta Rhymes, Carmen Electra, Lil' Kim, Ludacris, Method Man, Redman, Sean Paul, Slick Rick, and Snoop Dogg--face off in brutal wrestling matches. In the ring and on the streets, you'll join the battle as a New York City street fighter. The game challenges you to develop your own fighting style and seize control of the hip-hop underworld. … Expand"}, {"name": "Classic NES Series: The Legend of Zelda", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-the-legend-of-zelda", "publisher": "Nintendo", "release_date": "Jun  2 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/618dfb50efca36b74a66e15d0c405dce-98.jpg", "descriptions": "In this classic NES game, you'll embark on a quest to find the Triforce, slay Ganon, and save Princess Zelda. The Legend of Zelda comes to the Game Boy Advance, complete with all the dungeons, puzzles, and menacing enemies from the original game. As Link, you can brandish a variety ofIn this classic NES game, you'll embark on a quest to find the Triforce, slay Ganon, and save Princess Zelda. The Legend of Zelda comes to the Game Boy Advance, complete with all the dungeons, puzzles, and menacing enemies from the original game. As Link, you can brandish a variety of weapons, including swords, boomerangs, bombs, and arrows. Collect rupees to buy even more weapons and other special items. There are many secrets, hidden passages, and caves to be found in Hyrule--now you can see if you still have what it takes to find them. … Expand"}, {"name": "Battlefield Vietnam", "details_link": "https://www.metacritic.com/game/pc/battlefield-vietnam", "publisher": "EA Games", "release_date": "Mar 14 2004", "developers": ["Digital Illusions"], "platforms": "PC", "num_players": "1-64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/4a73ce58cc4653ce53a08819cecb2059-98.jpg", "descriptions": "The Battlefield franchise enters a new era equipped with more firepower, modernized weaponry and vehicles, and a deeper infantry experience from the jungles to the beaches of Vietnam. From villages on the Ho Chi Minh Trail to the city streets of Hue, wage modern warfare as the United StatesThe Battlefield franchise enters a new era equipped with more firepower, modernized weaponry and vehicles, and a deeper infantry experience from the jungles to the beaches of Vietnam. From villages on the Ho Chi Minh Trail to the city streets of Hue, wage modern warfare as the United States or North Vietnamese Army (NVA). Select from a variety of characters within the different soldier classes as you command powerful new vehicles including the UH-1 Huey helicopter, the M551 Sheridan tank, and the F-4 Phantom fighter jet on the U.S. side and the Russian-made T-54 tank, the MIG-21, and Mi-8 multipurpose helicopter on the NVA side. Go to war in new dramatic battle scenarios including leading a squadron of Huey helicopters in an all-out attack on an enemy compound, executing an ambush of enemy soldiers from dense foliage, captaining a PT boat through a dangerous jungle river passage, and more. Grab your M-16, ready the Napalm and prepare to enter some of the fiercest battles of the Vietnam War. [Electronic Arts]… Expand"}, {"name": "Medieval: Total War - Viking Invasion", "details_link": "https://www.metacritic.com/game/pc/medieval-total-war---viking-invasion", "publisher": "Activision", "release_date": "May  7 2003", "developers": ["Creative Assembly"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/410bcf9bd78998a73ac06049fccd499d-98.jpg", "descriptions": "Medieval: Total War - Viking Invasion challenges players to control eight new factions, including the Vikings themselves, the Saxons, Scots, Irish, Welsh and Picts, and embark on a campaign to dominate the British Isles. With a wealth of new historical heroes, players can lead a range of newMedieval: Total War - Viking Invasion challenges players to control eight new factions, including the Vikings themselves, the Saxons, Scots, Irish, Welsh and Picts, and embark on a campaign to dominate the British Isles. With a wealth of new historical heroes, players can lead a range of new units into battle, including Viking Berserkers, Saxon Huscarles and Fyrdmen, while conducting sieges enhanced by the introduction of flaming arrows and boiling oil. Viking Invasion introduces new features that will be welcomed by fans of the franchise Players can now plan reinforcements and scout enemy formations before taking to the field from a new pre-battle screen. In addition, there will be new playable factions and a new heavy weapon in the shape of the fearsome Organ Gun. [Activision]… Expand"}, {"name": "NBA 2K3", "details_link": "https://www.metacritic.com/game/gamecube/nba-2k3", "publisher": "Sega", "release_date": "Oct  7 2002", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 84, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/0895e6ab3078c1c26fdcbc043ef5b713-98.jpg", "descriptions": "Without question, NBA 2K3 is one of the most accurate representations of professional basketball to date."}, {"name": "Dance Dance Revolution Konamix", "details_link": "https://www.metacritic.com/game/playstation/dance-dance-revolution-konamix", "publisher": "Konami", "release_date": "Apr 25 2002", "developers": ["Konami"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 84, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/f3df113fe0b7e8e6044a9223b94ad245-98.jpg", "descriptions": "The hottest dancing craze continues with a brand new sequel to Dance Dance Revolution. Straight from the arcades, step into the spotlight and put your skills to the test as you move to the groove. Get ready to dance the night away with all-new songs and game modes. Let the pulsating musicThe hottest dancing craze continues with a brand new sequel to Dance Dance Revolution. Straight from the arcades, step into the spotlight and put your skills to the test as you move to the groove. Get ready to dance the night away with all-new songs and game modes. Let the pulsating music and colorful graphics excite your senses while you get your dancin' fix with Dance Dance Revolution KONAMIX.… Expand"}, {"name": "Street Fighter III: 3rd Strike", "details_link": "https://www.metacritic.com/game/dreamcast/street-fighter-iii-3rd-strike", "publisher": "Capcom", "release_date": "Oct  4 2000", "developers": ["Capcom"], "platforms": "Dreamcast", "genres": ["Action", "Fighting", "2D"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/00f951be64323a74e0bf1371d6e78d79-98.jpg", "descriptions": "This amazing fighter stars 18 brawlers from the STREET FIGHTER III universe and introduces the new Leap Attack. Plus, a new Grade Judge system evaluates player performance at the end of each match. Huge characters and an innovative Hit-Frame system team up with the return of the Super ArtsThis amazing fighter stars 18 brawlers from the STREET FIGHTER III universe and introduces the new Leap Attack. Plus, a new Grade Judge system evaluates player performance at the end of each match. Huge characters and an innovative Hit-Frame system team up with the return of the Super Arts Fighting Styles. Experience totally seamless animation in the newest chapter of the greatest arcade series ever!… Expand"}, {"name": "Fallout 4", "details_link": "https://www.metacritic.com/game/pc/fallout-4", "publisher": "Bethesda Softworks", "release_date": "Nov  9 2015", "developers": ["Bethesda Game Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Western-Style"], "meta_score": 84, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/499c55b11335a42386dc33fcaefd0ea7-98.jpg", "descriptions": "As the sole survivor of Vault 111, you enter a world destroyed by nuclear war. Every second is a fight for survival, and every choice is yours. Only you can rebuild and determine the fate of the Wasteland. Welcome home."}, {"name": "Tom Clancy's Ghost Recon 2 Summit Strike", "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-ghost-recon-2-summit-strike", "publisher": "Ubisoft", "release_date": "Aug  2 2005", "developers": ["Red Storm Entertainment"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 84, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/68c6889cb6c43c4aac2e5e34308d671a-98.jpg", "descriptions": "This expansion pack enhances the gameplay of Tom Clancy's Ghost Recon 2 and offers you more maps, missions, and weapons. It also brings an exciting new 11-mission single-player campaign and expanded multiplayer content.\rFollow the Ghosts as they work in concert with a Kazakh militaryThis expansion pack enhances the gameplay of Tom Clancy's Ghost Recon 2 and offers you more maps, missions, and weapons. It also brings an exciting new 11-mission single-player campaign and expanded multiplayer content.\rFollow the Ghosts as they work in concert with a Kazakh military specialist to track down an evil Pakistani warlord and arms dealer!… Expand"}, {"name": "Baba Is You", "details_link": "https://www.metacritic.com/game/switch/baba-is-you", "publisher": "Hempuli Oy", "release_date": "Mar 13 2019", "developers": ["Hempuli Oy", "MP2 Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Puzzle", "Action", "General"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/8f4959db525d2baa6a345a166134b9e1-98.jpg", "descriptions": "Baba Is You is a puzzle game in which the rules of the game can be changed during gameplay, leading to surprising and unique interactions. In this tricky puzzler, you don't just make the rules – you are the rules!"}, {"name": "Guild Wars Nightfall", "details_link": "https://www.metacritic.com/game/pc/guild-wars-nightfall", "publisher": "NCSOFT", "release_date": "Oct 26 2006", "developers": ["ArenaNet"], "platforms": "PC", "num_players": "64+  Online", "genres": ["Role-Playing", "Miscellaneous", "General", "General", "Compilation", "Massively Multiplayer"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/f68f13763a606984710391cde65228b8-98.jpg", "descriptions": "Guild Wars Nightfall continues the tradition of inviting players to immerse themselves in an epic storyline centered in a vibrant fantasy setting, build personalized characters, compete in head-to-head battles with players from around the world, and find adventure in missions and quests, inGuild Wars Nightfall continues the tradition of inviting players to immerse themselves in an epic storyline centered in a vibrant fantasy setting, build personalized characters, compete in head-to-head battles with players from around the world, and find adventure in missions and quests, in a Guild Wars game unlike any players have seen before. Two new professions are introduced in the game; the Dervish, a scythe-wielding holy warrior, and the Paragon, guardian angel of the Elonian people. [NCSoft]… Expand"}, {"name": "Lara Croft GO", "details_link": "https://www.metacritic.com/game/playstation-4/lara-croft-go", "publisher": "Square Enix", "release_date": "Dec  3 2016", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 84, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/92542ac8389b5fcb300b473d6daf0d8d-98.jpg", "descriptions": "Lara Croft GO is a turn based puzzle-adventure set in a long-forgotten world. Explore the ruins of an ancient civilization, discover well-kept secrets and face deadly challenges as you uncover the myth of the Queen of Venom."}, {"name": "Lil Gator Game", "details_link": "https://www.metacritic.com/game/switch/lil-gator-game", "publisher": "Playtonic Friends", "release_date": "Dec 14 2022", "developers": ["Scott Slucher"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Third-Person", "3D", "Action Adventure", "Open-World"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/d27703b1e857b90b2500d1b9ed443eb7-98.jpg", "descriptions": "There's a buddy atop every hill in this open-world, movement-focused adventure and they all seem to need help! Bop cardboard baddies, brave serene hills and forests, and scale sheer rocks that only a kid would dare! Explore a lovingly crafted island full to the brim with areas to discover,There's a buddy atop every hill in this open-world, movement-focused adventure and they all seem to need help! Bop cardboard baddies, brave serene hills and forests, and scale sheer rocks that only a kid would dare! Explore a lovingly crafted island full to the brim with areas to discover, friends to make and joy to be had. Each area of the island brings unique quests and characters to meet.\r Glide through the mountain tops and drop in on the Theatre Troupe kids, swing your stick sword through the forest with the Prep schoolers or find the 'Cool Kids' down in the Creaklands. With plenty more areas to discover, there's no knowing who you might run into!… Expand"}, {"name": "Sayonara Wild Hearts", "details_link": "https://www.metacritic.com/game/switch/sayonara-wild-hearts", "publisher": "Annapurna Interactive", "release_date": "Sep 19 2019", "developers": ["Simogo"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/d8f37a6d3f59bf30dc039c53bbe7bf75-98.jpg", "descriptions": "Sayonara Wild Hearts is a dreamy arcade game about riding motorcycles, skateboarding, dance battling, shooting lasers, wielding swords, and breaking hearts at 200 mph. As the heart of a young woman breaks, the balance of the universe is disturbed. A diamond butterfly appears in her dreamsSayonara Wild Hearts is a dreamy arcade game about riding motorcycles, skateboarding, dance battling, shooting lasers, wielding swords, and breaking hearts at 200 mph. As the heart of a young woman breaks, the balance of the universe is disturbed. A diamond butterfly appears in her dreams and leads her through a highway in the sky, where she finds her other self: the masked biker called The Fool. Journey through a custom-written pop soundtrack, chase scores, and set out to find the harmony of the universe, hidden away in the hearts of Little Death and her star-crossed allies: Dancing Devils, Howling Moons, Stereo Lovers and Hermit 64.… Expand"}, {"name": "Loop Hero", "details_link": "https://www.metacritic.com/game/switch/loop-hero", "publisher": "Devolver Digital", "release_date": "Dec  9 2021", "developers": ["Four Quarters"], "platforms": ["PC", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Role-Playing", "General"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/8c0ef53c6769b49a6cddf98154ce9124-98.jpg", "descriptions": "The Lich has thrown the world into a timeless loop and plunged its inhabitants into never ending chaos. Wield an expanding deck of mystical cards to place enemies, buildings, and terrain along each unique expedition loop for the brave hero. Recover and equip powerful loot for each class ofThe Lich has thrown the world into a timeless loop and plunged its inhabitants into never ending chaos. Wield an expanding deck of mystical cards to place enemies, buildings, and terrain along each unique expedition loop for the brave hero. Recover and equip powerful loot for each class of hero for their battles and expand the survivors' camp to reinforce each adventure through the loop. Unlock new classes, new cards, and devious guardians on your quest to shatter the endless cycle of despair.… Expand"}, {"name": "Disgaea 2: Cursed Memories", "details_link": "https://www.metacritic.com/game/playstation-2/disgaea-2-cursed-memories", "publisher": "NIS America", "release_date": "Aug 29 2006", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 84, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/60ee66bd73d28ee495ad78a821856c4c-98.jpg", "descriptions": "Darkness is back. Overlord Zenon has cursed the land, and now, Veldime is transforming into a nasty Netherworld. Memories are sterlized, bodies demonized, the world is falling into chaos. The only one unaffected is a young man, Adell. He stands up to fight the curse, but things never go asDarkness is back. Overlord Zenon has cursed the land, and now, Veldime is transforming into a nasty Netherworld. Memories are sterlized, bodies demonized, the world is falling into chaos. The only one unaffected is a young man, Adell. He stands up to fight the curse, but things never go as planned. The haughty daughter of Zenon, a filthy little frog, lovable demon siblings and a washed-up rock star!? No one can ever predict what goes on in the world of Disgaea. And of course, other Overlords refuse to sit still watching. [NIS America]… Expand"}, {"name": "Oddworld: Abe's Oddysee - New 'n' Tasty", "details_link": "https://www.metacritic.com/game/playstation-4/oddworld-abes-oddysee---new-n-tasty", "publisher": "Oddworld Inhabitants", "release_date": "Jul 22 2014", "developers": ["Just Add Water"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/d5cfbb871b16d56f7fa27f8dc3a57570-98.jpg", "descriptions": "Rescue your fellow meat factory slaves in this nostalgic, classic platformer with the latest immersive graphics and design. Find your destiny. Once a happy floor waxer in Oddworld's biggest meat processing plant, Abe stumbled across his boss's secret plan to turn the factory's slave labourRescue your fellow meat factory slaves in this nostalgic, classic platformer with the latest immersive graphics and design. Find your destiny. Once a happy floor waxer in Oddworld's biggest meat processing plant, Abe stumbled across his boss's secret plan to turn the factory's slave labour force into the latest in the RuptureFarms Tasty Treats line of novelty meat snacks. Abe now has to save his own skin from the grinders even if simply escaping the flesh farm is only the start of his Oddysee. Trigger-happy hunting parties, carnivorous sacred beasts, ancient temple traps and even a return to his former workplace await Abe on his journey to discover his people's heritage.… Expand"}, {"name": "NeverAwake", "details_link": "https://www.metacritic.com/game/pc/neverawake", "publisher": "Neotro Inc.", "release_date": "Sep 28 2022", "developers": ["Neotro Inc."], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 84, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/282049ac4e94289ce24511079d1be5ff-98.jpg", "descriptions": "A girl who never wakes up. She has been fighting monsters in her dreams...\"NeverAwake\" is a nightmarish twin-stick shooter with a unique worldview and original game rules. The girl fights against vegetables, dogs, school friends, and other things she hates. What does the girl see at theA girl who never wakes up. She has been fighting monsters in her dreams...\"NeverAwake\" is a nightmarish twin-stick shooter with a unique worldview and original game rules. The girl fights against vegetables, dogs, school friends, and other things she hates. What does the girl see at the end of the battle? And will she be able to wake up?With over 80 levels, dozens of bosses, and a unique gameplay system that allows players to retry many levels, NeverAwake is suitable for both beginner shooters and experts.… Expand"}, {"name": "Patrick's Parabox", "details_link": "https://www.metacritic.com/game/pc/patricks-parabox", "publisher": "Patrick Traynor", "release_date": "Mar 29 2022", "developers": ["Patrick Traynor"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/58b44554f47a079f9b2609a814a92623-98.jpg", "descriptions": "A mind-bending recursive puzzle game about boxes within boxes within boxes within boxes. Learn to use infinity to your advantage as you explore a deep and elegant system."}, {"name": "Madden NFL 16", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-16", "publisher": "EA Sports", "release_date": "Aug 25 2015", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 84, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/0a3135060c57ad9fd86a0ee38406ef4e-98.jpg", "descriptions": "Whether playing alone or online, your mission to build an NFL dynasty begins with Connected Franchise. Interact and build your team with more control with Game Prep. Want to develop your backup QB? Between matchups, spend extra time on him each week to earn training points without having toWhether playing alone or online, your mission to build an NFL dynasty begins with Connected Franchise. Interact and build your team with more control with Game Prep. Want to develop your backup QB? Between matchups, spend extra time on him each week to earn training points without having to force him into the real games before he is ready. Build your teams' confidence through performance and front office transactions. Balance keeping player's confidence up, to increase abilities and build player XP. … Expand"}, {"name": "Minecraft: PlayStation Vita Edition", "details_link": "https://www.metacritic.com/game/playstation-vita/minecraft-playstation-vita-edition", "publisher": "SCEA", "release_date": "Oct 14 2014", "developers": ["4J Studios", "Mojang AB"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Adventure", "3D", "Sandbox", "First-Person", "Fantasy", "Fantasy"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/6ce8c8b234dd6d354e27822432e80743-98.jpg", "descriptions": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes."}, {"name": "Bit.Trip Presents...Runner2: Future Legend of Rhythm Alien", "details_link": "https://www.metacritic.com/game/wii-u/bittrip-presentsrunner2-future-legend-of-rhythm-alien", "publisher": "Gaijin Games", "release_date": "Feb 26 2013", "developers": ["Gaijin Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/6643b10604bb714b4a4fed5f1d912588-98.jpg", "descriptions": "Runner 2 - Future Legend of Rhythm Alien is inspired by the Bit.Trip series originally released on Nintendo platforms."}, {"name": "The Binding of Isaac", "details_link": "https://www.metacritic.com/game/pc/the-binding-of-isaac", "publisher": "Edmund McMillen", "release_date": "Sep 28 2011", "developers": ["Edmund McMillen", "Florian Himsl"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Horror", "Horror", "Shooter", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/5dd01c70a889fd81d7be92e6fb844c52-98.jpg", "descriptions": "Isaac is a roguelike shooter based on the dungeon structure of Zelda (nes). At its core it controls like Smash TV / Robotron in a randomly generated semi RPG world filled with powerups items and special abilities."}, {"name": "Enemy Territory: Quake Wars", "details_link": "https://www.metacritic.com/game/pc/enemy-territory-quake-wars", "publisher": "Activision", "release_date": "Oct  2 2007", "developers": ["Splash Damage"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/f3cf767a27158eecf4160eb1c48a4b30-98.jpg", "descriptions": "Enemy Territory: Quake Wars pits the armies of Earth against the invading alien Strogg in the ultimate online strategic shooter.  Featuring strategic team play, persistent character promotions, day and nighttime combat missions, and the universe's most powerful weapons and vehicles, the gameEnemy Territory: Quake Wars pits the armies of Earth against the invading alien Strogg in the ultimate online strategic shooter.  Featuring strategic team play, persistent character promotions, day and nighttime combat missions, and the universe's most powerful weapons and vehicles, the game transports players to the front lines of an epic new war for Earth. As the invasion begins, players choose to battle as one of five unique classes in either the EDF (Earth Defense Force - humans) or the barbaric alien Strogg armies, each augmented with specialist weapons and combat hardware.  Troops utilize over 40 conventional and futuristic vehicles, deployable structures, and defense systems like quad-bikes, tanks, and alien walkers for epic ground assaults; or helicopters and anti-gravity ships to lend firepower from the air.   Throughout each battle, teams establish bases, deploy defense structures, artillery, radar, and advanced forward-command systems into enemy territory while constructing and demolishing obstacles to speed progress and gain a tactical advantage over the enemy. Players can take on class specific missions or join a fireteam to utilize advanced command and communication options, including voice-chat and the game's context sensitive mission order system.  With bitterly contested multi-battle campaigns, each soldier fights not only for victory, but to gain valuable skills, special rewards for team-play, and persistent military promotions and medals. [id Software]… Expand"}, {"name": "Warhawk", "details_link": "https://www.metacritic.com/game/playstation-3/warhawk", "publisher": "SCEA", "release_date": "Aug 28 2007", "developers": ["Incognito Inc."], "platforms": "PlayStation 3", "num_players": "1-4 ", "genres": ["Action", "Simulation", "Shooter", "Flight", "Shooter", "Third-Person", "Combat", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/bc0a2ecb878ee339bbfa7ec28a605a36-98.jpg", "descriptions": "[Dowloadable Game]  In Warhawk, players experience the thrill of white-knuckle aerial combat with hundreds of enemy fighters, bone-crunching armored assaults and high-intensity infantry combat in a massive, all-out war fought both on the ground and in the skies. During gameplay, players are[Dowloadable Game]  In Warhawk, players experience the thrill of white-knuckle aerial combat with hundreds of enemy fighters, bone-crunching armored assaults and high-intensity infantry combat in a massive, all-out war fought both on the ground and in the skies. During gameplay, players are tasked with protecting their homeland from the invading Chernovan armada. By doing so, players take command of the most advanced war machine in the fleet, the Warhawk, capable of aerobatic dogfights at high speeds or hovering over ground troops providing tactical support. Players continue the battle on foot with an arsenal of weaponry including pistols, rifles, grenades and more. Furthermore, players can gain access to an array of ground vehicles and lay waste with powerful weapons mounted on jeeps, tanks and specialty transports. Fight on Foot, in Ground Vehicles, or in the Sky – Next-gen multimodal design throws players into a deep gameplay experience. Fight in the war as a foot soldier, vehicle driver or ace pilot - whenever you want. Experience an Expansive Online Community – Players can join in epic multi-modal 32-person online battles, constantly evolving with downloadable content and a variety of online game modes. [SCEA]… Expand"}, {"name": "Valkyrie Profile 2: Silmeria", "details_link": "https://www.metacritic.com/game/playstation-2/valkyrie-profile-2-silmeria", "publisher": "Square Enix", "release_date": "Sep 26 2006", "developers": ["Tri-Ace"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 84, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/6/973587d4ce74e13785454e59fc56ee0e-98.jpg", "descriptions": "Hundreds of years before Lenneth's tale, another saga lies concealed by the gods. The valkyrie Silmeria once served Odin loyally, but after an incident ignited a conflict between them, Odin forcefully reincarnated her as a human. The human soul that would carry her spirit was that of Alicia,Hundreds of years before Lenneth's tale, another saga lies concealed by the gods. The valkyrie Silmeria once served Odin loyally, but after an incident ignited a conflict between them, Odin forcefully reincarnated her as a human. The human soul that would carry her spirit was that of Alicia, Princess of Dipan. Ordinarily, Silmeria’s consciousness would have been sealed, her spirit dormant until she was next summoned... However, the forced transmigration causes Silmeria's spirit to awaken within Alicia, leaving two souls to inhabit a single body. The spirit that should have been sealed has awakened—a situation Odin will not ignore for long. This installment introduces the new Photon Action System to the classic side-scrolling action format found in the original. Projecting photons grants players more freedom to explore and expands the action, resulting in challenging puzzles with clever solutions. Add to that \"sealstones\" that affect the laws of nature in dungeons, launching strategy to new heights. The unique battle system of the previous game has evolved into the Advanced Tactical Combination Battle System. [Square Enix]… Expand"}, {"name": "FIFA 14", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-14", "publisher": "EA Sports", "release_date": "Sep 24 2013", "developers": ["EA Canada"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "Xbox 360"], "num_players": "Up to 22 ", "genres": ["Ice Hockey", "Sim", "Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 84, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/05f105fa18eec8987effea9b7ffa121a-98.jpg", "descriptions": "Pure Shot promises to let FIFA fans feel what it is like to connect with the perfect strike while a brand new ball physics system called Real Ball Physics ensures the trajectory of the ball behaves as it would in real life. With Teammate Intelligence in FIFA 14, players have betterPure Shot promises to let FIFA fans feel what it is like to connect with the perfect strike while a brand new ball physics system called Real Ball Physics ensures the trajectory of the ball behaves as it would in real life. With Teammate Intelligence in FIFA 14, players have better decision-making and teams play smarter on both the attack and defense to bring the beauty of the game to life. … Expand"}, {"name": "New Super Mario Bros. U", "details_link": "https://www.metacritic.com/game/wii-u/new-super-mario-bros-u", "publisher": "Nintendo", "release_date": "Nov 18 2012", "developers": ["Nintendo"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/a9cfd00c4954278eb0f6b29acc914a7d-98.jpg", "descriptions": "It was just another dinner at the castle with Mario, Luigi, Toad, and Princess Peach... Until suddenly the vicious Koopa fleet invades Mushroom kingdom airspace and launches a full-scale assault! With Bowser at the helm and his Koopalings each in their own custom airships, the castle isIt was just another dinner at the castle with Mario, Luigi, Toad, and Princess Peach... Until suddenly the vicious Koopa fleet invades Mushroom kingdom airspace and launches a full-scale assault! With Bowser at the helm and his Koopalings each in their own custom airships, the castle is under attack with the Princess trapped inside—and the heroes have been cast out to the four corners of the Mushroom Kingdom. Will they make it back in time to save the day? … Expand"}, {"name": "MLB 08: The Show", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-08-the-show", "publisher": "SCEA", "release_date": "Mar  4 2008", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/1c2fd69ea06aab0c416bc992c1ed3eb2-98.jpg", "descriptions": "MLB 08 The Show promises to provide fans with the most realistic baseball experience to date with innovations such as a more immersive Road to The Show mode, enabling gamers to play both offense and defense from the created player’s perspective. Providing players with some additionalMLB 08 The Show promises to provide fans with the most realistic baseball experience to date with innovations such as a more immersive Road to The Show mode, enabling gamers to play both offense and defense from the created player’s perspective. Providing players with some additional performance incentives, the MLB franchise introduces the new Progressive Batting Performance feature, which both rewards players for superior performance and penalize them for hitting slumps. Specific to each individual batter, players are rewarded with slight contact bonuses, or punished with slight decreases in contact, based on how that batter that performs beyond his \"natural ability\" while under user control. Adding to the online feature set, which includes customizable Online League Play with up to 30 teams, scrolling MLB Score Ticker and more, MLB 08 The Show introduces SCOUT (SportsConnect Online User Tracking), which allows gamers to set and store their game preferences on the MLB server, and enables the system to look for a Quick Match with opponents that fits similar competitive criteria. [SCEA]… Expand"}, {"name": "The Lord of the Rings: The Return of the King", "details_link": "https://www.metacritic.com/game/xbox/the-lord-of-the-rings-the-return-of-the-king", "publisher": "EA Games", "release_date": "Nov  5 2003", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/d967e3f81c7d1accd676b20a2d31cf0e-98.jpg", "descriptions": "Return to Middle-earth in a game based on the epic final chapter of the The Lord of the Rings movie trilogy.  Developed using the same digital assets as the films, The Return of the King recreates in stunning detail the final events of the War of the Ring.  Become the heroes who determineReturn to Middle-earth in a game based on the epic final chapter of the The Lord of the Rings movie trilogy.  Developed using the same digital assets as the films, The Return of the King recreates in stunning detail the final events of the War of the Ring.  Become the heroes who determine the fate of Middle-earth as you traverse the haunted Paths of the Dead, defend Minas Tirith, and even play co-op multiplayer with a friend as you march against the impenetrable Black Gates of Mordor.  The fate of Middle-earth is in your hands.… Expand"}, {"name": "Ultra Street Fighter IV", "details_link": "https://www.metacritic.com/game/xbox-360/ultra-street-fighter-iv", "publisher": "Capcom", "release_date": "Jun  3 2014", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360"], "num_players": "", "genres": ["Fighting", "3D", "Action", "Fighting", "2D", "3D"], "meta_score": 84, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/d164a1f553a07f7e31525edb9f12af25-98.jpg", "descriptions": "The series evolves to a whole new level with Ultra Street Fighter IV for PlayStation 3, Xbox 360, and PC. Continuing the tradition of excellence the series is known for, five new characters and six new stages have been added for even more fighting mayhem, with rebalanced gameplay andThe series evolves to a whole new level with Ultra Street Fighter IV for PlayStation 3, Xbox 360, and PC. Continuing the tradition of excellence the series is known for, five new characters and six new stages have been added for even more fighting mayhem, with rebalanced gameplay and original modes topping off this offering.… Expand"}, {"name": "FIFA 17", "details_link": "https://www.metacritic.com/game/pc/fifa-17", "publisher": "Electronic Arts", "release_date": "Sep 27 2016", "developers": ["EA Sports", "EA Vancouver"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 84, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/bd0c5ed1a3f57fb0cb0bcd6ac92a935a-98.jpg", "descriptions": "Powered by Frostbite. Introducing FIFA 17 the journey, for the first time ever in FIFA, live your story on and off the pitch as the premier league's next rising star, Alex Hunter."}, {"name": "Trine 2", "details_link": "https://www.metacritic.com/game/pc/trine-2", "publisher": "Frozenbyte, Inc.", "release_date": "Dec  7 2011", "developers": ["Frozenbyte", "Inc."], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/8e2a9348490f800f0cdb9afdb551322a-98.jpg", "descriptions": "Trine 2 is the sequel to the 2009 downloadable PlayStation 3 and PC action platformer."}, {"name": "Spiritfarer", "details_link": "https://www.metacritic.com/game/switch/spiritfarer", "publisher": "Thunder Lotus Games", "release_date": "Aug 18 2020", "developers": ["Thunder Lotus Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/66bc0468c4b153d1b32f688cd37be9da-98.jpg", "descriptions": "A cozy management game about dying. What will you leave behind?\nPlay as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. \n\nA unique, endlessly varied adventure!\nFarm,A cozy management game about dying. What will you leave behind?Play as Stella, ferrymaster to the deceased, a Spiritfarer. Build a boat to explore the world, then befriend and care for spirits before finally releasing them into the afterlife. A unique, endlessly varied adventure!Farm, mine, fish, harvest, cook, and craft your way across mystical seas. Unwind for hours into cozy and relaxing gameplay. Join the adventure as Daffodil the cat, in two-player cooperative play.Learn how to say goodbye.Experience moving, emotional stories filled with unforgettable moments. Spend relaxing quality time with your spirit passengers, create lasting memories, and, ultimately, learn how to say goodbye to your cherished friends. What will you leave behind?… Expand"}, {"name": "UFC Undisputed 2009", "details_link": "https://www.metacritic.com/game/playstation-3/ufc-undisputed-2009", "publisher": "THQ", "release_date": "May 19 2009", "developers": ["THQ", "Yuke's"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/5ac72cb313921d5934a050adafe2a4d5-98.jpg", "descriptions": "UFC 2009 Undisputed is an explosive fighting game that details the action, intensity and attitude of a UFC live event. Players explore a deep roster of more than 80 top fighters in UFC competition across all five weight classes. In addition, they enter the Octagon surrounded by the sport’sUFC 2009 Undisputed is an explosive fighting game that details the action, intensity and attitude of a UFC live event. Players explore a deep roster of more than 80 top fighters in UFC competition across all five weight classes. In addition, they enter the Octagon surrounded by the sport’s popular commentators, announcers, referees, trainers, Octagon girls and more. Photorealistic models are at the forefront, as players view amazing ripple effects across the faces and bodies of their fighters from the impact of devastating punches and kicks. A brand new fighting game engine designed specifically for next generation systems delivers innovative, responsive and easy-to-play controls that give unparalleled command of fighters, as players take down opponents with a variety of mixed martial arts disciplines like Muay Thai, Kickboxing and Brazilian Jiu-Jitsu. In addition, the game’s Create-A-Fighter system jumpstarts the careers of future champions through character customization and training management, while a robust Career Mode develops a fighter's attributes and skill sets while fighting to enter the UFC Hall of Fame through a series of dynamic storylines. Furthermore, players can enhance their UFC 2009 Undisputed gameplay experience through online support, including downloadable content. [THQ]… Expand"}, {"name": "Timespinner", "details_link": "https://www.metacritic.com/game/switch/timespinner", "publisher": "Chucklefish", "release_date": "Jun  4 2019", "developers": ["Lunar Ray Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/4d959747b04aa423552738207517c2db-98.jpg", "descriptions": "Travel back in time to change fate itself, in this beautifully crafted story-driven adventure, inspired by classic 90s action-platformers. With her family murdered in front of her and the ancient Timespinner device destroyed, Lunais is suddenly transported into an unknown world, strandedTravel back in time to change fate itself, in this beautifully crafted story-driven adventure, inspired by classic 90s action-platformers. With her family murdered in front of her and the ancient Timespinner device destroyed, Lunais is suddenly transported into an unknown world, stranded with seemingly no hope of return. Using her power to control time, Lunais vows to take her revenge on the evil Lachiem Empire, but sometimes the course of history isn’t quite as black and white as it seems... … Expand"}, {"name": "The Walking Dead: Season Two Episode 5 - No Going Back", "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-season-two-episode-5---no-going-back", "publisher": "Telltale Games", "release_date": "Aug 27 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Adventure", "General", "General", "Point-and-Click"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/56e42cbe05f954ee2533b82480920b9c-98.jpg", "descriptions": "The final episode of a five-part game series set in Robert Kirkmans award-winning zombie apocalypse."}, {"name": "PixelJunk Monsters: Ultimate HD", "details_link": "https://www.metacritic.com/game/playstation-vita/pixeljunk-monsters-ultimate-hd", "publisher": "Double Eleven", "release_date": "Jul 30 2013", "developers": ["Double Eleven"], "platforms": ["PC", "PlayStation Vita"], "num_players": "2 ", "genres": ["Strategy", "Real-Time", "Fantasy", "Fantasy", "Defense"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/209bb0a858b43d70a655fa6aa1889495-98.jpg", "descriptions": "What do you get? The 21 Tiki Island levels and 24 Challenge levels from the original PixelJunk Monsters PS3. From the Encore expansion Toki island with 15 levels inspired by arcade classics and the third island, Tum Tum. From the Deluxe Edition a fourth island, Gati Gati with 11 more stages.What do you get? The 21 Tiki Island levels and 24 Challenge levels from the original PixelJunk Monsters PS3. From the Encore expansion Toki island with 15 levels inspired by arcade classics and the third island, Tum Tum. From the Deluxe Edition a fourth island, Gati Gati with 11 more stages. Not to mention trap towers, gem towers, scuttlers, fire monsters, flying balloon monsters, unlockable content and more.\r… Expand"}, {"name": "Rift (2011)", "details_link": "https://www.metacritic.com/game/pc/rift-2011", "publisher": "Trion Worlds", "release_date": "Mar  1 2011", "developers": ["Trion Worlds"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/f23dc7eb31675ffe0681c883522a0182-98.jpg", "descriptions": "The graphically stunning online game is set in a world being torn apart by dimensional \"rifts\" that tear into the land of Telara, releasing powerful forces that threaten the very existence of the entire universe. Rifts and other dynamic events can be triggered by players, scheduledThe graphically stunning online game is set in a world being torn apart by dimensional \"rifts\" that tear into the land of Telara, releasing powerful forces that threaten the very existence of the entire universe. Rifts and other dynamic events can be triggered by players, scheduled by the development team, or even occur spontaneously. Dynamic events within the game can lead to a range of changes across the world, including everything from minor events to dramatic shifts in the game's landscape and the opening of new areas. Players will connect with hundreds of thousands of other gamers to battle creatures overrunning the world, as well as each other.… Expand"}, {"name": "Telling Lies", "details_link": "https://www.metacritic.com/game/pc/telling-lies", "publisher": "Annapurna Interactive", "release_date": "Aug 23 2019", "developers": ["Sam Barlow", "Furious Bee"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 84, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/ee6a810a760da951ea5d125274d7b3ba-98.jpg", "descriptions": "Four private lives. One big lie. Search through secretly recorded video conversations to discover the truth. The successor to the acclaimed Her Story."}, {"name": "Zero Escape: Virtue's Last Reward", "details_link": "https://www.metacritic.com/game/playstation-vita/zero-escape-virtues-last-reward", "publisher": "Aksys Games", "release_date": "Oct 23 2012", "developers": ["ChunSoft"], "platforms": ["3DS", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/c5d3913975ef72673d7841a02c3a347c-98.jpg", "descriptions": "Zero Escape: Virtue's Last Reward has players taking on the Nonary Game again, as it's back and more deadly than ever."}, {"name": "Hitman - Episode 2: Sapienza", "details_link": "https://www.metacritic.com/game/playstation-4/hitman---episode-2-sapienza", "publisher": "Square Enix", "release_date": "Apr 26 2016", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/6e06aa4d47c3c065fdfc25273afa318d-98.jpg", "descriptions": "The 2nd installment of HITMAN finds Agent 47 traveling to the beautiful, sun-drenched coastal town of Sapienza, Italy. This episode adds a new story mission, new challenges, new weapons and gear, the Italian suit and of course new targets, opportunities and disguises."}, {"name": "Project CARS 2", "details_link": "https://www.metacritic.com/game/pc/project-cars-2", "publisher": "Bandai Namco Games", "release_date": "Sep 21 2017", "developers": ["Slightly Mad Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 84, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/9f0a79632077cdd5136952c00f0f4ccb-98.jpg", "descriptions": "Project CARS 2 is the next evolution in the award-winning racing series, featuring the most iconic cars racing under the most thrilling conditions to deliver the Ultimate Driver Journey.\r Created by gamers, tested by world-class racing drivers from Team SMS-R, and the definitive choice ofProject CARS 2 is the next evolution in the award-winning racing series, featuring the most iconic cars racing under the most thrilling conditions to deliver the Ultimate Driver Journey.\r Created by gamers, tested by world-class racing drivers from Team SMS-R, and the definitive choice of Esports pros... Project CARS 2 captures the essence of real racing in the most beautiful, intense, authentic, and technically-advanced racing game on the planet.\r FEATURES:\r * Over 170 licensed cars from the most iconic brands.\r* The largest track roster of any console racing game including ice and dirt tracks.\r* New vehicle types and motorsport classes including Rallycross, IndyCar, and Oval.\r* Dynamic time of day, weather, and new seasonal conditions.\r* New Online Championships mode.\r* LiveTrack 3.0 powers dynamic surface conditions that affect vehicle performance and handling, and evolves the track over the course of a race weekend.\r* Esports built-in from day one with full ranking, and broadcasting / streaming functionality.\r* Bleeding-edge tire physics, advanced AI, and intuitive gamepad control.… Expand"}, {"name": "This Way Madness Lies", "details_link": "https://www.metacritic.com/game/pc/this-way-madness-lies", "publisher": "Zeboyd Games", "release_date": "Nov 10 2022", "developers": ["Zeboyd Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/9dcd9ea4f6bb02e18529f637728471ed-98.jpg", "descriptions": "Shakespeare and Magical Girls, what could be better? Save the worlds of Shakespeare from the forces of Nightmare in this fast-paced turn-based JRPG comedy."}, {"name": "BioShock: The Collection", "details_link": "https://www.metacritic.com/game/playstation-4/bioshock-the-collection", "publisher": "2K Games", "release_date": "Sep 13 2016", "developers": ["2K Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Arcade"], "meta_score": 84, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/5d1a2d878eb7dacbc870403e57d4cc36-98.jpg", "descriptions": "Return to the cities of Rapture and Columbia and experience the BioShock franchise like never before. BioShock: The Collection retells the epic journeys of the BioShock universe remastered for PS4."}, {"name": "Swords & Soldiers", "details_link": "https://www.metacritic.com/game/wii/swords-soldiers", "publisher": "Ronimo Games", "release_date": "Jun  8 2009", "developers": ["Ronimo Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Switch", "Wii U", "Wii"], "genres": ["Strategy", "General", "General"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/c837214c51189c9130cdebc14fe329f3-98.jpg", "descriptions": "[WiiWare]  Swords & Soldiers is a sidescrolling real time strategy game, in which three distinct factions battle for the powers of the gods. The game sfeature a single player campaign and a competitive splitscreen multiplayer mode as well as several other game modes. [Ronimo Games]"}, {"name": "The Wolf Among Us: Episode 5 - Cry Wolf", "details_link": "https://www.metacritic.com/game/pc/the-wolf-among-us-episode-5---cry-wolf", "publisher": "Telltale Games", "release_date": "Jul  8 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Fantasy", "Action Adventure", "Adventure", "General", "Fantasy", "Point-and-Click"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/f9565061c0b4e341c487a43316a6733f-98.jpg", "descriptions": "Following a bloody trail of murder and corruption, Bigby Wolf faces a powerful enemy: a dark force that has been feeding on the desperation of Fabletown’s seedy underbelly. But when hidden truths are revealed, you must decide exactly what justice means in the gripping season finale of TheFollowing a bloody trail of murder and corruption, Bigby Wolf faces a powerful enemy: a dark force that has been feeding on the desperation of Fabletown’s seedy underbelly. But when hidden truths are revealed, you must decide exactly what justice means in the gripping season finale of The Wolf Among Us.… Expand"}, {"name": "Might & Magic: Clash of Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/might-magic-clash-of-heroes", "publisher": "Ubisoft", "release_date": "Apr 13 2011", "developers": ["Capy Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "General", "General"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/03ff0c3009e120e9b6bf151738243b35-98.jpg", "descriptions": "Might and Magic Clash of Heroes takes place 40 years before the Heroes V saga. Scattered across five different regions of Ashan, 5 special heroes must travel their own dangerous paths to grow in strength, unravel a demonic plot, and ultimately save the world from Chaos."}, {"name": "Child of Eden", "details_link": "https://www.metacritic.com/game/xbox-360/child-of-eden", "publisher": "Ubisoft", "release_date": "Jun 14 2011", "developers": ["Q Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Rail", "Rail", "Fantasy"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/9eeb7c498405408158f8e452d8c998b6-98.jpg", "descriptions": "Child of Eden thrusts the player into the center of a battle to save Project Lumi, a mission to reproduce a human personality inside Eden, the archive of all human memories. As the project nears completion, the archive is invaded by an unknown virus. The player's mission is to save Eden fromChild of Eden thrusts the player into the center of a battle to save Project Lumi, a mission to reproduce a human personality inside Eden, the archive of all human memories. As the project nears completion, the archive is invaded by an unknown virus. The player's mission is to save Eden from the virus, restoring hope and peace.… Expand"}, {"name": "Shift 2: Unleashed", "details_link": "https://www.metacritic.com/game/pc/shift-2-unleashed", "publisher": "Electronic Arts", "release_date": "Mar 29 2011", "developers": ["Slightly Mad Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 84, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/fb20cf585dd253291850cef6c4ae7cb2-98.jpg", "descriptions": "Shift 2 Unleashed combines violence and excitement in this racing experience."}, {"name": "Ape Out", "details_link": "https://www.metacritic.com/game/switch/ape-out", "publisher": "Devolver Digital", "release_date": "Feb 28 2019", "developers": ["Gabe Cuzzillo"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 84, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/65cf8fb4ad80d4539845970ae0db0cf7-98.jpg", "descriptions": "Ape Out is a wildly intense and colorfully stylized smash ‘em up about primal escape, rhythmic violence, and frenetic jazz."}, {"name": "The End Is Nigh", "details_link": "https://www.metacritic.com/game/pc/the-end-is-nigh", "publisher": "Edmund McMillen", "release_date": "Jul 12 2017", "developers": ["Edmund McMillen", "Tyler Glaiel"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/e2b347a67be3c892ea749a0b8555a6ce-98.jpg", "descriptions": "The End Is Nigh is a sprawling adventure platformer where you die a lot, but thats ok because you are probably already dead anyway."}, {"name": "Sid Meier's Civilization IV: Warlords", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-iv-warlords", "publisher": "2K Games", "release_date": "Jul 24 2006", "developers": ["Firaxis Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "4X"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/619c30720d26deb4916498e5cc176dd0-98.jpg", "descriptions": "An all-new expansion pack, Warlords pays homage to some of history's greatest military leaders, delivering six new scenarios, giving players the chance to change the course of history with the help of their new powerful \"warlord\" unit. The expansion pack is loaded with new civilizations, newAn all-new expansion pack, Warlords pays homage to some of history's greatest military leaders, delivering six new scenarios, giving players the chance to change the course of history with the help of their new powerful \"warlord\" unit. The expansion pack is loaded with new civilizations, new leaders and more units, resources and wonders that can be used in both single and multiplayer games. [2K Games]… Expand"}, {"name": "Hitman", "details_link": "https://www.metacritic.com/game/playstation-4/hitman", "publisher": "Square Enix", "release_date": "Oct 31 2016", "developers": ["Io Interactive"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action Adventure", "General"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/7bf43ba2f5959ae27ea00cbac020cf73-98.jpg", "descriptions": "HITMAN empowers players to perform contract hits on powerful, high-profile targets in exotic locations around the globe, from Paris and sunny coast of Italy to the dust and hustle of the markets in Marrakesh in this stealth action title. Gameplay centers on taking out targets in vast sandboxHITMAN empowers players to perform contract hits on powerful, high-profile targets in exotic locations around the globe, from Paris and sunny coast of Italy to the dust and hustle of the markets in Marrakesh in this stealth action title. Gameplay centers on taking out targets in vast sandbox levels with complete freedom of approach. Where to go, when to attack and who to kill is at your discretion.… Expand"}, {"name": "Unsighted", "details_link": "https://www.metacritic.com/game/pc/unsighted", "publisher": "Studio Pixel Punk", "release_date": "Sep 30 2021", "developers": ["Studio Pixel Punk"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/0f7a059bfc1a05801b573658c1998d4a-98.jpg", "descriptions": "The few androids that remain are running out of Anima, the energy that gives all robots consciousness. It’s up to you, Alma, to save your friends from becoming Unsighted. Explore the vast ruins of Arcadia, using every tool you can find. Time is ticking. They need you."}, {"name": "To the Moon", "details_link": "https://www.metacritic.com/game/switch/to-the-moon", "publisher": "Freebird Games", "release_date": "Jan 16 2020", "developers": ["Freebird Games", "X.D. Network Inc."], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/9e537fd866fd08a901fd84e259f48f79-98.jpg", "descriptions": "Dr. Rosalene and Dr. Watts have peculiar jobs: They give people another chance to live, all the way from the very beginning... but only in their patients' heads.\r Due to the severity of the operation, the new life becomes the last thing the patients remember before drawing their lastDr. Rosalene and Dr. Watts have peculiar jobs: They give people another chance to live, all the way from the very beginning... but only in their patients' heads.\r Due to the severity of the operation, the new life becomes the last thing the patients remember before drawing their last breath. Thus, the operation is only done to people on their deathbeds, to fulfill what they wish they had done with their lives, but didnt.\r This particular story follows their attempt to fulfill the dream of an elderly man, Johnny. With each step back in time, a new fragment of Johnny's past is revealed. As the two doctors piece together the puzzled events that spanned a life time, they seek to find out just why the frail old man chose his dying wish to be what it is.\r And Johnny's last wish is, of course... to go to the moon.\r * A unique story-driven experience\r* Innovative mix between adventure game elements and classic RPG aesthetics\r* Acclaimed original soundtrack that closely ties to the story\r* An espresso execution with zero filler and no time drains… Expand"}, {"name": "Sega Ages: OutRun", "details_link": "https://www.metacritic.com/game/switch/sega-ages-outrun", "publisher": "Sega", "release_date": "Jan 10 2019", "developers": ["Sega", "M2"], "platforms": ["3DS", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/a9480dbe08e2aa68117633841173b83b-98.jpg", "descriptions": "Brace yourself for the most realistic racing experience yet. And to play, you've got to have what it takes: NERVE, SKILL and BRAINS. NERVE - you're behind the wheel of a supertuned race car with one speed only: fast. SKILL - you're maneuvering a car that can nearly reach a simulated 270 KMH.Brace yourself for the most realistic racing experience yet. And to play, you've got to have what it takes: NERVE, SKILL and BRAINS. NERVE - you're behind the wheel of a supertuned race car with one speed only: fast. SKILL - you're maneuvering a car that can nearly reach a simulated 270 KMH. BRAINS - because you're in control of your car's speed and handling at a dangerous pace, you have to use your head and not just your hands to survive. So get geared for the ride of your life and stay alert. The track may look terrific, but at these speeds anything can turn into a danger zone.… Expand"}, {"name": "SpeedRunners", "details_link": "https://www.metacritic.com/game/pc/speedrunners", "publisher": "tinyBuild", "release_date": "Apr 19 2016", "developers": ["DoubleDutch Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "General", "Platformer", "2D"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/2ee4e7ee22d0986eb7339ee5f9f6aa06-98.jpg", "descriptions": "Cut-throat multiplayer running game that pits 4 players against each other, locally and/or online. Run, jump, swing around, and use devious weapons and pick-ups to knock opponents off-screen! One of the most competitive games you'll ever play."}, {"name": "Resident Evil 4 HD", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-4-hd", "publisher": "Capcom", "release_date": "Sep 20 2011", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/67ba735724fd3d24cf945a7338544f2c-98.jpg", "descriptions": "Resident Evil 4 marks a new chapter in the Resident Evil series. You'll rejoin Leon S. Kennedy six years after his first mission as a rookie cop from Resident Evil 2. Now a US agent, Leon is on a top secret mission to investigate the disappearance of the president's daughter. As Leon, youResident Evil 4 marks a new chapter in the Resident Evil series. You'll rejoin Leon S. Kennedy six years after his first mission as a rookie cop from Resident Evil 2. Now a US agent, Leon is on a top secret mission to investigate the disappearance of the president's daughter. As Leon, you must make your way to a mysterious location in Europe, where new enemies await. Take them down by using enhanced aim-and-shoot features and a new action button.… Expand"}, {"name": "Full Spectrum Warrior", "details_link": "https://www.metacritic.com/game/xbox/full-spectrum-warrior", "publisher": "THQ", "release_date": "Jun  1 2004", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Military"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/3b3539ca52d32ebf12529d8bfecd567f-98.jpg", "descriptions": "Full Spectrum Warrior is based on a game commissioned by the US Army to train light infantry troops in urban combat situations. The game places soldiers in a tense, hostile, and claustrophobic environment where they must complete a variety of military objectives. As the squad leader, you areFull Spectrum Warrior is based on a game commissioned by the US Army to train light infantry troops in urban combat situations. The game places soldiers in a tense, hostile, and claustrophobic environment where they must complete a variety of military objectives. As the squad leader, you are in charge of providing direction to Alpha and Bravo fire teams. The successful Squad Leader effectively uses cover in the environment and moves his fire teams in a coordinated fashion so they can protect themselves from possible attacks that could come from any direction.… Expand"}, {"name": "Battlefield 1942: The Road to Rome", "details_link": "https://www.metacritic.com/game/pc/battlefield-1942-the-road-to-rome", "publisher": "EA Games", "release_date": "Feb  2 2003", "developers": ["Digital Illusions"], "platforms": "PC", "num_players": "1-64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/81845405a49a4d7c3a408e561c76f215-98.jpg", "descriptions": "This multiplayer-focused expansion pack features more maps, more vehicles, and more fighting forces. The Road to Rome focuses exclusively on the key Italian and Sicilian campaigns of WWII. Each map comes with highly detailed environments such as Italian houses, Mediterranean trees, and evenThis multiplayer-focused expansion pack features more maps, more vehicles, and more fighting forces. The Road to Rome focuses exclusively on the key Italian and Sicilian campaigns of WWII. Each map comes with highly detailed environments such as Italian houses, Mediterranean trees, and even the Monte Cassino Monastery. This expansion pack features eight new vehicles including the German BF-110 and British Mosquito twin-engine fighter-bombers as well as new Italian, British, and German tanks and anti-tank guns. Play as several infantry classes, controlling many weapons available to the Axis and Allies, and commanding numerous land vehicles, ships, and aircraft. The original Battlefield 1942 game is required to play The Road to Rome. [Electronic Arts]… Expand"}, {"name": "NCAA College Basketball 2K3", "details_link": "https://www.metacritic.com/game/xbox/ncaa-college-basketball-2k3", "publisher": "Sega", "release_date": "Dec  2 2002", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/470b7b4ad341a0d0eadbfca71c55a0ea-98.jpg", "descriptions": "NCAA College Basketball returns for another year of tournaments, chants, and rivalries. More than 300 Division I teams have been updated with accurate rosters, ratings, and schedules. Select a team and compete in conference tournaments, or create your own custom tournament from scratch. AsNCAA College Basketball returns for another year of tournaments, chants, and rivalries. More than 300 Division I teams have been updated with accurate rosters, ratings, and schedules. Select a team and compete in conference tournaments, or create your own custom tournament from scratch. As you move up the ranks, you'll discover each school has its own mix of cheerleaders, chants, and fight songs. Now you can invade home courts online against players nationwide on the Xbox and PlayStation 2. … Expand"}, {"name": "Tom Clancy's Ghost Recon", "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-ghost-recon", "publisher": "Ubisoft", "release_date": "Nov 11 2002", "developers": ["Red Storm Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 84, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/4883ee6d218e49c3b7b4167bb3c6a1d8-98.jpg", "descriptions": "When new leaders in Russia attempt to rebuild the Iron Curtain, war escalates, casualties mount, hostages are taken, and the Ghosts are sent in.  Take a highly skilled Ghost team through a series of missions that range from demolitions to search-and-rescue and all-out firefights forWhen new leaders in Russia attempt to rebuild the Iron Curtain, war escalates, casualties mount, hostages are taken, and the Ghosts are sent in.  Take a highly skilled Ghost team through a series of missions that range from demolitions to search-and-rescue and all-out firefights for survival.  You can carry dozens of standard and special-issue weapons such as the M16A2, the M4 carbine, and the fearsome and deadly OICW.  Bring a friend into the firefight in split-screen multiplayer mode.  Your team--and the world--is counting on you.… Expand"}, {"name": "NASCAR Thunder 2003", "details_link": "https://www.metacritic.com/game/xbox/nascar-thunder-2003", "publisher": "EA Sports", "release_date": "Sep 19 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 84, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/6828004341d801dc9baab3e7412715db-98.jpg", "descriptions": "Get behind the wheel of the world's tightest, sleekest stock cars and get ready for an intense ride.  NASCAR Thunder 2003 elevates the series to another level with deeper modes, new tracks, and a greater sense of speed.  Experience life in the fast lane through 20 seasons of Career mode, inGet behind the wheel of the world's tightest, sleekest stock cars and get ready for an intense ride.  NASCAR Thunder 2003 elevates the series to another level with deeper modes, new tracks, and a greater sense of speed.  Experience life in the fast lane through 20 seasons of Career mode, in which you must compete for top sponsors, the best crewmembers, and the latest racing technology.  All 23 Winston Cup tracks and the Daytona Beach road course can be raced with 14 tracks featuring both day and night racing.  NASCAR Thunder 2003 brings the speed and precision of NASCAR to your fingertips.… Expand"}, {"name": "Poseidon", "details_link": "https://www.metacritic.com/game/pc/poseidon", "publisher": "Sierra Entertainment", "release_date": "Jun 25 2001", "developers": ["Impressions Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "Management", "Government"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/11c1a9fad63ef692889812bd65c0ca96-98.jpg", "descriptions": "With 45 missions spread out across six campaigns, Poseidon features new units to command during war, new monsters, new raw materials to trade (black marble & orichalc), and hippodromes providing much needed city-wide happiness and cash."}, {"name": "Escape from Monkey Island", "details_link": "https://www.metacritic.com/game/playstation-2/escape-from-monkey-island", "publisher": "LucasArts", "release_date": "Jun 18 2001", "developers": ["LucasArts"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/f5ed14f6bd00079323b294c575db824e-98.jpg", "descriptions": "Join pencil-neck pirate Guybrush Threepwood as one of the best graphical PC adventure games comes to the PS2 totally intact and offbeat as ever."}, {"name": "Star Wars: Episode I Battle for Naboo", "details_link": "https://www.metacritic.com/game/nintendo-64/star-wars-episode-i-battle-for-naboo", "publisher": "LucasArts", "release_date": "Dec 18 2000", "developers": ["Factor 5"], "platforms": "Nintendo 64", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 84, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/870b103c95463079ba0e7576cd024f5c-98.jpg", "descriptions": "Attention defenders of Naboo! The Trade Federation must be stopped! Storm through more than 15 missions over land, sea and space as your freedom fighters rally against the droid armies. Take control of 7 vehicles: the Naboo starfighter, Gian speeder, and new craft like the heavy STAP, TradeAttention defenders of Naboo! The Trade Federation must be stopped! Storm through more than 15 missions over land, sea and space as your freedom fighters rally against the droid armies. Take control of 7 vehicles: the Naboo starfighter, Gian speeder, and new craft like the heavy STAP, Trade Federation gunboat and more. More than 15 missions: escape from Theed, search & destroy, sabotage, reconnaissance, convoy. Battle against Trade Federation droid starfighters, AATs, destroyer droids, battle droids. \rChange vehicles mid-mission through specially designated hangars.… Expand"}, {"name": "Master of Orion II: Battle at Antares", "details_link": "https://www.metacritic.com/game/pc/master-of-orion-ii-battle-at-antares", "publisher": "MicroProse", "release_date": "Oct  1 1996", "developers": ["SimTex"], "platforms": "PC", "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "4X"], "meta_score": 84, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/9/cfbcdba8cd6cc96bce4638ab0030168e-98.jpg", "descriptions": "Master the unknown before it masters you. The need for galactic expansion is critical. You must conquer alien star systems to secure the resources that will guarantee your supremacy. The ultimate goal is to defeat the evil Antarans."}, {"name": "Control", "details_link": "https://www.metacritic.com/game/xbox-one/control", "publisher": "505 Games", "release_date": "Aug 27 2019", "developers": ["Remedy Entertainment", "505 Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/ad6580aa18ca41c2ec9ac6ff53c404df-98.jpg", "descriptions": "After a secretive agency in New York is invaded by an otherworldly threat, you become the new Director struggling to regain Control. This supernatural third-person action-adventure game will challenge you to master a combination of supernatural abilities, modifiable loadouts and reactiveAfter a secretive agency in New York is invaded by an otherworldly threat, you become the new Director struggling to regain Control. This supernatural third-person action-adventure game will challenge you to master a combination of supernatural abilities, modifiable loadouts and reactive environments, while fighting through a deep and unpredictable world.… Expand"}, {"name": "Tom Clancy's Splinter Cell: Blacklist", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-splinter-cell-blacklist", "publisher": "Ubisoft", "release_date": "Aug 20 2013", "developers": ["Ubisoft Toronto"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/338f4eef7f7f7f21946a9d5b3ffe13cb-98.jpg", "descriptions": "The United States maintains a military presence in two thirds of countries around the world. This doesn't sit well with a syndicate of rogue nations which initiates a terror protocol designated as the Blacklist - a deadly countdown of escalating terrorist attacks on American interests. SamThe United States maintains a military presence in two thirds of countries around the world. This doesn't sit well with a syndicate of rogue nations which initiates a terror protocol designated as the Blacklist - a deadly countdown of escalating terrorist attacks on American interests. Sam Fisher is the leader of the newly formed 4th Echelon unit: a clandestine unit that answers directly to the President of the United States. Sam and his team have to hunt down these terrorists by any means necessary, and put a stop to the Blacklist countdown before it reaches zero.… Expand"}, {"name": "FIFA 16", "details_link": "https://www.metacritic.com/game/xbox-one/fifa-16", "publisher": "EA Sports", "release_date": "Sep 22 2015", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 84, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/5/2bae2bbae1a63e01c5f7b4a2c10dc510-98.jpg", "descriptions": "Defend together, win together. Rely on your teammates to cover gaps when you close down an attacker. New defensive AI gives players better awareness of dangerous space on the pitch relative to the ball and their opponent. Your teammates will track back to stop sophisticated attacking runs,Defend together, win together. Rely on your teammates to cover gaps when you close down an attacker. New defensive AI gives players better awareness of dangerous space on the pitch relative to the ball and their opponent. Your teammates will track back to stop sophisticated attacking runs, and close down angles of attack. … Expand"}, {"name": "Triangle Strategy", "details_link": "https://www.metacritic.com/game/pc/triangle-strategy", "publisher": "Square Enix", "release_date": "Oct 13 2022", "developers": ["Artdink"], "platforms": ["Switch", "PC"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 84, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/1dde079afe81ecf8f8996f3171772dd5-98.jpg", "descriptions": "Three nations battle for control of the dwindling resources of salt and ironCommand a group of warriors as Serenoa, heir of House Wolffort, in a tangled plot where your decisions make all the difference. Key choices you make will bolster one of three convictionsUtility, Morality,Three nations battle for control of the dwindling resources of salt and ironCommand a group of warriors as Serenoa, heir of House Wolffort, in a tangled plot where your decisions make all the difference. Key choices you make will bolster one of three convictionsUtility, Morality, Libertywhich together make up Serenoa's world view and influence how the story will unfold. When faced with truly momentous decisions, multiple characters will weigh in by casting their votes on the Scales of Conviction. In these moments, the allies and decisions you make can determine the fate of whole nations and the continent of Norzelia itself.Control multi-tiered battlefields to strategically secure victoryFinding the best location in turn-based battles can tip the tide of combat in your favor. Position units on higher ground to take control of the battlefield and gain the advantage with increased range. You can also flank enemies on both sides, then strike from behind for a powerful follow-up attack. Elemental chain reactions are also an important part of combat. For example, use fire to melt icy terrain, then use lightning to electrocute it. Push the enemy into the electrified water to see sparks fly!… Expand"}, {"name": "Resident Evil 3", "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-3", "publisher": "Capcom", "release_date": "Apr  3 2020", "developers": ["Capcom", "M-Two"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 84, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/56defb66b1f5ec951c52970c8b44ac2a-98.jpg", "descriptions": "Fight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that theFight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that the pharmaceutical company Umbrella and their biological weapon, the T-Virus, are behind the incidents though they've lost several members in the process. Jill Valentine and the other surviving S.T.A.R.S. members try to make this truth known, but find that the police department itself is under Umbrella's sway and their reports are rejected out of hand.\r However, soon reports of a grisly \"cannibal virus\" begin to surface, and vicious dogs begin roaming the streets. With the viral plague spreading through the town and to her very doorstep, Jill is determined to survive.\rHowever, unbeknownst to Jill, an extremely powerful pursuer has already been dispatched to eliminate her.… Expand"}, {"name": "GRIS", "details_link": "https://www.metacritic.com/game/pc/gris", "publisher": "Devolver Digital", "release_date": "Dec 13 2018", "developers": ["Nomada Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/92aa5f1ac6f31f737e7a437d08ea109c-98.jpg", "descriptions": "Gris is a hopeful young girl lost in her own world, dealing with a painful experience in her life. Her journey through sorrow is manifested in her dress, which grants new abilities to better navigate her faded reality."}, {"name": "Retro Bowl", "details_link": "https://www.metacritic.com/game/switch/retro-bowl", "publisher": "Five Aces Publishing Ltd.", "release_date": "Feb 10 2022", "developers": ["Five Aces Publishing Ltd."], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Strategy", "Management", "Team", "Football", "Business / Tycoon", "Sim"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/888f19e525c5561a93b72a9606cc8375-98.jpg", "descriptions": "Retro Bowl is the perfect game for the armchair quarterback to finally prove a point. Presented in a glorious retro style, the game has simple roster management, including press duties and the handling of fragile egos, while on the field you get to call the shots.Can you pass the grade andRetro Bowl is the perfect game for the armchair quarterback to finally prove a point. Presented in a glorious retro style, the game has simple roster management, including press duties and the handling of fragile egos, while on the field you get to call the shots.Can you pass the grade and take your team all the way to the ultimate prize? Can you win the Retro Bowl?… Expand"}, {"name": "Shovel Knight: King of Cards", "details_link": "https://www.metacritic.com/game/pc/shovel-knight-king-of-cards", "publisher": "Yacht Club Games", "release_date": "Dec 10 2019", "developers": ["Yacht Club Games"], "platforms": ["3DS", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/9680e272b0da1e00757b45a55ad039be-98.jpg", "descriptions": "Step into the gilded boots of King Knight in the biggest and most regal Shovel Knight game of them all! Leap, Shoulder Bash, gather new subjects, and strategize your way through this prequel in your quest to become King of Cards."}, {"name": "FIFA 18", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-18", "publisher": "Electronic Arts", "release_date": "Sep 26 2017", "developers": ["EA Vancouver"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 84, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/7/a4bfa48c6512680e4a10e9540d211867-98.jpg", "descriptions": "Score incredible goals in FIFA 18 as new movement and finishing animations unlock more fluid striking and heading of the ball. All-new crossing controls bring greater options to how you send it into the box. Whipped to the spot, arching deliveries, and pinged crosses to the back-stick willScore incredible goals in FIFA 18 as new movement and finishing animations unlock more fluid striking and heading of the ball. All-new crossing controls bring greater options to how you send it into the box. Whipped to the spot, arching deliveries, and pinged crosses to the back-stick will shake up your attacks in the final third. The biggest step in gameplay, FIFA 18 introduces Real Player Motion Technology, an all-new animation system that unlocks the next level of responsiveness and player personality. Now Cristiano Ronaldo and other top players feel and move exactly like they do on the real pitch. From tiki-taka to high press, new Team Styles put the most recognised tactics of the world's best clubs on the pitch in FIFA 18. Enjoy more time and space to read the play through New Player Positioning, while improved tactics give players greater options on the ball as teammates exploit space and make new attacking runs. [Electronic Arts]… Expand"}, {"name": "Vanquish", "details_link": "https://www.metacritic.com/game/xbox-360/vanquish", "publisher": "Sega", "release_date": "Oct 19 2010", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 9.6, "image": "https://static.metacritic.com/images/products/games/3/d1368fed775d4d2ab41f64b4dfdf6be0-98.jpg", "descriptions": "Directed by Shinji Mikami, VANQUISH is a sci-fi shooter of epic proportions with a fast, fluid and frenetic combat system, and an engaging and immersive storyline. Players take the role of Sam, a government agent kitted out with a futuristic battle suit, in a near future world where nationsDirected by Shinji Mikami, VANQUISH is a sci-fi shooter of epic proportions with a fast, fluid and frenetic combat system, and an engaging and immersive storyline. Players take the role of Sam, a government agent kitted out with a futuristic battle suit, in a near future world where nations war over the planet's remaining energy resources. A versatile fighter with a huge arsenal of weaponry at his disposal, Sam also has an array of martial arts skills that he can use to take down his robot enemies.    … Expand"}, {"name": "F1 2010", "details_link": "https://www.metacritic.com/game/pc/f1-2010", "publisher": "Codemasters", "release_date": "Sep 21 2010", "developers": ["Codemasters Birmingham"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 84, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/6a64d413291674bf9ac655ba46b25fd7-98.jpg", "descriptions": "In F1 2010 gamers will take on the full, expanded grid in a variety of game modes including Grand Prix, Championship, Time Trial and an extensive, innovative Career mode. F1 2010 will also feature a highly advanced damage model, fully dynamic weather system and extensive competitiveIn F1 2010 gamers will take on the full, expanded grid in a variety of game modes including Grand Prix, Championship, Time Trial and an extensive, innovative Career mode. F1 2010 will also feature a highly advanced damage model, fully dynamic weather system and extensive competitive multiplayer options.… Expand"}, {"name": "Assassin's Creed Origins", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-origins", "publisher": "Ubisoft", "release_date": "Oct 27 2017", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Edutainment", "Open-World"], "meta_score": 84, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/4f26cac681d7fc1e019bc394e3f70e32-98.jpg", "descriptions": "Set in mysterious Ancient Egypt, Assassin’s Creed Origins is a new beginning. Experience a new way to fight while exploring the Great Pyramids and hidden tombs across the country of Ancient Egypt, and encounter many memorable storylines along your journey. And discover the origin story ofSet in mysterious Ancient Egypt, Assassin’s Creed Origins is a new beginning. Experience a new way to fight while exploring the Great Pyramids and hidden tombs across the country of Ancient Egypt, and encounter many memorable storylines along your journey. And discover the origin story of the Assassin's Brotherhood. [Ubisoft]… Expand"}, {"name": "ENDER LILIES: Quietus of the Knights", "details_link": "https://www.metacritic.com/game/switch/ender-lilies-quietus-of-the-knights", "publisher": "Binary Haze Interactive", "release_date": "Jun 22 2021", "developers": ["Live Wire Films", "Live Wire"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/c5405aaa6601fb892ec5af00d4c0b604-98.jpg", "descriptions": "Long ago, in the distant reaches of Land's End, an unforeseen rainfall transformed all living things into frenzied undead monstrosities known as the Blighted. Faced with a calamity far beyond their understanding, the kingdom fell into ruin with no end to the accursed rain in sight.Long ago, in the distant reaches of Land's End, an unforeseen rainfall transformed all living things into frenzied undead monstrosities known as the Blighted. Faced with a calamity far beyond their understanding, the kingdom fell into ruin with no end to the accursed rain in sight.Meanwhile in the remnants of this devastated land, a young woman named Lily awakens in the depths of a churchUnravel the mystery of the kingdom destroyed by the Rain of Death. Journey through the sprawling and hauntingly beautiful Land's End, traversing a submerged forest, a sealed-off contaminated underground cavern, and a grand castle.Formidable bosses await that will gladly claim your life given even the slightest chance. Defeat these powerful foes and release them from their unending curse to recruit them as allies. Overcome the challenges before you and search for the truth with powerful knights at your side.… Expand"}, {"name": "Shatter (2009)", "details_link": "https://www.metacritic.com/game/pc/shatter-2009", "publisher": "Sidhe Interactive", "release_date": "Mar 15 2010", "developers": ["Sidhe Interactive"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 84, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/c03fe26d6009fc295655ba8057de218e-98.jpg", "descriptions": "Shatter is a retro-inspired brick-breaking game that merges familiar action with unique twists and a modern crafted production approach. [Steam]"}, {"name": "Vanquish", "details_link": "https://www.metacritic.com/game/playstation-3/vanquish", "publisher": "Sega", "release_date": "Oct 19 2010", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 84, "users_score": 9.5, "image": "https://static.metacritic.com/images/products/games/2/0b7ff9cdc095a2869216fdc0fe27eabb-98.jpg", "descriptions": "Directed by Shinji Mikami, VANQUISH is a sci-fi shooter of epic proportions with a fast, fluid and frenetic combat system, and an engaging and immersive storyline. Players take the role of Sam, a government agent kitted out with a futuristic battle suit, in a near future world where nationsDirected by Shinji Mikami, VANQUISH is a sci-fi shooter of epic proportions with a fast, fluid and frenetic combat system, and an engaging and immersive storyline. Players take the role of Sam, a government agent kitted out with a futuristic battle suit, in a near future world where nations war over the planet's remaining energy resources. A versatile fighter with a huge arsenal of weaponry at his disposal, Sam also has an array of martial arts skills that he can use to take down his robot enemies.    … Expand"}, {"name": "Tiger Woods PGA Tour 09", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-09", "publisher": "Electronic Arts", "release_date": "Aug 26 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/8caaed2ee5f55555f3592df76f997c43-98.jpg", "descriptions": "This year's Tiger features dynamic, personalized gameplay via Tiger Woods' personal coach, Hank Haney. Looking to drive the ball long and straight? Trying to nail the pin with the approach shot? An all-new addition to this year’s game, Haney will assist gamers as they hit the links and tryThis year's Tiger features dynamic, personalized gameplay via Tiger Woods' personal coach, Hank Haney. Looking to drive the ball long and straight? Trying to nail the pin with the approach shot? An all-new addition to this year’s game, Haney will assist gamers as they hit the links and try to advance their career to win the FedExCup.  In Tiger Woods PGA Tout 09, a player's skill level is dynamic, constantly adjusting throughout the round just as it would during a real afternoon out on the links.  Following each round, Haney will deliver customized feedback on a player's performance. This feedback system allows all gamers, rookies or PGA TOUR pros, to compete and enjoy the game at any level. EA SPORTS GamerNet is a ground-breaking online innovation that features a refined, easy-to-use interface in Tiger Woods PGA Tour 09. EA SPORTS GamerNet challenges, such as long drive, approach shots and putting will be delivered instantly throughout all game modes and players have the ability to post their challenges from the fairways. EA SPORTS GamerNet also features an all-new daily leaderboard and challenges customized to fit an individual's playing style. Online play has also been enhanced with Simultaneous Play. This all-new online engine gives up to four players the ability to play each hole at the same time, allowing players to get in a rhythm, swing when they are ready and make one round of golf even faster and more competitive than ever before possible. [Electronic Arts]… Expand"}, {"name": "It Takes Two", "details_link": "https://www.metacritic.com/game/switch/it-takes-two", "publisher": "Electronic Arts", "release_date": "Nov  4 2022", "developers": ["Hazelight"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "2 ", "genres": ["Action Adventure", "Linear"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/fe1ba3df2566f03759edd6f71c3f3b80-98.jpg", "descriptions": "From Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the criticallyFrom Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the critically acclaimed A Way Out and Brothers: A Tale of Two Sons.\r Something out of the ordinary\rBring your favorite co-op partner and together step into the shoes of May and Cody. As the couple is going through a divorce, through unknown means their minds are transported into two dolls which their daughter, Rose, made to represent them. Now they must reluctantly find a way to get back into their bodies, a quest which takes them through the most wild, unexpected and fantastical journey imaginable.… Expand"}, {"name": "Shin Megami Tensei IV: Apocalypse", "details_link": "https://www.metacritic.com/game/3ds/shin-megami-tensei-iv-apocalypse", "publisher": "Atlus", "release_date": "Sep 20 2016", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/331a90300769cba8f249e413a74ada00-98.jpg", "descriptions": "The story of Shin Megami Tensei IV: Apocalypse depicts the remnants of Tokyo, ravaged by a catastrophe. Demons and humans co-exist, but in this state, the remnants of humankind are just a prize being fought over by the higher deities. One lone Hunter, the game's protagonist, meets an earlyThe story of Shin Megami Tensei IV: Apocalypse depicts the remnants of Tokyo, ravaged by a catastrophe. Demons and humans co-exist, but in this state, the remnants of humankind are just a prize being fought over by the higher deities. One lone Hunter, the game's protagonist, meets an early demise and through a pact with a lesser god, is brought back to life in exchange for his pledge of servitude. From there, the protagonist allies with other Hunters in the ruins of post-apocalyptic Tokyo beginning a plot that crosses over with the events of the original Shin Megami Tensei IV. … Expand"}, {"name": "Star Wars: Battlefront II (2005)", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-battlefront-ii-2005", "publisher": "LucasArts", "release_date": "Nov  1 2005", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "32  Online", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 84, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/0/a6fde0aac723cbaa82603ab25a7dfa60-98.jpg", "descriptions": "Star Wars Battlefront II improves upon the original game's single-player experience with open-ended, mission-based objectives inspired from all six Star Wars films. The compelling storyline spans more than 12 new locations, many from Episode III, including volcanic Mustafar and the spaceStar Wars Battlefront II improves upon the original game's single-player experience with open-ended, mission-based objectives inspired from all six Star Wars films. The compelling storyline spans more than 12 new locations, many from Episode III, including volcanic Mustafar and the space battle above Coruscant. All-new classic movie moments complete the Star Wars Battlefront II experience, as players battle within the interior of the Death Star and visit Princess Leia’s blockade runner, the Tantive IV, as seen at the beginning of Episode IV A New Hope. In addition, at certain key moments within the battles, players can feel the Force as a Jedi. For the first time ever, Star Wars Battlefront II players can engage in space combat and, during the same battle, board enemy ships to attack from within. Starting on foot inside a capital ship, players can enter the spacecraft of their choice and travel into space to dogfight with the rival faction. From there, they can dock within the enemy’s capital ship, overtake the ship’s command posts, man its turrets to disable its shields and destroy it from within! Or, they can simply stay inside their own capital ship and defend it from attacks and enemy fire. The choice is theirs. The stellar online play that marked the original Star Wars Battlefront returns even bigger and better for Star Wars Battlefront II. Players can locate their buddies and track their stats as they battle alongside more players than ever (up to 24 on PS2, 32 on Xbox, 64 on Windows). [LucasArts]… Expand"}]