[
  {
    "name": "Deus Ex: Mankind Divided - A Criminal Past",
    "details_link": "https://www.metacritic.com/game/playstation-4/deus-ex-mankind-divided---a-criminal-past",
    "publisher": "Square Enix",
    "release_date": "Feb 23 2017",
    "developers": [
      "Eidos Montreal"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/4/2c31eb9415239d141f6b53f9b0770924-98.jpg",
    "descriptions": "Experience Adam Jensen’s first mission for TF29, set before the events of Mankind Divided. Posing as a convicted criminal, Jensen is transferred deep into a hostile, high-security prison for augmented felons. His mission: Track down and retrieve sensitive information from a fellow undercoverExperience Adam Jensen’s first mission for TF29, set before the events of Mankind Divided. Posing as a convicted criminal, Jensen is transferred deep into a hostile, high-security prison for augmented felons. His mission: Track down and retrieve sensitive information from a fellow undercover agent who has gone dark. Success will help the fight against terror around the world, but Jensen will need to confront a darker side to his role before the day is done.… Expand"
  },
  {
    "name": "Call of Duty: Advanced Warfare",
    "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-advanced-warfare",
    "publisher": "Activision",
    "release_date": "Nov  3 2014",
    "developers": [
      "Sledgehammer Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Modern",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/9/df54e33f655e8dd47f702fede5f7e915-98.jpg",
    "descriptions": "Call of Duty: Advanced Warfare predicts the powerful battlegrounds of the future, where both technology and tactics have taken steps to usher in a new era of combat for the franchise. Kevin Spacey is Jonathan Irons -- one of the most notorious men in the world -- shaping this chilling visionCall of Duty: Advanced Warfare predicts the powerful battlegrounds of the future, where both technology and tactics have taken steps to usher in a new era of combat for the franchise. Kevin Spacey is Jonathan Irons -- one of the most notorious men in the world -- shaping this chilling vision of the future of war. The game unfolds in a plausible future in which technological, telesis and today's military practices have converged with real world consequences. In this image of the future, Private Military Corporations have become the dominant armed forces for many countries who must outsource their military needs, redrawing borders and rewriting international law.  Irons, the founder and president of the world's largest PMC, Atlas Corporation, is at the vortex of these tectonic plates.\r Suit up for combat in exoskeletons that advance every facet of a soldier's battle readiness, enabling combatants to deploy with an advanced lethality and eliminating the need for specialization. Players tout enhanced player movement and verticality through boost jumps and grappling, covert cloaking abilities, and biomechanics that provide keen strength, awareness, endurance, and speed. With the advent of the exoskeleton and newly advanced armor and weaponry, every soldier commands tactical freedom in any terrain unlike ever before.… Expand"
  },
  {
    "name": "Grand Theft Auto V",
    "details_link": "https://www.metacritic.com/game/playstation-5/grand-theft-auto-v",
    "publisher": "Rockstar Games",
    "release_date": "Mar 15 2022",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 30 ",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 81,
    "users_score": 2.7,
    "image": "https://static.metacritic.com/images/products/games/8/18293e1f393d848c92a28382c833a6bf-98.jpg",
    "descriptions": "Los Santos: a sprawling sun-soaked metropolis full of self-help gurus, starlets and fading celebrities, once the envy of the Western world, now struggling to stay afloat in an era of economic uncertainty and cheap reality TV. Amidst the turmoil, three very different criminals plot their ownLos Santos: a sprawling sun-soaked metropolis full of self-help gurus, starlets and fading celebrities, once the envy of the Western world, now struggling to stay afloat in an era of economic uncertainty and cheap reality TV. Amidst the turmoil, three very different criminals plot their own chances of survival and success: Franklin, a street hustler looking for real opportunities and serious money; Michael, a professional ex-con whose retirement is a lot less rosy than he hoped it would be; and Trevor, a violent maniac driven by the chance of a cheap high and the next big score. Running out of options, the crew risks everything in a series of daring and dangerous heists that could set them up for life.\r The biggest, most dynamic and most diverse open world ever created, Grand Theft Auto V blends storytelling and gameplay in new ways as players repeatedly jump in and out of the lives of the game's three lead characters, playing all sides of the game's interwoven story.\r All the classic hallmarks of the groundbreaking series return, including incredible attention to detail and Grand Theft Auto's darkly humorous take on modern culture, alongside a brand new and ambitious approach to open world multiplayer.… Expand"
  },
  {
    "name": "Diablo II: Resurrected",
    "details_link": "https://www.metacritic.com/game/playstation-5/diablo-ii-resurrected",
    "publisher": "Activision",
    "release_date": "Sep 23 2021",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 81,
    "users_score": 4.0,
    "image": "https://static.metacritic.com/images/products/games/7/cf70a83970e4bc00ac933583e94bf838-98.jpg",
    "descriptions": "Diablo® II: Resurrected™ is a remastered version of the quintessential action RPG Diablo® II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal. Features: Remastered graphics—monsters, heroes, items,Diablo® II: Resurrected™ is a remastered version of the quintessential action RPG Diablo® II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal. Features: Remastered graphics—monsters, heroes, items, spells, all resurrected. An epic story told through five distinct acts. Classic gameplay—the same Diablo II you know and love, preserved. Updated Battle.net support. Planned support for cross-progression—take your progress wherever you play. Diablo II: Resurrected includes all content from both Diablo II and its epic expansion Diablo II: Lord of Destruction®. Battle your way through icy caverns, horrific tombs filled with undead abominations, and frozen wastelands to the frigid summit of Mount Arreat and stop Baal, the Lord of Destruction. Raise hell with two Lord of Destruction playable classes—the cunning Assassin, master of traps and shadow disciplines, and the savage Druid, a bold shapeshifter and summoner who commands primal elemental magic.… Expand"
  },
  {
    "name": "Star Wars Jedi: Fallen Order",
    "details_link": "https://www.metacritic.com/game/xbox-one/star-wars-jedi-fallen-order",
    "publisher": "Electronic Arts",
    "release_date": "Nov 15 2019",
    "developers": [
      "Respawn Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/869cf8d1ac7cb9bbca5ca0d11fe14bbb-98.jpg",
    "descriptions": "A third-person action-adventure Star Wars title from Respawn Entertainment. The Empire seeks to eradicate all Jedi after the execution of Order 66. You, a Jedi Padawan-turned-fugitive, must fight for your survival as you explore the mysteries of a long-extinct civilization in hopes ofA third-person action-adventure Star Wars title from Respawn Entertainment. The Empire seeks to eradicate all Jedi after the execution of Order 66. You, a Jedi Padawan-turned-fugitive, must fight for your survival as you explore the mysteries of a long-extinct civilization in hopes of rebuilding the Jedi Order. After narrowly escaping the Jedi purge, you’re on a quest to rebuild your fallen Order. Pick up the pieces of your shattered past and complete your Jedi training, all while staying one step ahead of the Empire and its deadly Inquisitors. Utilize your Jedi training to overcome your opponents and solve the mysteries that lay in your path. Use the Force to augment the way you explore, allowing you to traverse new paths and discover parts of locations you’ve been to before. Move quickly, though. The Empire is on your trail and won’t stop until every Jedi is exterminated. [Electronic Arts]… Expand"
  },
  {
    "name": "Star Wars Jedi: Fallen Order",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-jedi-fallen-order",
    "publisher": "Electronic Arts",
    "release_date": "Nov 15 2019",
    "developers": [
      "Respawn Entertainment"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/080339ee20096c0852df9cefab079113-98.jpg",
    "descriptions": "A third-person action-adventure Star Wars title from Respawn Entertainment. The Empire seeks to eradicate all Jedi after the execution of Order 66. You, a Jedi Padawan-turned-fugitive, must fight for your survival as you explore the mysteries of a long-extinct civilization in hopes ofA third-person action-adventure Star Wars title from Respawn Entertainment. The Empire seeks to eradicate all Jedi after the execution of Order 66. You, a Jedi Padawan-turned-fugitive, must fight for your survival as you explore the mysteries of a long-extinct civilization in hopes of rebuilding the Jedi Order. After narrowly escaping the Jedi purge, you’re on a quest to rebuild your fallen Order. Pick up the pieces of your shattered past and complete your Jedi training, all while staying one step ahead of the Empire and its deadly Inquisitors. Utilize your Jedi training to overcome your opponents and solve the mysteries that lay in your path. Use the Force to augment the way you explore, allowing you to traverse new paths and discover parts of locations you’ve been to before. Move quickly, though. The Empire is on your trail and won’t stop until every Jedi is exterminated. [Electronic Arts]… Expand"
  },
  {
    "name": "Capcom Classics Collection",
    "details_link": "https://www.metacritic.com/game/xbox/capcom-classics-collection",
    "publisher": "Capcom",
    "release_date": "Sep 27 2005",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": "Xbox",
    "num_players": "1-3 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 81,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/0/d64dc63b1d8d64b969bae01e5ea85ffb-98.jpg",
    "descriptions": "Capcom serves up a collection of classic games in Capcom Classics Collection. You can relive more than 20 classic titles including 1942, Final Fight, Ghosts 'n Goblins, and Commando. The games can be played in either one- or two-player mode. Capcom Classics Collection also includes bonusCapcom serves up a collection of classic games in Capcom Classics Collection. You can relive more than 20 classic titles including 1942, Final Fight, Ghosts 'n Goblins, and Commando. The games can be played in either one- or two-player mode. Capcom Classics Collection also includes bonus material, such as remixed soundtracks, game tips, and original artwork.… Expand"
  },
  {
    "name": "Rising Storm 2: Vietnam",
    "details_link": "https://www.metacritic.com/game/pc/rising-storm-2-vietnam",
    "publisher": "Tripwire Interactive",
    "release_date": "May 30 2017",
    "developers": [
      "Antimatter Games"
    ],
    "platforms": "PC",
    "num_players": "Up to 64 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 81,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/2/b411d494219bdb5f93f99d125d454119-98.jpg",
    "descriptions": "Red Orchestra Series' take on Vietnam: 64-player MP matches; 16-player Skirmish; M16, M79, Hueys and Attack Helicopters; the AK, Double-Barrel Shotguns, Toe-Popper Mines, Tripwires, Tunnels and more. Brutal. Authentic. Gritty. Character customization. And napalm in the morning."
  },
  {
    "name": "Alien: Isolation",
    "details_link": "https://www.metacritic.com/game/pc/alien-isolation",
    "publisher": "Sega",
    "release_date": "Oct  6 2014",
    "developers": [
      "Creative Assembly"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "General",
      "Survival"
    ],
    "meta_score": 81,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/9/d876232a045eea0c32f79efaf37adf32-98.jpg",
    "descriptions": "Alien: Isolation is a first-person survival horror game which captures the fear and tension evoked by Ridley Scott’s 1979 classic film. Players find themselves in an atmosphere of constant dread and mortal danger as an unpredictable, ruthless Xenomorph is stalking and killing deep in theAlien: Isolation is a first-person survival horror game which captures the fear and tension evoked by Ridley Scott’s 1979 classic film. Players find themselves in an atmosphere of constant dread and mortal danger as an unpredictable, ruthless Xenomorph is stalking and killing deep in the shadows. Underpowered and underprepared, you must scavenge resources, improvise solutions and use your wits, not just to succeed in your mission, but to simply stay alive.… Expand"
  },
  {
    "name": "Phantom Dust",
    "details_link": "https://www.metacritic.com/game/xbox/phantom-dust",
    "publisher": "Majesco Games",
    "release_date": "Mar 15 2005",
    "developers": [
      "Microsoft Game Studios Japan"
    ],
    "platforms": "Xbox",
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Sci-Fi"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/3/e9092507e6e3644198bc8f3c573bc1cd-98.jpg",
    "descriptions": "Hidden underground for most of your life, you emerge to the surface to explore your supernatural abilities. In a postapocalyptic world rife with monsters and mysterious particles known as \"phantom dust,\" it's up to you to defeat your opponents using your psychic powers, skills, andHidden underground for most of your life, you emerge to the surface to explore your supernatural abilities. In a postapocalyptic world rife with monsters and mysterious particles known as \"phantom dust,\" it's up to you to defeat your opponents using your psychic powers, skills, and strategies. Use each level's destructible environments to crush your enemies. Phantom Dust features both single-player and multiplayer modes, including online play via Xbox Live.… Expand"
  },
  {
    "name": "The Witcher",
    "details_link": "https://www.metacritic.com/game/pc/the-witcher",
    "publisher": "Atari",
    "release_date": "Oct 30 2007",
    "developers": [
      "CD Projekt Red Studio"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 81,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/d43da57614154d1fb767024e4819f092-98.jpg",
    "descriptions": "The Witcher combines spectacular and visually stunning action with deep and intriguing storyline. The game is set in a world created by best-selling Polish author Andrzej Sapkowski. The world shares many common features with other fantasy lands, but there are also some distinguishingThe Witcher combines spectacular and visually stunning action with deep and intriguing storyline. The game is set in a world created by best-selling Polish author Andrzej Sapkowski. The world shares many common features with other fantasy lands, but there are also some distinguishing elements setting it apart from others. The game features the player as a \"Witcher\", a warrior who has been trained to fight since childhood, subjected to mutations and trials that transformed him. He earns his living killing monsters and is a member of a brotherhood founded long ago to protect people from werewolves, the undead, and a host of other beasts. It's an action oriented, visually stunning, easy to use, single player RPG, with a deep and intriguing storyline. [CD Projekt]… Expand"
  },
  {
    "name": "Unravel Two",
    "details_link": "https://www.metacritic.com/game/xbox-one/unravel-two",
    "publisher": "Electronic Arts",
    "release_date": "Jun  9 2018",
    "developers": [
      "Coldwood Interactive"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 81,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/3/1e8db47abaf31f0ac99c49477a6e8e0a-98.jpg",
    "descriptions": "In Unravel 2, you play as two Yarnys (tiny magical creatures made of yarn and joined by a thread) in a puzzle-platforming adventure. Run, jump, swing, and solve your way through a world of natural beauty and shadowy dangers, either on your own or with a friend in local co-op."
  },
  {
    "name": "Overcooked! 2",
    "details_link": "https://www.metacritic.com/game/switch/overcooked!-2",
    "publisher": "Team17",
    "release_date": "Aug  7 2018",
    "developers": [
      "Ghost Town Games Ltd."
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/7/d4a06f22bfd2e8746816b69b084da71a-98.jpg",
    "descriptions": "Overcooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:\n\n* Online/LocalOvercooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:* Online/Local Multiplayer Madness - You'll knead to work together to get the highest score in chaotic local and online multiplayer.* Feast Your Eyes On This - Cook in new kitchens ranging from sushi restaurants, magic schools and mines!* Romaine Calm! - Travel through teleporters, across moving platforms and save time by throwing ingredients across dynamic kitchens that shift and evolve.* Whet Your Appetite! - Cook up a range of new recipes including sushi, cakes, burgers and pizzas.… Expand"
  },
  {
    "name": "Phoenix Wright: Ace Attorney Trilogy",
    "details_link": "https://www.metacritic.com/game/3ds/phoenix-wright-ace-attorney-trilogy",
    "publisher": "Capcom",
    "release_date": "Dec  9 2014",
    "developers": [
      "NATSUME ATARI Inc."
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "3DS"
    ],
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 81,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/50ef4583b738467d77ad7cdc1112a0ac-98.jpg",
    "descriptions": "Prepare for intense courtroom showdowns by investigating crime scenes, collecting evidence, and questioning witnesses."
  },
  {
    "name": "Kentucky Route Zero - Act I",
    "details_link": "https://www.metacritic.com/game/pc/kentucky-route-zero---act-i",
    "publisher": "Cardboard Computer",
    "release_date": "Jan  7 2013",
    "developers": [
      "Cardboard Computer"
    ],
    "platforms": "PC",
    "genres": [
      "Adventure",
      "General",
      "General"
    ],
    "meta_score": 81,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/6/b868aaf076b781319567ab421b7dcea3-98.jpg",
    "descriptions": "Kentucky Route Zero is a magical realistic adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it."
  },
  {
    "name": "Ghostrunner",
    "details_link": "https://www.metacritic.com/game/pc/ghostrunner",
    "publisher": "505 Games",
    "release_date": "Oct 27 2020",
    "developers": [
      "ONE MORE LEVEL"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Adventure",
      "General",
      "Platformer",
      "3D"
    ],
    "meta_score": 81,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/3/92b24306ee51711974b30ff7e7bd824a-98.jpg",
    "descriptions": "Ghostrunner is a hardcore FPP slasher packed with lightning-fast action, set in a grim, cyberpunk megastructure. Climb Dharma Tower, humanity’s last shelter, after a world-ending cataclysm. Make your way up from the bottom to the top, confront the tyrannical Keymaster, and take your revenge.Ghostrunner is a hardcore FPP slasher packed with lightning-fast action, set in a grim, cyberpunk megastructure. Climb Dharma Tower, humanity’s last shelter, after a world-ending cataclysm. Make your way up from the bottom to the top, confront the tyrannical Keymaster, and take your revenge. The streets of this tower city are full of violence. Mara the Keymaster rules with an iron fist and little regard for human life. As resources diminish, the strong prey on the weak and chaos threatens to consume what little order remains. The decisive last stand is coming. A final attempt to set things right before mankind goes over the edge of extinction. As the most advanced blade fighter ever created, you’re always outnumbered but never outclassed. Slice your enemies with a monomolecular katana, dodge bullets with your superhuman reflexes, and employ a variety of specialized techniques to prevail. One-hit one-kill mechanics make combat fast and intense. Use your superior mobility (and frequent checkpoints!) to engage in a never-ending dance with death fearlessly. Ghostrunner offers a unique single-player experience: fast-paced, violent combat, and an original setting that blends science fiction with post-apocalyptic themes. It tells the story of a world that has already ended and its inhabitants who fight to survive.… Expand"
  },
  {
    "name": "Call of Duty: Black Ops II",
    "details_link": "https://www.metacritic.com/game/wii-u/call-of-duty-black-ops-ii",
    "publisher": "Activision",
    "release_date": "Nov 18 2012",
    "developers": [
      "Treyarch"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Wii U"
    ],
    "num_players": "Up to 18 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Modern",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/fce1ecaa2aff1c70b6af0de289457a55-98.jpg",
    "descriptions": "Black Ops II makes use of Wii U’s second-screen including the ability to view multiplayer maps, call in score streaks and choose load-outs. Players have the option to use Wii U’s split-screen functions to use both the GamePad and the Wii U Pro Controller. Use the GamePad touch screen toBlack Ops II makes use of Wii U’s second-screen including the ability to view multiplayer maps, call in score streaks and choose load-outs. Players have the option to use Wii U’s split-screen functions to use both the GamePad and the Wii U Pro Controller. Use the GamePad touch screen to customize controls in real-time, or switch at any time to use another controller of your choice. Set in a potential near-future, the game thrusts players into a visual landscape in an epic single player campaign highlighted by branching story lines and non-linear missions; a revamped multiplayer introduces players to progressive weaponry and equipment that 2025 might have to offer; and punched up with an all-new Zombies experience running in the multiplayer engine.… Expand"
  },
  {
    "name": "The Entropy Centre",
    "details_link": "https://www.metacritic.com/game/playstation-5/the-entropy-centre",
    "publisher": "Playstack",
    "release_date": "Nov  3 2022",
    "developers": [
      "Stubby Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/8/efe257701cc198634fcb17df4c45e42e-98.jpg",
    "descriptions": "An extinction level event has set the world ablaze. You appear to be the last remaining person alive. Mankind's only hope lies at the core of the Entropy Centre.The Entropy Centre is a mind-bending puzzle adventure where you reverse objects through time to overcome seemingly impossibleAn extinction level event has set the world ablaze. You appear to be the last remaining person alive. Mankind's only hope lies at the core of the Entropy Centre.The Entropy Centre is a mind-bending puzzle adventure where you reverse objects through time to overcome seemingly impossible obstacles and conundrums.Manipulate time to your will and solve ingeniously challenging puzzle rooms, each one taking you closer to the heart of a colossal space station in orbit of Earth.Deviously challenging with razor-sharp witty writing and outstanding voice acting performances, The Entropy Centre merges a brilliant puzzle game with an epic adventure.… Expand"
  },
  {
    "name": "Cotton Reboot!",
    "details_link": "https://www.metacritic.com/game/switch/cotton-reboot!",
    "publisher": "ININ Games",
    "release_date": "Jul 20 2021",
    "developers": [
      "Rocket-Engine Co.,Ltd.",
      "Sangatu Usagi no Mori"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Horizontal"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/5/14bb2c347fdafd2bf10903a74e18c54d-98.jpg",
    "descriptions": "Japan's favorite shooter mascot finally gets a worldwide release as a beautiful HD game with stunning graphics and remixed soundtracks. This is the original \"Cute em' up\", and will test your skills as well as tug on the heartstrings as Cotton and her friends are finally back in theJapan's favorite shooter mascot finally gets a worldwide release as a beautiful HD game with stunning graphics and remixed soundtracks. This is the original \"Cute em' up\", and will test your skills as well as tug on the heartstrings as Cotton and her friends are finally back in the ultimate celebration of one of Japan's most beloved gaming mascots. Choose between the HD Reboot mode or go legit with the X68000 original mode with pixel perfect graphics from the iconic Japanese home computer.… Expand"
  },
  {
    "name": "Jet Lancer",
    "details_link": "https://www.metacritic.com/game/switch/jet-lancer",
    "publisher": "Armor Games",
    "release_date": "May 12 2020",
    "developers": [
      "Vladimir Fedyushkin"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 81,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/2c7eb07bd678a89be27ec0e89d73313b-98.jpg",
    "descriptions": "Jet Lancer is a high-velocity aerial combat shooter where you duel enemy aviators, hunt giant robots, and defy death at supersonic speeds. You are Ash Leguinn: badass pilot, highly paid mercenary, and flight-school drop out. Your day job is fine - the daily grind of dealing with Sky PiratesJet Lancer is a high-velocity aerial combat shooter where you duel enemy aviators, hunt giant robots, and defy death at supersonic speeds. You are Ash Leguinn: badass pilot, highly paid mercenary, and flight-school drop out. Your day job is fine - the daily grind of dealing with Sky Pirates pays the bills - but nothing compares to the rush of demolishing a ninety-ton mechanical monstrosity at the speed of sound. And you’ll have your chance. As mechanized weapons converge on Root City, you’ll have to be at the top of your game to survive, and you’ll have to surpass your limits if you want to save the world.… Expand"
  },
  {
    "name": "Hunt: Showdown",
    "details_link": "https://www.metacritic.com/game/playstation-4/hunt-showdown",
    "publisher": "Crytek",
    "release_date": "Feb 18 2020",
    "developers": [
      "Crytek"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Sci-Fi",
      "Third-Person",
      "Arcade",
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 81,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/5/d2b3a40884c248dab062f9af280c20ad-98.jpg",
    "descriptions": "You and your partner are members of a secret hunting society that tracks and kills creatures. The bounties are high, but so are the risks. The smallest mistake will cost you everything—your bounty, your gear, your life, and your very soul. Some hunt for wealth, some for power. Some hunt toYou and your partner are members of a secret hunting society that tracks and kills creatures. The bounties are high, but so are the risks. The smallest mistake will cost you everything—your bounty, your gear, your life, and your very soul. Some hunt for wealth, some for power. Some hunt to protect others, some hunt for glory. You must track your quarry through a dark and treacherous world. Winner takes all. Fail, and go straight to hell.… Expand"
  },
  {
    "name": "Aviary Attorney: Definitive Edition",
    "details_link": "https://www.metacritic.com/game/switch/aviary-attorney-definitive-edition",
    "publisher": "Vertical Reach",
    "release_date": "Jan 30 2020",
    "developers": [
      "Sketchy Logic"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/c11808b7d71f42a2f084108d4573d239-98.jpg",
    "descriptions": "Take yourself back to 1848 in Aviary Attorney: Definitive Edition. Paris is on the brink of yet another revolution, and the prisons are overflowing with guilty and innocent alike."
  },
  {
    "name": "Frog Detective 2: The Case of the Invisible Wizard",
    "details_link": "https://www.metacritic.com/game/pc/frog-detective-2-the-case-of-the-invisible-wizard",
    "publisher": "worm club",
    "release_date": "Dec  9 2019",
    "developers": [
      "Grace Bruxner"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/8/4acec447b696b26a4876a8c4a72295fa-98.jpg",
    "descriptions": "You're a detective, and a frog, and it's time to solve a mystery. Also there's a wizard."
  },
  {
    "name": "The Elder Scrolls Online: Dragonhold",
    "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-online-dragonhold",
    "publisher": "ZeniMax Media",
    "release_date": "Oct 21 2019",
    "developers": [
      "ZeniMax Media"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer"
    ],
    "meta_score": 81,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/5/8ea030e8b2bc5b7b2e5a032cab3d8953-98.jpg",
    "descriptions": "The Season of the Dragon culminates with Dragonhold, the latest DLC game pack for The Elder Scrolls Online! Venture into Southern Elsweyr, restore the ancient Dragonguard order, and help Sai Sahan put an end to the Dragon threat once and for all."
  },
  {
    "name": "Irony Curtain: From Matryoshka with Love",
    "details_link": "https://www.metacritic.com/game/pc/irony-curtain-from-matryoshka-with-love",
    "publisher": "Artifex Mundi",
    "release_date": "May 16 2019",
    "developers": [
      "Artifex Mundi"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/6/23cc1e6f5e30cb0a1c35df328c7ae253-98.jpg",
    "descriptions": "Irony Curtain: From Matryoshka with Love is a satirical point and click inspired by the classic adventure games. It smuggles you out of your comfort zone and throws you into the middle of a Cold War spy intrigue - where there’s an even bigger game being played..."
  },
  {
    "name": "Unruly Heroes",
    "details_link": "https://www.metacritic.com/game/pc/unruly-heroes",
    "publisher": "Magic Design Studios",
    "release_date": "Jan 23 2019",
    "developers": [
      "Magic Design Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 81,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/2/51fb0630b0612a3698374c9e8156b08f-98.jpg",
    "descriptions": "Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players,Unruly Heroes is an action-adventure game inspired by the famous chinese legend ‘A journey to the west’ better known as the Monkey King Legend. Through this epic adventure, the game will make you live a fantastic and unforgettable experience. The game can be played in coop up to 4 players, but you can decide to play online in fierce Player vs Player modes. Who will be your favorite character?… Expand"
  },
  {
    "name": "Lone Survivor: The Director's Cut",
    "details_link": "https://www.metacritic.com/game/playstation-vita/lone-survivor-the-directors-cut",
    "publisher": "Curve Studios",
    "release_date": "Sep 24 2013",
    "developers": [
      "Curve Studios",
      "superflat games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Wii U",
      "PlayStation Vita"
    ],
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/0c99f96eecb8545f7a1642ad019f1b34-98.jpg",
    "descriptions": "Lone Survivor is a psychological survival adventure game which has taken elements from classic adventure games and the best elements of the survival horror genre to create something you haven’t seen before. You can expect scares, scarcity of ammo and exploration of surreal and atmosphericLone Survivor is a psychological survival adventure game which has taken elements from classic adventure games and the best elements of the survival horror genre to create something you haven’t seen before. You can expect scares, scarcity of ammo and exploration of surreal and atmospheric environments to be a big part of the game, but there’s also an element of psychological horror and choice that often isn’t explored in modern survival horror titles. [Playstation.com]… Expand"
  },
  {
    "name": "Strong Bad's Cool Game for Attractive People Episode 4: Dangeresque 3: The Criminal Projective",
    "details_link": "https://www.metacritic.com/game/wii/strong-bads-cool-game-for-attractive-people-episode-4-dangeresque-3-the-criminal-projective",
    "publisher": "Telltale Games",
    "release_date": "Nov 17 2008",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "PC",
      "Wii"
    ],
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Adventure",
      "General",
      "Compilation"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/c46806e1fc7140ae19ac528dc39b3239-98.jpg",
    "descriptions": "[WiiWare]  Move over, generically buff action heroes. Strong Bad is here to show you how it's done in his hand-crafted cinematic masterpiece, Dangeresque 3: The Criminal Projective. You play Dangeresque, a dirty cop in pursuit of a little action and several big sacks of cash. Can our hero[WiiWare]  Move over, generically buff action heroes. Strong Bad is here to show you how it's done in his hand-crafted cinematic masterpiece, Dangeresque 3: The Criminal Projective. You play Dangeresque, a dirty cop in pursuit of a little action and several big sacks of cash. Can our hero stay alive long enough to defeat his arch-nemesis, save the world and get the girl? Looks like he's gonna have to jump. [TellTale Games]… Expand"
  },
  {
    "name": "Stygian: Reign of the Old Ones",
    "details_link": "https://www.metacritic.com/game/pc/stygian-reign-of-the-old-ones",
    "publisher": "Cultic Games",
    "release_date": "Sep 26 2019",
    "developers": [
      "Cultic Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/2/31429a16740d5a2bf24ea93f806b5d42-98.jpg",
    "descriptions": "Delve into a role-playing game of horror, loss and madness set in the strange worlds of HP Lovecraft. Stygian: Reign of the Old Ones offers a mix of rich role-playing and turn-based tactical combat, represented in an illustrative visual style. Can you find salvation in a dead world?"
  },
  {
    "name": "Dishonored: The Brigmore Witches",
    "details_link": "https://www.metacritic.com/game/xbox-360/dishonored-the-brigmore-witches",
    "publisher": "Bethesda Softworks",
    "release_date": "Aug 13 2013",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 81,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/532fff234e51597fdd2c4c1bd6a139e7-98.jpg",
    "descriptions": "In The Brigmore Witches, continue your journey as the legendary assassin, Daud, and bring his twisted narrative that began with The Knife of Dunwall to a close. After discovering the identity and intentions of Delilah, the leader of the Brigmore Witch coven, you set out to disrupt her fromIn The Brigmore Witches, continue your journey as the legendary assassin, Daud, and bring his twisted narrative that began with The Knife of Dunwall to a close. After discovering the identity and intentions of Delilah, the leader of the Brigmore Witch coven, you set out to disrupt her from completing a powerful ritual that will spell your doom. Having already been betrayed by your lieutenant, Billie Lurk, you must rely on feuding gang factions-the Dead Eels and the Hatters-to negotiate your way through previously unseen districts of Dunwall en route to Delilah's stronghold.  Regardless of the way you reach your destination, one thing is for certain - you will finally answer for your treacherous actions and fall before the mercy, or punishment, of the Royal Bodyguard and Assassin, Corvo Attano. Additionally, your power, weapon and item upgrades, Chaos level, and player actions from The Knife of Dunwall will carry over via a compatible save file option.… Expand"
  },
  {
    "name": "Life is Strange: Episode 3 - Chaos Theory",
    "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-episode-3---chaos-theory",
    "publisher": "Square Enix",
    "release_date": "May 19 2015",
    "developers": [
      "DONTNOD Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/fc9d97a6f717679e3336fc0baf71e23e-98.jpg",
    "descriptions": "In the third installment of Life is Strange, Max & Chloe ramp up their investigation to find out what exactly is going on at Blackwell Academy and the whereabouts of Rachel Amber. Secrets will be uncovered and Max will find another use for her power."
  },
  {
    "name": "Virtua Fighter 5 Final Showdown",
    "details_link": "https://www.metacritic.com/game/xbox-360/virtua-fighter-5-final-showdown",
    "publisher": "Sega",
    "release_date": "Jun  6 2012",
    "developers": [
      "Sega AM2"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "3D"
    ],
    "meta_score": 81,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/6/5eaa8cbbb986559ec280cff42ba7725f-98.jpg",
    "descriptions": "Virtua Fighter 5 Final Showdown contains the definitive version of VF5, refined over the years since its original arcade debut. This new release also adds a significant list of features not previously seen on consoles. Showdown contains a complete overhaul of Virtua Fighter 5's mechanics,Virtua Fighter 5 Final Showdown contains the definitive version of VF5, refined over the years since its original arcade debut. This new release also adds a significant list of features not previously seen on consoles. Showdown contains a complete overhaul of Virtua Fighter 5's mechanics, balance and animations, along with new game modes, new dynamic fighting arenas, a large collection of customizable character items and new characters added to the roster. … Expand"
  },
  {
    "name": "Life is Strange: Before the Storm - Episode 3: Hell is Empty",
    "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-before-the-storm---episode-3-hell-is-empty",
    "publisher": "Square Enix",
    "release_date": "Dec 20 2017",
    "developers": [
      "Deck Nine Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/6/3fdc781251c99236233376d96aa16b04-98.jpg",
    "descriptions": null
  },
  {
    "name": "Mega Man Zero 2",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-zero-2",
    "publisher": "Capcom",
    "release_date": "Oct 14 2003",
    "developers": [
      "Inti"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 81,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/1efbc7b782b666655cd188857223b4f2-98.jpg",
    "descriptions": "In Mega Man Zero 2, Zero falls prey to a trap set by Neo Arcadia's ruthless commander, who plans to use Zero to end the peace between reploids and humans. As Zero, you must battle through a variety of levels and challenges to make sure the commander doesn't succeed. A newIn Mega Man Zero 2, Zero falls prey to a trap set by Neo Arcadia's ruthless commander, who plans to use Zero to end the peace between reploids and humans. As Zero, you must battle through a variety of levels and challenges to make sure the commander doesn't succeed. A new weapon-customization system lets you adjust the game-level difficulty. The game new features also include a Cyber-Elf collection system, two-player mode, temporary save features, and a tutorial mission.… Expand"
  },
  {
    "name": "Major League Baseball 2K5",
    "details_link": "https://www.metacritic.com/game/xbox/major-league-baseball-2k5",
    "publisher": "Take-Two Interactive",
    "release_date": "Feb 23 2005",
    "developers": [
      "Kush Games"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Sim"
    ],
    "meta_score": 81,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/0/7df0e0e0d10f3317514ffaa013603278-98.jpg",
    "descriptions": "Major League Baseball 2K5 debuts On Command Baserunning, that includes active picture-in-picture baserunning, and new gameplay features called Maximum Sliding and Baseburner Mode. Active picture-in-picture baserunning delivers both an exciting presentation style and an intuitive method toMajor League Baseball 2K5 debuts On Command Baserunning, that includes active picture-in-picture baserunning, and new gameplay features called Maximum Sliding and Baseburner Mode. Active picture-in-picture baserunning delivers both an exciting presentation style and an intuitive method to precisely control runners. The new baserunning mechanic utilizes the right analog thumbstick to choose how baserunners slide -- head or feet first -- in conjunction with hook sliding left or right of the base. Players will be able to reach a base quicker, get up more quickly from a slide, or avoid being tagged out with the new freedom found in Maximum Sliding. Baseburner Mode allows the gamer to play any 'at-bat' through the perspective of any baserunner, delivering precision control to gamers.… Expand"
  },
  {
    "name": "Paradise Killer",
    "details_link": "https://www.metacritic.com/game/pc/paradise-killer",
    "publisher": "Fellow Traveller",
    "release_date": "Sep  4 2020",
    "developers": [
      "Kaizen Game Works"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 81,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/8/771dc7b4719993cda219e24dad4e9d76-98.jpg",
    "descriptions": "Paradise Island, a world outside reality. There’s been a murder that only \"investigation freak\" Lady Love Dies can solve. Gather evidence and interrogate suspects in this open world adventure. You can accuse anyone, but you’ll have to prove your case in trial to convict. It’s up to you toParadise Island, a world outside reality. There’s been a murder that only \"investigation freak\" Lady Love Dies can solve. Gather evidence and interrogate suspects in this open world adventure. You can accuse anyone, but you’ll have to prove your case in trial to convict. It’s up to you to decide who’s guilty.\r… Expand"
  },
  {
    "name": "MORDHAU",
    "details_link": "https://www.metacritic.com/game/pc/mordhau",
    "publisher": "Triternion",
    "release_date": "Apr 29 2019",
    "developers": [
      "Triternion"
    ],
    "platforms": "PC",
    "num_players": "Up to 64 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "MOBA"
    ],
    "meta_score": 81,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/deae04c5422a4f544aeb56e74a3e3202-98.jpg",
    "descriptions": "MORDHAU is a multiplayer medieval slasher. Create your mercenary and fight in brutal battles where you will experience fast paced combat, castle sieges, cavalry charges, and more."
  },
  {
    "name": "FAST Racing NEO",
    "details_link": "https://www.metacritic.com/game/wii-u/fast-racing-neo",
    "publisher": "Shin'en",
    "release_date": "Dec 10 2015",
    "developers": [
      "Shin'en"
    ],
    "platforms": "Wii U",
    "num_players": "Up to 8 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Futuristic"
    ],
    "meta_score": 81,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/8/ed6f33bd169fdda458a394b7e81964bb-98.jpg",
    "descriptions": "FAST Racing Neo is a futuristic racing title. Pick your favorite Anti-gravity vehicle and become a legend in the FAST Racing Neo league."
  },
  {
    "name": "Symphony of War: The Nephilim Saga",
    "details_link": "https://www.metacritic.com/game/pc/symphony-of-war-the-nephilim-saga",
    "publisher": "Freedom Games",
    "release_date": "Jun 10 2022",
    "developers": [
      "Dancing Dragon games"
    ],
    "platforms": "PC",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/82cfab6043c7e19f62016efd94c76f51-98.jpg",
    "descriptions": "Enter Tahnra, a land savaged by war. You, a fresh academy graduate with humble beginnings, will grow to lead a grand army against a corrupt adversary. Gather heroes, form bonds, and lead your force in turn-based battles. Make use of tactics, terrain, morale and more to bring peace to the land!"
  },
  {
    "name": "Faeria",
    "details_link": "https://www.metacritic.com/game/pc/faeria",
    "publisher": "Abrakam SA",
    "release_date": "Mar  8 2017",
    "developers": [
      "Abrakam SA"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Board / Card Game"
    ],
    "meta_score": 81,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/3/f01ccf6217f018055d572498c78a9e73-98.jpg",
    "descriptions": "Faeria combines the core values of Strategy Card Games together with a Living Board, giving you the ability to shape the board as you play to create mind-blowing strategies. Each game of Faeria is not only unique, beautiful and fast-paced but also highly competitive."
  },
  {
    "name": "Gunslugs",
    "details_link": "https://www.metacritic.com/game/playstation-vita/gunslugs",
    "publisher": "Abstraction Games",
    "release_date": "Feb 18 2014",
    "developers": [
      "Abstraction Games"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "Switch",
      "PlayStation Vita"
    ],
    "genres": [
      "Action",
      "General",
      "Platformer",
      "2D"
    ],
    "meta_score": 81,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/2/aad6d43d77837c99bbb2f66ed731bed4-98.jpg",
    "descriptions": "Gunslugs is the most chaotic, fun, arcade action game you'll find on any platform!  Non-stop action from the guys behind Meganoid, Meganoid 2 and Stardash !“There’s so much praise I want to ramble on about, but I’ll leave it at this: Gunslugs is a game you must get yourGunslugs is the most chaotic, fun, arcade action game you'll find on any platform!  Non-stop action from the guys behind Meganoid, Meganoid 2 and Stardash !“There’s so much praise I want to ramble on about, but I’ll leave it at this: Gunslugs is a game you must get your hands on” – Gamezebo“Fans of the run ’n gun genre need to check this out.” – 148apps\"“Gunslugs is again, another great game to add to OrangePixel’s roster. I don’t know how so many games are produced so fast but instead of the quality dropping, it’s always better and always different.” – Paranerds“retro graphics, perfect controls, great physics, [great] gameplay and loads of fun and entertainment.” – The App-Shack\"Basically, it’s everything you could ask for from a rampaging action game, all packed up in a neat little mobile release with ample amounts of retro-style visuals, music and secrets.” – JayIsGamesFEATURES* Random level generation - no 2 game sessions will be the same!* Unlockable characters* Thumping sound track* Fun variation of weapons* Tank driving!* Jetpack flying!* Secret levels* Objectives/achievements* Destruction* Chaos* Rain, snow, and big bad hell worms* Wizards, princesses, geeks, voodoo priests and many more surprises... !- Two player co-op mode is supported by use of the Joypad app… Expand"
  },
  {
    "name": "Jade Empire: Special Edition",
    "details_link": "https://www.metacritic.com/game/pc/jade-empire-special-edition",
    "publisher": "2K Games",
    "release_date": "Feb 26 2007",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/8/094a46bc6d978e0992ea19ddbade38da-98.jpg",
    "descriptions": "Step into the role of an aspiring martial arts master and follow the path of the Open Palm or Closed Fist. In this multi-award-winning action-RPG, your choices and actions will determine the fate of an empire. Will you prevent the destruction of this beautiful land or crush it beneath yourStep into the role of an aspiring martial arts master and follow the path of the Open Palm or Closed Fist. In this multi-award-winning action-RPG, your choices and actions will determine the fate of an empire. Will you prevent the destruction of this beautiful land or crush it beneath your heel? Are you a warrior who uses strength and fighting mastery to bring peace or will your power bring pain and ruin? Enhanced PC features include: Customizable, intuitive controls including support for game-pads and keyboard/mouse. Increased graphics resolutions and new visual effects. New monsters and enemies. New fighting styles. Improved combat AI and difficulty levels. New world map interface. Jade Empire: Special Edition is exclusively available for the PC and features increased graphic resolutions with new visual effects and fighting styles, as well as new monsters and enemies with enhanced AI. The game also includes customizable, intuitive controls and an all-new art book as part of the Special Edition bonus content. [BioWare]… Expand"
  },
  {
    "name": "Sensible World of Soccer",
    "details_link": "https://www.metacritic.com/game/xbox-360/sensible-world-of-soccer",
    "publisher": "Codemasters",
    "release_date": "Dec 19 2007",
    "developers": [
      "Codemasters"
    ],
    "platforms": "Xbox 360",
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 81,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/9/0be2b1a6ff2d627b5d5f0c68a1628f8c-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Sensible World of Soccer is the classic nineties soccer game reborn with enhanced graphics. Play against your friends online in this fantastic pick up and play soccer extravaganza. Experience all the excitement of a full season or enter into a quick game against your[Xbox Live Arcade]  Sensible World of Soccer is the classic nineties soccer game reborn with enhanced graphics. Play against your friends online in this fantastic pick up and play soccer extravaganza. Experience all the excitement of a full season or enter into a quick game against your friends. Want to be more hands-on? Manage your team over a full season with a fully immersive tactics editor to put yourself in control on the way to the title. Online play: Take on your friends online in this fun, fast-paced soccer game. Updated for Xbox LIVE Arcade: Play a fully updated Arcade version of this classic game. Classic and Enhanced modes: Play online with the graphics you remember, or with the new enhanced HD visuals. Retro experience: Utilizing the original '96/'97 code, widely recognized to be the best incarnation of the SWOS series, we are able to deliver an authentic, retro playing experience. [Codemasters]… Expand"
  },
  {
    "name": "Ashen",
    "details_link": "https://www.metacritic.com/game/pc/ashen",
    "publisher": "Annapurna Interactive",
    "release_date": "Dec  6 2018",
    "developers": [
      "A44"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action Adventure",
      "Action RPG",
      "Open-World"
    ],
    "meta_score": 81,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/2/3d330950ee49502a5f50e870e2ad9303-98.jpg",
    "descriptions": "Ashen is a 3rd person, action RPG about forging relationships. You are a lone wanderer in a sunless land. The only light to be had sputters from an age-old lantern at your side. There is a rumble in the distance, and then a light. Through leaking eyes you make out a peak on the horizon,Ashen is a 3rd person, action RPG about forging relationships. You are a lone wanderer in a sunless land. The only light to be had sputters from an age-old lantern at your side. There is a rumble in the distance, and then a light. Through leaking eyes you make out a peak on the horizon, choking the land in a cloud of ash. Nothing ever shone so bright. The first dawn turns to dusk and finally recedes into familiar blackness. A GAME BY AURORA44. This is the tale of a bygone world. Choose a path and hold on to those you trust. Players can choose to guide those they trust to their camp, encouraging them to rest at the fire and perhaps remain. Together, you might just stand a chance.… Expand"
  },
  {
    "name": "Mighty Milky Way",
    "details_link": "https://www.metacritic.com/game/ds/mighty-milky-way",
    "publisher": "WayForward",
    "release_date": "May  9 2011",
    "developers": [
      "WayForward"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Action"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/9/6e98fe3abe083523d7aee07694fefaa1-98.jpg",
    "descriptions": "Mighty Milky Way has players pulse some planets as they help Luna accomplish her secret mission."
  },
  {
    "name": "Shift 2: Unleashed",
    "details_link": "https://www.metacritic.com/game/playstation-3/shift-2-unleashed",
    "publisher": "Electronic Arts",
    "release_date": "Mar 29 2011",
    "developers": [
      "Slightly Mad Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 81,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/9/dded8a25bbea8d8ea685d35fe2a259c2-98.jpg",
    "descriptions": "Shift 2 Unleashed combines violence and excitement in this racing experience."
  },
  {
    "name": "NFL Street",
    "details_link": "https://www.metacritic.com/game/gamecube/nfl-street",
    "publisher": "EA Sports",
    "release_date": "Jan 13 2004",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/0/6ae8a912e42c3cdfb9fe3371a067b11b-98.jpg",
    "descriptions": "Get ready for a new brand of football meant only for the streets.  NFL Street delivers hard-hitting, fast-paced 7-on-7 arcade football.  Don't be afraid to add extra style to your bone-crushing tackles, passes and runs as you will be rewarded with superpowered Gamebreakers.  Choose from moreGet ready for a new brand of football meant only for the streets.  NFL Street delivers hard-hitting, fast-paced 7-on-7 arcade football.  Don't be afraid to add extra style to your bone-crushing tackles, passes and runs as you will be rewarded with superpowered Gamebreakers.  Choose from more than 300 current NFL stars and legends such as Barry Sanders, and play through a variety of fields including a beach, a park or a corner lot.  Get ready to rule the streets and look good doing it.… Expand"
  },
  {
    "name": "Time Crisis 3",
    "details_link": "https://www.metacritic.com/game/playstation-2/time-crisis-3",
    "publisher": "Namco",
    "release_date": "Oct 21 2003",
    "developers": [
      "Namco"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Light Gun"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/2/d370e7db26ae28f9a8ca15d151a4e07f-98.jpg",
    "descriptions": "The third installment in Namco's highly acclaimed light gun shooting franchise, Time Crisis 3 offers exciting, fast-paced shooting action by the world renown VSSE agents as they fight to save an innocent nation from total annihilation. GUNCON2 Shooting Action - the popular light gun is anThe third installment in Namco's highly acclaimed light gun shooting franchise, Time Crisis 3 offers exciting, fast-paced shooting action by the world renown VSSE agents as they fight to save an innocent nation from total annihilation. GUNCON2 Shooting Action - the popular light gun is an essential piece of equipment in the player's arsenal. New Weapons Select System ? players choose from four weapons (machine gun, handgun, shotgun, grenade) for optimal game play strategy. Sniper Combat ? intense and lethal sharpshooting action! Exclusive Features ? includes the original arcade game as well as a more complex story line, multiple game play modes and a new playable character. [Namco]… Expand"
  },
  {
    "name": "Pro Race Driver",
    "details_link": "https://www.metacritic.com/game/playstation-2/pro-race-driver",
    "publisher": "Codemasters",
    "release_date": "Dec  6 2002",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 81,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/01d64b8648950d5a5a7864e628e5441d-98.jpg",
    "descriptions": "[Also known as \"TOCA Race Driver\"] Ryan McKane, a test driver with gasoline running in his veins, spends his life struggling against his father's disappointment, while his brother's phenomenal racetrack success overshadows every minor victory he achieves. When his father perishes in an[Also known as \"TOCA Race Driver\"] Ryan McKane, a test driver with gasoline running in his veins, spends his life struggling against his father's disappointment, while his brother's phenomenal racetrack success overshadows every minor victory he achieves. When his father perishes in an octane-fuelled blaze of fire on the asphalt that he loved, Ryan's frustrated ambition galvanizes into a unrelenting determination to triumph over all opposition and become first a touring car champion, then maybe even World Champion. Petrolheads and mass market gamers alike slam the pedal to the metal to guide the actions of our hero through the hairpins and chicanes of a career in global racing. Features 42 licensed touring & race cars including Holden Commodore, Ford Falcon, Mercedes CLK, Alfa Romeo GTV and Viper GTS; 38 international circuits recreated under licence including Bathurst, Hockenheim and Silverstone; and 13 global Championships including official series: DTM from Germany, V8 Supercars from Australia and the Britsh Touring Car Championship. [Codemasters]… Expand"
  },
  {
    "name": "Time Crisis II",
    "details_link": "https://www.metacritic.com/game/playstation-2/time-crisis-ii",
    "publisher": "Namco",
    "release_date": "Oct  1 2001",
    "developers": [
      "Namco"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Light Gun"
    ],
    "meta_score": 81,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/b258596dc6accc2065694fc13c28afd7-98.jpg",
    "descriptions": "Two-player light gun action is here. Namco brings the arcade hit home, complete with GunCon2 for added excitement. Two player split-screen or link mode or One player double-gun mode. Includes extra game features for additional challenges. [Namco]"
  },
  {
    "name": "SWAT 3: Elite Edition",
    "details_link": "https://www.metacritic.com/game/pc/swat-3-elite-edition",
    "publisher": "Sierra Entertainment",
    "release_date": "Oct  6 2000",
    "developers": [
      "Sierra Entertainment"
    ],
    "platforms": "PC",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Tactical",
      "Modern"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/961a1749d191c6c351eaaedc3f6022a7-98.jpg",
    "descriptions": "This enhanced version of SWAT 3 includes multiplayer support, new weapons, new levels, and more."
  },
  {
    "name": "Asheron's Call",
    "details_link": "https://www.metacritic.com/game/pc/asherons-call",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 31 1999",
    "developers": [
      "Turbine Inc."
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Fantasy"
    ],
    "meta_score": 81,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/1/7d673b84eb4a582c13db61a5665ccf11-98.jpg",
    "descriptions": "Welcome to the online role-playing game Asheron's Call, where thousands of players inhabit a beautiful 3D fantasy world to make friends and seek out perilous adventure. Customize your alter ego with a unique appearance and balance of heroic skills, then enter a magical frontier of terribleWelcome to the online role-playing game Asheron's Call, where thousands of players inhabit a beautiful 3D fantasy world to make friends and seek out perilous adventure. Customize your alter ego with a unique appearance and balance of heroic skills, then enter a magical frontier of terrible monsters, breathtaking vistas, and fast alliances. With over 500 square miles that offer ever more wonders to explore, Asheron's Call gives you a world of unparalleled scope and freedom, the richest setting yet for creating your personal saga or joining your friends in an epic campaign. [Turbine]… Expand"
  },
  {
    "name": "Brave Fencer Musashi",
    "details_link": "https://www.metacritic.com/game/playstation/brave-fencer-musashi",
    "publisher": "Square EA",
    "release_date": "Oct 31 1998",
    "developers": [
      "SquareSoft"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 81,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/fc5030fcfdbb9e4ad97f887bec288041-98.jpg",
    "descriptions": "Brave Fencer Musashi has been summoned to stop an ancient evil force, to save the kingdom and rescue the princess.\rEmbark on a wild, comical, Action/RPG adventure in a massive 3-D world filled with platform-style action, two-fisted sword fighting, challenging puzzles, and scores of enemiesBrave Fencer Musashi has been summoned to stop an ancient evil force, to save the kingdom and rescue the princess.\rEmbark on a wild, comical, Action/RPG adventure in a massive 3-D world filled with platform-style action, two-fisted sword fighting, challenging puzzles, and scores of enemies whose skills Musashi can learn and use to his advantage. Locate five powerful magical scrolls to conquer the twisted Thirstquencher Empire.… Expand"
  },
  {
    "name": "Trauma Center: Under the Knife",
    "details_link": "https://www.metacritic.com/game/ds/trauma-center-under-the-knife",
    "publisher": "Atlus",
    "release_date": "Oct  4 2005",
    "developers": [
      "ITL"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Simulation",
      "General",
      "General",
      "Virtual",
      "Career"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/2/1857945709cb5483f0f8fe03d744c496-98.jpg",
    "descriptions": "Take your Nintendo DS into the Operating Room! Trauma Center: Under the Knife lets YOU play doctor, performing increasingly complex surgeries. At first it's just another day in the O.R., but when a mysterious outbreak sweeps the area, the patients' lives are in your hands--no pressure. TheTake your Nintendo DS into the Operating Room! Trauma Center: Under the Knife lets YOU play doctor, performing increasingly complex surgeries. At first it's just another day in the O.R., but when a mysterious outbreak sweeps the area, the patients' lives are in your hands--no pressure. The stylus will be your scalpel as you make incisions, anesthetize problem areas, remove tumors, monitor vital signs, apply bandages, and more! Of course, you'll also have to deal with human drama between appointments. Keep a cool head, or you'll be out on the street (and all those years of medical school for nothing). [Atlus USA]… Expand"
  },
  {
    "name": "Sakura Wars: So Long, My Love",
    "details_link": "https://www.metacritic.com/game/playstation-2/sakura-wars-so-long-my-love",
    "publisher": "NIS America",
    "release_date": "Mar 30 2010",
    "developers": [
      "RED Entertainment"
    ],
    "platforms": "PlayStation 2",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy"
    ],
    "meta_score": 81,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/2/b7b8ca590feee3f60fea840c5344789b-98.jpg",
    "descriptions": "Sakura Wars: So Long, My Love combines the epic battles of an RPG with the character interaction and development of a sim game in the free-roaming environment of 1920s New York City. Pilot mechs, perform in plays, and experience action and adventure in this Steampunk Extravaganza."
  },
  {
    "name": "Mario Golf: Toadstool Tour",
    "details_link": "https://www.metacritic.com/game/gamecube/mario-golf-toadstool-tour",
    "publisher": "Nintendo",
    "release_date": "Jul 29 2003",
    "developers": [
      "Camelot Software Planning"
    ],
    "platforms": "GameCube",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/fb7bbea88fca89c6015391c2c8872d4d-98.jpg",
    "descriptions": "Mario Golf: Toadstool Tour updates the Mario Golf series with more swing control, new courses, and fun side games.  Carefully select your club, choose the optimal contact point and trajectory, compensate for wind and green speeds, and then swing away.  You'll also have to compensate for eachMario Golf: Toadstool Tour updates the Mario Golf series with more swing control, new courses, and fun side games.  Carefully select your club, choose the optimal contact point and trajectory, compensate for wind and green speeds, and then swing away.  You'll also have to compensate for each character's weaknesses and for each course's terrain--from beautiful rolling hills to fantastic pipes and sand traps.  One to four players can enter a tournament, which rewards skillful play with trophies, badges, prizes, and secrets.… Expand"
  },
  {
    "name": "Cities: Skylines - PlayStation 4 Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/cities-skylines---playstation-4-edition",
    "publisher": "Paradox Interactive",
    "release_date": "Aug 15 2017",
    "developers": [
      "Tantalus"
    ],
    "platforms": [
      "PC",
      "Stadia",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Management",
      "Government"
    ],
    "meta_score": 81,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/5/5c8353dd146a89cec4f2ad0a62877e74-98.jpg",
    "descriptions": "Developed by Colossal Order, Cities: Skylines offers sprawling landscapes and maps with endless sandbox gameplay and new ways to expand your city. Key to progression is the ability to influence your city’s policy by incorporating taxation into districts. All this including the ability to modDeveloped by Colossal Order, Cities: Skylines offers sprawling landscapes and maps with endless sandbox gameplay and new ways to expand your city. Key to progression is the ability to influence your city’s policy by incorporating taxation into districts. All this including the ability to mod the game to suit your play style makes this the definitive city building simulation.… Expand"
  },
  {
    "name": "Unravel",
    "details_link": "https://www.metacritic.com/game/pc/unravel",
    "publisher": "Electronic Arts",
    "release_date": "Feb  9 2016",
    "developers": [
      "Coldwood Interactive"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/3/17dd6767a411219b74758f010e1a13cf-98.jpg",
    "descriptions": "Yarny's mission is to mend broken bonds and the yarn represents the love and connection between people. The player will use Yarny's thread to do things such as swinging across gaps or rappelling down trees. Te game will also challenge gamers to use the thread in clever and creative ways.Yarny's mission is to mend broken bonds and the yarn represents the love and connection between people. The player will use Yarny's thread to do things such as swinging across gaps or rappelling down trees. Te game will also challenge gamers to use the thread in clever and creative ways. [Electronic Arts]… Expand"
  },
  {
    "name": "MLB The Show 21",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/mlb-the-show-21",
    "publisher": "MLB AM",
    "release_date": "Apr 16 2021",
    "developers": [
      "Sony Interactive Entertainment San Diego Studio"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Sports",
      "Team",
      "Baseball",
      "Sim"
    ],
    "meta_score": 81,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/1/f86c2a7eb465e73564f8e64416e95b2a-98.jpg",
    "descriptions": "Be a 2-way star. For the first time, take your Ball Player from Road To The Show and use him in other game modes. Now your Ball Player can be a 2-way star. Enjoy Franchise improvements and updates to March To October which empower you to better make decisions on the future of your club. LiveBe a 2-way star. For the first time, take your Ball Player from Road To The Show and use him in other game modes. Now your Ball Player can be a 2-way star. Enjoy Franchise improvements and updates to March To October which empower you to better make decisions on the future of your club. Live content now streamlines programs to provide clearer goals, faster paths to rewards based on how you play, and welcomes a new class of Legends to build your dream squad. New to MLB The Show this year is gameplay styles alongside new gameplay onboarding tutorials to expand gameplay for all playstyles and skill levels. Casual: An easier, fun, pick-up and play experience with an emphasis on learning the game. Simulation: Authentic MLB experience that plays true to player and team ratings. A balance between stick skills and player attributes.  Competitive: User stick skills reign supreme, greater emphasis on user input over player ratings. Our new online H2H default. \r… Expand"
  },
  null,
  {
    "name": "Midnight Club II",
    "details_link": "https://www.metacritic.com/game/pc/midnight-club-ii",
    "publisher": "Rockstar Games",
    "release_date": "Jun 30 2003",
    "developers": [
      "Rockstar San Diego"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 81,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/4/8d67ccdffca5dc8d6d53160b068db8a5-98.jpg",
    "descriptions": "The world's most notorious drivers meet each night on the streets of LA, Paris, and Tokyo. Choose from the latest performance enhanced cars and bikes and compete head-to-head to make a name for yourself. There are no rules. Drive anywhere in the city. Find the fastest route to win. The copsThe world's most notorious drivers meet each night on the streets of LA, Paris, and Tokyo. Choose from the latest performance enhanced cars and bikes and compete head-to-head to make a name for yourself. There are no rules. Drive anywhere in the city. Find the fastest route to win. The cops know you are out there - don't get caught. Race with up to 8 players throughout three massive, fully open cities in one of five online play modes. Select any car or bike that you've personally unlocked in offline arcade mode. Join a game or host one yourself via GameSpy.com. A broadband connection is required for online play - there is no slow lane on the streets of Midnight Club 2. [Rockstar Games]… Expand"
  },
  {
    "name": "Chessmaster 10th Edition",
    "details_link": "https://www.metacritic.com/game/pc/chessmaster-10th-edition",
    "publisher": "Ubisoft",
    "release_date": "Aug 12 2004",
    "developers": [
      "Ubisoft"
    ],
    "platforms": "PC",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Board Games",
      "Board Games"
    ],
    "meta_score": 81,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/1/8ab85766a40b45b3c0d5c5f6856b99ec-98.jpg",
    "descriptions": "Chessmaster 10th Edition is a landmark for the franchise and features the largest and most compelling upgrade ever to both gameplay and graphics. Improvements include: New, easy-to-navigate interface with drop-down menus that are loaded with coaching options. New online module that providesChessmaster 10th Edition is a landmark for the franchise and features the largest and most compelling upgrade ever to both gameplay and graphics. Improvements include: New, easy-to-navigate interface with drop-down menus that are loaded with coaching options. New online module that provides a ranking system, create-a-tournament, teaching tools, chess chat and more. New Chessmaster Academy, featuring personalized instruction on everything from basic moves to advanced strategy as taught by some of the world's most famous players ? including International Master Josh Waitzkin and Grand Master Larry Christiansen. [Ubisoft]… Expand"
  },
  {
    "name": "Hitman: Blood Money",
    "details_link": "https://www.metacritic.com/game/xbox/hitman-blood-money",
    "publisher": "Eidos Interactive",
    "release_date": "May 30 2006",
    "developers": [
      "Io Interactive"
    ],
    "platforms": "Xbox",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 81,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/66c509a30fa53afb647169d58064683f-98.jpg",
    "descriptions": "When assassins from Agent 47's contract agency, The ICA, are systematically eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. For Agent 47 it's business as usual, until suddenly he loses contact with The ICA. Sensing that he may be the next target,When assassins from Agent 47's contract agency, The ICA, are systematically eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. For Agent 47 it's business as usual, until suddenly he loses contact with The ICA. Sensing that he may be the next target, he travels to America, where he prepares to make a killing. Agent 47 is back and this time he's paid in cold, hard cash. How the money is spent will affect his passage through the game and the weapons at his disposal, resulting in a unique gameplay experience for each player. Powered by a new version of Io's stunning Glacier engine, Hitman: Blood Money delivers the most brutal and realistic simulation of life as the world's deadliest assassin.… Expand"
  },
  {
    "name": "VOEZ",
    "details_link": "https://www.metacritic.com/game/switch/voez",
    "publisher": "Flyhigh Works",
    "release_date": "Mar  9 2017",
    "developers": [
      "Flyhigh Works"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/3/8c97f85fe6db4edbc59a15615da28d79-98.jpg",
    "descriptions": "VOEZ is played by touching falling notes in time with the music.\r Set in a fictional town named Lan Kong Town, which is modelled after Yilan in Taiwan, the story is centred around six high school students who form a band that eventually achieves international fame.\r\n\r\nGameplay is simple,VOEZ is played by touching falling notes in time with the music.\r Set in a fictional town named Lan Kong Town, which is modelled after Yilan in Taiwan, the story is centred around six high school students who form a band that eventually achieves international fame.\r Gameplay is simple, requiring players to touch vertically falling notes that have hit a bar on the bottom of the screen.\r Depending on the song, the number of lanes for the notes increases and they shift side to side, making the screen look as if it is dancing to the music.\r There are over 100 songs in the library. Three difficulty levels  Easy, Hard and Special  are available. Players are able to choose difficulty levels according to their skill so they may enjoy all pieces.… Expand"
  },
  {
    "name": "Fire Emblem: Shadow Dragon",
    "details_link": "https://www.metacritic.com/game/ds/fire-emblem-shadow-dragon",
    "publisher": "Nintendo",
    "release_date": "Feb 16 2009",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "DS",
    "num_players": "2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy",
      "Fantasy",
      "Tactics"
    ],
    "meta_score": 81,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/1/301bf231747e720ca10db9ed774b26bb-98.jpg",
    "descriptions": "Fire Emblem returns to its roots with a total overhaul of an NES classic never before released in America. New features include touch-screen controls, multiple save options and easy-to-follow tutorial chapters that shed new light on Marth's story. New players can jump into the action, evenFire Emblem returns to its roots with a total overhaul of an NES classic never before released in America. New features include touch-screen controls, multiple save options and easy-to-follow tutorial chapters that shed new light on Marth's story. New players can jump into the action, even if they've never played a Fire Emblem game before.  Medeus, the king of the dragonkin, has been revived and is forming an alliance with a fearsome sorcerer named Gharnef. Together, they threaten to the throw the entire continent of Archanea back to an age of chaos and war. Now, it's up to young Prince Marth and his small band of loyal followers to rise up and rally all those left in the land to make one last desperate push to free Archanea from the tyranny of the Shadow Dragon. How to progress through the game: Fire Emblem: Shadow Dragon is a turn-based strategy game with a fantasy setting. Players alternate turns with opponents, moving their pieces (units) and attacking enemy units on the battlefield. There are dozens of units and different weapons and magic spells, each with its own strategic benefits-high-flying Pegasus knights move effortlessly over varied terrain, fast-moving mounted cavaliers can use swords and lances, unarmed curates use healing staves to mend the wounds of other units and so on. [Nintendo]… Expand"
  },
  {
    "name": "Untitled Goose Game",
    "details_link": "https://www.metacritic.com/game/switch/untitled-goose-game",
    "publisher": "Panic Inc.",
    "release_date": "Sep 20 2019",
    "developers": [
      "House House",
      "22nd Century Toys"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Action Adventure",
      "General",
      "Open-World"
    ],
    "meta_score": 81,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/6/ce762aaf354373eb3d79b7f7b1081efd-98.jpg",
    "descriptions": "It's a lovely morning in the village and you are a horrible goose. Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting upIt's a lovely morning in the village and you are a horrible goose. Untitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day.… Expand"
  },
  {
    "name": "F1 22",
    "details_link": "https://www.metacritic.com/game/pc/f1-22",
    "publisher": "Electronic Arts",
    "release_date": "Jul  1 2022",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 22 ",
    "genres": [
      "Action",
      "General",
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 81,
    "users_score": 3.6,
    "image": "https://static.metacritic.com/images/products/games/8/cf8db5d4b4b3bb40a5149dd7641cbbf9-98.jpg",
    "descriptions": "Enter the new era of Formula 1® in EA SPORTS™ F1® 22, the official videogame of the 2022 FIA Formula One World Championship™. Take your seat for a new season as redesigned cars and overhauled rules redefine race day, test your skills around the new Miami International Autodrome, and get aEnter the new era of Formula 1® in EA SPORTS™ F1® 22, the official videogame of the 2022 FIA Formula One World Championship™. Take your seat for a new season as redesigned cars and overhauled rules redefine race day, test your skills around the new Miami International Autodrome, and get a taste of the glitz and glamour in F1® Life. Race the stunning new cars of the Formula 1® 2022 season with the authentic lineup of all 20 drivers and 10 teams, and take control of your race experience with new immersive or broadcast race sequences. Create a team and take them to the front of the grid with new depth in the acclaimed My Team career mode, race head-to-head in split-screen or multiplayer, or change the pace by taking supercars from some of the sport’s biggest names to the track in our all new Pirelli Hot Laps feature.… Expand"
  },
  {
    "name": "Persona 4 Arena Ultimax",
    "details_link": "https://www.metacritic.com/game/switch/persona-4-arena-ultimax",
    "publisher": "Atlus",
    "release_date": "Mar 17 2022",
    "developers": [
      "Arc System Works"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Switch"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 81,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/3/a9ca667f11e1ac914e646f354b8b6a0b-98.jpg",
    "descriptions": "In P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the wholeIn P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the whole tournament, while a few new faces join the fight, including Junpei Iori, Yukari Takeba, Rise Kujikawa, and more. But standing in their way is the dual katana-wielding Sho Minazuki, a huge threat to everyone involved in the P-1 Climax. Worse yet, there's a Sho lookalike who can wield a Persona...… Expand"
  },
  {
    "name": "The Pedestrian",
    "details_link": "https://www.metacritic.com/game/pc/the-pedestrian",
    "publisher": "Skookum Arts LLC",
    "release_date": "Jan 29 2020",
    "developers": [
      "Skookum Arts LLC",
      "Skookum Arts"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Action"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/df5d375d16f8f4e6fc0526dc904aa7eb-98.jpg",
    "descriptions": "I can see the signs in my sleep now, always guiding me closer. Will this really work? Have we almost achieved the impossible?"
  },
  {
    "name": "Age of Empires III",
    "details_link": "https://www.metacritic.com/game/pc/age-of-empires-iii",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 18 2005",
    "developers": [
      "Ensemble Studios"
    ],
    "platforms": "PC",
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "Historic",
      "Command"
    ],
    "meta_score": 81,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/b11dcd16fa5f9445dc648a3c91724d7d-98.jpg",
    "descriptions": "Age of Empires III offers gamers the next level of realism, with advanced battle physics and unparalleled visual detail. The new game picks up where Age of \"Empires II: Age of Kings\" left off, placing gamers in the position of a European power determined to explore, colonize and conquer theAge of Empires III offers gamers the next level of realism, with advanced battle physics and unparalleled visual detail. The new game picks up where Age of \"Empires II: Age of Kings\" left off, placing gamers in the position of a European power determined to explore, colonize and conquer the New World. This time period features stunning scenes, from towering European cathedrals to courageous tribes of Native Americans, and spectacular combat with Industrial Age units like rifled infantry, cavalry and tall ships bristling with cannons. Age of Empires III excites strategy gamers with new game-play elements, including the concept of a \"Home City,\" new civilizations, units, technologies and an immersive new single-player campaign that will span three generations. [Ensemble Studios]… Expand"
  },
  {
    "name": "Tales of Monkey Island Chapter 5: Rise of the Pirate God",
    "details_link": "https://www.metacritic.com/game/pc/tales-of-monkey-island-chapter-5-rise-of-the-pirate-god",
    "publisher": "Telltale Games",
    "release_date": "Dec  8 2009",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "3D",
      "Fantasy",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/2/332e6ce8f79e7da8ca3fae9378739a07-98.jpg",
    "descriptions": "Our piratey heroes meet their ultimate match with the Rise of the Pirate God. Can the world of Monkey Island be saved? Find out as the Tales of Monkey Island saga comes to its thrilling conclusion. [Telltale Games]"
  },
  {
    "name": "FAR: Changing Tides",
    "details_link": "https://www.metacritic.com/game/playstation-5/far-changing-tides",
    "publisher": "Frontier Foundry",
    "release_date": "Mar  1 2022",
    "developers": [
      "Okomotive"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 81,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/9cf67edd1bd7f911e99227bf8181fdbb-98.jpg",
    "descriptions": "Set sail and discover the wonders of a flooded world rife with mystery. Dive into unknown depths on the hunt for fuel and salvage, devise innovative solutions to overcome intricate obstacles, and unearth forgotten relics lost to time."
  },
  {
    "name": "Fortnite",
    "details_link": "https://www.metacritic.com/game/pc/fortnite",
    "publisher": "Epic Games",
    "release_date": "Jul 25 2017",
    "developers": [
      "Epic Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Massively Multiplayer",
    "genres": [
      "Action",
      "General",
      "General",
      "Shooter",
      "Third-Person",
      "Tactical"
    ],
    "meta_score": 81,
    "users_score": 3.4,
    "image": "https://static.metacritic.com/images/products/games/5/c7eb46ceb7da9c72c5a95193e8621faf-98.jpg",
    "descriptions": "Epic Games next project has you building forts and stopping a zombie invasion."
  },
  {
    "name": "Castlevania: Lords of Shadow - Ultimate Edition",
    "details_link": "https://www.metacritic.com/game/pc/castlevania-lords-of-shadow---ultimate-edition",
    "publisher": "Konami",
    "release_date": "Aug 27 2013",
    "developers": [
      "Mercury Steam"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 81,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/dd094b61200737405dd534db5a04dc0a-98.jpg",
    "descriptions": "Castlevania: Lords of Shadow takes place at the end of days. The Earth's alliance with the Heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow - darkness reins the world.  Across this shattered land, the souls of the dead wander unable to find peace,Castlevania: Lords of Shadow takes place at the end of days. The Earth's alliance with the Heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow - darkness reins the world.  Across this shattered land, the souls of the dead wander unable to find peace, whilst creatures of evil roam free wreaking chaos and death upon the living. Gabriel is a member of the Brotherhood of Light, an elite group of holy knights who protect and defend the innocent against the supernatural. His beloved wife was brutally murdered by the evil forces of darkness and her soul trapped for eternity. Neither living nor dead she realizes the horrific truth of what is at stake and guides Gabriel to his destiny - and hopefully salvation for the world... but at what cost? Thus, Gabriel must travel the destroyed world, defeating the evil tyrants in order to use their powers to bring balance back to the world. Armed with the versatile Combat Cross - the world's last hope must encounter the three factions of the Lords of Shadow and end their unholy rule. … Expand"
  },
  {
    "name": "Darksiders II",
    "details_link": "https://www.metacritic.com/game/pc/darksiders-ii",
    "publisher": "THQ",
    "release_date": "Aug 13 2012",
    "developers": [
      "Vigil Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Wii U",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Modern",
      "Fantasy",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/bbec241b6a84bd580def5b8e15c1a2ab-98.jpg",
    "descriptions": "Darksiders II follows the exploits of DEATH, one of the four horsemen of the Apocalypse, in a weaving tale that runs parallel to the events in the original Darksiders game. This epic journey propels DEATH through various light and dark realms as he tries to redeem his brother WAR, theDarksiders II follows the exploits of DEATH, one of the four horsemen of the Apocalypse, in a weaving tale that runs parallel to the events in the original Darksiders game. This epic journey propels DEATH through various light and dark realms as he tries to redeem his brother WAR, the horseman who was blamed for prematurely starting the Apocalypse in Darksiders.… Expand"
  },
  {
    "name": "Strong Bad's Cool Game for Attractive People Episode 2: Strong Badia the Free",
    "details_link": "https://www.metacritic.com/game/pc/strong-bads-cool-game-for-attractive-people-episode-2-strong-badia-the-free",
    "publisher": "Telltale Games",
    "release_date": "Sep 15 2008",
    "developers": [
      "Telltale Games"
    ],
    "platforms": "PC",
    "genres": [
      "Miscellaneous",
      "Adventure",
      "General",
      "Compilation"
    ],
    "meta_score": 81,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/2/3e60aec8358221689d72922fb1551e15-98.jpg",
    "descriptions": "When Strong Bad fails to obey the King of Town's totally unfair email tax, he's placed under house arrest. Once freed from his wrongful imprisonment, Strong Bad goes on a mission to unite the local warring factions under the Strong Badian flag. Is Free Country USA ready for such an awesomeWhen Strong Bad fails to obey the King of Town's totally unfair email tax, he's placed under house arrest. Once freed from his wrongful imprisonment, Strong Bad goes on a mission to unite the local warring factions under the Strong Badian flag. Is Free Country USA ready for such an awesome ruler? [TellTale Games]… Expand"
  },
  {
    "name": "Toy Soldiers: Cold War",
    "details_link": "https://www.metacritic.com/game/xbox-360/toy-soldiers-cold-war",
    "publisher": "Microsoft Game Studios",
    "release_date": "Aug 17 2011",
    "developers": [
      "Signal Studios"
    ],
    "platforms": "Xbox 360",
    "genres": [
      "Strategy",
      "Real-Time",
      "Wargame",
      "Real-Time",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/9/332ace192867bfdf603a1cd26f88335f-98.jpg",
    "descriptions": "The Cold War ignites when '80s era action toys come alive and wage war! Toy Soldiers: Cold War delivers hours of intense combat combined with addictive action strategy gameplay. Superpowers collide in this playful homage to '80s action toys and films. Command the powerful Cold War arsenalsThe Cold War ignites when '80s era action toys come alive and wage war! Toy Soldiers: Cold War delivers hours of intense combat combined with addictive action strategy gameplay. Superpowers collide in this playful homage to '80s action toys and films. Command the powerful Cold War arsenals of the USA or USSR armies! Control base turrets, modern combat vehicles, fighter jets, attack helicopters, and commando action figures. Whether lighting up the Toy Box alone or jumping into the fray with your friends, battle in campaign, co-op, or competitive modes. Fight for the high score in the addictive mini-games, and while you're at it, don't forget to BLOW EVERYTHING UP!… Expand"
  },
  {
    "name": "Weird West",
    "details_link": "https://www.metacritic.com/game/xbox-one/weird-west",
    "publisher": "Devolver Digital",
    "release_date": "Mar 31 2022",
    "developers": [
      "Wolfeye Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 81,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/9/65ebe075acb7ec209bb84916e1fe2906-98.jpg",
    "descriptions": "Survive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantasticalSurvive and unveil the mysteries of the Weird West through the intertwined destinies of its unusual heroes in an immersive sim from the co-creators of Dishonored and Prey. Discover a dark fantasy reimagining of the Wild West where lawmen and gunslingers share the frontier with fantastical creatures. Journey through the origin stories of a group of atypical heroes, written into legend by the decisions you make in an unforgiving land. Each journey is unique and tailored to the actions taken - a series of high stakes stories where everything counts and the world reacts to the choices you make. Form a posse or venture forth alone into an otherworldly confines of the Weird West and make each legend your own.… Expand"
  },
  {
    "name": "The Sims 4: Cottage Living",
    "details_link": "https://www.metacritic.com/game/pc/the-sims-4-cottage-living",
    "publisher": "Electronic Arts",
    "release_date": "Jul 22 2021",
    "developers": [
      "Maxis"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Simulation",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 81,
    "users_score": 5.4,
    "image": "https://static.metacritic.com/images/products/games/7/b701c67af5d214f4fdb7a03f91c8bfbb-98.jpg",
    "descriptions": "Delight in the quaint charm of The Sims 4 Cottage Living Expansion Pack with animal friends, garden-to-table meals, and a close-knit community. Explore the forest to befriend woodland creatures, or head to town to meet the locals. Whether Sims are hugging a cow, making friends (or enemies)Delight in the quaint charm of The Sims 4 Cottage Living Expansion Pack with animal friends, garden-to-table meals, and a close-knit community. Explore the forest to befriend woodland creatures, or head to town to meet the locals. Whether Sims are hugging a cow, making friends (or enemies) with their chickens, or growing the biggest vegetables around, the countryside presents abundant new ways to reconnect with the world.… Expand"
  },
  {
    "name": "Suzerain",
    "details_link": "https://www.metacritic.com/game/pc/suzerain",
    "publisher": "Fellow Traveller",
    "release_date": "Dec  4 2020",
    "developers": [
      "Torpor Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "Strategy",
      "Turn-Based",
      "4X"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/28d90fb1f6c5ee3b17a5398cf078b5bb-98.jpg",
    "descriptions": "As President Rayne, lead Sordland into ruin or repair during your first term in this text-based role-playing game. Navigate a political drama driven by conversations with your cabinet members and other significant figures. Beware or embrace corruption; shirk or uphold ideals. How will you lead?"
  },
  {
    "name": "The Elder Scrolls V: Skyrim VR",
    "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-v-skyrim-vr",
    "publisher": "Bethesda Softworks",
    "release_date": "Apr  2 2018",
    "developers": [
      "Bethesda Softworks"
    ],
    "platforms": [
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 81,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/5/5c7bdaf50b5228f4c8a389400c7b45c1-98.jpg",
    "descriptions": "A true, full-length open-world game for VR has arrived from award-winning developers, Bethesda Game Studios. Skyrim VR reimagines the complete epic fantasy masterpiece with an unparalleled sense of scale, depth, and immersion. From battling ancient dragons to exploring rugged mountains andA true, full-length open-world game for VR has arrived from award-winning developers, Bethesda Game Studios. Skyrim VR reimagines the complete epic fantasy masterpiece with an unparalleled sense of scale, depth, and immersion. From battling ancient dragons to exploring rugged mountains and more, Skyrim VR brings to life a complete open world for you to experience any way you choose. Skyrim VR includes the critically-acclaimed core game and official add-ons -- Dawnguard, Hearthfire, and Dragonborn.\r Dragons, long lost to the passages of the Elder Scrolls, have returned to Tamriel and the future of the Empire hangs in the balance. As Dragonborn, the prophesied hero born with the power of The Voice, you are the only one who can stand amongst them.… Expand"
  },
  {
    "name": "The Cat Lady",
    "details_link": "https://www.metacritic.com/game/pc/the-cat-lady",
    "publisher": "Harvester Games",
    "release_date": "Dec  7 2012",
    "developers": [
      "Harvester Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/90d43e0573fc3171d2203531853c20c5-98.jpg",
    "descriptions": "The Cat Lady contains strong adult themes and is recommended only for players over 18.\r By author Remigiusz Michalski (Harvester Games). The Cat Lady follows Susan Ashworth, a lonely 40-year old on the verge of suicide. She has no family, no friends and no hope for a better future. One dayThe Cat Lady contains strong adult themes and is recommended only for players over 18.\r By author Remigiusz Michalski (Harvester Games). The Cat Lady follows Susan Ashworth, a lonely 40-year old on the verge of suicide. She has no family, no friends and no hope for a better future. One day she discovers that five strangers will come along and change everything... This suspenseful psychological horror game features stylized artwork, a simple keyboard control method and English voice acting, plus a compelling, atmospheric 70 minute soundtrack by Micamic.… Expand"
  },
  {
    "name": "Assassin's Creed",
    "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed",
    "publisher": "Ubisoft",
    "release_date": "Nov 13 2007",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 81,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/ee25a9f5e971d2b490f37d5ea1ee1914-98.jpg",
    "descriptions": "The first game in the Assassin's Creed franchise is set in 1191 AD, when the Third Crusade was tearing the Holy Land apart. Shrouded in secrecy and feared for their ruthlessness, the Assassins intend to stop the hostilities by suppressing both sides of the conflict. Players, assuming theThe first game in the Assassin's Creed franchise is set in 1191 AD, when the Third Crusade was tearing the Holy Land apart. Shrouded in secrecy and feared for their ruthlessness, the Assassins intend to stop the hostilities by suppressing both sides of the conflict. Players, assuming the role of the main character Altair, have the power to throw their immediate environment into chaos and to shape events during this pivotal moment in history. [Ubisoft]… Expand"
  },
  {
    "name": "Overcooked! 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/overcooked!-2",
    "publisher": "Team17",
    "release_date": "Aug  7 2018",
    "developers": [
      "Ghost Town Games Ltd."
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/ae8297c5b5226d2debe0715a1abaef63-98.jpg",
    "descriptions": "Overcooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:\n\n* Online/LocalOvercooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:* Online/Local Multiplayer Madness - You'll knead to work together to get the highest score in chaotic local and online multiplayer.* Feast Your Eyes On This - Cook in new kitchens ranging from sushi restaurants, magic schools and mines!* Romaine Calm! - Travel through teleporters, across moving platforms and save time by throwing ingredients across dynamic kitchens that shift and evolve.* Whet Your Appetite! - Cook up a range of new recipes including sushi, cakes, burgers and pizzas.… Expand"
  },
  {
    "name": "Guitar Hero Live",
    "details_link": "https://www.metacritic.com/game/xbox-one/guitar-hero-live",
    "publisher": "Activision",
    "release_date": "Oct 20 2015",
    "developers": [
      "FreeStyleGames"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 81,
    "users_score": 4.9,
    "image": "https://static.metacritic.com/images/products/games/5/5192bd49a7534ca64445ca1816d99b54-98.jpg",
    "descriptions": "Guitar Hero Live mode inserts you onstage, looking out: you get a first-person perspective as a real crowd reacts to the notes you play. Or switch over to GHTV - a playable music video network, where you can play along in real time, discover new music, and challenge friends around the world."
  },
  {
    "name": "Bloodroots",
    "details_link": "https://www.metacritic.com/game/playstation-4/bloodroots",
    "publisher": "Paper Cult",
    "release_date": "Feb 28 2020",
    "developers": [
      "Paper Cult"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "3D"
    ],
    "meta_score": 81,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/b82cf003538a2c313d632e4f919842b1-98.jpg",
    "descriptions": "In Bloodroots, the world is your weapon - improvise and adapt to an ever-changing ballet of ultraviolence, in a bloody revenge quest across the Weird West."
  },
  {
    "name": "Skylanders SuperChargers",
    "details_link": "https://www.metacritic.com/game/playstation-4/skylanders-superchargers",
    "publisher": "Activision",
    "release_date": "Sep 20 2015",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 81,
    "users_score": 4.2,
    "image": "https://static.metacritic.com/images/products/games/6/3d7bf6709f504f4037215df30eb9dee3-98.jpg",
    "descriptions": "Skylanders SuperChargers features a brand-new class of heroes, called SuperChargers who are distinct with fresh moves, powerful attacks and all-new weapons.  These SuperChargers also have special in-game abilities that help Portal Masters fight Kaos.  Twenty new SuperChargers character toysSkylanders SuperChargers features a brand-new class of heroes, called SuperChargers who are distinct with fresh moves, powerful attacks and all-new weapons.  These SuperChargers also have special in-game abilities that help Portal Masters fight Kaos.  Twenty new SuperChargers character toys and 20 new vehicle toys will be available.… Expand"
  },
  {
    "name": "ilomilo",
    "details_link": "https://www.metacritic.com/game/xbox-360/ilomilo",
    "publisher": "Microsoft Game Studios",
    "release_date": "Jan  5 2011",
    "developers": [
      "Southend Interactive"
    ],
    "platforms": "Xbox 360",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "General",
      "Puzzle",
      "Puzzle",
      "Action"
    ],
    "meta_score": 81,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/6/9c6c158a9b3d316ae5c86706f02ce354-98.jpg",
    "descriptions": "ilomilo is a puzzle game where you control two friends, ilo and milo."
  },
  {
    "name": "Vessel",
    "details_link": "https://www.metacritic.com/game/pc/vessel",
    "publisher": "indiePub",
    "release_date": "Mar  1 2012",
    "developers": [
      "Strange Loop Games"
    ],
    "platforms": [
      "PlayStation 3",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 81,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/3/7f418126dae49fb23b5143e09ccb3542-98.jpg",
    "descriptions": "Vessel is a 2D action and puzzle game featuring the unique ability to simulate characters composed entirely of fluid. Arkwright, inventor of the world famous Fluro (mechanized-fluid automaton) is on a quest to finish his next great invention - The Device - that will alter existence inVessel is a 2D action and puzzle game featuring the unique ability to simulate characters composed entirely of fluid. Arkwright, inventor of the world famous Fluro (mechanized-fluid automaton) is on a quest to finish his next great invention - The Device - that will alter existence in unimaginable ways. However, Fluros begin to mutate and run amok, and it's up to Arkwright to understand (and exploit) these strange evolutions. Explore physically modeled worlds, solve puzzles by controlling fluid and machines, and harness the power of the mysterious Fluro creatures that populate the land.… Expand"
  },
  {
    "name": "Dawn of Discovery",
    "details_link": "https://www.metacritic.com/game/wii/dawn-of-discovery",
    "publisher": "Ubisoft",
    "release_date": "Jun 23 2009",
    "developers": [
      "Keen Games"
    ],
    "platforms": [
      "PC",
      "Wii"
    ],
    "num_players": "4  Online",
    "genres": [
      "Simulation",
      "Strategy",
      "Real-Time",
      "General",
      "General",
      "Historic"
    ],
    "meta_score": 81,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/a19d60cf03de5bebce51c2aa1da2488c-98.jpg",
    "descriptions": "(Also known as \"Anno 1404: Dawn of Discovery\" and \"Anno: Create a New World\")  Dawn of Discovery takes place in the year 1404, when King George's land is suffering from severe droughts and brutal famine. Aware of his people's distress, the king calls on his two sons, William and Edward, to(Also known as \"Anno 1404: Dawn of Discovery\" and \"Anno: Create a New World\")  Dawn of Discovery takes place in the year 1404, when King George's land is suffering from severe droughts and brutal famine. Aware of his people's distress, the king calls on his two sons, William and Edward, to acquire new territories in order to produce enough goods to satisfy the needs of his empire’s inhabitants. Whereas Edward suggests aggressive means to collect the precious resources, his brother William offers a peaceful solution, proposing to explore new and unsettled lands in the south of the kingdom. With his Father’s blessing, William heads south to the mysterious Orient and returns with valuable new technologies such as the water pump that allows dry lands to be cultivated in order to produce enough food for the people. But there are still many unmet needs within the king's empire, and players are tasked with the mission of fulfilling those needs while both expanding and sustaining the vast society. Build and sustain your own expansive empire. Explore the beautifully detailed world and discover new places to create your civilization. Set up trade posts in the spice mines of the Orient and explore new trade routes to keep your nation growing. Learn from other nearby cultures to expand your horizons and master the challenges of establishing a prosperous society. [Ubisoft]… Expand"
  },
  {
    "name": "Captain Toad: Treasure Tracker",
    "details_link": "https://www.metacritic.com/game/wii-u/captain-toad-treasure-tracker",
    "publisher": "Nintendo",
    "release_date": "Dec  5 2014",
    "developers": [
      "Nintendo EAD Tokyo"
    ],
    "platforms": [
      "3DS",
      "Switch",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 81,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/1/ad62b9b8e955b92bb79260fd00665369-98.jpg",
    "descriptions": "The intrepid Captain Toad sets off on his own adventure for the very first time through a wide variety of tricky, enemy-infested, maze-like stages to find hidden gems and nab elusive gold stars."
  },
  {
    "name": "Metro 2033",
    "details_link": "https://www.metacritic.com/game/pc/metro-2033",
    "publisher": "THQ",
    "release_date": "Mar 16 2010",
    "developers": [
      "4A Games"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/9/6e08bcac74825d7b66aa8a64e0f31bcf-98.jpg",
    "descriptions": "Set in the shattered subway of a post apocalyptic Moscow, Metro 2033 is a story of intensive underground survival where the fate of mankind rests in your hands. In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the earth’s surface into aSet in the shattered subway of a post apocalyptic Moscow, Metro 2033 is a story of intensive underground survival where the fate of mankind rests in your hands. In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the earth’s surface into a poisonous wasteland. A handful of survivors took refuge in the depths of the Moscow underground, and human civilization entered a new Dark Age. The year is 2033. An entire generation has been born and raised underground, and their besieged Metro Station-Cities struggle for survival, with each other, and the mutant horrors that await outside. You are Artyom, born in the last days before the fire, but raised Underground. Having never ventured beyond your Metro Station-City limits, one fateful event sparks a desperate mission to the heart of the Metro system, to warn the remnants of mankind of a terrible impending threat. Your journey takes you from the forgotten catacombs beneath the subway to the desolate wastelands above, where your actions will determine the fate of mankind. [THQ]… Expand"
  },
  {
    "name": "Dodgeball Academia",
    "details_link": "https://www.metacritic.com/game/switch/dodgeball-academia",
    "publisher": "Humble Games",
    "release_date": "Aug  5 2021",
    "developers": [
      "Pocket Trap"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Sports",
      "Individual",
      "Other"
    ],
    "meta_score": 81,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/2/42426dcdffe3d1560d4d13124d9b659b-98.jpg",
    "descriptions": "In a world where dodgeball is life, you join Otto at the academy and train to become the ultimate dodgeball champion. Across eight episodes, you’ll forge friendships and create rivals, all in the name of developing the best dodgeball team. Level up Otto and develop a dynamic team across aIn a world where dodgeball is life, you join Otto at the academy and train to become the ultimate dodgeball champion. Across eight episodes, you’ll forge friendships and create rivals, all in the name of developing the best dodgeball team. Level up Otto and develop a dynamic team across a vast and customizable party progression system. All the while, explore the vast Dodgeball Academia and uncover the long hidden truths that reside within the very walls you live, learn, and dominate in.… Expand"
  },
  {
    "name": "College Hoops 2K7",
    "details_link": "https://www.metacritic.com/game/playstation-3/college-hoops-2k7",
    "publisher": "2K Sports",
    "release_date": "Mar 13 2007",
    "developers": [
      "2K Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "10  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Sim",
      "Sim"
    ],
    "meta_score": 81,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/8/270d2a9ecfe64f30310da3ba5de2cda3-98.jpg",
    "descriptions": "With over 325 NCAA Division I schools, College Hoops 2K7 defines the college basketball experience. True College Atmosphere - The most immersive college game yet, College Hoops 2K7 puts the fans in the game and makes them a part of the team. No \"I\" in Team - Revamped defensive AI andWith over 325 NCAA Division I schools, College Hoops 2K7 defines the college basketball experience. True College Atmosphere - The most immersive college game yet, College Hoops 2K7 puts the fans in the game and makes them a part of the team. No \"I\" in Team - Revamped defensive AI and defensive controls means that better teams come up with the big stops. Leadership Matters - Team chemistry becomes an important factor in the game as teams with strong leadership tend to get the big upsets come tournament time. Improved Legacy Mode - Legacy mode gets a complete upgrade in College Hoops 2K7, with improvements in everything from a new simulation engine and recruiting tools to bracketology, NCAA record books and new broadcast shows like College Hoops Tonight. More Customization - Make your own schools with customized uniforms and uniquely designed arenas. With an even more robust player creation system, you can bring your own NCAA team to life like never before. [2K Sports]… Expand"
  },
  {
    "name": "Fire Emblem Echoes: Shadows of Valentia",
    "details_link": "https://www.metacritic.com/game/3ds/fire-emblem-echoes-shadows-of-valentia",
    "publisher": "Nintendo",
    "release_date": "May 19 2017",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 81,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/a387aa1acace5ce8b9210be78a0ac069-98.jpg",
    "descriptions": "In 1992, the second game in the Fire Emblem series, Fire Emblem Gaiden, launched exclusively in Japan. Now, for the first time, fans outside of Japan will get a taste of this classic game on the Nintendo 3DS family of systems. Fire Emblem Echoes: Shadows of Valentia is inspired by the 1992In 1992, the second game in the Fire Emblem series, Fire Emblem Gaiden, launched exclusively in Japan. Now, for the first time, fans outside of Japan will get a taste of this classic game on the Nintendo 3DS family of systems. Fire Emblem Echoes: Shadows of Valentia is inspired by the 1992 original, reimagined on a grander scale. Every aspect of the Fire Emblem Gaiden game's presentation has been updated, along with the game being fully voiced. Fire Emblem Echoes: Shadows of Valentia recreates classic Fire Emblem gameplay with a modern twist, mixing in exploration of dungeons crawling with enemies.… Expand"
  },
  {
    "name": "Phoenix Wright: Ace Attorney",
    "details_link": "https://www.metacritic.com/game/ds/phoenix-wright-ace-attorney",
    "publisher": "Capcom",
    "release_date": "Oct 12 2005",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "iPhone/iPad",
      "iPhone/iPad",
      "DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "First-Person",
      "Visual Novel",
      "Modern",
      "Modern"
    ],
    "meta_score": 81,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/4/fb5cb254494a513ea00523df77ae76fa-98.jpg",
    "descriptions": "(Known in Japan as \"Gyakuten Saiban\")  Not everyone is innocent until proven guilty! Players star as a defense attorney, who must prove his seemingly guilty client’s innocence no matter how dire the circumstances may seem. The game presents twisting storylines and intriguing gameplay in a(Known in Japan as \"Gyakuten Saiban\")  Not everyone is innocent until proven guilty! Players star as a defense attorney, who must prove his seemingly guilty client’s innocence no matter how dire the circumstances may seem. The game presents twisting storylines and intriguing gameplay in a comical anime style. Players must collect evidence, weed through inconsistent testimonies, and overcome corrupt agendas to ensure that justice prevails. [Capcom]… Expand"
  },
  {
    "name": "Life is Strange: Episode 5 - Polarized",
    "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-episode-5---polarized",
    "publisher": "Square Enix",
    "release_date": "Oct 20 2015",
    "developers": [
      "DONTNOD Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 81,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/08cfe7b9d822e34f82f77ced790fe5a4-98.jpg",
    "descriptions": "In Episode 5: Polarized Max learns that time is impossible to control as she moves inexorably towards the most agonizing decision of her life. Arcadia Bay, meanwhile, is preparing to weather a huge storm as Life is Strange comes to a gripping and gut wrenching conclusion."
  },
  {
    "name": "NBA Jam: On Fire Edition",
    "details_link": "https://www.metacritic.com/game/playstation-3/nba-jam-on-fire-edition",
    "publisher": "Electronic Arts",
    "release_date": "Oct  4 2011",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 81,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/2/9cecbc30d373cec8802f49dff223e8b7-98.jpg",
    "descriptions": "NBA JAM: On Fire Edition will feature exciting new gameplay enhancements, including ground-breaking artificial intelligence that will change the way gamers play NBA JAM."
  },
  {
    "name": "Mario & Luigi: Dream Team",
    "details_link": "https://www.metacritic.com/game/3ds/mario-luigi-dream-team",
    "publisher": "Nintendo",
    "release_date": "Aug 11 2013",
    "developers": [
      "Alphadream Corporation"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 81,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/7/aba216fef43cc5d1f6b1f2aebb24c609-98.jpg",
    "descriptions": "(Also known as \"Mario & Luigi: Dream Team Bros\") A new installment in the Mario & Luigi role-playing series is coming to Nintendo 3DS this summer. The game takes place inside the mind of a sleeping Luigi, who is a powerful, brave hero in his dreams."
  },
  {
    "name": "Uno",
    "details_link": "https://www.metacritic.com/game/xbox-360/uno",
    "publisher": "Microsoft Game Studios",
    "release_date": "May  9 2006",
    "developers": [
      "Carbonated Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "4  Online",
    "genres": [
      "Miscellaneous",
      "Board Games",
      "Board Games",
      "Board / Card Game"
    ],
    "meta_score": 81,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/763e89ac6e225be4554996f1463d5328-98.jpg",
    "descriptions": "[Xbox Live Arcade] Compete against three other players to match colors and symbols, go Wild with special command cards such as Skip and Reverse, and be the first to play all your cards. Add-on theme decks offer new art and new card effects, keeping the game fresh and challenging. So connect[Xbox Live Arcade] Compete against three other players to match colors and symbols, go Wild with special command cards such as Skip and Reverse, and be the first to play all your cards. Add-on theme decks offer new art and new card effects, keeping the game fresh and challenging. So connect with friends, choose your favorite house rules, and get ready to shout \"UNO!\" Three game modes: Choose from Standard UNO, Partner UNO, or House Rules UNO. House Rules UNO: Customize 10 different game rules to suit your preference. Single player: Go up against three computer players. Multiplayer play: Go online via Xbox Live against three other players. Downloads: Get add-on theme decks to customize the visual appearance and game rules. [Microsoft]… Expand"
  }
]