[{"name": "Superman: Shadow of Apokolips", "details_link": "https://www.metacritic.com/game/playstation-2/superman-shadow-of-apokolips", "publisher": "Atari", "release_date": "Sep 25 2002", "developers": ["Atari"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 64, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/4571c5d53fcfa2c2a547782882c7fc05-98.jpg", "descriptions": "Darkseid, the most evil being in the galaxy, has enlisted the aid of Lex Luthor in his quest to destroy Superman and take over the world. By providing Luthor with highly-advanced Apokoliptian weapons technology, Darkseid has enabled Metropolis' reigning supervillain to create an army ofDarkseid, the most evil being in the galaxy, has enlisted the aid of Lex Luthor in his quest to destroy Superman and take over the world. By providing Luthor with highly-advanced Apokoliptian weapons technology, Darkseid has enabled Metropolis' reigning supervillain to create an army of nearly unstoppable Inter-Bot robots packing serious firepower. But realizing that he needs a champion of his own to take down the Last Son of Krypton, Luthor hatches an insidious plan that involves busting malevolent cyborg Metallo out of Strykers Island Prison. It's too bad, then, that Metallo's first priority is to eradicate the man he blames for his gruesome transformation from a hired mercenary into hideous cyborg monster?Lex Luthor himself. [Infogrames]… Expand"}, {"name": "Dinotopia: The Timestone Pirates", "details_link": "https://www.metacritic.com/game/game-boy-advance/dinotopia-the-timestone-pirates", "publisher": "TDK Mediactive", "release_date": "Apr 30 2002", "developers": ["RFX Interactive"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 64, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/6602b1177820deac23cd2b0f3acfe9c6-98.jpg", "descriptions": "Danger! Angry dinosaurs are poised for invasion. Scurvy pirates are hungry for treasure. And an ancient stone of unimaginable power is about to fall into the wrong hands. Take to the skies and prepare for battle -- only you can preserve the special world that is Dinotopia!"}, {"name": "Wild Wild Racing", "details_link": "https://www.metacritic.com/game/playstation-2/wild-wild-racing", "publisher": "Interplay", "release_date": "Oct 25 2000", "developers": ["Rage Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 64, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/e2c9ac3fd9bda531c48be90b3f1c6e6b-98.jpg", "descriptions": "When the creators of eye-candy-laden PC hits Expendable and Incoming start working on a racing game, it's a pretty sure bet that it will boast some rather impressive effects. While Wild Wild Racing may not turn heads in the same way Gran Turismo 3 does, it does look good; and if there's oneWhen the creators of eye-candy-laden PC hits Expendable and Incoming start working on a racing game, it's a pretty sure bet that it will boast some rather impressive effects. While Wild Wild Racing may not turn heads in the same way Gran Turismo 3 does, it does look good; and if there's one thing the UK developers like Rage Software are known for, it's creating a solid racing experience. Picked up from Japanese publisher Imagineer by Interplay, Wild Wild Racing has since seen overhauls in the physics, control, and speed. Gamers can ride in nine different vehicles, and race in several global locations during different hours of the day such as night, dusk, and the late afternoon. The game boasts a solid 60 frames per second, and the over-the-top effects that Rage is known for. Control is all analog, meaning even the D-pad (as well as the traditional analog buttons) responds to pressure; the harder you press, the sharper the turn and the faster the acceleration and braking.… Expand"}, {"name": "Wolfenstein: Youngblood", "details_link": "https://www.metacritic.com/game/playstation-4/wolfenstein-youngblood", "publisher": "Bethesda Softworks", "release_date": "Jul 26 2019", "developers": ["MachineGames"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 63, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/2/9f22808febb4066e472688631ce5a413-98.jpg", "descriptions": "Wolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus. Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: YoungbloodWolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus. Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: Youngblood introduces the next Blazkowicz generation to the fight against the Nazis. Play as one of BJ's twin daughters, Jess and Soph, as you search for your missing father in Nazi-occupied Paris.… Expand"}, {"name": "Juiced", "details_link": "https://www.metacritic.com/game/pc/juiced", "publisher": "THQ", "release_date": "Jun 13 2005", "developers": ["Juice Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "6  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/1cee5527e3bac2b57f992646e23932d5-98.jpg", "descriptions": "Juiced, as in life, is all about the car. Style comes in a close second to speed, and Juiced offers thousands of real-time modding combinations that empower players to create their ultimate personality-infused street machines. But it takes more than a fresh coat of pearlescent paint to earnJuiced, as in life, is all about the car. Style comes in a close second to speed, and Juiced offers thousands of real-time modding combinations that empower players to create their ultimate personality-infused street machines. But it takes more than a fresh coat of pearlescent paint to earn respect on the road; it takes the ball bearings to go up against the trash-talking, nitrous- burning faithful who want to strip everyone of their cash, cars and pride. Juiced lets players connect with their community and share the high-octane action by recruiting drivers to become part of their crew and race together as a team to put the brakes on the competition. Features more than 50 licensed vehicles, including Toyota, Honda, Nissan, Dodge, Ford, Mazda Mitsubishi, Pontiac, Holden, Volkswagen, Fiat, Renault, Subaru, Peugeot and Chevrolet; Hundreds of authentic aftermarket parts from leading manufacturers such as A'PEXi, AEM, Bridgestone, Ferodo, Konig, Alpine and HKS that provide players with thousands of personalized vehicle customization combinations; Progressive, non-linear gameplay that enables players to build their characters and cars, and gain respect and notoriety by winning races and cash; Unique blending of simulation and the high-octane appeal of arcade-style racing; Ability to build custom racing crews that work together as a team to win races; Authentic car physics and damage; and Online head-to-head play. [Acclaim]… Expand"}, {"name": "The Adventures of Tintin: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/the-adventures-of-tintin-the-game", "publisher": "Ubisoft", "release_date": "Dec  6 2011", "developers": ["Ubisoft Montpellier"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/4de3136c93f0f4e3fd84f7087023a0b0-98.jpg", "descriptions": "The Adventures of Tintin is a game based off its movie counterpart."}, {"name": "Harry Potter and the Order of the Phoenix", "details_link": "https://www.metacritic.com/game/pc/harry-potter-and-the-order-of-the-phoenix", "publisher": "EA Games", "release_date": "Jun 25 2007", "developers": ["EA Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 63, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/7245a872fafab919a481e848e90a5e66-98.jpg", "descriptions": "In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster,In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster, Albus Dumbledore, is lying about Voldemort's return in order to undermine his power and take his job, the Minister for Magic, Cornelius Fudge, appoints a new Defense Against the Dark Arts teacher to keep watch over Dumbledore and the Hogwarts students. But Professor Dolores Umbridge's Ministry-approved course of defensive magic leaves the young wizards woefully unprepared to defend themselves against the dark forces threatening them and the entire wizarding community, so at the prompting of his friends Hermione and Ron, Harry takes matters into his own hands. Meeting secretly with a small group of students who name themselves \"Dumbledore’s Army,\" Harry teaches them how to defend themselves against the Dark Arts, preparing the courageous young wizards for the extraordinary battle that lies ahead. With the ability to play multiple characters, including Harry Potter, Dumbledore and Sirius Black, the videogame of Harry Potter and the Order of the Phoenix offers fans the opportunity to wield a wand, explore all around Hogwarts, and experience one of the most exciting and dangerous years in the life of the Boy Who Lived. [Electronic Arts / Warner Bros.]… Expand"}, {"name": "Earth Defense Force: Insect Armageddon", "details_link": "https://www.metacritic.com/game/playstation-3/earth-defense-force-insect-armageddon", "publisher": "D3Publisher", "release_date": "Jul  1 2011", "developers": ["Vicious Cycle"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/6ae5766aea45c53775272823abdc34fa-98.jpg", "descriptions": "Taking place in the fictional city of New Detroit, Earth Defense Force: Insect Armageddon is a completely new game developed by Vicious Cycle that takes on the concept of Earth Defense Force 2017 (Japanese Title \"Earth Defense Force 3\" developed by SANDLOT).  Insect ArmageddonTaking place in the fictional city of New Detroit, Earth Defense Force: Insect Armageddon is a completely new game developed by Vicious Cycle that takes on the concept of Earth Defense Force 2017 (Japanese Title \"Earth Defense Force 3\" developed by SANDLOT).  Insect Armageddon continues to follow the rich history of casual fun and addictive gameplay that made the franchise a cult classic.  Insect Armageddon also adds a new aspect to the Earth Defense Force  series that was born in Japan, with additional elements for all EDF soldiers to experience.  The Campaign mode that lets up to three players team up online to battle the insects and aliens across a completely destroyable city.  Every EDF soldier is armed with over 150 weapons and four upgradeable armor sets and engages in nonstop arcade action that is the fastest and deadliest in the series.  In addition, the game also features a six-player Survival mode that pits a human squad against a nonstop onslaught of the largest enemies the aliens have to offer.  New Detroit's giant bug problem is unavoidable, and mankind's last hope lies with the Earth Defense Force to defend the world from the insect swarm, even if it means blowing up the entire city as part of the extermination process.… Expand"}, {"name": "Summer in Mara", "details_link": "https://www.metacritic.com/game/pc/summer-in-mara", "publisher": "Chibig", "release_date": "Jun 16 2020", "developers": ["Chibig"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 63, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/38bd4c01a6b8d60cd158b6c884cab5a3-98.jpg", "descriptions": "'Summer in Mara' is a summer adventure with easy-RPG elements and farming, crafting, and exploring mechanics set in a tropical archipelago.\r 'Summer in Mara' is a single player experience in a calm, relaxing environment, with a handmade look and a interesting narrative. You will be Koa, a'Summer in Mara' is a summer adventure with easy-RPG elements and farming, crafting, and exploring mechanics set in a tropical archipelago.\r 'Summer in Mara' is a single player experience in a calm, relaxing environment, with a handmade look and a interesting narrative. You will be Koa, a little adventurer who wants to explore the world that surrounds her.\r In 'Summer in Mara' you'll have to take care of your own island, harvest your crops, create new tools and buildings, and sail with your boat to discover new islands and secrets.\rKEY FEATURES\r- 'Summer in Mara' is an adventure and farming game, with an archipelago full of islands and secrets to explore.\r - Day and night cycle with climate events.\r - More than 100 quests to make the world a better place.\r - Over 20 characters to meet and trade with. Befriend them!\r - Improve your boat, make it bigger, better and faster.\r - More than 130 inventory items to make, use and trade.\r - Unlock and acquire new abilities and skills for Koa, helping her to craft, trade and explore in an easy-RPG system.\r You'll have your own island, but taking care of something like that is a lot of hard work. You'll be able to plant trees to get wood and craft new tools and buildings with it. Or create crop fields to grow all kinds of vegetables. You'll also have a farm with chickens and pigs to take care of. But be careful, because this isn't as easy as it looks! You'll also be able to fish in a pond on the island, cut trees with your hatchet, build things with your hammer and use a hoe to help you harvest your island.\r Koa will need your help. With an easy-RPG system, she can acquire new abilities and grow stronger. We want you to feel like you're growing up with Koa, bonding with her and with all the other people in the archipelago.\r You'll be able to sail to new islands and find treasures and other secrets in the middle of the sea with your trusty boat which you can upgrade with a little effort and time.\rWith new islands comes new people. You'll talk and trade with over twenty characters, each one with their own story and lifes. They'll give you quests, hints about the world or just anecdotes about their life and travels. Getting to know them is a very important part in the game, so we put much effort in making them unique and interesting.\r But not all of the people you find will be friendly. An evil corporation called Elite wants to conquer Mara and exploit the ocean. Napopo is one of their first victims, a strange creature that will seek Koa for help.… Expand"}, {"name": "Dead Island: Definitive Collection", "details_link": "https://www.metacritic.com/game/playstation-4/dead-island-definitive-collection", "publisher": "Deep Silver", "release_date": "May 31 2016", "developers": ["Techland"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 63, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/79732b41a6df8fd286550642d08f825f-98.jpg", "descriptions": "(Also known as \"Dead Island: Definite Edition\") Definitive Collection contains Dead Island Definitive Edition, Dead Island: Riptide Definitive Edition and a brand new stand-alone 16-bit game Dead Island Retro Revenge. Dead Island Definitive Edition and Dead Island: Riptide Definitive Edition(Also known as \"Dead Island: Definite Edition\") Definitive Collection contains Dead Island Definitive Edition, Dead Island: Riptide Definitive Edition and a brand new stand-alone 16-bit game Dead Island Retro Revenge. Dead Island Definitive Edition and Dead Island: Riptide Definitive Edition are fully remastered versions of Dead Island and Dead Island Riptide including all released DLC and patches. Dead Island Retro Revenge: A brand new stand-alone 16-bit game set in the style of a classic side-scrolling action/endless runner within the Dead Island universe. Smash heads, crack skulls and slice em up with visceral melee combat and true story-based 4-player co-op in a sprawling open world just waiting for exploration. Enhance and develop your unique character using RPG-like elements including an XP/leveling system and unlockable skill trees. Collect and customize thousands of weapons ranging from simple wooden bats and fire axes to heavy rifles as you search for the makings of the ultimate zombie-slaying tool.… Expand"}, {"name": "The Witch and the Hundred Knight: Revival Edition", "details_link": "https://www.metacritic.com/game/playstation-4/the-witch-and-the-hundred-knight-revival-edition", "publisher": "NIS America", "release_date": "Mar  1 2016", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 3", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/e5a34e91698f78ad8c1600f9040cc2a7-98.jpg", "descriptions": "Two powerful witches have been battling one another for over a hundred years. Now, the Swamp Witch has unleashed the legendary Dark Knights, and seeks to destroy the Forest Witch once and for all!"}, {"name": "198X", "details_link": "https://www.metacritic.com/game/pc/198x", "publisher": "Hi-Bit Studios", "release_date": "Jun 20 2019", "developers": ["Hi-Bit Studios"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Party / Minigame", "2D"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/4c1fe8c01e7fbcb29ad68839a8e0bbf5-98.jpg", "descriptions": "Part 1 of arcade epic 198X. A coming-of-age story told through multiple games and genres. Experience the thrill of shooting, driving, jumping, fighting and role-playing in 5 full-blown arcade stages – combined with cinematic pixel-art storytelling."}, {"name": "The Incredibles: Rise of the Underminer", "details_link": "https://www.metacritic.com/game/xbox/the-incredibles-rise-of-the-underminer", "publisher": "THQ", "release_date": "Nov  1 2005", "developers": ["Heavy Iron Studios"], "platforms": "Xbox", "genres": ["Action", "Platformer", "3D"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/f36b43a10741f40946f404449ac89db0-98.jpg", "descriptions": "When the evil Underminer rises to the surface with a sinister plan to rule the world, it's up to Mr. Incredible and his super cool pal Frozone to save the day. While Mrs. Incredible, Violet, Dash, and Jack-Jack take care of things topside, Mr. Incredible and Frozone race underground to put aWhen the evil Underminer rises to the surface with a sinister plan to rule the world, it's up to Mr. Incredible and his super cool pal Frozone to save the day. While Mrs. Incredible, Violet, Dash, and Jack-Jack take care of things topside, Mr. Incredible and Frozone race underground to put a stop to the Underminer's dastardly plans and bury the diabolitical baddie once and for all! All-new action/adventure game. Play as Mr. Incredible or Frozone at anytime. Cooperative game-play with the ability to switch characters at any point in the game. Update your character's moves and abilities as you progress through the game.… Expand"}, {"name": "Suikoden IV", "details_link": "https://www.metacritic.com/game/playstation-2/suikoden-iv", "publisher": "Konami", "release_date": "Jan 11 2005", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/6955ef92d3a6a531ecc93fdad04665b6-98.jpg", "descriptions": "Suikoden IV features the return of the 108 Stars of Destiny, as well as an enhanced graphical interface and a new ground breaking battle system. Konami has taken the franchise to new heights with significant enhancements to the visual appearance of the characters and environments as well asSuikoden IV features the return of the 108 Stars of Destiny, as well as an enhanced graphical interface and a new ground breaking battle system. Konami has taken the franchise to new heights with significant enhancements to the visual appearance of the characters and environments as well as the introduction of a new innovative combat system with dynamic camera angles. Suikoden IV continues the gameplay tradition with players interacting with over 100 characters in vast and rich 3D environments as they battle new adversaries, explore new territory and embark on unforgettable adventures. [Konami]… Expand"}, {"name": "Supreme Ruler: Cold War", "details_link": "https://www.metacritic.com/game/pc/supreme-ruler-cold-war", "publisher": "Paradox Interactive", "release_date": "Jul 19 2011", "developers": ["BattleGoat Studios"], "platforms": "PC", "num_players": "16  Online", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/4f45e73cd24135a567b0e89c1b0eaf80-98.jpg", "descriptions": "In Supreme Ruler 2020: Cold War, players will enter a portrayal of the world in the year 2020 based on recent real-world headlines. Battle economic challenges, unstable governments and worldwide tensions in this grand strategy experience."}, {"name": "Hood: Outlaws & Legends", "details_link": "https://www.metacritic.com/game/playstation-5/hood-outlaws-legends", "publisher": "Focus Home Interactive", "release_date": "May  7 2021", "developers": ["Sumo Newcastle"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/39c045768592f903e3ebb1f102909e32-98.jpg", "descriptions": "In a violent, medieval world, outplay rival gangs in intense PvPvE multiplayer heists. Moving in stealth to steal treasures unseen or dominating through loud and brutal combat, only the best will escape with hard-earned riches."}, {"name": "This Is the Police", "details_link": "https://www.metacritic.com/game/playstation-4/this-is-the-police", "publisher": "THQ Nordic", "release_date": "Mar 22 2017", "developers": ["Weappy Studio"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Simulation", "Virtual", "Virtual Life", "Career"], "meta_score": 63, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/a35163d8561962d701d93a341e299617-98.jpg", "descriptions": "This Is the Police is a strategy/adventure game set in a city spiraling the drain. Taking the role of gritty Police Chief Jack Boyd, you'll dive into a deep story of crime and intrigue. Will Jack reach his retirement with a nice stack of bills, or will he end up broken ... or worse?"}, {"name": "Neon Chrome", "details_link": "https://www.metacritic.com/game/playstation-4/neon-chrome", "publisher": "10tons Entertainment", "release_date": "May 31 2016", "developers": ["10tons Entertainment", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/1fced6a4c9229f486acf24f5e4d60c0d-98.jpg", "descriptions": "Neon Chrome is a cyberpunk top-down shooter with a myriad of roguelite twists. Your mission is to stop the Overseer oppressing the people living in the gigantic arcology. [Playstation.com]"}, {"name": "FIFA Street 2", "details_link": "https://www.metacritic.com/game/xbox/fifa-street-2", "publisher": "EA Sports Big", "release_date": "Feb 28 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/087e9205ca2872ccdfc67982850a4d66-98.jpg", "descriptions": "FIFA Street 2 is second installment in EA's four-on-four soccer game. FIFA Street 2 will feature improved controls, many more tricks, and a new juggle mechanic. Take part in game modes, such as friendly, rule the street, and skills challenge. Choose from 20 national teams and 300-plusFIFA Street 2 is second installment in EA's four-on-four soccer game. FIFA Street 2 will feature improved controls, many more tricks, and a new juggle mechanic. Take part in game modes, such as friendly, rule the street, and skills challenge. Choose from 20 national teams and 300-plus real-life soccer stars. There are 10 playable venues ranging from London's Westway Leisure Center to the sandy beaches of Brazil. … Expand"}, {"name": "Fallout 76: Wastelanders", "details_link": "https://www.metacritic.com/game/playstation-4/fallout-76-wastelanders", "publisher": "Bethesda Softworks", "release_date": "Apr 14 2020", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/e518fe78823bdc5a6e41ec4ce81ff58b-98.jpg", "descriptions": "In addition to introducing fully voiced NPCs to the world of Fallout 76, Wastelanders brings a brand-new main questline, new locations, new enemies, new weapons, a new reputation system and much more."}, {"name": "Super Bomberman R", "details_link": "https://www.metacritic.com/game/xbox-one/super-bomberman-r", "publisher": "Konami", "release_date": "Jun 12 2018", "developers": ["Konami", "M2"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Puzzle", "Action", "Arcade"], "meta_score": 63, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/4639adfd90204e8cbcf059408ec20203-98.jpg", "descriptions": "New characters from the popular game series Ratchet & Clank make an appearance. Hailing from the Solana Galaxy, Ratchet Bomber is here with his trusty pal Clank strapped to his back. It’s time to save a whole new galaxy as the duo team up to bring their own brand of destruction to SuperNew characters from the popular game series Ratchet & Clank make an appearance. Hailing from the Solana Galaxy, Ratchet Bomber is here with his trusty pal Clank strapped to his back. It’s time to save a whole new galaxy as the duo team up to bring their own brand of destruction to Super Bomberman R.… Expand"}, {"name": "Cubemen 2", "details_link": "https://www.metacritic.com/game/wii-u/cubemen-2", "publisher": "Nnooo", "release_date": "Sep  4 2014", "developers": ["3 Sprockets"], "platforms": ["iPhone/iPad", "PC", "Wii U"], "num_players": "Up to 6 ", "genres": ["Action", "Strategy", "Real-Time", "General", "Defense"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/2efbc967d741ee484f94332e31755930-98.jpg", "descriptions": "Cubemen 2 is a fast paced, action packed, original 3D Strategy game where you use your little Cubemen units to defend and attack enemies in a range of awesome game modes including CTF, Skirmish, Territory and more."}, {"name": "NecroVisioN", "details_link": "https://www.metacritic.com/game/pc/necrovision", "publisher": "Aspyr", "release_date": "May 18 2009", "developers": ["The Farm 51"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/ef2b6629a604311eb4b7f2202bd42577-98.jpg", "descriptions": "NecroVisioN is a first person shooter that immerses gamers in the claustrophobic trenches and bunkers of the First WorldWar. Reminiscent of a Lovecraft horror, NecroVisioN seamlessly mixes the harrowing battlefields with a nightmarish demon and vampire underworld, unleashing a truly visceralNecroVisioN is a first person shooter that immerses gamers in the claustrophobic trenches and bunkers of the First WorldWar. Reminiscent of a Lovecraft horror, NecroVisioN seamlessly mixes the harrowing battlefields with a nightmarish demon and vampire underworld, unleashing a truly visceral experience. The year is 1916 and the Great War has been raging for two long years when Simon Buker, a US army soldier, joins the front line with the allied forces. During the ferocious fighting, Buker and his battalion get lost behind enemy lines while trying to break through to allied positions. While being pushed back into defensive positions they stumble across a series of mysterious trenches where all is not as it seems. As they push forward they discover that there is a greater evil hiding underneath the battlefields of the Great War, an evil which is forcing its way to our world and threatens to change the delicate balance of power. Battling his way through the trenches, Buker uncovers an enemy more deadly than anything he has ever encountered. Demons and vampires wage a brutal underground war, which is spilling into the human world, and Buker finds himself fighting not only for his own survival, but the survival of Mankind. [505 Games]… Expand"}, {"name": "Worms Forts: Under Siege", "details_link": "https://www.metacritic.com/game/playstation-2/worms-forts-under-siege", "publisher": "Sega", "release_date": "Mar 15 2005", "developers": ["Team17"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 63, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/8e71c6e8954425611bbe4bff93a87df2-98.jpg", "descriptions": "Worms Forts: Under Siege! puts players in command of a crack team of up to four fort-dwelling worms. Set in the cartoon environments that will be very familiar to Worms fans, players direct their worm garrison to construct defenses to maximize strategic advantages, expand castles, seizeWorms Forts: Under Siege! puts players in command of a crack team of up to four fort-dwelling worms. Set in the cartoon environments that will be very familiar to Worms fans, players direct their worm garrison to construct defenses to maximize strategic advantages, expand castles, seize valuable victory locations and of course, build massively destructive weapons to eliminate their opponents' fortifications. Players can test their mettle in a single-player game by battling through the 20 missions, or they can take on up to four friends in the frenzy of destruction that is Fort vs. Fort mode. Massive weapons and massive destruction, including catapults, cannons, giant crossbows, bows and arrows, rocket launchers, air strikes, napalm... even nuclear strikes; For the first time in the history of the series, players can build their own castle, including towers, walls, citadels and keeps. Each building will offer unique special powers and weapons, and poor choices may leave players lagging in the arms race. [Acclaim]… Expand"}, {"name": "Dirty Bomb", "details_link": "https://www.metacritic.com/game/pc/dirty-bomb", "publisher": "Nexon", "release_date": "Jun  1 2015", "developers": ["Splash Damage"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Shooter", "Modern", "Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 63, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/f71b8c2a7f19f6526b9b4fa10a0c85ed-98.jpg", "descriptions": "In the not-too-distant future, London has been abandoned, a shell of its former self. After a mysterious disaster, the international Crisis and Disaster Agency stepped in to clean up the mess and decontaminate the city. They failed... badly. Now the streets of London are the playground ofIn the not-too-distant future, London has been abandoned, a shell of its former self. After a mysterious disaster, the international Crisis and Disaster Agency stepped in to clean up the mess and decontaminate the city. They failed... badly. Now the streets of London are the playground of Private Military Companies (PMCs) who battle to control what remains of the city’s riches.… Expand"}, {"name": "World Poker Tour", "details_link": "https://www.metacritic.com/game/xbox/world-poker-tour", "publisher": "2K Sports", "release_date": "Oct 18 2005", "developers": ["2K Sports"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "6  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/b47965c4af0a098ff2b12a2302f27a05-98.jpg", "descriptions": "Exclusive World Poker Tour Presentation - Including real WPT venues such as Commerce Casino and the Aviation Club, broadcast style overlays and commentary featuring Mike Sexton and Vince Van Patten. Compete against the virtual equivalents of Antonio \"the Magician\" Esfandiari, ErickExclusive World Poker Tour Presentation - Including real WPT venues such as Commerce Casino and the Aviation Club, broadcast style overlays and commentary featuring Mike Sexton and Vince Van Patten. Compete against the virtual equivalents of Antonio \"the Magician\" Esfandiari, Erick Lindgren, Evelyn Ng, Lyle Berman, Michael \"the Grinder\" Mizrachi, and Phil \"Unabomber\" Laak, that play each situation just like their real-life counterparts. Go \"all in\" against players across the country with WPT's robust online functionality. Compete in tournaments, set up poker nights with your friends, manage buddy lists, and chat. Improve your poker playing skills by utilizing in-game tutorials and an in-depth stat tracking system that outlines your playing tendencies in numerous situations. Create a player, launch a career, and strive to become a WPT World Champion as you build your character's experience and boost your career earnings by competing in multiple game modes including Quick Play, Satellite Tour Play and WPT Season Play. Flaunt your success by using your earnings to deck out your player with hundreds of accessories. Create custom poker games by setting rules and limits with the poker game editor, or choose from 14 different community poker games including Texas Hold'em, Omaha, Pineapple, Double Flop Hold'em, Super Hold'em, Billabong, Tahoe and Shanghai.… Expand"}, {"name": "Moons of Madness", "details_link": "https://www.metacritic.com/game/playstation-4/moons-of-madness", "publisher": "Funcom", "release_date": "Mar 24 2020", "developers": ["Rock Pocket Games", "Dreamloop Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/b803c250be90d66c04dc6b16452ecfeb-98.jpg", "descriptions": "Moons of Madness is a first-person, story-driven cosmic horror game where the scientific exploration of Mars meets the supernatural dread of Lovecraft. As a technician stationed on Mars, you begin seeing and hearing things that aren’t there. Visions, hallucinations — is that even what it is?Moons of Madness is a first-person, story-driven cosmic horror game where the scientific exploration of Mars meets the supernatural dread of Lovecraft. As a technician stationed on Mars, you begin seeing and hearing things that aren’t there. Visions, hallucinations — is that even what it is? Or are you slowly descending into madness?… Expand"}, {"name": "Star Wars: The Force Unleashed II", "details_link": "https://www.metacritic.com/game/playstation-3/star-wars-the-force-unleashed-ii", "publisher": "LucasArts", "release_date": "Oct 26 2010", "developers": ["LucasArts"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/9ffe298ab01cfd9bc0d6b169072bae16-98.jpg", "descriptions": "With Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IVWith Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope.… Expand"}, {"name": "Shadow Warrior 3", "details_link": "https://www.metacritic.com/game/playstation-4/shadow-warrior-3", "publisher": "Devolver Digital", "release_date": "Mar  1 2022", "developers": ["Flying Wild Hog"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/30cc558591958e35bc43b809268517e5-98.jpg", "descriptions": "Shadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekickShadow Warrior 3 launches the offbeat first-person shooter series to the next level with a seamless blend of fast-paced gunplay, razor-sharp melee combat, and a spectacular free-running movement system. Fallen corporate shogun Lo Wang and his former employer turned nemesis turned sidekick Orochi Zilla embark on an improbable mission to recapture an ancient dragon they unwillingly unleashed from its eternal prison. Armed with a punishing mix of blades and bullets, Lo Wang must traverse uncharted parts of the world to track down the dark beast and push the apocalypse back yet again. All it will take is the mask of a dead god, a dragon's egg, a touch of magic, and enough firepower to hold off the impending cataclysm. Bring a Katana to a Gunfight. Conduct a symphony of death with each encounter by mixing overwhelming firepower with devastatingly precise katana strikes as you dash in and around the demonic hordes.\r Fancy Footwork\rFlow between nimble movement techniques including air dashes, wall running, double jumps, and the fancy new grappling hook busts your combat and movement options wide open in every battle.\r Execute Then Annihilate\rExecute spectacular finishing moves to claim a piece of your conquered foe and unleash its powers back on the horde in a burst of unstoppable fury and powerful magic.\r Dynamic Combat Arenas\rEach environment is lined with hazardous structures and devices that can be activated to add another layer of creative choice to the offensive strategy.\r Neo Feudal Japan\rTrek across a mythic Asian land infused with the magic and technology of ancient samurai, now overrun by the demonic yokai from Japanese folklore.\r Funny Business\rBrace for expertly delivered one-liners from Lo Wang, pointed banter with Zilla, and an intense thrill ride of absurd predicaments on the way to turning doomsday into a new day.… Expand"}, {"name": "Lost Grimoires: Stolen Kingdom", "details_link": "https://www.metacritic.com/game/xbox-one/lost-grimoires-stolen-kingdom", "publisher": "Artifex Mundi", "release_date": "Apr 28 2017", "developers": ["Artifex Mundi"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Puzzle", "Hidden Object"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/df1598043e40527fbc8b28dce064f392-98.jpg", "descriptions": "An alchemist’s apprentice returns home from university to finish her training under a great master. Things go awry when she revisits her family home, where dark secrets and the mystery of her parents’ disappearance lie buried. She will embark on a quest that can potentially change the faithAn alchemist’s apprentice returns home from university to finish her training under a great master. Things go awry when she revisits her family home, where dark secrets and the mystery of her parents’ disappearance lie buried. She will embark on a quest that can potentially change the faith of the entire realm and her own future forever.… Expand"}, {"name": "Resident Evil 6", "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-6", "publisher": "Capcom", "release_date": "Mar 29 2016", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/54f2852fca24cbd6f85df33f1d4b2880-98.jpg", "descriptions": "Resident Evil 6 is a Survival-Horror game that continues the struggle against the series' signature zombie inducing bio-terror, while raising the bar with all new game functionality. Players enjoy a diverse play experience, highlighted by the ability to select between three scenariosResident Evil 6 is a Survival-Horror game that continues the struggle against the series' signature zombie inducing bio-terror, while raising the bar with all new game functionality. Players enjoy a diverse play experience, highlighted by the ability to select between three scenarios featuring multiple characters and intertwined storylines. Within these scenarios both stories and action cross paths. Additional features include zombies as well as new enemies, upgradable firepower and characters, vehicle based options, the mini-game based Mercenaries mode, and single-player and co-op play options.… Expand"}, {"name": "Godzilla: Save the Earth", "details_link": "https://www.metacritic.com/game/xbox/godzilla-save-the-earth", "publisher": "Atari", "release_date": "Nov 16 2004", "developers": ["Pipeworks Software", "Inc."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "4  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 63, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/1dffe55bc0b691ad16b384686df2fe05-98.jpg", "descriptions": "The planet is under siege and it's up you to protect it. You must roam the earth, battling giant monsters, an alien invasion, and ongoing military attacks. This sequel to Godzilla: Destroy All Monsters Melee lets you rampage through the city as Godzilla, SpaceGodzilla, Mothra, Jet Jaguar,The planet is under siege and it's up you to protect it. You must roam the earth, battling giant monsters, an alien invasion, and ongoing military attacks. This sequel to Godzilla: Destroy All Monsters Melee lets you rampage through the city as Godzilla, SpaceGodzilla, Mothra, Jet Jaguar, and one of 15 other monsters. This time, you can take your rage online in four-player melees. In Save the Earth, the fate of Tokyo, San Francisco, New York, and other locations is in your hands.… Expand"}, {"name": "FIFA Street 3", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-street-3", "publisher": "EA Sports", "release_date": "Feb 18 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Arcade", "Arcade"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/483cfd1986202b77403154bcf6fa4a02-98.jpg", "descriptions": "Featuring over 250 of the world’s best players representing 18 of the top international teams, each player has been rendered into a stylized caricature with heroic qualities. Decked out in authentic training kits, every player boasts their own, distinctive style of play with unique abilitiesFeaturing over 250 of the world’s best players representing 18 of the top international teams, each player has been rendered into a stylized caricature with heroic qualities. Decked out in authentic training kits, every player boasts their own, distinctive style of play with unique abilities to match. Whether you’re after brawn, brains, silky skills or crunching tackles to complete your team, the perfect street player is out there. Choose from Tricksters, Enforcers, Playmakers and Finishers to give you different options on the ball and make your mark on the street. Fill up your all-new Game Breaker to power your ultimate abilities and express yourself like never before. Maneuver your players to leap past defenders, flip off walls, or perform gravity-defying one-timers to score spectacular goals. From the urban playgrounds of South America to the rooftops in Asia to the streets of Europe, your players perform to an eclectic selection of music seamlessly infused into the surroundings, where the game’s environments pulsate, and explode to life with every well-timed tackle, outrageous trick move or unstoppable shot on goal. [Electronic Arts]… Expand"}, {"name": "Finding Nemo", "details_link": "https://www.metacritic.com/game/xbox/finding-nemo", "publisher": "THQ", "release_date": "May  9 2003", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/3136118b506e6f448a00e909f4f1ca9b-98.jpg", "descriptions": "Dive into a thrilling underwater adventure.  Based on the movie from Disney and Pixar, Finding Nemo challenges you to reunite the young clownfish Nemo with his father Marlin.  You have the option to play as Marlin, Dory, or Nemo and, as you live the action of the film's storyline, you'llDive into a thrilling underwater adventure.  Based on the movie from Disney and Pixar, Finding Nemo challenges you to reunite the young clownfish Nemo with his father Marlin.  You have the option to play as Marlin, Dory, or Nemo and, as you live the action of the film's storyline, you'll meet all the other memorable characters.  Also, remember hilarious moments from the film through clips included in the game.   The search for Nemo is on, and it's up to you to find him.… Expand"}, {"name": "InnerSpace", "details_link": "https://www.metacritic.com/game/switch/innerspace", "publisher": "PolyKnight Games", "release_date": "Jan 16 2018", "developers": ["PolyKnight Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Civilian"], "meta_score": 63, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/88ffb4da523993f1ac87835ce5bba11e-98.jpg", "descriptions": "InnerSpace is an exploration flying game set in a world where physics are inverted. Take the role of an unnamed cartographer to explore the various bubble-worlds, collect relics, and encounter each bubble’s mythical demigod, in order to discover more about the universe, its history, and itsInnerSpace is an exploration flying game set in a world where physics are inverted. Take the role of an unnamed cartographer to explore the various bubble-worlds, collect relics, and encounter each bubble’s mythical demigod, in order to discover more about the universe, its history, and its future. … Expand"}, {"name": "Dragon's Prophet", "details_link": "https://www.metacritic.com/game/pc/dragons-prophet", "publisher": "Sony Online Entertainment", "release_date": "Aug 13 2013", "developers": ["Runewaker Entertainment"], "platforms": "PC", "genres": ["Role-Playing", "General", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 63, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/da966500b0cc1fe8b0af227309ede779-98.jpg", "descriptions": "Dragon's Prophet features an action-based combat system that gives players more realistic battle action gameplay. Set in a realm where dragons roam the land, sea and air, the game lets players align and battle with a variety of dragons as they work to restore order to the land from the evilDragon's Prophet features an action-based combat system that gives players more realistic battle action gameplay. Set in a realm where dragons roam the land, sea and air, the game lets players align and battle with a variety of dragons as they work to restore order to the land from the evil Black Dragon that has escaped his eternal prison, unleashed his fire and is more dangerous than ever.… Expand"}, {"name": "NBA 09 The Inside", "details_link": "https://www.metacritic.com/game/playstation-3/nba-09-the-inside", "publisher": "SCEA", "release_date": "Oct  7 2008", "developers": ["SCEA San Diego Studios"], "platforms": "PlayStation 3", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/670a3a52f8705f9640488ee869240cfb-98.jpg", "descriptions": "For the first time on PS3, NBA 09 The Inside includes \"The Life\", providing fans with a unique and inside experience of life in the league. This year The life starts fresh, allowing players to control the paths of three different characters while guiding them through all-new challenges andFor the first time on PS3, NBA 09 The Inside includes \"The Life\", providing fans with a unique and inside experience of life in the league. This year The life starts fresh, allowing players to control the paths of three different characters while guiding them through all-new challenges and storylines in the quest to go from development league to the NBA. In addition to The Life, NBA 09 The Inside delivers a full featured Franchise Mode, allowing players to experience every facet of running their own NBA team. NBA 09 The Inside once again showcases its progression system, where players earn skill and experience rewards used to thoroughly customize player appearance and play styles. This year, players can customize up to five different players to take through the progression update. Also for this year, in game lighting has been revamped along with updated character animations and skin textures to provide a higher level of detail and realism. Adding to the atmosphere, NBA 09 The Inside utilizes a true T.V. broadcast presentation with highlights, a broadcast-style camera, and a comprehensive and in-depth audio commentary with top broadcast talent. With new modes, revamped character models and environments, and a robust online system with player profiles and quick play options, NBA 09 The Inside promises to push the envelope for NBA action. [SCEA]… Expand"}, {"name": "DreamWorks Shark Tale", "details_link": "https://www.metacritic.com/game/pc/dreamworks-shark-tale", "publisher": "Activision", "release_date": "Sep 27 2004", "developers": ["Amaze Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/91efe5c27d98b0ac5a9fdbe509db33bf-98.jpg", "descriptions": "In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish?at least that?s what he wants you think. Dive in to the urban, underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on theIn the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish?at least that?s what he wants you think. Dive in to the urban, underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on the DreamWorks animated feature, Shark Tale features 25 funky fresh missions ripped straight from the film, the hottest hip-hop tracks from your favorite artists and more exhilarating gameplay variety than any other movie game in the reef. Groove through Reef City with Oscar and explore locations like the Whale Wash, the Sunken Liner and the underwater underworld hideout, Seahorse Race Track. Careen through the coral at break-fin speed on the back of a friendly taxi fish. Beat your opponent while dodging traffic and fending off menacing great white sharks! Bust some serious Fish Fu in challenging fighting sequences. Flex your fins, talk some smack and fillet your opponent with tail slaps, head butts and dazzling combo attacks. Get those fins up and boogie down. Win over Reef City residents and garner the affections of your favorite ladyfish with your stylin? hip-hop dance moves. Don?t just talk big?swim big. Get in the game and prove you got what it takes to out-fin the evil Great Whites and become Reef City?s greatest hero. [Activision]… Expand"}, {"name": "X-Men: Next Dimension", "details_link": "https://www.metacritic.com/game/gamecube/x-men-next-dimension", "publisher": "Activision", "release_date": "Oct 15 2002", "developers": ["Exakt"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 63, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/0438801492181092e2dabc8fbe7e1213-98.jpg", "descriptions": "Fight in epic superhero showdowns against 24 of your favorite X-Men characters. In X-Men: The Next Dimension, a powerful enemy plots to rid the world of mutants, and only the X-Men can stop him. Choose from traditional or new X-Men--each with his or her own special fighting abilities andFight in epic superhero showdowns against 24 of your favorite X-Men characters. In X-Men: The Next Dimension, a powerful enemy plots to rid the world of mutants, and only the X-Men can stop him. Choose from traditional or new X-Men--each with his or her own special fighting abilities and objects to interact with--and battle through destructible environments. Your mission to save the future will uncover secrets about your own past.… Expand"}, {"name": "Alpha Protocol", "details_link": "https://www.metacritic.com/game/xbox-360/alpha-protocol", "publisher": "Sega", "release_date": "Jun  1 2010", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Western-Style"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/88e7017c0ae207c783f66e3c59b5da00-98.jpg", "descriptions": "Alpha Protocol is an espionage role-playing game set in the modern world. Loyalty carries a price and no one knows this more than agent Michael Thorton. A talented young agent cast out by his government, Thorton is the only one with the information needed to stop an impending internationalAlpha Protocol is an espionage role-playing game set in the modern world. Loyalty carries a price and no one knows this more than agent Michael Thorton. A talented young agent cast out by his government, Thorton is the only one with the information needed to stop an impending international catastrophe. To do so means he must cut himself off from the very people he is sworn to protect. As players determine how to accomplish different objectives, the decisions made and actions taken in each mission will ultimately transform the type of secret agent Michael Thorton will become. Every choice the player makes as Michael Thorton will carry consequences for his future and the fate of the world. [Sega]… Expand"}, {"name": "Spectrobes", "details_link": "https://www.metacritic.com/game/ds/spectrobes", "publisher": "Buena Vista Games", "release_date": "Mar  6 2007", "developers": ["Jupiter Corporation"], "platforms": "DS", "num_players": "1-16 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 63, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/dab504e14f272940524ebd1e66d575d2-98.jpg", "descriptions": "Faced with the daunting task of defeating the Krawl, a powerful force poised to destroy the galaxy, Rallen and Jeena must excavate, awaken and train Spectrobes, prehistoric creatures that have recently been discovered. Only by enlisting the help of these ancient beings will Rallen and JeenaFaced with the daunting task of defeating the Krawl, a powerful force poised to destroy the galaxy, Rallen and Jeena must excavate, awaken and train Spectrobes, prehistoric creatures that have recently been discovered. Only by enlisting the help of these ancient beings will Rallen and Jeena be able to save the galaxy from certain demise. Players progress through the game and complete their mission by training each Spectrobe, helping them to evolve and become more powerful. With highly customizable elements and powers, gamers can tailor unique Spectrobes to fit their playing style. Spectrobes, featuring the look and feel of Japanese anime and manga, immerses players in its engaging story and fascinating characters. [Buena Vista Games]… Expand"}, {"name": "PixelJunk 4am", "details_link": "https://www.metacritic.com/game/playstation-3/pixeljunk-4am", "publisher": "SCEA", "release_date": "May 15 2012", "developers": ["Q-Games"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "General", "Music Maker", "Music Maker", "Application"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/45097280969492087d58e9305e1eb1ff-98.jpg", "descriptions": "Spiral into the crazy, ambient, mellow world of PixelJunk 4am. Create your own music using 4ams unique Virtual Audio Canvas to mix tracks, experiment with audio effects and control your composition using the PlayStation Move controllers full range of motion. 4am gives you the power to makeSpiral into the crazy, ambient, mellow world of PixelJunk 4am. Create your own music using 4ams unique Virtual Audio Canvas to mix tracks, experiment with audio effects and control your composition using the PlayStation Move controllers full range of motion. 4am gives you the power to make breathtaking music and visuals and perform live to the world through streaming on PSN.\r Consumption of hallucinogens not compulsory prior to play.… Expand"}, {"name": "Assassin's Creed Chronicles: India", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-chronicles-india", "publisher": "Ubisoft", "release_date": "Jan 13 2016", "developers": ["Ubisoft", "Climax Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["General", "Action Adventure", "Linear"], "meta_score": 63, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/1/856eae7e53afb72fd38723a41d79e837-98.jpg", "descriptions": "Assassin's Creed Chronicles: India throws you into the tension between the Sikh Empire and the East India Company in 1841. When a Master Templar arrives with a mysterious item that used to belong to the Assassin Order, Arbaaz Mir must discover why he's come, steal back the item, and protectAssassin's Creed Chronicles: India throws you into the tension between the Sikh Empire and the East India Company in 1841. When a Master Templar arrives with a mysterious item that used to belong to the Assassin Order, Arbaaz Mir must discover why he's come, steal back the item, and protect his friends and his lover.… Expand"}, {"name": "Airheart: Tales of Broken Wings", "details_link": "https://www.metacritic.com/game/playstation-4/airheart-tales-of-broken-wings", "publisher": "Blindflug Studios", "release_date": "Jul 24 2018", "developers": ["Blindflug Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 63, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/33c1422d87fa9c48983fdbe2e0618472-98.jpg", "descriptions": "AIRHEART follows Amelia, a young pilot and sky-fisherwoman who dreams of reaching the stratosphere and catching the legendary Skywhale, a feat that promises riches and fame through the ages. Skyfishing is a cutthroat business, though, and Amelia must outmaneuver sky pirates and automatedAIRHEART follows Amelia, a young pilot and sky-fisherwoman who dreams of reaching the stratosphere and catching the legendary Skywhale, a feat that promises riches and fame through the ages. Skyfishing is a cutthroat business, though, and Amelia must outmaneuver sky pirates and automated security zones to survive each perilous flight through the beautiful world of floating islands in the clouds she calls home.… Expand"}, {"name": "DarkStar One: Broken Alliance", "details_link": "https://www.metacritic.com/game/xbox-360/darkstar-one-broken-alliance", "publisher": "Kalypso", "release_date": "Jul 13 2010", "developers": ["Gaming Minds Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/a5d6c0e83828e3f8649048a596e24761-98.jpg", "descriptions": "DarkStar One - Broken Alliance sees players exploring the vast reaches of space, encountering, battling and trading with six mysterious alien races in a quest to unravel the mysterious death of the protagonist’s father. Players can create their own career paths – be it brigand, mercenary,DarkStar One - Broken Alliance sees players exploring the vast reaches of space, encountering, battling and trading with six mysterious alien races in a quest to unravel the mysterious death of the protagonist’s father. Players can create their own career paths – be it brigand, mercenary, privateer, merchant or whatever mix they please, while buying (or capturing) alien technology to customise their highly adaptable ship, the DarkStar One, with hundreds of possible combinations of weapons, shields, armour and components.… Expand"}, {"name": "Big Bumpin'", "details_link": "https://www.metacritic.com/game/xbox-360/big-bumpin", "publisher": "King Games", "release_date": "Nov 19 2006", "developers": ["Blitz Games"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 63, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/5aa4436018049e0745928b15c234072f-98.jpg", "descriptions": "[Playable on the Xbox and Xbox 360. Available only at Burger King Restaurants from Nov. 19 through Dec. 24, 2006 for $3.99 and the purchase of a BK Value Meal.]  Big Bumpin' looks like a traditional carnival bumper car ride and features familiar Burger King icons, including the Subservient[Playable on the Xbox and Xbox 360. Available only at Burger King Restaurants from Nov. 19 through Dec. 24, 2006 for $3.99 and the purchase of a BK Value Meal.]  Big Bumpin' looks like a traditional carnival bumper car ride and features familiar Burger King icons, including the Subservient Chicken and Brooke Burke. But, there's a catch – Big Bumpin' arenas come with some big hazards, like surprise saws, bottomless pits and \"power up\" items that let gamers dole out thundering bumps. With several different types of game play, gamers have a chance to hone their bumper car skills in a variety of challenging scenarios. The game features theme parks, including the \"Ice Box,\" \"Broiler,\" \"King's Court,\" \"The Deep\" and \"Monsoon of Doom,\" and three modes of play for each – intense four-player and XBOX Live-supported. Easy to learn. Fun to play. Difficult to avoid a major crash. [King Games]… Expand"}, {"name": "King's Bounty II", "details_link": "https://www.metacritic.com/game/pc/kings-bounty-ii", "publisher": "1C Entertainment", "release_date": "Aug 24 2021", "developers": ["1C Entertainment", "1C-Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 63, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/72aad50f0145490acb1def1949029b3d-98.jpg", "descriptions": "Offering a fresh take on the fantasy series, King’s Bounty 2 expands upon its tactical turn-based battles to offer players a truly immersive RPG experience that adds weight to their every decision, whether leading an army into battle against unliving horrors, or building relations with localOffering a fresh take on the fantasy series, King’s Bounty 2 expands upon its tactical turn-based battles to offer players a truly immersive RPG experience that adds weight to their every decision, whether leading an army into battle against unliving horrors, or building relations with local townsfolk. Experience a rich world that blends realism and fantasy, filled with compelling stories, memorable characters and moral choices aplenty. Taking on the mantle of one of three heroes – each with their own unique story – players embark on a non-linear, open-world adventure across a detailed and densely-packed fantasy landscape. Split into two distinct phases, players traverse the realm from a third-person perspective, picking up quests, exploring the wilderness, and getting to know the people they meet. When conflict arises, however, the perspective shifts to tactical, turn-based combat. Players must then make smart use of their units as they fight to win. Set in the vast realms of Antara, a great danger has arisen. A mysterious blight has descended upon its furthest reaches, corrupting the land and all who live there. Refugees from the affected regions have begun arriving in the kingdom of Nostria, putting food and resources in short supply. Once living souls, blight-distorted creatures now roam the countryside leaving chaos and destruction in their wake. The land itself fights for survival, giving your decisions greater weight than ever before. How will you forge Antara’s future?… Expand"}, {"name": "Citadel: Forged with Fire", "details_link": "https://www.metacritic.com/game/xbox-one/citadel-forged-with-fire", "publisher": "Blue Isle Studios", "release_date": "Nov  1 2019", "developers": ["Blue Isle Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 40 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/0f34e8c79e94448296a360543a995961-98.jpg", "descriptions": "A massive online sandbox RPG with elements of magic, spellcasting and inter-kingdom conflict. As a newly minted apprentice of the magic arts, you will set off to investigate the dangerous world of Ignus. Your goal: create a name for yourself and achieve notoriety and power among the land'sA massive online sandbox RPG with elements of magic, spellcasting and inter-kingdom conflict. As a newly minted apprentice of the magic arts, you will set off to investigate the dangerous world of Ignus. Your goal: create a name for yourself and achieve notoriety and power among the land's ruling Houses.… Expand"}, {"name": "Dogos", "details_link": "https://www.metacritic.com/game/xbox-one/dogos", "publisher": "INTERNET URL S.A.", "release_date": "Sep  7 2016", "developers": ["INTERNET URL S.A."], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/c11693b5b86336333a86512eb7566712-98.jpg", "descriptions": "Putting the player in the shoes of Desmond Phoenix, a skilled pilot in command of sophisticated ships equipped with various types of powerful weapons, DOGOS invites you to explore 14 original open world levels completely made in 3D, giving players the opportunity to meet goals from any anglePutting the player in the shoes of Desmond Phoenix, a skilled pilot in command of sophisticated ships equipped with various types of powerful weapons, DOGOS invites you to explore 14 original open world levels completely made in 3D, giving players the opportunity to meet goals from any angle they can imagine! Intensive action, an insane amount of shooting and explosions, (not kidding a lot of explosions), all accompanied by an incredible and catchy soundtrack.… Expand"}, {"name": "NBA 08", "details_link": "https://www.metacritic.com/game/playstation-3/nba-08", "publisher": "SCEA", "release_date": "Oct 12 2007", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/59d31b29b5a40c831469d49517b9838a-98.jpg", "descriptions": "To complement the fast-paced basketball action, NBA 08 introduces an all-new progression system where players earn skill and experience rewards that can be used to thoroughly customize player appearance and play styles. With a control system from last year that utilizes broader SIXAXISTo complement the fast-paced basketball action, NBA 08 introduces an all-new progression system where players earn skill and experience rewards that can be used to thoroughly customize player appearance and play styles. With a control system from last year that utilizes broader SIXAXIS functionality, gamers can engage in all-new and comprehensive gameplay movement on and off the ball. Also for this year, character models are updated with new animations, more dynamic movement, and new skin textures to give them a more realistic look. Additionally, the user interface has been revamped to incorporate a retro NBA look and feel – from the menus down to the loading screens. To submerse gamers in a true basketball atmosphere, NBA 08 introduces for the first time a comprehensive and in-depth audio commentary with top broadcast talent. The game features a fully reworked user interface, revamped character models and environments, and a robust online system with player profiles and quick play options. [SCEA]… Expand"}, {"name": "Windlands", "details_link": "https://www.metacritic.com/game/playstation-4/windlands", "publisher": "Psytec Games Ltd", "release_date": "Oct 25 2016", "developers": ["Psytec Games Ltd"], "platforms": ["PC", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/a6a21d2814bae9cff73a8e846cb1c314-98.jpg", "descriptions": "This is a first-person grappling hook exploration game. Soar through the ruins of a fallen world and discover the secrets of the ancients. Windlands has been developed primarily for Virtual Reality headsets, but is also an experience for those without headsets."}, {"name": "Major League Baseball 2K8", "details_link": "https://www.metacritic.com/game/wii/major-league-baseball-2k8", "publisher": "2K Sports", "release_date": "Mar  3 2008", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 63, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/d4d724e5acbd4706d21093f1405b5caa-98.jpg", "descriptions": "Although he is best known for his speed and base-stealing ability, the Mets' Jose Reyes is also one of the most well-rounded players in the game and is the first player in baseball history to have more than 63 steals, 120 runs, 192 hits, and 19 homers in a single season. Reyes led the MajorAlthough he is best known for his speed and base-stealing ability, the Mets' Jose Reyes is also one of the most well-rounded players in the game and is the first player in baseball history to have more than 63 steals, 120 runs, 192 hits, and 19 homers in a single season. Reyes led the Major League in 2006 with 17 triples and 64 stolen bases and set a new Mets club record with 104 hits at Shea Stadium. Also an avid video gamer and long time fan of 2K Sports’ products, All-Star Shortstop Jose Reyes is a natural fit as the official spokesperson for this year's edition of the critically acclaimed Major League Baseball 2K series. [2K Sports]… Expand"}, {"name": "The World Next Door", "details_link": "https://www.metacritic.com/game/switch/the-world-next-door", "publisher": "Rose City Games", "release_date": "Mar 27 2019", "developers": ["Rose City Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/04b4d1c53498d3155cb7d51f2a30bd5b-98.jpg", "descriptions": "The World Next Door is a narrative-driven, action-adventure game that follows Jun, a rebellious teen girl trapped in a parallel world inhabited by magical creatures. Inspired by the emotional storytelling and thrilling action of both anime and indie games, players can expect to meet andThe World Next Door is a narrative-driven, action-adventure game that follows Jun, a rebellious teen girl trapped in a parallel world inhabited by magical creatures. Inspired by the emotional storytelling and thrilling action of both anime and indie games, players can expect to meet and develop friendships with an eclectic cast of characters while uncovering the mysteries hidden within this world. … Expand"}, {"name": "Dynasty Warriors 8 Empires", "details_link": "https://www.metacritic.com/game/playstation-4/dynasty-warriors-8-empires", "publisher": "Koei Tecmo Games", "release_date": "Feb 24 2015", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 63, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/5c255df5f6c51dc0a48e0f01ba0a7919-98.jpg", "descriptions": "DYNASTY WARRIORS 8 Empires centers on the chaotic lives of warriors as their critical decisions affect the rise and fall of the nations in Ancient China as they gamely fight across vast plains, bleak wastelands, narrow ravines and immense castles. Players can select from 83 characters, orDYNASTY WARRIORS 8 Empires centers on the chaotic lives of warriors as their critical decisions affect the rise and fall of the nations in Ancient China as they gamely fight across vast plains, bleak wastelands, narrow ravines and immense castles. Players can select from 83 characters, or create their own original character. The visual customization available in Edit Mode goes further with the newly implemented ability to customize horses, banners and \"normal\" officers. Warriors must fight against not only enemies but also the forces of nature as the changing seasons bring new elements to the more than 35 battlefields affected by seasons and the passing of time. Additionally, the game’s Custom Scenario mode adds the ability to control what will happen across the vast Chinese continent, allowing players to adjust every last detail to form a brand new Three Kingdoms world. [KOEI]… Expand"}, {"name": "The Immortals of Terra: A Perry Rhodan Adventure", "details_link": "https://www.metacritic.com/game/pc/the-immortals-of-terra-a-perry-rhodan-adventure", "publisher": "Viva Media", "release_date": "Jul  3 2008", "developers": ["Braingame"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Sci-Fi", "Sci-Fi", "Third-Person"], "meta_score": 63, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/11d6b5fe44a2cab33a98167d23449e33-98.jpg", "descriptions": "(Also known as \"Rhodan: Myth of the Illochim\")  The year is 1346 by the New Galactic Calendar (4934). Almost 3000 years have passed since Perry Rhodan landed on the moon in his Saturn rocket STARDUST and encountered Arkonide space travdelers. Mankind's first contact with a sophisticated(Also known as \"Rhodan: Myth of the Illochim\")  The year is 1346 by the New Galactic Calendar (4934). Almost 3000 years have passed since Perry Rhodan landed on the moon in his Saturn rocket STARDUST and encountered Arkonide space travdelers. Mankind's first contact with a sophisticated alien race changed history: Immortalized by a cell activator, PERRY has held the Terrans' fate in his hands ever since. [BrainGame]… Expand"}, {"name": "NBA Live 07", "details_link": "https://www.metacritic.com/game/playstation-2/nba-live-07", "publisher": "EA Sports", "release_date": "Sep 25 2006", "developers": ["EA Sports"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/cc9817d93cc23d3c68b731d22e575090-98.jpg", "descriptions": "NBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a newNBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a new feature that gives users more control over athletes than ever. By introducing a next generation AI system that is both intuitive and intelligent, combined with advancements to fan-favorite features like All-Star Weekend and Dynasty Mode, NBA LIVE 07 continues to deliver its award-winning gameplay experience. This year NBA LIVE 07 partners with the worldwide leader in sports to deliver more ESPN content in-game while you play than ever before. [Electronic Arts]… Expand"}, {"name": "Indiana Jones and the Staff of Kings", "details_link": "https://www.metacritic.com/game/psp/indiana-jones-and-the-staff-of-kings", "publisher": "LucasArts", "release_date": "Jun  9 2009", "developers": ["Amaze Entertainment", "Amaze"], "platforms": ["PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/20b74f169cf240f5811af5ee4b1ea754-98.jpg", "descriptions": "Step into the shoes of the legendary hero, Indiana Jones, in an all new epic adventure! Set in the year 1939, Indiana Jones and the Staff of Kings follows the rogue archaeologist on an all-new globe-trotting quest. From San Francisco's Chinatown to the lush jungles of Panama, Indy must useStep into the shoes of the legendary hero, Indiana Jones, in an all new epic adventure! Set in the year 1939, Indiana Jones and the Staff of Kings follows the rogue archaeologist on an all-new globe-trotting quest. From San Francisco's Chinatown to the lush jungles of Panama, Indy must use his whip, fists and wits to fight through ruthless opposition as he spars with his nemesis, Magnus Völler, in a race for a relic of biblical proportions - the Staff of Moses. Indiana Jones and the Staff of Kings features completely interactive environments, where players need to call upon their wits and daring to make each spring-loaded environment a weapon in order to dispense of foes in clever and unexpected ways. Also, embark upon thrilling action sequences that remain true to the spirit established in scenes such as Indy's pursuit of the motorcade in Raiders of the Lost Ark, the mine-cart scene in Indiana Jones and the Temple of Doom, and the free-for-all aboard the tank in Indiana Jones and the Last Crusade. The PSP system version features a variety of robust types of burst gameplay including combat and physics challenges, puzzles and the trademark Indiana Jones chase sequences.[LucasArts]… Expand"}, {"name": "Eragon", "details_link": "https://www.metacritic.com/game/ds/eragon", "publisher": "Sierra Entertainment", "release_date": "Nov 14 2006", "developers": ["Amaze Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Action", "Role-Playing", "Action Adventure", "Action RPG", "General", "Fantasy", "Beat-'Em-Up", "Japanese-Style", "3D"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/351ba7cc04eef141584e80a76b5ffb2e-98.jpg", "descriptions": "Play as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features aPlay as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features a variety of blistering attacks and defences, including a unique degradable block system. Extensive Dragon Combat – Ride Saphira and blast your enemies with bursts of fire, and call in devastating dragon attacks during melee battles. Eragon features multiplayer co-op with team attack bonuses and dragon fight/flight combo gameplay. Full cooperation from the film production team provides faithful implementation of the movie's look-and-feel. As Eragon discovers the powers hidden within him he learns to unleash magical attacks to decimate his foes. [Vivendi Games]… Expand"}, {"name": "Chocobo GP", "details_link": "https://www.metacritic.com/game/switch/chocobo-gp", "publisher": "Square Enix", "release_date": "Mar 10 2022", "developers": ["Square Enix", "Arika"], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Other"], "meta_score": 63, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/6/ebd05e2f7bbf4d02677204039acddb58-98.jpg", "descriptions": "Ready. Set. Chocobo! Start your engines and get set for a new racing experience, featuring a roster of dozens of your favorite Chocobo characters, complete with their own unique abilities and variants. Equip Magicites and take out the competition as you drift through various familiar coursesReady. Set. Chocobo! Start your engines and get set for a new racing experience, featuring a roster of dozens of your favorite Chocobo characters, complete with their own unique abilities and variants. Equip Magicites and take out the competition as you drift through various familiar courses in online and offline multiplayer modes. Compete in tournaments and become the reigning champion of GP!\r… Expand"}, {"name": "Sniper Elite III", "details_link": "https://www.metacritic.com/game/xbox-one/sniper-elite-iii", "publisher": "505 Games", "release_date": "Jul  1 2014", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Shooter", "Historic", "Action", "Shooter", "Third-Person", "Tactical", "Historic"], "meta_score": 63, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/b66ccef6cb8609d07856a79ed8f536e9-98.jpg", "descriptions": "Sniper Elite 3 continues  the story of elite OSS sniper Karl Fairburne during World War II. The title takes players to the unforgiving yet exotic terrain of WWII’s North Africa conflict in a battle against a deadly new foe."}, {"name": "Assassin's Creed: Bloodlines", "details_link": "https://www.metacritic.com/game/psp/assassins-creed-bloodlines", "publisher": "Ubisoft", "release_date": "Nov 17 2009", "developers": ["Griptonite Games"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/75e373d620d78bbf7bc2d891239a1097-98.jpg", "descriptions": "For the first time, become a Master Assassin on the PSP system with Assassin's Creed: Bloodlines. Follow the story of Altair immediately following the events of Assassin’s Creed and track down the last of the Templars who have fled the Holy Land and retreated to the Island of Cyprus. [SCEA]"}, {"name": "Penny-Punching Princess", "details_link": "https://www.metacritic.com/game/switch/penny-punching-princess", "publisher": "NIS America", "release_date": "Apr  3 2018", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/71b8de8296939462eed09ea5adb8c51c-98.jpg", "descriptions": "Use the money you gather to bribe enemies to fight for you, activate deadly traps with your dough, and when all else fails, smash all that stand against you with your fists! Fight your way from nothing and amass treasures to take on the mighty Dragoloan family and reclaim your kingdom."}, {"name": "Gibbon: Beyond the Trees", "details_link": "https://www.metacritic.com/game/switch/gibbon-beyond-the-trees", "publisher": "Broken Rules", "release_date": "May 11 2022", "developers": ["Broken Rules"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/641c59437755443c020913f52a517ecd-98.jpg", "descriptions": "Gibbon: Beyond the Trees is a hand-drawn adventure following a lost gibbon as they embark on a dangerous journey into unknown lands. Race to freedom in liberation mode, or play through an hour-long narrative that captures the real struggle of living creatures around the world.Master theGibbon: Beyond the Trees is a hand-drawn adventure following a lost gibbon as they embark on a dangerous journey into unknown lands. Race to freedom in liberation mode, or play through an hour-long narrative that captures the real struggle of living creatures around the world.Master the gibbon's art of brachiation (swinging from branch to branch) at high speed, building momentum, pulling off spectacular somersaults, and launching yourself higher and further into the air with the help of your fellow Gibbons, feeling the thrill and exhilaration of life in an untamed jungle.… Expand"}, {"name": "The Ramp", "details_link": "https://www.metacritic.com/game/switch/the-ramp", "publisher": "Coatsink Software", "release_date": "Mar 17 2022", "developers": ["Hyperparadise"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/3131d7a6c7605ef89be372cee939827b-98.jpg", "descriptions": "You crave for flow? You just want to shred through a halfpipe without all the boring stuff? Say no more, The Ramp is your jam!\r The Ramp captures the unparalleled feeling of real life vert skateboarding and that's pretty much it. There is a lot this game doesn't feature. What it offers youYou crave for flow? You just want to shred through a halfpipe without all the boring stuff? Say no more, The Ramp is your jam!\r The Ramp captures the unparalleled feeling of real life vert skateboarding and that's pretty much it. There is a lot this game doesn't feature. What it offers you are the 15 minutes of flow that make a boring day great, at the price of a medium sized cinnamon pistachio latte to go.… Expand"}, {"name": "Fatal Frame: Maiden of Black Water", "details_link": "https://www.metacritic.com/game/playstation-5/fatal-frame-maiden-of-black-water", "publisher": "Koei Tecmo Games", "release_date": "Oct 28 2021", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/2471d92749e89e0bf1c5c09a0a0700cc-98.jpg", "descriptions": "The Fatal Frame series lives again.  (Also know as Project Zero...) Fatal Frame: Maiden of Black Water is comprised of three interconnected stories that converge to uncover the truth behind a recent string of tragic deaths in a forest marred by a history of suicides. As one of three peopleThe Fatal Frame series lives again.  (Also know as Project Zero...) Fatal Frame: Maiden of Black Water is comprised of three interconnected stories that converge to uncover the truth behind a recent string of tragic deaths in a forest marred by a history of suicides. As one of three people with the power of the Camera Obscura and the ability to see the shadows of those spirited away, youll explore the ruins of an eerie inn, a shrine filled with life-size dolls, and a lake full of dead priestesses. Each shadowy location is connected by a stream of water flowing throughout the mountain, and this once holy water is tied to the darkest mystery of allthe history of death and darkness on Mt. Hikami.\r Features:\r *    Survive this horrifying new entry in the Fatal Frame series\r*    Explore sinister locales like an underground cave for human sacrifices and a shrine for life-sized dolls\r*    Use the Wii U GamePad controller as your Camera Obscurayour only defense against fatal ghosts\r*    Mt. Hikami is coursing with inexplicably dangerous water; stay dry or die\r*    Investigate and stay alive on the deadly Mt. Hikami… Expand"}, {"name": "Nickelodeon All-Star Brawl", "details_link": "https://www.metacritic.com/game/pc/nickelodeon-all-star-brawl", "publisher": "GameMill Entertainment", "release_date": "Oct  5 2021", "developers": ["Ludosity Interactive", "Fair Play Labs"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 63, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/8e85dd2c663a042b0d93626e24ad90e4-98.jpg", "descriptions": "THE ALL-STAR BRAWL BEGINS!Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles,THE ALL-STAR BRAWL BEGINS!Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles, Invader Zim, and many more, to determine the ultimate champion. With unique moves and attacks drawn directly from their identifiable personalities, each brawler has its own style of play for endless action.… Expand"}, {"name": "Cobra Kai: The Karate Kid Saga Continues", "details_link": "https://www.metacritic.com/game/switch/cobra-kai-the-karate-kid-saga-continues", "publisher": "GameMill Entertainment", "release_date": "Oct 27 2020", "developers": ["GameMill Entertainment", "Flux Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 63, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/e22eecaa5dcf9dc95454ba4714d8a94a-98.jpg", "descriptions": "CHOOSE A SIDE. EMBRACE YOUR DESTINY. THE FIGHT IS IN YOUR HANDS NOW.Choose a side, master your moves, and embrace your destiny in an epic beat 'em up adventure inspired by the hit show. Take control of 8 playable characters with co-op multiplayer, deep move sets, combos, progression,CHOOSE A SIDE. EMBRACE YOUR DESTINY. THE FIGHT IS IN YOUR HANDS NOW.Choose a side, master your moves, and embrace your destiny in an epic beat 'em up adventure inspired by the hit show. Take control of 8 playable characters with co-op multiplayer, deep move sets, combos, progression, real-time character swaps, ultimate attacks, and much more! 34 years after the events of the 1984 All Valley Karate Tournament, the rivalry of Daniel LaRusso and Johnny Lawrence continues. The fight is in your hands now!Two-Fold Storyline Featuring an all-new storyline filled with unique cutscenes and dialog choose to take control of Daniel and his students at Miyagi-Do Karate through a storyline campaign. Or select their rivals, Johnny Lawrence and his disciples at Cobra Kai to play their side of the story. Completing both sides of the campaign unveils an ultimate ending.Live the Cobra Kai UniverseExplore Los Angeles in the Cobra Kai universe across 28 missions filled with characters and enemies from the show.Character Swap SystemChoose your Dojo then seamlessly swap between your favorite characters from the story.RPG-Like Dojo ProgressionMaster 40 unique skills and upgrade your characters' stats as you karate your way through enemies.… Expand"}, {"name": "The Godfather II", "details_link": "https://www.metacritic.com/game/pc/the-godfather-ii", "publisher": "Electronic Arts", "release_date": "Apr  7 2009", "developers": ["EA Redwood Shores"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Adventure", "Third-Person", "Historic", "Linear", "Open-World", "Modern"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/e53db22b59b8c5abeeba02001008dbc8-98.jpg", "descriptions": "After being promoted by Michael Corleone to Don of New York, players expand to new cities, as they build up their families through extorting businesses, monopolizing illegal crime rings and defeating new families in an effort to become the most powerful mob family in America. To help playersAfter being promoted by Michael Corleone to Don of New York, players expand to new cities, as they build up their families through extorting businesses, monopolizing illegal crime rings and defeating new families in an effort to become the most powerful mob family in America. To help players manage their empire, The Godfather II introduces \"The Don's View\" – an innovative strategy meta-game that allows players to oversee the entire world as they grow the family business. Using the Don's View, players will be able to build, defend and expand their crime rings, while keeping an eye on the movements and plans of the rival families. Players will also learn to master the business of organized crime by building a family of Made Men, hiring crew, handing out orders, and promoting their best men up the ranks. Set in a stunning open-world environment, The Godfather II expands on the popular gameplay mechanics of the first game and doubles down on the series' signature BlackHand control scheme, which now features even more visceral hand-to-hand brutality at your fingertips, introducing a new combo system, pressure tactics and executions. In The Godfather II, players fight alongside their hand-picked crew, who have their own skills and expertise. Each family member specializes in a specific field such as demolitions, arson, engineering, first-aid and more. As The Don you control the family, sending some of your men on missions while heading off into action with others. The combination of strategic organized crime gameplay and brutal BlackHand action promises to set The Godfather II apart from other open-world games. Play The Godfather II online multiplayer modes and become the true Don of Dons. Take your money, weapons, and crew from your single-player experience online and wage mob warfare against up to 16 players from around the world.  Play as one of the family’s crew specialists and put your best strategies to the test as you take over territory and strike back at rivals. Earn upgrades and money that can be used in your single-player experience. [Electronic Arts]… Expand"}, {"name": "Bounty Hounds", "details_link": "https://www.metacritic.com/game/psp/bounty-hounds", "publisher": "Namco Bandai Games", "release_date": "Sep 13 2006", "developers": ["Xpec"], "platforms": "PSP", "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 63, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/67154eb4efb458e5c2e302dcbcfc8ea2-98.jpg", "descriptions": "Hundreds of years into the future, Terraforming has made it possible for humans to colonize other planets - and thus for humanity to encounter Extraterrestrial Intelligence. War ensued over the acquisition and conquest of planets, which lead to employment of mercenaries who would scoutHundreds of years into the future, Terraforming has made it possible for humans to colonize other planets - and thus for humanity to encounter Extraterrestrial Intelligence. War ensued over the acquisition and conquest of planets, which lead to employment of mercenaries who would scout planets deemed fit for habitation. The band of these ruthless mercenaries was called Bounty Hounds. As Maximillian, the leader of Bounty Hounds, your mission is to battle different alien species spread across planets. With a variety of new weapons and items as well as Wi-Fi play to match up against a friend, Bounty Hounds delivers an exciting weapon-based action adventure for PSP gamers. Battle Your Way with Double Weapons: Wield two separate weapons - one in your right, another in your left. Two categories of weapons allow you to use melee weapons for close combat and ballistic weapons for long range combat. Go Head-to-Head with a friend: Wirelessly connect with a friend with only one copy of the game. [Namco]… Expand"}, {"name": "Super Monkey Ball: Touch & Roll", "details_link": "https://www.metacritic.com/game/ds/super-monkey-ball-touch-roll", "publisher": "Sega", "release_date": "Feb 21 2006", "developers": ["Sega"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 63, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/c0b415239824513064d66339d8429304-98.jpg", "descriptions": "Touch & Roll combines the Monkey Ball series' legendary addictiveness with perhaps the perfect platform in the form of the Nintendo DS and its touch-screen technology. Ten crazy worlds with 10 levels each offer 100 puzzle trays designed to frustrate and delight - 50 of which are all new andTouch & Roll combines the Monkey Ball series' legendary addictiveness with perhaps the perfect platform in the form of the Nintendo DS and its touch-screen technology. Ten crazy worlds with 10 levels each offer 100 puzzle trays designed to frustrate and delight - 50 of which are all new and DS exclusive. Use the DS stylus and touch screen to guide AiAi, MeeMee, GonGon and Baby through this slice of monkey madness. Four classic party games playable in both single and multiplayer modes - Monkey Race, Monkey Fight, Monkey Mini Golf and Monkey Bowling. Two all-new DS exclusive party games - Monkey Hockey and Monkey Wars. Wireless multiplayer via ad-hoc Wi-Fi connectivity. [Sega]… Expand"}, {"name": "Avatar: The Last Airbender", "details_link": "https://www.metacritic.com/game/xbox/avatar-the-last-airbender", "publisher": "THQ", "release_date": "Oct 10 2006", "developers": ["AWE Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/f5127c44fb3bd9f93da5901be127f621-98.jpg", "descriptions": "Play as Aang, Katara, Haru, and Sokka as you build your team into an unstoppable force in Avatar: The Last Airbender. Utilize your amazing bending powers and explore the mystic Avatar universe. Experience an adventure of intrigue, deception, and revelation that exposes an even greater threatPlay as Aang, Katara, Haru, and Sokka as you build your team into an unstoppable force in Avatar: The Last Airbender. Utilize your amazing bending powers and explore the mystic Avatar universe. Experience an adventure of intrigue, deception, and revelation that exposes an even greater threat than the Fire Nation as you battle against new enemies and master your bending skills.… Expand"}, {"name": "Battlestar Galactica", "details_link": "https://www.metacritic.com/game/xbox/battlestar-galactica", "publisher": "VU Games", "release_date": "Nov 19 2003", "developers": ["Warthog"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 63, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/ad678d7db0e7ca83d0fb250d095ef3f4-98.jpg", "descriptions": "The war between man and machine rages on as the mechanical Cylons return to wipe out the human race. Begin your heroic journey through the Battlestar Galactica universe as the fearless, young Adama, and help lead the fleet of Colonials to survival. Choose from a wide array of ships, fromThe war between man and machine rages on as the mechanical Cylons return to wipe out the human race. Begin your heroic journey through the Battlestar Galactica universe as the fearless, young Adama, and help lead the fleet of Colonials to survival. Choose from a wide array of ships, from sleek Vipers to heavy Bombers, and engage various classes of Cylon vessels, including Raiders and Marauders. As you attack, escort, or defend, your team of three wingmen will increase in experience and skill.… Expand"}, {"name": "FIFA Street 3", "details_link": "https://www.metacritic.com/game/playstation-3/fifa-street-3", "publisher": "EA Sports", "release_date": "Feb 18 2008", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Arcade", "Arcade"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/04c1e5de15dd81e8d2daf410c5af8d69-98.jpg", "descriptions": "Featuring over 250 of the world’s best players representing 18 of the top international teams, each player has been rendered into a stylized caricature with heroic qualities. Decked out in authentic training kits, every player boasts their own, distinctive style of play with unique abilitiesFeaturing over 250 of the world’s best players representing 18 of the top international teams, each player has been rendered into a stylized caricature with heroic qualities. Decked out in authentic training kits, every player boasts their own, distinctive style of play with unique abilities to match. Whether you’re after brawn, brains, silky skills or crunching tackles to complete your team, the perfect street player is out there. Choose from Tricksters, Enforcers, Playmakers and Finishers to give you different options on the ball and make your mark on the street. Fill up your all-new Game Breaker to power your ultimate abilities and express yourself like never before. Maneuver your players to leap past defenders, flip off walls, or perform gravity-defying one-timers to score spectacular goals. From the urban playgrounds of South America to the rooftops in Asia to the streets of Europe, your players perform to an eclectic selection of music seamlessly infused into the surroundings, where the game’s environments pulsate, and explode to life with every well-timed tackle, outrageous trick move or unstoppable shot on goal. [Electronic Arts]… Expand"}, {"name": "Everlight of Magic & Power", "details_link": "https://www.metacritic.com/game/pc/everlight-of-magic-power", "publisher": "DreamCatcher Interactive", "release_date": "Oct  7 2008", "developers": ["The Games Company"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/5be5001e7743b48c163941250d45bd78-98.jpg", "descriptions": "With a candle's last breath, journey to a world of magic and mystery. Accompanied by your personal fairy guide, explore the world of Everlight and discover your magical talents lying dormant within. The inhabitants of the village of Tallen are cursed. By day, they go about their business andWith a candle's last breath, journey to a world of magic and mystery. Accompanied by your personal fairy guide, explore the world of Everlight and discover your magical talents lying dormant within. The inhabitants of the village of Tallen are cursed. By day, they go about their business and live their lives. By night, they become their polar opposite personality, and their lives are turned upside down! Empowered with the ability to function both during the day and at night, you are Tallen’s only hope to lift the curse. [The Adventure Company]… Expand"}, {"name": "Disney Epic Mickey: The Power of Illusion", "details_link": "https://www.metacritic.com/game/3ds/disney-epic-mickey-the-power-of-illusion", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2012", "developers": ["DreamRift"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/9c067f0ad166cbec0d680ad37830e13a-98.jpg", "descriptions": "Epic Mickey: The Power of Illusion is a game for the Nintendo 3DS that was inspired by the classic Castle of Illusion starring Mickey Mouse."}, {"name": "The Lord of the Rings: War in the North", "details_link": "https://www.metacritic.com/game/playstation-3/the-lord-of-the-rings-war-in-the-north", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  1 2011", "developers": ["Snowblind Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 63, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/50385ef234fa9a888a15f61c6bd4d8ac-98.jpg", "descriptions": "In The Lord of the Rings: War in the North, players can become the heroes in the great battle of the North as part of the epic War of the Ring. Exploring unseen lands, story elements and characters from Middle-earth as well as elements familiar from past feature films, gamers will experienceIn The Lord of the Rings: War in the North, players can become the heroes in the great battle of the North as part of the epic War of the Ring. Exploring unseen lands, story elements and characters from Middle-earth as well as elements familiar from past feature films, gamers will experience extensive character customization and development, expansive co-op gameplay options and upgradeable weapons, skills and special abilities.… Expand"}, {"name": "Sands of Destruction", "details_link": "https://www.metacritic.com/game/ds/sands-of-destruction", "publisher": "Sega", "release_date": "Jan 12 2010", "developers": ["Image Epoch", "Imageepoch"], "platforms": "DS", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 63, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/341a306a88ff0e955dc7cb950448ccc6-98.jpg", "descriptions": "Sands of Destruction, an epic RPG created by the all-star Japanese developers at ImageEpoc, takes you through an epic adventure in a world surrounded by a sea of sand. In Sands of Destruction, a race of powerful beastmen known as the Ferals rule over the human population with tyranny andSands of Destruction, an epic RPG created by the all-star Japanese developers at ImageEpoc, takes you through an epic adventure in a world surrounded by a sea of sand. In Sands of Destruction, a race of powerful beastmen known as the Ferals rule over the human population with tyranny and prejudice. A group of warriors, the World Annihilation Front, believe their only option for ending the corruption of the Ferals is to end the world as they know it. This intense game puts gamers in control of an intriguing cast of characters including the crusading Morte Ashera as well as Kyrie Illunis, who unknowingly holds the key to global destruction. Gamers will explore a fantastic world, traveling across oceans of sand, battling colossal enemy monsters and unraveling the mystery of the creation of the world. Immerse yourself in dynamic battles taking up both the top and lower screens of the DS and an epic storyline with a twist, in this action-packed fantasy RPG exclusively on the DS. [Sega]… Expand"}, {"name": "Layers of Fear 2", "details_link": "https://www.metacritic.com/game/xbox-one/layers-of-fear-2", "publisher": "Gun Media", "release_date": "May 28 2019", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 63, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/1cc7827022c1131e51d697f5fd26b3a8-98.jpg", "descriptions": "Layers of Fear 2 is a first-person psychological horror game with an emphasis on exploration and story. Players control a Hollywood actor who heeds the call of an enigmatic director to take on the lead role in a film shot aboard an ocean liner. Beware, for all may not truly be what it seems."}, {"name": "Assassin's Creed III - The Redemption", "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-iii---the-redemption", "publisher": "Ubisoft", "release_date": "Apr 23 2013", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 63, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/ca0f8e64c27985f60a1e37e708a2c38f-98.jpg", "descriptions": "The Tyranny of King Washington is a DLC for Assassin's Creed III in which you explore an alternate reality where George Washington has become a dictator that you must overthrow."}, {"name": "Destiny: The Dark Below", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-the-dark-below", "publisher": "Activision", "release_date": "Dec  9 2014", "developers": ["Bungie"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 63, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/0/378d5c971bc3531465a4b524e3e7f923-98.jpg", "descriptions": "Augment the Destiny experience with a myraid of weapons, armor, and gear earned in new story quests and missions, 3 new competitive multiplayer arenas, and a new Strike and Raid. Under the surface of the Moon, a long-ago forgotten enemy awakens. Survive the true depths of the Hellmouth, andAugment the Destiny experience with a myraid of weapons, armor, and gear earned in new story quests and missions, 3 new competitive multiplayer arenas, and a new Strike and Raid. Under the surface of the Moon, a long-ago forgotten enemy awakens. Survive the true depths of the Hellmouth, and stop its dark army from invading Earth.… Expand"}, {"name": "A Quiet Weekend in Capri", "details_link": "https://www.metacritic.com/game/pc/a-quiet-weekend-in-capri", "publisher": "Got Game Entertainment", "release_date": "Mar 17 2004", "developers": ["Silvio & Gey Savarese"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 63, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/2de73d7e32a5691b2a72c765332589ba-98.jpg", "descriptions": "In what becomes anything but a quiet weekend in Capri, this magical island off the coast of Italy serves as backdrop to a captivating mystery. As a tourist visiting the enchanting Isle of Capri for the first time, you are unexpectedly transported into a mysterious scenario, no longer ofIn what becomes anything but a quiet weekend in Capri, this magical island off the coast of Italy serves as backdrop to a captivating mystery. As a tourist visiting the enchanting Isle of Capri for the first time, you are unexpectedly transported into a mysterious scenario, no longer of certain where you are or which way to turn. Regaining your senses, you begin to explore the island, encountering interesting characters and intriguing clues. You wander through magical gardens, seashores, churches, monuments, villas, and old Roman ruins. To unravel this mystery, you must utilize strange inventions by an eccentric island scientist, along with your own deductive reasoning. [Got Game]… Expand"}, {"name": "Disney's Magical Quest 2 Starring Mickey and Minnie", "details_link": "https://www.metacritic.com/game/game-boy-advance/disneys-magical-quest-2-starring-mickey-and-minnie", "publisher": "Capcom", "release_date": "Nov 12 2003", "developers": ["Klein Computer Entertainment"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/0eae9ec062c51431470cb34c281eb2e2-98.jpg", "descriptions": "Based on the original SNES game, Disney's Magical Quest 2 Starring Mickey and Minnie arrives on the Game Boy Advance. As either Mickey or Minnie, you must stop the evil Baron Pete and his minions from causing trouble. During your quest, you can wear three different costumes (the Sweeper,Based on the original SNES game, Disney's Magical Quest 2 Starring Mickey and Minnie arrives on the Game Boy Advance. As either Mickey or Minnie, you must stop the evil Baron Pete and his minions from causing trouble. During your quest, you can wear three different costumes (the Sweeper, Ranger, and Cowboy/girl) that give you unique abilities. In addition to single-player missions, the game lets you link up with your friends' Game Boy Advance for multiplayer action.… Expand"}, {"name": "Mojo!", "details_link": "https://www.metacritic.com/game/playstation-2/mojo!", "publisher": "Crave", "release_date": "Aug 26 2003", "developers": ["Crave"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/a36602633fe295ef3646d7869222387c-98.jpg", "descriptions": "Mojo! is a graphically stunning, simple, yet sophisticated 3D puzzle game that tests both your mind and your reflexes. Because each move you make slowly drains your \"MOJO\" (energy), you must carefully weigh each action as you maneuver through increasingly difficult puzzle stages. Only theMojo! is a graphically stunning, simple, yet sophisticated 3D puzzle game that tests both your mind and your reflexes. Because each move you make slowly drains your \"MOJO\" (energy), you must carefully weigh each action as you maneuver through increasingly difficult puzzle stages. Only the most shrewd and skillful players will be able to navigate Mojo!'s unique chain of puzzles in order to survive to the legendary 100th stage! [Crave]… Expand"}, {"name": "Enter the Matrix", "details_link": "https://www.metacritic.com/game/gamecube/enter-the-matrix", "publisher": "Atari", "release_date": "May 14 2003", "developers": ["Shiny Entertainment"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 63, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/194c6a37707142696c9b92933a877ad1-98.jpg", "descriptions": "Enter the Matrix features awesome gunplay and spectacular martial arts that bend the rules of the Matrix, insane driving and stunts, and the chance to pilot the fastest hovercraft in the fleet.  This game isn't just set in the Matrix universe--it's an integral part of the entire MatrixEnter the Matrix features awesome gunplay and spectacular martial arts that bend the rules of the Matrix, insane driving and stunts, and the chance to pilot the fastest hovercraft in the fleet.  This game isn't just set in the Matrix universe--it's an integral part of the entire Matrix experience, with a story that weaves in and out of The Matrix: Reloaded, the second chapter of the movie trilogy.  Enter the Matrix is the story behind the story.… Expand"}, {"name": "Samurai Jack: The Amulet of Time", "details_link": "https://www.metacritic.com/game/game-boy-advance/samurai-jack-the-amulet-of-time", "publisher": "Bam Entertainment", "release_date": "Mar 30 2003", "developers": ["Virtucraft"], "platforms": ["iPhone/iPad", "PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 63, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/baa8bebfad4a667256adf24a6357bf2a-98.jpg", "descriptions": "A warrior unlike any other, trained by masters of weaponry and combat from all corners of the globe, he halls from the past, but was sent far into the future by the evil shape-shifting wizard Aku. His mission: to find the missing segments of the Amulet of Time which will allows him to returnA warrior unlike any other, trained by masters of weaponry and combat from all corners of the globe, he halls from the past, but was sent far into the future by the evil shape-shifting wizard Aku. His mission: to find the missing segments of the Amulet of Time which will allows him to return to the past, fulfill his destiny, defeat Aku and save the world from his evil.… Expand"}, {"name": "Barbarian", "details_link": "https://www.metacritic.com/game/playstation-2/barbarian", "publisher": "Titus Software", "release_date": "Jun 27 2002", "developers": ["Saffire"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/1a455aca3388516a32711682b0ece21e-98.jpg", "descriptions": "An action game of fighting and conquest in combat arenas across the land of Barbaria. Play in different battle modes against one or more opponents or experience the rich history of each Barbarian by playing their own Quest. [Titus]"}, {"name": "Tales of Symphonia Remastered", "details_link": "https://www.metacritic.com/game/switch/tales-of-symphonia-remastered", "publisher": "Bandai Namco Games", "release_date": "Feb 17 2023", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 63, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/5/ea62fbd054b84d0b2f1768aa83e5c2e8-98.jpg", "descriptions": "In a dying world, legend has it that a Chosen One will one day rise from amongst the people and the land will be reborn. The line between good and evil blurs in this epic adventure where the fate of two interlocked worlds hangs in the balance. Follow the journey of Lloyd Irving as he and hisIn a dying world, legend has it that a Chosen One will one day rise from amongst the people and the land will be reborn. The line between good and evil blurs in this epic adventure where the fate of two interlocked worlds hangs in the balance. Follow the journey of Lloyd Irving as he and his friends try to save both worlds.Dive back into Tales of Symphonia, an exciting and beloved action RPG, now with enhanced graphics and improved gameplay!… Expand"}, {"name": "Namco Museum: Virtual Arcade", "details_link": "https://www.metacritic.com/game/xbox-360/namco-museum-virtual-arcade", "publisher": "Namco Bandai Games America", "release_date": "Nov  4 2008", "developers": ["Namco Bandai Games"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 63, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/2c2dc64c71b0739c2795432115a7443d-98.jpg", "descriptions": "Go back in time with Namco Museum: Virtual Arcade and relive classic Namco arcade favorites including Tower of Druaga, Galaga, Grobda, Mappy, Metro-Cross, Ms. Pac-Man, New Rally-X, Pac-Man Arrangement, Pole Position 2, Sky Kid, and Xevious, just to name a few. Namco Museum: Virtual ArcadeGo back in time with Namco Museum: Virtual Arcade and relive classic Namco arcade favorites including Tower of Druaga, Galaga, Grobda, Mappy, Metro-Cross, Ms. Pac-Man, New Rally-X, Pac-Man Arrangement, Pole Position 2, Sky Kid, and Xevious, just to name a few. Namco Museum: Virtual Arcade also features Pac-Man Championship Edition which was voted the best downloadable game of 2007 by numerous video game publications. Galaga Legions continues Pac-Man Championship Edition's legacy with a smart re-tooling of the franchise that stays true to the series' roots.  Spanning three decades worth of arcade nostalgia, Namco Museum: Virtual Arcade promises to be the most fully realized Namco Museum collection yet. [Namco Bandai Games]… Expand"}, {"name": "Triggerheart Exelica", "details_link": "https://www.metacritic.com/game/xbox-360/triggerheart-exelica", "publisher": "Warashi", "release_date": "Feb 27 2008", "developers": ["Warashi"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 63, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/f84b5f4d54f3b0eba7ed988ba18379e0-98.jpg", "descriptions": "[Xbox Live Arcade]  Mankind's newest and best weapon is the Triggerheart, a humanoid weapons system with a human-like personality. When the Ver'mith attack, only the Triggerhearts Exelica and Crueltear have the power to destroy the enemy. In the classic vertically-scrolling Japanese arcade[Xbox Live Arcade]  Mankind's newest and best weapon is the Triggerheart, a humanoid weapons system with a human-like personality. When the Ver'mith attack, only the Triggerhearts Exelica and Crueltear have the power to destroy the enemy. In the classic vertically-scrolling Japanese arcade shooter Triggerheart Exelica, each weapon has a different combat style, but both can perform unique anchor shots. Anchor an enemy ship, capture it to use as a shield, or throw it back into the fray to cause massive damage. With five levels, three difficulty settings, and all the usual Xbox LIVE leaderboards and achievements, Triggerheart Exelica is a fast-paced, full-featured arcade shooter. Unique anchor shot element: The Triggerhearts can anchor enemies, capture them to use as a shield, or toss them back into the field of battle to cause havoc. V.B.A.S. (Variable Boss Attack System): The game dynamically reacts to your skill level. If you have a low score, the bosses will be slightly easier to defeat. Carry a higher score, and the bosses become more challenging. High-def graphics: Fully compatible with HDTVs, the graphics bring the top-down shooter genre to a new level of intensity. New background music willl have you grooving to the rhythm as you destroy the Ver'mith. [Warashi]… Expand"}, {"name": "Texas Hold 'Em", "details_link": "https://www.metacritic.com/game/xbox-360/texas-hold-em", "publisher": "Tik Games, LLC", "release_date": "Aug 23 2006", "developers": ["Tik Games", "LLC", "TikGames"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 63, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/677f9e4a542bfda776f047c3a6282b86-98.jpg", "descriptions": "[Xbox Live Arcade]  Whether you're a beginner or a pro, enjoy the thrill of the perfect hand or the perfect bluff. Test your skills in ring games and tournaments, or fine-tune your skills playing the scenario you always wanted to be in. Customize the game however you want. The comprehensive[Xbox Live Arcade]  Whether you're a beginner or a pro, enjoy the thrill of the perfect hand or the perfect bluff. Test your skills in ring games and tournaments, or fine-tune your skills playing the scenario you always wanted to be in. Customize the game however you want. The comprehensive help provides details on each aspect of the game. [Microsoft]… Expand"}, {"name": "Theatre of War 2: Africa 1943", "details_link": "https://www.metacritic.com/game/pc/theatre-of-war-2-africa-1943", "publisher": "Battlefront.com", "release_date": "Apr 24 2009", "developers": ["Battlefront.com", "1C Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Military", "General", "Tactics"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/182c4c662031620520eac7e9c87b50aa-98.jpg", "descriptions": "Theatre of War 2: Africa 1943 covers the events of 1943 in Tunisia, North Africa. Recovering from their losses after the crushing defeat and subsequent retreat after the Second Battle of El-Alamein, the German Afrika Korps - reinforced and now supported by the Italian Army - prepare onceTheatre of War 2: Africa 1943 covers the events of 1943 in Tunisia, North Africa. Recovering from their losses after the crushing defeat and subsequent retreat after the Second Battle of El-Alamein, the German Afrika Korps - reinforced and now supported by the Italian Army - prepare once more to put steel against steel with the Allies. The Axis forces, under the command of the legendary General Erwin Rommel, have an all too brief opportunity to seize victory from the clutches of their earlier failures. Players will lead Rommel’s Afrika Korps in their last full-scale military campaign and command the English and American armies as they try to push the Axis forces out of Africa once and for all. The stage is set, it's time again to enter the Theatre of War! [1C Company]… Expand"}, {"name": "Will Rock", "details_link": "https://www.metacritic.com/game/pc/will-rock", "publisher": "Ubisoft", "release_date": "Jun  9 2003", "developers": ["Saber Interactive"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 63, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/cbd037a0248a43b8f13e9f27165018ba-98.jpg", "descriptions": "Will Rock is a First Person Shooter, set in ancient Greece. Actually, Ancient Greece comes to the future. Will Rock, archaeology student, is part of a group exploring a ruin on Mt. Olympus. He discovers that the Greek Gods have been imprisoned inside for centuries. Now he has to save hisWill Rock is a First Person Shooter, set in ancient Greece. Actually, Ancient Greece comes to the future. Will Rock, archaeology student, is part of a group exploring a ruin on Mt. Olympus. He discovers that the Greek Gods have been imprisoned inside for centuries. Now he has to save his sweetie before she becomes a sacrifice for Zeus. Good thing he has all those guns. Guns? Futuristic weapons like the Sniper Crossbow, which sets your enemies on fire and desiccates them until they?re a pile of ashes. Or the Acid Gun, which burns monsters alive from the inside, causing them to burst like balloons. There's the Medusa Gun, which turns creatures to stone and the Atomic Gun, that melts everything in a holocaust of destruction. We also have some of the basics, like a Pistol, a Mini-Gun, and the Fireball Thrower. And never leave home without your shovel. [Ubi Soft]… Expand"}, {"name": "Panzer Dragoon", "details_link": "https://www.metacritic.com/game/switch/panzer-dragoon", "publisher": "Sega", "release_date": "Mar 26 2020", "developers": ["Forever Entertainment", "MegaPixel Studio"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Rail"], "meta_score": 63, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/b8f42b681163dcd57d10c471e29f6ea4-98.jpg", "descriptions": "A new, remade version of the Panzer Dragoon game true to the original, with improved graphics and controls, that suit modern gaming standards!On a far, lone planet, you encounter two dragons awakened from the ancient times. Armed with a deadly gun from the past, and the guidance of yourA new, remade version of the Panzer Dragoon game true to the original, with improved graphics and controls, that suit modern gaming standards!On a far, lone planet, you encounter two dragons awakened from the ancient times. Armed with a deadly gun from the past, and the guidance of your armored blue dragon, you must fulfill your destiny and keep the Prototype Dragon from reaching the Tower or die trying.Features:* Pilot through seven unbelievably realistic levels ranging from tropical blue ocean cities to intricate subterranean ruins.* Fight the Prototype Dragon who appears together with evil giant dragonflies, frightening man-sized wasps, giant sandworms, and lethal flying battleships.* Attack approaching from all sides enemies quickly and without mercy, with improved 360-degree controls and lock-on targeting.… Expand"}, {"name": "Call of the Wild: The Angler", "details_link": "https://www.metacritic.com/game/pc/call-of-the-wild-the-angler", "publisher": "Expansive Worlds", "release_date": "Aug 31 2022", "developers": ["Expansive Worlds"], "platforms": "PC", "num_players": "Up to 12 ", "genres": ["Sports", "Individual", "Nature", "Fishing"], "meta_score": 63, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/2/802a15dbd740f4181ba5f52a00fadcc1-98.jpg", "descriptions": "From the creators of theHunter: Call of the Wild comes a genre-defying fishing experience! Explore a vast and atmospheric open world in search of the perfect fishing spot. Ride the open waters alone or with friends and embark on your journey to become a master angler."}, {"name": "Obscuritas", "details_link": "https://www.metacritic.com/game/pc/obscuritas", "publisher": "Ravenscourt", "release_date": "Mar 17 2016", "developers": ["Visual Imagination Software", "Ravenscourt", "VIS Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 63, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/4/5ef503dc0dd99be4f4c7ffb4f901564c-98.jpg", "descriptions": "When Sarah inherits her great-uncle's old country home, she has no idea about the dark secret she has stumbled upon, and the obscure world it will take her to."}, {"name": "Personal Trainer: Math", "details_link": "https://www.metacritic.com/game/ds/personal-trainer-math", "publisher": "Nintendo", "release_date": "Jan 13 2009", "developers": ["Jupiter Corporation"], "platforms": "DS", "num_players": "1-16 ", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 63, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/b393c77da7c97ba1993ac25c2304cd74-98.jpg", "descriptions": "The foundation of Dr Kageyama's Maths Training is 100 square calculations a method conceived by Kageyama Hidea, a Japanese elementary school principal. The DS is held side ways like a book and all answers are written using the stylus. The key principal of the software is repetition whichThe foundation of Dr Kageyama's Maths Training is 100 square calculations a method conceived by Kageyama Hidea, a Japanese elementary school principal. The DS is held side ways like a book and all answers are written using the stylus. The key principal of the software is repetition which according to Kageyama stimulates the brain. The main exercise 100 cells maths, consists of 100 hundred simple maths problems combined into a 10 by 10 grid using the numbers at the top and side of the grid. There are however many other exercises, ranging from simple one digit math problems to slightly more complex three digit challenges.… Expand"}, {"name": "All-Star Fruit Racing", "details_link": "https://www.metacritic.com/game/switch/all-star-fruit-racing", "publisher": "PQube", "release_date": "Aug 21 2018", "developers": ["3DClouds.it", "3DClouds"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 63, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/0/d900bdd2b08aa8e70452a7d6ccca4414-98.jpg", "descriptions": "All-Star Fruit Racing propels players into vibrant worlds filled with incredible action: drift through looping bends, soar over monumental jumps and defy gravity itself around tubular tracks in an explosively colorful racer bursting with championships, modes and awe-inspiring sights. JumpAll-Star Fruit Racing propels players into vibrant worlds filled with incredible action: drift through looping bends, soar over monumental jumps and defy gravity itself around tubular tracks in an explosively colorful racer bursting with championships, modes and awe-inspiring sights. Jump into a bumper career mode. Pick your favourite character and battle for the first place trophy in a series of testing championships. Balance speed and skill as you battle nine other racers in a frantically fruity scrap for the podium and the all-important winner's prizes, unlocking new characters, championships and kart parts along the way.… Expand"}, {"name": "Beat Hazard Ultra", "details_link": "https://www.metacritic.com/game/playstation-3/beat-hazard-ultra", "publisher": "Cold Beam Games", "release_date": "Oct 18 2011", "developers": ["Cold Beam Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 63, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/0187f7b433f5d2351764baa4bae6598f-98.jpg", "descriptions": "Welcome to a new experience in gameplay mechanics: Beat Hazard Ultra - Gameplay Powered by YOUR Music! Experience your music collection like never before with this intense music driven arcade shooter. Each of your songs will have its own unique ebb and flow based on the music. Power up yourWelcome to a new experience in gameplay mechanics: Beat Hazard Ultra - Gameplay Powered by YOUR Music! Experience your music collection like never before with this intense music driven arcade shooter. Each of your songs will have its own unique ebb and flow based on the music. Power up your spaceship and watch as the music boosts your firepower. Unleash hell on the enemy ships when you max out with weapon pickups!… Expand"}, {"name": "The Baconing", "details_link": "https://www.metacritic.com/game/pc/the-baconing", "publisher": "Hothead Games", "release_date": "Aug 31 2011", "developers": ["Hothead Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "3D"], "meta_score": 63, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/2aca59a849d3ad2777dc0c2aef0b0bda-98.jpg", "descriptions": "DeathSpank returns in the sequel DeathSpank: The Baconing."}, {"name": "Metal Wolf Chaos XD", "details_link": "https://www.metacritic.com/game/playstation-4/metal-wolf-chaos-xd", "publisher": "Devolver Digital", "release_date": "Aug  6 2019", "developers": ["From Software", "General Arcade"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 63, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/c086dd152fa17721e59b99b8195631fe-98.jpg", "descriptions": "Metal Wolf Chaos XD is a modernized re-release of FromSoftware's 2004 mech shooter with upgraded visual fidelity, refined controls and gameplay, a new save system, and 4K + 16:9 support for modern displays."}]