[{"name": "Bionic Commando Rearmed 2", "details_link": "https://www.metacritic.com/game/xbox-360/bionic-commando-rearmed-2", "publisher": "Capcom", "release_date": "Feb  2 2011", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "3D", "2D", "3D", ""], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/686023570da04c3f5b6a36e397164e55-98.jpg", "descriptions": "Nathan Spencer will make use of his trademark tool – his bionic grappling hook – to grab, swing and leap through series of lush new environments. He’ll be met by plenty of gun-toting soldiers and mechanized threats ready to give him a hostile greeting. Bionic Commando Rearmed 2 improves uponNathan Spencer will make use of his trademark tool – his bionic grappling hook – to grab, swing and leap through series of lush new environments. He’ll be met by plenty of gun-toting soldiers and mechanized threats ready to give him a hostile greeting. Bionic Commando Rearmed 2 improves upon the visual achievements of its predecessor with the addition of more detailed character models, textures, and vibrant colors.  New player mechanics will add another strategic layer of platforming to the overall experience and the famous bionic arm will be getting a major makeover delivering a more dynamic bionic experience to the player. … Expand"}, {"name": "Senran Kagura: Peach Ball", "details_link": "https://www.metacritic.com/game/switch/senran-kagura-peach-ball", "publisher": "XSEED Games", "release_date": "Jul  9 2019", "developers": ["Honey Parade Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/0b8722c267e20ed67563627949680f4c-98.jpg", "descriptions": "Haruka is up to her usual experiments again, brewing up mysterious concoctions with unknown effects. Unfortunately for her fellow shinobi she’s chosen the local arcade she works at as her laboratory, creating the perfect opportunity for an unplanned accident."}, {"name": "Dynasty Warriors 5 Empires", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-5-empires", "publisher": "Koei", "release_date": "Mar 28 2006", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 62, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/2f9ec74274056b8f04b2132a954530a1-98.jpg", "descriptions": "In Dynasty Warriors 5 Empires, the armies of the kingdom are at your command. The player's ultimate goal is to conquer the 25 regions of Ancient China and build an entire Empire using cunning diplomacy and uncompromising force. Before each battle, the player will meet with the war council toIn Dynasty Warriors 5 Empires, the armies of the kingdom are at your command. The player's ultimate goal is to conquer the 25 regions of Ancient China and build an entire Empire using cunning diplomacy and uncompromising force. Before each battle, the player will meet with the war council to decide upon military and political policies for the kingdom, then it's time for war. The game gives armchair generals total control of their kingdom. Now, gamers can issue direct orders to each officer or signal general commands to officers on the field. Players will order when the army will take the offensive, defend their ground, or have all officers gather for an ambush. Gamers can also choose the officers for an attack force, entice captives into joining the kingdom's service and even expel officers from the kingdom. There's even greater authority over Government, Product Development, Diplomacy and Battle Tactics with the game's 25 new policies for a total of 75 in all. The game's imperial-sized action includes 4 scenarios to unlock, 2-Player Co-Op play in \"Empire\" and \"Free\" modes, new items to unlock, and control of over 200 officers! Once the dust has settled, there's the real history of Ancient China to discover in  the game's detailed Encyclopedia. [KOEI]… Expand"}, {"name": "Hokko Life", "details_link": "https://www.metacritic.com/game/switch/hokko-life", "publisher": "Team17", "release_date": "Sep 27 2022", "developers": ["Wonderscope"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/87575dc74739b126a0c3aa8e3a0d959d-98.jpg", "descriptions": "Hokko Life is a cosy, creativity filled community sim game.Step off the train into the town of Hokko and get settled into your new home! This quiet village needs your help to turn it into the charming rural town everyone loves. With hammer and paints in hand it's up to you to design, buildHokko Life is a cosy, creativity filled community sim game.Step off the train into the town of Hokko and get settled into your new home! This quiet village needs your help to turn it into the charming rural town everyone loves. With hammer and paints in hand it's up to you to design, build and decorate homes for all of your new friends!Busy yourself away in the dusty old workshop and let your creativity flow! Craft materials and combine them in whatever way you desire to create new and wonderful furniture and items for your town. Collect flowers, mix paints and use them to design wallpapers, flooring and even clothing!Will you design an urban-industrial furniture collection or maybe a bright flowery wallpaper set? With all of the workshop at your disposal, you'll have complete freedom to design a town your villagers will absolutely love.… Expand"}, {"name": "Namco Museum Archives Vol. 1", "details_link": "https://www.metacritic.com/game/playstation-4/namco-museum-archives-vol-1", "publisher": "Bandai Namco Games", "release_date": "Jun 18 2020", "developers": ["B.B.Studio"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/688cd06d2dac26d0021bd2fbe4306896-98.jpg", "descriptions": "NAMCO MUSEUM ARCHIVES Volume 1:\r Galaxian\r  Xevious\r  Mappy\r  Dragon Buster\r  Pac-Man\r  Dig-Dug\r  The Tower of Druaga\r  Sky Kid\r  Dragon Spirit: The New Legend\r  Splatterhouse: Wanpaku Graffiti\r  Pac-Man Championship Edition"}, {"name": "Outward", "details_link": "https://www.metacritic.com/game/playstation-4/outward", "publisher": "Deep Silver", "release_date": "Mar 26 2019", "developers": ["Nine Dots Studio"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Survival", "Open-World"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/160dd09d7c3e0f99208db2138bb3752d-98.jpg", "descriptions": "No remarkable journey is achieved without great effort. Outward is an open-world RPG where the cold of the night or an infected wound can be as dangerous as a predator lurking in the dark. Explore the vast world of Aurai, embark on memorable adventures alone or with your friends."}, {"name": "Neverout", "details_link": "https://www.metacritic.com/game/switch/neverout", "publisher": "Gamedust", "release_date": "Jul 10 2018", "developers": ["Gamedust"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/482868e18be901cfb8a0abe0b3679d5d-98.jpg", "descriptions": "It will lock you down in a room and won't let you escape. Will you survive or ever get out? Your only choice is to find your way to the next room, but watch out, many traps lie ahead. Wander around for hours solving over 60 beautifully crafted levels. Neverout is a mysterious puzzle game. ItIt will lock you down in a room and won't let you escape. Will you survive or ever get out? Your only choice is to find your way to the next room, but watch out, many traps lie ahead. Wander around for hours solving over 60 beautifully crafted levels. Neverout is a mysterious puzzle game. It puts you in a small, claustrophobic room, that has only one way out and its unique mechanics lets every wall become the floor. Watch out for something heavy, getting electrocuted or giant spikes.\r… Expand"}, {"name": "Spellspire", "details_link": "https://www.metacritic.com/game/playstation-4/spellspire", "publisher": "10tons", "release_date": "May 23 2017", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/512b4bff9003a6709a0d3205cfe257e0-98.jpg", "descriptions": "Blast fiends by spelling words and make your way to the top of the Spellspire. Spellspire is a mashup of word game and action role playing game. Pick letters from a grid to spell words and shoot them from your wand as spells. The longer the word, the bigger the blast. Collect gold dropped byBlast fiends by spelling words and make your way to the top of the Spellspire. Spellspire is a mashup of word game and action role playing game. Pick letters from a grid to spell words and shoot them from your wand as spells. The longer the word, the bigger the blast. Collect gold dropped by slain monsters and buy more potent wands, hats and robes with magical special effects and abilities. Will you reach the top of the Spellspire, and what will you find?… Expand"}, {"name": "Toby: The Secret Mine", "details_link": "https://www.metacritic.com/game/xbox-one/toby-the-secret-mine", "publisher": "Headup Games", "release_date": "Jan 20 2017", "developers": ["Headup Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 62, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/45a937ca06f5bffab2d2127cfd18a3f5-98.jpg", "descriptions": "Get lost in the shadows and pray you find your way out...\r A peaceful way of life in a small village in the mountains was thrown into disorder. Someone has kidnapped most of its residents. A couple of brave hearts tried to rescue their friends but none of them has returned.\r\n\r\nLittle TobyGet lost in the shadows and pray you find your way out...\r A peaceful way of life in a small village in the mountains was thrown into disorder. Someone has kidnapped most of its residents. A couple of brave hearts tried to rescue their friends but none of them has returned.\r Little Toby didn't want to just sit and wait so he decided to find them by himself. He went to the near deep forest but he soon realized this is just a beginning.\r Go with Toby on an eerie adventure in a dark and creepy world full of dangerous situations, enemies and challenging puzzles.… Expand"}, {"name": "Small Radios Big Televisions", "details_link": "https://www.metacritic.com/game/playstation-4/small-radios-big-televisions", "publisher": "Adult Swim", "release_date": "Nov  8 2016", "developers": ["Owen Deery", "Fire Face"], "platforms": ["PC", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/7c6393ff59599c0df3bd7be22cd54951-98.jpg", "descriptions": "Explore the inner workings of deserted factories in search of data cassettes that contain boundless virtual worlds. Collect more tapes and explore more worlds and you'll soon discover new methods of traversal and control that will take you farther than you'd ever expect."}, {"name": "Baseball Riot", "details_link": "https://www.metacritic.com/game/xbox-one/baseball-riot", "publisher": "10tons Ltd", "release_date": "Dec  9 2015", "developers": ["10tons Ltd", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Puzzle", "Action", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a1f287967e6fcd4ea8812191b450395f-98.jpg", "descriptions": "Baseball Riot is a humorous physics based puzzle game. The player, as the baseball star Gabe Carpaccio, must travel through the US and clear more than 100 levels bristling with Explodz energy drink crazed villains. The gameplay is easy to pick up and play; the player simply lines up a shot,Baseball Riot is a humorous physics based puzzle game. The player, as the baseball star Gabe Carpaccio, must travel through the US and clear more than 100 levels bristling with Explodz energy drink crazed villains. The gameplay is easy to pick up and play; the player simply lines up a shot, swings the bat and sees the ball knock out obnoxious fans, leery catchers, biased umpires and more. The player must bounce the ball of walls and obstacles to get the goons lurking behind cover.… Expand"}, {"name": "Legend of Kay Anniversary", "details_link": "https://www.metacritic.com/game/playstation-4/legend-of-kay-anniversary", "publisher": "Nordic Games Publishing", "release_date": "Jul 28 2015", "developers": ["Neon Studios", "Kaiko"], "platforms": ["PC", "PlayStation 3", "Switch", "Wii U", "Xbox 360", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/49c1614e5bcd7d507bc60c9186087a61-98.jpg", "descriptions": "Ten years after its original release, Legend of Kay - Anniversary is a remastered version of the initial game: high-resolution textures; new, more detailed character models; modern rendering techniques and crystal-clear surround sound promise to give this great classic a new shine."}, {"name": "Batman: Arkham Knight - A Matter of Family", "details_link": "https://www.metacritic.com/game/xbox-one/batman-arkham-knight---a-matter-of-family", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jul 14 2015", "developers": ["WB Games Montreal"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Open-World"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/b336787a4734a7f74ec2859eb3865c21-98.jpg", "descriptions": "When The Joker kidnaps Commissioner Gordon and holds him hostage at the Seagate Amusement Park, Batgirl and Robin will fight against the odds to save him and avoid falling prey to The Joker’s sinister plan. Trained by Batman, Batgirl’s combat combines with unrivaled hacking abilities toWhen The Joker kidnaps Commissioner Gordon and holds him hostage at the Seagate Amusement Park, Batgirl and Robin will fight against the odds to save him and avoid falling prey to The Joker’s sinister plan. Trained by Batman, Batgirl’s combat combines with unrivaled hacking abilities to defeat enemies, control objects and solve puzzles. … Expand"}, {"name": "Jett Rocket II: The Wrath of Taikai", "details_link": "https://www.metacritic.com/game/3ds/jett-rocket-ii-the-wrath-of-taikai", "publisher": "Shin'en", "release_date": "Nov 13 2013", "developers": ["Shin'en"], "platforms": "3DS", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/0583e55c70ea62e0653691ed9d98ca15-98.jpg", "descriptions": "From the makers of Nano Assault Neo, FAST - Racing League, Art of Balance\r Jett Rocket returns! Your favorite planetary inspector is back and in trouble. His archrival Kaiser Taikai has to settle an old score with him...\r\n\r\nExplore the home planet of the Power Plant Posse and ignite yourFrom the makers of Nano Assault Neo, FAST - Racing League, Art of Balance\r Jett Rocket returns! Your favorite planetary inspector is back and in trouble. His archrival Kaiser Taikai has to settle an old score with him...\r Explore the home planet of the Power Plant Posse and ignite your trusty old jet pack in this epic full-3D action-adventure!\r Features:\r-Jump'n'Run with lots of action and variety\r-Hidden Bonus stages\r-Destroyable Environments\r-Ignite your JettPack\r-Jump on your JettBoat\r-Full stereoscopic 3D\r-Super-smooth 60 frames/sec.… Expand"}, {"name": "NASCAR 2011: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/nascar-2011-the-game", "publisher": "Activision", "release_date": "Mar 29 2011", "developers": ["Eutechnyx"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "GT / Street", "Stock Car", "Automobile"], "meta_score": 62, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/86d7098a47c0f5f16a0f902d3b5528bf-98.jpg", "descriptions": "The Big Mutha Truckers and Ferrari challenge developer is relaunching the racing series featuring the US's top stock-car circuit."}, {"name": "Tornado Outbreak", "details_link": "https://www.metacritic.com/game/xbox-360/tornado-outbreak", "publisher": "Konami", "release_date": "Sep 29 2009", "developers": ["Loose Cannon Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/da94464fec38579c5bc5d36df989cabf-98.jpg", "descriptions": "Harness the power of a raging tornado and battle the forces of evil in an effort to save to world. Sinister forces have deceived you to believe that your destructive behavior will save an epic hero. In reality, you’re working for evil. Take control of a dynamic tornado as you tear throughHarness the power of a raging tornado and battle the forces of evil in an effort to save to world. Sinister forces have deceived you to believe that your destructive behavior will save an epic hero. In reality, you’re working for evil. Take control of a dynamic tornado as you tear through open environments chewing up the landscape and spitting out everything in your path. The more you destroy, the bigger you grow as you work against time based, collection and point challenges in the search for hidden element and enemies from another world. Watch the debris fly as you leave a trail of destruction, as you battle bosses and defeat the forces of evil. The world is your playground, tear it up. [Konami]… Expand"}, {"name": "DreamWorks Bee Movie Game", "details_link": "https://www.metacritic.com/game/wii/dreamworks-bee-movie-game", "publisher": "Activision", "release_date": "Nov  5 2007", "developers": ["Smart Bomb Interactive"], "platforms": ["PC", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 62, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/6316e1c7e437ddeaf05c5ac22a381643-98.jpg", "descriptions": "Based on the DreamWorks Animation movie written, produced by and starring Jerry Seinfeld, Bee Movie Game lets players race, chase and fly their way through an adrenaline-fueled world of adventure as they experience the hilarious antics of Barry B. Benson, a dynamic and daring bee who knowsBased on the DreamWorks Animation movie written, produced by and starring Jerry Seinfeld, Bee Movie Game lets players race, chase and fly their way through an adrenaline-fueled world of adventure as they experience the hilarious antics of Barry B. Benson, a dynamic and daring bee who knows there is more to life than making honey. [Activision]… Expand"}, {"name": "Spider-Man 3", "details_link": "https://www.metacritic.com/game/pc/spider-man-3", "publisher": "Activision", "release_date": "May  4 2007", "developers": ["Beenox"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/d8d994d2e83374ea45347d3a1332c6be-98.jpg", "descriptions": "Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time,Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time, enjoy unprecedented freedom—choosing what you want to do, when you want to do it. There's no checklist to complete in order to progress. You set your own next goal, roaming anywhere you want - including subterranean areas such as subways, sewers and villains' lairs - in the most massive, detailed New York City ever seen in a Spider-Man game. Experience an all-new combat system, two exciting ways. Redesigned from the ground up, a unique combat system empowers both Spider-Man and Black-Suited Spider-Man to perform suit-specific powers and abilities. State of the art animations, combos and finishers make punch, kick and web attacks more super-heroic than ever. Battle 10 of Spider-Man’s most infamous enemies from the movie and Marvel universe, including Sandman and Venom. [Activision]… Expand"}, {"name": "Commandos Strike Force", "details_link": "https://www.metacritic.com/game/pc/commandos-strike-force", "publisher": "Eidos Interactive", "release_date": "Apr  4 2006", "developers": ["Pyro Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Historic", "Historic"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/1eaedd1951181c4259a16459bc2faf00-98.jpg", "descriptions": "In the most fearsome war ever fought, emerged the most fearless soldiers – the Commandos. Have you got what it takes to join the original elite Special Force in the World War II shooter Commandos Strike Force? In a new direction for the multi-million selling series, Commandos Strike ForceIn the most fearsome war ever fought, emerged the most fearless soldiers – the Commandos. Have you got what it takes to join the original elite Special Force in the World War II shooter Commandos Strike Force? In a new direction for the multi-million selling series, Commandos Strike Force takes you right into the heart of the action from a first person perspective. Take control of the three members of the Strike Force unit, each with their own play style. Switch between the Green Beret, always at the heart of the action with his expertise in combat and the use of heavy weaponry; the Sniper with his nerves of steel and expert marksmanship; and the Spy, stealthily striking at the heart of the enemy. However, it is your choice how you execute plans of attack by using the Commandos' unique skills. Set in war torn Europe amid the backdrop of World War II, you must take your highly trained group on a series of daring missions, deep behind enemy lines in France, Norway and Russia. Taking control of a Nazi-occupied town, freeing French Resistance prisoners and kidnapping a general are a few of the large range of missions. As well as a compelling single player campaign, the game features a variety of online multiplayer modes. [Eidos Interactive]… Expand"}, {"name": "Hardwood Spades", "details_link": "https://www.metacritic.com/game/xbox-360/hardwood-spades", "publisher": "Silver Creek Entertainment", "release_date": "Dec  8 2005", "developers": ["Silver Creek Entertainment"], "platforms": ["iPhone/iPad", "Xbox 360"], "num_players": "4  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/e56e61ea9192535b1d49acf87e9cd15e-98.jpg", "descriptions": "[Xbox Live Arcade]  Welcome to Hardwood Spades ... the game where a trick IS a treat. Bid on how many tricks you can take, then work with your partner to make it happen. Don't overbid, or you'll be set. But don't underbid either, or you'll be stuck with a bag! If you think you can duck all[Xbox Live Arcade]  Welcome to Hardwood Spades ... the game where a trick IS a treat. Bid on how many tricks you can take, then work with your partner to make it happen. Don't overbid, or you'll be set. But don't underbid either, or you'll be stuck with a bag! If you think you can duck all the tricks, go for a nil bid ... just make sure you're not holding the Ace of Spades. Great version of Classic Spades with rule variants like Cutthroat, four-player partners, Suicide, and Mirrors. Customizable items include backgrounds, card faces, card backs, and tables. [Xbox.com]… Expand"}, {"name": "Viewtiful Joe: Red Hot Rumble", "details_link": "https://www.metacritic.com/game/gamecube/viewtiful-joe-red-hot-rumble", "publisher": "Capcom", "release_date": "Nov  8 2005", "developers": ["Clover Studio"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/30296e36a1d922ddc34e92863fb2f86c-98.jpg", "descriptions": "Captain Blue is casting for the lead in his new action movie and the competition is RED HOT! Fight head-to-head against your friends - whoever is the most kick-butt lands the starring role!"}, {"name": "Atomic Betty", "details_link": "https://www.metacritic.com/game/game-boy-advance/atomic-betty", "publisher": "Namco", "release_date": "Oct 25 2005", "developers": ["Big Blue Bubble Inc.", "Breakthrough New Media"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/c20412d126bd14a13c1875ed291d4f30-98.jpg", "descriptions": "Betty has a lot more to handle than most little girls. To her friends and family, she is your average, girl-next-door, but when the galaxy beckons, she becomes Atomic Betty, Galactic Guardian and Defender of the Cosmos. With the help of her trusty sidekicks, Sparky and X-5, Betty must saveBetty has a lot more to handle than most little girls. To her friends and family, she is your average, girl-next-door, but when the galaxy beckons, she becomes Atomic Betty, Galactic Guardian and Defender of the Cosmos. With the help of her trusty sidekicks, Sparky and X-5, Betty must save the galaxy from the evil Maximus I.Q., while at the same time saving her reputation on Earth from the scheming of her archrival, Penelope. \"Atomic Betty's\" five playable characters, rocket ship travel, selectable gadgets and weapons, and fast-paced story bring the cartoon hit to life.… Expand"}, {"name": "Namco Museum 50th Anniversary", "details_link": "https://www.metacritic.com/game/xbox/namco-museum-50th-anniversary", "publisher": "Namco", "release_date": "Aug 30 2005", "developers": ["Backbone Vancouver"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/2ad7f781a31ee367ac8a74f2645cc273-98.jpg", "descriptions": "Namco celebrates their 50th anniversary by packaging 14 of their best classic arcade games onto one disc. The interface lets you browse a virtual game hall with each game shown in its original arcade cabinet. The games included in this collection are: Pac-Man, Ms. Pac-Man, Galaga, Galaxian,Namco celebrates their 50th anniversary by packaging 14 of their best classic arcade games onto one disc. The interface lets you browse a virtual game hall with each game shown in its original arcade cabinet. The games included in this collection are: Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, Pole Position, Pole Position II, Rolling Thunder, Rally X, Bosconian, Dragon Spirit, Sky Kid, Xevious, and Mappy.… Expand"}, {"name": "Northland", "details_link": "https://www.metacritic.com/game/pc/northland", "publisher": "GMX Media", "release_date": "Mar 24 2004", "developers": ["Funatics Development GmbH", "Funatics Software", "Funatics"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1-6 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 62, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/a22dfa0ce6ce49128c577698cd90344d-98.jpg", "descriptions": "The story begins where the plot of \"Cultures 2 - The Gates of Asgard\" ended. After perilous adventures our four heroes defeated the Midgard serpent and thus saved the world. A great celebration began and everyone was happy and content. But everything has to come to an end sometime, and timeThe story begins where the plot of \"Cultures 2 - The Gates of Asgard\" ended. After perilous adventures our four heroes defeated the Midgard serpent and thus saved the world. A great celebration began and everyone was happy and content. But everything has to come to an end sometime, and time to say farewell came faster than our friends wanted.… Expand"}, {"name": "Cold Zero: No Mercy", "details_link": "https://www.metacritic.com/game/pc/cold-zero-no-mercy", "publisher": "Encore Software, Inc.", "release_date": "Aug 22 2003", "developers": ["JoWooD Entertainment AG"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 62, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/162f5339f7a262ddf648b5a0a6e31b73-98.jpg", "descriptions": "The player starts out as Private Eye John Mc Affrey. Together with his assistant Jane he has his own detective agency. Because he is completely broke, one day he takes a job where he has to secretly exchange way-bills. The job is finished very quickly, but now his problems are reallyThe player starts out as Private Eye John Mc Affrey. Together with his assistant Jane he has his own detective agency. Because he is completely broke, one day he takes a job where he has to secretly exchange way-bills. The job is finished very quickly, but now his problems are really starting to grow. The cheated person, you see, is a Don of the Italian Mafia...\r John has now a simple choice to make: Die. Or agree to carry out more illegal missions. John decides to remain among the living; his first job is to steal a virus called \"Cold Zero\" from a Bio-Research lab. Was this a good decision? You will soon see... [JoWood Productions]… Expand"}, {"name": "Alter Echo", "details_link": "https://www.metacritic.com/game/xbox/alter-echo", "publisher": "THQ", "release_date": "Aug 19 2003", "developers": ["Outrage Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 62, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/9084cf85b3084e2cf7d9aed7e32edb0a-98.jpg", "descriptions": "In Alter Echo, interstellar corporations mine a new organic skin called Plast and use it to make biomachines. Nevin, who can physically alter Plast and time itself, discovers that illegal experiments have infected Plast with human consciousness, and now he must fight for survival against aIn Alter Echo, interstellar corporations mine a new organic skin called Plast and use it to make biomachines. Nevin, who can physically alter Plast and time itself, discovers that illegal experiments have infected Plast with human consciousness, and now he must fight for survival against a world gone mad. As you battle wave after wave of biomechanical enemies, you can morph between Melee, Gun, and Stealth modes. A Time Dilation system allows players to freeze the action and cue up an unstoppable flurry of moves and special attacks.… Expand"}, {"name": "Big Mutha Truckers", "details_link": "https://www.metacritic.com/game/playstation-2/big-mutha-truckers", "publisher": "THQ", "release_date": "Jun 16 2003", "developers": ["Eutechnyx"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Driving", "Racing", "Truck"], "meta_score": 62, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/d3eb63dad2970dd5f9b54572b55349d3-98.jpg", "descriptions": "Hick State County, in the USA?s Deep South, is home to the infamous Big Mutha Truckers Haulage Company. That's about to change though, as proprietor Ma Jackson has announced she's planning on retiring. Her dilemma is who to leave the company to... Ma has four very different kids and choosingHick State County, in the USA?s Deep South, is home to the infamous Big Mutha Truckers Haulage Company. That's about to change though, as proprietor Ma Jackson has announced she's planning on retiring. Her dilemma is who to leave the company to... Ma has four very different kids and choosing a successor should be done fair and square. The solution is simple: Ma's going to hold a \"trial by trucking!\" The one who can make the most money buying, selling and hauling cargo around the County in sixty days will inherit the company when Ma retires. Can you truck 'n' trade your way to the top? There may be some sibling rivalry along the way (not to mention obstacles of other types...), but as Ma always says, \"When it comes to business, family don?t mean squat!\" [Empire Interactive]… Expand"}, {"name": "NBA ShootOut 2003", "details_link": "https://www.metacritic.com/game/playstation-2/nba-shootout-2003", "publisher": "SCEA", "release_date": "Sep 25 2002", "developers": ["SCEA"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/3b7e910b96f8a2f5a6f56ced34565dff-98.jpg", "descriptions": "NBA ShootOut 2003 furthers the NBA experience with 18 one-touch player controls including Screen, Auto Defend, Pump Fake and Special Dribble so gamers will have quicker and more refined player movements. Coupled with Total Control Passing, Screening, Shooting and Dribbling, gamers will haveNBA ShootOut 2003 furthers the NBA experience with 18 one-touch player controls including Screen, Auto Defend, Pump Fake and Special Dribble so gamers will have quicker and more refined player movements. Coupled with Total Control Passing, Screening, Shooting and Dribbling, gamers will have complete control over lifelike player motions that are the result of more than a dozen NBA stars being motion-captured in all aspects of the game, be it dribbling through traffic, passing, shooting or performing one of more than 50 signature dunks. [Sony]… Expand"}, {"name": "Diggles", "details_link": "https://www.metacritic.com/game/pc/diggles", "publisher": "Strategy First", "release_date": "Mar 20 2002", "developers": ["Innonics"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 62, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/1e49d860a83157767bf3a19b450e983e-98.jpg", "descriptions": "Accompany your Diggles clan and descend into an unexplored underground world full of great adventures, dangers and mysteries. Raise your Diggles, provide them with food, have them work hard and meet unique, strange creatures. Solve the secret  of the horrible mighty Fenris and prove yourAccompany your Diggles clan and descend into an unexplored underground world full of great adventures, dangers and mysteries. Raise your Diggles, provide them with food, have them work hard and meet unique, strange creatures. Solve the secret  of the horrible mighty Fenris and prove your fighting and Karate skills in tournaments and dojos. But watch out! Never lose track of your Diggles. [Innonics]… Expand"}, {"name": "ESPN NBA 2Night", "details_link": "https://www.metacritic.com/game/playstation-2/espn-nba-2night", "publisher": "Konami", "release_date": "Feb 13 2001", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/39c2a60444f9192e85c64b84e67cf899-98.jpg", "descriptions": "EA Sports' Live series isn't the only game in town anymore. Konami and ESPN have teamed up to deliver ESPN NBA 2Night. The ESPN license is being tapped for more than just a name. The game will feature authentic camera angles and the wry humor of SportsCenter's Stuart Scott and BrentEA Sports' Live series isn't the only game in town anymore. Konami and ESPN have teamed up to deliver ESPN NBA 2Night. The ESPN license is being tapped for more than just a name. The game will feature authentic camera angles and the wry humor of SportsCenter's Stuart Scott and Brent Musberger. Konami claims it will have the full NBA roster and that its detailed graphics engine means you'll have no problem distinguishing your favorite player. From the superhuman dunking ability of Kevin...… Expand"}, {"name": "Lineage II: The Chaotic Chronicle", "details_link": "https://www.metacritic.com/game/pc/lineage-ii-the-chaotic-chronicle", "publisher": "NCSOFT", "release_date": "Apr 27 2004", "developers": ["NCSOFT"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 62, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/c1a88d1617c6f35865c90c30bf2f7e9a-98.jpg", "descriptions": "NCsoft brings a whole new experience to the fantasy role playing game genre with Lineage II: The Chaotic Chronicle. This all-new game, developed and published by NCsoft, is a prequel to their blockbuster hit, Lineage. Set 150 years before Lineage, as the kingdom of Aden becomes a unifiedNCsoft brings a whole new experience to the fantasy role playing game genre with Lineage II: The Chaotic Chronicle. This all-new game, developed and published by NCsoft, is a prequel to their blockbuster hit, Lineage. Set 150 years before Lineage, as the kingdom of Aden becomes a unified state, Lineage II: The Chaotic Chronicle is designed to show the struggles that take place during a time where several provinces come under one rule. Old loyalties must change, new structure must be established and national sovereignty and pride must be formed. However, a group of lands coming under single rule doesn't equate to immediate peace... In this world, many players fight for control over any and every piece of the new kingdom. [NCsoft]… Expand"}, {"name": "We Happy Few", "details_link": "https://www.metacritic.com/game/pc/we-happy-few", "publisher": "Compulsion Games", "release_date": "Aug 10 2018", "developers": ["Compulsion Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 62, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/80f0685577012e5cf5464bf6fb26c652-98.jpg", "descriptions": "We Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial. Set in a drug-fuelled, retrofuturistic city in an alternative 1960s England, you’ll have to blend in with its other inhabitants, who have their own set ofWe Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial. Set in a drug-fuelled, retrofuturistic city in an alternative 1960s England, you’ll have to blend in with its other inhabitants, who have their own set of not-so-normal rules. … Expand"}, {"name": "Zombie Army Trilogy", "details_link": "https://www.metacritic.com/game/playstation-4/zombie-army-trilogy", "publisher": "Rebellion", "release_date": "Mar  3 2015", "developers": ["Rebellion"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/72d5e592ee926223cb5db12eb3133f96-98.jpg", "descriptions": "In the dying embers of World War II, Hitler has unleashed one final, unholy gamble – a legion of undead super soldiers that threatens to swallow up the whole of Europe. Fight alone or team up to save humanity from the zombie menace in this apocalyptic third-person shooter."}, {"name": "Harvey Birdman: Attorney at Law", "details_link": "https://www.metacritic.com/game/psp/harvey-birdman-attorney-at-law", "publisher": "Capcom", "release_date": "Jan  8 2008", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/f0406ec1fe0d4294dc6c4f2d39d21afc-98.jpg", "descriptions": "Harvey Birdman: Attorney at Law is a fully animated interactive adventure game that merges the fun and mayhem of the popular Adult Swim TV show with Capcom's unique style of gameplay. Players step into the shiny wingtips of Harvey Birdman, a third-rate superhero turned third-rate defenseHarvey Birdman: Attorney at Law is a fully animated interactive adventure game that merges the fun and mayhem of the popular Adult Swim TV show with Capcom's unique style of gameplay. Players step into the shiny wingtips of Harvey Birdman, a third-rate superhero turned third-rate defense attorney charged with exonerating parodied classic cartoon characters. Over the course of the game, players must guide Harvey through a series of odd and comical cases. Each of the game's five interactive stories takes the winged crusader of justice to familiar locations from the TV show. In order to prove his client's innocence, Harvey must peruse the scene of the crime, gather evidence, talk with other cartoon characters, occasionally have drinks with opposing council, and of course, tear holes – no matter how ridiculous – in the testimony provided by the witness for the prosecution. Harvey must bring the whole story together to defend his client in a court where anything can happen... including a confrontation with the prosecution who brandishes a Shrink Ray Gun. [Capcom]… Expand"}, {"name": "Arena Football: Road to Glory", "details_link": "https://www.metacritic.com/game/playstation-2/arena-football-road-to-glory", "publisher": "EA Sports", "release_date": "Feb 20 2007", "developers": ["BudCat"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/f843aa36a922f99c9019996fe7093b18-98.jpg", "descriptions": "More than 40 teams are available in Arena Football: Road to Glory and for the first time the user can play as their favorite AFL or af2 team.  af2 is the developmental league of the AFL playing primarily in secondary markets. In addition, players can take the af2 circuit by storm by winningMore than 40 teams are available in Arena Football: Road to Glory and for the first time the user can play as their favorite AFL or af2 team.  af2 is the developmental league of the AFL playing primarily in secondary markets. In addition, players can take the af2 circuit by storm by winning the ArenaCup then export their players into the AFL and set their sights on an ArenaBowl championship. The game brings back the excitement and experience of hard-hitting, high-scoring intensity of 50-yard goal line-to-goal line battles. Players can dominate both leagues by scoring at will and wreaking havoc on their toughest rivals with huge hits that send players into-and over-the walls. [Electronic Arts]… Expand"}, {"name": "Pac-Man", "details_link": "https://www.metacritic.com/game/xbox-360/pac-man", "publisher": "Namco Bandai Games", "release_date": "Aug  9 2006", "developers": ["Namco Bandai Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 62, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/80c16293a272c561990e657561d43f39-98.jpg", "descriptions": "[Xbox Live Arcade]  Play one of the all-time classic videogames with Pac-Man. Move through treacherous mazes and eat all the Pac-Dots to clear each stage while avoiding the sinister ghosts. Eat Power Pellets to become temporarily invincible. Turn the tables on the ghosts and chase them down.[Xbox Live Arcade]  Play one of the all-time classic videogames with Pac-Man. Move through treacherous mazes and eat all the Pac-Dots to clear each stage while avoiding the sinister ghosts. Eat Power Pellets to become temporarily invincible. Turn the tables on the ghosts and chase them down. Eat all four ghosts to ear the most bonus points. Are you skilled enough to stay alive through all the stages? This classic video game was released in 1980, and became a phenomenon around the world. The Guinness Book of World Records acknowledged Pac-Man as the \"Most Successful Coin-Operated Game in History\" in 2005. Now you won't need a pocketful of quarters to play this classic arcade title. [Namco Bandai]… Expand"}, {"name": "Mortal Kombat Arcade Kollection", "details_link": "https://www.metacritic.com/game/xbox-360/mortal-kombat-arcade-kollection", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Aug 31 2011", "developers": ["Other Ocean Interactive", "NetherRealm Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Fighting", "Compilation", "2D"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/173d96603f79f00e9fe1f66a27d96244-98.jpg", "descriptions": "Mortal Kombat Arcade Kollection will offer fans the chance to play through the games in their original arcade state and rediscover all their favorite characters, fatalities and environments as well as relive some of the franchise’s most memorable secrets.  In addition, this new collectionMortal Kombat Arcade Kollection will offer fans the chance to play through the games in their original arcade state and rediscover all their favorite characters, fatalities and environments as well as relive some of the franchise’s most memorable secrets.  In addition, this new collection will feature online play, leaderboards, achievements and trophies.… Expand"}, {"name": "Bleeding Edge", "details_link": "https://www.metacritic.com/game/pc/bleeding-edge", "publisher": "Xbox Game Studios", "release_date": "Mar 24 2020", "developers": ["Ninja Theory"], "platforms": ["Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 62, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/8f3f9edd960953a91b31e5c7b350f1f6-98.jpg", "descriptions": "Team Up. Cause Chaos. Grab your team and tear it up in Bleeding Edge, an electrifying online brawler where every fighter comes mechanically enhanced for mayhem. Choose your fighter from a diverse cast of colourful characters from the edges of society: burn rubber as bold and beautifulTeam Up. Cause Chaos. Grab your team and tear it up in Bleeding Edge, an electrifying online brawler where every fighter comes mechanically enhanced for mayhem. Choose your fighter from a diverse cast of colourful characters from the edges of society: burn rubber as bold and beautiful Buttercup with her detachable saw blade arms, wreak havoc as Black-Metal rocker Niđhöggr with his electrifying guitar solos or slash up the streets as Daemon, New York’s most wanted assassin.… Expand"}, {"name": "continue?9876543210", "details_link": "https://www.metacritic.com/game/pc/continue9876543210", "publisher": "Jason Oda", "release_date": "Jan  3 2014", "developers": ["Jason Oda"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/4111f497e99f859f37c5239a430dce55-98.jpg", "descriptions": "You are a dead, failed video game character wandering through the recesses of the Random Access Memory, trying to find peace in the final moments of your existence before being deleted forever..."}, {"name": "Commandos Strike Force", "details_link": "https://www.metacritic.com/game/xbox/commandos-strike-force", "publisher": "Eidos Interactive", "release_date": "Apr  4 2006", "developers": ["Pyro Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Historic"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/5acaa6c726deefca10af1f0bc16789ca-98.jpg", "descriptions": "See if you have what it takes to join an elite team of commandos. Commandos Strike Force is a new WWII shooter that puts you in control of the three members of the Strike Force unit. During the game, you play as a Green Beret (an expert in combat and the use of heavy weaponry), a sniper (anSee if you have what it takes to join an elite team of commandos. Commandos Strike Force is a new WWII shooter that puts you in control of the three members of the Strike Force unit. During the game, you play as a Green Beret (an expert in combat and the use of heavy weaponry), a sniper (an expert marksman), and a spy (an expert in stealthy attacks).… Expand"}, {"name": "Mega Man Battle Network 6 Cybeast Gregar", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network-6-cybeast-gregar", "publisher": "Capcom", "release_date": "Jun 13 2006", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 62, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/61e33f67f8a106ff8f0ae683d8fcc1bd-98.jpg", "descriptions": "In Mega Man Battle Network 6, Lan's father has received a job transfer and the family moves to Cyber City, a town known for conducting various technological experiments. Lan will meet new people and build new friendships in the real world while Mega Man befriends helpful Navis and encountersIn Mega Man Battle Network 6, Lan's father has received a job transfer and the family moves to Cyber City, a town known for conducting various technological experiments. Lan will meet new people and build new friendships in the real world while Mega Man befriends helpful Navis and encounters dangerous new enemies on the virtual plane. Together they will face threats far more powerful and perilous than they ever have before.… Expand"}, {"name": "Blitz: The League II", "details_link": "https://www.metacritic.com/game/playstation-3/blitz-the-league-ii", "publisher": "Midway", "release_date": "Oct 13 2008", "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/cf3c202425489f7a894b4cf2b32258f1-98.jpg", "descriptions": "Blitz: The League II continues the franchise legacy as the ultimate alternative to the watered-down, licensed competition. In addition to an all-new story mode penned by Peter Egan (ESPN's Playmakers), Blitz: The League II features include: Precision-Aim Tackles, player-controlled touchdownBlitz: The League II continues the franchise legacy as the ultimate alternative to the watered-down, licensed competition. In addition to an all-new story mode penned by Peter Egan (ESPN's Playmakers), Blitz: The League II features include: Precision-Aim Tackles, player-controlled touchdown celebrations, an enhanced on-the-field Clash Mode, online multiplayer capabilities, expanded rosters with all-new personalities, and the return of a cornerstone of the Blitz franchise...Late Hits! Football legend Lawrence Taylor returns as the game's cover-athlete and star linebacker for the New York Nightmare, Quentin Sands, along with a star-studded supporting cast. [Midway]… Expand"}, {"name": "Legend of Dungeon", "details_link": "https://www.metacritic.com/game/pc/legend-of-dungeon", "publisher": "Robot Loves Kitty", "release_date": "Sep 13 2013", "developers": ["Robot Loves Kitty"], "platforms": "PC", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 62, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/7833ba5863225ceb4c483a8b2fb1b47a-98.jpg", "descriptions": "Legend of Dungeon is a four-player co-op beat-'em-up with dynamic lighting on pixel art."}, {"name": "Buzz! Junior: RoboJam", "details_link": "https://www.metacritic.com/game/playstation-2/buzz!-junior-robojam", "publisher": "SCEA", "release_date": "Mar 11 2008", "developers": ["Cohort Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/e3a9f9239c643be4b180ca968db6be06-98.jpg", "descriptions": "Buzz! Junior: RoboJam features four cute robots competing in a number of ridiculous and funny challenges to become Robot of the Month. You'll need quick reactions in order to help them battle their way through a hilarious collection of great new games. These include dodging the rockets ofBuzz! Junior: RoboJam features four cute robots competing in a number of ridiculous and funny challenges to become Robot of the Month. You'll need quick reactions in order to help them battle their way through a hilarious collection of great new games. These include dodging the rockets of top military droids on the firing range, becoming crash test dummies for the day, and dancing the night away with an enormous singing alien octopus. The hapless robot pals compete against each other in an every-bot-for-himself competition. Gain the greatest number of nuts for your robot by the end of the challenge to win! When less than four players are available, or even when only one person is playing, Buzz! Junior: RoboJam, allows players to participate in the full 4-player mode and have the most possible fun. 1-4 player Buzzer bashing fun, select from four Robots which have different colours and characteristics. 25 great games giving even more Buzz! Junior humour (all with a whiff of diesel oil). [Sony]… Expand"}, {"name": "Godzilla: Save the Earth", "details_link": "https://www.metacritic.com/game/playstation-2/godzilla-save-the-earth", "publisher": "Atari", "release_date": "Nov  2 2004", "developers": ["Pipeworks Software", "Inc."], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 62, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/c5a02329e079274808cab55fba995657-98.jpg", "descriptions": "In the single-player game, G-Force scientists have cracked Godzilla's genetic code from samples obtained during the Vortaak invasion.  Scientists have refined the code to grow super-enriched \"Godzilla-Matter\" -- a virtually indestructible substance with the exact physical properties asIn the single-player game, G-Force scientists have cracked Godzilla's genetic code from samples obtained during the Vortaak invasion.  Scientists have refined the code to grow super-enriched \"Godzilla-Matter\" -- a virtually indestructible substance with the exact physical properties as Godzilla's radioactive back spikes.  The Vortaak learn of the Godzilla Matter and strike Monster Island in an attempt to steal G-Cells and seize control of Earth's monsters. As Godzilla, the player awakens and fights to stop the UFOs from stealing G-Cells, and to free his fellow monsters from captivity.  Throughout the game's missions, Vorticia sends waves of monsters, UFOs, mind-controlled military and earth-threatening devices at Godzilla, who must fight to defeat the enemies and find the hidden G-Cells before the UFOs can steal them. The epic battle for Earth will range across the globe in more than a dozen massive, destructible city environments, including San Francisco, Los Angeles, Tokyo, Osaka and New York. Features a variety of online multiplayer options for up to four players where gamers can smash, bash and trash opposing monsters and cities in gargantuan online melees.  Player will be able to go head-to-head, three- or four-player free-for-all, or team up for two-on-two combat. Godzilla will face off against more than 18 classic Toho movie monsters, each carefully designed to recreate the authentic film look and feel.  Monsters include Godzilla 2000 and 90s,  King Ghidorah, Gigan, Mothra, SpaceGodzilla, Biollante and many more. [Atari]… Expand"}, {"name": "Redshirt", "details_link": "https://www.metacritic.com/game/pc/redshirt", "publisher": "Positech Games", "release_date": "Nov 13 2013", "developers": ["The Tiniest Shark"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General"], "meta_score": 62, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/3/99ae62349bbebe34157ec9dd1e7cccb0-98.jpg", "descriptions": "Redshirt is the comedy sci-fi sim about social networking aboard a space station, starring the station's most ambitious low-ranking peon: you! Navigate the professional and interpersonal politics of the ubiquitous \"Spacebook\" to curry favor among friends and colleagues. As intenseRedshirt is the comedy sci-fi sim about social networking aboard a space station, starring the station's most ambitious low-ranking peon: you! Navigate the professional and interpersonal politics of the ubiquitous \"Spacebook\" to curry favor among friends and colleagues. As intense intergalactic conflict rages around you, it's up to you to accrue those all-important \"likes\" on your status updates! Whether you're looking for love, opportunities for promotion, or even a chance to play Zero-G golf with the captain, you can schmooze your way through social circles and claw your way up the career ladder. Perhaps you too can finally achieve the dream of an off-station transfer, or even the Redshirt's opportunity of a lifetime: being sent on an away-mission!… Expand"}, {"name": "Speedball 2 - Tournament", "details_link": "https://www.metacritic.com/game/pc/speedball-2---tournament", "publisher": "Valve Software", "release_date": "Nov 27 2007", "developers": ["Kylotonn"], "platforms": "PC", "genres": ["Sports", "Alternative", "Team", "Futuristic", "Futuristic"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/dac297550284e370102477d2671c17f6-98.jpg", "descriptions": "In 2326, rival gangs form an ultra-violent streetsports league Speedball to settle their deadly disputes. Two teams face each other in bloody battles for a steel ball: Nine on nine – in an all-out rush on the opponents’ goal. Almost any malicious move is permitted. The winner of the matchesIn 2326, rival gangs form an ultra-violent streetsports league Speedball to settle their deadly disputes. Two teams face each other in bloody battles for a steel ball: Nine on nine – in an all-out rush on the opponents’ goal. Almost any malicious move is permitted. The winner of the matches secures supremacy over the city. The highly anticipated PC revival to the legendary Amiga classic transforms the futuristic game setting with state-of-the-art technology into a high-speed online sports spectacle. Offering international leagues, a worldwide ranking system and an intuitive matchmaking function, Speedball 2 - Tournament pulls all registers of modern multiplayer gaming action. Fully customisable male, female and cyborg characters, dynamic sports battles, and a unique online community platform with online player and clan profiles will thrill sports simulation enthusiasts, action fans, and e-sports experts likewise. [Valve]… Expand"}, {"name": "Yu-Gi-Oh! GX Tag Force", "details_link": "https://www.metacritic.com/game/psp/yu-gi-oh!-gx-tag-force", "publisher": "Konami", "release_date": "Nov 14 2006", "developers": ["Konami"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/2b5bd1e9bb29dc671b925c4178f0901c-98.jpg", "descriptions": "Welcome back to the Duel Academy. This school year is highlighted by an event like no other, something brand new to world of Yu-Gi-Oh! The Academy has decided to hold a tournament with one catch - you now have a tag team partner to help you duel. Practice dueling with your friends, find theWelcome back to the Duel Academy. This school year is highlighted by an event like no other, something brand new to world of Yu-Gi-Oh! The Academy has decided to hold a tournament with one catch - you now have a tag team partner to help you duel. Practice dueling with your friends, find the best partner, and the winner of the tournament will be allowed the use of Duel Academy Island for a day. The first Yu-Gi-Oh! game for the PSP system. Compete in teams of two for the first time, switching characters and decks mid-duel. More cards than any previous Yu-Gi-Oh! video game allow for new deck and duel strategies. Updated duel field with 3D animations for each card. Create custom duel puzzles for endless strategic fun on the go. Multiplayer duels for up to four players via local wireless connection. [Konami]… Expand"}, {"name": "Warship Gunner 2", "details_link": "https://www.metacritic.com/game/playstation-2/warship-gunner-2", "publisher": "Koei", "release_date": "Mar 21 2006", "developers": ["Micro Cabin"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Ship"], "meta_score": 62, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/58477e5299caccaf822669d20692d62d-98.jpg", "descriptions": "In the sequel to the naval action sim \"Naval Ops:Warship Gunner\", video gamers engage in deadly sub-to-sub stealth warfare, pilot classic warships and design their own fleet of destroyers, submarines, and battlecruisers. With KOEI's strategic twist on naval action, Warship Gunner 2 letsIn the sequel to the naval action sim \"Naval Ops:Warship Gunner\", video gamers engage in deadly sub-to-sub stealth warfare, pilot classic warships and design their own fleet of destroyers, submarines, and battlecruisers. With KOEI's strategic twist on naval action, Warship Gunner 2 lets players invest in new technologies to develop a full spectrum of artillery systems, aircraft, ship hulls, propulsion and electronics. Over 1000 vital components in all. Combat in Warship Gunner 2 takes place across 100 missions and 60 stages teeming with lethal seafighters, swarms of enemy aircraft, and unworldly super-weapons. Using the game's control panel and advanced heads-up display, players must track their targets through darkness, varying sea states and the most adverse weather conditions known to man. [KOEI]… Expand"}, {"name": "Assassin's Creed Chronicles: Russia", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-chronicles-russia", "publisher": "Ubisoft", "release_date": "Feb  9 2016", "developers": ["Ubisoft", "Climax Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Linear"], "meta_score": 62, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/4a9fd7b2fa18b374d9b727daaf779e5c-98.jpg", "descriptions": "Assassin's Creed Chronicles: Russia occurs in Russia, 1918. Nikolai Orelov wants to leave with his family, but he is required to perform one last mission for the Assassin Order: infiltration of the house where the tsar's family is being held by the Bolsheviks and theft of an artifact thatAssassin's Creed Chronicles: Russia occurs in Russia, 1918. Nikolai Orelov wants to leave with his family, but he is required to perform one last mission for the Assassin Order: infiltration of the house where the tsar's family is being held by the Bolsheviks and theft of an artifact that has been fought over by Assassins and Templars for centuries. Along the way, he witnesses the massacre of the tsar's children, but manages to save the princess, Anastasia. He must escape the Templars while protecting the artifact and Anastasia. [Ubisoft]… Expand"}, {"name": "Toy Soldiers: War Chest", "details_link": "https://www.metacritic.com/game/playstation-4/toy-soldiers-war-chest", "publisher": "Ubisoft", "release_date": "Aug 11 2015", "developers": ["Krome Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Strategy", "General"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/d76a7316899db2605020082f85692639-98.jpg", "descriptions": "Leaving the battlefields of past eras behind, players face off against rival toy armies to determine who rules the battlefield."}, {"name": "Line Rider 2: Unbound", "details_link": "https://www.metacritic.com/game/wii/line-rider-2-unbound", "publisher": "Genius Products, Inc.", "release_date": "Oct  7 2008", "developers": ["InXile Entertainment"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/5c556750bcfd31c73bbea7e18053df12-98.jpg", "descriptions": "(Also known as \"Line Rider Freestyle\" in the UK/EU)   In Line Rider, the sled-stealing scumbag Chaz is up to no good and only you, as the clever and cunning Bosh, can defeat him. For Bosh to save his true love Bailey, players must solve over 40 mind-bending puzzles created by the #1 Line(Also known as \"Line Rider Freestyle\" in the UK/EU)   In Line Rider, the sled-stealing scumbag Chaz is up to no good and only you, as the clever and cunning Bosh, can defeat him. For Bosh to save his true love Bailey, players must solve over 40 mind-bending puzzles created by the #1 Line Rider player in the world, TechDawg. [Genius Products]… Expand"}, {"name": "Trailblazers", "details_link": "https://www.metacritic.com/game/switch/trailblazers", "publisher": "Rising Star Games", "release_date": "Nov 15 2018", "developers": ["Supergonk Ltd.", "Supergonk"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 62, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/f3cd00f62725889c191674849c29625b-98.jpg", "descriptions": "Get ready for high-speed thrills with an explosion of colour in Trailblazers, the first-ever second-to-second co-operative arcade racer. Paint the track as you go to dynamically change the racing line, boost on your team's colour and outwit the opposition in a sprint for the finish. The moreGet ready for high-speed thrills with an explosion of colour in Trailblazers, the first-ever second-to-second co-operative arcade racer. Paint the track as you go to dynamically change the racing line, boost on your team's colour and outwit the opposition in a sprint for the finish. The more you paint, the faster you can go. Trailblazers is an innovative co-operative racer with groundbreaking on-track gameplay. Racing in teams of up to three-versus-three, players paint the track to create the best racing line, then use that paint to boost up to insane speeds. Drive with flair and style to gain skill points and blaze your way to victory! Experience blistering high-speed action with up to six players online, or locally via split-screen for up to four local players with additional online or AI-controlled challengers. … Expand"}, {"name": "Thunder Wolves", "details_link": "https://www.metacritic.com/game/playstation-3/thunder-wolves", "publisher": "bitComposer Games", "release_date": "Aug 13 2013", "developers": ["Most Wanted Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 62, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/9033e4029de840cc75f677ea410bac8d-98.jpg", "descriptions": "Thunder Wolves puts gamers in the hot seat of an experienced helicopter group that has survived a flurry of bullets and caused more destruction than the Seventh United State Army. Gamers will embark on a variety of missions including high-risk convoy protection, deploying a commando onThunder Wolves puts gamers in the hot seat of an experienced helicopter group that has survived a flurry of bullets and caused more destruction than the Seventh United State Army. Gamers will embark on a variety of missions including high-risk convoy protection, deploying a commando on fast-moving train or unleashing hell on a fully destructible battlefield.… Expand"}, {"name": "Dragon Ball Z: Buu's Fury", "details_link": "https://www.metacritic.com/game/game-boy-advance/dragon-ball-z-buus-fury", "publisher": "Atari", "release_date": "Sep 14 2004", "developers": ["Webfoot Technologies"], "platforms": "Game Boy Advance", "num_players": "24  Online", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 62, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/bf1f46b1700cfd9cbfe10ffc0c4ebab4-98.jpg", "descriptions": "Dragon Ball Z: Buu's Fury begins with the Other World Tournament Saga and continues through the Kid Buu Saga, the final chapter in the Dragon Ball Z story. In a game that combines action and role-playing game elements with exploration, enemies, boss enemies, puzzles, and quests, yourDragon Ball Z: Buu's Fury begins with the Other World Tournament Saga and continues through the Kid Buu Saga, the final chapter in the Dragon Ball Z story. In a game that combines action and role-playing game elements with exploration, enemies, boss enemies, puzzles, and quests, your ultimate goal is to defeat Buu. Choose the best character--Goku, Vegeta, Gohan, Goten, or Trunks--for each mission, create fusion characters whenever necessary, and unleash powerful attack combos and super moves.… Expand"}, {"name": "SimCity 2000", "details_link": "https://www.metacritic.com/game/game-boy-advance/simcity-2000", "publisher": "Destination Software", "release_date": "Nov 13 2003", "developers": ["Full-Fat"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Modern"], "meta_score": 62, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/3f9bdf1ce165f83537e2bab8a681b09b-98.jpg", "descriptions": "SimCity 2000 puts an entire city in the palm of your hand.  SimCity 2000 lets you create, build, and run a city of your own.  Take on the role as a mayor and call the shots for the entire city.  You'll have to keep up on the housing, industries, mass transportation, and commerce to attractSimCity 2000 puts an entire city in the palm of your hand.  SimCity 2000 lets you create, build, and run a city of your own.  Take on the role as a mayor and call the shots for the entire city.  You'll have to keep up on the housing, industries, mass transportation, and commerce to attract potential citizens.  And just when you think you have it under control, a natural disaster or alien invasion may occur to set you back.  However, if you can conquer all of these problems, you just might be able to turn a small town into a thriving metropolis.… Expand"}, {"name": "Tetris Worlds (Online Edition)", "details_link": "https://www.metacritic.com/game/xbox/tetris-worlds-online-edition", "publisher": "THQ", "release_date": "Jun 13 2003", "developers": ["Radical Entertainment"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Stacking"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/f9b2f8a778a43a60b3190c7b9367fe16-98.jpg", "descriptions": "Tetris is taking the next step on next-generation platforms.  Tetris Worlds takes the simple, yet addictive puzzle gameplay of Tetris and spices it up with beautiful 3D graphics and six variations.  In Story mode, you play each variation of Tetris Worlds until your Tetriminos hit the top ofTetris is taking the next step on next-generation platforms.  Tetris Worlds takes the simple, yet addictive puzzle gameplay of Tetris and spices it up with beautiful 3D graphics and six variations.  In Story mode, you play each variation of Tetris Worlds until your Tetriminos hit the top of the screen.  Test your Tetris ranks in Arcade mode by reaching goals within a two-minute time limit and play multiplayer Tetris Worlds.  And now you can play online against friends all over the world using Xbox Live.… Expand"}, {"name": "Resident Evil 3: Nemesis", "details_link": "https://www.metacritic.com/game/gamecube/resident-evil-3-nemesis", "publisher": "Capcom", "release_date": "Jan 15 2003", "developers": ["Capcom"], "platforms": ["PC", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 62, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/3/04be05a3099d2448d338f32f73e18e23-98.jpg", "descriptions": "A month and a half have passed since the mansion lab incident and now the secrets come back to haunt you in Resident Evil 3: Nemesis.  Join Jill Valentine in her attempt to escape a nightmarish city in ruins.  Around every corner lurk hordes of flesh-eating zombies, hideous mutants, and aA month and a half have passed since the mansion lab incident and now the secrets come back to haunt you in Resident Evil 3: Nemesis.  Join Jill Valentine in her attempt to escape a nightmarish city in ruins.  Around every corner lurk hordes of flesh-eating zombies, hideous mutants, and a relentless new nemesis.  You'll soon rely on cunning and brute force to stay alive.  The Resident Evil series has taken a horrifying turn, unveiling new layers in the Umbrella Corporation's devious activities.… Expand"}, {"name": "Hoshigami: Ruining Blue Earth", "details_link": "https://www.metacritic.com/game/playstation/hoshigami-ruining-blue-earth", "publisher": "Atlus Co.", "release_date": "Dec 20 2001", "developers": ["Max Five"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/abb154c55c6ef3bc5017aea3620da49b-98.jpg", "descriptions": "In the mystical land of Mardias, the Valaimian Empire threatens to upset the balance of power of the continent. Our hero, Fazz and his band of mercenaries are hired to protect one of the Ruins of Xia from the Valaimian forces. Little do they know, that a more sinister power is rising. WillIn the mystical land of Mardias, the Valaimian Empire threatens to upset the balance of power of the continent. Our hero, Fazz and his band of mercenaries are hired to protect one of the Ruins of Xia from the Valaimian forces. Little do they know, that a more sinister power is rising. Will you be able to stop it before the world of Hoshigami is engulfed in eternal darkness?… Expand"}, {"name": "Remote Assault", "details_link": "https://www.metacritic.com/game/pc/remote-assault", "publisher": "Shrapnel Games", "release_date": "Jul 29 2001", "developers": ["Shrapnel Games"], "platforms": "PC", "genres": ["Strategy", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/2204c3236fe43cac2b930d6cc12d1d48-98.jpg", "descriptions": "A \"non-RTS\" 3D real time wargame that provides you with tanks, supply vehicles, scouts, artillery, and a walker.  The game features single and 2 player LAN and Internet play."}, {"name": "Eternal Ring", "details_link": "https://www.metacritic.com/game/playstation-2/eternal-ring", "publisher": "Agetec Inc.", "release_date": "Oct 24 2000", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "First-Person"], "meta_score": 62, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/2455c6217477edd1251de38c15cf6796-98.jpg", "descriptions": "A young magician is sent by his king to investigate the strange happenings on the Island of No Return. Armed with his sword and his natural talent as a sorcerer, Cain attempts to be the first person to return from the island alive. Legend has it that the island is inhabited by numerousA young magician is sent by his king to investigate the strange happenings on the Island of No Return. Armed with his sword and his natural talent as a sorcerer, Cain attempts to be the first person to return from the island alive. Legend has it that the island is inhabited by numerous beasts, enormous dragons, and magical items that were supposed to be buried long ago. As Cain, you must solve several baffling scenarios and defend yourself while you search for the magic ring.… Expand"}, {"name": "The King of Fighters NeoWave", "details_link": "https://www.metacritic.com/game/xbox/the-king-of-fighters-neowave", "publisher": "SNK Playmore", "release_date": "Apr 18 2006", "developers": ["SNK Playmore"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Action", "Fighting", "2D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "KOF Neowave features 12 three-man teams made up of some of the greatest characters from SNK's 11-year history, including the Women Fighters Team (Mai, King and Yuri) and the Fatal Fury Team (Terry, Joe, and Andy). NEOWAVE features three modes of play - Super Cancel, Guard Break, and Max2. AKOF Neowave features 12 three-man teams made up of some of the greatest characters from SNK's 11-year history, including the Women Fighters Team (Mai, King and Yuri) and the Fatal Fury Team (Terry, Joe, and Andy). NEOWAVE features three modes of play - Super Cancel, Guard Break, and Max2. A new \"Heat Mode\" lets players power up their attacks in exchange for a gradual loss of health. Xbox Live support featuring head-to-head fighting and Tournament Mode. A total of 43 characters including 7 Bonus characters. 12 of the most dangerous fighting teams ever assembled. Pick your team and fight it out in the original 3-on-3 battle format. Beautifully rendered background graphics. Activate \"Heat Mode\" to power-up your attacks. Revives the evacuation rolling maneuver and thrust attacks. Over-the-top Super Special Moves. 3 modes of play: Super Cancel, Guard Break and Max2. Link a Special Move with a Super Attack in the Super Cancel Mode to cause extreme damage.… Expand"}, {"name": "Raving Rabbids: Travel in Time", "details_link": "https://www.metacritic.com/game/wii/raving-rabbids-travel-in-time", "publisher": "Ubisoft", "release_date": "Nov 21 2010", "developers": ["Ubisoft"], "platforms": ["3DS", "Wii"], "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/84d3f14423862190a1ccb2d743183d3b-98.jpg", "descriptions": "The fourth installment of this series features raving rabbids traveling in time in this Wii exclusive game."}, {"name": "Fading Shadows", "details_link": "https://www.metacritic.com/game/psp/fading-shadows", "publisher": "Agetec", "release_date": "Aug 27 2008", "developers": ["Ivolgamus"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/9d1e36a546f42c4eb3a0d8ad3abb6890-98.jpg", "descriptions": "Evil is afoot and the villainous Master Gardal has diabolical plans. With the aid of his faithful minions Quiph and Morg, he intends to conquer the famed Castle of Heaven... the supreme fortress built to protect the world from forces of darkness. The only way for Gardal to breach the castleEvil is afoot and the villainous Master Gardal has diabolical plans. With the aid of his faithful minions Quiph and Morg, he intends to conquer the famed Castle of Heaven... the supreme fortress built to protect the world from forces of darkness. The only way for Gardal to breach the castle gates is by sacrificing the pure, untainted soul of Erwyn, a young boy mentioned in a millennia-old prophecy. Gardal and his minions have already captured the boy and imprisoned him inside a dungeon to await execution. Yet Gardal didn't count on the help of Aira, Erwyn's clairvoyant sister. To save her brother, Aira has sealed Erwyn's soul within a single teardrop and transformed the teardrop into a protective orb. Now, in order to free her brother she must safely guide the orb into the Castle of Heaven using a magical beam of light. Unfortunately, sending the beam of light to Erwyn has used all of Aira's strength and she cannot control it any longer... Will you help her? [Ivolgamus]… Expand"}, {"name": "Divinity II: Ego Draconis", "details_link": "https://www.metacritic.com/game/xbox-360/divinity-ii-ego-draconis", "publisher": "cdv Software", "release_date": "Jan  6 2010", "developers": ["Larian Studios Games"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/173156789130a7150f8226135ca621a8-98.jpg", "descriptions": "Divinity II: Ego Draconis is a story-based role playing game that combines a truly stunning, free roaming world just waiting to be explored, with exhilarating aerial and ground based combat. Get up close and personal in human form - exploring dungeons, grabbing loot and putting the hurt onDivinity II: Ego Draconis is a story-based role playing game that combines a truly stunning, free roaming world just waiting to be explored, with exhilarating aerial and ground based combat. Get up close and personal in human form - exploring dungeons, grabbing loot and putting the hurt on the many evil denizens of Rivellon - or take to the skies by shape-shifting into a mighty Dragon to explore the mountain peaks and deliver fiery death from above! You will build your character from the ground up, and continue customizing as you gain experience. We want you to be able to define a unique Dragon Knight and create your own legend in the world of Divinity II. [DTP Entertainment]… Expand"}, {"name": "Oh My Godheads", "details_link": "https://www.metacritic.com/game/xbox-one/oh-my-godheads", "publisher": "Square Enix", "release_date": "Dec  5 2017", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Fighting", "Party / Minigame", "3D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/caadb759370d41061fe83978f6c012ea-98.jpg", "descriptions": null}, {"name": "Chronicles of Mystery: The Scorpio Ritual", "details_link": "https://www.metacritic.com/game/pc/chronicles-of-mystery-the-scorpio-ritual", "publisher": "City Interactive", "release_date": "Nov 14 2008", "developers": ["City Interactive", "Navarre Corp"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 62, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/ed5bb48080f4ea5c1b6aca25bf59a575-98.jpg", "descriptions": "Sylvie Leroux, a young archaeologist, learns about a dark secret dating back to biblical times. Not hesitating for a moment, she decides to solve the intriguing puzzle. The track leads to ancient ruins on Malta. [City Interactive]"}, {"name": "Go! Puzzle", "details_link": "https://www.metacritic.com/game/playstation-3/go!-puzzle", "publisher": "SCEA", "release_date": "Jun 14 2007", "developers": ["Zoonami Ltd."], "platforms": "PlayStation 3", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/ccaa7f430364425319956b700e19f230-98.jpg", "descriptions": "[Downloadable Game]  Go! Puzzle includes Swizzle Blocks, Aquatica and Skycraper - the ultimate test of speed, nerves and, wits all rolled into FUN! Swizzleblocks is a hectic and addicting puzzle game featuring four exhilarating gameplay modes. Aquatica is a nautical, fast-paced,[Downloadable Game]  Go! Puzzle includes Swizzle Blocks, Aquatica and Skycraper - the ultimate test of speed, nerves and, wits all rolled into FUN! Swizzleblocks is a hectic and addicting puzzle game featuring four exhilarating gameplay modes. Aquatica is a nautical, fast-paced, mind-twisting puzzle game in which a string of three mines fall into your submarine's playing field. And Skyscraper is the most extreme, fast-paced puzzle solving race to the top. If you think you can handle it, prove yourself by trying them all online and earning a place on the leader boards. Contains single, co-op and multiplayer challenges with various play modes and infinite levels.  Swizzleblocks features video chat, four exhilarating modes including Puzzle, Challenge, Time Attack, and Battle. Aquatica features three fast paced modes, 50 brain cracking puzzles, and online video chat. Skycraper features three mind-tickling modes, 7 cities, 5-7 towers each, 50 brain teasing puzzles, multiplayer on-line video chat and much, much more. [SCEA]… Expand"}, {"name": "Mr. Driller 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/mr-driller-2", "publisher": "Namco", "release_date": "Apr 10 2005", "developers": ["Namco"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/81a00c81a77678026ba0bf8f7cb5fa06-98.jpg", "descriptions": "Test your drill skills in Mr. Driller 2, a colorful puzzle game for the Game Boy Advance. In an effort to save the world from being buried under colored blocks, you must drill your way through a variety of intricate puzzles while avoiding enemies and obstacles. Based on the arcade version,Test your drill skills in Mr. Driller 2, a colorful puzzle game for the Game Boy Advance. In an effort to save the world from being buried under colored blocks, you must drill your way through a variety of intricate puzzles while avoiding enemies and obstacles. Based on the arcade version, the sequel to Mr. Driller features Mission Driller, Endless Driller, and Time Attack Driller modes, plus a two-player mode that lets you play against a friend via link cable. … Expand"}, {"name": "Namco Museum", "details_link": "https://www.metacritic.com/game/gamecube/namco-museum", "publisher": "Namco", "release_date": "Oct  9 2002", "developers": ["Mass Media"], "platforms": ["PlayStation 2", "Switch", "GameCube"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 62, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/91a07a7d56ce91a2ea5114e710c4c344-98.jpg", "descriptions": "All your favorite Namco classics are now in one package.  Namco Museum 1 includes Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, and Pole Position.  But the fun doesn't stop there, since Namco has added all new arrangement modes plus other hidden games.  Whether it's eating ghosts,All your favorite Namco classics are now in one package.  Namco Museum 1 includes Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, and Pole Position.  But the fun doesn't stop there, since Namco has added all new arrangement modes plus other hidden games.  Whether it's eating ghosts, shooting aliens, digging a hole, or racing toward the finish line, the addictive gameplay of Namco Museum has proven it can stand the test of time.… Expand"}, {"name": "Senran Kagura Burst", "details_link": "https://www.metacritic.com/game/3ds/senran-kagura-burst", "publisher": "XSEED Games", "release_date": "Nov 14 2013", "developers": ["Tamsoft"], "platforms": "3DS", "genres": ["Action", "Platformer", "Beat-'Em-Up", "2D", "2D"], "meta_score": 62, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/31892840ae64d9a631a4e3738da29557-98.jpg", "descriptions": "A little violent, a little sexy, and a ton of fun!\r Enter a world filled with beautiful ninja destined to break down the barriers between good and evil.\r\n\r\nPlay two different storylines, each with its own perspective. The girls of Hanz&#333; believe they fight on the side ofA little violent, a little sexy, and a ton of fun!\r Enter a world filled with beautiful ninja destined to break down the barriers between good and evil.\r Play two different storylines, each with its own perspective. The girls of Hanz&#333; believe they fight on the side of righteousness, but are their methods always right? The girls of Hebijo are mercenaries to the highest bidders, but what if their motives aren't as clear as they seem?\r -Crush your enemies with your favorite buxom ninja girl using fast punches, mid-air flight sequences, combos, super attacks, revealing cut-scenes and sexy Ninja Arts.\r-Dozens of costumes expose endless combinations!\r-Choose from 72 different costume sets such as school uniforms, swimsuits and ninja gear, along with hairstyles that can be changed, mixed and matched to provide an endless array of looks.… Expand"}, {"name": "Aerial Strike: The Yager Missions", "details_link": "https://www.metacritic.com/game/pc/aerial-strike-the-yager-missions", "publisher": "DreamCatcher Interactive", "release_date": "Feb  4 2005", "developers": ["Yager"], "platforms": "PC", "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/f496dd5269286324dbdf14ddbd038c42-98.jpg", "descriptions": "Despite all of the superior technological advancements of the future, security on Earth remains at risk. In Aerial Strike: The Yager Missions, players assume the role of Magnus Tide, pilot of one of the deadliest machines in the galaxy: the fighter ship Sagittarius. Taking control ofDespite all of the superior technological advancements of the future, security on Earth remains at risk. In Aerial Strike: The Yager Missions, players assume the role of Magnus Tide, pilot of one of the deadliest machines in the galaxy: the fighter ship Sagittarius. Taking control of Sagittarius’ multiple weapons and capabilities, players enter a world of extreme fighter pilot action, forcing futuristic rivals to pay the ultimate price in a daring quest to save the world. This radical action game offers intense aerial combat, combining dog fighting missions and ground attack objectives. Players will soar through 22 huge levels, adapting their strategies around multi-faceted terrains, including deep canyons and enormous mountains. They will maneuver a wide range of crafts, from agile fighters to huge battleships and carriers. Outside of the Sagittarius, players apply a more hands-on approach to fending off enemies when they get behind the controls of a gun turret. [DreamCatcher]… Expand"}, {"name": "Don't Forget Me", "details_link": "https://www.metacritic.com/game/pc/dont-forget-me", "publisher": "The Moon Pirates", "release_date": "Apr 20 2021", "developers": ["The Moon Pirates"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Point-and-Click"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/15c7e7c809de02c26b77096ea7c52f6e-98.jpg", "descriptions": "A jazz-punk adventure game with a twist, Don’t Forget Me is a new breed of puzzle game. Dive into the memories of your patients, use your own observations to unwrap their minds and uncover a dark conspiracy set to claim dominion over humanity."}, {"name": "Space Crew", "details_link": "https://www.metacritic.com/game/switch/space-crew", "publisher": "Curve Digital", "release_date": "Oct 15 2020", "developers": ["Runner Duck"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Space", "Combat"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/b99ceeabf3a59549d96fc691a60fe084-98.jpg", "descriptions": "Space Crew features the same gameplay loop as its predecessor with players controlling the actions of their crew moment-to-moment in the minutiae of navigation, scanning and combat. The new space setting allows much more player freedom and campaign unpredictability with much greater missionSpace Crew features the same gameplay loop as its predecessor with players controlling the actions of their crew moment-to-moment in the minutiae of navigation, scanning and combat. The new space setting allows much more player freedom and campaign unpredictability with much greater mission variety and deeper strategic gameplay. Players have to be more alert than ever when venturing through space and are challenged to protect their vulnerable crew from alien boardings, getting sucked out into space, running out of oxygen, system failures, ship fires and whatever else the campaign AI can throw at them from mission to mission. It is these moments of seeing your crew triumph over adversity time and time again, albeit with a few casualties along the way, which made the original Bomber Crew such a runaway hit and Runner Duck is aiming for similarly thrilling emergent storytelling in the sequel.… Expand"}, {"name": "Onee Chanbara ORIGIN", "details_link": "https://www.metacritic.com/game/pc/onee-chanbara-origin", "publisher": "D3Publisher", "release_date": "Oct 14 2020", "developers": ["Tamsoft"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 62, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/f8c1266c112994c0aa0f252306d12441-98.jpg", "descriptions": "In the year 20XX AD, Tokyo is nothing but a dystopic wasteland overrun by living corpses known as the Undead. Here we find two sisters who descend from a long line of expert swordsmen, yet were born to different mothers. The elder sister, Aya, was raised by her father, who subjected her toIn the year 20XX AD, Tokyo is nothing but a dystopic wasteland overrun by living corpses known as the Undead. Here we find two sisters who descend from a long line of expert swordsmen, yet were born to different mothers. The elder sister, Aya, was raised by her father, who subjected her to rigorous training in the way of the blade. Meanwhile, the younger sister, Saki, was raised by her mother, learning to despise her father for abandoning them and taking her sister away. When her father goes missing, Aya decides to put her skills with the sword to use as an Undead-hunter. Upon her beloved mother's murder, Saki becomes consumed to the point of insanity with a desperate thirst for revenge, resorting to manipulating the Undead to achieve her goal.Aya resolves to seek out her younger sister, her only surviving relation, while Saki is determined to resurrect her mother using an ancient art passed down through the ages. This art, however, requires the heart of a blood relative to work, meaning that the younger sister must kill the elder if she is to have her sworn vengeance. And so, amidst a swirling storm of love, hate, and intrigue, the battle between the two sisters begins.… Expand"}, {"name": "Rad Rodgers: Radical Edition", "details_link": "https://www.metacritic.com/game/switch/rad-rodgers-radical-edition", "publisher": "HandyGames", "release_date": "Feb 26 2019", "developers": ["Interceptor Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 62, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/1efae25285d759eaa5d6296412f001f7-98.jpg", "descriptions": "2 Player Couch Co-op - Play together with a friend! Enemies can prepare themselves for tough battles. Battle Mode - Tired of team play? Fight against your friends and show them who's boss."}, {"name": "Sparkle Unleashed", "details_link": "https://www.metacritic.com/game/xbox-one/sparkle-unleashed", "publisher": "10tons Ltd", "release_date": "Jun  3 2015", "developers": ["10tons Entertainment", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One"], "genres": ["Puzzle", "Matching"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/34fd43fc6d622d8de7cc7f787c183f03-98.jpg", "descriptions": "Experience the fabled Sparkle brand action puzzle like never before! Make your way through a secluded world of mystery, light magical braziers and discover a way to banish the darkness once and for all.\r Unlock potent powerups and use the ones you like the most to overcome Chained Orbs,Experience the fabled Sparkle brand action puzzle like never before! Make your way through a secluded world of mystery, light magical braziers and discover a way to banish the darkness once and for all.\r Unlock potent powerups and use the ones you like the most to overcome Chained Orbs, Rock Orbs, Survival levels and other exciting challenges. Can you carve a path of light through the darkness?\r Sparkle Unleashed introduces floating Orb Slinger gameplay never before seen in a Sparkle series game. The unleashed Orb Slinger floats along the bottom of the screen providing a fresh way to experience the beloved Sparkle gameplay.… Expand"}, {"name": "Tom Clancy's Ghost Recon: Breakpoint", "details_link": "https://www.metacritic.com/game/xbox-one/tom-clancys-ghost-recon-breakpoint", "publisher": "Ubisoft", "release_date": "Oct  1 2019", "developers": ["Ubisoft Paris"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 62, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/7/f41cbabedb3d3e84197924de5fe5486a-98.jpg", "descriptions": "Become an Elite Spec Ops Soldier. Explore the mysterious world, diverse abilities, new factions, and many ways to play Ghost Recon Breakpoint. Welcome to Auroa. Somewhere in the South Pacific lies the remote Auroa Archipelago, a vast land of diverse biomes that range from lush rainforests toBecome an Elite Spec Ops Soldier. Explore the mysterious world, diverse abilities, new factions, and many ways to play Ghost Recon Breakpoint. Welcome to Auroa. Somewhere in the South Pacific lies the remote Auroa Archipelago, a vast land of diverse biomes that range from lush rainforests to snowy peaks. Now, it’s home to Skell Technology, an enigmatic technology giant. Initially interested in a remote testing site for its autonomous drones, the Silicon Valley company eventually turned Auroa into its “World 2.0,” a high-tech, high-security utopia of sustainable eco-cities and robotics research. Explore a diverse and mysterious open world ranging from barren deserts and dramatic fjords to futurist cities and arctic peaks. Featuring 11 unique biomes and home to Skell Technologies this remote Archipelago will challenge the Ghosts like never before. Use the environment to your advantage as you disappear into a jungle canopy to evade your foes or jump into a vehicle and charge into battle by air, land and sea. A seamless co-op experience means your squadmates can jump in and out at any time. Face your deadliest enemy yet, The Wolves, former Ghosts who have betrayed their country. Led by the charismatic Colonel Cole D. Walker they have taken control of Auroa for an unknown purpose. Now in control of Auroa’s powerful drone technology The Wolves and their allies will hunt you mercilessly across Auroa. Experience life as a Ghost, an elite US Special Operations soldier, as you fight back from behind enemy lines on the toughest mission of your career. [Ubisoft]… Expand"}, {"name": "Ninjin: Clash of Carrots", "details_link": "https://www.metacritic.com/game/playstation-4/ninjin-clash-of-carrots", "publisher": "Pocket Trap", "release_date": "Sep  4 2018", "developers": ["Pocket Trap"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 62, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/a4c29725037e387557bb1acfd7b1c67d-98.jpg", "descriptions": "An anime-inspired beat-’em-up with a gaggle of varied enemies, deep customization…and ninjas! Play through side-scrolling worlds consisting of multiple stages and collect carrots stolen by the evil Shogun Moe."}, {"name": "Need for Speed ProStreet", "details_link": "https://www.metacritic.com/game/playstation-2/need-for-speed-prostreet", "publisher": "EA Games", "release_date": "Nov 13 2007", "developers": ["Black Box"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/7cc462aff3f586ddeeb39ed723b6b667-98.jpg", "descriptions": "Need for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting yourNeed for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting your skills and reputation against the very best street racers. Need for Speed ProStreet boasts impeccable precision and impressively detailed photo-realistic graphics, effectively transporting you to the center of the action. It pushes the Autosculpt technology to a new level, allowing you to directly impact your car's performance for the first time as well as personalize its appearance. Need for Speed ProStreet is a true taste of raw adrenaline and racing with consequences. Every dent, every scratch and every crumpled body panel is a battle scar, proof of your commitment and competitive mettle. With an aggressive and skilled AI system, you become immersed in an unmatched believable race experience. Add in a revolutionary online mode that will redefine the meaning of competitive social play, and Need for Speed ProStreet is the ultimate formula for an emotionally charged street racing showdown. [Electronic Arts]… Expand"}, {"name": "Kersploosh!", "details_link": "https://www.metacritic.com/game/3ds/kersploosh!", "publisher": "Nintendo", "release_date": "Mar  7 2013", "developers": ["Poisoft"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Miscellaneous", "General", "General"], "meta_score": 62, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/62093f6e784cdd7e5103acbf72698417-98.jpg", "descriptions": "(Also known as \"Splash or Crash\") Master a stone's flight to the bottom of the well! Be one with the stone from the toss to the splash. With a sharp mind and a deft touch on the Circle Pad, master the journey to the bottom of wells filled with obstacles. As you learn to maneuver each stone(Also known as \"Splash or Crash\") Master a stone's flight to the bottom of the well! Be one with the stone from the toss to the splash. With a sharp mind and a deft touch on the Circle Pad, master the journey to the bottom of wells filled with obstacles. As you learn to maneuver each stone in free fall and complete each level, you'll unlock more stones and wells. Embrace the challenges that lie ahead...for the flight is at hand.\r Each well is designed differently, with various hazards to impede your journey. Some wells have pizzas that break apart; others contain floating cookies that will sacrifice their delicious lives to stop you from getting to the bottom. Armed with a selection of stones, such as the beefy iron ball and the fragile gem, race as fast as possible to the bottom of each well. Then turn on the StreetPass feature and share your speedy conquests with others!\r… Expand"}, {"name": "The Station", "details_link": "https://www.metacritic.com/game/playstation-4/the-station", "publisher": "The Station", "release_date": "Feb 20 2018", "developers": ["The Station"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/917c3463f101c9c4e70e7e681b4c924a-98.jpg", "descriptions": "How would you react if a sentient alien civilization was discovered that challenged everything you knew about biology, chemistry, physics, and religion?"}, {"name": "Dead Island: Riptide", "details_link": "https://www.metacritic.com/game/playstation-3/dead-island-riptide", "publisher": "Deep Silver", "release_date": "Apr 23 2013", "developers": ["Techland"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/6f827fc06a99387d0e55b8b08552713c-98.jpg", "descriptions": "They thought they had escaped the terrors of Banoi and survived the apocalypse on a corrupted paradise. Then their fate took a terrible turn. The Dead Island heroes escaped in a helicopter to the safety of a military ship, but when a powerful storm hits and the virus suddenly spreads amongThey thought they had escaped the terrors of Banoi and survived the apocalypse on a corrupted paradise. Then their fate took a terrible turn. The Dead Island heroes escaped in a helicopter to the safety of a military ship, but when a powerful storm hits and the virus suddenly spreads among the crew, the nightmare returns, leaving hope waning in the rising tides.… Expand"}, {"name": "New Zealand Story Revolution", "details_link": "https://www.metacritic.com/game/ds/new-zealand-story-revolution", "publisher": "Ignition Entertainment", "release_date": "Feb 13 2008", "developers": ["Marvelous Entertainment"], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f01d2ed96251c608fc82d1d0379deddf-98.jpg", "descriptions": "New Zealand Story Revolution recreates the look and feel of the classic 1988 8-bit game on a 21st century handheld.  Whilst simply enhancing the original's gameplay, New Zealand Story Revolution gives the player an old classic on a new platform without compromising the game’s original appealNew Zealand Story Revolution recreates the look and feel of the classic 1988 8-bit game on a 21st century handheld.  Whilst simply enhancing the original's gameplay, New Zealand Story Revolution gives the player an old classic on a new platform without compromising the game’s original appeal and eccentricity. Features: The return of one of videogaming's cutest cult characters - Tiki the Kiwi; Entirely faithful to the originals - all levels, enemies, items and secrets remain intact; A host of new touchscreen-based mini-games to play in both single player and against friends in multiplayer; New gameplay features are a New Zealand Story fan's wish-list - you'll wonder why they weren't in the original; Digitally remastered  - Brighter, more colourful graphics, parallax scrolling, redrawn sprites and new animations; Normal and Expert Modes – Clear the Normal Mode to unlock Expert Mode; New music and sounds effects – new tunes based on the classic game. [Rising Star Games]… Expand"}, {"name": "Conflict: Global Terror", "details_link": "https://www.metacritic.com/game/playstation-2/conflict-global-terror", "publisher": "2K Games", "release_date": "Oct  4 2005", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 62, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/8369d620dfbc2109161e2190608af8aa-98.jpg", "descriptions": "(Also know as \"Conflict: Global Storm\") Bradley, Jones, Connors and Foley. The original heroes of \"Conflict: Desert Storm\" are back, this time having undergone intense training in counter-terrorism and counter-insurgency techniques, all added to their wealth of extensive battlefield and(Also know as \"Conflict: Global Storm\") Bradley, Jones, Connors and Foley. The original heroes of \"Conflict: Desert Storm\" are back, this time having undergone intense training in counter-terrorism and counter-insurgency techniques, all added to their wealth of extensive battlefield and special ops experience. In ensuring the safety of the team Foley goes MIA and the team must enlist the help of sniper Carrie Sherman. As the missions become more deadly and the team start to uncover more of March 33’s plans, its clear they face the greatest challenge of their careers to date. [SCi Games]… Expand"}, {"name": "Dragon's Lair 3D", "details_link": "https://www.metacritic.com/game/xbox/dragons-lair-3d", "publisher": "Ubisoft", "release_date": "Nov 18 2002", "developers": ["Dragonstone"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/c507bd754410f3d0ce3ae6d293c5acba-98.jpg", "descriptions": "Princess Daphne has been kidnapped by the evil dragon, Singe, and hidden in a medieval castle owned my Mordroc, a powerful and malevolent wizard. To save her, you will take on the role of Dirk the Daring, a goofy but courageous knight. As he advances through the castle with the help of aPrincess Daphne has been kidnapped by the evil dragon, Singe, and hidden in a medieval castle owned my Mordroc, a powerful and malevolent wizard. To save her, you will take on the role of Dirk the Daring, a goofy but courageous knight. As he advances through the castle with the help of a magical amulet, Dirk must overcome a slew of challenges, from jumping over flaming pits and climbing ropes to flying across chasms and battling swarms of the wizard's minions. Use quick reflexes, cunning, and resourcefulness to fight your way through the castle to find Daphne and save the kingdom from Mordroc's clutches.… Expand"}, {"name": "MicroBot", "details_link": "https://www.metacritic.com/game/playstation-3/microbot", "publisher": "Electronic Arts", "release_date": "Jan  4 2011", "developers": ["Naked Sky Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Top-Down"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/5e07449ecdc1b07b82c2a7e8f400b15b-98.jpg", "descriptions": "Microbot is a an arcade shooter for Xbox Live Arcade and the PlayStation Network."}, {"name": "Heatseeker", "details_link": "https://www.metacritic.com/game/wii/heatseeker", "publisher": "Codemasters", "release_date": "May  1 2007", "developers": ["IR Gurus"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/93063f111d475d9d6e3be80a88e92340-98.jpg", "descriptions": "(Coming to the US market on May 1)  Designed to be an incredible lock-on/shake-off experience, Heatseeker reinvents missile combat to give gamers a massive rush of destruction. Featuring collection of current and near-future military fighter jets, Heatseeker's arsenal includes the stealthy(Coming to the US market on May 1)  Designed to be an incredible lock-on/shake-off experience, Heatseeker reinvents missile combat to give gamers a massive rush of destruction. Featuring collection of current and near-future military fighter jets, Heatseeker's arsenal includes the stealthy F-22 Raptor, the classic F-15 Eagle, the cutting-edge F35 Lightening II, and the aerodynamically advanced Russian SU-47 Berkut. Heatseeker straps players into the pilot's seat and deliver a white-knuckle ride that'll have them clutching the joypad as they engage in face-melting 6G turns and fight against a seemingly-impossible amount of airborne enemies. And when gamers launch a strike, they follow their missiles as they ruthlessly hone in on their targets via the Impact Cam. Delivering cinematic 3rd-person camera cutaway scenes, the Impact Cam reveals the results of attacks in all their devastating glory from all kinds of dynamic angles, complete with jaw-dropping explosions and smoke trails. With missions across the U.S., down to the Caribbean, across Antarctica and into the Far East, it's high-velocity combat all the way that'll see players constantly switching from predator to prey as an enemy missiles lock on. [Codemasters]… Expand"}, {"name": "Cloudy With a Chance of Meatballs", "details_link": "https://www.metacritic.com/game/xbox-360/cloudy-with-a-chance-of-meatballs", "publisher": "Ubisoft", "release_date": "Sep 18 2009", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Adventure", "Modern", "General", "General", "Modern"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/ac1454076a54eafae2c51872bd25c62e-98.jpg", "descriptions": "Play as Flint, the wacky inventor who creates a machine that causes food to rain from the sky! When the machine spirals out of control, it's up to you to save the town with a variety of outrageously fun and wacky gadgets. Hurl hamburgers, sling spaghetti, and join the most hilarious foodPlay as Flint, the wacky inventor who creates a machine that causes food to rain from the sky! When the machine spirals out of control, it's up to you to save the town with a variety of outrageously fun and wacky gadgets. Hurl hamburgers, sling spaghetti, and join the most hilarious food fight ever. Explore 20 levels and environments from the movie and beyond, from Jello-Land to Ice Cream Falls. [Ubisoft]… Expand"}, {"name": "NEOVERSE: Trinity Edition", "details_link": "https://www.metacritic.com/game/switch/neoverse-trinity-edition", "publisher": "Undefined", "release_date": "Jan 21 2021", "developers": ["Tino Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/3e61fea7bf02243e28517cbe5b3739a0-98.jpg", "descriptions": "Card actions, Don't lose your tension!Build a deck that suits your needs!Lady Luck Smiles to the smartest deck. NEOVERSE is a time warping multiverse game consisting of thrilling adventures that are packed with great and exciting challenges; combining roguelite, deck building, strategyCard actions, Don't lose your tension!Build a deck that suits your needs!Lady Luck Smiles to the smartest deck. NEOVERSE is a time warping multiverse game consisting of thrilling adventures that are packed with great and exciting challenges; combining roguelite, deck building, strategy gameplay all in one. It puts your skills to the test. Set off on an adventure with unique heroes to save the living realms regardless of time and space.… Expand"}, {"name": "Galak-Z: Variant S", "details_link": "https://www.metacritic.com/game/switch/galak-z-variant-s", "publisher": "GungHo", "release_date": "Jul 12 2018", "developers": ["GungHo", "17-Bit"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 62, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/54c4a4b3127c35a310d3129ff4a8e924-98.jpg", "descriptions": null}, {"name": "Minecraft: New Nintendo 3DS Edition", "details_link": "https://www.metacritic.com/game/3ds/minecraft-new-nintendo-3ds-edition", "publisher": "Mojang AB", "release_date": "Sep 13 2017", "developers": ["Notch"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/e3325125ba671ab96765575a3016be77-98.jpg", "descriptions": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes."}, {"name": "Here They Lie", "details_link": "https://www.metacritic.com/game/playstation-4/here-they-lie", "publisher": "Sony Interactive Entertainment", "release_date": "Oct 13 2016", "developers": ["The Tangentlemen"], "platforms": "PlayStation 4", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 62, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/8356418ec6950087da04e425ba22fd9f-98.jpg", "descriptions": "Here They Lie is a psychological horror experience that injects you into a frightening, surreal world riddled with strange and malevolent creatures. Horrors lurk around every corner, just out of sight, haunting and infecting your mind. Dare yourself to go deeper down the rabbit hole andHere They Lie is a psychological horror experience that injects you into a frightening, surreal world riddled with strange and malevolent creatures. Horrors lurk around every corner, just out of sight, haunting and infecting your mind. Dare yourself to go deeper down the rabbit hole and confront the meaning of your existence. The game focuses on narrative, and the experience of dread. [Tangentlemen]… Expand"}, {"name": "The Good Life", "details_link": "https://www.metacritic.com/game/pc/the-good-life", "publisher": "Playism", "release_date": "Oct 15 2021", "developers": ["White Owls"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Role-Playing", "General"], "meta_score": 62, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/6e8bc097316452a8136917cd8d9975de-98.jpg", "descriptions": "Play as Naomi, a journalist from New York who moves to a backwoods British town called Rainy Woods in order to pay off her massive debt.The only way for her to escape from debt hell is to take pictures of happenings in the town and report on them. Of course, 'the happiest town in thePlay as Naomi, a journalist from New York who moves to a backwoods British town called Rainy Woods in order to pay off her massive debt.The only way for her to escape from debt hell is to take pictures of happenings in the town and report on them. Of course, 'the happiest town in the world' is not your average town... The inhabitants of the happiest town in the world are some of the most bizarre people you'll ever come across. You'll live alongside them as you solve mysteries and experience a hearty helping of craziness. We're sure that you'll eventually come to love all the mystery, horror, and good old charm that this town has to offer.… Expand"}, {"name": "BlackSite: Area 51", "details_link": "https://www.metacritic.com/game/xbox-360/blacksite-area-51", "publisher": "Midway", "release_date": "Nov 12 2007", "developers": ["Midway Studios - Austin"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 62, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/85aa543a684d3db811f239e9c1e3b4ae-98.jpg", "descriptions": "Featuring a powerful single-player campaign, along with multiple online multiplayer modes,\rBlackSite: Area 51 delivers vicious combat action, next generation graphics and A.I., and a plethora of powerful weapons and vehicles.  Set in present day, players take the role of a decoratedFeaturing a powerful single-player campaign, along with multiple online multiplayer modes,\rBlackSite: Area 51 delivers vicious combat action, next generation graphics and A.I., and a plethora of powerful weapons and vehicles.  Set in present day, players take the role of a decorated military veteran charged by the government to lead a squadron of \"secret soldiers,\" each with his/her own specialty skill set, into the Rachel, Nevada area to fight off the invasion of unidentified enemy races. The player’s modern-day emotions and fears are driven into a world charged with grave responsibility affecting lives hanging in the balance and eventually finding himself torn between his professional orders and his own ethical standards.  In the end, only the actions of the player and his squad can shape the outcome of BlackSite: Area 51 during this potentially pivotal moment in history. [Midway]… Expand"}, {"name": "Escape From Paradise City", "details_link": "https://www.metacritic.com/game/pc/escape-from-paradise-city", "publisher": "cdv Software", "release_date": "Oct 26 2007", "developers": ["Sirius Games"], "platforms": "PC", "num_players": "8  Online", "genres": ["Role-Playing", "General", "General"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/a0f9c556a3111cd4fe936493f6c15288-98.jpg", "descriptions": "Escape From Paradise City is a blended action-RPG and strategy game for the PC that asks the player to infiltrate a gang-infested city on the Eastern seaboard in order to root out rampant corruption and violence. In a dystopian world that combines a dark underworld and elements of theEscape From Paradise City is a blended action-RPG and strategy game for the PC that asks the player to infiltrate a gang-infested city on the Eastern seaboard in order to root out rampant corruption and violence. In a dystopian world that combines a dark underworld and elements of the fantastic, the player is required to infiltrate the gangs of Paradise City on behalf of a powerful government agency that, despite its influence, has been unable to introduce even a glimmer of law and order to this horribly corrupt city. In an intertwining chapter-driven story, the player takes turns controlling one of three gritty characters that, for their own reason, have \"volunteered\" to get to the bottom of the mystery behind the controlling crime syndicate's power. The player's characters becomes more powerful as they claw their way up the echelons of the underworld and as their individual stories begin to overlap. As the player's influence on the city grows, the businesses, the payoffs and the number of confrontations with rival gangs enables the player to gain experience and become powerful enough to take control of the city piece by piece. After becoming a underworld force to be reckoned with, the player discovers that the gang wars have been masterminded by a secret society, at the head of which are a coterie of terrifyingly dangerous and powerful figures that, it seems, no bullet will stop. [CDV Software]… Expand"}, {"name": "Heroes Over Europe", "details_link": "https://www.metacritic.com/game/xbox-360/heroes-over-europe", "publisher": "Ubisoft", "release_date": "Sep 15 2009", "developers": ["Transmission Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 62, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/25e50ca6333a95f8ed57f94f00173974-98.jpg", "descriptions": "Developed by Transmission Games in Melbourne, Australia, and powered by an all-new engine, Heroes Over Europe promises to raise the bar for flight combat games with the all new \"Ace Kill\" close combat action, four online modes supporting up to 16 players and fully customizable aircrafts withDeveloped by Transmission Games in Melbourne, Australia, and powered by an all-new engine, Heroes Over Europe promises to raise the bar for flight combat games with the all new \"Ace Kill\" close combat action, four online modes supporting up to 16 players and fully customizable aircrafts with localized damage. Visually, the game takes no prisoners with meticulously rendered environments including faithful recreations of London, Berlin and the French Alps, and ultra-realistic iconic warplanes of the era, all presented in stunning high definition graphics. [Ubisoft]… Expand"}, {"name": "FlatOut 4: Total Insanity", "details_link": "https://www.metacritic.com/game/playstation-4/flatout-4-total-insanity", "publisher": "Strategy First", "release_date": "Mar 17 2017", "developers": ["Strategy First", "Kylotonn"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 62, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/53b69fa53dfb2ac1400d000c5e6e6fb3-98.jpg", "descriptions": "Flatout 4: Total Insanity elevates the level of hard hitting, fast paced action in the demolition derby style racing genre. The game offers bigger, louder, better and more outrageous stunts and collisions. Also, fans of the genre can still enjoy some of the popular classic stunts too, asFlatout 4: Total Insanity elevates the level of hard hitting, fast paced action in the demolition derby style racing genre. The game offers bigger, louder, better and more outrageous stunts and collisions. Also, fans of the genre can still enjoy some of the popular classic stunts too, as FlatOut 4: Total Insanity offers something for FlatOut fans both new and familiar. … Expand"}, {"name": "Marvel Avengers: Battle for Earth", "details_link": "https://www.metacritic.com/game/xbox-360/marvel-avengers-battle-for-earth", "publisher": "Ubisoft", "release_date": "Oct 30 2012", "developers": ["Ubisoft Quebec"], "platforms": ["Wii U", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General", "Fighting", "3D"], "meta_score": 62, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/eb998814d4c048291ce2d3b6a7ef96ba-98.jpg", "descriptions": "Marvel Avengers: Battle for Earth is a game inspired by iconic Marvel comic artwork and the Secret Invasion storyline."}, {"name": "Metal Torrent", "details_link": "https://www.metacritic.com/game/ds/metal-torrent", "publisher": "Nintendo", "release_date": "May 24 2010", "developers": ["Arika"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 62, "users_score": 9.6, "image": "https://static.metacritic.com/images/products/games/1/2ecf7826bf58aae2df9fe54208645138-98.jpg", "descriptions": "[DSiWare]  Prepare for a high level of intensity as you pilot a solo ship deep into enemy space in this vertically scrolling shooter. Battle wave after wave of relentless attackers aiming to do one thing - destroy you! Your goal, beyond mere survival, is simple: Get the highest score[DSiWare]  Prepare for a high level of intensity as you pilot a solo ship deep into enemy space in this vertically scrolling shooter. Battle wave after wave of relentless attackers aiming to do one thing - destroy you! Your goal, beyond mere survival, is simple: Get the highest score possible and earn bragging rights in online leaderboards. Two powerful fighters are at your disposal: the Accipiter and Bateleur, tailored for beginner or expert players. Progress through eight phases of action and take out enemies by tactically using your weapons: an unlimited-fire blaster weapon available to both ships and an energy-consuming special weapon unique to each craft. Absorb energy cubes from destroyed enemies to replenish your energy gauge and increase your score. Collect a series of consecutive cubes to create a chain and boost your score even higher. Choose from pattern or random modes to vary the level of challenge, but the real indication of skill comes from competing with players around the world for the highest score possible. Use Nintendo Wi-Fi Connection to upload your score to the online leaderboards to see where you stack up or even view replays of top-ranking players' games and study their secrets. Do you have what it takes to be the best?… Expand"}]