[{"name": "Tokyo Xtreme Racer Zero", "details_link": "https://www.metacritic.com/game/playstation-2/tokyo-xtreme-racer-zero", "publisher": "Crave", "release_date": "May 28 2001", "developers": ["Genki"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 76, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/7aff54da6fe3489012343102db56c578-98.jpg", "descriptions": "Dip into the illegal underground racing experience on the Tokyo highways once again, flash your headlights at other cars to challenge them to races, and compete for money to upgrade your ride.  \"Zero,\" the latest game in the TXR series, adds more cars, more rival racers, and a larger streetDip into the illegal underground racing experience on the Tokyo highways once again, flash your headlights at other cars to challenge them to races, and compete for money to upgrade your ride.  \"Zero,\" the latest game in the TXR series, adds more cars, more rival racers, and a larger street course which replicates 100 miles of actual Tokyo highways.… Expand"}, {"name": "Sega Smash Pack Volume 1", "details_link": "https://www.metacritic.com/game/dreamcast/sega-smash-pack-volume-1", "publisher": "Sega", "release_date": "Jan 31 2001", "developers": ["Sega"], "platforms": "Dreamcast", "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Every single one of the ports is incredibly poor, resulting in nothing but disappointment for anyone looking to replay any of these classic games."}, {"name": "Mega Man Legends 2", "details_link": "https://www.metacritic.com/game/playstation/mega-man-legends-2", "publisher": "Capcom", "release_date": "Oct 24 2000", "developers": ["Capcom"], "platforms": ["PC", "PlayStation"], "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/30d63ab1d8d49660edd48d23fc2f18bf-98.jpg", "descriptions": "Mega Man, Roll and all your favourites are back in an entirely new 3-D adventure. Far away, in an isolated wasteland, a mysterious girl and an infamous treasure have been discovered. It's the legendary \"Sealed Key\", rumoured to unlock an even greater mystery known as the GreatMega Man, Roll and all your favourites are back in an entirely new 3-D adventure. Far away, in an isolated wasteland, a mysterious girl and an infamous treasure have been discovered. It's the legendary \"Sealed Key\", rumoured to unlock an even greater mystery known as the Great Legacy. What power does the Great Legacy hold? Now, a race unfolds as Mega Man and his friends embark on a journey which will alter their destinies forever. \r … Expand"}, {"name": "Spider-Man: Shattered Dimensions", "details_link": "https://www.metacritic.com/game/xbox-360/spider-man-shattered-dimensions", "publisher": "Activision", "release_date": "Sep  7 2010", "developers": ["Beenox"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "General", "Beat-'Em-Up", "Linear", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/45e23308d9d895b1d551553bc0f36914-98.jpg", "descriptions": "Swing your way into action to help restore reality with your friendly neighborhood Spiderman."}, {"name": "WWE Day of Reckoning 2", "details_link": "https://www.metacritic.com/game/gamecube/wwe-day-of-reckoning-2", "publisher": "THQ", "release_date": "Aug 29 2005", "developers": ["Yuke's"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 76, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/b262a871549e6d10455e52d1307fbb2c-98.jpg", "descriptions": "In the sequel to WWE Day of Reckoning, you must fight your way back to the top of the wrestling ladder. WWE Day of Reckoning 2 features new legendary fighters, a new story mode, and more."}, {"name": "We Are OFK", "details_link": "https://www.metacritic.com/game/playstation-5/we-are-ofk", "publisher": "Team OFK", "release_date": "Aug 18 2022", "developers": ["Team OFK"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/4/737b0016636c17fa78df2ec98b216032-98.jpg", "descriptions": "Itsumi Saito just moved Downtown and broke up with her long-term girlfriend, leaning into her dream of making it in music. But juggling practice, friends, a brutal commute to the west side, and a full-time job... Itsu is struggling to establish herself in the cutthroat music scene of LA.Itsumi Saito just moved Downtown and broke up with her long-term girlfriend, leaning into her dream of making it in music. But juggling practice, friends, a brutal commute to the west side, and a full-time job... Itsu is struggling to establish herself in the cutthroat music scene of LA. When she talks her way into a shmoozy Hollywood party and makes friends with a rising music producer, she sees a chance to bring her dreams a little closer.We Are OFK is an interactive narrative series of arguing over lyrics, sending sad texts, and playing Interactive Music Videos, including OFK's debut single \"Follow/Unfollow\" and more!… Expand"}, {"name": "Journey to the Savage Planet", "details_link": "https://www.metacritic.com/game/xbox-one/journey-to-the-savage-planet", "publisher": "505 Games", "release_date": "Jan 28 2020", "developers": ["Typhoon Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/60064553ec221aad28c3981603fed1d2-98.jpg", "descriptions": "In this colorful, co-op adventure game you play as the newest recruit to Kindred Aerospace. Dropped onto an uncharted planet with little equipment, you must determine if this planet is fit for human habitation but perhaps you are not the first to set foot here…"}, {"name": "Pikuniku", "details_link": "https://www.metacritic.com/game/switch/pikuniku", "publisher": "Devolver Digital", "release_date": "Jan 24 2019", "developers": ["Sectordub", "22nd Century Toys"], "platforms": ["PC", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/f2047c15f476ef186ef5115905bc6d61-98.jpg", "descriptions": "Pikuniku is a puzzle-exploration game that takes place in a strange but playful world where not everything is as happy as it seems. Help peculiar characters overcome struggles, uncover a deep state conspiracy, and start a fun little revolution in this delightful dystopian adventure."}, {"name": "Disney DuckTales: Remastered", "details_link": "https://www.metacritic.com/game/wii-u/disney-ducktales-remastered", "publisher": "Capcom", "release_date": "Aug 13 2013", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/00d5ffa061ddd94062738961ccfea3bd-98.jpg", "descriptions": "DuckTales Remastered has seen the development team take the levels and layout from the original 1989 release as a foundation before expanding upon them to significantly enhance the gameplay experience but where this update truly impresses is its graphics and sound. All of the visuals fromDuckTales Remastered has seen the development team take the levels and layout from the original 1989 release as a foundation before expanding upon them to significantly enhance the gameplay experience but where this update truly impresses is its graphics and sound. All of the visuals from the 8-bit game have been beautifully re-created as hand-drawn and animated sprites, across a backdrop of luscious, re-envisioned level backgrounds. Furthermore, original Disney Character Voices talent, including some from the cartoon TV series, bring in-game characters to life with charm and wit, while the classic melodies of the original soundtrack are given a modern twist.… Expand"}, {"name": "Surviving Mars", "details_link": "https://www.metacritic.com/game/pc/surviving-mars", "publisher": "Paradox Interactive", "release_date": "Mar 15 2018", "developers": ["Haemimont Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/625e2495116eb993c55ad87405465838-98.jpg", "descriptions": "Surviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock moreSurviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock more elaborate ways to shape and expand your settlement. Cultivate your own food, mine minerals or just relax by the bar after a hard day's work. Most important of all, though, is keeping your colonists alive. Not an easy task on a strange new planet.\r There will be challenges to overcome. Execute your strategy and improve your colony's chances of survival while unlocking the mysteries of this alien world. Are you ready? Mars is waiting for you.… Expand"}, {"name": "Undertow", "details_link": "https://www.metacritic.com/game/xbox-360/undertow", "publisher": "Chair Entertainment", "release_date": "Nov 21 2007", "developers": ["Chair Entertainment"], "platforms": "Xbox 360", "num_players": "16  Online", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/52e4f78bdc7a374b78e40d77f8dd96e1-98.jpg", "descriptions": "[Xbox Live Arcade]  Undertow features a 15 level campaign for single-player or co-op and two robust multiplayer modes for up to 16 players. While many of the maps have level-specific goals, the core gameplay of Undertow centers on this maxim: Kill as many enemies as you can – and stay alive[Xbox Live Arcade]  Undertow features a 15 level campaign for single-player or co-op and two robust multiplayer modes for up to 16 players. While many of the maps have level-specific goals, the core gameplay of Undertow centers on this maxim: Kill as many enemies as you can – and stay alive for as long as possible! Players select their race (Iron Marine, Nemoidian, or Atlantian) and unit type and are then launched into battle. Each of the three races features four unique, upgradeable unit types ranging in ability from the fast and agile to the large and powerful. Players have the ability to unlock and purchase unit upgrades as they acquire points. Each unit type has three levels of permanent upgrades. Through conquest-style battles, players obtain points by killing enemies, accomplishing team goals, and taking check points. Points and a variety of power-ups can be used to further upgrade unit abilities. [Chair Entertainment]… Expand"}, {"name": "Band Hero", "details_link": "https://www.metacritic.com/game/playstation-3/band-hero", "publisher": "Activision", "release_date": "Nov  3 2009", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/5c3f068b6cff94c6a4a3f29be89bd685-98.jpg", "descriptions": "Family and friends come together to ascend the virtual stage and rock their way to superstardom with Band Hero, which features the hottest chart-topping hits from everyone's favorite acts including No Doubt, Lily Allen, The All-American Rejects, Snow Patrol and The Jackson 5. Headlined byFamily and friends come together to ascend the virtual stage and rock their way to superstardom with Band Hero, which features the hottest chart-topping hits from everyone's favorite acts including No Doubt, Lily Allen, The All-American Rejects, Snow Patrol and The Jackson 5. Headlined by some of the biggest names in music as in-game artists and playable characters, Band Hero is the ultimate party game where players of all ages can create the band they have always dreamed of by using any combination of guitar or drum controllers and vocals, providing rockers and performers of all ages the chance to experience and interact with their favorite music. [Activision]… Expand"}, {"name": "Game of Thrones: Episode Two - The Lost Lords", "details_link": "https://www.metacritic.com/game/xbox-one/game-of-thrones-episode-two---the-lost-lords", "publisher": "Telltale Games", "release_date": "Feb  4 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/b0dc9c55fa6b8589b5abc398fd3d36e3-98.jpg", "descriptions": "The Lost Lords is the second of six installments in the Game of Thrones: A Telltale Games Series."}, {"name": "Disney/Pixar Toy Story 3", "details_link": "https://www.metacritic.com/game/wii/disneypixar-toy-story-3", "publisher": "Disney Interactive Studios", "release_date": "Jun 15 2010", "developers": ["Avalanche Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "Xbox 360", "Wii"], "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/9314181149a6e1ebf4a22ce81f4777e5-98.jpg", "descriptions": "Unleash your imagination in this new open world and play with Andy's toys your way. As Buzz, Woody, or Jessie, you choose what activities you want to do and the order you wish to do them. The more you use your imagination and create your own story, the more you get rewarded. [Disney Interactive]"}, {"name": "Carrion", "details_link": "https://www.metacritic.com/game/xbox-one/carrion", "publisher": "Devolver Digital", "release_date": "Jul 23 2020", "developers": ["Phobia Game Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/808457c5b69fe347f7e109144e89b089-98.jpg", "descriptions": "In Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities onIn Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities on the path to retribution that include a web-like ranged attack, the ability to bend light to become temporarily invisible, and even possess humans for maximum terror.… Expand"}, {"name": "Streets of Rage 2", "details_link": "https://www.metacritic.com/game/xbox-360/streets-of-rage-2", "publisher": "Sega", "release_date": "Aug 29 2007", "developers": ["Sega"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/813cca6d0abf470267b24a3dfcb3c14a-98.jpg", "descriptions": "[Xbox Live Arcade]  The classic arcade fighting game Streets of Rage 2 comes to XBLA. Play as Blaze, Skate, Max, or Axel as you attempt to save Adam from the evil clutches of Dr. X. Special fighting moves for characters and unique weapons add to the excitement as you fight your way to the[Xbox Live Arcade]  The classic arcade fighting game Streets of Rage 2 comes to XBLA. Play as Blaze, Skate, Max, or Axel as you attempt to save Adam from the evil clutches of Dr. X. Special fighting moves for characters and unique weapons add to the excitement as you fight your way to the Syndicate's stronghold. Classic arcade fighting action: Each character has special abilities. Learn to use their moves to defeat the enemies and the bosses. Unique weapons: Katanas, shuriken, knives, and more are available for the player. Weapons can even be thrown for ranged damage. Stellar soundtrack: The music for the arcade version of Streets of Rage 2 by Yuzo Koshiro is widely considered as some of the finest music ever made for an arcade game. All new achievements to master and improve your Gamerscore. [Microsoft]… Expand"}, {"name": "Kung Fu Panda", "details_link": "https://www.metacritic.com/game/playstation-3/kung-fu-panda", "publisher": "Activision", "release_date": "Jun  3 2008", "developers": ["Luxoflux", "Inc."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/eb5c4e6bcf7b1ad5c63891c6a3ff29b7-98.jpg", "descriptions": "In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13 legendary levels from the movie and beyond, and spanning land, water and air, players must work their way to become the Dragon Warrior and defeat the ultimate enemy, Tai Lung, as they battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles. Featuring a deep variety of gameplay, unique co-op and competitive multiplayer modes, collectibles, and a host of character upgrades, the Kung Fu Panda video game provides an experience gamers of all ages will enjoy. [Activision]… Expand"}, {"name": "Hindsight", "details_link": "https://www.metacritic.com/game/pc/hindsight", "publisher": "Annapurna Interactive", "release_date": "Aug  4 2022", "developers": ["Joel Mcdonald"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/1dc2ada7278f8036612d9a33a0dd0b16-98.jpg", "descriptions": "What if the physical objects of everyday life, the possessions we hold close, were actual windows to the past? Peer into distant memories and unseen futures in Hindsight."}, {"name": "The Caligula Effect 2", "details_link": "https://www.metacritic.com/game/switch/the-caligula-effect-2", "publisher": "NIS America", "release_date": "Oct 19 2021", "developers": ["historia Inc"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/3ab5e980847d7e84016aabdb9e3b2be7-98.jpg", "descriptions": "Dive into a reality-warping adventure from Persona scenario-writer Tadashi Satomi and director Takuya Yamanaka!A virtuadoll named Regret has created the world of Redo in order to save people from their past regrets by unknowingly imprisoning them in a simulation. However, this \"Paradise\"Dive into a reality-warping adventure from Persona scenario-writer Tadashi Satomi and director Takuya Yamanaka!A virtuadoll named Regret has created the world of Redo in order to save people from their past regrets by unknowingly imprisoning them in a simulation. However, this \"Paradise\" is shaken to the core when a virtual idol named X breaks into Regret's virtual reality and restores a high school student's memories of the real world. In order to escape Redo, they form the Go-Home Club, a resistance group that seeks to fight against regret and her enforcers, the Obbligato Musicians.… Expand"}, {"name": "Borderlands: Game of the Year Edition", "details_link": "https://www.metacritic.com/game/playstation-4/borderlands-game-of-the-year-edition", "publisher": "2K Games", "release_date": "Apr  3 2019", "developers": ["Take-Two Interactive"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Arcade"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/d1f4dcc29c0fb805474af49c077e667a-98.jpg", "descriptions": "Lock, Load, & Face the Madness! Get ready for the mind-blowing insanity, as one of four trigger-happy mercenaries, taking out everything that stands in your way. With its addictive action, frantic first person shooter combat, massive arsenal of weaponry, RPG elements and four-player co-op,Lock, Load, & Face the Madness! Get ready for the mind-blowing insanity, as one of four trigger-happy mercenaries, taking out everything that stands in your way. With its addictive action, frantic first person shooter combat, massive arsenal of weaponry, RPG elements and four-player co-op, Borderlands is the breakthrough experience that challenges all the conventions of modern shooters. Borderlands places you in the role of a mercenary on the lawless and desolate planet of Pandora, hell bent on finding a legendary stockpile of powerful alien technology known as The Vault.… Expand"}, {"name": "Chariot", "details_link": "https://www.metacritic.com/game/wii-u/chariot", "publisher": "Frima Studio", "release_date": "Jan  8 2015", "developers": ["Frima Studio"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/495e74d333e1eefb1af7dbd5b0703e8a-98.jpg", "descriptions": "Chariot is a funny physics-based couch co-op platformer in which a brave princess and her suitor carry a funeral wagon through ancient caves,  fending-off swarms of looters while amassing riches, to bury the King's remains in a worthy gold-filled tomb."}, {"name": "WarioWare, Inc.: Mega Party Game$!", "details_link": "https://www.metacritic.com/game/gamecube/warioware-inc-mega-party-game!", "publisher": "Nintendo", "release_date": "Apr  6 2004", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/8fb4d1b869ae8c9832399f6a1a8a0e67-98.jpg", "descriptions": "Wario is back in the video game biz, and this time the tightfisted microgame master is servin' up some insane party games on Nintendo GameCube. The 200+ hysterical microgames from Wario Ware, Inc.: Mega Microgame$ are making a triumphant return on the big screen, supported by wildly creativeWario is back in the video game biz, and this time the tightfisted microgame master is servin' up some insane party games on Nintendo GameCube. The 200+ hysterical microgames from Wario Ware, Inc.: Mega Microgame$ are making a triumphant return on the big screen, supported by wildly creative multiplayer matches starring Wario's crazy crew of video game developers.… Expand"}, {"name": "Resident Evil 4 (2005)", "details_link": "https://www.metacritic.com/game/pc/resident-evil-4-2005", "publisher": "Ubisoft", "release_date": "May 15 2007", "developers": ["Capcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/9de216eb917230f9aeb71e3dda313e50-98.jpg", "descriptions": "As U.S. agent Leon Kennedy looks into the abduction of the President's daughter, his investigation leads to a mysterious location in Europe. Encountering unimaginable horrors, he must find out what is behind the terror. Experience Evil 4 with new gameplay and bonus features: new chapters -As U.S. agent Leon Kennedy looks into the abduction of the President's daughter, his investigation leads to a mysterious location in Europe. Encountering unimaginable horrors, he must find out what is behind the terror. Experience Evil 4 with new gameplay and bonus features: new chapters - play as Ada Wong in \"Separate Ways,\" 5 terrifying, adrenaline-pumping missions that reveal additional horrific surprise. New weapons, including the P.R.L.412 laser cannon and the Gunpowder Bowgun. New unlockable costumes for Leon and Ashley. New gameplay mechanics -- behind-the-back camera perspective & hit zone aiming system. [Ubisoft]… Expand"}, {"name": "Beyond: Two Souls", "details_link": "https://www.metacritic.com/game/pc/beyond-two-souls", "publisher": "Quantic Dream", "release_date": "Jul 22 2019", "developers": ["Quantic Dream"], "platforms": ["PlayStation 3", "PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/bc9371ccaa380a77b37dace1484b1bab-98.jpg", "descriptions": "Live the life of Jodie Holmes, a young woman who possesses supernatural powers through her psychic link to an invisible entity. Experience the most striking moments of Jodie's life as your actions and decisions determine her fate. As she traverses the globe, Jodie will face incredibleLive the life of Jodie Holmes, a young woman who possesses supernatural powers through her psychic link to an invisible entity. Experience the most striking moments of Jodie's life as your actions and decisions determine her fate. As she traverses the globe, Jodie will face incredible challenges against a backdrop of emotionally-charged events never before seen in a video game.… Expand"}, {"name": "Wasteland 2: Director's Cut", "details_link": "https://www.metacritic.com/game/switch/wasteland-2-directors-cut", "publisher": "InXile Entertainment", "release_date": "Sep 13 2018", "developers": ["InXile Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/2f636c24040c283b64ab00cd5d29a58e-98.jpg", "descriptions": "From the Producer of the original Fallout comes Wasteland 2, the sequel to the first-ever post-apocalyptic computer RPG.\r The Wasteland's hellish landscape is waiting for you to make your mark... or die trying. With over 80 hours of gameplay, you will deck out your Desert Ranger squad withFrom the Producer of the original Fallout comes Wasteland 2, the sequel to the first-ever post-apocalyptic computer RPG.\r The Wasteland's hellish landscape is waiting for you to make your mark... or die trying. With over 80 hours of gameplay, you will deck out your Desert Ranger squad with the most devastating weaponry this side of the fallout zone, test the limits of your strategy skills, and bring justice to the wasteland.\r Features:\r- One Size Does Not Fit All: Don't feel like finding the key for a door? Pick the lock, bash it down with your boot, or just blow it open!\r- Decision Making... with Consequences: With both short and long term reactivity, your choices ripple outwards, changing the game's events and forever altering the lives of those in the wasteland.\r- Huge & Customizable: Hundreds of characters. Thousands of variations on your Rangers' appearance. Over 150 weapons. No two players will have the same experience.… Expand"}, {"name": "One Piece: Pirate Warriors 3 - Deluxe Edition", "details_link": "https://www.metacritic.com/game/switch/one-piece-pirate-warriors-3---deluxe-edition", "publisher": "Bandai Namco Games", "release_date": "May 10 2018", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/988d00db52c87d89025f9a212d61afda-98.jpg", "descriptions": "More action, more characters, stronger enemies and an improved gameplay in the latest collaboration between TOEI ANIMATION, KOEI TECMO GAMES and BANDAI NAMCO Entertainment!\r Enjoy the original story of ONE PIECE from Fuschia village, where everything has started, to the kingdom ofMore action, more characters, stronger enemies and an improved gameplay in the latest collaboration between TOEI ANIMATION, KOEI TECMO GAMES and BANDAI NAMCO Entertainment!\r Enjoy the original story of ONE PIECE from Fuschia village, where everything has started, to the kingdom of Dressrosa, a mysterious island dominated by the evil Donquixote Doflamingo.\rWill your resolution be strong enough to defeat the most dangerous foes, including Doflamingo, Hordy Jones, Ceasar Clown and many more?\rGather every member of the Straw Hat Crew, like in the original story, sail to the most emblematic places and enter the most epic battles: Marineford, Fish-Man Island, Punk Hazard and Dressrosa!… Expand"}, {"name": "Plants vs Zombies: Garden Warfare", "details_link": "https://www.metacritic.com/game/xbox-one/plants-vs-zombies-garden-warfare", "publisher": "Electronic Arts", "release_date": "Feb 25 2014", "developers": ["PopCap"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 24 ", "genres": ["General", "Action", "General", "Shooter", "Third-Person", "Tactical"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/875bc6b48d13547a535c4cd28c385998-98.jpg", "descriptions": "Plants vs Zombies: Garden Warfare has players blast zombies, plants, and new characters with inventive weapons across a mine-blowing PvZ world."}, {"name": "Samurai Warriors 4", "details_link": "https://www.metacritic.com/game/playstation-4/samurai-warriors-4", "publisher": "Koei Tecmo Games", "release_date": "Oct 21 2014", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/62941c2645fc5dcdeb0f25eb959fcd29-98.jpg", "descriptions": "The game's primary mode, Story Mode, is separated into 2 parts, regional stories, which tell the tales of the officers of various regions around the land such as Kyūshū and Shikoku, and the story of unification, which details events up to the end of the Warring States era. By way of contrastThe game's primary mode, Story Mode, is separated into 2 parts, regional stories, which tell the tales of the officers of various regions around the land such as Kyūshū and Shikoku, and the story of unification, which details events up to the end of the Warring States era. By way of contrast to previous games in the SW series, the battles and the stories surrounding them are portrayed by faction, allowing the dramatic relationships between characters to be explored in more depth than ever before. Experience the convictions, intertwining ambitions and motivations that each character bears for yourself. [KOEI]… Expand"}, {"name": "The Wolf Among Us: Episode 2 - Smoke and Mirrors", "details_link": "https://www.metacritic.com/game/pc/the-wolf-among-us-episode-2---smoke-and-mirrors", "publisher": "Telltale Games", "release_date": "Feb  4 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Fantasy", "Action Adventure", "Adventure", "General", "Fantasy", "Point-and-Click"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/7ecd21d3c5ae9fe2f0ebfe451daa4049-98.jpg", "descriptions": "The Wolf Among Us is a five episode series from the creators of the 2012 Game of the Year: The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore andThe Wolf Among Us is a five episode series from the creators of the 2012 Game of the Year: The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist in our world. As Bigby Wolf - THE big bad wolf in human form - you will discover that the brutal, bloody murder of a Fable is just a taste of things to come, in a game series where your every decision can have enormous consequences.… Expand"}, {"name": "SkyDrift", "details_link": "https://www.metacritic.com/game/playstation-3/skydrift", "publisher": "Digital Reality", "release_date": "Sep  6 2011", "developers": ["Digital Reality"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Other", "Automobile"], "meta_score": 76, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/650433af18f8f73d86517fe92cd5ef6c-98.jpg", "descriptions": "Admire the amazingly detailed dynamic terrains and incredible vistas, from a desert canyon to a tropical island to arctic glaciers based on the most spectacular and exotic locations all over the planet. The breathtaking landscape includes monumental rocks, volcanic lava flows, scenic riversAdmire the amazingly detailed dynamic terrains and incredible vistas, from a desert canyon to a tropical island to arctic glaciers based on the most spectacular and exotic locations all over the planet. The breathtaking landscape includes monumental rocks, volcanic lava flows, scenic rivers and ice fields that provide a memorable experience in incredible graphics rarely seen in digital-only titles.… Expand"}, {"name": "WarioWare: Get It Together!", "details_link": "https://www.metacritic.com/game/switch/warioware-get-it-together!", "publisher": "Nintendo", "release_date": "Sep 10 2021", "developers": ["Nintendo", "Intelligent Systems"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/7be65ee1757613e61b013830378343ba-98.jpg", "descriptions": "Microgame mayhem comes to the Nintendo Switch™ system. Take on over 200 quick and quirky microgames—lightning-fast minigames filled with frantic fun—solo or with a friend! When his latest harebrained business scheme goes awry, Wario must use his signature style (and smell) to fix it. How? ByMicrogame mayhem comes to the Nintendo Switch™ system. Take on over 200 quick and quirky microgames—lightning-fast minigames filled with frantic fun—solo or with a friend! When his latest harebrained business scheme goes awry, Wario must use his signature style (and smell) to fix it. How? By playing a twisted collection microgames of course! From assembling a robot to pulling out a statue’s armpit hair, the WarioWare™: Get It Together! game is a comedic, cooperative microgame mashup.\r Find a friendly frenzy with a mountain of microgames\r Help out infamous game designer, Wario, after he gets sucked into his latest creation in Story Mode. Go it alone or with a friend in 2-player cooperative play—a first for the series! You can either play on the same system** or via local wireless***.\r Play as Wario and his colorful crew\r For the first time, YOU control Wario and friends inside their own chaotic games. Use their distinctly absurd abilities to take on a rush of microgames. Tip a turtle with the help of Wario’s dash or choose Ashley and hurl a spell at it. In WarioWare: Get It Together!, mix and match characters and microgames for maximum fun!\r… Expand"}, {"name": "Panzer Paladin", "details_link": "https://www.metacritic.com/game/pc/panzer-paladin", "publisher": "Tribute Games", "release_date": "Jul 21 2020", "developers": ["Tribute Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/c0f6ffcd1b3eaebe15e215e74f7933a2-98.jpg", "descriptions": "Hop in the Paladin power armor, seize melee weapons from the demonic invaders and give them a taste of their own medicine."}, {"name": "Field of Glory: Empires", "details_link": "https://www.metacritic.com/game/pc/field-of-glory-empires", "publisher": "Slitherine", "release_date": "Jul 11 2019", "developers": ["AGEOD"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 76, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/a4b296e5a3447ebe483f231891e21171-98.jpg", "descriptions": "Field of Glory: Empires is a grand strategy game in which you will have to move in an intricate and living tapestry of nations and tribes, each one with their distinctive culture."}, {"name": "Pathologic Classic HD", "details_link": "https://www.metacritic.com/game/pc/pathologic-classic-hd", "publisher": "Gambitious", "release_date": "Oct 29 2015", "developers": ["Ice-Pick Lodge"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 76, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/e20f478f2e2624b7d3fab13ebd80e8f5-98.jpg", "descriptions": "Pathologic Classic HD is an extensive remaster of the original game, featuring updated graphics and effects, while addressing the most prominent critiques of the original with a completely redone English script, brand new re-recorded voice-overs, and reinstated text and dialogue."}, {"name": "Hard Corps: Uprising", "details_link": "https://www.metacritic.com/game/playstation-3/hard-corps-uprising", "publisher": "Konami", "release_date": "Mar 15 2011", "developers": ["Arc System Works"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/ac358ab9ed829af7fd774c084013bf54-98.jpg", "descriptions": "Thrilling retro run-and-gun action is back with a vengeance in Hard Corps: Uprising, a new 2D side scroller developed by ARC System Works that pays homage to classic Konami action series. Play as the soldier Bahamut as he begins to write his legend. Battle in the grueling trenches of ArcadeThrilling retro run-and-gun action is back with a vengeance in Hard Corps: Uprising, a new 2D side scroller developed by ARC System Works that pays homage to classic Konami action series. Play as the soldier Bahamut as he begins to write his legend. Battle in the grueling trenches of Arcade mode or the all-new RISING mode, where a life bar and point system allow you to purchase items and upgrades to build your soldier up and achieve ultimate victory. Need help? Partner with a friend to lay down some serious carnage.… Expand"}, {"name": "Heroes of the Pacific", "details_link": "https://www.metacritic.com/game/playstation-2/heroes-of-the-pacific", "publisher": "Ubisoft", "release_date": "Sep 28 2005", "developers": ["IR Gurus"], "platforms": ["PC", "PlayStation 2"], "num_players": "8  Online", "genres": ["Simulation", "Flight", "WWII"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/01ba481d0b7a30f73cdbfada669577b9-98.jpg", "descriptions": "With the attack on Pearl Harbor, the US military mobilized. Common men rose to the challenge and became heroes in the skies, seas and beaches of WWII's Pacific Theater. Heroes of the Pacific is an epic WWII flight combat game that begins with the Japanese attack on Pearl Harbor and unfoldsWith the attack on Pearl Harbor, the US military mobilized. Common men rose to the challenge and became heroes in the skies, seas and beaches of WWII's Pacific Theater. Heroes of the Pacific is an epic WWII flight combat game that begins with the Japanese attack on Pearl Harbor and unfolds in epic detail through the battles of Midway, the Coral Sea, Wake Island, Iwo Jima and Guadalcanal.  You are the hero whose skill guts and determination will win or lose the war. Mastery of over 25 actual WWII aircraft is crucial as is maintaining focus in the thick of a 300 plane dog fight with planes exploding and smoke trails blocking views. Command a squadron of 32 AI planes, work with friends through online connections, or go it alone to achieve the battle objectives. Make it through alive while upholding integrity, courage and American ideals to become a hero of the Pacific. [Encore Software]… Expand"}, {"name": "FIFA Street", "details_link": "https://www.metacritic.com/game/playstation-3/fifa-street", "publisher": "EA Sports", "release_date": "Mar 13 2012", "developers": ["EA Sports"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Arcade", "Arcade"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/acea2e0c84511313e83175fb6d26866a-98.jpg", "descriptions": "Powered by the revolutionary FIFA Soccer gameplay engine, and introducing Street Ball Control, FIFA Street will deliver an arsenal of groundbreaking street dribbling styles and trick moves that ignite the one-on-one battles within matches. Whether performing one panna after another withoutPowered by the revolutionary FIFA Soccer gameplay engine, and introducing Street Ball Control, FIFA Street will deliver an arsenal of groundbreaking street dribbling styles and trick moves that ignite the one-on-one battles within matches. Whether performing one panna after another without breaking a sweat the way street soccer is played in Amsterdam, or a physical, fight-for-possession style the way players compete in London, fans will enjoy a superior fidelity of ball control and responsiveness than anything ever experienced in a soccer videogame. Plus, for the first time ever, utilize aerial skills to maneuver past opponents, an all-new sophisticated one-touch passing system for quick, precision passes, and over 50 never-before-experienced skill moves.… Expand"}, {"name": "Shin Megami Tensei III: Nocturne HD Remaster", "details_link": "https://www.metacritic.com/game/playstation-4/shin-megami-tensei-iii-nocturne-hd-remaster", "publisher": "SegaSoft", "release_date": "May 24 2021", "developers": ["Atlus Co.", "Atlus"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/2f1ff9aef9d9dbdaeebe81e05dfb243a-98.jpg", "descriptions": "Reawaken your inner demon in a modernized version of the acclaimed ATLUS classic, Shin Megami Tensei III Nocturne HD Remaster. What begins as a normal day in Tokyo turns out to be everything but, when the Conception – an ethereal apocalypse – is invoked. The remains of the world areReawaken your inner demon in a modernized version of the acclaimed ATLUS classic, Shin Megami Tensei III Nocturne HD Remaster. What begins as a normal day in Tokyo turns out to be everything but, when the Conception – an ethereal apocalypse – is invoked. The remains of the world are swallowed by chaos, as a demonic revolution descends into a broken city. Caught between a battle of Gods and demons, the choices you make can bring life, rebirth, or death, and determine who triumphs. This genre-defining, infamously punishing RPG is back and now includes:\rRemastered 3D models and backgrounds\rAdditional difficulty settings for players of all skill levels\rSuspend save -- save your progress whenever you need!\rVoiced audio -- choose between Japanese and English VO\r… Expand"}, {"name": "Tiny Tina's Wonderlands", "details_link": "https://www.metacritic.com/game/playstation-5/tiny-tinas-wonderlands", "publisher": "2K Games", "release_date": "Mar 25 2022", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/a8109261193a047e52085e23bfced8df-98.jpg", "descriptions": "Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry! Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina, who makes the rules, changes the world on the fly, and guides players on their journey.Embark on an epic adventure full of whimsy, wonder, and high-powered weaponry! Bullets, magic, and broadswords collide across this chaotic fantasy world brought to life by the unpredictable Tiny Tina, who makes the rules, changes the world on the fly, and guides players on their journey. Customize your own multiclass hero and loot, shoot, slash, and cast your way through outlandish monsters and treasure-filled dungeons on a quest to stop the tyrannical Dragon Lord. Everyone's welcome, so join the party, throw on your adventuring boots, and be Chaotic Great!… Expand"}, {"name": "Tetris Party Deluxe", "details_link": "https://www.metacritic.com/game/ds/tetris-party-deluxe", "publisher": "Majesco Games", "release_date": "May 25 2010", "developers": ["Tetris Online", "Inc"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/c4587c755323c3cb10ae7a38ae17f9ef-98.jpg", "descriptions": "Magic at your fingertips - Utilize the intuitive touch screen to activate Magic Items during multiplayer games. Free speech is good - Simply speak into the Nintendo DS microphone within the Wi-Fi Battle lobby to speak with other users. [Majesco]"}, {"name": "The Bard's Tale", "details_link": "https://www.metacritic.com/game/playstation-2/the-bards-tale", "publisher": "InXile Entertainment", "release_date": "Oct 26 2004", "developers": ["InXile Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Third-Person"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/909eb7c9bf4a08dedd0ef113d1cfa858-98.jpg", "descriptions": "One man on his own. A poet and a rogue, with no friends to speak of, no one to mourn his passing shouuld it come to that. Even those beside hime are no more boon companions than bondservants, summoned by sorcery and song, as cold and indifferent to him as the light of a wanderin' star. Is aOne man on his own. A poet and a rogue, with no friends to speak of, no one to mourn his passing shouuld it come to that. Even those beside hime are no more boon companions than bondservants, summoned by sorcery and song, as cold and indifferent to him as the light of a wanderin' star. Is a Dragon terrorising the locals? He'll take care of it for the right price. Local princess held captiver? The Bard is your man as long as she's hot. Forget the quest to save the world, our hero is interested in just two things...Coin and Cleavage. The Bard's Tale is a new generation action-RPG with wicket humour and stunning graphics. [inXile Entertainment]… Expand"}, {"name": "Crimson Shroud", "details_link": "https://www.metacritic.com/game/3ds/crimson-shroud", "publisher": "Level 5", "release_date": "Dec 13 2012", "developers": ["Nex Entertainment"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Console-style RPG", "General"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/4e08e275777984b9909c79f23aa671f0-98.jpg", "descriptions": "Follow the tale of a young \"Chaser\" named Giauque, as he and his team find themselves drawn into the mystery of the Original Gift, the Crimson Shroud."}, {"name": "Attentat 1942", "details_link": "https://www.metacritic.com/game/pc/attentat-1942", "publisher": "Charles University", "release_date": "Oct 31 2017", "developers": ["Charles University"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/60b147f8a6ca895e8836dfad6b3929f1-98.jpg", "descriptions": "Attentat 1942 tells the story of Nazi occupation from the perspective of those who experienced it firsthand. The game is built on dialogues, interactive comics, and authentic footage. Speak to eyewitnesses, live their memories, and discover the untold story of your family."}, {"name": "Serious Sam HD: The Second Encounter", "details_link": "https://www.metacritic.com/game/pc/serious-sam-hd-the-second-encounter", "publisher": "Devolver Digital", "release_date": "Apr 28 2010", "developers": ["Croteam"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/d1cdf30cee8afc10bdd3806953c4cd84-98.jpg", "descriptions": "Developed by Croteam and powered by the Serious Engine 3, Serious Sam HD: The Second Encounter combines enhanced visuals, including more polygons, higher resolution textures and more special effects like hippy and kid’s mode, with trademark frantic gameplay for a non-stop action. FeaturingDeveloped by Croteam and powered by the Serious Engine 3, Serious Sam HD: The Second Encounter combines enhanced visuals, including more polygons, higher resolution textures and more special effects like hippy and kid’s mode, with trademark frantic gameplay for a non-stop action. Featuring single-play, survival and cooperative play and mixed with brilliantly updated visuals, the game continues your battle against Mental’s army with the classic over-the-top action, crazy humor and horror from the golden age of first-person shooters. Combines intense versus and team modes for up to 16 players and in over 18 multiplayer maps, demo recording option, spectators and dedicated server support. [Steam]… Expand"}, {"name": "Call of Duty: Modern Warfare II", "details_link": "https://www.metacritic.com/game/playstation-5/call-of-duty-modern-warfare-ii", "publisher": "Activision", "release_date": "Oct 28 2022", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 64 ", "genres": ["Arcade", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/18778c384228e651773b08e52130c7a8-98.jpg", "descriptions": "Call of Duty: Modern Warfare II is the sequel to 2019’s blockbuster Modern Warfare. Featuring the return of the iconic, team leader Captain John Price, the fearless John \"Soap\" MacTavish, the seasoned Sergeant Kyle \"Gaz” Garrick, and the lone wolf himself, fan favorite Simon “Ghost” Riley,Call of Duty: Modern Warfare II is the sequel to 2019’s blockbuster Modern Warfare. Featuring the return of the iconic, team leader Captain John Price, the fearless John \"Soap\" MacTavish, the seasoned Sergeant Kyle \"Gaz” Garrick, and the lone wolf himself, fan favorite Simon “Ghost” Riley, witness what makes Task Force 141 (TF141) the legendary squad it is today. \r\rLeverage new weapons, vehicles, and cutting-edge equipment to take on enemies. Gear up and take the fight offshore to siege enemies underwater, breach a highly fortified enemy base, infil along the canals and liberate much-needed allies at a black site hidden within the mountains. \r\rInfinity Ward presents heart-pounding next-gen, state-of-the-art gameplay. Fight alongside friends in a truly immersive experience with stunningly realistic sound, lighting, and graphics that produce the most advanced Call of Duty in history. \r\rModern Warfare® II features a suite of gameplay and graphical innovations that elevate the franchise to new heights, including:\r A rebuilt, advanced AI system\r  Enhanced rendering and photogrammetry technology\r  A new Gunsmith system allowing for more customization than ever.\r  Trail blazing innovations to set the foundation for next-generation gameplay.\r Stay Frosty. \r… Expand"}, {"name": "OMNO", "details_link": "https://www.metacritic.com/game/pc/omno", "publisher": "StudioInkyfox", "release_date": "Jul 29 2021", "developers": ["Jonas Manke", "StudioInkyfox"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/c4cacbc40a966636691f01e6d053acff-98.jpg", "descriptions": "A single-player journey of discovery through an ancient world of wonders, created by solo developer Jonas Manke."}, {"name": "New Super Lucky's Tale", "details_link": "https://www.metacritic.com/game/playstation-4/new-super-luckys-tale", "publisher": "PQube", "release_date": "Aug 21 2020", "developers": ["Playful Corp."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/ce75bbe34cf801b8d289ae9b0fea30b9-98.jpg", "descriptions": "The adventure of a young fox who embarks on a journey through the unknown and becomes a hero."}, {"name": "Hunt: Showdown", "details_link": "https://www.metacritic.com/game/xbox-one/hunt-showdown", "publisher": "Crytek", "release_date": "Feb 18 2020", "developers": ["Crytek"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Third-Person", "Arcade", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/5f2980efb845bc3b04922ca8af8787a5-98.jpg", "descriptions": "Hunt: Showdown is a competitive first-person bounty hunting game that packs the thrill of survival games into a match-based format. Set in Louisiana in 1895, the game boasts a mixture of PvP and PvE elements that creates a uniquely tense experience. It’s not just the creatures who are aHunt: Showdown is a competitive first-person bounty hunting game that packs the thrill of survival games into a match-based format. Set in Louisiana in 1895, the game boasts a mixture of PvP and PvE elements that creates a uniquely tense experience. It’s not just the creatures who are a threat—it’s every Hunter on the map. In the classic game mode, a match of Hunt pits ten players—playing solo or in teams of two—against each other as they race to take out gruesome beasts for a bounty they must collect and get off of the map, while Hunt’s quickplay mode offers a shorter match for solo players to scavenge for weapons as they compete for a diminishing pool of bounty. The higher the risk, the higher the reward–but a single mistake could cost everything.… Expand"}, {"name": "Planet Alpha", "details_link": "https://www.metacritic.com/game/switch/planet-alpha", "publisher": "Team17", "release_date": "Sep  4 2018", "developers": ["Adrian Lazar"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/d493bb675b58074219ed131afba96cea-98.jpg", "descriptions": "PLANET ALPHA, a beautiful alien world filled with mystery and danger. Pursued by relentless enemies, you must harness the power of night and day as you struggle to survive."}, {"name": "Klaus", "details_link": "https://www.metacritic.com/game/playstation-4/klaus", "publisher": "La Cosa Entertainment", "release_date": "Jan 19 2016", "developers": ["La Cosa Entertainment"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/606fef444f3dad87c4d5e6dd62690917-98.jpg", "descriptions": "KLAUS follows an office worker who awakens in a basement with no idea of who or where he is. With his only clue being the word \"KLAUS\" tattooed on his arm. He is forced to escape the mechanical & constructivist world in which he finds himself a prisoner. Another playable character: K1, aKLAUS follows an office worker who awakens in a basement with no idea of who or where he is. With his only clue being the word \"KLAUS\" tattooed on his arm. He is forced to escape the mechanical & constructivist world in which he finds himself a prisoner. Another playable character: K1, a friendly brute damaged by prolonged imprisonment, embarking on an existential journey, exploring the idea of the fourth wall and awareness of the player playing the game.… Expand"}, {"name": "Need for Speed: Rivals", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-rivals", "publisher": "Electronic Arts", "release_date": "Nov 19 2013", "developers": ["Ghost Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 76, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/5/a0e6e1003ef150ee7fa77ac72b727863-98.jpg", "descriptions": "Welcome to Redview County, where a street-racing rivalry between cops and racers never ends as both sides compete in all-out warfare featuring the fastest cars, mods and technology in a gritty open road environment. Play as either a copper or racer, where each side of the law has its own setWelcome to Redview County, where a street-racing rivalry between cops and racers never ends as both sides compete in all-out warfare featuring the fastest cars, mods and technology in a gritty open road environment. Play as either a copper or racer, where each side of the law has its own set of high stakes challenges, rewards and consequences.… Expand"}, {"name": "Greed Corp", "details_link": "https://www.metacritic.com/game/pc/greed-corp", "publisher": "W!Games", "release_date": "Dec 10 2010", "developers": ["W!Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Strategy", "Turn-Based", "Modern", "General", "Modern"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/cc26053ed623149dfb6f586ad4871fb5-98.jpg", "descriptions": "Find the delicate balance between harvesting the land for resources and preserving it to stay alive. Will you defend your territory or sacrifice it to keep it out of enemy hands? Manage the finite available resources to build your army and use the collapsing terrain to your advantage.Find the delicate balance between harvesting the land for resources and preserving it to stay alive. Will you defend your territory or sacrifice it to keep it out of enemy hands? Manage the finite available resources to build your army and use the collapsing terrain to your advantage. Destroy your enemies, or destroy the very land they stand on, before they do it to you. The game features a comprehensive single player campaign, introducing you to the four factions that inhabit the world. A large collection of unique maps is available outside of the campaign, specifically designed for 2, 3, or 4-player battles. Matches can be played with any combination of local, online and AI players, allowing for quick access to multiplayer action and offering multiple unlockables for a variety of challenges.… Expand"}, {"name": "Wild Hearts", "details_link": "https://www.metacritic.com/game/xbox-series-x/wild-hearts", "publisher": "Electronic Arts", "release_date": "Feb 17 2023", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 76, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/3f80567a052f12454b2825c1530e7e05-98.jpg", "descriptions": "Master ancient tech to hunt down giant beasts through a fantasy world inspired by feudal Japan. WILD HEARTS is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself.  Take on these creaturesMaster ancient tech to hunt down giant beasts through a fantasy world inspired by feudal Japan. WILD HEARTS is a unique twist on the hunting genre where technology gives you a fighting chance against fearsome beasts infused with the ferocious power of nature itself.  Take on these creatures alone or hunt with friends in seamless co-op. Developed by Omega Force, the Japanese studio behind the Dynasty Warriors franchise and in partnership with EA Originals, WILD HEARTS takes you on an epic adventure set in a fantasy world inspired by feudal Japan.\r… Expand"}, {"name": "Gigantic", "details_link": "https://www.metacritic.com/game/pc/gigantic", "publisher": "Motiga", "release_date": "Jul 20 2017", "developers": ["Motiga"], "platforms": ["Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/8dabdf56f9cd1bf3f732708549273741-98.jpg", "descriptions": "Gigantic is a fast and fluid Strategic Hero Shooter, where you battle against and alongside massive Guardians, in deeply strategic team gameplay. Think fast, be bold, Go Gigantic!"}, {"name": "WWE '13", "details_link": "https://www.metacritic.com/game/playstation-3/wwe-13", "publisher": "THQ", "release_date": "Oct 30 2012", "developers": ["THQ"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/8c5d6f28462db3b2d9fe42dae4fb3dde-98.jpg", "descriptions": "Relive the Attitude Era of WWE in an all-new story mode. The new WWE Live presentation system features an overhauled audio system and Spectacular Moments. WWE ’13 promises to be the boldest WWE simulation to date."}, {"name": "Lemmings", "details_link": "https://www.metacritic.com/game/psp/lemmings", "publisher": "SCEA", "release_date": "May 23 2006", "developers": ["Team17"], "platforms": ["PlayStation 3", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/8e374ae8bfeb6afceebc83ffab95b58a-98.jpg", "descriptions": "Controlling an army of lemmings, the aim is to get as many of these cute characters as you can from the entrance point to the exit point of a level within a time limit. Easy to learn, difficult to master; Lemmings is a test of strategy and fast thinking as you make 'on the spot', life orControlling an army of lemmings, the aim is to get as many of these cute characters as you can from the entrance point to the exit point of a level within a time limit. Easy to learn, difficult to master; Lemmings is a test of strategy and fast thinking as you make 'on the spot', life or death decisions for your band of trusting little creatures. Use the unique skills of your Lemmings team to overcome the hazards ahead: The 'Bomber' explodes at will, the 'Floater' can survive high falls and the 'Basher' digs horizontally just when you need it. The 'Climber' is at hand for those tricky mountain ranges, the 'Blocker' creates an obstacle in the path ahead and the 'Builder' is there to construct walkways for his friends. Stretch your strategies across 100 plus levels as you lead your lemmings across an immense variety of challenging backdrops. The levels are arranged into five striking themes, each with its own unique visual flavour. So, whether it's going underground into the sewers or marching through fields and forests, the lemmings always have new terrain to explore. [SCEE]… Expand"}, {"name": "Tony Hawk's Project 8", "details_link": "https://www.metacritic.com/game/playstation-3/tony-hawks-project-8", "publisher": "Activision", "release_date": "Nov 17 2006", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 76, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/448f82b82a69be264e19dbc9328fae01-98.jpg", "descriptions": "Reengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players toReengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players to experience the intensity and pressure of skating against some of the world’s top pros in true to life competitions as they aim to become the #1 skater. [Activision]… Expand"}, {"name": "Voice of Cards: The Beasts of Burden", "details_link": "https://www.metacritic.com/game/switch/voice-of-cards-the-beasts-of-burden", "publisher": "Square Enix", "release_date": "Sep 13 2022", "developers": ["A-lim"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 76, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/b8a71054fd7f01d24e94623a04e51a1e-98.jpg", "descriptions": "This is the tale of a girl who swears revenge on monsters.\rAfter losing her home, she joins hands with a mysterious boy and sets out into the unknown. But will it be the light of hope, or the darkness of despair that awaits them at journey's end...? The Voice of Cards series are RPGs, toldThis is the tale of a girl who swears revenge on monsters.\rAfter losing her home, she joins hands with a mysterious boy and sets out into the unknown. But will it be the light of hope, or the darkness of despair that awaits them at journey's end...? The Voice of Cards series are RPGs, told entirely through the medium of cards.\rIn \"The Beasts of Burden\", you can trap the monsters you defeat in cards and use them as skills in battle.\r Enjoy a truly unique gaming experience from the minds of YOKO TARO, Keiichi Okabe and Kimihiko Fujisaka.\r *This game is not a direct sequel to Voice of Cards: The Isle Dragon Roars or Voice of Cards: The Forsaken Maiden and can be enjoyed as a standalone adventure.\r*Product bundles that include this game are also available. Please take care to avoid making duplicate purchases.\r*Please be aware that services which require an internet connection to use may be discontinued after a time has passed from the game’s release.… Expand"}, {"name": "Marvel's Spider-Man: The Heist", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-spider-man-the-heist", "publisher": "Sony Interactive Entertainment", "release_date": "Oct 23 2018", "developers": ["Insomniac Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/fc946e764047d07a2d738d37830f892e-98.jpg", "descriptions": "Marvel's Spider-Man: The Heist - Felicia Hardy aka Black Cat, is back in town and leaving mysterious clues around Marvel's New York to toy with Spider-Man."}, {"name": "Bulletstorm: Full Clip Edition", "details_link": "https://www.metacritic.com/game/pc/bulletstorm-full-clip-edition", "publisher": "Gearbox Software", "release_date": "Apr  7 2017", "developers": ["People Can Fly"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/67fa3131681647d314693feb43946312-98.jpg", "descriptions": "Step into the boots of Grayson Hunt after a crash landing on an abandoned resort planet forces him to make a hard choice: survival or revenge. An exiled member of the elite assassin group Dead Echo, Graysons blind desire for vengeance finds his crew stranded on Stygia where he can finallyStep into the boots of Grayson Hunt after a crash landing on an abandoned resort planet forces him to make a hard choice: survival or revenge. An exiled member of the elite assassin group Dead Echo, Graysons blind desire for vengeance finds his crew stranded on Stygia where he can finally confront the commander behind his betrayalor get his team off the planet alive.\r Battle your way through throngs of Stygias mutated inhabitants, performing masterful kills throughout the single-player campaignor one of 30 competitive score-challenge or 12 co-operative multiplayer mapsusing Bulletstorm: Full Clip Editions unique Skillshot system that rewards you for executing the most creative and deadly kills imaginable.\r Bulletstorm: Full Clip edition is the definitive Bulletstorm experience that includes all existing Bulletstorm add-ons, plus brand-new content exclusive to Full Clip!… Expand"}, {"name": "Heart&Slash", "details_link": "https://www.metacritic.com/game/playstation-4/heartslash", "publisher": "PQube", "release_date": "Jun 28 2016", "developers": ["AHEARTFULOFGAMES"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Beat-'Em-Up", "3D"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/e1adb449cd4f2ec5783adb4bb7ed443c-98.jpg", "descriptions": "Heart&Slash is a 3D brawler roguelike robot love story set in a world where machines are all that remains from human civilization. You play as Heart, a sentient robot fighting to escape the grip of the evil and all seeing machine QuAsSy (Quality Assurance Systems). But make no mistake,Heart&Slash is a 3D brawler roguelike robot love story set in a world where machines are all that remains from human civilization. You play as Heart, a sentient robot fighting to escape the grip of the evil and all seeing machine QuAsSy (Quality Assurance Systems). But make no mistake, Heart&Slash is no walk in the park. Every death is permanent and means a new randomly generated level for you to start over with a different set of weapons and items you can use, new enemies to fight and secrets to explore. Heart&Slash offers players something new and challenging because it is not about mastering one system, rather adapting to what is provided and making the most of it. [Playstation.com]… Expand"}, {"name": "Q.U.B.E. Director's Cut", "details_link": "https://www.metacritic.com/game/xbox-one/qube-directors-cut", "publisher": "Grip Games", "release_date": "Jul 24 2015", "developers": ["Toxic Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One"], "genres": ["Miscellaneous", "Puzzle", "Action", "Logic"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/e011e2cc25372b92c8f50d428592016b-98.jpg", "descriptions": "The Director’s Cut is the definitive version of Q.U.B.E. featuring new content, puzzles and an all new story line from award winning writer Rob Yescombe."}, {"name": "Tower of Guns", "details_link": "https://www.metacritic.com/game/pc/tower-of-guns", "publisher": "Terrible Posture Games", "release_date": "Mar  4 2014", "developers": ["Terrible Posture Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/5156e7513ed6a60bf8e8ca7d9f2125fb-98.jpg", "descriptions": "Tower of Guns is a fast paced first-person-shooter for the twitch gamer... with a few randomized elements to keep it fresh with each playthrough."}, {"name": "Dragon Age II: Mark of the Assassin", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-age-ii-mark-of-the-assassin", "publisher": "Electronic Arts", "release_date": "Oct 11 2011", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "PC-style RPG", "Action RPG"], "meta_score": 76, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/c6382380c4067427e220aaec082cb4dc-98.jpg", "descriptions": "Mark of the Assassin is the next set of DLC for Dragon Age II."}, {"name": "NHL Slapshot", "details_link": "https://www.metacritic.com/game/wii/nhl-slapshot", "publisher": "EA Sports", "release_date": "Sep  7 2010", "developers": ["EA Sports"], "platforms": "Wii", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/621e8be403782a5879eee477a0c439be-98.jpg", "descriptions": "For the first time ever, EA SPORTS brings NHL to the Wii with NHL Slapshot. Along with it, the game introduces a revolutionary hockey stick controller that allows players to shoot, pass and body check just like the pros."}, {"name": "Red Orchestra 2: Heroes of Stalingrad", "details_link": "https://www.metacritic.com/game/pc/red-orchestra-2-heroes-of-stalingrad", "publisher": "Tripwire Interactive", "release_date": "Sep 13 2011", "developers": ["Tripwire Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/be3c8d30a370d3c5e52bb9a7dbeca7d7-98.jpg", "descriptions": "Red Orchestra 2: Heroes of Stalingrad is the follow-up to Tripwire's original hit multiplayer PC title, Red Orchestra: Ostfront 41-45, which has gone on to sell nearly half a million units since launch. This time, the game will feature a greatly expanded multi-player experience, withRed Orchestra 2: Heroes of Stalingrad is the follow-up to Tripwire's original hit multiplayer PC title, Red Orchestra: Ostfront 41-45, which has gone on to sell nearly half a million units since launch. This time, the game will feature a greatly expanded multi-player experience, with multiple new game modes, a complete first person cover system, destructible terrain, enhanced weapon mechanics and realistic WWII combat made truly accessible. In addition, the game will feature single-player and co-op game modes, allowing the player to play a full campaign from the Russian and, for the first time in a first person shooter, from the German point of view. Tripwire's renowned weapon handling improved even further, with new features and sounds. And tanks created with fully-operational 3D interiors, hugely enhancing the original game’s vehicle experience.… Expand"}, {"name": "Victor Vran: Overkill Edition", "details_link": "https://www.metacritic.com/game/playstation-4/victor-vran-overkill-edition", "publisher": "Wired Productions", "release_date": "May 30 2017", "developers": ["Haemimont Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/2e8620a31d9794080c269525e7ee5562-98.jpg", "descriptions": "Become Victor, hunter of demons. Forge your own hero on a quest to liberate the cursed city of Zagoravia. Explore ‘Motörhead: Through the Ages’ - a wild tour through the mythos of the loudest band in the world, and enter the Fractured Worlds, a dimension formed from the fragments of brokenBecome Victor, hunter of demons. Forge your own hero on a quest to liberate the cursed city of Zagoravia. Explore ‘Motörhead: Through the Ages’ - a wild tour through the mythos of the loudest band in the world, and enter the Fractured Worlds, a dimension formed from the fragments of broken realms.… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 2", "details_link": "https://www.metacritic.com/game/playstation-3/naruto-shippuden-ultimate-ninja-storm-2", "publisher": "Namco Bandai Games", "release_date": "Oct 19 2010", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/57663fd20fa99865eeece168078876d0-98.jpg", "descriptions": "Developed by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM 2 faithfully recreates the anime series and fully immerses players in the mythical ninja world with new expansive environments, missions, battle systems and gameplay modes. Taking players through the NARUTO SHIPPUDEN storyDeveloped by CyberConnect2, NARUTO SHIPPUDEN: Ultimate Ninja STORM 2 faithfully recreates the anime series and fully immerses players in the mythical ninja world with new expansive environments, missions, battle systems and gameplay modes. Taking players through the NARUTO SHIPPUDEN story arc, daring ninja warriors must strategically recruit the right support characters to ensure victory against any and all opponents.  With the winning combination, players can easily unleash bigger and more explosive Team Special Techniques to obliterate enemies who stand in the way.  … Expand"}, {"name": "Ratchet & Clank Collection", "details_link": "https://www.metacritic.com/game/playstation-vita/ratchet-clank-collection", "publisher": "SCEA", "release_date": "Jul 29 2014", "developers": ["Mass Media"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/6f9dae0ca4ea3374ea2f34bf32c36d00-98.jpg", "descriptions": "(Also known as \"The Ratchet & Clank Trilogy\") Experience the classic adventures of the universe's favorite Lombax, Ratchet and his robotic sidekick Clank in this classic PlayStation 2 Action-Adventure trilogy now fully remastered in high definition. Wield the original tools of destruction as(Also known as \"The Ratchet & Clank Trilogy\") Experience the classic adventures of the universe's favorite Lombax, Ratchet and his robotic sidekick Clank in this classic PlayStation 2 Action-Adventure trilogy now fully remastered in high definition. Wield the original tools of destruction as you travel from planet to planet unraveling their original story and explosive adventures in this PlayStation 3 exclusive.… Expand"}, {"name": "Broken Age", "details_link": "https://www.metacritic.com/game/pc/broken-age", "publisher": "Double Fine Productions", "release_date": "Jan 28 2014", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Third-Person", "General", "Fantasy", "3D", "Adventure", "Point-and-Click"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/709b721614f6fd93fc7a1f61dfcfb440-98.jpg", "descriptions": "Broken Age is a point-and-click adventure telling the stories of a young boy and girl leading parallel lives. The girl has been chosen by her village to be sacrificed to a terrible monster--but she decides to fight back. Meanwhile, a boy on a spaceship is living a solitary life under theBroken Age is a point-and-click adventure telling the stories of a young boy and girl leading parallel lives. The girl has been chosen by her village to be sacrificed to a terrible monster--but she decides to fight back. Meanwhile, a boy on a spaceship is living a solitary life under the care of a motherly computer, but he wants to break free to lead adventures and do good in the world. Adventures ensue.… Expand"}, {"name": "The Flame in the Flood: Complete Edition", "details_link": "https://www.metacritic.com/game/playstation-4/the-flame-in-the-flood-complete-edition", "publisher": "Curve Digital", "release_date": "Jan 17 2017", "developers": ["The Molasses Flood"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General", "Survival"], "meta_score": 76, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/a0a0d7abca48b3d77979fbeb2672ef39-98.jpg", "descriptions": "A rogue-lite river journey through the backwaters of a forgotten post-societal America. Travel by foot and by raft down a procedurally-generated river as you scrounge for resources, craft tools, remedy afflictions, evade the vicious wildlife, and most importantly, stay ahead of the coming rains."}, {"name": "The Walking Dead: Michonne - Episode 3: What We Deserve", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-michonne---episode-3-what-we-deserve", "publisher": "Telltale Games", "release_date": "Apr 26 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/643f9ddeeabfe5c182446c6d69050f24-98.jpg", "descriptions": "The season finale."}, {"name": "Audiosurf 2", "details_link": "https://www.metacritic.com/game/pc/audiosurf-2", "publisher": "Invisible Handlebar", "release_date": "May 26 2015", "developers": ["BestGameEver.com"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Music", "Action", "Rhythm", "Music"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/f0c0dc4421c845ae53d212c6efdfd485-98.jpg", "descriptions": "Ride your music in more ways than ever before. Audiosurf 2 is the music game for your entire music collection, plus online music streaming and Song of the Day. Hundreds of mods/skins on Workshop. Free demo available."}, {"name": "Who's That Flying?!", "details_link": "https://www.metacritic.com/game/pc/whos-that-flying!", "publisher": "Kalypso", "release_date": "Jan 31 2011", "developers": ["Mediatonic"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/9469086e1dd883fc49a388fa0ffcac29-98.jpg", "descriptions": "As the mysterious and powerful \"Guardian of Earth\" your steely eye and HYPER-POWERED LASER ARM have kept the citizens of Earth safe for generations (as well as proving a hit with the ladies).\r With all your awesome TALENT and FLAIR, surely it would be IMPOSSIBLE for a devastatingAs the mysterious and powerful \"Guardian of Earth\" your steely eye and HYPER-POWERED LASER ARM have kept the citizens of Earth safe for generations (as well as proving a hit with the ladies).\r With all your awesome TALENT and FLAIR, surely it would be IMPOSSIBLE for a devastating invasion of Doom Beasts to descend on your cities and cause havoc without your knowledge? (Even if you were MAYBE showboating for a magazine photo-shoot at the time...)\r Now, you must not only defend your cities from the ravenous hordes of Doom Beasts - you must defend yourself against accusations of gross incompetence from the Galactic Council of Justice! And this is all BEFORE you can even start to get to the bottom of just who OR what is really behind the attacks...… Expand"}, {"name": "Tom Clancy's EndWar", "details_link": "https://www.metacritic.com/game/playstation-3/tom-clancys-endwar", "publisher": "Ubisoft", "release_date": "Nov  4 2008", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Military", "Military", "Tactics"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/4d782c8972390497e461773f57890800-98.jpg", "descriptions": "2011 - 2014. The world enjoys an unprecedented era of peace as enhanced defense technology eliminates the threat of nuclear war. But can it last? 2020. Constant depletion of resources has international tensions at a breaking point. One spark will ignite what no one thought could happen...a2011 - 2014. The world enjoys an unprecedented era of peace as enhanced defense technology eliminates the threat of nuclear war. But can it last? 2020. Constant depletion of resources has international tensions at a breaking point. One spark will ignite what no one thought could happen...a third and final world war. Strategy for the next generation: Led by creative director Michael de Plater (Rome Total War), EndWar promises to redefine strategy gaming. Designed for next-gen consoles EndWar creates a theatre of war, immersing you in the drama of World War III in a way you never thought possible. Fight For Your Nation: Pick a side US, Europe, Russia - the fate of the world is in your hands. If you don't step in to save your homeland, who will? Command Your Army: Grow your army into the most powerful force on the planet. Your army is completely customizable, and experience breeds strength - your units grow more powerful with every campaign you fight. Light Up The City of Lights: Tom Clancy's World War III won't be won by capturing remote deserts or grasslands but by striking countries in the heart. Paris, Moscow, Washington D.C. will all erupt in flames as you battle your way through the fully destructive playground. A Whole New Kind of Massive: EndWar is an online multiplayer experience unlike anything you've ever encountered. 16 player matchups? Try hundreds. 30 minute battles? Try persistent matchups lasting for months at a time. This isn't a skirmish, it's World War III. Talk Your Way to Victory: Put the controller aside and start shouting commands. EndWar can be played almost entirely via voice command. [Ubisoft]… Expand"}, {"name": "V-Rally 3", "details_link": "https://www.metacritic.com/game/xbox/v-rally-3", "publisher": "Atari", "release_date": "Mar 25 2003", "developers": ["Eden Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/f07a55f2404462b3afdcf596923cd59a-98.jpg", "descriptions": "V-Rally evolves in its third installment with more detailed cars, customizable rally cars, and scurrying spectators. The world's top rally cars--including Subaru Impreza, Mitsubishi Lancer Evolution 7, Citroen Xsara, and Ford Focus--are included in V-Rally 3. Choose one, and then overcomeV-Rally evolves in its third installment with more detailed cars, customizable rally cars, and scurrying spectators. The world's top rally cars--including Subaru Impreza, Mitsubishi Lancer Evolution 7, Citroen Xsara, and Ford Focus--are included in V-Rally 3. Choose one, and then overcome spectators, deformed car parts, and extreme driving conditions as you race in six real-world locations and various gameplay modes. The life of a professional rally driver is rough--it's up to you to strategize your career and race your way to the top.… Expand"}, {"name": "Marvel vs. Capcom 2", "details_link": "https://www.metacritic.com/game/playstation-2/marvel-vs-capcom-2", "publisher": "Capcom", "release_date": "Nov 18 2002", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 76, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/f019b278939a12788c4a9ae4a0de2f3b-98.jpg", "descriptions": "Rule the arena of the world's two most powerful fighting Universes. Marvel vs. Capcom 2 is bar-none, the most insane tag-team fighting game on the planet! An unprecedented 56 playable characters raises the bar on arcade fighting with 3 on 3 tag-team battles, unbelievable control andRule the arena of the world's two most powerful fighting Universes. Marvel vs. Capcom 2 is bar-none, the most insane tag-team fighting game on the planet! An unprecedented 56 playable characters raises the bar on arcade fighting with 3 on 3 tag-team battles, unbelievable control and hyper-fast animation. Pick a fight with your favorite legendary Capcom characters and Super Heroes from the Marvel Universe and watch the super combos fly. [Capcom]… Expand"}, {"name": "NFL Blitz 20-02", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-blitz-20-02", "publisher": "Midway", "release_date": "Feb  6 2002", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/b6d20b3662807993f84c71265d99c7f2-98.jpg", "descriptions": "New Impact Player option allows the gamer to edit the route/assignment of their Impact player in any play in the team's playbook on the fly. More than 1500 brand new, high-flying catches, game breaking runs and earth-shattering sticks including some animations motion captured withNew Impact Player option allows the gamer to edit the route/assignment of their Impact player in any play in the team's playbook on the fly. More than 1500 brand new, high-flying catches, game breaking runs and earth-shattering sticks including some animations motion captured with professional stuntmen swinging from rigging wires. Utilize with the tried and true NFL Blitz point-n-pass system or icon passing. [Midway]… Expand"}, {"name": "Jade Cocoon 2", "details_link": "https://www.metacritic.com/game/playstation-2/jade-cocoon-2", "publisher": "Ubisoft", "release_date": "Dec 17 2001", "developers": ["Genki"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/7b5743472ac7f6e20cd814d07274f0a7-98.jpg", "descriptions": "Centuries after the first Cocoon Master Levant purified the wicked Forest Minions and freed his village from a sleep curse, this tale tells the story of a new deadly parasite called Kalma. Kahu, a fledgling Cocoon Master, must now brave the four elemental forests and seek the Orbs of CocoonCenturies after the first Cocoon Master Levant purified the wicked Forest Minions and freed his village from a sleep curse, this tale tells the story of a new deadly parasite called Kalma. Kahu, a fledgling Cocoon Master, must now brave the four elemental forests and seek the Orbs of Cocoon Masters past, before Kalma overtakes him and the earth. Within the quest for the four Orbs lies a unique battle system where players can capture hundreds of monsters and train them to become their greatest weapons. Join Kahu and his trusty companion, Nico, on their journey to rid the land of menacing monsters, find the magical Orbs and defeat the deadly Kalma. [Ubi Soft]… Expand"}, {"name": "WWF SmackDown! Just Bring It", "details_link": "https://www.metacritic.com/game/playstation-2/wwf-smackdown!-just-bring-it", "publisher": "THQ", "release_date": "Nov 18 2001", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/2383a891b34f90965cdf7b59408a5f52-98.jpg", "descriptions": "Square off against more than 30 Superstars in 60 different match types. Perform bone-shattering finishers - from The Rock Bottom to The Stone Cold Stunner - as you annihilate opponents with more than a 1,000 different moves. [THQ]"}, {"name": "Myth III: The Wolf Age", "details_link": "https://www.metacritic.com/game/pc/myth-iii-the-wolf-age", "publisher": "G.O.D.", "release_date": "Oct 30 2001", "developers": ["MumboJumbo"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 76, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/0eb3aae8ebc0017d3a9ab48ab6635b87-98.jpg", "descriptions": "Myth III: The Wolf Age takes place 1000 years before the first two Myth games. This prequel is a fully 3D squad-based Real Time Strategy (RTS) fantasy game that follows the life of Connacht the Wolf ? the legendary hero who saved humanity from the Myrkridia and the oppressive Trow toMyth III: The Wolf Age takes place 1000 years before the first two Myth games. This prequel is a fully 3D squad-based Real Time Strategy (RTS) fantasy game that follows the life of Connacht the Wolf ? the legendary hero who saved humanity from the Myrkridia and the oppressive Trow to ultimately become the Emperor of all human lands. To defeat your enemies, you must cast spells, gain experience, collect items, and build ancient devices. [GodGames]… Expand"}, {"name": "Record of Lodoss War", "details_link": "https://www.metacritic.com/game/dreamcast/record-of-lodoss-war", "publisher": "Conspiracy Entertainment", "release_date": "Feb 26 2001", "developers": ["Neverland"], "platforms": "Dreamcast", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/88e5204c050de7a857bb2fac35f1253f-98.jpg", "descriptions": "Experience the world of Record of Lodoss War up close and personal in an epic 3D Action/RPG only for Sega Dreamcast. Take control of a mysterious warrior from the past, resurrected to save the future, on a colossal quest filled with pulse-pounding action and high adventure. Join forces withExperience the world of Record of Lodoss War up close and personal in an epic 3D Action/RPG only for Sega Dreamcast. Take control of a mysterious warrior from the past, resurrected to save the future, on a colossal quest filled with pulse-pounding action and high adventure. Join forces with popular characters from the Lodoss universe and combat hundreds of vicious enemies with dozens of spectacular spells.… Expand"}, {"name": "Speed Devils Online Racing", "details_link": "https://www.metacritic.com/game/dreamcast/speed-devils-online-racing", "publisher": "Ubisoft", "release_date": "Dec 13 2000", "developers": ["Ubisoft Montreal"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/9f628966afbde42536487c165bc29531-98.jpg", "descriptions": "Attention sinners. The most infernal arcade racer ever is now online. All the hellish tracks, tricked out cars, and shady side bets from the original Speed Devils return.\r Blistering New Features: New Cars - 22 (11 new) machines, All original courses online plus new bonus course, SingleAttention sinners. The most infernal arcade racer ever is now online. All the hellish tracks, tricked out cars, and shady side bets from the original Speed Devils return.\r Blistering New Features: New Cars - 22 (11 new) machines, All original courses online plus new bonus course, Single player offline, up to 5-Player online, 22 new ways to gamble your cars and cash. \r\rIntense Online Mayhem. Customize your online persona with quotes and characters. Win your opponents' cars online. Make and take your own insane bets with players nationwide.… Expand"}, {"name": "Rune", "details_link": "https://www.metacritic.com/game/pc/rune", "publisher": "Gathering", "release_date": "Nov  7 2000", "developers": ["Human Head Studios"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/ce364d223a91c31f6eae60da8d9106fb-98.jpg", "descriptions": "A third-person game of action and adventure steeped in Norse mythology and high fantasy. Use your brains and massive brawn to survive as you explore the 3-D game world fighting off creatures from Norse legend and the fertile minds of the Human Head staff with their array of swords, axes, andA third-person game of action and adventure steeped in Norse mythology and high fantasy. Use your brains and massive brawn to survive as you explore the 3-D game world fighting off creatures from Norse legend and the fertile minds of the Human Head staff with their array of swords, axes, and magical devices.  [Gathering of Developers]… Expand"}, {"name": "Age of Booty", "details_link": "https://www.metacritic.com/game/xbox-360/age-of-booty", "publisher": "Capcom", "release_date": "Oct 15 2008", "developers": ["Certain Affinity"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Strategy", "Miscellaneous", "Real-Time", "Party", "General", "Fantasy"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/c133dae45166b619a084c2a3febeedfd-98.jpg", "descriptions": "[Xbox Live Arcade]  Set in the swashbuckling era, Age of Booty is a casual real-time multiplayer strategy game that puts players at the helm of their own pirate ship with the goal of sending your enemies to the briny deep, and looting and capturing towns for your pirate faction. In Age of[Xbox Live Arcade]  Set in the swashbuckling era, Age of Booty is a casual real-time multiplayer strategy game that puts players at the helm of their own pirate ship with the goal of sending your enemies to the briny deep, and looting and capturing towns for your pirate faction. In Age of Booty, players team up with other online players or AI-controlled pirate ships to raid, pillage, sink, and destroy their way to dominance on the high seas. Spoils of war and booty are used to upgrade and customize pirate ships to make them even more deadly as players take on 25 unique challenges and seven of the most devious Pirate Alliances on the high seas. Gain notoriety and fame by climbing the online leader boards. Create and share custom maps using the intuitive map creation system. Single player and multiplayer real-time action strategy from Certain Affinity, lead by Max Hoberman, designer of Halo 2 and 3's multiplayer game. Raid villages, sink merchants, seize towns, steal gold, upgrade your pirate ship and use your guns and your wits to send your foes to the briny deep. Master twenty-five unique multiplayer maps or create your own and share them with your friends. Up to four players on one console, up to eight players over LAN or the Internet. Tons of customizable options that allow you to tune the game to meet your taste. [Capcom]… Expand"}, {"name": "Art Style: light trax", "details_link": "https://www.metacritic.com/game/wii/art-style-light-trax", "publisher": "Nintendo", "release_date": "May 24 2010", "developers": ["Skip Ltd."], "platforms": "Wii", "num_players": "1 Player", "genres": ["Miscellaneous", "General", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e658032126aa42060c2a783f92e7cf63-98.jpg", "descriptions": "[WiiWare]  Art Style: light trax takes racing to whole new (and very surreal) levels as you control a white beam of light moving perpetually forward while your viewpoint shifts between 2-D and 3-D perspectives. Start by choosing one of the two main modes of game play, each with its own[WiiWare]  Art Style: light trax takes racing to whole new (and very surreal) levels as you control a white beam of light moving perpetually forward while your viewpoint shifts between 2-D and 3-D perspectives. Start by choosing one of the two main modes of game play, each with its own distinct goal. In light tours mode, you vie with other light beams for the most points in a three-course racing tour. Watch out for obstacles, use items and strategically use your dash ability to finish first. In freeway mode, your objective is to set a high score by traveling the greatest distance within a set amount of time. Mastering the intricacies of each setting is crucial: you'll have to alternate between them in order to progress through the game and unlock all of its modes. With precise controls packed in and a driving techno soundtrack, Art Style: light trax offers an experience unlike any other. Are you ready to compete in a mind-bending race at the speed of light? Games in the Art Style series feature elegant design, polished graphics and pick-up-and-play controls, creating an experience focused purely on fun and engaging game play.… Expand"}, {"name": "Assetto Corsa Competizione", "details_link": "https://www.metacritic.com/game/xbox-one/assetto-corsa-competizione", "publisher": "505 Games", "release_date": "Jun 23 2020", "developers": ["505 Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 76, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/23b3d11753c342b324c0b8fcd359870a-98.jpg", "descriptions": "Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint,Assetto Corsa Competizione is an extraordinary racing simulation game allowing players to experience the real atmosphere of the GT3 championship, competing against official drivers, teams, cars and circuits reproduced in-game with the highest level of accuracy ever achieved. Sprint, Endurance and Spa 24 Hours races come to life with an incredible level of realism, in both single and multiplayer modes. Born from KUNOS Simulazioni's long-term experience, this racing simulator takes full advantage of Unreal Engine 4 to ensure photorealistic weather conditions and graphics, night races, motion capture animations, reaching a new standard in terms of driving realism and immersion, thanks to its further improved tyre and aerodynamic models.… Expand"}, {"name": "Surviving Mars", "details_link": "https://www.metacritic.com/game/xbox-one/surviving-mars", "publisher": "Paradox Interactive", "release_date": "Mar 15 2018", "developers": ["Haemimont Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/78caecd94bf9da7bbca3c8b9b854fdfa-98.jpg", "descriptions": "Surviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock moreSurviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock more elaborate ways to shape and expand your settlement. Cultivate your own food, mine minerals or just relax by the bar after a hard day's work. Most important of all, though, is keeping your colonists alive. Not an easy task on a strange new planet.There will be challenges to overcome. Execute your strategy and improve your colony's chances of survival while unlocking the mysteries of this alien world. Are you ready? Mars is waiting for you.… Expand"}, {"name": "JYDGE", "details_link": "https://www.metacritic.com/game/playstation-4/jydge", "publisher": "10tons", "release_date": "Oct  3 2017", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/e0bc6e83d07a952910da1eeb9d75b58a-98.jpg", "descriptions": "Build your JYDGE. Enter Edenbyrg. Get out alive.\r JYDGE is a lawful but awful roguehate top-down shooter where you get to build your own cybernetic JYDGE and eradicate crime in the never-sleeping megacity of Edenbyrg. Create your own play-style by augmenting your JYDGE, modifying yourBuild your JYDGE. Enter Edenbyrg. Get out alive.\r JYDGE is a lawful but awful roguehate top-down shooter where you get to build your own cybernetic JYDGE and eradicate crime in the never-sleeping megacity of Edenbyrg. Create your own play-style by augmenting your JYDGE, modifying your Gavel rifle, and choosing companion drones to suit the tasks at hand.\r Will you be stealthy and lurk in shadows? Or will you assault the evildoers head on? Maybe you'll brutally rocket them to bits from a distance? Or perhaps bring your own squad of reckless companions to solve the scenarios?\r You be the JYDGE.… Expand"}, {"name": "Future Unfolding", "details_link": "https://www.metacritic.com/game/pc/future-unfolding", "publisher": "Spaces of Play", "release_date": "Mar 15 2017", "developers": ["Spaces of Play"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/42eb514fb8a68f8afab14f673ad5a994-98.jpg", "descriptions": "Future Unfolding lets you explore a mysterious landscape filled with life. Decipher the surreal logic of its world and open up new areas to discover."}, {"name": "Hero-U: Rogue to Redemption", "details_link": "https://www.metacritic.com/game/switch/hero-u-rogue-to-redemption", "publisher": "Silesia Games", "release_date": "Feb  9 2021", "developers": ["Transolar Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/9ee1143fc0063bc4acc3035f09df724c-98.jpg", "descriptions": "Hero-U: Rogue to Redemption is an epic - and humorous - fantasy adventure and role-playing game in which you take on the role of Shawn O'Conner, a young man striving to become a hero as well as a rogue.Hero-U: Rogue to Redemption is the work of Lori Ann Cole and Corey Cole, creators ofHero-U: Rogue to Redemption is an epic - and humorous - fantasy adventure and role-playing game in which you take on the role of Shawn O'Conner, a young man striving to become a hero as well as a rogue.Hero-U: Rogue to Redemption is the work of Lori Ann Cole and Corey Cole, creators of Quest for Glory, Shannara, Castle of Dr. Brain, and Mixed-Up Fairy Tales. Although Hero-U is not a direct sequel to the Quest for Glory games, it features the same mix of adventure, role-playing, humor, and immersive storytelling that we introduced in that series.Shawn can become the Rogue of the Year while exploring a mysterious castle, making friends and enemies, fighting deadly foes, and uncovering the secrets of his own hidden past. Meanwhile players will enjoy the rich and humorous dialogue and descriptions as they guide Shawn through his adventures.During the day, Shawn attends classes at the University, practices his skills, and tries to make friends with other students. At night, it's time to pull out weapons, armor, and traps to explore the abandoned wine cellars, stunning sea caves, creepy catacombs, and deadly dungeon beneath Hero-U. Most combat is optional for those who prefer a pure adventure game, but there are ample rewards for those who choose to valorously fight the creatures that threaten the school and all of Sardonia.… Expand"}, {"name": "Pode", "details_link": "https://www.metacritic.com/game/switch/pode", "publisher": "Henchman & Goon", "release_date": "Jun 21 2018", "developers": ["Henchman & Goon"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/799a469e5b21c7774d9be91e24177017-98.jpg", "descriptions": "Pode is a co-op puzzle exploration game about a rock and a fallen star working together to solve ancient puzzles in a stunning environment inspired by Norwegian art and culture."}, {"name": "Story of Seasons", "details_link": "https://www.metacritic.com/game/3ds/story-of-seasons", "publisher": "XSEED Games", "release_date": "Mar 31 2015", "developers": ["Marvelous AQL"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Breeding/Constructing", "Strategy", "General"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/fc7f5fbddf142acc8bcc68327482ed98-98.jpg", "descriptions": "Story of Seasons is the start of a new chapter in the ‘Bokujo Monogatari’ series, a long-standing farming/life simulation franchise. Though the series is reborn with a new name, it continues the traditions of customizable farms, animal care, marriage and child-rearing. After creating aStory of Seasons is the start of a new chapter in the ‘Bokujo Monogatari’ series, a long-standing farming/life simulation franchise. Though the series is reborn with a new name, it continues the traditions of customizable farms, animal care, marriage and child-rearing. After creating a customized character, players can live out a new life by cultivating their favorite fruits and vegetables while expanding and filling their farm with their choice of animals.… Expand"}, {"name": "Chorus", "details_link": "https://www.metacritic.com/game/pc/chorus", "publisher": "Deep Silver", "release_date": "Dec  3 2021", "developers": ["Fishlabs", "Deep Silver Fishlabs"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Simulation", "Space", "Combat"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/498940144c0359b25b30ab3bf7437d62-98.jpg", "descriptions": "Take control of Nara, once the Circle's deadliest warrior, now their most wanted fugitive, on a quest to destroy the dark cult that created her. Unlock devastating weapons and mind-bending abilities in a true evolution of the space-combat shooter. Along with Forsaken, her sentientTake control of Nara, once the Circle's deadliest warrior, now their most wanted fugitive, on a quest to destroy the dark cult that created her. Unlock devastating weapons and mind-bending abilities in a true evolution of the space-combat shooter. Along with Forsaken, her sentient starfighter, explore ancient temples, engage in exhilarating zero-g combat, and venture beyond our waking reality.\r Features:\r * A JOURNEY OF REDEMPTION -- Lead Nara, an ace pilot facing her haunted past, and Forsaken, her sentient ship. Their quest for redemption will take them across the galaxy and beyond the boundaries of reality, as they fight to unite resistance forces against the Circle and their leader, the Great Prophet, at all costs.\r * VENTURE BEYOND THE VOID -- Enter a dark new universe, teeming with mystery and rife with conflict. Explore epic locations such as sprawling space stations and strange planes of existence beyond our own. Engage in exhilarating zero-g dogfights from epic cosmic vistas to tight crystalline corridors. Chorus balances the scale and spectacle of space exploration with frenetic, fast-paced action.\r * ONE PILOT, ONE SHIP, ONE LIVING WEAPON -- Attain powerful and distinct weapons and combat upgrades. Master your ship's unique drift mechanic and deadly mind-bending abilities, including extra-sensory perception, teleportation and telekinesis, to overcome massive hordes of enemies and take down titanic battleships. Chain your powers together to become the ultimate living weapon.… Expand"}, {"name": "Destroy All Humans!", "details_link": "https://www.metacritic.com/game/xbox/destroy-all-humans!", "publisher": "THQ", "release_date": "Jun 21 2005", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Stadia", "Switch", "Xbox 360", "Xbox One", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/4dad5f35658a05d987fa453436acc4a9-98.jpg", "descriptions": "This is your chance to experience the other side of an alien invasion. In Destroy All Humans!, you play as an alien who must use a UFO, advanced weaponry, and special abilities to take over all of humanity. You'll terrorize the people of Earth with a variety of alien weaponry--the IonThis is your chance to experience the other side of an alien invasion. In Destroy All Humans!, you play as an alien who must use a UFO, advanced weaponry, and special abilities to take over all of humanity. You'll terrorize the people of Earth with a variety of alien weaponry--the Ion Detonator, the Zap-O-Matic, and the Sonic Boom, or even the Quantum Deconstructor--on land or in the air. … Expand"}, {"name": "Pac-Man 99", "details_link": "https://www.metacritic.com/game/switch/pac-man-99", "publisher": "Bandai Namco Games", "release_date": "Apr  7 2021", "developers": ["Bandai Namco Games"], "platforms": "Switch", "num_players": "Up to more than 64 ", "genres": ["Action", "Arcade"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/d48c1a9b614c56b4ca92e65359639410-98.jpg", "descriptions": "40 years after the classic Pac-phenomenon rocked the gaming world, PAC-MAN is back in a new 99-man battle royale. Get back in the maze and chase down the iconic ghosts. Who will be the last PAC-MAN standing?"}, {"name": "Aliens: Infestation", "details_link": "https://www.metacritic.com/game/ds/aliens-infestation", "publisher": "Sega", "release_date": "Oct 11 2011", "developers": ["Gearbox Software", "WayForward"], "platforms": "DS", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/6cdea006f6254a846a34dc537f9f90fa-98.jpg", "descriptions": "Aliens: Infestation is a sci-fi action platformer for the Nintendo DS."}, {"name": "PGA Tour 2K23", "details_link": "https://www.metacritic.com/game/playstation-5/pga-tour-2k23", "publisher": "2K Games", "release_date": "Oct 11 2022", "developers": ["Take-Two Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Golf", "Sim"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/86ebe4c03f2eb0045edd065b1b01e8b3-98.jpg", "descriptions": "Tiger Woods leads a roster of more than 14 male and female pros at launch, including Justin Thomas, Lexi Thompson, Tony Finau, Lydia Ko, Collin Morikawa, Will Zalatoris, Brooke Henderson and more. Players can step into the tee box as one of the pros in Exhibition, multiplayer and Divot DerbyTiger Woods leads a roster of more than 14 male and female pros at launch, including Justin Thomas, Lexi Thompson, Tony Finau, Lydia Ko, Collin Morikawa, Will Zalatoris, Brooke Henderson and more. Players can step into the tee box as one of the pros in Exhibition, multiplayer and Divot Derby play, or go head-to-head with them in a battle to climb the leaderboard and claim the FedExCup in PGA TOUR MyCAREER mode. In addition to the pros, the broadcast-style presentation and commentary team of Rich Beem and Luke Elvy also return, with the addition of English golf pro and broadcaster Henni Koyack. PGA TOUR 2K23 includes 20 licensed courses at launch. New additions include the South Course of Wilmington Country Club, The Renaissance Club, St. George’s Golf and Country Club and more. The industry-leading Course Designer also returns, offering players the opportunity to build their dream courses and share them with a global online community. MyPLAYER personalization returns and players can equip their MyPLAYERS just like Tiger with Nike Golf, TaylorMade and Bridgestone Golf apparel and gear. Even more apparel options are available from licensed brands, including Callaway Golf, FootJoy, Malbon Golf, Nike Golf, PUMA, Titleist, TravisMathew and more***. Clubs and balls from brands including Bridgestone Golf, Callaway Golf, COBRA, Mizuno, Odyssey Golf, Scotty Cameron, TaylorMade, Titleist and Wilson are available to deck out players’ golf bags and keep them swinging with swag. In addition to the returning analog stick swing, a three-click swing option is also available for an added level of customization so players can play the way they like. [PGA Tour]\r PGA TOUR 2K23 offers new casual modes to help rookies get into the game, while giving seasoned players new challenges and opportunities to work on their skills. The introduction of Topgolf offers a unique experience emulating the popular golf entertainment phenomenon, where players can aim for targets and try to earn the highest score. Training mode offers multiple ways to develop skills, including swing calibration, lessons, chipping practice, a driving range and a putting green.… Expand"}, {"name": "Call of Duty: Black Ops Cold War", "details_link": "https://www.metacritic.com/game/playstation-5/call-of-duty-black-ops-cold-war", "publisher": "Activision", "release_date": "Nov 13 2020", "developers": ["Raven Software", "Treyarch"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/c78940a77e39c5f55f7be9e3a1b2cc83-98.jpg", "descriptions": "Black Ops Cold War will drop fans into the depths of the Cold War's volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globeBlack Ops Cold War will drop fans into the depths of the Cold War's volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globe through iconic locales like East Berlin, Vietnam, Turkey, Soviet KGB headquarters, and more.\r MULTIPLAYER\rEngage in deniable operations and signature combat in the next generation of Multiplayer.\r ZOMBIES\rPlayers will bring a Cold War arsenal of weapons and equipment into the next evolution of Treyarch's signature Zombies co-operative experience. \r\rWARZONE\rBlack Ops Cold War will also support and build on the hit, free-to-play experience Call of Duty: Warzone. \r\rCross Play, Cross-Progression and Cross-Generation Enabled. \r\rNEXT-GEN\rUnlock the power of next-gen Call of Duty experiences with higher framerate, hardware-based ray-tracing, shorter load times and more.… Expand"}, {"name": "Evolve", "details_link": "https://www.metacritic.com/game/playstation-4/evolve", "publisher": "2K Games", "release_date": "Feb 10 2015", "developers": ["Turtle Rock Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/4f3e3062339c0db958257f51b20d2927-98.jpg", "descriptions": "In a savage world of man against nature, will you the hunter or the hunted? The hammer or the nail? The creators of Left 4 Dead, Turtle Rock Studios, bring you EVOLVE, an evolution of multiplayer shooters in which four hunters face off against a single, player-controlled monster. Stalk yourIn a savage world of man against nature, will you the hunter or the hunted? The hammer or the nail? The creators of Left 4 Dead, Turtle Rock Studios, bring you EVOLVE, an evolution of multiplayer shooters in which four hunters face off against a single, player-controlled monster. Stalk your prey, execute your attack and prove you are the apex predator in 4-versus-1 bouts.… Expand"}]