[{"name": "Shining Force: Resurrection of the Dark Dragon", "details_link": "https://www.metacritic.com/game/game-boy-advance/shining-force-resurrection-of-the-dark-dragon", "publisher": "Atlus Co.", "release_date": "Jun  8 2004", "developers": ["Amusement Vision"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 77, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/adbea51fc0e3b8b6007dc0c963ab2e2c-98.jpg", "descriptions": "Darksol, a mysterious traveler, plans to resurrect a dangerous creature, the Dark Dragon, to invade the kingdom of Guardiana. In Shining Force: Dark Resurrection, you play the part of a young warrior who was washed ashore in Guardiana, and you remember nothing from your past. Now, you mustDarksol, a mysterious traveler, plans to resurrect a dangerous creature, the Dark Dragon, to invade the kingdom of Guardiana. In Shining Force: Dark Resurrection, you play the part of a young warrior who was washed ashore in Guardiana, and you remember nothing from your past. Now, you must become a leader and control a band of up to 12 characters on the battlefield as you fight to save Guardiana from the forces of evil. On your journey, you'll discover a wide array of weapons, armor, and powerful magic spells.… Expand"}, {"name": "Tiger Woods PGA Tour 14", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-14", "publisher": "EA Sports", "release_date": "Mar 26 2013", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/3718e543a930732c969705f8b57783f9-98.jpg", "descriptions": "Travel back in time and walk onto the course with Arnold Palmer, Jack Nicklaus, Gary Player, and other legends in their prime. Overtake each star on the biggest stages in the world of golf using equipment and wearing clothing from that bygone era. Eclipse their legacies and cement your seatTravel back in time and walk onto the course with Arnold Palmer, Jack Nicklaus, Gary Player, and other legends in their prime. Overtake each star on the biggest stages in the world of golf using equipment and wearing clothing from that bygone era. Eclipse their legacies and cement your seat at the table of legends. Then play golf at night, with illuminated golf balls, or join up with friends and form the ultimate \"twenty-foursome\" for an authentic golf experience with Tiger Woods PGA TOUR 14.… Expand"}, {"name": "Guitar Hero: Warriors of Rock", "details_link": "https://www.metacritic.com/game/wii/guitar-hero-warriors-of-rock", "publisher": "Activision", "release_date": "Sep 28 2010", "developers": ["Vicarious Visions", "Neversoft Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music", "Music"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/18631d89125fffcad4751ce35ee53da3-98.jpg", "descriptions": "KISS frontman Gene Simmons provides the voice for the next installment in Activision's long-running rhythm-game series."}, {"name": "Stranglehold", "details_link": "https://www.metacritic.com/game/pc/stranglehold", "publisher": "Midway", "release_date": "Sep 18 2007", "developers": ["Midway"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/1d5c035a63e08ff20d59dc049934e5ca-98.jpg", "descriptions": "Acclaimed action director John Woo presents Stranglehold, a stunning 3rd-person action adventure videogame and \"spiritual sequel\" to Woo's action masterpiece \"Hard Boiled.\" Stranglehold redefines the action gaming experience with its acrobatic gunplay, thrilling cinematography, freneticAcclaimed action director John Woo presents Stranglehold, a stunning 3rd-person action adventure videogame and \"spiritual sequel\" to Woo's action masterpiece \"Hard Boiled.\" Stranglehold redefines the action gaming experience with its acrobatic gunplay, thrilling cinematography, frenetic combat and incredible Massive Destructibility (Massive D). Chow Yun-Fat reprises his signature role as Inspector Tequila, pitting gamers as a take no-prisoners cop waging a personal war with Hong Kong crime lords. Tequila's loyalties to the force are tested when his ex-wife is kidnapped by the Russian mob in Chicago. Tequila struggles to balance his duty to uphold the law with doing what it takes to save his family.  [Midway]… Expand"}, {"name": "Guilty Gear Judgment", "details_link": "https://www.metacritic.com/game/psp/guilty-gear-judgment", "publisher": "Majesco Games", "release_date": "Sep  5 2006", "developers": ["Arc System Works"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Beat-'Em-Up", "Fighting", "2D", "2D"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/bcfc8060dd4306eaff08452b92aa86a3-98.jpg", "descriptions": "(Also known as \"Guilty Gear X2 # Reload\"  It has been a week since the world has heard from the small Eastern European kingdom of Villtania. As scattered reports from the Villtanian refugees who have fled the country dribble in, the world is hearing a horror-filled tale of devastation by(Also known as \"Guilty Gear X2 # Reload\"  It has been a week since the world has heard from the small Eastern European kingdom of Villtania. As scattered reports from the Villtanian refugees who have fled the country dribble in, the world is hearing a horror-filled tale of devastation by monsters and biogeocenosis experiments summoned for war and world domination by Villtania's leading scholar, and self-described sorcerer, Raimond. The once beautiful Villtanian countryside now runs red with the blood of its people. The United Nations have declared an international emergency and while unable to commit any of the world's armies to this strange, supernatural conflict, they have offered a huge reward to any hot-shot mercenaries or hunters brave enough to take on theses monsters from another dimension and restore order to Villtania. Warriors from around the world, some for the sake of justice, others for money, have stood up and gathered in the Villtanian battle field. Now, a new war has begun.… Expand"}, {"name": "Law & Order: Justice Is Served", "details_link": "https://www.metacritic.com/game/pc/law-order-justice-is-served", "publisher": "Legacy Interactive", "release_date": "Oct  5 2004", "developers": ["Legacy Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Modern"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/34c03a955d808914ac818cf47458b3f2-98.jpg", "descriptions": "In Law & Order: Justice is Served, players are assigned to a murder case involving twenty-year-old tennis sensation, Elena Kusarova, whose body was discovered the day before the start of the U.S. Open. Players will need to search the crime scene, analyze evidence, solve puzzles, interrogateIn Law & Order: Justice is Served, players are assigned to a murder case involving twenty-year-old tennis sensation, Elena Kusarova, whose body was discovered the day before the start of the U.S. Open. Players will need to search the crime scene, analyze evidence, solve puzzles, interrogate suspects and make arrests alongside Detectives Lennie Briscoe and Ed Green. After a suspect is in custody, the player will need to put a compelling case together with A.D.A. Serena Southerlyn in order to convince the jury to return a guilty verdict. New features for this third installment in the Law & Order game franchise include a new character from the TV show, Detective Ed Green; a re-designed, more intuitive interface; increased interactivity and flexibility with more characters and locations; improved performance; and unlockable bonus content from the actors on the show. With many more interviews and clever puzzles seamlessly integrated into the storyline, this third installment promises to be an even longer, more fulfilling gameplaying experience than the previous versions. [Legacy Interactive]… Expand"}, {"name": "Remothered: Tormented Fathers", "details_link": "https://www.metacritic.com/game/pc/remothered-tormented-fathers", "publisher": "Stormind Games", "release_date": "Jan 30 2018", "developers": ["Stormind Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/7534a891cad090cab200f8b2ed909ccc-98.jpg", "descriptions": "Remothered: Tormented Fathers is the pure and realistic survival horror videogame."}, {"name": "Plants vs. Zombies", "details_link": "https://www.metacritic.com/game/playstation-vita/plants-vs-zombies", "publisher": "PopCap", "release_date": "Feb 21 2012", "developers": ["PopCap"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "General", "General", "Fantasy", "Defense"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/85d606293b066fd1b38728981749a53b-98.jpg", "descriptions": "Now you can zap zombies on the go in PopCap's award-winning game! Enjoy thrilling new minigames, take on a friend in Versus mode, and make your own zombie with the Zombatar! Plus, you'll get all the fun of the original hit game: Fight the fun-dead with your arsenal of plants through day,Now you can zap zombies on the go in PopCap's award-winning game! Enjoy thrilling new minigames, take on a friend in Versus mode, and make your own zombie with the Zombatar! Plus, you'll get all the fun of the original hit game: Fight the fun-dead with your arsenal of plants through day, night, fog, in the swimming pool and on the roof. It's a powerful, portable new way to play Plants vs. Zombies. The fun never dies! … Expand"}, {"name": "Jurassic World Evolution 2", "details_link": "https://www.metacritic.com/game/pc/jurassic-world-evolution-2", "publisher": "Frontier Developments", "release_date": "Nov  9 2021", "developers": ["Frontier Developments"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/c18650290bb1f2f82c0ab8bae7dbbbc6-98.jpg", "descriptions": "Jurassic World Evolution 2 is the sequel to Frontier’s Jurassic World Evolution, building upon the 2018 management simulation. It introduces a compelling, new narrative campaign, incredible new features, and awe-inspiring new dinosaurs brought to life with captivating authenticity. TogetherJurassic World Evolution 2 is the sequel to Frontier’s Jurassic World Evolution, building upon the 2018 management simulation. It introduces a compelling, new narrative campaign, incredible new features, and awe-inspiring new dinosaurs brought to life with captivating authenticity. Together with expanded construction and more customisation options, the result is an even bigger, better and authentic Jurassic World game.  \rFEATURES\r An Original Jurassic Story\rImmerse yourself in a compelling and original Jurassic World narrative set after the Earth-shattering events of Jurassic World: Fallen Kingdom. Lead efforts to control, conserve and contain dinosaurs as you work alongside iconic characters from the films, including Dr. Ian Malcolm (Jeff Goldblum) and Claire Dearing (Bryce Dallas Howard). \r\rCreate your own Jurassic World\rTake control with deeper management tools and creative options. Construct and customise new buildings and flex your managerial muscle across never-before-seen locations ranging from dense forests to rocky deserts. Rescue and bioengineer more than 75 prehistoric species, including highly requested flying and marine reptiles , and watch them seek territory, fight and interact with staggering realism. \r\rPlay with Chaos Theory\rChaos Theory mode lets you play through key moments of your favourite films - with a twist. Experience \"what-if\" scenarios from iconic Jurassic World and Jurassic Park films, with each level set across eras and locations from all five movies. Immerse yourself at the heart of the Jurassic World franchise and see how things turn out when you are put at the helm of managing new challenges with unpredictable outcomes. … Expand"}, {"name": "The Big Con", "details_link": "https://www.metacritic.com/game/pc/the-big-con", "publisher": "Skybound Games", "release_date": "Aug 31 2021", "developers": ["Mighty Yell"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/69f58674b151813e930183b6656f5aed-98.jpg", "descriptions": "Hustle through the 90s in THE BIG CON, an adventure game where you're an awkward teen hustling to save her family video store from gangsters. Play as Ali, a high school junior gone AWOL from band camp to seek revenge on the loan sharks that threaten her mom's video store. (Fighting with yourHustle through the 90s in THE BIG CON, an adventure game where you're an awkward teen hustling to save her family video store from gangsters. Play as Ali, a high school junior gone AWOL from band camp to seek revenge on the loan sharks that threaten her mom's video store. (Fighting with your mom is YOUR job. No one else gets to do that.) Maybe you'll profit from the latest collectible plushie craze, and make an interesting friend or two along the way.… Expand"}, {"name": "Warhammer 40,000: Dawn of War III", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-dawn-of-war-iii", "publisher": "SegaSoft", "release_date": "Apr 27 2017", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Strategy", "Real-Time", "General"], "meta_score": 77, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/2/fb16b0030a611f9722048d05d6862b82-98.jpg", "descriptions": "Jump into a brutal battle between three warring factions In Dawn of War III. You will have no choice but to face your foes when a catastrophic weapon is found on the mysterious world of Acheron."}, {"name": "Cognition: An Erica Reed Thriller Episode 3 - The Oracle", "details_link": "https://www.metacritic.com/game/pc/cognition-an-erica-reed-thriller-episode-3---the-oracle", "publisher": "Phoenix Online Studios", "release_date": "Jun 30 2013", "developers": ["Phoenix Online Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/83d6d680512ddf4f1fefe39acf6bc8a9-98.jpg", "descriptions": "When a trail of clues - and bodies - lead Erica to the luxurious Enthon Towers, her post-cognitive powers leave her unable to escape the dark betrayals in its past. The shocking truth about the Oracle's identity is revealed, along with the killer's connection to Erica's own tragic past. NoWhen a trail of clues - and bodies - lead Erica to the luxurious Enthon Towers, her post-cognitive powers leave her unable to escape the dark betrayals in its past. The shocking truth about the Oracle's identity is revealed, along with the killer's connection to Erica's own tragic past. No longer sure who she can trust, if anyone, Erica is determined to find the truth, no matter what the cost.Jump into the penultimate chapter of Cognition: An Erica Reed Thriller, where you get to play not only as Erica, but also step into the shoes of the mysterious Oracle!… Expand"}, {"name": "Overcooked!: Special Edition", "details_link": "https://www.metacritic.com/game/switch/overcooked!-special-edition", "publisher": "Team17", "release_date": "Jul 27 2017", "developers": ["Team17"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Action", "Arcade"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/a480a4a1b5e3c7483e6406d88c1071a5-98.jpg", "descriptions": "Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff. Sharpen your knives and dust off your chefs whites, there isntOvercooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff. Sharpen your knives and dust off your chefs whites, there isnt mushroom for error and the steaks are high in these crazy kitchens! \r\rThe Onion Kingdom is in danger and only the finest cooking can save it! In Overcooked players must journey through a variety of cruel and unusual kitchens on their quest to become master chefs capable of conquering an ancient edible evil which plagues the land.\r Play solo or engage in classic, chaotic couch co-op for up to four players in both co-operative and competitive challenge modes. Youll have to cook a range of different dishes and work together in order to become the most effective and ultimate team!… Expand"}, {"name": "Borderlands 3: Bounty of Blood", "details_link": "https://www.metacritic.com/game/pc/borderlands-3-bounty-of-blood", "publisher": "Gearbox Publishing", "release_date": "Jun 25 2020", "developers": ["Gearbox Software"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/413690887b59079b36590a6e5d4405df-98.jpg", "descriptions": "Mount your new weaponized Jetbeast vehicle and keep an eye out for local flora and other environmental features that can give you an edge in combat and expand your explorational pursuits. Traitorweeds that charm enemies and Breezeblooms that boost you into the air are just a couple ofMount your new weaponized Jetbeast vehicle and keep an eye out for local flora and other environmental features that can give you an edge in combat and expand your explorational pursuits. Traitorweeds that charm enemies and Breezeblooms that boost you into the air are just a couple of examples. Once a long-gone company's testing ground for weaponry and biological experiments, the dusty wastes of Gehenna are now lorded over by genetically modified beasts and their keepers, the vicious Devil Riders gang.  If you're eager to travel to Gehenna and hunt the Devil Riders but not far enough into the Borderlands 3 story to use Sanctuary III, level-boost straight to campaign add-on content when creating a new Vault Hunter so you can head there right away. Enemies and loot on the all-new frontier planet will scale to your Vault Hunter's level, so you'll be suitably challenged and rewarded as you explore the dusty wastes and cut canyons in search of your quarry. As you complete new story and side missions on Gehenna, your actions will have a tangible and lasting impact on the locals' livelihoods and on the town of Vestige itself. Help out the Vestige townsfolks and the Sheriff's bounty won't the only reward you collect. Expect new Legendary items, Vault Hunter Heads, Vehicle Skins, Interactive Room Decorations, and more.… Expand"}, {"name": "The Keep", "details_link": "https://www.metacritic.com/game/3ds/the-keep", "publisher": "Cinemax", "release_date": "Sep 11 2014", "developers": ["Cinemax"], "platforms": ["PC", "Switch", "3DS"], "genres": ["Role-Playing", "First-Person", "Western-Style"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/3a86e0865106b946680161062b71f96a-98.jpg", "descriptions": "First-person dungeon crawler. Real-time combat. Rune magic. Fire, Ice and Lightning.\r Enter the Keep as an unsung hero on a quest to destroy the nefarious wizard Watrys. Explore the subterranean depths in this first-person dungeon crawler featuring real-time combat, a unique rune magicFirst-person dungeon crawler. Real-time combat. Rune magic. Fire, Ice and Lightning.\r Enter the Keep as an unsung hero on a quest to destroy the nefarious wizard Watrys. Explore the subterranean depths in this first-person dungeon crawler featuring real-time combat, a unique rune magic system, exploration, and puzzle solving. This game will awaken memories of what made old-school RPG dungeons so much fun to play while you fight, hunt for hidden treasures, and avoid deadly traps. Get to know your enemies, find their weaknesses, and crush them. Experiment with magic to discover powerful spells. Only the strongest will survive.\r To defeat the seemingly undefeatable Watrys, you will need to level up your character and find powerful armor and weapons. The game controls were designed with a stylus in mind so mastering both sword and magic is a fun and intuitive experience.\r Do you have what it takes to stand against such evil? Then dont procrastinate and enter. The Keep awaits you...… Expand"}, {"name": "F.E.A.R. 2: Project Origin", "details_link": "https://www.metacritic.com/game/xbox-360/fear-2-project-origin", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb 10 2009", "developers": ["Monolith Productions"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/92a3acc815d778e09450b3c29637e425-98.jpg", "descriptions": "The sequel to F.E.A.R. continues the original game's spine-tingling supernatural suspense story of an escalating paranormal crisis that threatens to destroy a major American city. At the center of the calamity is the mysterious Alma, whose rage against those who wronged her triggered a chainThe sequel to F.E.A.R. continues the original game's spine-tingling supernatural suspense story of an escalating paranormal crisis that threatens to destroy a major American city. At the center of the calamity is the mysterious Alma, whose rage against those who wronged her triggered a chain of events that have spiraled completely out of control. Now that she has free reign, the consequences will be unimaginable. [Warner Bros.]… Expand"}, {"name": "LEGO Star Wars", "details_link": "https://www.metacritic.com/game/pc/lego-star-wars", "publisher": "Eidos Interactive", "release_date": "Apr  2 2005", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/6f1b6b4325eb8b0a0c9a4358aec32559-98.jpg", "descriptions": "LEGO Star Wars combines two childhood favourites, LEGO and Star Wars, to create an innovative and exciting action-adventure title designed for young gamers. The game is based on \"The Phantom Menace,\" \"Attack of the Clones\" and the eagerly awaited \"Star Wars: Episode III Revenge of the Sith.\"LEGO Star Wars combines two childhood favourites, LEGO and Star Wars, to create an innovative and exciting action-adventure title designed for young gamers. The game is based on \"The Phantom Menace,\" \"Attack of the Clones\" and the eagerly awaited \"Star Wars: Episode III Revenge of the Sith.\" Blending the unique world of designs of LEGO toys with the unforgettable characters of the prequel eras of the Star Wars universe, LEGO Star Wars will offer dynamic vehicles, environments and characters to young players, who will be able to live all of the adventures of the most memorable and exciting scenes from the Star Wars films. [Eidos Interactive]… Expand"}, {"name": "The Sims Medieval", "details_link": "https://www.metacritic.com/game/pc/the-sims-medieval", "publisher": "Electronic Arts", "release_date": "Mar 22 2011", "developers": ["The Sims Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "General", "Virtual", "Virtual Life"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/1f7c6009a63e2b5fe2ccb4cebe9642f7-98.jpg", "descriptions": "The Sims Medieval offers players a chance to build up a medieval kingdom, controlling characters from all walks of life, from Kings and Queens, to Knights and Wizards, Blacksmiths and Bards. It provides a host of storytelling possibilities in the form of quests, from crafting a legendaryThe Sims Medieval offers players a chance to build up a medieval kingdom, controlling characters from all walks of life, from Kings and Queens, to Knights and Wizards, Blacksmiths and Bards. It provides a host of storytelling possibilities in the form of quests, from crafting a legendary sword to arranging a royal wedding, to protecting the kingdom from an evil sorcerer, to finding the fountain of youth. Every quest plays out differently depending on which Hero Sim the player is controlling.… Expand"}, {"name": "Dying Light 2 Stay Human", "details_link": "https://www.metacritic.com/game/xbox-series-x/dying-light-2-stay-human", "publisher": "Techland", "release_date": "Feb  4 2022", "developers": ["Techland", "Warner Bros. Interactive Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 77, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/3e7c01fa37ca7e486dc4b49f1e879d86-98.jpg", "descriptions": "THE FATE OF THE CITY IS IN YOUR HANDS It's been 15 years since humanity lost to the virus. The last great human settlement exists within an unforgiving, infected world, plunged into a modern dark age. During the day, bandits, factions and starving survivors roam the streets scavenging forTHE FATE OF THE CITY IS IN YOUR HANDS It's been 15 years since humanity lost to the virus. The last great human settlement exists within an unforgiving, infected world, plunged into a modern dark age. During the day, bandits, factions and starving survivors roam the streets scavenging for scraps - or someone to take them from, by violence if necessary. At night the infected roam free, evacuating their dark hideouts to prey on the living. You are Aiden Caldwell, an infected survivor. Your exceptional agility and brutal combat skills make you a powerful ally and a valuable commodity in this dangerous world. You can achieve things no one else can. Enter places no one else dares. With your unique abilities you have the power to be an agent of change within this decaying metropolis.\r YOUR CHOICES, YOUR WORLD\rYou must make tough decisions and hard sacrifices as you decide the fate of a society on the brink of collapse. The effect of the choices you make will have a huge impact on entire regions of the city, uncovering new land masses and areas to explore. Play the entire campaign in up to four-player co-op. Host your own games or join other players' and see how their choices have played out differently to your own.\r EXCEPTIONAL AGILITY AND BRUTAL COMBAT\rOn your journey from humble beginnings to a person of great power, you have unprecedented freedom of movement across the city, seamlessly integrated with brutal first person combat.\r A MODERN DARK AGE\rIn a desperate city, where resources and power are scarce, unstable, and trust in ruling bodies is all but eroded; humankind has reverted to a dark age. Civilization is gone but the relics are still there. This is a violent, primal & unforgiving world - and so are its inhabitants.\r THE INFECTION HAS EVOLVED\rThe infection has evolved and become more sensitive to UV light. Society exists in the relative safety of sunlight, while the infected hide in the shadows of buildings. At night the infected roam the streets freely searching for prey, presenting opportunities for you to explore areas of the city inaccessible by day.… Expand"}, {"name": "TERA", "details_link": "https://www.metacritic.com/game/pc/tera", "publisher": "En Masse Entertainment", "release_date": "May  1 2012", "developers": ["Bluehole Studio"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/53f857c0dd7ceb796fcaecf25cfd3883-98.jpg", "descriptions": "TERA elevates the fight beyond whack-a-mole monotony with imprved aiming, dodging, and tactical timing to create intense and rewarding combat. Unlike other MMOs, you can use your controller or keyboard and mouse to control the action like never before. With all the depth you expect from aTERA elevates the fight beyond whack-a-mole monotony with imprved aiming, dodging, and tactical timing to create intense and rewarding combat. Unlike other MMOs, you can use your controller or keyboard and mouse to control the action like never before. With all the depth you expect from a traditional MMO, plus the intense gratification of action combat, TERA promises to change all the rules. … Expand"}, {"name": "Solar Ash", "details_link": "https://www.metacritic.com/game/playstation-5/solar-ash", "publisher": "Annapurna Interactive", "release_date": "Dec  2 2021", "developers": ["Heart Machine"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/662b37e5a3877467d40e5ecd13273c28-98.jpg", "descriptions": "Solar Ash is the second game from Heart Machine, the creators of the award winning 2016 game Hyper Light Drifter. Journey through a surreal, vivid and highly stylized world filled with mystery, wild high-speed traversal, endearing characters, and massive enemy encounters."}, {"name": "LISA", "details_link": "https://www.metacritic.com/game/pc/lisa", "publisher": "Dingaling", "release_date": "Dec 15 2014", "developers": ["Dingaling"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/49a5dddcb9609bfd8faed60a5fb9a119-98.jpg", "descriptions": "The miserable journey of a broken man..."}, {"name": "Risk of Rain", "details_link": "https://www.metacritic.com/game/pc/risk-of-rain", "publisher": "Chucklefish", "release_date": "Nov  8 2013", "developers": ["Chucklefish", "Hopoo Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "genres": ["General", "General", "Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/93617f7b478b30e670d83a71921b96fc-98.jpg", "descriptions": "Risk of Rain is an action platformer with roguelike elements. With permanent death as a primary feature, players will have to play their best to get as far as possible. Fight on a mysterious planet with randomly spawning enemies and bosses, either alone or with 3 friends in online co-op."}, {"name": "Hamilton's Great Adventure", "details_link": "https://www.metacritic.com/game/pc/hamiltons-great-adventure", "publisher": "Fatshark AB", "release_date": "May 31 2011", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/2c95a68299ab6f1e18d979b5f7653465-98.jpg", "descriptions": "Hamilton’s Great Adventure will introduce Ernest Hamilton, the great explorer, and his friendly bird Sasha, on their quest that will remain secret to not spoil the story."}, {"name": "Garou: Mark of the Wolves", "details_link": "https://www.metacritic.com/game/xbox-360/garou-mark-of-the-wolves", "publisher": "SNK Playmore", "release_date": "Jun 24 2009", "developers": ["SNK Playmore"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "General", "Fighting", "Fighting", "2D", "2D"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/40023d3b827e1e553311ed82a9fda6bc-98.jpg", "descriptions": "[Xbox Live Arcade; also known as \"Fatal Fury Garou: Mark of the Wolves\"]  The legend grows as this classic descendant of Fatal Fury arrives on Xbox LIVE Arcade. It's been 10 years since the death of Geese Howard. However, Howard's immense martial arts skills have been passed to his son,[Xbox Live Arcade; also known as \"Fatal Fury Garou: Mark of the Wolves\"]  The legend grows as this classic descendant of Fatal Fury arrives on Xbox LIVE Arcade. It's been 10 years since the death of Geese Howard. However, Howard's immense martial arts skills have been passed to his son, Rock. The new hero is joined by a cast of 12 new characters plus one returning fighter, Terry Bogard, for this tournament of champions. Representing the world's best, the maulers gather once again to crown the \"King of Fighters.\" Garou: Mark Of The Wolves improves on the Fatal Fury system by adding three new battle formats, creating fights more furious than before. [SNK Playmore]… Expand"}, {"name": "WWE 2K19", "details_link": "https://www.metacritic.com/game/xbox-one/wwe-2k19", "publisher": "2K Games", "release_date": "Oct  5 2018", "developers": ["Yuke's", "Visual Concepts"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 77, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/7d45a7a161bbb769c0c19e7b7d9f8d7d-98.jpg", "descriptions": "WWE 2K19 arrives as the latest entry to the flagship WWE video game franchise and features cover Superstar AJ Styles. WWE 2K19 will showcase a massive roster of popular WWE Superstars, Legends and Hall of Famers, as well as NXT favorites. Experience authentic WWE gameplay, extensive creationWWE 2K19 arrives as the latest entry to the flagship WWE video game franchise and features cover Superstar AJ Styles. WWE 2K19 will showcase a massive roster of popular WWE Superstars, Legends and Hall of Famers, as well as NXT favorites. Experience authentic WWE gameplay, extensive creation options, engaging match types, fan-favorite modes and much more!… Expand"}, {"name": "Magic: The Gathering - Duels of the Planeswalkers 2013", "details_link": "https://www.metacritic.com/game/pc/magic-the-gathering---duels-of-the-planeswalkers-2013", "publisher": "Wizards of the Coast", "release_date": "Jun 20 2012", "developers": ["Stainless Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/32dccef63d266e1777d787f40c3baa9a-98.jpg", "descriptions": "Face a stiffer challenge in this version of the franchise. Play with friends or the AI, take on new encounters and opponents, and face up to 3 other players in the Planechase multiplayer format. Featuring 10 customizable decks, Magic 2013 offers new game items to unlock and introduces theFace a stiffer challenge in this version of the franchise. Play with friends or the AI, take on new encounters and opponents, and face up to 3 other players in the Planechase multiplayer format. Featuring 10 customizable decks, Magic 2013 offers new game items to unlock and introduces the option to choose what lands to tap when you cast your spells.… Expand"}, {"name": "Pangya Fantasy Golf", "details_link": "https://www.metacritic.com/game/psp/pangya-fantasy-golf", "publisher": "Tomy Corporation", "release_date": "Jun 23 2009", "developers": ["Ntreev Soft"], "platforms": "PSP", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/47b20590462e60d29d5ef1bc2200cd56-98.jpg", "descriptions": "In PANGYA: Fantasy Golf, players practice and perfect their swing on the nine fantasy fairways of Pangya Island. Combining golf gameplay, endless customization options and a slew of sassy female characters set in beautiful environments, PANGYA: Fantasy Golf is based on the global PC MMOIn PANGYA: Fantasy Golf, players practice and perfect their swing on the nine fantasy fairways of Pangya Island. Combining golf gameplay, endless customization options and a slew of sassy female characters set in beautiful environments, PANGYA: Fantasy Golf is based on the global PC MMO PANGYA game developed by Ntreev Soft, and boasts an original storyline with new, exclusive features for the PSP system. Players can utilize the in-game Pangya Shop to customize as many as 18 playable characters and their golf equipment with thousands of unlockable accessories, outfits, gear and power items to improve their golfer's stats and land that hole-in-one. Multiple gameplay modes including Story, Free Round, License, Tournament and Network Mode offer an engaging and varied golf experience. Additionally, Network Mode allows the ultimate golf gaming fan to connect with up to eight players and compete against one another in either single or team-based tournaments. [Tomy Corporation]… Expand"}, {"name": "Hue", "details_link": "https://www.metacritic.com/game/playstation-4/hue", "publisher": "Curve Digital", "release_date": "Aug 30 2016", "developers": ["Fiddlesticks Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/cc64f29b0d5eafe3f73af269b555e9c0-98.jpg", "descriptions": "Hue is a puzzle-platformer through which you alter the world by changing its background color. You explore a dangerous grey land, unearthing colored fragments on a journey to find your missing mother. As obstacles match the background, they disappear, creating new puzzles full of peril,Hue is a puzzle-platformer through which you alter the world by changing its background color. You explore a dangerous grey land, unearthing colored fragments on a journey to find your missing mother. As obstacles match the background, they disappear, creating new puzzles full of peril, mystery, and colors unseen.… Expand"}, {"name": "Immortals Fenyx Rising", "details_link": "https://www.metacritic.com/game/playstation-5/immortals-fenyx-rising", "publisher": "Ubisoft", "release_date": "Dec  3 2020", "developers": ["Ubisoft Quebec"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/77bf5440061f7fb0e0d17483a32299f4-98.jpg", "descriptions": "[Formerly titled 'Gods & Monsters'] Immortals Fenyx Rising brings grand mythological adventure to life. Play as Fenyx, a new, winged demigod, on a quest to save the Greek gods. The fate of the world is at stake – you are the gods’ last hope. Wield the powers of the gods like Achilles' sword[Formerly titled 'Gods & Monsters'] Immortals Fenyx Rising brings grand mythological adventure to life. Play as Fenyx, a new, winged demigod, on a quest to save the Greek gods. The fate of the world is at stake – you are the gods’ last hope. Wield the powers of the gods like Achilles' sword and Daidalos' wings to battle powerful enemies and solve ancient puzzles. Fight iconic mythological beasts like Cyclops and Medusa in dynamic combat in the air and on the ground. Use your skills and diverse weapons, including selfguided arrows, telekinesis, and more, for devastating damage. Discover a stylized open world across seven unique regions, each inspired by the gods. … Expand"}, {"name": "Gun", "details_link": "https://www.metacritic.com/game/playstation-2/gun", "publisher": "Activision", "release_date": "Nov  8 2005", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/7708cc51ef194afc80cf134748d55e8d-98.jpg", "descriptions": "Set in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown againstSet in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown against corrupt lawmen, a murderous preacher, renegade army psychopaths, merciless outlaws and unforgiving Native Americans, while waging war on horseback, collecting bounties, and commandeering trains. Players travel through an action-packed landscape of high mountain wilderness, deserts and bustling territorial towns in an epic story of betrayal, greed, and revenge. Multiple gameplay styles include: strategic gunplay and precision shooting, stealth tactics, and use of explosives. Embark on numerous side missions to master gun slinging and horse riding. Players can unlock secret weapons and upgrade skills and abilities to improve their weapon and equipment performance. [Activision]… Expand"}, {"name": "Tales of Graces f", "details_link": "https://www.metacritic.com/game/playstation-3/tales-of-graces-f", "publisher": "Namco Bandai Games", "release_date": "Mar 13 2012", "developers": ["Namco Bandai Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/3dcb25f2741fac741199c27ac23a750a-98.jpg", "descriptions": "In this newest title, the feelings such as \"preserving one's faith\", \"saving their precious ones\" and the destiny of raising the storm between three countries which form the setting, are portrayed. The PS3 version shows the story more in depth having many new elementsIn this newest title, the feelings such as \"preserving one's faith\", \"saving their precious ones\" and the destiny of raising the storm between three countries which form the setting, are portrayed. The PS3 version shows the story more in depth having many new elements including a \"Lineage to the Future Episode\" where a new tale after the main story is told.… Expand"}, {"name": "Klonoa", "details_link": "https://www.metacritic.com/game/wii/klonoa", "publisher": "Namco Bandai Games", "release_date": "May  5 2009", "developers": ["Paon Corporation"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/2365727f920339ca2b5b20c2958a216e-98.jpg", "descriptions": "(Also known as \"Klonoa: Door to Phantomile\")   follows the story of Klonoa and his ring spirit friend, Hewpoe, as they set off to investigate a mysterious crash near their home in Phantomile, a world created by everyone’s dreams. The pair soon find themselves embarking on an exciting(Also known as \"Klonoa: Door to Phantomile\")   follows the story of Klonoa and his ring spirit friend, Hewpoe, as they set off to investigate a mysterious crash near their home in Phantomile, a world created by everyone’s dreams. The pair soon find themselves embarking on an exciting adventure filled with magical creatures and evil villains. With his trusty friend Hewpoe at his side and the power of the Wind Bullet in his hands, it’s up to Klonoa to save Phantomile! [Namco Bandai Games]… Expand"}, {"name": "Mount & Blade II: Bannerlord", "details_link": "https://www.metacritic.com/game/pc/mount-blade-ii-bannerlord", "publisher": "Taleworlds Entertainment", "release_date": "Oct 25 2022", "developers": ["Taleworlds Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["PC-style RPG", "Role-Playing", "Western-Style"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/26cb0943fbc9cdd56f5136f3c106f7f0-98.jpg", "descriptions": "The horns sound, the ravens gather. An empire is torn by civil war. Beyond its borders, new kingdoms rise. Gird on your sword, don your armour, summon your followers and ride forth to win glory on the battlefields of Calradia. Establish your hegemony and create a new world out of the ashesThe horns sound, the ravens gather. An empire is torn by civil war. Beyond its borders, new kingdoms rise. Gird on your sword, don your armour, summon your followers and ride forth to win glory on the battlefields of Calradia. Establish your hegemony and create a new world out of the ashes of the old.\r Mount & Blade II: Bannerlord is the eagerly awaited sequel to the acclaimed medieval combat simulator and role-playing game Mount & Blade: Warband. Set 200 years before, it expands both the detailed fighting system and the world of Calradia. Bombard mountain fastnesses with siege engines, establish secret criminal empires in the back alleys of cities, or charge into the thick of chaotic battles in your quest for power.… Expand"}, {"name": "Hotshot Racing", "details_link": "https://www.metacritic.com/game/playstation-4/hotshot-racing", "publisher": "Sumo Digital", "release_date": "Sep 10 2020", "developers": ["Lucky Mountain Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/8664063ae89932a7629b9925550ccc5c-98.jpg", "descriptions": "Hotshot Racing is a blisteringly fast arcade-style racing game fusing drift handling, razor-sharp retro visuals and an incredible sense of speed to create an exhilarating driving experience."}, {"name": "Spintires: MudRunner", "details_link": "https://www.metacritic.com/game/pc/spintires-mudrunner", "publisher": "Focus Home Interactive", "release_date": "Oct 30 2017", "developers": ["Saber Interactive"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/bb0dddb871d2c62c983fa9c1e6a86126-98.jpg", "descriptions": "Spintires: MudRunner is the ultimate version of the million-seller indie hit Spintires. Like Spintires before it, Spintires: MudRunner puts players in the driver seat and dares them to take charge of incredible all-terrain vehicles, venturing across extreme Siberian landscapes with only aSpintires: MudRunner is the ultimate version of the million-seller indie hit Spintires. Like Spintires before it, Spintires: MudRunner puts players in the driver seat and dares them to take charge of incredible all-terrain vehicles, venturing across extreme Siberian landscapes with only a map and compass as guides!\r A huge upgrade over its predecessor, this edition comes complete with a brand new Sandbox Map joining the original game's 5 environments, a total graphical overhaul, a new Challenge mode with 9 new dedicated maps, 13 new vehicles and other comprehensive improvements. It's not just an enhanced edition, it's the ultimate off-road simulation experience!\r Drive 19 powerful all-terrain vehicles, each with its own characteristics and attachable equipment. Complete your objectives and deliveries by enduring perilous conditions across wild, untamed landscapes in extreme conditions with dynamic day-night cycles. Explore an immersive sandbox environment, enhanced by improved graphics. Overcome muddy terrain, raging rivers and other obstacles that all realistically react to the weight and movement of your vehicle powered by the game's advanced physics engine.\r With your map, compass, winch, and your driving skills as allies, go solo or join up to three others in the coop multiplayer. Download mods created by the passionate community for truck-loads of content and an ever-evolving Spintires: MudRunner experience.… Expand"}, {"name": "Dungeons & Dragons: Chronicles of Mystara", "details_link": "https://www.metacritic.com/game/wii-u/dungeons-dragons-chronicles-of-mystara", "publisher": "Capcom", "release_date": "Sep  5 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Beat-'Em-Up", "Compilation", "Compilation"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/14be7e2d748a0a1e826788a422b760a8-98.jpg", "descriptions": "As the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titlesAs the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titles are now being re-released with updated HD graphics and a wealth of other enhancements as a definitive double pack entitled Dungeons & Dragons: Chronicles of Mystara.… Expand"}, {"name": "Disney's Kim Possible 2: Drakken's Demise", "details_link": "https://www.metacritic.com/game/game-boy-advance/disneys-kim-possible-2-drakkens-demise", "publisher": "Buena Vista Interactive", "release_date": "Sep 15 2004", "developers": ["Artificial Mind and Movement"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/1f9668c8641e9a395f1efe35e320b8c3-98.jpg", "descriptions": "Kim Possible's new adventure leads her into battle with Falsetto Jones, Gemini, Duff Killigan, Shego, and Dr. Drakken in four intense episodes. In each new episode, Kim gains gadgets and acrobatic abilities that allow her to bounce up walls, judo-flip henchmen, reflect laser beams, and sprayKim Possible's new adventure leads her into battle with Falsetto Jones, Gemini, Duff Killigan, Shego, and Dr. Drakken in four intense episodes. In each new episode, Kim gains gadgets and acrobatic abilities that allow her to bounce up walls, judo-flip henchmen, reflect laser beams, and spray hot sauce to melt icy obstructions. If all else fails, you can engage her stealth suit and make her invisible to enemy eyes. Once Kim acquires new gadgets and abilities, you can then replay earlier levels to access areas that were previously unreachable.… Expand"}, {"name": "Brute Force", "details_link": "https://www.metacritic.com/game/xbox/brute-force", "publisher": "Microsoft Game Studios", "release_date": "May 27 2003", "developers": ["Digital Anvil"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/ccf10b21efa4c00d32701d23333bd997-98.jpg", "descriptions": "Take control of any one of four highly specialized super-commandos in Brute Force, an action-packed sci-fi, squad-based shooter game.  Whether the encounter requires stealth, tactics, sniping, or just brute force, the team is ready and able.  The game combines the intensity of a shooter gameTake control of any one of four highly specialized super-commandos in Brute Force, an action-packed sci-fi, squad-based shooter game.  Whether the encounter requires stealth, tactics, sniping, or just brute force, the team is ready and able.  The game combines the intensity of a shooter game with the cunning strategies of team-based tactical combat.  Play solo through six worlds in the extensive single-player campaign, or play co-operatively with up to three friends via split-screen or System Link.  A multitude of competitive death-match modes with up to eight players; and downloadable new content, including campaigns, mission, and maps; keep the game fresh for replayability.… Expand"}, {"name": "Tom Clancy's Splinter Cell", "details_link": "https://www.metacritic.com/game/game-boy-advance/tom-clancys-splinter-cell", "publisher": "Ubisoft", "release_date": "Apr 27 2003", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/c0c2c1603d4eed56ab301a14719d1a62-98.jpg", "descriptions": "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace.  In Tom Clancy's Splinter Cell, you are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon.  Suit up with theInfiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace.  In Tom Clancy's Splinter Cell, you are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon.  Suit up with the latest classified field operative gear and weapons as you travel through diverse mission objectives.  The world's future is in your hands, as cyber terrorism and international tensions are about to explode into WWIII.… Expand"}, {"name": "Doom II", "details_link": "https://www.metacritic.com/game/game-boy-advance/doom-ii", "publisher": "Activision", "release_date": "Oct 28 2002", "developers": ["Torus Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 77, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/13552cfd57472d755a164aece7e36726-98.jpg", "descriptions": "Hell's fury has been unleashed. Billions are dead. To save humanity from certain extinction, you'll have to battle the most powerful demon scum to ever walk the Earth...alone. Blast your way through id Software's original mind-blowing, adrenaline-pumping, record-breaking sequel. It's yourHell's fury has been unleashed. Billions are dead. To save humanity from certain extinction, you'll have to battle the most powerful demon scum to ever walk the Earth...alone. Blast your way through id Software's original mind-blowing, adrenaline-pumping, record-breaking sequel. It's your bloodiest demon slaughter yet. Now in an explosive handheld version!… Expand"}, {"name": "Legacy of Kain: Soul Reaver 2", "details_link": "https://www.metacritic.com/game/pc/legacy-of-kain-soul-reaver-2", "publisher": "Eidos Interactive", "release_date": "Nov 20 2001", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival", "Open-World"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/3e948eb05cb0e2d60e73806ed59b0660-98.jpg", "descriptions": "Raziel returns to various eras of Nosgoth's dark past in his relentless pursuit of Kain. Encounter new enemies as you unearth the mysteries of Nosgoth's ancient races, and expose the schemes behind the corruption of the Pillars, and the vampire genocide. [Eidos Interactive]"}, {"name": "Dark Reign 2", "details_link": "https://www.metacritic.com/game/pc/dark-reign-2", "publisher": "Activision", "release_date": "Jun 30 2000", "developers": ["Pandemic Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/b7420779ed50f7a69bd470ab26c5ccb3-98.jpg", "descriptions": "With a new 3-D engine and a host of features -- gorgeous 3-D terrain and units, traditional top-down and immersive \"on the battlefield\" camera viewpoints, true line of sight, and unprecedented battlefield control -- DR2 will innovate the RTS genre and give gamers the most exhilarating warWith a new 3-D engine and a host of features -- gorgeous 3-D terrain and units, traditional top-down and immersive \"on the battlefield\" camera viewpoints, true line of sight, and unprecedented battlefield control -- DR2 will innovate the RTS genre and give gamers the most exhilarating war experience ever.  [Activision]… Expand"}, {"name": "Furi", "details_link": "https://www.metacritic.com/game/playstation-4/furi", "publisher": "The Game Bakers", "release_date": "Jul  5 2016", "developers": ["The Game Bakers"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General", "Fighting", "3D"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/04bfb4c3165197a1c9f85f321ec0e0de-98.jpg", "descriptions": "Furi is a game where you fight for a reason. It’s a game that teases you before the fight, while you walk toward your fate, the same way you would be pumped up and stressed before a boxing match. As you do, you’ll start to piece together about why you’re here and what you’re fighting for.Furi is a game where you fight for a reason. It’s a game that teases you before the fight, while you walk toward your fate, the same way you would be pumped up and stressed before a boxing match. As you do, you’ll start to piece together about why you’re here and what you’re fighting for. [The Game Baker / Playstation.com]… Expand"}, {"name": "A World of Keflings", "details_link": "https://www.metacritic.com/game/xbox-360/a-world-of-keflings", "publisher": "NinjaBee", "release_date": "Dec 22 2010", "developers": ["NinjaBee"], "platforms": ["PC", "Wii U", "Xbox 360"], "genres": ["Action", "Strategy", "General", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Government"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/48b13485bfbee0a12d84ecd1e8551fa2-98.jpg", "descriptions": "Play as a giant to help the tiny Keflings build up and beautify their Kingdom. Start out small, unlocking new blueprints, buildings and tasks as you work towards designing and building a Kefling castle. Create your own private world, or construct a kingdom with your friends online!"}, {"name": "Stranglehold", "details_link": "https://www.metacritic.com/game/playstation-3/stranglehold", "publisher": "Midway", "release_date": "Oct 29 2007", "developers": ["Midway"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/3fa8529baa2bc8c23a9b019b70a8991b-98.jpg", "descriptions": "Acclaimed action director John Woo presents Stranglehold, a stunning 3rd-person action adventure videogame and \"spiritual sequel\" to Woo's action masterpiece \"Hard Boiled.\" Stranglehold redefines the action gaming experience with its acrobatic gunplay, thrilling cinematography, freneticAcclaimed action director John Woo presents Stranglehold, a stunning 3rd-person action adventure videogame and \"spiritual sequel\" to Woo's action masterpiece \"Hard Boiled.\" Stranglehold redefines the action gaming experience with its acrobatic gunplay, thrilling cinematography, frenetic combat and incredible Massive Destructibility (Massive D). Chow Yun-Fat reprises his signature role as Inspector Tequila, pitting gamers as a take no-prisoners cop waging a personal war with Hong Kong crime lords. Tequila's loyalties to the force are tested when his ex-wife is kidnapped by the Russian mob in Chicago. Tequila struggles to balance his duty to uphold the law with doing what it takes to save his family.  [Midway]… Expand"}, {"name": "Just Dance 4", "details_link": "https://www.metacritic.com/game/xbox-360/just-dance-4", "publisher": "Ubisoft", "release_date": "Oct  9 2012", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/9d9784365913374b4d2f621ee799c431-98.jpg", "descriptions": "Just Dance 4 features more than 40 new tracks, ranging from chart-topping Billboard hits to classic dance party tracks. Whether it's pop, Hip-Hop, rock, R&B, country or funk, there is something for everyone."}, {"name": "Battlefield 2: Special Forces", "details_link": "https://www.metacritic.com/game/pc/battlefield-2-special-forces", "publisher": "EA Games", "release_date": "Nov 21 2005", "developers": ["Digital Illusions"], "platforms": "PC", "num_players": "64  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/12a7291ee28662d87a2d1b83556230a8-98.jpg", "descriptions": "In Battlefield 2: Special Forces, players will choose to fight as one of 6 different Special Forces soldiers – Navy SEALs, British SAS, Russian Spetznas, MEC Special Forces, Rebel groups and insurgents. Armed with the latest Special Forces weaponry, players can take control of any of theIn Battlefield 2: Special Forces, players will choose to fight as one of 6 different Special Forces soldiers – Navy SEALs, British SAS, Russian Spetznas, MEC Special Forces, Rebel groups and insurgents. Armed with the latest Special Forces weaponry, players can take control of any of the game’s 10 new vehicles to engage in major conflicts with up to 64 players.  Additionally, persistent character growth allows players to continue to rise through the ranks. Battlefield 2 Special Forces takes the intensity and quality of Battlefield 2 behind the scenes of news headlines, showcasing the most elite and deadly forces in the modern military world.  Using accurate Special Forces weapons, gadgets, and vehicles, these covert armies battle to control key military and strategic locations. [Electronic Arts]… Expand"}, {"name": "Peter Jackson's King Kong: The Official Game of the Movie", "details_link": "https://www.metacritic.com/game/pc/peter-jacksons-king-kong-the-official-game-of-the-movie", "publisher": "Ubisoft", "release_date": "Nov 21 2005", "developers": ["Ubisoft Montpellier"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/34082f76a87c50ef9e37e65c9a44b2b8-98.jpg", "descriptions": "Embark on an epic adventure created in collaboration with Academy Award-winning director Peter Jackson and based on the Universal Pictures' film. Survive as Jack in a world crawling with predators and live the legend as Kong. Use weapons, traps, and your team wisely to survive inEmbark on an epic adventure created in collaboration with Academy Award-winning director Peter Jackson and based on the Universal Pictures' film. Survive as Jack in a world crawling with predators and live the legend as Kong. Use weapons, traps, and your team wisely to survive in first-person as Jack. Break jaws, slam enemies, and throw massive objects in Kong's colossal third-person battles. [Ubisoft]… Expand"}, {"name": "SaGa Frontier Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/saga-frontier-remastered", "publisher": "Square Enix", "release_date": "Apr 15 2021", "developers": ["Square Enix", "Bullets"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/42ffdf1a5c9837e60bc8a406981f6ba4-98.jpg", "descriptions": "The 1998 PlayStation® classic is back: SaGa Frontier is remastered. The team of eight have returned – now with Fuse added as a playable character. Choose your favorite character and embark on your own unique journey. Each of the eight characters have different goals and endings. Your choicesThe 1998 PlayStation® classic is back: SaGa Frontier is remastered. The team of eight have returned – now with Fuse added as a playable character. Choose your favorite character and embark on your own unique journey. Each of the eight characters have different goals and endings. Your choices will affect how events unfold using the Free-Form Scenario System. This in-depth system will allow you to manipulate and expand a story all your own. Challenge yourself in nail-biting battles by using “glimmer\" as well as learning new skills such as the ability to fire consecutive special attacks from multiple team members.… Expand"}, {"name": "Pac-Man Championship Edition 2", "details_link": "https://www.metacritic.com/game/xbox-one/pac-man-championship-edition-2", "publisher": "Bandai Namco Games", "release_date": "Sep 13 2016", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Arcade"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/03663cda0e3d6c36a3202948630c5797-98.jpg", "descriptions": "A new sequel in the PAC-MAN Championship Edition series comes to next-generation consoles and PC. Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for the future Featuring 3DA new sequel in the PAC-MAN Championship Edition series comes to next-generation consoles and PC. Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for the future Featuring 3D graphics and funky visuals, the latest version of the classic game takes chomping and chasing through mazes to a new level.… Expand"}, {"name": "Harvest Moon DS: Sunshine Islands", "details_link": "https://www.metacritic.com/game/ds/harvest-moon-ds-sunshine-islands", "publisher": "Natsume", "release_date": "Nov 12 2009", "developers": ["Marvelous Entertainment"], "platforms": "DS", "genres": ["Strategy", "Breeding/Constructing", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/46df8e1da698088de721852e478d9d42-98.jpg", "descriptions": "The islands are in peril! Years ago, a powerful earthquake struck the Sunshine Islands. In Harvest Moon: Sunshine Islands, it's up to the player to raise the sunken islands by finding the magical Sun Stones. Raise the islands to meet new characters, harvest new crops, and befriend animalsThe islands are in peril! Years ago, a powerful earthquake struck the Sunshine Islands. In Harvest Moon: Sunshine Islands, it's up to the player to raise the sunken islands by finding the magical Sun Stones. Raise the islands to meet new characters, harvest new crops, and befriend animals such as ducks, monkeys, and badgers. In Harvest Moon: Sunshine Islands, players rejoin all of the beloved characters from Harvest Moon: Island of Happiness, and get to meet a number of new friends as well. Players grow and harvest crops, care for animals, mine, fish, and compete in festivals in their quest to restore the Sunshine Islands to their former glory. With a little luck, they may even find true love and start a family along the way. [Natsume]… Expand"}, {"name": "Trauma Center: New Blood", "details_link": "https://www.metacritic.com/game/wii/trauma-center-new-blood", "publisher": "Atlus", "release_date": "Nov 20 2007", "developers": ["Atlus"], "platforms": "Wii", "genres": ["Action", "Simulation", "General", "General", "Virtual", "Career"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/d5c87453a537e92af07b936ee8cdb4c1-98.jpg", "descriptions": "Keep your hands steady and your mind focused – this time around there’s a lot more on the line. Every cut of the scalpel, every pinch of the forceps, each and every second that ticks by is of the absolute greatest importance. If you think it's too much to handle alone, invite a friend toKeep your hands steady and your mind focused – this time around there’s a lot more on the line. Every cut of the scalpel, every pinch of the forceps, each and every second that ticks by is of the absolute greatest importance. If you think it's too much to handle alone, invite a friend to assist with the operation and work together to save patients from flat-lining. The adrenaline is pumping, lives are at stake, and only you can save the day. Have you got what it takes? At a remote hospital in Alaska, Dr. Markus Vaughn quietly toils, a surgeon who has forsaken the politics and power struggles of his former ward. He is content to use the power he has discovered within himself, the Healing Touch, to positively affect the lives of those in need. His partner is Valerie Blaylock, a promising young doctor eager to unlock her own dormant abilities. When the facility unexpectedly closes, they are forced to return to Concordia Medical Institute, where politics are more important than patient’s lives, and doctors more concerned with image than their ministration. There they are recruited into the government organization Caduceus, where they will learn of a conspiracy with dire ramifications, and their lives will be changed forever! For the first time in the series, work with a friend to race against the clock and save lives…success will require teamwork and communication – Every second counts. Depend on a brand new medical team for support and advice as you tackle new emergencies. [Atlus USA]… Expand"}, {"name": "The Pathless", "details_link": "https://www.metacritic.com/game/playstation-4/the-pathless", "publisher": "Giant Squid", "release_date": "Nov 12 2020", "developers": ["Giant Squid"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/65a140c59cf972a7887f55e3b6b74253-98.jpg", "descriptions": "From the creators of ABZÛ, The Pathless is a mythic adventure game about an archer and an eagle in a vast forest. Become the Hunter, a master of archery who travels to a mystical island to dispel a curse of darkness that grips the world. Forge a connection with your eagle companion as youFrom the creators of ABZÛ, The Pathless is a mythic adventure game about an archer and an eagle in a vast forest. Become the Hunter, a master of archery who travels to a mystical island to dispel a curse of darkness that grips the world. Forge a connection with your eagle companion as you hunt corrupted spirits, but be careful not to become the hunted yourself. Explore misty forests full of secrets, solve puzzles in ancient ruins, and test your skill in epic battles. The bond with your eagle and the fate of the world hang in the balance. [Giant Squid]… Expand"}, {"name": "LEGO Indiana Jones: The Original Adventures", "details_link": "https://www.metacritic.com/game/playstation-3/lego-indiana-jones-the-original-adventures", "publisher": "LucasArts", "release_date": "Jun  3 2008", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/bd90dd6de531af017f593256de218d78-98.jpg", "descriptions": "LEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones andLEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade). With a unique tongue-in-cheek take on the original adventures, LEGO Indiana Jones follows Dr. Jones escapades through the jungles of South America to the mountaintops of India. Fans can build, battle and brawl their way through their favorite cinematic moments, from Indy's entanglements with snakes to his dashing boulder run. Pop culture's most iconic archeologist whips through all the classic moments with the help of a host of supporting characters including Marion Ravenwood and Short Round. Players can also mix and match the body parts of more than 60 playable characters to create new heroes just as they could in the LEGO Star Wars games. [LucasArts]… Expand"}, {"name": "The World Ends with You: Final Remix", "details_link": "https://www.metacritic.com/game/switch/the-world-ends-with-you-final-remix", "publisher": "Square Enix", "release_date": "Oct 12 2018", "developers": ["Square Enix", "h.a.n.d. Inc.", "Jupiter Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/9cf9e31f91deafd32fd43f70f51d121c-98.jpg", "descriptions": "The highly stylised and critically acclaimed Nintendo DS game \"The World Ends With You\" is coming to Nintendo Switch.\r When the main character, Neku, suddenly encounters the mysterious girl Shiki, he gets caught up in a deadly game he'll be erased from existence if he can't complete aThe highly stylised and critically acclaimed Nintendo DS game \"The World Ends With You\" is coming to Nintendo Switch.\r When the main character, Neku, suddenly encounters the mysterious girl Shiki, he gets caught up in a deadly game he'll be erased from existence if he can't complete a series of twisted tasks.\r Tear into each rhythmic battle using the game's traditional touch controls or Joy-Con controllers for a fresh style of combat! The action-RPG will also include a sizeable new scenario that gets right to the heart of the story.… Expand"}, {"name": "Mercury Meltdown Revolution", "details_link": "https://www.metacritic.com/game/wii/mercury-meltdown-revolution", "publisher": "Ignition Entertainment", "release_date": "Oct 15 2007", "developers": ["Ignition Entertainment"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/3ca458d0ba4edb842edaf0dce6b73f3b-98.jpg", "descriptions": "Mercury Meltdown Revolution is a puzzle game that challenges players to immerse themselves in a colorful world of sci-fi machines, crazy characters, and bubbling test tubes.  Players take control of a liquid mercury blob, guiding it around traps, door switches, spikes, moving floors andMercury Meltdown Revolution is a puzzle game that challenges players to immerse themselves in a colorful world of sci-fi machines, crazy characters, and bubbling test tubes.  Players take control of a liquid mercury blob, guiding it around traps, door switches, spikes, moving floors and other hazardous elements in order to complete the level. Mercury Meltdown Revolution Features: Full interaction using the Wii Remote tilt sensor; Advanced rendering techniques for improved graphical quality; Over 150+ challenging levels; Hidden Labs to unlock; State of the art blob physics; Bonus features to unlock. [Ignition Entertainment]… Expand"}, {"name": "de Blob 2", "details_link": "https://www.metacritic.com/game/xbox-360/de-blob-2", "publisher": "THQ", "release_date": "Feb 22 2011", "developers": ["Blue Tongue Entertainment"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "genres": ["Action", "Adventure", "General", "Platformer", "Platformer", "3D", "3D"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/d18609135160cbb97b2eccda41d34244-98.jpg", "descriptions": "This is the follow-up title to 2008's popular hit, de Blob."}, {"name": "As Dusk Falls", "details_link": "https://www.metacritic.com/game/xbox-series-x/as-dusk-falls", "publisher": "Xbox Game Studios", "release_date": "Jul 19 2022", "developers": ["INTERIOR/NIGHT"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/537ce6880a86c607a9c2eeedf835e4ed-98.jpg", "descriptions": "Every Family has Secrets. Every Secret has a Price. As Dusk Falls is an original interactive drama from INTERIOR/NIGHT that explores the entangled lives of two families across thirty years. Starting in 1998 with a robbery-gone-wrong in small town Arizona, the choices you make have a powerfulEvery Family has Secrets. Every Secret has a Price. As Dusk Falls is an original interactive drama from INTERIOR/NIGHT that explores the entangled lives of two families across thirty years. Starting in 1998 with a robbery-gone-wrong in small town Arizona, the choices you make have a powerful impact on the characters’ lives in this uncompromising story of betrayal, sacrifice and resilience. Drive the lives and relationships of multiple characters in a decades-spanning story told across two intense books.… Expand"}, {"name": "Star Renegades", "details_link": "https://www.metacritic.com/game/pc/star-renegades", "publisher": "Massive Damage, Inc.", "release_date": "Sep  8 2020", "developers": ["Massive Damage", "Inc."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/206facabc2c198a7130b6de34fdfa157-98.jpg", "descriptions": "Star Renegades is a strategy RPG about outsmarting AI-driven adversaries, forging friendships, and toppling galactic empires spanning over multiple generations."}, {"name": "Moving Out", "details_link": "https://www.metacritic.com/game/switch/moving-out", "publisher": "Team17", "release_date": "Apr 28 2020", "developers": ["SMG Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Simulation", "Puzzle", "Action", "Virtual", "Career"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/9f2ea1c77efc6b98ea405ad26779cf30-98.jpg", "descriptions": "Moving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. SmoothMoving Out is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"!Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you'll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there's no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!… Expand"}, {"name": "Peggle 2", "details_link": "https://www.metacritic.com/game/xbox-one/peggle-2", "publisher": "Electronic Arts", "release_date": "Dec  9 2013", "developers": ["PopCap"], "platforms": ["PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Miscellaneous", "Puzzle", "Action", "General", "General"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/700f6bfa509616676c1ef862a56ede7c-98.jpg", "descriptions": "Peggle 2 injects players into the peg-popping vista of the original while delivering an array of new features and functionality. Peggle 2 offers all-new levels, new and improved power-ups, fantastic multiplayer modes, gesture controls with Kinect for Xbox One, the ability to customize thePeggle 2 injects players into the peg-popping vista of the original while delivering an array of new features and functionality. Peggle 2 offers all-new levels, new and improved power-ups, fantastic multiplayer modes, gesture controls with Kinect for Xbox One, the ability to customize the \"Peggle Masters\" who host the game, and much more.\r… Expand"}, {"name": "Attack of the Friday Monsters! A Tokyo Tale", "details_link": "https://www.metacritic.com/game/3ds/attack-of-the-friday-monsters!-a-tokyo-tale", "publisher": "Level 5", "release_date": "Jul 18 2013", "developers": ["Level 5", "Millennium Kitchen"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/ee7671ea7bb61ffe7e914b8fcc2a9b47-98.jpg", "descriptions": "Millennium Kitchen's Kaz Ayabe is known for mesmerizing many Japanese fans with his heartwarming stories in the Boku no Natsuyasumi (Summer Holidays 20th Century) series. In ATTACK OF THE FRIDAY MONSTERS! A TOKYO TALE, he introduces for the first time, a Tokyo-life simulation game whereMillennium Kitchen's Kaz Ayabe is known for mesmerizing many Japanese fans with his heartwarming stories in the Boku no Natsuyasumi (Summer Holidays 20th Century) series. In ATTACK OF THE FRIDAY MONSTERS! A TOKYO TALE, he introduces for the first time, a Tokyo-life simulation game where players will take the role of a young boy named Sohta who lives where the giant monsters from the TV shows of Japan's 1970s come to life every Friday. In this rustic town of tranquil days and idyllic scenery, there lies a nostalgic tale sure to warm your heart.  ATTACK OF THE FRIDAY MONSTERS! A TOKYO TALE will be the first of Kaz Ayabe's games to be released outside of Japan.… Expand"}, {"name": "Men of War: Red Tide", "details_link": "https://www.metacritic.com/game/pc/men-of-war-red-tide", "publisher": "Aspyr", "release_date": "Nov  1 2009", "developers": ["Best Way"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Tactics"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/1ea810e35f86176d9c00d4505dd7697e-98.jpg", "descriptions": "Men of War: Red Tide is a sequel to the critically acclaimed RTS Men of War. Red Tide introduces a new story driven campaign based on the writings of Soviet scribe Alexander Zorich, it also includes dozens of new or upgraded units and weapons. Men of War: Red Tide is a stunning mixture ofMen of War: Red Tide is a sequel to the critically acclaimed RTS Men of War. Red Tide introduces a new story driven campaign based on the writings of Soviet scribe Alexander Zorich, it also includes dozens of new or upgraded units and weapons. Men of War: Red Tide is a stunning mixture of RTS and a third-person action that introduces a new fighting force known for its brutal efficiency during the height of World War II. Played out across more than 20 missions, Men of War: Red Tide allows to take command of the feared “Black Coats,” the nickname given to Soviet Marines, an elite combat group specializing in engagements near the shoreline. The player has direct control of new game units including the Black Coats, tanks, self-propelled guns, armored trains, landing craft, artillery and new enemy emplaced weapons to capture and use. New air support options include fighters, bombers, hydroplanes; cruisers, destroyers and gun boats which provide naval fire support. Fighting during the Black Sea Campaigns of WWII, history buffs and WWII aficionados will recognize theaters of battle such as Odessa, Sevastopol, Theodosia, Eltingen, Nikolaev and Constanta. [1C Company]… Expand"}, {"name": "Dead to Rights", "details_link": "https://www.metacritic.com/game/gamecube/dead-to-rights", "publisher": "Namco", "release_date": "Nov 25 2002", "developers": ["Namco"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/7414ffb2023918c7b5cb5c4310ae6fee-98.jpg", "descriptions": "Meet Jack Slate, a cop framed for murder and facing execution.  Slate escapes from Iron Point Maximum-Security Penitentiary to bring down the criminals that framed.  In Dead to Rights, you play the role of Slate, as he fights through the hard streets and corrupt enemies of Grant City.  ThereMeet Jack Slate, a cop framed for murder and facing execution.  Slate escapes from Iron Point Maximum-Security Penitentiary to bring down the criminals that framed.  In Dead to Rights, you play the role of Slate, as he fights through the hard streets and corrupt enemies of Grant City.  There are plenty of ways go about bringing the conspirators to justice--Jack can perform disarm moves, shoot different weapons, pick locks, fight hand-to-hand, and play minigames such as arm wrestling, bench press, and dancing.  In this gritty, crime-noir inspired epic, you're always on the run.… Expand"}, {"name": "Sniper Elite 5", "details_link": "https://www.metacritic.com/game/playstation-5/sniper-elite-5", "publisher": "Rebellion", "release_date": "May 26 2022", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 77, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/5b0a7e1c21165df7cb61d5513f79ee86-98.jpg", "descriptions": "As part of a covert US Rangers operation to weaken the Atlantikwall fortifications along the coast of Brittany, Karl makes contact with the French Resistance. Soon they uncover a secret Nazi project that threatens to end the war before the Allies can even invade Europe: Operation Kraken.As part of a covert US Rangers operation to weaken the Atlantikwall fortifications along the coast of Brittany, Karl makes contact with the French Resistance. Soon they uncover a secret Nazi project that threatens to end the war before the Allies can even invade Europe: Operation Kraken. It's Karl's mission to take out the high-ranking Nazi officers and end Operation Kraken once and for all. Based upon real world locations from France in 1944, the new game maps are the largest and most immersive in the franchise's history with the new traversal system offering players an even greater sandbox of options when it comes to taking out their targets. You can even invite a friend to help you on your mission with enhanced cooperative gameplay options.… Expand"}, {"name": "MLB 07: The Show", "details_link": "https://www.metacritic.com/game/playstation-3/mlb-07-the-show", "publisher": "SCEA", "release_date": "May 15 2007", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/ed5f58baf1947c6a566bd6df9b9445bc-98.jpg", "descriptions": "The innovative Road to The Show mode enables fans to play solely as a custom-created rookie on both offense and defense while attempting to rise through the ranks and make a starting line-up in the Big Leagues. Adding to its already robust online feature set, the MLB franchise now includesThe innovative Road to The Show mode enables fans to play solely as a custom-created rookie on both offense and defense while attempting to rise through the ranks and make a starting line-up in the Big Leagues. Adding to its already robust online feature set, the MLB franchise now includes Online League Play, which gives gamers the ability to set up leagues with up to 30 teams, complete statistical tracking, point benefits and full customization, while the My Sliders feature allows users to create their perfect game settings and upload them to the MLB 07 The Show server for others to try out. [SCEA]… Expand"}, {"name": "GNOG", "details_link": "https://www.metacritic.com/game/playstation-4/gnog", "publisher": "KO-OP", "release_date": "May  2 2017", "developers": ["KO-OP"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/abcf4285438eb45ec0b80960d4a64b44-98.jpg", "descriptions": "GNOG is a 3D puzzle game set in a tactile world of toys and secrets. Point, click, grab, poke, spin, pull, and play with uniquely charming monster heads, and explore the hidden worlds inside them from your couch, or face-to-face in stunning PlayStation VR. Filled with eye-catching designs,GNOG is a 3D puzzle game set in a tactile world of toys and secrets. Point, click, grab, poke, spin, pull, and play with uniquely charming monster heads, and explore the hidden worlds inside them from your couch, or face-to-face in stunning PlayStation VR. Filled with eye-catching designs, playful interactions, and a rich, reactive soundtrack, the hand-crafted heads come to life in your hands. Inspired by real-world toy designs, every GNOG head is a miniature world to discover. Grab a bookcase and spin it to reveal a hidden pile of coins, slide levers to navigate a damaged ship through outer space, crank a wheel to cook a stew on the stove – each playful interaction generates lively feedback and surprising consequences. Set to a relaxing and dynamic soundtrack that evolves with each level, the surreal worlds and joyful puzzles of GNOG will have you turning heads. [Playstation.com]… Expand"}, {"name": "Darksiders Genesis", "details_link": "https://www.metacritic.com/game/playstation-4/darksiders-genesis", "publisher": "THQ Nordic", "release_date": "Feb 14 2020", "developers": ["Airship Syndicate Entertainment"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/f72da32b8e17208b5d8599155b28a242-98.jpg", "descriptions": "From the dawn of creation, the council has maintained the Balance across existence. Carrying out their orders are the Horsemen, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.From the dawn of creation, the council has maintained the Balance across existence. Carrying out their orders are the Horsemen, Nephilim (powerful beings spawned from the unnatural union of angels and demons) who have pledged themselves to the Council and been granted immense power.However, this power came at a tragic cost: the Horsemen were ordered to use their newfound strength to wipe out the rest of their kind. What followed was a bloody battle on Eden where the Horsemen, obeying the will of the Council, annihilated the Nephilim.Darksiders: Genesis is an action/adventure that tears its way through hordes of demons, angels, and everything in-between on its way to Hell and back with guns blazing and swords swinging. Genesis gives players their first look at the world of Darksiders before the events of the original game, as well as introduces the horseman Strife.… Expand"}, {"name": "Dragon Ball Z: Budokai 3", "details_link": "https://www.metacritic.com/game/playstation-2/dragon-ball-z-budokai-3", "publisher": "Atari", "release_date": "Nov 16 2004", "developers": ["Dimps Corporation"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/35590409dccf94b2ae2ffb0772076b67-98.jpg", "descriptions": "Pulverize opponents with the Saiyan Overdrive Fighting System, including: Teleportation Counter – Recreate the lightening speed of DBZ; Teleportation Tornado Combo – Pinball opponents in the air; Dragon Rush Attack – Experience explosive, cinematic new attack moves;Pulverize opponents with the Saiyan Overdrive Fighting System, including: Teleportation Counter – Recreate the lightening speed of DBZ; Teleportation Tornado Combo – Pinball opponents in the air; Dragon Rush Attack – Experience explosive, cinematic new attack moves; Bukujutsu Flight Mode – Go airborne at any time in the game. Unlock up to 40 bonus characters from Dragon Ball Z, DBZ movies, and Dragon Ball GT. Customize your DBZ warriors and build the ultimate fighter. Post and retrieve character profiles from the Internet. [Atari]… Expand"}, {"name": "Full House Poker", "details_link": "https://www.metacritic.com/game/xbox-360/full-house-poker", "publisher": "Microsoft Game Studios", "release_date": "Mar 16 2011", "developers": ["Microsoft Game Studios"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/cd11e6d1d04600cdea97e34f1baae212-98.jpg", "descriptions": "Compete against your Xbox LIVE friends on Xbox 360 and build your bank roll on the go with a companion game on Windows Phone 7. Play a quick two-player game for some lightning action, join a big 30-player tournament, or play a round of Texas Heat, our live poker game show where you play withCompete against your Xbox LIVE friends on Xbox 360 and build your bank roll on the go with a companion game on Windows Phone 7. Play a quick two-player game for some lightning action, join a big 30-player tournament, or play a round of Texas Heat, our live poker game show where you play with thousands of players worldwide and have 30 minutes to bluff, bet, and raise your way to the final table! … Expand"}, {"name": "Warriors Orochi 3 Ultimate", "details_link": "https://www.metacritic.com/game/playstation-4/warriors-orochi-3-ultimate", "publisher": "Koei Tecmo Games", "release_date": "Sep  2 2014", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/b535080dc8953736da607603d5b6de47-98.jpg", "descriptions": "Fans will experience WARRIORS OROCHI 3 in a new light as they enter the fray with the implementation of new generation console features, new storylines and scenarios."}, {"name": "When The Past Was Around", "details_link": "https://www.metacritic.com/game/pc/when-the-past-was-around", "publisher": "Toge Productions", "release_date": "Sep 22 2020", "developers": ["Mojiken Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/8451b801d7e851a3421a06a746c156a0-98.jpg", "descriptions": "When the Past was Around is an adventure point-and-click puzzle game about love, moving on, letting go, and the joy and pain of everything in between."}, {"name": "The Book of Unwritten Tales 2", "details_link": "https://www.metacritic.com/game/switch/the-book-of-unwritten-tales-2", "publisher": "KING Art", "release_date": "Feb  5 2019", "developers": ["KING Art"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/1ebfab49d37ca1c9f15cba8b515d6087-98.jpg", "descriptions": "A new adventure from KING Art, the creators of The Book of Unwritten Tales, The Critter Chronicles and The Raven - Legacy of a Master Thief.\r - A fantasy story with over 20 hours of pointing and clicking\r\n- The trademark BoUT-humor, lovingly spoofing LotR, Game of Thrones, Harry Potter,A new adventure from KING Art, the creators of The Book of Unwritten Tales, The Critter Chronicles and The Raven - Legacy of a Master Thief.\r - A fantasy story with over 20 hours of pointing and clicking\r- The trademark BoUT-humor, lovingly spoofing LotR, Game of Thrones, Harry Potter, Discworld, The Hobbit, WoW and more\r- Hundreds of weird, yet oddly logical puzzles\r- The well-proven 'Multi-Character-Gameplay'\r- An ensemble of quirky characters, both well-established and brand-new\r- Projection Mapping technology unites the merits of 2D and 3D styles and technique\r- An epic soundtrack with all the classics and many new compositions\r- The established four playable characters Wilbur, Nate, Ivo and Critter… Expand"}, {"name": "Mothergunship", "details_link": "https://www.metacritic.com/game/xbox-one/mothergunship", "publisher": "Sold Out", "release_date": "Jul 17 2018", "developers": ["Grip Digital"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/df4f878c8e4e8c8ff84196df679304a5-98.jpg", "descriptions": "MOTHERGUNSHIP mixes bullet-hell intensity with the shooting, customization, and traversal of the first-person genre. Fight your way through the alien fleets, facing randomized enemy and level mayhem as you clear rooms and take out some of the biggest bosses seen in the FPS genre."}, {"name": "Dark Train", "details_link": "https://www.metacritic.com/game/pc/dark-train", "publisher": "Paperash studio", "release_date": "Oct 25 2016", "developers": ["Paperash studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/647659a70e25729498a643f957656116-98.jpg", "descriptions": "Dark Train is an award-winning steampunk train adventure made of paper.Assume the role of mechanical squid Ann 2.35f that is tied to the railroad machine and deliver the mysterious order for deceased D. W. Tagrezbung, the famous inventor from the Border City."}, {"name": "The Legend of Heroes: Trails of Cold Steel", "details_link": "https://www.metacritic.com/game/playstation-vita/the-legend-of-heroes-trails-of-cold-steel", "publisher": "XSEED Games", "release_date": "Dec 22 2015", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/2a60cd031c79640835e1866154c25a08-98.jpg", "descriptions": "At the elite Thors Military Academy, Erebonias best and brightest learn everything from the art of war to the liberal arts. Rean Schwarzer, a new student, learns that hes been selected as a member of the newly-minted Class VII, made up of students from both noble and commoner backgrounds.At the elite Thors Military Academy, Erebonias best and brightest learn everything from the art of war to the liberal arts. Rean Schwarzer, a new student, learns that hes been selected as a member of the newly-minted Class VII, made up of students from both noble and commoner backgrounds.\r Class VII has no shortage of issues to overcome, but Rean and his classmates will have to work past their differences and hone their skills, because theyll need more than just top marks to make the grade  theyll need to safeguard their country from those who would plunge it into war.\r - A World of Lore  Return to the Zemurian continent, setting of the Trails in the Sky titles, with a new adventure for old and new fans alike.\r - Tactical Thinking  Execute your strategies in exciting turn-based battles where timing and distance can make the difference between victory and defeat.\r - Combat Links  Link any two characters in battle, enabling unique synergies between them.… Expand"}, {"name": "Transformers: Fall of Cybertron", "details_link": "https://www.metacritic.com/game/playstation-3/transformers-fall-of-cybertron", "publisher": "Activision", "release_date": "Aug 21 2012", "developers": ["High Moon Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/cc5e7fc2eb5dac4adef71a4bc9b14b46-98.jpg", "descriptions": "This follow-up to 2010's War for Cybertron depicts the final hours of the civil war that led the Autobots and Decepticons to abandon their home planet."}, {"name": "Sniper Elite", "details_link": "https://www.metacritic.com/game/xbox/sniper-elite", "publisher": "Namco", "release_date": "Oct 18 2005", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Historic"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/44487c3cb187e40b12807d4496b31ec4-98.jpg", "descriptions": "Sniper Elite sets you in the midst of the end of World War II. As an OSS-trained sniper you must disguise yourself as a German soldier and stop the Russians from stealing nuclear secrets from Berlin. Through 28 levels, you can use your stealth and sniping skills to take out sentries, machineSniper Elite sets you in the midst of the end of World War II. As an OSS-trained sniper you must disguise yourself as a German soldier and stop the Russians from stealing nuclear secrets from Berlin. Through 28 levels, you can use your stealth and sniping skills to take out sentries, machine gun nests, and guard posts. Sniper Elite incorporates elevation, wind speed, posture, background noise, and a host of other factors into the sniping experience. Sniper Elite also includes cooperative and competitive multiplayer modes.… Expand"}, {"name": "Dragon Quest Monsters: Joker 2", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-monsters-joker-2", "publisher": "Nintendo", "release_date": "Sep 19 2011", "developers": ["TOSE"], "platforms": "DS", "num_players": "8  Online", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style", "Trainer"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/d664524652cfbdf8b7b1aeb956e49bf8-98.jpg", "descriptions": "As Monster Scouts, players can recruit wild monsters to build a team and battle against other players in this turn-based role-playing game. Each year, monster scouts from around the world gather to compete for the title of world's greatest scout. Players crash-land on a mysterious islandAs Monster Scouts, players can recruit wild monsters to build a team and battle against other players in this turn-based role-playing game. Each year, monster scouts from around the world gather to compete for the title of world's greatest scout. Players crash-land on a mysterious island after their airship is struck by lightning. They must rescue their missing passengers and crew members by fighting various enemies using their own monster parties. The only way off the island is to solve its many mysteries.\r… Expand"}, {"name": "Football Manager Touch 2018", "details_link": "https://www.metacritic.com/game/switch/football-manager-touch-2018", "publisher": "Sega", "release_date": "Apr 13 2018", "developers": ["Sports Interactive"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/ccebe09cb34010fa2f40e92eb1d8f85c-98.jpg", "descriptions": null}, {"name": "Mantis Burn Racing", "details_link": "https://www.metacritic.com/game/switch/mantis-burn-racing", "publisher": "VooFoo Studios", "release_date": "Nov 23 2017", "developers": ["VooFoo Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/dad4f9d381b991fa8646507a6202854d-98.jpg", "descriptions": "The race is on in Mantis Burn Racing, where fast-paced bumper-to-bumper racing combines with intuitive, tactile gameplay and stunning visuals in one of the best-looking and most immersive top-down racers around. Drive incredible built-for-racing vehicles across highly detailed, visuallyThe race is on in Mantis Burn Racing, where fast-paced bumper-to-bumper racing combines with intuitive, tactile gameplay and stunning visuals in one of the best-looking and most immersive top-down racers around. Drive incredible built-for-racing vehicles across highly detailed, visually stunning tracks, in high-risk, high-speed races where winning is everything. Prove your skills in an extensive career mode and take on friends with 4-player local split-screen racing and online modes for up to 8 players in 'one-more-go' style competitive racing. With a RPG-style upgrade system providing players with deep tactical choices and excellent replay-ability, this is racing at its rawest but most exciting!The race is on!… Expand"}, {"name": "Battlefield 2142: Northern Strike", "details_link": "https://www.metacritic.com/game/pc/battlefield-2142-northern-strike", "publisher": "EA Games", "release_date": "Mar  8 2007", "developers": ["EA DICE"], "platforms": "PC", "num_players": "64  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/608aabc129819559c8e0c0c9e4bdf036-98.jpg", "descriptions": "A few years into the most desperate struggle in the history of mankind, and with the conflict focused around the Mediterranean, the Pan Asian Coalition (PAC) seizes the chance to claim the undefended natural resources beneath the ice of mainland Europe. By the time the EU is aware of theirA few years into the most desperate struggle in the history of mankind, and with the conflict focused around the Mediterranean, the Pan Asian Coalition (PAC) seizes the chance to claim the undefended natural resources beneath the ice of mainland Europe. By the time the EU is aware of their presence, the enemy is firmly entrenched in the continent’s harsh ice fields, among abandoned city ruins and soaring mountain peaks. Only fierce close-quarters infantry battles along claustrophobic city streets and narrow rocky passes will eject the PAC forces from their well-defended positions and push them back towards the sea. Fast–paced, infantry-focused gameplay boosts the intensity of the all-out war experience. Three new maps set in Europe, where snow-covered post-apocalyptic cities and a ridge in the Alps become the new battlegrounds. Two brand-new vehicles designed to support infantry combat available in an asymmetrical set-up, with the hovering light IFV Hachimoto available to the PAC and the massive heavy IFV Goliath available to the EU. Increased persistence. Ten new rewards, one new pin and ten new unlock items at the top of the unlocks trees, available also on core game maps, take persistence to new levels. Unlock credits earned in the booster pack can also be used in the core game. Epic Titan mode available on two maps, and for the first time in a urban setting, for more intense Titan gameplay. Tweaked Conquest-assault gameplay (Assault Lines game mode) on all three maps creates more choke points and more heated battles. Horizontal podding gives infantry additional ways of moving across the maps quickly. [Electronic Arts]… Expand"}, {"name": "Brain Age: Train Your Brain in Minutes a Day!", "details_link": "https://www.metacritic.com/game/ds/brain-age-train-your-brain-in-minutes-a-day!", "publisher": "Nintendo", "release_date": "Apr 17 2006", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1-16 ", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/b211c6c38b5054ad2601d47c9aeb3c57-98.jpg", "descriptions": "(Also known as \"Brain Training For Adults\" and \"Dr. Kawashima's Brain Training\")  Brain Age: Train Your Brain in Minutes a Day for Nintendo DS is a fun, rewarding form of entertainment everyone can enjoy, as it helps players flex their mental muscles. Brain Age is inspired by the research of(Also known as \"Brain Training For Adults\" and \"Dr. Kawashima's Brain Training\")  Brain Age: Train Your Brain in Minutes a Day for Nintendo DS is a fun, rewarding form of entertainment everyone can enjoy, as it helps players flex their mental muscles. Brain Age is inspired by the research of Professor Ryuta Kawashima, a prominent Japanese neuroscientist. His studies evaluated the impact of performing certain reading and mathematic exercises to help stimulate the brain. Brain Age presents quick mental activities that help keep your DS brain in shape. Activities include quickly solving simple math problems, counting people going in and out of a house simultaneously, drawing pictures on the Touch Screen, reading classic literature out loud, and more. You can also play sudoku, the number puzzle game which has become an extremely popular feature in U.S. newspapers. On your first day of exercise, you will take a series of tests and get a score that determines how old your brain is. This number is called your \"DS Brain Age\". By performing daily exercises just minutes a day over weeks and months, the better you'll get at the exercises and the lower your DS Brain Age will become. [Nintendo]… Expand"}, {"name": "Syberia: The World Before", "details_link": "https://www.metacritic.com/game/playstation-5/syberia-the-world-before", "publisher": "Microids", "release_date": "Nov 15 2022", "developers": ["Koalabs"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/39826f7908d1120d788055dae723152f-98.jpg", "descriptions": "Vaghen, 1937: Dana Roze is a 17-year-old girl, who is beginning a brilliant career as a pianist. However, shadows begin to appear over her future as the fascist threat of the Brown Shadow hangs over Europe, at the dawn of the Second World War.Taiga, 2004: Kate Walker survives as best sheVaghen, 1937: Dana Roze is a 17-year-old girl, who is beginning a brilliant career as a pianist. However, shadows begin to appear over her future as the fascist threat of the Brown Shadow hangs over Europe, at the dawn of the Second World War.Taiga, 2004: Kate Walker survives as best she can in the salt mine where she has been imprisoned, when a tragic event propels her into a new adventure in search of her identity.Set off on an adventure across continents and through time. Play as both Kate Walker and Dana Roze as you get to the bottom of mysteries that have remained buried for too long.Explore the fantastic and poetic world of Benoît Sokal, with its breathtaking sceneries and iconic characters. Solve complicated puzzles and riddles in keeping with the tradition of the saga. Discover a rich and captivating story with unprecedented stakes and gripping dialogue.… Expand"}, {"name": "Tinykin", "details_link": "https://www.metacritic.com/game/playstation-5/tinykin", "publisher": "tinyBuild", "release_date": "Aug 30 2022", "developers": ["Splashteam"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "Platformer", "3D", "Command"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/ee2867c7cb3b6893490eed4079bdcbe0-98.jpg", "descriptions": "Milo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!\n\nFind a way home through a sprawling ant-sized metropolis, andMilo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!Find a way home through a sprawling ant-sized metropolis, and unravel Earth's biggest mystery!… Expand"}, {"name": "Tiny Metal: Full Metal Rumble", "details_link": "https://www.metacritic.com/game/switch/tiny-metal-full-metal-rumble", "publisher": "AREA35", "release_date": "Jul 11 2019", "developers": ["AREA35"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/c46c5cba1f536ed415e05eb6365dcb97-98.jpg", "descriptions": "Accompany a charming cast of characters through 39 campaign maps, packed with risky battles, a twisting story of mystery and tragedy, and increasingly difficult objectives."}, {"name": "Darksiders: Warmastered Edition", "details_link": "https://www.metacritic.com/game/switch/darksiders-warmastered-edition", "publisher": "THQ Nordic", "release_date": "Apr  2 2019", "developers": ["Nordic Games Publishing"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/98f43d76909d0a77d4997ff4ed0025d0-98.jpg", "descriptions": "Deceived by the forces of evil into prematurely bringing about the end of the world, War  the first Horseman of the Apocalypse  stands accused of breaking the sacred law by inciting a war between Heaven and Hell. In the slaughter that ensued, the demonic forces defeated the heavenly hostsDeceived by the forces of evil into prematurely bringing about the end of the world, War  the first Horseman of the Apocalypse  stands accused of breaking the sacred law by inciting a war between Heaven and Hell. In the slaughter that ensued, the demonic forces defeated the heavenly hosts and laid claim to the Earth.… Expand"}, {"name": "Skylanders: Spyro's Adventure", "details_link": "https://www.metacritic.com/game/playstation-3/skylanders-spyros-adventure", "publisher": "Activision", "release_date": "Oct 16 2011", "developers": ["Toys for Bob"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 77, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/1616d1cdf1df344fcd435b682ade402a-98.jpg", "descriptions": "The small purple dragon returns, bringing with him new friends in this peripheral-based adventure."}, {"name": "Cleopatra: Queen of the Nile", "details_link": "https://www.metacritic.com/game/pc/cleopatra-queen-of-the-nile", "publisher": "Sierra Entertainment", "release_date": "Jul 11 2000", "developers": ["BreakAway Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Management", "Historic", "Government"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/3db174494d79d682f84f69ebc1d8fdcc-98.jpg", "descriptions": "The Nile calls again as The Queen Of Kings takes center stage with four new campaigns. Offering a completely new story line starting with the New Kingdom Of Ancient Egypt, including the mysterious and exotic time of Cleopatra VII, this expansion pack will feed your Egyptian craving all overThe Nile calls again as The Queen Of Kings takes center stage with four new campaigns. Offering a completely new story line starting with the New Kingdom Of Ancient Egypt, including the mysterious and exotic time of Cleopatra VII, this expansion pack will feed your Egyptian craving all over again.  [Sierra Studios]… Expand"}, {"name": "Ace Combat: Assault Horizon", "details_link": "https://www.metacritic.com/game/playstation-3/ace-combat-assault-horizon", "publisher": "Namco Bandai Games", "release_date": "Oct 11 2011", "developers": ["Project Aces"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/44e0f2b38e1594f521a3c5a38d2eaa2f-98.jpg", "descriptions": "Climb back into the cockpit with another installment of the Ace Combat series."}, {"name": "Space Invaders: Invincible Collection", "details_link": "https://www.metacritic.com/game/switch/space-invaders-invincible-collection", "publisher": "Taito Corporation", "release_date": "Aug 17 2021", "developers": ["Taito Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/f9b3f31f524f7033e0ae165823740216-98.jpg", "descriptions": "Space Invaders is a founding block of video game history that filled the arcades. It is said that the game made 100 Yen coins scarce and defined the visuals and mechanics in the first decade of video games. Until this day, Space Invaders remains highly successful in the gaming industry asSpace Invaders is a founding block of video game history that filled the arcades. It is said that the game made 100 Yen coins scarce and defined the visuals and mechanics in the first decade of video games. Until this day, Space Invaders remains highly successful in the gaming industry as well as it is highly prominent in pop culture. Now the most complete collection on cart ever, the Space Invaders Invincible Collection, is heading to the West. It combines all titles from the Japanese standard and special releases on one cartridge, the limited Western collection even has the console port of the game Arkanoid vs. Space Invaders on cartridge, a unique title which was only available as a download code in the Japanese version!… Expand"}, {"name": "MotoGP 21", "details_link": "https://www.metacritic.com/game/xbox-series-x/motogp-21", "publisher": "Koch Media", "release_date": "Apr 22 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 14 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/d38ac4cd9a33c67125d2960bcea89432-98.jpg", "descriptions": "Discover all the official rosters and tracks and experience the thrill of the 2021 Season. And if you want to dive into the past, you can relive the MotoGP™ history with more than 40 riders and their iconic bikes. Take critical decisions and find a winning strategy to take over theDiscover all the official rosters and tracks and experience the thrill of the 2021 Season. And if you want to dive into the past, you can relive the MotoGP™ history with more than 40 riders and their iconic bikes. Take critical decisions and find a winning strategy to take over the Championship! Create your crew, choosing between official teams or a new one. Pick your staff, choosing your Personal Manager, a Chief Engineer, and a Data Analyst who will help you to make crucial choices such as the best contract to get and the bike development. Reach the MotoGP™ or Moto2™ class and assemble your very own Junior team. How you ride your bike will directly affect the tires wear. Worn tires make it more difficult to handle the bike. Manage it cautiously. Forget automatic respawns. If you fall, you must get up and get back on your bike as fast as possible. Never lose control. Customize helmet, suit, stickers, racing number, and livery with 5 incredible Graphic Editors! Once you’re done, share* your designs online or try on some of your fellow player’s creations. *You can share helmet, racing number and rider stickers. Just like the real riders, you’ll have to play by the rules of the official championship or you’ll face the consequences, including, for the first time, the Long Lap Penalty. Enjoy the most authentic MotoGP™ experience.\r… Expand"}, {"name": "Full Throttle Remastered", "details_link": "https://www.metacritic.com/game/pc/full-throttle-remastered", "publisher": "Double Fine Productions", "release_date": "Apr 18 2017", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/a517a1b08d4ad938f1f9168f2e7f9bab-98.jpg", "descriptions": "Released by LucasArts in 1995, Full Throttle is a classic graphic adventure game from Tim Schafer, telling the story of Ben Throttle butt-kicking leader of biker gang the Polecats, who gets caught up in a tale of Motorcycles, Mayhem and Murder. Now over 20 years later, Full Throttle is backReleased by LucasArts in 1995, Full Throttle is a classic graphic adventure game from Tim Schafer, telling the story of Ben Throttle butt-kicking leader of biker gang the Polecats, who gets caught up in a tale of Motorcycles, Mayhem and Murder. Now over 20 years later, Full Throttle is back in a remastered edition featuring all new hand-drawn and 3D high-resolution artwork, with remastered audio and music.\rPlayers can switch back and forth between classic and remastered modes, and mix and match audio, graphics and user interface to their heart’s desire. The've also included a concept art browser, and recorded a commentary track with the game’s original creators. … Expand"}, {"name": "We Were Here Forever", "details_link": "https://www.metacritic.com/game/pc/we-were-here-forever", "publisher": "Total Mayhem Games", "release_date": "May 10 2022", "developers": ["Total Mayhem Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/4667861b4a38f986bb717e3e942ee7c4-98.jpg", "descriptions": "You both awaken imprisoned inside the sinister Castle Rock - were you betrayed, or simply not that clever? Find out in the newest co-op puzzle adventure in the We Were Here Series! Do you and your partner have what it takes to face the dark forces of this realm or will you be trapped… forever?"}, {"name": "New Super Luigi U", "details_link": "https://www.metacritic.com/game/wii-u/new-super-luigi-u", "publisher": "Nintendo", "release_date": "Jun 20 2013", "developers": ["Nintendo"], "platforms": "Wii U", "num_players": "1-5 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/08a82461af3eb3bf1c0c2bc935faca20-98.jpg", "descriptions": "To continue the fun of New Super Mario Bros. U for Wii U, Nintendo is letting Luigi take over in new downloadable content that is coming in the Year of Luigi that provides alternate versions of the game's more than 80 stages. Players can freely change between the New Super Luigi U and NewTo continue the fun of New Super Mario Bros. U for Wii U, Nintendo is letting Luigi take over in new downloadable content that is coming in the Year of Luigi that provides alternate versions of the game's more than 80 stages. Players can freely change between the New Super Luigi U and New Super Mario Bros. U stages. These Luigi-focused stages provide a whole new level of game-play challenge and will be available for purchase as a single download.… Expand"}, {"name": "Game Builder Garage", "details_link": "https://www.metacritic.com/game/switch/game-builder-garage", "publisher": "Nintendo", "release_date": "Jun 11 2021", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Application"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/7bbc3306e8aa6b5159edd18f0993dc36-98.jpg", "descriptions": "Have you ever dreamed of building your own video games? The Game Builder Garage™ software is a great place to start! Anyone can learn the basics of game design and visual programming with step-by-step lessons created by the minds at Nintendo."}, {"name": "Life is Strange: Before the Storm", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-before-the-storm", "publisher": "Square Enix", "release_date": "Aug 31 2017", "developers": ["Deck Nine Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/6917d39d71c7244d710a08368ed53990-98.jpg", "descriptions": "Life is Strange: Before the Storm is a new three part standalone story adventure set three years before the events of the first game. This time play as Chloe Price, a rebel who forms an unlikely friendship with Rachel Amber in dramatic new story in the BAFTA award winning franchise."}, {"name": "FIFA Street", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-street", "publisher": "EA Sports", "release_date": "Mar 13 2012", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Arcade"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/a5c4017885065414630eef1a6720ebf9-98.jpg", "descriptions": "Powered by the revolutionary FIFA Soccer gameplay engine, and introducing Street Ball Control, FIFA Street will deliver an arsenal of groundbreaking street dribbling styles and trick moves that ignite the one-on-one battles within matches. Whether performing one panna after another withoutPowered by the revolutionary FIFA Soccer gameplay engine, and introducing Street Ball Control, FIFA Street will deliver an arsenal of groundbreaking street dribbling styles and trick moves that ignite the one-on-one battles within matches. Whether performing one panna after another without breaking a sweat the way street soccer is played in Amsterdam, or a physical, fight-for-possession style the way players compete in London, fans will enjoy a superior fidelity of ball control and responsiveness than anything ever experienced in a soccer videogame. Plus, for the first time ever, utilize aerial skills to maneuver past opponents, an all-new sophisticated one-touch passing system for quick, precision passes, and over 50 never-before-experienced skill moves.… Expand"}, {"name": "Awesomenauts", "details_link": "https://www.metacritic.com/game/xbox-360/awesomenauts", "publisher": "DTP Entertainment", "release_date": "May  2 2012", "developers": ["DTP Entertainment", "Ronimo Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "6  Online", "genres": ["Action", "Strategy", "Real-Time", "Fighting", "2D", "MOBA", "MOBA"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/1e3cf20fe8697dd7e0ca17706e279714-98.jpg", "descriptions": "The game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modernThe game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modern online multiplayer functionality, the action-packed gameplay offers everything the 16-bit generation and modern gamers love.… Expand"}]