[{"name": "WTA Tour Tennis", "details_link": "https://www.metacritic.com/game/game-boy-advance/wta-tour-tennis", "publisher": "Konami", "release_date": "May 31 2002", "developers": ["Now Production"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/9cb6bef53c5862701430b5dbb136d15c-98.jpg", "descriptions": "Take to the court and experience the realism and authenticity of WTA Tour Tennis. First, choose one of 20 professional tennis players such as Serena Williams, Martina Hingis, and Jelina Dokic--each with lifelike facial expressions and movements. Then, engage in fast-paced competition onTake to the court and experience the realism and authenticity of WTA Tour Tennis. First, choose one of 20 professional tennis players such as Serena Williams, Martina Hingis, and Jelina Dokic--each with lifelike facial expressions and movements. Then, engage in fast-paced competition on grass, clay, and hard surfaces. With simple controls, multiple levels of difficulty, and AI based on actual player attributes, WTA Tour Tennis challenges both newcomers and seasoned pros alike.… Expand"}, {"name": "All-Star Baseball 2002", "details_link": "https://www.metacritic.com/game/gamecube/all-star-baseball-2002", "publisher": "Acclaim", "release_date": "Nov 17 2001", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/18999b73bb1b39c8a0e40a1d365d6f74-98.jpg", "descriptions": "The GameCube version of All-Star Baseball 2002 exhibits many of the traits inherent to a port and ultimately fails to impress."}, {"name": "Far Gate", "details_link": "https://www.metacritic.com/game/pc/far-gate", "publisher": "Microids", "release_date": "Sep 10 2001", "developers": ["Super X Studios"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/f7fcac0bc3fcc1794f174b34e10ad4ca-98.jpg", "descriptions": "Seattle development house Super X Studios brings us this 3D real-time strategy title set in massive, constantly changing and moving  360° space environments with 16 missions, 3 unique races, and over 75 distinctive units."}, {"name": "Majestic", "details_link": "https://www.metacritic.com/game/pc/majestic", "publisher": "Electronic Arts", "release_date": "Jul 31 2001", "developers": ["Anim-X"], "platforms": "PC", "genres": ["Adventure", "General", "General"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/50d39fcdd6ed7abd34cd991d4c10d605-98.jpg", "descriptions": "Majestic is an episodic online entertainment experience set against the backdrop of a grand and sinister conspiracy -- an unfolding mystery adventure that uses the Internet as a canvas for its story, weaving you through both real and fictional experiences in real time.  [Electronic Arts]"}, {"name": "Alone in the Dark: The New Nightmare", "details_link": "https://www.metacritic.com/game/pc/alone-in-the-dark-the-new-nightmare", "publisher": "Infogrames", "release_date": "Jun 25 2001", "developers": ["Spiral House"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/dacc445bad0921f9ce07301ce8d275e7-98.jpg", "descriptions": "From the moment Edward Carnby and Aline Cedrac set foot on Shadow Island, they were confronted by evil creatures intent on thwarting their progress to recover three ancient tablets. Fears threaten from every corner. The slightest shadow could be hiding deep secrets, or concealing worseFrom the moment Edward Carnby and Aline Cedrac set foot on Shadow Island, they were confronted by evil creatures intent on thwarting their progress to recover three ancient tablets. Fears threaten from every corner. The slightest shadow could be hiding deep secrets, or concealing worse nightmares ... [Infogrames]… Expand"}, {"name": "SnoCross Championship Racing", "details_link": "https://www.metacritic.com/game/playstation/snocross-championship-racing", "publisher": "Crave", "release_date": "Aug 22 2000", "developers": ["UDS"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/40741c4d2f93d62fe89582c451391c28-98.jpg", "descriptions": "Strap on your goggle and helmet, choose your favorite sled and hit the courses. Gain experience day and night, sun, rain or snow, racing on the icy flats of Murmansk, the slopes of Aspen and the tunnels of Nagano."}, {"name": "Fitness Boxing", "details_link": "https://www.metacritic.com/game/switch/fitness-boxing", "publisher": "Nintendo", "release_date": "Jan  4 2019", "developers": ["Imagineer Co.,Ltd."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Exercise / Fitness"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/46271b6091f24b40e8287c838b6b2e13-98.jpg", "descriptions": "Get off the couch and get moving with fun, boxing-based rhythmic exercises set to the instrumental beats of songs by popular artists, including Lady Gaga, Pitbull and Kesha. You can personalize your workouts by selecting from different fitness goals. Train your way, whether you're on yourGet off the couch and get moving with fun, boxing-based rhythmic exercises set to the instrumental beats of songs by popular artists, including Lady Gaga, Pitbull and Kesha. You can personalize your workouts by selecting from different fitness goals. Train your way, whether you're on your own, with a friend, at home, or on the go! Now you can work out anytime, anywhere on the Nintendo Switch system!Get down your boxing basics while getting down to instrumental versions of 20 unlockable hit songs, including \"Party Rock Anthem\" by LMFAO, \"Call Me Maybe\" by Carly Rae Jepson, and \"Sugar\" by Maroon 5. Punch and squat while gripping the Joy-Con controllers to get your whole body moving -- no additional gym equipment required!Daily training ranges from 10-40 minutes and offers both Normal and Fast mode. The game software estimates your approximate BMI and daily calories burned so you can track your progress. Choose from a diverse group of trainers and customize their look with unlockable trainer outfits. As you progress, you can earn more songs and more challenging training circuits. If you prefer to work out with a buddy, you can use two sets of Joy-Con controllers or share a pair to enjoy working out cooperatively or test your skills by facing off against each other in a virtual ring!… Expand"}, {"name": "We Ski & Snowboard", "details_link": "https://www.metacritic.com/game/wii/we-ski-snowboard", "publisher": "Namco Bandai Games", "release_date": "Mar  3 2009", "developers": ["Bandai Namco Games"], "platforms": "Wii", "genres": ["Sports", "Alternative", "Individual", "Skiing", "Skiing", "Ski / Snowboard"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/7d2ecdd8b69a07dc68657bc75d89c174-98.jpg", "descriptions": "(Also known as \"Family Ski & Snowboard\")  Topping the list of enhancements in this latest installment of Wii Balance Board standouts is the addition of high-performance snowboarding, as well as improved skiing functionality, two massive new mountains and 10,000 more vertical meters. Complete(Also known as \"Family Ski & Snowboard\")  Topping the list of enhancements in this latest installment of Wii Balance Board standouts is the addition of high-performance snowboarding, as well as improved skiing functionality, two massive new mountains and 10,000 more vertical meters. Complete with fun boxes, rails and a half-pipe, both skiers and snowboarders alike can boost huge air and over-the-top aerial tricks in this epic wintry experience. We Ski & Snowboard is a wintry thrill ride through many different environments on the awesome Mt. Angrio and cool Jamboree Snow Resort. Players enjoy the classic motion-based controls popularized by We Ski using the Wii Remote and Nunchuk controllers, or by adding the increased realism of the Wii Balance Board for even more ski and snowboard action. Custom characters and player Mii’s add even more dimension to snow-capped adventures across even more mountain terrain than ever with vast free-riding areas. Leisurely gondola rides to sloping peaks invite a breathtaking panoramic experience, while heli-drops from extreme dizzying heights offer-up opportunities to shred down vertical cliffs and severe precipices. Players should be sure to watch out for avalanches. Hot Doggers can quench their thirst for excitement with half-pipe courses, and ski technique challenges, while loungers can look forward to other activities including ski school, board school, moguls and slaloms,  as well as animal search and rescue. Players can enjoy the sprawling vistas with day, night and dusk skiing, offering countless nuances to an ever-expanding list of experiences. The whole family can still enjoy fast-paced racing action or free-skiing with four-player fun, while single players can enjoy the ride with up to three AI-controlled skiing buddies. [Namco Bandai Games]… Expand"}, {"name": "This is the Police 2", "details_link": "https://www.metacritic.com/game/pc/this-is-the-police-2", "publisher": "Weappy Studio", "release_date": "Jul 31 2018", "developers": ["Weappy Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/13d8f542c2cc5f422a846c9cfd07f19c-98.jpg", "descriptions": "Interpret the law as you will. Run the sheriff’s department, manage your cops, investigate, interrogate, incarcerate, make tough decisions – and try to keep out of prison yourself. – in this story-driven mixture of adventure and strategy, set in a cold border town riven with violence."}, {"name": "Ice Age 2: The Meltdown", "details_link": "https://www.metacritic.com/game/wii/ice-age-2-the-meltdown", "publisher": "Vivendi Games", "release_date": "Dec  6 2006", "developers": ["Vivendi Games", "Eurocom"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/b7194c7a2968b0fb6217ff73bba5ff4a-98.jpg", "descriptions": "The Ice Age is ending and our subzero heroes return in this action adventure video game set in a melting paradise of water parks, geysers and tar pits.  Manny the Mammoth, Sid the Sloth and Diego the Sabre-Toothed Tiger are back and realize that the melting glaciers will soon flood theirThe Ice Age is ending and our subzero heroes return in this action adventure video game set in a melting paradise of water parks, geysers and tar pits.  Manny the Mammoth, Sid the Sloth and Diego the Sabre-Toothed Tiger are back and realize that the melting glaciers will soon flood their valley.  Fans will be able to play as their favorite characters from the film, along with everyone’s favorite sabre-toothed squirrel, Scrat, and embark on a mission across an increasingly dangerous landscape towards their salvation from a huge glacial dam that is about to break, threatening to flood the entire valley. [Sierra Entertainment]… Expand"}, {"name": "Looney Tunes: Duck Amuck", "details_link": "https://www.metacritic.com/game/ds/looney-tunes-duck-amuck", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct  9 2007", "developers": ["WayForward"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 66, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/abd62032d7a59cb42635bba08e342848-98.jpg", "descriptions": "Looney Tunes: Duck Amuck lets players wield the Nintendo DS stylus to irritate, aggravate and infuriate their own Daffy Duck in humorous ways. In the game inspired by the classic Duck Amuck cartoon, players compete against Daffy through a series of mini-games that range from retro inspiredLooney Tunes: Duck Amuck lets players wield the Nintendo DS stylus to irritate, aggravate and infuriate their own Daffy Duck in humorous ways. In the game inspired by the classic Duck Amuck cartoon, players compete against Daffy through a series of mini-games that range from retro inspired favorites to modern, innovative gameplay interactions, with the goal of driving Daffy's temperature, and his temper, through the roof. Duck Amuck also features wireless game play allowing players to not only gang up on Daffy as a team but also battle each other in head-to-head competition. [Warner Bros. Interactive]… Expand"}, {"name": "The Incredible Adventures of Van Helsing: Extended Edition", "details_link": "https://www.metacritic.com/game/playstation-4/the-incredible-adventures-of-van-helsing-extended-edition", "publisher": "NeocoreGames", "release_date": "Feb 28 2017", "developers": ["NeocoreGames"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/16d8203d2bfbc925c24ee8cf8f395742-98.jpg", "descriptions": "Set in a gothic-noir universe resembling a fantastical 19th century Europe filled with monsters, magic, and weird technology, The Incredible Adventures of Van Helsing will follow the son of the famed hunter, known in-game as Van Helsing, in a tale wrought with wry humor and snappy dialogue.Set in a gothic-noir universe resembling a fantastical 19th century Europe filled with monsters, magic, and weird technology, The Incredible Adventures of Van Helsing will follow the son of the famed hunter, known in-game as Van Helsing, in a tale wrought with wry humor and snappy dialogue. Van Helsing, a larger-than-life hero possessing a dark yet romantic charm, will follow his path to the dismal land of Borgovia where former supernatural foes have enlisted his help to defeat a new scourge terrorizing the ravaged Eastern European city. With an assortment of extraordinary characters, an engrossing storyline, and a beautifully dark and gothic art style, The Incredible Adventures of Van Helsing looks to bring RPG enthusiasts an anachronistic adventure like no other.… Expand"}, {"name": "AiRace Xeno", "details_link": "https://www.metacritic.com/game/3ds/airace-xeno", "publisher": "QubicGames", "release_date": "Jun 12 2014", "developers": ["QubicGames"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Futuristic"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/48b6c06e45ef2e3e093efbc0b3a2a61c-98.jpg", "descriptions": "Race on 9 adrenaline-fueled tracks. Fly extreme speeds with 3 advanced jets. Take the ultimate 3D challenge.\r After the success of its predecessors, AiRace Xeno brings back the speed and adrenaline to your Nintendo 3DS!\r\n\r\nTake the challenge and pilot the most advanced and powerful jets asRace on 9 adrenaline-fueled tracks. Fly extreme speeds with 3 advanced jets. Take the ultimate 3D challenge.\r After the success of its predecessors, AiRace Xeno brings back the speed and adrenaline to your Nintendo 3DS!\r Take the challenge and pilot the most advanced and powerful jets as you compete to beat your best time. Race on stunning high-speed tracks featuring extremlely difficult tunnels, spectacular halls and hidden shortcuts.\r Take speed to a whole new level and enjoy a frantic new gaming experience:\r-Take the challenge - fly extreme speeds across 9 adrenaline-fueled tracks\r-Stunning environments packed with challenging obstacles, tunnels, shortcuts and more\r-Take control of one of 3 high-speed, futuristic jets powered with advanced technology\r-High-performance graphics and immersive 3D effects that put you in the middle of the action\r-Compete against fellow competitors around the world in online leaderboards\r-Fantastic replay value with special achievements to be unlocked… Expand"}, {"name": "Oozi: Earth Adventure", "details_link": "https://www.metacritic.com/game/pc/oozi-earth-adventure", "publisher": "AwesomeGamesStudio", "release_date": "Sep 16 2012", "developers": ["AwesomeGamesStudio", "Awesome Games Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Compilation", "2D"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/3c3246e8c38ce869d2a37056665198f5-98.jpg", "descriptions": "We're happy to announce that Oozi: Earth Adventure is now available to all PC gamers! The PC version includes all four episodes previously released on Xbox Live Indie Games."}, {"name": "Adventures of Mana", "details_link": "https://www.metacritic.com/game/playstation-vita/adventures-of-mana", "publisher": "Square Enix", "release_date": "Jun 28 2016", "developers": ["Square Enix", "MCF"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/7e2672a1e6cc5307cd9971bebfc3c87d-98.jpg", "descriptions": "Enshrined atop Mt. Illusia, high above the lofty clouds, stands the Tree of Mana. Drawing its life energy from the boundless celestial aether, the sentinel grows in silence. Legend holds that he who lays his hands upon its trunk will be granted power eternal - a power the Dark Lord of GlaiveEnshrined atop Mt. Illusia, high above the lofty clouds, stands the Tree of Mana. Drawing its life energy from the boundless celestial aether, the sentinel grows in silence. Legend holds that he who lays his hands upon its trunk will be granted power eternal - a power the Dark Lord of Glaive now seeks to further fuel his bloody quest for domination.\r Our unlikely hero is one of countless gladiators indentured to the Duchess of Glaive. Each day, he and his ill-fated companions are dragged from their cells and bade to fight exotic beasts for the amusement of the Dark Lord. If victorious, they are thrown back into the dungeons with just enough bread to tide them over until their next match. But a body can only take so much, and it is never long before the weary captives succumb to their cruel fates.… Expand"}, {"name": "Neverwinter", "details_link": "https://www.metacritic.com/game/xbox-one/neverwinter", "publisher": "Perfect World Entertainment", "release_date": "Mar 31 2015", "developers": ["Cryptic Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 5 ", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/a42f5883f46f81d466e64e803be8ce4d-98.jpg", "descriptions": "Once a bustling location, Neverwinter has faced a great many disasters in the past hundred years. Rule of the city remains unclear following the unfortunate demise of the last Lord of Neverwinter and factions still battle for dominance after the all-consuming Spellplague took a high toll onOnce a bustling location, Neverwinter has faced a great many disasters in the past hundred years. Rule of the city remains unclear following the unfortunate demise of the last Lord of Neverwinter and factions still battle for dominance after the all-consuming Spellplague took a high toll on the population. Even Neverwinter's dead are beginning to rise from their graves and march upon the city they once called home.… Expand"}, {"name": "Secret Files: Tunguska", "details_link": "https://www.metacritic.com/game/pc/secret-files-tunguska", "publisher": "The Adventure Company", "release_date": "Oct 30 2006", "developers": ["Fusionsphere Systems"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/7f50c114069cef368b2fafa85c46e430-98.jpg", "descriptions": "Nina is torn from her day-to-day routine when she discovers that her father has disappeared without a trace. As the police seem reluctant to help her, Nina sets off to look for clues relating to her father's whereabouts. She joins efforts with Max Gruber, a young colleague of her father whoNina is torn from her day-to-day routine when she discovers that her father has disappeared without a trace. As the police seem reluctant to help her, Nina sets off to look for clues relating to her father's whereabouts. She joins efforts with Max Gruber, a young colleague of her father who impulsively offers to help the attractive young lady. Together, they quickly determine that Nina's father was involved with a research expedition to Siberia in an attempt to reveal the causes of the mysterious Tunguska catastrophe of 1908. In that mysterious event, a mighty explosion triggered an inferno that decimated the land of Tunguska. Nina and Max soon realize that her father's disappearance is related to the Tunguska event and the search for answers leads Nina and Max to the most remote corners of the world – Berlin, Moscow, Cuba, China, and the Antarctic. Powerful adversaries are also interested in Nina's father's secret. In the end, much more is at stake than just the disappearance of an old man. [DreamCatcher Interactive]… Expand"}, {"name": "No Place for Bravery", "details_link": "https://www.metacritic.com/game/pc/no-place-for-bravery", "publisher": "Ysbryd Games", "release_date": "Sep 22 2022", "developers": ["Glitch", "Glitch Factory"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/f5267bd3abdca6c772074fa551ecc04c-98.jpg", "descriptions": "Thorn, an old warrior worn down by decades of vim and violence, roams a world undone in search of his lost daughter. Dodge, parry & cleave your way out of brutal clashes in this 2D top-down action RPG, and discover the bone-chilling tale of Thorn's crusade to make his family whole again."}, {"name": "River City Saga: Three Kingdoms", "details_link": "https://www.metacritic.com/game/switch/river-city-saga-three-kingdoms", "publisher": "Arc System Works", "release_date": "Jul 21 2022", "developers": ["Aplus"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/7b0a1861a0fcc97372bac344f0f9afcb-98.jpg", "descriptions": "The River City cast of characters step onto the stage of the Three Kingdoms to wreak havoc! This title takes the concept of the beloved Downtown Special: River City Historical Drama! game and crosses international lines to tell the tale of the Romance of the Three Kingdoms. Watch the wackyThe River City cast of characters step onto the stage of the Three Kingdoms to wreak havoc! This title takes the concept of the beloved Downtown Special: River City Historical Drama! game and crosses international lines to tell the tale of the Romance of the Three Kingdoms. Watch the wacky and comedic action unfold as our hero Guan Yu (you may recognize him as Kunio) tries to survive the tumultuous times of the late Han dynasty. The rest of the cast make appearances as generals, tacticians, and more, giving the Three Kingdoms a River City twist! Enjoy a funny, action-packed take on famous historical events, from the Yellow Turban Rebellion to the Battle of Red Cliffs. The Beat ‘Em Up Action You Know and Love! The gameplay focuses on the beat ‘em up action the series is known for. Intricately connected areas form a massive game world. Aside from battle, you can enjoy shopping in villages and cities. Go sight-seeing and explore every nook and cranny!\r Turn the Tide of Battle with Flashy “Tactics” Moves!\r Turn the tides of battle in your favor with flashy “Tactics” moves! You can impact all the enemies on screen with these Tactics. Using them in specific areas could even lead to discoveries such as hidden rooms or passages…?… Expand"}, {"name": "Roguebook", "details_link": "https://www.metacritic.com/game/switch/roguebook", "publisher": "Nacon", "release_date": "Apr 21 2022", "developers": ["Abrakam SA"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle", "Tactics"], "meta_score": 66, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/a5e7fa572efe965189609e8790f7f884-98.jpg", "descriptions": "The ancients speak of a Book written since time immemorial containing all the world's legends. After many fabulous adventures, recounted in Faeria Chronicles of Gagana, this relic was lost in a well of Faeria. Through contact with this source of magic, the Book developed a wicked free willThe ancients speak of a Book written since time immemorial containing all the world's legends. After many fabulous adventures, recounted in Faeria Chronicles of Gagana, this relic was lost in a well of Faeria. Through contact with this source of magic, the Book developed a wicked free will of its own and became the Roguebook!You are trapped in the Book of Lore of Faeria, and each page represents a new challenge. Lead your two heroes to victory in this roguelike deckbuilder developed in partnership with Richard Garfield, creator of Magic: The Gathering. Put together the best synergies between cards, relics and abilities, and take on the Roguebook.… Expand"}, {"name": "Destroy All Humans!", "details_link": "https://www.metacritic.com/game/switch/destroy-all-humans!", "publisher": "THQ Nordic", "release_date": "Jun 29 2021", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Stadia", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/3e0cdfe1c53b573bb5b4b51e33070af1-98.jpg", "descriptions": "The cult-classic returns! Terrorise the people of 1950's Earth in the role of the evil alien Crypto-137. Harvest their DNA and bring down the US government in the faithful remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponryThe cult-classic returns! Terrorise the people of 1950's Earth in the role of the evil alien Crypto-137. Harvest their DNA and bring down the US government in the faithful remake of the legendary alien invasion action adventure. Annihilate puny humans using an assortment of alien weaponry and psychic abilities. Reduce their cities to rubble with your flying Saucer! One giant step on mankind!… Expand"}, {"name": "Peaky Blinders: Mastermind", "details_link": "https://www.metacritic.com/game/switch/peaky-blinders-mastermind", "publisher": "Curve Digital", "release_date": "Aug 20 2020", "developers": ["FuturLab"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/ea8151a395e284fc62f8f6d4bc4707b8-98.jpg", "descriptions": "Peaky Blinders: Mastermind is a puzzle-adventure game, based on the multi-award-winning BBC and Netflix TV show.\r Welcome to Birmingham, during the aftermath of the Great War. Set right before the events of Season One, Peaky Blinders: Mastermind lets you join the Shelby family's criminalPeaky Blinders: Mastermind is a puzzle-adventure game, based on the multi-award-winning BBC and Netflix TV show.\r Welcome to Birmingham, during the aftermath of the Great War. Set right before the events of Season One, Peaky Blinders: Mastermind lets you join the Shelby family's criminal gang. Follow the rise of Tommy as he successfully uncovers a sinister plot to put the family out of business, proving himself worthy of being the true mastermind of the Peaky Blinders.\r Mastermind refers to Tommy's ability to plan complex scenarios in his head. As the player, you get to exercise this power by taking control of key members of the Shelby family including Tommy, Arthur, Polly and more. Become the Mastermind as you freely reset and rewind each character's path in order to tune all of their actions for perfect coordination.\r Achieve the highest mission rating by strategically utilising characters and stealth to solve increasingly complex puzzles with optimum timing.… Expand"}, {"name": "Castaway Paradise", "details_link": "https://www.metacritic.com/game/playstation-4/castaway-paradise", "publisher": "Stolen Couch Games", "release_date": "Jul 31 2018", "developers": ["Stolen Couch Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/cb244722c0528f3c2378e05bb0664c73-98.jpg", "descriptions": "Your adventure starts when you get stranded on a tropical island. This is your island, your adventure. Do whatever you like! It’s the ultimate sandbox sim."}, {"name": "Her Majesty's SPIFFING", "details_link": "https://www.metacritic.com/game/xbox-one/her-majestys-spiffing", "publisher": "BillyGoat Entertainment Ltd", "release_date": "Dec  7 2016", "developers": ["BillyGoat Entertainment Ltd"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/a4821f2e1a6651ab30ea926dda4e9a94-98.jpg", "descriptions": "Taking command of the near future spaceship HMSS Imperialise and her crew, you delve into the cosmos, solving puzzles, engaging in humourous banter, deal with crippling claustrophobia, gradually succumb to the sustained exposure of cosmic radiation, and so on. All for Queen and Country."}, {"name": "Enigmatis: The Ghosts of Maple Creek", "details_link": "https://www.metacritic.com/game/xbox-one/enigmatis-the-ghosts-of-maple-creek", "publisher": "Artifex Mundi", "release_date": "Apr  8 2016", "developers": ["Artifex Mundi"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Puzzle", "Hidden Object", "General"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/aa3dc6e8fb0432f6d2befb1fc39d4445-98.jpg", "descriptions": "Imagine: you wake up in the evening after a powerful storm on a road in a tiny town in the middle of nowhere, with partial short-term memory loss. Thrilling shivers down your spine remind you of dramatic events that took place just before, yet which you have no memory of…The empty streetsImagine: you wake up in the evening after a powerful storm on a road in a tiny town in the middle of nowhere, with partial short-term memory loss. Thrilling shivers down your spine remind you of dramatic events that took place just before, yet which you have no memory of…The empty streets of the town suggest that you’re alone here, but then why do you feel that you’re being watched? And where are all the townsfolk? Behind every corner a new question is found, but there aren’t enough answers to go around. You’ll have to use your innate cunning to work out the most important thing – who you are and what you’re doing there. And when you remember, the real adventure begins!Will you dare to solve the ages-old mystery of Maple Creek? What ancient evil lurks there in the seemingly peaceful, picturesque rural lands of Vermont? Find a kidnapped teenage girl and save yourself in a thrilling detective story. Enigmatis: The Ghosts of Maple Creek is an outstanding Hidden-Object Puzzle-Adventure game!… Expand"}, {"name": "King Oddball", "details_link": "https://www.metacritic.com/game/playstation-vita/king-oddball", "publisher": "10tons Ltd", "release_date": "Feb  4 2014", "developers": ["10tons Ltd", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PlayStation Vita"], "genres": ["Miscellaneous", "Puzzle", "Action"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/4a8d8351d76ca1f9ca6a9081c0d694d5-98.jpg", "descriptions": "The primary gameplay features a single push of a button. The goal of each level is to clear the screen of tanks, soldiers and helicopters with 3 rocks or less. The King automatically picks up a boulder and swings it back and forth by his tongue, like a pendulum. The rock is released byThe primary gameplay features a single push of a button. The goal of each level is to clear the screen of tanks, soldiers and helicopters with 3 rocks or less. The King automatically picks up a boulder and swings it back and forth by his tongue, like a pendulum. The rock is released by hitting a button, and from there on it’s all about the physics. The key is to make sure each boulder takes out more than one target, and that can be ridiculously challenging. Sure, it’s easy at first… But you’ll just have to get to the later levels. [Playstation.com]… Expand"}, {"name": "Prey the Stars", "details_link": "https://www.metacritic.com/game/ds/prey-the-stars", "publisher": "Koei", "release_date": "Oct 13 2008", "developers": ["Koei Canada"], "platforms": "DS", "genres": ["Action", "General", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/03ed6bbade839baa97938c987798cd9e-98.jpg", "descriptions": "The main objective of Prey the Stars is to eat everything in sight and to attack your opponents. Each of the games colorfully-themed stages are cleared by devouring as much as possible before time runs out. The player with the highest score at the end of the stage is the winner. Each playerThe main objective of Prey the Stars is to eat everything in sight and to attack your opponents. Each of the games colorfully-themed stages are cleared by devouring as much as possible before time runs out. The player with the highest score at the end of the stage is the winner. Each player scores points by eating and by sucking in \"spirits\" which are hidden in some objects. The bigger the item, the higher the score. Prey the Stars offers a delicious smorgasbord of multiplayer options. Gamers can feast with up to 4 friends using local Wireless DS Single-Card Download Play or Multi-Card Play. Players can also take their gastronomic conquest worldwide with Nintendo Wi-Fi Connection. Exclusive character designs for Prey the Stars were created by break-out Japanese pop artist TOUMA. The highly-respected designer is renowned for his whimsical and edgy creations including, Knuckle Bear and Boo, that have taken the urban vinyl toy industry by storm. [Koei]… Expand"}, {"name": "Evil Dead: Regeneration", "details_link": "https://www.metacritic.com/game/xbox/evil-dead-regeneration", "publisher": "THQ", "release_date": "Sep 13 2005", "developers": ["Cranky Pants Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/38513cb1ad480648e6d55ccc069c2647-98.jpg", "descriptions": "Evil Dead: Regeneration takes over where the film Evil Dead 2 left off. You can play as Ash, who has been committed to an insane asylum where a mad scientist is doing experiments with the Necronomican. With the help of some firepower and your new sidekick, a 3-foot tall \"deadite,\"Evil Dead: Regeneration takes over where the film Evil Dead 2 left off. You can play as Ash, who has been committed to an insane asylum where a mad scientist is doing experiments with the Necronomican. With the help of some firepower and your new sidekick, a 3-foot tall \"deadite,\" you can battle the scientist's unholy creations and save civilization. … Expand"}, {"name": "Vampire: The Masquerade - Swansong", "details_link": "https://www.metacritic.com/game/pc/vampire-the-masquerade---swansong", "publisher": "Nacon", "release_date": "May 19 2022", "developers": ["Big Bad Wolf"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 66, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/3/39d936c8f2b19793be653e4b714b6eb0-98.jpg", "descriptions": "What if vampires were real? What if these bloodthirsty predators lived hidden among us, meticulously and skilfully hatching ancient conspiracies? And what if you became one of them? In Vampire: The Masquerade - Swansong, you play as these alluring monsters in a sophisticated world where theWhat if vampires were real? What if these bloodthirsty predators lived hidden among us, meticulously and skilfully hatching ancient conspiracies? And what if you became one of them? In Vampire: The Masquerade - Swansong, you play as these alluring monsters in a sophisticated world where the lines between the real and supernatural are always blurred.\r Hazel Iversen, the Swan, is the new Prince of the Boston Camarilla. An iron hand in a velvet glove, she intends to assert her power and respect the Masquerade, the vampiric law designed to ensure humans never learn of the existence of these creatures of the night. But nothing works as planned. With rumours of plots, murders and power struggles, you must work in the shadows to protect your Sect in a frantic investigation that plunges Boston into chaos.\r Play as 3 vampires who are over a hundred years old. Progress through the game through their intertwined destinies, deal with their different points of view and use their character sheets to try to separate the truth from the lies. Each character has their own abilities and vampiric disciplines that you can upgrade individually to suit your preferred approach.\rWill you choose intimidation, seduction or stealth? It's your decision, as long as you can sate your Hunger for blood.\r With its unique approach to gameplay, Swansong puts emphasis on the consequences of your actions in both the investigation and your social interactions with characters. Analyse each situation carefully because your decisions can have huge consequences on your heroes' lives and the fate of the Boston Camarilla.… Expand"}, {"name": "Aeon Flux", "details_link": "https://www.metacritic.com/game/playstation-2/aeon-flux", "publisher": "Majesco Games", "release_date": "Nov 15 2005", "developers": ["Terminal Reality"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 66, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/1103a81ff5ffcabbdb394668d2669645-98.jpg", "descriptions": "Aeon Flux is based on Peter Chung's popular futuristic MTV animated series and features a palpitating blend of stealth, speed and acrobatic combat. As beautiful as she is lethal, Aeon Flux is an agent whose abilities transcend everyday belief; she will depend upon those skills and talents toAeon Flux is based on Peter Chung's popular futuristic MTV animated series and features a palpitating blend of stealth, speed and acrobatic combat. As beautiful as she is lethal, Aeon Flux is an agent whose abilities transcend everyday belief; she will depend upon those skills and talents to rid the city of Bregna from an evil tyranny. Paramount Pictures'/Lakeshore Entertainment's Aeon Flux is set 400 years in the future, when disease has wiped out the majority of the earth's population except for one walled, protected city-state, Bregna, ruled by a congress of scientists. The story centers on Aeon Flux (Charlize Theron), the top operative in the underground 'Monican' rebellion, led by The Handler (Frances McDormand). When Aeon is sent on a mission to kill a government leader, she uncovers a world of secrets. [Majesco]… Expand"}, {"name": "Shredders", "details_link": "https://www.metacritic.com/game/xbox-series-x/shredders", "publisher": "Foam Punch", "release_date": "Mar 17 2022", "developers": ["Foam Punch"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 16 ", "genres": ["Sports", "Individual", "Ski / Snowboard"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/6a4a0bd245c7f2825c17c86cbee323b4-98.jpg", "descriptions": "Break into the snowboarding event of the year in the hope of scoring a wildcard entry to an exclusive invitational. To prove you’re up to the challenge, master the art of park riding, buttering, rails and massive kickers and earn your place in the world of snowboarding."}, {"name": "Cobalt", "details_link": "https://www.metacritic.com/game/xbox-one/cobalt", "publisher": "Mojang AB", "release_date": "Feb  2 2016", "developers": ["Oxeye"], "platforms": ["PC", "Xbox 360", "Xbox One"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/40633de2389ea3f16adf793da746a2f5-98.jpg", "descriptions": "Colbalt is a wacky action platformer from indie developer Mojang."}, {"name": "Marlow Briggs and the Mask of Death", "details_link": "https://www.metacritic.com/game/xbox-360/marlow-briggs-and-the-mask-of-death", "publisher": "505 Games", "release_date": "Sep 20 2013", "developers": ["ZootFly"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/182f271ae5688bd1267ccff022950c67-98.jpg", "descriptions": "A new breed of Warrior emerges, committed to destroying the enemies of freedom. No-nonsense hero Marlow never shies away from danger or trouble. But now he faces his ultimate challenge. Blasting into Central America, he has an industrial evil to defeat while bound to an ancient Mayan DeathA new breed of Warrior emerges, committed to destroying the enemies of freedom. No-nonsense hero Marlow never shies away from danger or trouble. But now he faces his ultimate challenge. Blasting into Central America, he has an industrial evil to defeat while bound to an ancient Mayan Death Mask who’s had no-one to talk to for 2000 years.… Expand"}, {"name": "Crysis Remastered", "details_link": "https://www.metacritic.com/game/switch/crysis-remastered", "publisher": "Crytek", "release_date": "Jul 23 2020", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/8efd5af663f1f0be7be6d3b20185203e-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Suit up: Your Nanosuit’s speed, strength, armor, and cloaking allow creative solutions for every kind of fight. Adapt: In anThe classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. Suit up: Your Nanosuit’s speed, strength, armor, and cloaking allow creative solutions for every kind of fight. Adapt: In an ever-changing environment, adapt your tactics to dominate on battlefields ranging from frozen jungle to alien environments. Customize: A huge arsenal of modular weaponry provides unprecedented control over play style, with options ranging from the experimental to the alien. Conquer: Life-like enemy AI require a strategic and flexible playstyle, as new challenges – including a zero-g battlefield– require players to take the offensive and be proactive. Explore: Choose your own path through the open world of Crysis, destroying obstacles, driving vehicles, and using the environment itself against your enemies. What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a North Korean island chain. Armed with a powerful Nanosuit, players can become invisible to stalk enemy patrols, or boost strength to lay waste to vehicles. The Nanosuit’s speed, strength, armor, and cloaking allow creative solutions for every kind of fight, while a huge arsenal of modular weaponry provides unprecedented control over play style. In the ever-changing environment, adapt tactics and gear to dominate your enemies, in an enormous sandbox world.… Expand"}, {"name": "F.E.A.R. Files", "details_link": "https://www.metacritic.com/game/xbox-360/fear-files", "publisher": "Sierra Entertainment", "release_date": "Nov  6 2007", "developers": ["TimeGate Studios", "Day 1 Studios"], "platforms": "Xbox 360", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/1a0df6dc36adc7da43c8ae3ec8fb28bd-98.jpg", "descriptions": "F.E.A.R. Files uses combat adaptable AI to provide an intense \"action movie\" experience while keeping players engrossed in it's spine-chilling storylines. Gamers will assume the roles of an elite soldier trained in combating unusual and unimaginable situations. Called in to confront aF.E.A.R. Files uses combat adaptable AI to provide an intense \"action movie\" experience while keeping players engrossed in it's spine-chilling storylines. Gamers will assume the roles of an elite soldier trained in combating unusual and unimaginable situations. Called in to confront a mysterious force, the player must escape from a crisis spiraling out of control. F.E.A.R. Files contains two F.E.A.R. missions which provide the player with a unique fusion of stylized first-person shooter and supernatural suspense that will keep gamers at the edge of their seats. Includes the brand new Perseus Mandate campaign as well as the award-winning expansion pack Extraction Point. New multipayer and instant action maps, and new F.E.A.R. missions never before available on console. Engage in unpredictable encounters with combat adaptable A.I. Battle new and even more terrifying of enemies with 6 new weapons. Enhanced destructible environments. Frenetic multiplayer support for up to 16 players. [Sierra]… Expand"}, {"name": "Theatre of War", "details_link": "https://www.metacritic.com/game/pc/theatre-of-war", "publisher": "Battlefront.com", "release_date": "Apr 19 2007", "developers": ["Battlefront.com", "1C", "1C Entertainment"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Tactics"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/53b89a8e3cd154de3a997dc75ce1b046-98.jpg", "descriptions": "Theatre of War is a World War Two real-time strategy game. Theatre of War depicts authentic battles of World War II between 1939-1945. Command hundreds of different unit types in 5 historically accurate campaigns (US, UK, Soviet, German, French and Polish). This isn't just another WW2 RTSTheatre of War is a World War Two real-time strategy game. Theatre of War depicts authentic battles of World War II between 1939-1945. Command hundreds of different unit types in 5 historically accurate campaigns (US, UK, Soviet, German, French and Polish). This isn't just another WW2 RTS click-fest, but a Real Time Combat Simulator with an emphasis firmly entrenched on realism and detail, historical accuracy, and real world military tactics that will challenge even the most battle hardened armchair general. [Battlefront.com]… Expand"}, {"name": "WRC: FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/xbox-360/wrc-fia-world-rally-championship", "publisher": "Deep Silver", "release_date": "Oct 20 2010", "developers": ["Milestone S.r.l"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/c9ecd1ea2dc2091b96858491710b8e2b-98.jpg", "descriptions": "Official locations, official rally cars and official drivers - everything in WRC FIA World Rally Championship is designed to give the player the full experience of taking part in one of the most ferocious and challenging motorsports. WRC FIA World Rally Championship features \"Road toOfficial locations, official rally cars and official drivers - everything in WRC FIA World Rally Championship is designed to give the player the full experience of taking part in one of the most ferocious and challenging motorsports. WRC FIA World Rally Championship features \"Road to the WRC\", an unrivalled career mode that will allow players to hit the dirt to win the ultimate championship. With advanced car tuning, stunning car damage effects and the opportunity to race against heroes of the sport, WRC FIA World Rally Championship is the closest you can get to being one of the most skilled and fearless drivers in the world.… Expand"}, {"name": "Mole Control", "details_link": "https://www.metacritic.com/game/pc/mole-control", "publisher": "MumboJumbo", "release_date": "Jan 20 2010", "developers": ["Remode"], "platforms": "PC", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/e4945e70657d53675c399ed6c1bc716a-98.jpg", "descriptions": "The people of Molar Creek have lived alongside the region's infamous exploding moles for hundreds of years but the night before the village's annual Mole Control competition and a mystery villain has set the exploding moles loose within the town itself. It's now down to you and localThe people of Molar Creek have lived alongside the region's infamous exploding moles for hundreds of years but the night before the village's annual Mole Control competition and a mystery villain has set the exploding moles loose within the town itself. It's now down to you and local inventor Dr Kraft to find the moles and reclaim Molar Creek. Mole Control is a puzzle game that brings the classic logic based game play of minesweeper into the 21st century. Pilot a crazy invention across a mind-bending adventure, or enjoy a frantic time attack challenge, all with the comical aim to rid one town of exploding moles. [Blizt]… Expand"}, {"name": "Rumble Roses", "details_link": "https://www.metacritic.com/game/playstation-2/rumble-roses", "publisher": "Konami", "release_date": "Nov  9 2004", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 66, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/6ca0ceb8dbec93b196e2528f496b231b-98.jpg", "descriptions": "Get down with Rumble Roses, the first and only all-women?s wrestling game on any platform. These wrestling beauties not only score a perfect 10,000 polygons per character, they also have all the some of the best moves and talent found in any wrestling game. But make sure to watch out forGet down with Rumble Roses, the first and only all-women?s wrestling game on any platform. These wrestling beauties not only score a perfect 10,000 polygons per character, they also have all the some of the best moves and talent found in any wrestling game. But make sure to watch out for that Mud Match Mode, because these sexy vixens might get dirty. Gorgeous female models and amazing gameplay. Play in the mud with the Rumble Roses in Mud Match Mode. Develop good or bad personas to change costumes and moves. [Konami]… Expand"}, {"name": "I Am Alive", "details_link": "https://www.metacritic.com/game/pc/i-am-alive", "publisher": "Ubisoft", "release_date": "Sep  6 2012", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/0efabe00bad447b2e416194612895b6c-98.jpg", "descriptions": "I Am Alive thrusts you into the role of a lone survivor in a believable, dark and insecure post-apocalyptic world. One year after the Event, a worldwide cataclysmic event that wiped most of the human race, a man struggles for survival in a desolate city as he tries to reunite with his longI Am Alive thrusts you into the role of a lone survivor in a believable, dark and insecure post-apocalyptic world. One year after the Event, a worldwide cataclysmic event that wiped most of the human race, a man struggles for survival in a desolate city as he tries to reunite with his long lost wife and daughter.… Expand"}, {"name": "Vempire", "details_link": "https://www.metacritic.com/game/psp/vempire", "publisher": "impressionware", "release_date": "Oct 22 2009", "developers": ["impressionware"], "platforms": ["iPhone/iPad", "PSP"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/da1d1f8ef2f6759d32eae2bc73f5ecdb-98.jpg", "descriptions": "[PSP Minis]  In this strategy-based puzzle game, you collect artifacts and powers to tackle a series of levels and monsters."}, {"name": "Toki", "details_link": "https://www.metacritic.com/game/switch/toki", "publisher": "Microids", "release_date": "Dec  4 2018", "developers": ["Microids"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/f9734b35304816e014ad166ac8ed1c79-98.jpg", "descriptions": "Toki sets off on a new adventure! The cult action/platform game originally released on arcade machines in 1989 is back with a super-simian new version, featuring all-new hand-drawn graphics and re-orchestrated music. Toki the warrior lived peacefully in the jungle with his sweetheart Miho.Toki sets off on a new adventure! The cult action/platform game originally released on arcade machines in 1989 is back with a super-simian new version, featuring all-new hand-drawn graphics and re-orchestrated music. Toki the warrior lived peacefully in the jungle with his sweetheart Miho. Appearing out of nowhere, the terrifying voodoo sorcerer Vookimedlo and heinous demon Bashtar kidnap Miho and turn the poor Toki into a chimpanzee! Unfortunately for his sweetheart, he has become a hairy, lethargic ape... … Expand"}, {"name": "Desperados 2: Cooper's Revenge", "details_link": "https://www.metacritic.com/game/pc/desperados-2-coopers-revenge", "publisher": "Atari", "release_date": "May  5 2006", "developers": ["Spellbound"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/cabe619d323f14bb8aeaa8bb75e44d3b-98.jpg", "descriptions": "Desperados 2 is the sequel of the successful wild west title \"Desperados – Wanted Dead or Alive\".\rThe gameplay is based on its predecessor but with brand new tactical possibilities in a beautiful 3D environment. The player is able to switch from an isometric view to a third person viewDesperados 2 is the sequel of the successful wild west title \"Desperados – Wanted Dead or Alive\".\rThe gameplay is based on its predecessor but with brand new tactical possibilities in a beautiful 3D environment. The player is able to switch from an isometric view to a third person view whenever he wants, for example for duels, brawls and shoot-outs. There will be a great variety of setting for example dusty canyons, ghost towns, Indian villages and forts creating a breathtaking atmosphere. Take on the role of up to 6 heroes including the famous bounty hunter John Cooper and experience in a thrilling story with surprising turns. [Spellbound]… Expand"}, {"name": "Atari Mania", "details_link": "https://www.metacritic.com/game/switch/atari-mania", "publisher": "Atari", "release_date": "Oct 13 2022", "developers": ["iLLOGIKA"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/0645412158af90bd1176c634ccf1b622-98.jpg", "descriptions": "A wild journey through videogame history, Atari Mania is a microgame collection wrapped in an hilarious retro-driven narrative of exploration and surprise.You play as the Caretaker of the Atari Vault, the storehouse of classic Atari games. One night, a dead pixel appears and soon enough,A wild journey through videogame history, Atari Mania is a microgame collection wrapped in an hilarious retro-driven narrative of exploration and surprise.You play as the Caretaker of the Atari Vault, the storehouse of classic Atari games. One night, a dead pixel appears and soon enough, all heck breaks loose!!Familiar and beloved games begin to warp, mutate and combine into a series of increasingly crazy challenges. It's up to you to fight back the pixels and other surprising villains, and restore order to the Vault!… Expand"}, {"name": "Super Stardust Ultra VR", "details_link": "https://www.metacritic.com/game/playstation-4/super-stardust-ultra-vr", "publisher": "Sony Interactive Entertainment", "release_date": "Oct 10 2016", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/89a74b2d60bb5680d7cc4300e4dd079c-98.jpg", "descriptions": "Explode into the classic PlayStation shooter with an entirely new perspective – get ready to defend your planet once more, this time from inside the cockpit of your powerful star fighter. Get into the very center of the action and fight using intuitive controls only possible with PlayStationExplode into the classic PlayStation shooter with an entirely new perspective – get ready to defend your planet once more, this time from inside the cockpit of your powerful star fighter. Get into the very center of the action and fight using intuitive controls only possible with PlayStation VR: simply look to aim… then fire to destroy. Play the original Super Stardust Ultra game modes, enhanced for PlayStation VR, and battle for global domination in the online leader boards. Will you claim the title of best Super Stardust pilot in the world? [Playstation.com]\r… Expand"}, {"name": "The Incredible Adventures of Van Helsing II", "details_link": "https://www.metacritic.com/game/xbox-one/the-incredible-adventures-of-van-helsing-ii", "publisher": "NeocoreGames", "release_date": "Jul  1 2016", "developers": ["NeocoreGames"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/362eaebe90ad3737a607db585caba68a-98.jpg", "descriptions": "The incredible adventures continue, and Van Helsing, the famous monster-hunter returns to save the day again with the help of his charming, ghostly companion, Lady Katarina. The gothic metropolis of weird science is on the brink of destruction as chaos rules the streets and a new enemy plotsThe incredible adventures continue, and Van Helsing, the famous monster-hunter returns to save the day again with the help of his charming, ghostly companion, Lady Katarina. The gothic metropolis of weird science is on the brink of destruction as chaos rules the streets and a new enemy plots revenge. It’s time to enter the dark side of Borgova and the forbidden wilderness, but beware: you are not the only one behind a mask.… Expand"}, {"name": "LEGO Star Wars III: The Clone Wars", "details_link": "https://www.metacritic.com/game/ds/lego-star-wars-iii-the-clone-wars", "publisher": "LucasArts", "release_date": "Mar 22 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/c5a176d5a3f28c4cb2488096af2ef5d7-98.jpg", "descriptions": "LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes,LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes, giving players unique, head-to-head combat and an upgraded level builder, allowing the creation of customized bases and in-game battlefields. Play either as a Jedi or Separatist with all-new character abilities, such as Squad command, Lightsaber slicing, Lightsaber jumps, long distance Jedi attacks and Grapple Tie-Ups, all within a new, easy-to-navigate hub.… Expand"}, {"name": "Nerf N-Strike", "details_link": "https://www.metacritic.com/game/wii/nerf-n-strike", "publisher": "Electronic Arts", "release_date": "Oct 28 2008", "developers": ["EA Redwood Shores", "EA Salt Lake"], "platforms": "Wii", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/3cd674e8a169098548bac29ad08a9092-98.jpg", "descriptions": "Choose Your Weapons: Play with over 25 NERF Blasters including the Vulcan EBF-25, Longshot CS-6, Maverick REV-6, and many never seen before! Blast through Danger: Explore a top-secret NERF facility and unravel the mystery of the unknown threat that awaits. Multiplayer Action: Go head to headChoose Your Weapons: Play with over 25 NERF Blasters including the Vulcan EBF-25, Longshot CS-6, Maverick REV-6, and many never seen before! Blast through Danger: Explore a top-secret NERF facility and unravel the mystery of the unknown threat that awaits. Multiplayer Action: Go head to head with up to 4 players using additional Wii Remotes and Switch Shot blasters. [Electronic Arts]… Expand"}, {"name": "Wolf of the Battlefield: Commando 3", "details_link": "https://www.metacritic.com/game/playstation-3/wolf-of-the-battlefield-commando-3", "publisher": "Capcom", "release_date": "Jun  5 2008", "developers": ["Backbone Emeryville"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "3  Online", "genres": ["Action", "General", "General"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/da9636a7bbc757f382519fec3e974395-98.jpg", "descriptions": "[Playstation Network]  One of the most popular arcade shooters is back with a vengeance. Wolf of the Battlefield: Commando 3 revives the classic Commando franchise with an all new adventure. Fight solo or recruit two other specialized commandos to defeat the evil tyrant, General Ratiev and[Playstation Network]  One of the most popular arcade shooters is back with a vengeance. Wolf of the Battlefield: Commando 3 revives the classic Commando franchise with an all new adventure. Fight solo or recruit two other specialized commandos to defeat the evil tyrant, General Ratiev and his army of Zalestad soldiers. This frantic war fest combines precise, old-school gameplay with High Definition 3D graphics. Play as codename Wolf, Coyote or Fox as you take on waves of soldiers, rescue P.O.W.’s and blow up armored vehicles through a variety of dangerous battlefields. The missions become even more chaotic in 3 player local or online co-operative campaigns where the game adjusts its difficulty, so don’t let your guard down. Jump into tanks and jeeps together to boost up your firepower. With loads of weapons and power-ups at your disposal, gear up and blast your way to victory. [SCEA]… Expand"}, {"name": "Mobile Suit Gundam: Encounters in Space", "details_link": "https://www.metacritic.com/game/playstation-2/mobile-suit-gundam-encounters-in-space", "publisher": "Bandai", "release_date": "Dec  5 2003", "developers": ["Bandai"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 66, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/711ce1dcf5621d83d67b12e33b04b2cc-98.jpg", "descriptions": "For the first time ever, dive into the combat as your favorite 0083 character in this action-loaded space shooter. Fight your way through space, destroying enemy battleships and mobile suits, to defeat the evil dictators of the Principality of Zeon and end the One Year War. The fate of theFor the first time ever, dive into the combat as your favorite 0083 character in this action-loaded space shooter. Fight your way through space, destroying enemy battleships and mobile suits, to defeat the evil dictators of the Principality of Zeon and end the One Year War. The fate of the Universal Century is in your hands - can you handle it? 70+ mobile suits and armors from 0079, 0083, Gundam Wing, G Gundam and Gundam Seed. Plus original mobile suits created especially for the game! 5 playable modes. Experience legendary Gundam battles or execute your own incredible missions. Choose from 10 of the best Ace Pilots or train and develop your own. Build your own team of mobile suits in the versus mode and battle it out with your friends - who will achieve domination over the Universal Century? [Bandai]… Expand"}, {"name": "Aliens Versus Predator: Extinction", "details_link": "https://www.metacritic.com/game/playstation-2/aliens-versus-predator-extinction", "publisher": "EA Games", "release_date": "Jul 30 2003", "developers": ["Zono Inc."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Sci-Fi"], "meta_score": 66, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/1a573c0c64a2f2dcdd987b5ac77c44fe-98.jpg", "descriptions": "On a cold distant planet, the war against extinction is on and your command skills will determine its outcome. Control an Alien hive, Predator clan, or lead an elite squad of Colonial Marines and fight for the survival of your race. Harness the unique advantages as an Alien, Predator orOn a cold distant planet, the war against extinction is on and your command skills will determine its outcome. Control an Alien hive, Predator clan, or lead an elite squad of Colonial Marines and fight for the survival of your race. Harness the unique advantages as an Alien, Predator or Colonial Marine to wage war in 21 single-player missions. Control one of three different races - each with its own characteristics and abilities to suit any style of play. Upgrade up to 10 different unit types of various races including new, never before seen units such as the Predator Hydra or Alien Ravager. Engage the enemy in 21 unique maps, from jungles to deserts to high-tech laboratories. Utilize powerful resources and strategies including pulse rifles, exosuits and air strikes to unleash devastating attacks on your enemies. [Electronic Arts]… Expand"}, {"name": "Return to Castle Wolfenstein: Operation Resurrection", "details_link": "https://www.metacritic.com/game/playstation-2/return-to-castle-wolfenstein-operation-resurrection", "publisher": "Activision", "release_date": "May 30 2003", "developers": ["Raster"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/85b8f7b6215d8e999ed65ae601cdc01a-98.jpg", "descriptions": "Engage in an epic, story-driven campaign across over 30 levels - from forests and war-torn cities to villages and crypts. Infiltrate top-secret airfields and compounds, silently assassinate enemy officers and escort caputred Panzer tanks. You are B.J. Blazkowicz, a US Army Ranger recruitedEngage in an epic, story-driven campaign across over 30 levels - from forests and war-torn cities to villages and crypts. Infiltrate top-secret airfields and compounds, silently assassinate enemy officers and escort caputred Panzer tanks. You are B.J. Blazkowicz, a US Army Ranger recruited by the OSA and the Allies' top specialist in covert operations, heavy weapons and assassination. Hilter's head of the SS, Heinrich Himmler, is twisting science and the occult into an army capable of annihiliating the Allies. The balance of victory is in your hands. [Activision]… Expand"}, {"name": "Superman: Shadow of Apokolips", "details_link": "https://www.metacritic.com/game/gamecube/superman-shadow-of-apokolips", "publisher": "Atari", "release_date": "Mar 25 2003", "developers": ["Atari"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/4c1ba8dbce068e2faf1ec0e5bdccf1ec-98.jpg", "descriptions": "The man of steel faces his greatest challenge yet in Superman: Shadow of Apokolips.  Darkseid, the most evil being in the galaxy, has enlisted the aid of Lex Luthor in his quest to destroy Superman and take over the world.  As Superman, you must stop Luthor's army of Inter-Bot robots and theThe man of steel faces his greatest challenge yet in Superman: Shadow of Apokolips.  Darkseid, the most evil being in the galaxy, has enlisted the aid of Lex Luthor in his quest to destroy Superman and take over the world.  As Superman, you must stop Luthor's army of Inter-Bot robots and the fearsome Metallo, who is fresh out of Strykers Island Prison.  Use all of Superman's powers through 14 enormous levels, featuring epic battles with legendary villains, including Livewire and Parasite.  The fate of the planet lies in your hands.… Expand"}, {"name": "Jet X2O", "details_link": "https://www.metacritic.com/game/playstation-2/jet-x2o", "publisher": "SCEA", "release_date": "Oct 28 2002", "developers": ["Killer Game"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/b168d18bd17f74984264a71972248691-98.jpg", "descriptions": "Roaring through 8 massive, exotic levels as fast as a professional watercraft rider, you're the envy of all other racers. While racing one of your highly stylized watercraft through raging rivers, turbulent rapids, massive waterfalls and hair-pin turns in far off lands such as Atlantis, theRoaring through 8 massive, exotic levels as fast as a professional watercraft rider, you're the envy of all other racers. While racing one of your highly stylized watercraft through raging rivers, turbulent rapids, massive waterfalls and hair-pin turns in far off lands such as Atlantis, the Artic, and humid South American jungles, you know you're good. But you're not alone. Your competitors know the intensity of the races. They know that this is not just a race of speed, but a test of extreme trick skill. They also know they want to beat you. They are ready for the challenge.… Expand"}, {"name": "Moto Racer 3", "details_link": "https://www.metacritic.com/game/pc/moto-racer-3", "publisher": "Atari", "release_date": "Jan 31 2002", "developers": ["Delphine Software International"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross", "Motocross"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/0443b19609d4d6d5b963c22f596d442d-98.jpg", "descriptions": "Weave your way through realistic downtown Paris in the never before seen Traffic mode. Features six blood-pumping racing styles, including street, motocross, supercross, freestyle, trial and traffic with 32 all-new bikes. 15 tracks immerse the player in completely different racingWeave your way through realistic downtown Paris in the never before seen Traffic mode. Features six blood-pumping racing styles, including street, motocross, supercross, freestyle, trial and traffic with 32 all-new bikes. 15 tracks immerse the player in completely different racing environments, such as Grand Prix, touring, indoor, and outdoor. [Infogrames]… Expand"}, {"name": "Biomutant", "details_link": "https://www.metacritic.com/game/pc/biomutant", "publisher": "THQ Nordic", "release_date": "May 25 2021", "developers": ["Experiment 101"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/0f9d52cfcb1909bee63f4d8d5016046b-98.jpg", "descriptions": "Biomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action. Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruiningBiomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action. Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruining the land and the Tree-of-Life is bleeding death from its roots. The Tribes stand divided, in need of someone strong enough to unite them or bring them all down...\rAlthough you are guided through the world by a Storyteller that narrates every step of your journey, it's your actions and choices that'll decide how your story of survival ends.… Expand"}, {"name": "Unsolved Crimes", "details_link": "https://www.metacritic.com/game/ds/unsolved-crimes", "publisher": "Atari", "release_date": "Sep 30 2008", "developers": ["Now Production"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/8a30951f1a1fb39f3af632f3d90910b1-98.jpg", "descriptions": "In Unsolved Crimes, players assume the role of a rookie detective as part of the New York police department homicide division. An aspiring model, Betsy Blake, has disappeared and a social outcast and loner is the prime suspect. The case is deeper than it appears on the surface. Crime isIn Unsolved Crimes, players assume the role of a rookie detective as part of the New York police department homicide division. An aspiring model, Betsy Blake, has disappeared and a social outcast and loner is the prime suspect. The case is deeper than it appears on the surface. Crime is rampant in the city and Blake's disappearance is the latest in a frightening series of events that are slowly bringing New York to its knees. The local police department is having a hard time cracking the case and Blake's safe return lies in the detectives' hands to solve the mystery before it's too late. Unsolved Crimes integrates three gaming elements - an action game, a 3D crime investigation and a crime quiz - to provide players with a unique, absorbing experience. The game fully utilizes the DS's unique Dual Screen, allowing players to immerse themselves in the New York environments. The innovative use of the stylus allows players to trace marks, routes and memos on suspicious items discovered at crime scenes, all allowing players to move closer to solving the kidnapping mystery. The engaging storyline runs throughout the game, fully immersing players in the world of Unsolved Crimes with more than eight independent cases to solve in the diverse and fully interactive environments. [Empire Interactive]… Expand"}, {"name": "One Piece: Burning Blood", "details_link": "https://www.metacritic.com/game/playstation-4/one-piece-burning-blood", "publisher": "Bandai Namco Games", "release_date": "May 31 2016", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/83178ab6c410346202f281d27b6277a5-98.jpg", "descriptions": "Embark with the Straw Hat Crew and collect your bounty in this anime fighter. Use Devil Fruit abilities, Haki techniques, and punishing combos to turn the tide in the ultimate One Piece battle royale. Step into the New World with over the top head to head combat featuring all the action,Embark with the Straw Hat Crew and collect your bounty in this anime fighter. Use Devil Fruit abilities, Haki techniques, and punishing combos to turn the tide in the ultimate One Piece battle royale. Step into the New World with over the top head to head combat featuring all the action, drama and comedy of this infamous pirate saga.… Expand"}, {"name": "The Last Remnant", "details_link": "https://www.metacritic.com/game/xbox-360/the-last-remnant", "publisher": "Square Enix", "release_date": "Nov 20 2008", "developers": ["Square Enix"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/5b2363ec9875bd270b3924403bb07324-98.jpg", "descriptions": "Long ago, the world was filled with Remnants — mysterious artifacts from an ancient civilization. But as time passed, the powers of the Remnants began to shift the world's balance. As the rift widened between those who ruled and those who were ruled over, a new era dawned: one of countlessLong ago, the world was filled with Remnants — mysterious artifacts from an ancient civilization. But as time passed, the powers of the Remnants began to shift the world's balance. As the rift widened between those who ruled and those who were ruled over, a new era dawned: one of countless frays brought upon the world by those enslaved by their own lust for power. A thousand years later, the journey of one young man begins... Imagine a vast, war-torn battlefield, scarred by years of conflict. Countless enemies surround the player, who is backed up by his own army. Threatened by numerous foes and saved in the nick of time by allies, players feel the true tension of a soldier on the battlefield. In The Last Remnant, as many as seventy units duke it out at once in fierce yet beautiful battles. [Square Enix]… Expand"}, {"name": "Samurai Champloo: Sidetracked", "details_link": "https://www.metacritic.com/game/playstation-2/samurai-champloo-sidetracked", "publisher": "Namco Bandai Games America", "release_date": "Apr 11 2006", "developers": ["Grasshopper Manufacture"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/84c302f78ec41a31d335a4a835ff9fc4-98.jpg", "descriptions": "Samurai Champloo steps out of the hack-and-slash action genre and offers a new way to swing a finely-honed samurai blade. Set in Japan with hip hop feel from the hit TV series by the same name, this title allows gamers to breathe life to a \"lost episode\" as one of three playable characters –Samurai Champloo steps out of the hack-and-slash action genre and offers a new way to swing a finely-honed samurai blade. Set in Japan with hip hop feel from the hit TV series by the same name, this title allows gamers to breathe life to a \"lost episode\" as one of three playable characters – Mugen, a reckless samurai with break-dancing fighting style, calculated Jin who abides by the decorum of Bushido, and a mysterious new character exclusive to the video game. Stranded in northern land of Ezo (current day Hokkaido) in search of the samurai who smells of sunflowers, the player must face foreign mercenaries, master swordsmen, diabolical assassins, mythical beasts, and gangster monkeys. The core of the game's unique combat system lies in the innovative integration of music and linked attacks. The players can choose an array of combos based on the different hip hop grooves that they can swap at will. Music tracks become collectible, opening an extensive assortment of linked attacks that can be implemented tactically during combat. [Bandai]… Expand"}, {"name": "Lost Planet: Extreme Condition", "details_link": "https://www.metacritic.com/game/pc/lost-planet-extreme-condition", "publisher": "Capcom", "release_date": "Jun 26 2007", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/b51f1bffc29df6d7128cff79bb6cfed4-98.jpg", "descriptions": "In Lost Planet, human snow pirates navigate VS (Vital Suits) through hostile ice-covered environments, fighting against the indigenous Akrid creatures for the precious thermal energy they need to survive. For one such pilot named Wayne, death almost seemed imminent until he was fortunatelyIn Lost Planet, human snow pirates navigate VS (Vital Suits) through hostile ice-covered environments, fighting against the indigenous Akrid creatures for the precious thermal energy they need to survive. For one such pilot named Wayne, death almost seemed imminent until he was fortunately rescued. However, he can only remember a few fragments of his past including the slaying of his father by the monstrous beings. Yet under the veil of ice, a devious plan has been set into motion for the termination of all Akrid and snow pirates alike. What really happened to Wayne? Who is plotting the destructive scheme? Encounter valuable allies and dangerous enemies on Wayne's search for the truth. [Capcom]… Expand"}, {"name": "Blue Reflection", "details_link": "https://www.metacritic.com/game/playstation-4/blue-reflection", "publisher": "Koei Tecmo Games", "release_date": "Sep 26 2017", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/009f4ad7b3f4a2ac7fb8dbb5bb73133b-98.jpg", "descriptions": "Blue Reflection takes place at Hoshinomiya Girls' High School, where players assume the role of student Hinako Shirai. When Hinako's ballet career comes to an end after a tragic accident, she closes her heart off from the rest of the world. However, her life changes when she meets her newBlue Reflection takes place at Hoshinomiya Girls' High School, where players assume the role of student Hinako Shirai. When Hinako's ballet career comes to an end after a tragic accident, she closes her heart off from the rest of the world. However, her life changes when she meets her new best friends, the magical Shijou twins -- Yuzu, who is adored by her classmates for her cheerful and warm personality, and Lime, who is more logical and selfish.\r The twin sisters bestow Hinako with the power of a Reflector, a champion who can manipulate a mysterious parallel dimension known as The Common. Hinako can freely move and shape this mystical realm's beauty with her imagination, but she soon understands the very real perils that await her and her friends. As Hinako learns to treasure her companions and creates new bonds with those around her, she gains new strength to help her fight in The Common.\r FEATURES:\r Study, Play, Fight: Blue Reflection takes place at a vibrant all-girls school, Hoshinomiya Girls' High School, where players will experience the everyday school life and hang out with their friends. As players meet emotionally unbalanced characters, a gap to The Common opens, a mysterious parallel dimension filled with demonic inhabitants, allowing them to solve the problems between the dimensions.\r Reflect Pure Emotions: In The Common, Hinako and her friends transform into Reflectors, allowing them to move freely and fight the demonic creatures that live within this realm. Through gathering emotional fragments and the emotional energy, known as Ether, the Reflectors are able to perform incredible abilities.\r Get your own Free Space!: Staying in touch with friends can always be tough, but using the 'Free Space!' social network allows easy communication, and exciting mini-games, in and out of school.\r Make the most of your free time: After classes have ended players can partake in after-class activities, explore The Common or explore a variety of exciting places in town. Your actions affect what events will take place the next day!… Expand"}, {"name": "Kinect Sports: Season Two", "details_link": "https://www.metacritic.com/game/xbox-360/kinect-sports-season-two", "publisher": "Microsoft Game Studios", "release_date": "Oct 25 2011", "developers": ["Rare Ltd.", "BigPark"], "platforms": "Xbox 360", "genres": ["Sports", "General", "General"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/f63043f737acb329749d374e64f5ae45-98.jpg", "descriptions": "\"Kinect Sports: Season Two\" pulls the whole family off the couch and turns your living room into a world-class sports arena where intuitive, full-body gameplay and friendly competition reign supreme. Following the top-selling and award-winning \"Kinect Sports: Season Two,\"\"Kinect Sports: Season Two\" pulls the whole family off the couch and turns your living room into a world-class sports arena where intuitive, full-body gameplay and friendly competition reign supreme. Following the top-selling and award-winning \"Kinect Sports: Season Two,\" the second season amps up the action and delivers sporting gameplay like you’ve never seen — or felt — before!… Expand"}, {"name": "Wheelman", "details_link": "https://www.metacritic.com/game/playstation-3/wheelman", "publisher": "Ubisoft", "release_date": "Mar 24 2009", "developers": ["Tigon"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/09513693adf8d71880b5ecd774d8b990-98.jpg", "descriptions": "Wheelman takes gamers on a white knuckle thrill ride that unfolds throughout the streets of Barcelona. Featuring car chases inspired by Hollywood's most famous action-sequences, Wheelman delivers powerful cinematic moments throughout the game's compelling storyline. Vin Diesel stars as anWheelman takes gamers on a white knuckle thrill ride that unfolds throughout the streets of Barcelona. Featuring car chases inspired by Hollywood's most famous action-sequences, Wheelman delivers powerful cinematic moments throughout the game's compelling storyline. Vin Diesel stars as an undercover agent and highly skilled driver who must infiltrate the Barcelona underworld to gather intelligence surrounding a covert heist. Posing as a driver-for-hire, he ends up caught in a crossfire of corruption and chaos while trying to stay one step ahead of local law enforcement and rival gangs. [Midway]… Expand"}, {"name": "Darius Cozmic Collection: Console", "details_link": "https://www.metacritic.com/game/switch/darius-cozmic-collection-console", "publisher": "ININ Games", "release_date": "Jun 16 2020", "developers": ["M2", "ININ Games"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/42a5551d2de6a117ed58b27703a3d0ca-98.jpg", "descriptions": "The Darius Cozmic Collection Console contains 6 legendary console titles in a total of 9 versions:\r DARIUS II (Mega Drive JP version)\r\n  SAGAIA (Genesis version)\r\n  SAGAIA (Master System EU version)\r\n  DARIUS TWIN (Super Famicom JP version)\r\n  DARIUS TWIN (Super NES US version)The Darius Cozmic Collection Console contains 6 legendary console titles in a total of 9 versions:\r DARIUS II (Mega Drive JP version)\r  SAGAIA (Genesis version)\r  SAGAIA (Master System EU version)\r  DARIUS TWIN (Super Famicom JP version)\r  DARIUS TWIN (Super NES US version)\r  DARIUS FORCE (Super Famicom JP version)\r  SUPER NOVA (Super NES US version)\r  DARIUS ALPHA (PC Engine JP version)\r  DARIUS PLUS (PC Engine JP version)\r… Expand"}, {"name": "Fantastic Pets", "details_link": "https://www.metacritic.com/game/xbox-360/fantastic-pets", "publisher": "THQ", "release_date": "Apr 12 2011", "developers": ["Blitz Games Studios"], "platforms": "Xbox 360", "genres": ["Action", "Simulation", "General", "General", "Virtual", "Pet"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/2d6bbe8fde2dabb7b804f4046839caf6-98.jpg", "descriptions": "Fantastic Pets lets players custom create, collect and interact with unlimited varieties of their very own dream pets."}, {"name": "Sunset (2015)", "details_link": "https://www.metacritic.com/game/pc/sunset-2015", "publisher": "Tale of Tales", "release_date": "May 21 2015", "developers": ["Tale of Tales"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Modern", "Adventure", "3D", "First-Person"], "meta_score": 66, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/7/a1e4e300316e122a2d1a68ca24f67110-98.jpg", "descriptions": "Assume the role of Angela Burnes, a US immigrant in a small Latin American country ruled by a military dictatorship. The year is 1972. You take care of the luxurious penthouse of Gabriel Ortega, once a week, an hour before sunset. And then a violent uprising breaks out in the metropolis below."}, {"name": "The Walking Dead: Michonne - Episode 2: Give No Shelter", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-michonne---episode-2-give-no-shelter", "publisher": "Telltale Games", "release_date": "Mar 29 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/36548d53b028f223c710863811132d60-98.jpg", "descriptions": "Surrounded by the dead and mistrustful of the living, you – as Michonne - will choose how the story flows through the choices you make, in this three-part episodic miniseries."}, {"name": "H1Z1: Battle Royale", "details_link": "https://www.metacritic.com/game/playstation-4/h1z1-battle-royale", "publisher": "Sony Online Entertainment", "release_date": "Aug  7 2018", "developers": ["Sony Online Entertainment", "Daybreak Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to more than 64 ", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "First-Person", "Third-Person", "Tactical", "Arcade"], "meta_score": 66, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/9734220a1727221f56da139dbeb089a3-98.jpg", "descriptions": "H1Z1 is a fast-paced, highly competitive, battle royale shooter. Parachute in and search for weapons, ammo, vehicles and supplies to stay alive. As a toxic gas cloud compresses the map, develop your strategy and prepare for the spectacle of mayhem. Go solo or group with a team of two or fiveH1Z1 is a fast-paced, highly competitive, battle royale shooter. Parachute in and search for weapons, ammo, vehicles and supplies to stay alive. As a toxic gas cloud compresses the map, develop your strategy and prepare for the spectacle of mayhem. Go solo or group with a team of two or five to be the last ones standing. Now Free To Play!NEW MODE: AUTO ROYALEPlay Battle Royale on Wheels. Drive into battle as part of a four-person vehicle of mayhem. Fight for power-ups to equip your squad and upgrade your ride. Outdrive, outshoot, and outlast the competition to BE THE LAST TEAM DRIVING!#CALLSHOTGUNNON-STOP HIGH OCTANE ACTION* Work as a four-person team* Find power-ups to outfit your vehicle* Destroy vehicles with weapons and traps, using your favorite H1Z1 weapons* Escape the fast moving toxic gas ring* If you're not first, you're deadTAKE THE WHEEL1 person drives, 3 people shoot* You never run out of gas, keep that pedal to the metal* Speed through the map for power-ups, weapons, and vehicle upgrades* Drop landmines, shoot enemy vehicles, and fire up your boost to kick things into high gear.* Find ultra-rare weapons like Light Machine Guns and Explosive Arrows in airdrops* Work with your team to outshoot, outdrive, and outlast the competition.… Expand"}, {"name": "NASCAR Heat Evolution", "details_link": "https://www.metacritic.com/game/playstation-4/nascar-heat-evolution", "publisher": "Dusenberry Martin Racing", "release_date": "Sep 13 2016", "developers": ["Monster Games Inc.", "Dusenberry Martin Racing"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/2/731bb84787f774a7193aa853268545ac-98.jpg", "descriptions": "Gameplay modes include Race, Challenges, Season, Chase, Online, and Career. In Career, customize your own NASCAR Sprint Cup Series driver. From the high banks of Talladega to the tight turns in Martinsville, each of the 23 licensed NASCAR tracks have been recreated in conjunction with trackGameplay modes include Race, Challenges, Season, Chase, Online, and Career. In Career, customize your own NASCAR Sprint Cup Series driver. From the high banks of Talladega to the tight turns in Martinsville, each of the 23 licensed NASCAR tracks have been recreated in conjunction with track owners. NASCAR Heat Evolution offers 43 different drivers from the most popular race teams including Stewart-Haas Racing, Joe Gibbs Racing, Hendrick Motorsports, Team Penske, Chip Ganassi, and others.… Expand"}, {"name": "Apache: Air Assault", "details_link": "https://www.metacritic.com/game/playstation-3/apache-air-assault", "publisher": "Activision", "release_date": "Nov 16 2010", "developers": ["Gaijin Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Combat"], "meta_score": 66, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/9d6590602bbb68a0470f86957f72fc37-98.jpg", "descriptions": "Apache: Air Assault features more than 16 multi-stage missions involving air and ground strike operations off the coast of Africa, the mountains of the Middle East and the jungles of Central America, each meticulously created using high resolution map data from real-world satelliteApache: Air Assault features more than 16 multi-stage missions involving air and ground strike operations off the coast of Africa, the mountains of the Middle East and the jungles of Central America, each meticulously created using high resolution map data from real-world satellite photography. Apache helicopters are some of the most sophisticated combat aircraft on the planet - the player gets to fly multiple variations of them, each with their own extreme firepower and highly-detailed damage modeling.  … Expand"}, {"name": "Cold Fear", "details_link": "https://www.metacritic.com/game/pc/cold-fear", "publisher": "Ubisoft", "release_date": "May 17 2005", "developers": ["Darkworks"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/4bcd4da0a50f4219a5448275b093a63c-98.jpg", "descriptions": "Cold Fear is the first action-horror title under the Ubisoft brand. The game is set in a dynamic environment on a stormy sea, including intense combat, intelligent enemies, and a high element of the shockingly unexpected. Your life jacket won't be sufficient. Players step into the role ofCold Fear is the first action-horror title under the Ubisoft brand. The game is set in a dynamic environment on a stormy sea, including intense combat, intelligent enemies, and a high element of the shockingly unexpected. Your life jacket won't be sufficient. Players step into the role of Tom Hansen, a U.S. Coast Guard who is sent to board a drifting Russian whaling ship in the middle of a howling storm on the Bering Sea, who will discover there is no safe place here. On this constantly rocking and shifting ship and a mysterious oil rig, players must turn their interactive surroundings to their advantage to take down human enemies ? and enemies that aren't human any more - and save their own life. [Ubisoft]… Expand"}, {"name": "Ghostbusters: The Video Game Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/ghostbusters-the-video-game-remastered", "publisher": "Saber Interactive", "release_date": "Oct  4 2019", "developers": ["Saber Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/f2a635da88e7338fc1259a1320aa82ae-98.jpg", "descriptions": "The Ghostbusters video game is back and remastered. Strap on your proton pack once again and join the Ghostbusters on the adventure with the voice and likeness of the original crew as you battle to save New York. The game features the voices and in-game likenesses of Bill Murray, DanThe Ghostbusters video game is back and remastered. Strap on your proton pack once again and join the Ghostbusters on the adventure with the voice and likeness of the original crew as you battle to save New York. The game features the voices and in-game likenesses of Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson in an original story penned by the writers of the original films - Dan Aykroyd and Harold Ramis. Experience unique ghost hunting, wrangling and trapping with upgradeable weapons in widely destructible environments. Test the team's mettle with large scale boss fights. Play through a unique storyline as the player battles and captures ghosts - both well-loved and brand new - throughout New York. [Epic]\r … Expand"}, {"name": "Atari Anthology", "details_link": "https://www.metacritic.com/game/playstation-2/atari-anthology", "publisher": "Atari", "release_date": "Nov 22 2004", "developers": ["Digital Eclipse"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/e1e9d8279cebe4493e0bdbeb049c5021-98.jpg", "descriptions": "For video game console owners, no better value exists than Atari Anthology, which features 85 games that started a revolution, including 18 arcades games such as Asteroids, Battlezone, Missile Command, and Pong; 62 Atari 2600 games including Gravitar, Millipede and Super Breakout and fiveFor video game console owners, no better value exists than Atari Anthology, which features 85 games that started a revolution, including 18 arcades games such as Asteroids, Battlezone, Missile Command, and Pong; 62 Atari 2600 games including Gravitar, Millipede and Super Breakout and five bonus titles, such as Off the Wall, Blackjack, Desert Falcon, Steeplechase and Sprintmaster. Adding an innovative twist to each game are new Challenge Modes such as the psychedelic Trippy Mode, Time Warp and Double Speed, all of which push player's skills to the extreme, while a new 3D interface offers a polished portal into all the games. Atari Anthology spans an impressive array of game categories, including Arcade Originals, 2600 Arcade Games and 2600 Adventure Games, as well as numerous offerings in the Action, Sports, Mind, Casino, Racing and Space genres. [Atari]… Expand"}, {"name": "WRC 6: World Rally Championship", "details_link": "https://www.metacritic.com/game/pc/wrc-6-world-rally-championship", "publisher": "Bigben Interactive", "release_date": "Oct  7 2016", "developers": ["Kylotonn"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/c040041e48e9bd36504ac9c255a16070-98.jpg", "descriptions": "All 14 rounds of the 2016 WRC season, including for the first time Rally China; All the star WRC drivers and also a wide selection of WRC 2 teams and competitors from the Junior WRC category eSports WRC, the first international online competition of the WRC, which was launched in JanuaryAll 14 rounds of the 2016 WRC season, including for the first time Rally China; All the star WRC drivers and also a wide selection of WRC 2 teams and competitors from the Junior WRC category eSports WRC, the first international online competition of the WRC, which was launched in January 2016 with WRC 5, will continue in WRC 6. … Expand"}, {"name": "Backbreaker: Vengeance", "details_link": "https://www.metacritic.com/game/xbox-360/backbreaker-vengeance", "publisher": "505 Games", "release_date": "Jun 29 2011", "developers": ["NaturalMotion"], "platforms": "Xbox 360", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/e8922b7fbf096dfee5f2732d1c660c42-98.jpg", "descriptions": "Backbreaker: Vengeance takes the intensity and AAA appeal of the original Backbreaker Football console game and combines it with the pick-up-and-play nature of the multi-million selling iPhone games to create a whole new one-of-a-kind sports experience for digital download on Xbox LIVEBackbreaker: Vengeance takes the intensity and AAA appeal of the original Backbreaker Football console game and combines it with the pick-up-and-play nature of the multi-million selling iPhone games to create a whole new one-of-a-kind sports experience for digital download on Xbox LIVE Arcade for Xbox 360. It takes as its inspiration the wildly popular \"Tackle Alley\" mini-game in Backbreaker Football to deliver an all-new arcade slant on football.… Expand"}, {"name": "Just Dance 4", "details_link": "https://www.metacritic.com/game/wii-u/just-dance-4", "publisher": "Ubisoft", "release_date": "Nov 18 2012", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 3", "Xbox 360", "Wii U"], "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 66, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/0b192c125249ffebf8b98d6620102e24-98.jpg", "descriptions": "Just Dance 4 features more than 40 new tracks, ranging from chart-topping Billboard hits to classic dance party tracks. Whether it's pop, Hip-Hop, rock, R&B, country or funk, there is something for everyone."}, {"name": "Operation Abyss: New Tokyo Legacy", "details_link": "https://www.metacritic.com/game/playstation-vita/operation-abyss-new-tokyo-legacy", "publisher": "NIS America", "release_date": "Jun  9 2015", "developers": ["Experience Inc."], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "Roguelike", "Western-Style"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/1833717797a3e45956256ea703b17de1-98.jpg", "descriptions": "From the studio that made Demon Gaze comes Operation Abyss: New Tokyo Legacy, a sci-fi dungeon crawler RPG set in a near future Tokyo. With the city under the constant threat of Variants—genetically engineered monsters—and the emergence of portals leading to a mysterious dimension called theFrom the studio that made Demon Gaze comes Operation Abyss: New Tokyo Legacy, a sci-fi dungeon crawler RPG set in a near future Tokyo. With the city under the constant threat of Variants—genetically engineered monsters—and the emergence of portals leading to a mysterious dimension called the Abyss, the government has established the Code Physics Agency to investigate these mysterious phenomena. The Xth Squad—a unique group of teens modified by the CPA's Code technology—must evade traps, face down powerful monsters, and investigate the mystery behind the Abyss.… Expand"}, {"name": "Stranger of Paradise: Final Fantasy Origin", "details_link": "https://www.metacritic.com/game/xbox-series-x/stranger-of-paradise-final-fantasy-origin", "publisher": "Square Enix", "release_date": "Mar 18 2022", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "Linear", "Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/ab5f13c9d733235f4a0caaabee424179-98.jpg", "descriptions": "Players of the STRANGER OF PARADISE FINAL FANTASY ORIGIN TRIAL VERSION can explore this dark fantasy world as they battle an array of iconic monsters from the FINAL FANTASY series, using powerful spells and abilities from a sample of jobs including warrior, dragoon and black mage."}, {"name": "Knee Deep", "details_link": "https://www.metacritic.com/game/xbox-one/knee-deep", "publisher": "Wales Interactive", "release_date": "Feb  3 2017", "developers": ["Wales Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3b8cc80f369a56b1461617e9f2006d96-98.jpg", "descriptions": "When a washed-up actor hangs himself on location, a spotlight is cast on the backwater Florida town of Cypress Knee. Your screen becomes a stage on which you investigate this mysterious suicide as three distinct characters: cheeky blogger Romana Teague, down-and-out local reporter JackWhen a washed-up actor hangs himself on location, a spotlight is cast on the backwater Florida town of Cypress Knee. Your screen becomes a stage on which you investigate this mysterious suicide as three distinct characters: cheeky blogger Romana Teague, down-and-out local reporter Jack Bellet, and cynical private investigator K.C. Gaddis.… Expand"}, {"name": "WRC 6: World Rally Championship", "details_link": "https://www.metacritic.com/game/playstation-4/wrc-6-world-rally-championship", "publisher": "Bandai Namco Games", "release_date": "Oct  7 2016", "developers": ["Kylotonn"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/f9f02d50f355e2497d77bfe6ddaee4c2-98.jpg", "descriptions": "All 14 rounds of the 2016 WRC season, including for the first time Rally China; All the star WRC drivers and also a wide selection of WRC 2 teams and competitors from the Junior WRC category eSports WRC, the first international online competition of the WRC, which was launched in JanuaryAll 14 rounds of the 2016 WRC season, including for the first time Rally China; All the star WRC drivers and also a wide selection of WRC 2 teams and competitors from the Junior WRC category eSports WRC, the first international online competition of the WRC, which was launched in January 2016 with WRC 5, will continue in WRC 6.… Expand"}, {"name": "S.L.A.I.: Steel Lancer Arena International", "details_link": "https://www.metacritic.com/game/playstation-2/slai-steel-lancer-arena-international", "publisher": "Konami", "release_date": "Sep 21 2005", "developers": ["Genki"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 66, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/eea38e655454466e8923eecfb41adddc-98.jpg", "descriptions": "Konami brings the first online mech combat game to the PS2 with SLAI: Phantom Crash. This fast paced mech action is the sport of the future, where players pilot their customized mechs to win cash and worldwide dominance. Over 1 million possible mech configurations and phantom stealthKonami brings the first online mech combat game to the PS2 with SLAI: Phantom Crash. This fast paced mech action is the sport of the future, where players pilot their customized mechs to win cash and worldwide dominance. Over 1 million possible mech configurations and phantom stealth abilities make this one mech party you'll have to crash. Tune up robots using weapons, armor, and accessories. Use optical camouflage to gain a tactical advantage during battles. Features multiple futuristic, big city battlefields. Single and 2-player battles, as well as a 4-player online mode. [Konami]… Expand"}, {"name": "Yu-Gi-Oh! 7 Trials to Glory: World Championship Tournament 2005", "details_link": "https://www.metacritic.com/game/game-boy-advance/yu-gi-oh!-7-trials-to-glory-world-championship-tournament-2005", "publisher": "Konami", "release_date": "Feb 15 2005", "developers": ["Konami"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 66, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/ffe0c724e3c5cbff0574e175e312f7e1-98.jpg", "descriptions": "Light and dark clash in a town where everyone waits to duel. Battles take the place of words and only the best will win tournaments where glittering trophies await the victor."}, {"name": "PoPoLoCrois", "details_link": "https://www.metacritic.com/game/psp/popolocrois", "publisher": "Agetec", "release_date": "Nov 29 2005", "developers": ["G-Artists"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/fa19eafcfc6e0aad86dab6faa60ac335-98.jpg", "descriptions": "This classic fantasy story features brand-new sequences from the animated TV series, new playable adventures, plus exciting battles with rich, vibrant colors and cell-shaded 2D graphics. You'll be hooked on the delightful characters and animated storyline that is fun for all ages. FeaturesThis classic fantasy story features brand-new sequences from the animated TV series, new playable adventures, plus exciting battles with rich, vibrant colors and cell-shaded 2D graphics. You'll be hooked on the delightful characters and animated storyline that is fun for all ages. Features Charming Cel-shaded Graphics in Rich, Vibrant Color; Save Feature for Playing On-The-Go; 30+ Hours of Game Play; and Bonus Anime Sequences from the Japanese TV Series. [Agetec]… Expand"}, {"name": "NeoGeo Battle Coliseum", "details_link": "https://www.metacritic.com/game/playstation-2/neogeo-battle-coliseum", "publisher": "SNK Playmore", "release_date": "Dec 17 2007", "developers": ["SNK Playmore"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 66, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/e71195b7f333d8bb50c5ad9f477b8518-98.jpg", "descriptions": "Drawing characters from some of SNK's biggest and well loved franchises, NeoGeo Battle Coliseum allows the use of the new 2–on–2 Tag Team battle system. This new system allows the player to switch characters during play and to perform ‘team’ attacks on their opponent. The character rosterDrawing characters from some of SNK's biggest and well loved franchises, NeoGeo Battle Coliseum allows the use of the new 2–on–2 Tag Team battle system. This new system allows the player to switch characters during play and to perform ‘team’ attacks on their opponent. The character roster has 40 characters represented by well known faces from the likes of World Heroes, Art of Fighting, Fatal Fury, Samurai Shodown, Last Blade, Metal Slug and Kizuna Encounter. [SNK Playmore]… Expand"}, {"name": "The Bureau: XCOM Declassified", "details_link": "https://www.metacritic.com/game/pc/the-bureau-xcom-declassified", "publisher": "2K Games", "release_date": "Aug 19 2013", "developers": ["2K Marin"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/8c0699952c49d4599833d42e6a12ef8e-98.jpg", "descriptions": "It's 1962. John F. Kennedy is the U.S. President and the Cold War has the nation gripped with fear – but a far more viscous and insidious enemy than communism is threatening America. Known only to a scant few, a covet government unit called The Bureau begins investigating and concealing aIt's 1962. John F. Kennedy is the U.S. President and the Cold War has the nation gripped with fear – but a far more viscous and insidious enemy than communism is threatening America. Known only to a scant few, a covet government unit called The Bureau begins investigating and concealing a series of mysterious attacks by an alien enemy. As special agent William Carter, you make the decisions, pull the trigger and lead your squad in a third-person tactical shooter set within a high-stakes, covert war to defend the human race. The Bureau’s mission is clear – survive, adapt and overcome the enemy threat (Heartbreak Ridge-style) to protect the citizens from the truth.  … Expand"}, {"name": "The Crew 2", "details_link": "https://www.metacritic.com/game/pc/the-crew-2", "publisher": "Ubisoft", "release_date": "Jun 28 2018", "developers": ["Ubisoft Ivory Tower"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/8/fea082436fb450a10a3fd6aef3833a64-98.jpg", "descriptions": "The newest iteration in the franchise, The Crew 2 captures the thrill of the American motorsports spirit in an open world. Welcome to Motornation, a huge, varied, action-packed playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, andThe newest iteration in the franchise, The Crew 2 captures the thrill of the American motorsports spirit in an open world. Welcome to Motornation, a huge, varied, action-packed playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, and sky. From coast to coast, street and pro racers, off-road explorers, and freestylers gather and compete in all kinds of disciplines. Join them in high-octane contests and share every glorious moment with the world. The Crew 2 gives you the chance to showcase your skills and rise as a multi-skilled motorsports champion. [Ubisoft]… Expand"}, {"name": "The Bigs", "details_link": "https://www.metacritic.com/game/wii/the-bigs", "publisher": "2K Sports", "release_date": "Jun 25 2007", "developers": ["Blue Castle Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/912f1d3aa471d128ae29a0b870ab2b18-98.jpg", "descriptions": "This over-the-top baseball action title puts an entirely new spin on Major League Baseball as it blends outrageous visuals and intuitive gameplay mechanics to bring fans a brand new MLB video game experience. Fans redefine the baseball highlight reel by performing dramatic wall grabs,This over-the-top baseball action title puts an entirely new spin on Major League Baseball as it blends outrageous visuals and intuitive gameplay mechanics to bring fans a brand new MLB video game experience. Fans redefine the baseball highlight reel by performing dramatic wall grabs, spectacular diving plays, and epic homeruns. Unique and intuitive gameplay controls deliver a new baseball experience, while advanced power-up mechanics add exciting depth with each turn. Turbo gameplay raises the action bar, and culminates in the ultimate batter pitcher power-up duel, where either the pitcher's Big Heat will be the turning point, or the batter’s Power Blast will be the explosive end to the game. In The BIGS, every play is a big play. Each MLB player has been individualized to emphasize their extraordinary athletic attributes. The development team paid great attention to detail to portray a player's face and physical characteristics so baseball fans will easily recognize their favorite players. To deliver the authentic MLB atmosphere, stadium landmarks have been stylized to highlight the unique architecture of each MLB ballpark. Whether it's the glove at San Francisco's AT&T Park resized to mammoth proportions or the left field wall in Boston's Fenway Park made into a real \"Green Monster,\" gamers will be in awe at the grandeur of each stadium in The BIGS. [2K Sports]… Expand"}, {"name": "Batman: The Telltale Series - Episode 2: Children of Arkham", "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-telltale-series---episode-2-children-of-arkham", "publisher": "Telltale Games", "release_date": "Sep 20 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/a8b582695afa3032c3b8f1d77ada1e16-98.jpg", "descriptions": "With Gotham City's first family mired in corruption, and an old friend now a dangerous adversary, the life of the Dark Knight is turned upside down. What was Thomas Wayne entangled in, and why was he killed? Determined to learn the truth about his father, Bruce sets out to question thoseWith Gotham City's first family mired in corruption, and an old friend now a dangerous adversary, the life of the Dark Knight is turned upside down. What was Thomas Wayne entangled in, and why was he killed? Determined to learn the truth about his father, Bruce sets out to question those involved in Gotham's criminal past. But which mask will he wear - The billionaire, or the bat? Huge decisions will forever change the Batman and the lives of those around him, as he meets the Children of Arkham.… Expand"}, {"name": "Crash Twinsanity", "details_link": "https://www.metacritic.com/game/xbox/crash-twinsanity", "publisher": "VU Games", "release_date": "Sep 28 2004", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/ccbf6b5dfc189a23d71e4413882f1a7f-98.jpg", "descriptions": "A new evil has invaded Crash Bandicoot's island paradise with plans of destruction. In a strange twist, Crash reluctantly pairs with his archenemy, Dr. Neo Cortex, in order to save the world. Now, through this unorthodox partnership, you can take control of Crash as he uses Cortex as hisA new evil has invaded Crash Bandicoot's island paradise with plans of destruction. In a strange twist, Crash reluctantly pairs with his archenemy, Dr. Neo Cortex, in order to save the world. Now, through this unorthodox partnership, you can take control of Crash as he uses Cortex as his favorite weapon. Play as any one of four characters as you encounter reactive enemies, wild environments, and a wacky cast of new characters.… Expand"}, {"name": "Maneater: Truth Quest", "details_link": "https://www.metacritic.com/game/pc/maneater-truth-quest", "publisher": "Tripwire Interactive", "release_date": "Aug 31 2021", "developers": ["Tripwire Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 66, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/5/1d456cb080452dbf0b23973333ff3a6b-98.jpg", "descriptions": "Starring the titular and evolved bull shark protagonist – and Chris Parnell (Saturday Night Live, Rick and Morty, Archer), reprising his role as investigative journalist Trip Westhaven, Maneater: Truth Quest will take players down the rabbit hole of dark secrets and conspiracies surroundingStarring the titular and evolved bull shark protagonist – and Chris Parnell (Saturday Night Live, Rick and Morty, Archer), reprising his role as investigative journalist Trip Westhaven, Maneater: Truth Quest will take players down the rabbit hole of dark secrets and conspiracies surrounding Port Clovis and the Naval Wildlife Organization (NWO). The original stories of animals growing bone like armor, emitting flesh-eating toxins, or using electricity as a weapon were simply just old fisherman's tales. That is until conspiracy theorists everywhere pointed to the original Maneater as solid proof of a Government coverup. Trip Westhaven, driven the brink of madness, fires up his ViewTube channel “Truth Quest”, to take his followers, the “Questers” into deep waters in an effort to uncover the dark secrets behind this whale of a tale.… Expand"}, {"name": "Damsel", "details_link": "https://www.metacritic.com/game/xbox-one/damsel", "publisher": "Screwtape Studios", "release_date": "Aug  7 2019", "developers": ["Screwtape Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/d043a227c203ae1c33f9654a29a000a2-98.jpg", "descriptions": "Speed through dozens of missions as Special Agent Damsel, the first and last line of defence against the seedy world of corporate vampires. Rescue hostages, disarm bombs, hack servers and dispatch the undead with precision, speed, and style. Balance frenetic action with split second choices,Speed through dozens of missions as Special Agent Damsel, the first and last line of defence against the seedy world of corporate vampires. Rescue hostages, disarm bombs, hack servers and dispatch the undead with precision, speed, and style. Balance frenetic action with split second choices, and pay attention, you never know where the next vamp will come from. Enter a fully realised comic book world and help Damsel take on Red Mist, the powerful vampire corporation that’s adding a new (and illegal) ingredient to their popular vampire drink. Uncover the secrets of the new recipe and stop the corporation from achieving their ultimate plan, the total dominance of vampires on Earth! Use Damsel’s powerful ultraviolet shotgun, quick reflexes, devastating melee, and lightning fast dash to string together stylish attacks. Tight and responsive controls let you move around each arena while avoiding the deadly hazards fiendishly placed to stop you in your tracks.\r… Expand"}, {"name": "Golem Gates", "details_link": "https://www.metacritic.com/game/switch/golem-gates", "publisher": "Digerati Distribution", "release_date": "May 31 2019", "developers": ["Laser Guided Games", "LLC"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/a077089e509d66d5a41643432b2fd24c-98.jpg", "descriptions": "Golem Gates is a post-apocalyptic sci-fi blend of action-strategy and card battler, pitting your conjured armies against otherworldly forces. Choose from 100 cards (known as Glyphs) and unleash diverse units, buildings, buffs, and more in tactical combat across single player, co-op, andGolem Gates is a post-apocalyptic sci-fi blend of action-strategy and card battler, pitting your conjured armies against otherworldly forces. Choose from 100 cards (known as Glyphs) and unleash diverse units, buildings, buffs, and more in tactical combat across single player, co-op, and multiplayer.\r An ancient threat surges from the Golem Gates, and only the Harbinger stands guard. Wielding the nanite-infused power of The Ash, you must protect a world ravaged by ancient wars. … Expand"}, {"name": "The Shapeshifting Detective", "details_link": "https://www.metacritic.com/game/playstation-4/the-shapeshifting-detective", "publisher": "Wales Interactive", "release_date": "Nov  6 2018", "developers": ["D'Avekki Studios Limited"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/b35910ad7e9d1365607e6649df2e3be2-98.jpg", "descriptions": "The Shapeshifting Detective is a supernatural-noir murder mystery FMV game. Assume the role of a detective and investigate the murder by shapeshifting into any character… even the next victim."}, {"name": "Silence: The Whispered World 2", "details_link": "https://www.metacritic.com/game/xbox-one/silence-the-whispered-world-2", "publisher": "Daedalic Entertainment", "release_date": "Nov 15 2016", "developers": ["Daedalic Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/4d518ed70c636482f44d65cc8c620141-98.jpg", "descriptions": "Silence: The Whispered World 2 will take you back to Silence, a world made of dreams. We accompany Noah, a teenager who lost his little sister, Renie, in the hazardous real world and now hopes to find her again in Silence. His quest leads him to another visually impressive and emotionalSilence: The Whispered World 2 will take you back to Silence, a world made of dreams. We accompany Noah, a teenager who lost his little sister, Renie, in the hazardous real world and now hopes to find her again in Silence. His quest leads him to another visually impressive and emotional adventure, where you get to solve plenty of mysteries surrounding Noah, his sister, and the dreamscapes of Silence.… Expand"}, {"name": "Fairy Fencer F", "details_link": "https://www.metacritic.com/game/pc/fairy-fencer-f", "publisher": "Idea Factory", "release_date": "Aug  4 2015", "developers": ["Idea Factory"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 66, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/63da8ad87791e559b9a6fa740012dee6-98.jpg", "descriptions": "Long ago, a terrible war raged between two deities. Wielding magical weapons known as Furies, they sealed each other away and the remaining Furies were scattered throughout the world. Today, these ancient weapons are sought after by warriors known as Fencers. When a young man named FangLong ago, a terrible war raged between two deities. Wielding magical weapons known as Furies, they sealed each other away and the remaining Furies were scattered throughout the world. Today, these ancient weapons are sought after by warriors known as Fencers. When a young man named Fang obtains a Fury of his own, he gains an unlikely partner, and the course of his destiny is forever altered...\r A world of magic and adventure awaits you in Fairy Fencer F! Take charge of your destiny as you brave dungeons, defeat monsters, and travel the world to collect all 100 Furies. But be carefulthe Furies are coveted by many Fencers, good and bad. Pray these powerful weapons do not fall into the wrong hands.… Expand"}, {"name": "Pac-Man Museum", "details_link": "https://www.metacritic.com/game/playstation-3/pac-man-museum", "publisher": "Namco Bandai Games", "release_date": "Feb 25 2014", "developers": ["Namco Bandai Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "General", "Compilation", "Compilation"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/07cc75800f6bcda382cc9a7dfcdcf33c-98.jpg", "descriptions": "PAC-MAN, the yellow 80's icon with a voracious appetite that has transcended generation upon generation of gamers, stars in this nostalgia-packed collection of games. In the game, players will need to skilfully dodge and juke troublesome ghosts while gobbling up all the pac-dots and powerPAC-MAN, the yellow 80's icon with a voracious appetite that has transcended generation upon generation of gamers, stars in this nostalgia-packed collection of games. In the game, players will need to skilfully dodge and juke troublesome ghosts while gobbling up all the pac-dots and power pellets lying in their path. PAC-MAN MUSEUM will include classic PAC-MAN titles as well as newer arcade releases, allowing gamers to play through the evolution of PAC-MAN from his humble beginnings from 1980 through 2008's critically acclaimed PAC-MAN Championship Edition and 2010's arcade smash-hit PAC-MAN Battle Royale.… Expand"}, {"name": "Dragon Ball Z: Battle of Z", "details_link": "https://www.metacritic.com/game/playstation-vita/dragon-ball-z-battle-of-z", "publisher": "Namco Bandai Games", "release_date": "Jan 28 2014", "developers": ["Artdink"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation Vita"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/df095cb124273f2517733b24bb875aaf-98.jpg", "descriptions": "Developed by Tokyo based game developer ARTDINK; Dragon Ball Z Battle of Z will feature a large cast of playable characters including Goku, Piccolo, Vegeta, and a variety of melee and famous attacks including the Kamehameha, Special Beam Cannon, and Spirit Bomb. The epic battles in DragonDeveloped by Tokyo based game developer ARTDINK; Dragon Ball Z Battle of Z will feature a large cast of playable characters including Goku, Piccolo, Vegeta, and a variety of melee and famous attacks including the Kamehameha, Special Beam Cannon, and Spirit Bomb. The epic battles in Dragon Ball Z Battle of Z derive their style from the original anime series and will take place in rich environments on both land and in the air. Dragon Ball Z Battle of Z will let players form teams with up to four characters to participate in group melee action, take on massive boss battles, or challenge other players around the world for brawls featuring up to eight characters on screen at the same time.… Expand"}, {"name": "KickBeat: Steam Edition", "details_link": "https://www.metacritic.com/game/pc/kickbeat-steam-edition", "publisher": "Zen Studios", "release_date": "Jan 20 2014", "developers": ["Zen Studios"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/2edebfda306d0a32fd4eebecc88076d8-98.jpg", "descriptions": "KickBeat offers players several innovative ways to interact with music. The game combines beat-matching mechanics with an acrobatic style of martial arts, turning every song into a raucous battle. The game also features a music analyzer that allows players to create new tracks from their ownKickBeat offers players several innovative ways to interact with music. The game combines beat-matching mechanics with an acrobatic style of martial arts, turning every song into a raucous battle. The game also features a music analyzer that allows players to create new tracks from their own music libraries.… Expand"}, {"name": "Major League Baseball 2K6", "details_link": "https://www.metacritic.com/game/gamecube/major-league-baseball-2k6", "publisher": "2K Sports", "release_date": "Jun 12 2006", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "Xbox 360", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/e05fd3487cdc638d2abcaecfb1397305-98.jpg", "descriptions": "Major League Baseball 2K6 is the newest baseball offering from 2K Sports and the only MLB-licensed game this year. Use the new Inside Edge scouting service to get detailed stat tracking and in-depth player reports. MLB 2K6 features detailed controls, letting you use the analog sticks to makeMajor League Baseball 2K6 is the newest baseball offering from 2K Sports and the only MLB-licensed game this year. Use the new Inside Edge scouting service to get detailed stat tracking and in-depth player reports. MLB 2K6 features detailed controls, letting you use the analog sticks to make precision changes to your swings and throws. ESPN broadcasters Joe Miller and Joe Morgan return to do the commentary. In addition to the single-player season and exhibition modes, MLB 2K6 includes a multiplayer mode.… Expand"}]