[{"name": "Chivalry 2", "details_link": "https://www.metacritic.com/game/pc/chivalry-2", "publisher": "Tripwire Interactive", "release_date": "Jun  8 2021", "developers": ["Torn Banner Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 64 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 82, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/666aa8a14236686625099e642dc224b3-98.jpg", "descriptions": "Chivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era - from the thunder of cavalry charges, to storms of flaming arrows, sprawling castle sieges and more. Catapults tear the earth apartChivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era - from the thunder of cavalry charges, to storms of flaming arrows, sprawling castle sieges and more. Catapults tear the earth apart as players lay siege to castles, set fire to villages and slaughter filthy peasants in the return of grand Team Objective maps. Ride to war on horseback and claim glory by your blade. Are ye a heroic warrior, or a blood-soaked murderer? Keep fighting and gurgling out battlecries even when wounded, bleeding out and missing limbs.  Enhanced player expression brings thousands of hilarious new voice-lines and deep character customization. A revamped, faster and more fluid combat system offers an expanded range of creative choices, allowing players to perfect their playstyle. Immersive sound and effects ensure every blow lands with the sickening thud of steel sinking into bone.… Expand"}, {"name": "Nuclear Throne", "details_link": "https://www.metacritic.com/game/playstation-4/nuclear-throne", "publisher": "Vlambeer", "release_date": "Dec  5 2015", "developers": ["Vlambeer"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["General", "Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 82, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/08eb84288730c59582cb099bdf514b40-98.jpg", "descriptions": "Nuclear Throne is a post-apocalyptic roguelike-like top-down shooter. Not 'the final hope of humanity' post-apocalyptic, but 'humanity is extinct and mutants and monsters now roam the world' post-apocalyptic. Fight your way through the wastelands with powerful weaponry, collecting radiationNuclear Throne is a post-apocalyptic roguelike-like top-down shooter. Not 'the final hope of humanity' post-apocalyptic, but 'humanity is extinct and mutants and monsters now roam the world' post-apocalyptic. Fight your way through the wastelands with powerful weaponry, collecting radiation to mutate some new limbs and abilities. … Expand"}, {"name": "Rock Band", "details_link": "https://www.metacritic.com/game/playstation-2/rock-band", "publisher": "MTV Games", "release_date": "Dec 18 2007", "developers": ["Harmonix Music Systems"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/50c9fbdd7c38f0812949ac128bda39ae-98.jpg", "descriptions": "Play together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordingsPlay together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordings and legendary rock artists – from punk, metal and alternative to classic and southern rock. Rock Band ships with 45 fearsome tracks from artists like Bon Jovi and The Ramones to Black Sabbath and Stone Temple Pilots. Full support for downloadable content delivers never-ending challenges. New content will be available every week. Download full albums for play with Rock Band including the iconic rock album 'Who's Next' by The Who. Metallica has signed on to offer several tracks as digitally-distributed game levels for Rock Band as well as \"Enter Sandman\" for the Rock Band ship disc. Create your own rock avatar! Mold a unique rocker using Rock Band's character creator. Chose from gender, body shape, face, hair, clothes, tattoos and signature moves. Don't forget to pick your specialized rockin’ instrument. Drumming in the spotlight! Showcase a real drum solo with Rock Band's freestyle drum fill windows featured in each song. Break out your own rhythm and style as anything goes! Vocalists can bring the crowd to their feet during Rock Band’s freestyle vocal fill windows. Ad-lib your own words or shout to the crowd to raise the rock intensity of the performance. Band mates can fail out of a song for poor performance, but the band still plays on. Rescue your failing mate by busting out signature moves and blistering solos to wow the crowd with showmanship. Earn bonus points for your band during Rock Band’s Unison Phrase opportunities if everyone plays perfectly. [Harmonix]… Expand"}, {"name": "Stealth Inc 2: A Game of Clones", "details_link": "https://www.metacritic.com/game/xbox-one/stealth-inc-2-a-game-of-clones", "publisher": "Curve Digital", "release_date": "Apr  3 2015", "developers": ["Curve Digital"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/8158679f9ab7e7125459019233791b19-98.jpg", "descriptions": "In Stealth Inc 2, you play the role of a clone escaping a sinister and high-tech testing facility. Stealth Inc 2 tests both your brain and your reflexes over 60 varied levels linked together in a sprawling overworld. Death is never more than a few moments away, but one of the few advantagesIn Stealth Inc 2, you play the role of a clone escaping a sinister and high-tech testing facility. Stealth Inc 2 tests both your brain and your reflexes over 60 varied levels linked together in a sprawling overworld. Death is never more than a few moments away, but one of the few advantages of being a clone is that death isn't all that permanent. With no loading screens and no lives to worry about, players are encouraged to use their inevitable demise as a learning tool as they navigate lasers, homicidal robots and terrifying bosses in the ultimate hostile work environment.… Expand"}, {"name": "Wreckfest", "details_link": "https://www.metacritic.com/game/playstation-4/wreckfest", "publisher": "THQ Nordic", "release_date": "Aug 27 2019", "developers": ["Bugbear"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "General", "Arcade", "Automobile"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/fff0cb7410037415ad52f59d50760c50-98.jpg", "descriptions": "Break the rules and take full-contact racing to the limit with Wreckfest! Expect epic crashes, neck-to-neck fights over the finish line and brand-new ways for metal to bend -- These are the once-in-a-lifetime moments that can only be achieved in Wreckfest, with its true-to-life physicsBreak the rules and take full-contact racing to the limit with Wreckfest! Expect epic crashes, neck-to-neck fights over the finish line and brand-new ways for metal to bend -- These are the once-in-a-lifetime moments that can only be achieved in Wreckfest, with its true-to-life physics simulation crafted by legendary developer Bugbear, who also brought you FlatOut 1 & 2! Burn rubber and shred metal in the ultimate driving playground! Wreckfest is jam-packed with upgrade and customization options. Whether you are preparing for your next demolition derby with reinforced bumpers, roll cages, side protectors and much more, or setting your car up for a banger race with engine performance parts like air filters, camshafts, fuel systems, etc., Wreckfest is shaping up to be the best combative motorsport game out there.Features:* Awesome Cars -- Old, banged-up, patched-together cars that simply ooze style! From old American heavy-hitters to agile Europeans and fun Asians, you won't find anything like this in other games.* Meaningful Customization -- Change not only the look of your cars but also upgrade their body armor!* Multiplayer -- Wreck your friends online and take racing to the limit while chasing for demolition dominance!* Challenge modes -- Have hilarious fun with crop harvesters, lawn mowers, school buses, three-wheelers and more!… Expand"}, {"name": "Dark Souls III: The Ringed City", "details_link": "https://www.metacritic.com/game/pc/dark-souls-iii-the-ringed-city", "publisher": "Bandai Namco Games", "release_date": "Mar 28 2017", "developers": ["From Software"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/a583c5649b30042b4b696e778009f6c4-98.jpg", "descriptions": "The Ringed City is the final DLC pack for Dark Souls III. Journey to the world’s end to search for the Ringed City and encounter new lands, new bosses, new enemies with new armor, magic and items. Experience the epic final chapter of a dark world that could only be created by the mind ofThe Ringed City is the final DLC pack for Dark Souls III. Journey to the world’s end to search for the Ringed City and encounter new lands, new bosses, new enemies with new armor, magic and items. Experience the epic final chapter of a dark world that could only be created by the mind of Hidetaka Miyazaki. … Expand"}, {"name": "Dawn of Discovery", "details_link": "https://www.metacritic.com/game/pc/dawn-of-discovery", "publisher": "Ubisoft", "release_date": "Jun 17 2009", "developers": ["Blue Byte", "Related Designs"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/a4a66350b057643a615b5c04250ee480-98.jpg", "descriptions": "(Also known as \"Anno 1404: Dawn of Discovery\")  Dawn of Discovery takes place in the year 1404, when King George's land is suffering from severe droughts and brutal famine. Aware of his people's distress, the king calls on his two sons, William and Edward, to acquire new territories in order(Also known as \"Anno 1404: Dawn of Discovery\")  Dawn of Discovery takes place in the year 1404, when King George's land is suffering from severe droughts and brutal famine. Aware of his people's distress, the king calls on his two sons, William and Edward, to acquire new territories in order to produce enough goods to satisfy the needs of his empire’s inhabitants. Whereas Edward suggests aggressive means to collect the precious resources, his brother William offers a peaceful solution, proposing to explore new and unsettled lands in the south of the kingdom. With his Father’s blessing, William heads south to the mysterious Orient and returns with valuable new technologies such as the water pump that allows dry lands to be cultivated in order to produce enough food for the people. But there are still many unmet needs within the king's empire, and players are tasked with the mission of fulfilling those needs while both expanding and sustaining the vast society. Build and sustain your own expansive empire. Explore the beautifully detailed world and discover new places to create your civilization. Set up trade posts in the spice mines of the Orient and explore new trade routes to keep your nation growing. Learn from other nearby cultures to expand your horizons and master the challenges of establishing a prosperous society. [Ubisoft]… Expand"}, {"name": "Two Point Campus", "details_link": "https://www.metacritic.com/game/playstation-5/two-point-campus", "publisher": "Sega", "release_date": "Aug  9 2022", "developers": ["Two Point Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 82, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/8/c30225a492f84159c87e2ed6d135c75f-98.jpg", "descriptions": "Welcome to the University of U. Build your university, your way!\r Build your university, your way! \r\n\rIt’s time to spin academia on its head! Got a yearning for learning? Or just keen to build an educational masterpiece? Campus is jam-packed with new creative tools to help you build theWelcome to the University of U. Build your university, your way!\r Build your university, your way! \r\rIt’s time to spin academia on its head! Got a yearning for learning? Or just keen to build an educational masterpiece? Campus is jam-packed with new creative tools to help you build the university of your dreams. \r\rFor the first time, build in the great outdoors as you develop your own delightfully educational campus environment, housing the top teaching facilities in the land. Whether you prefer building on simple foundations, or placing every tree, you can build the university you want.\r Lay down pathways with new easy-to-use tools. Plant glorious collections of outdoor flora. Place benches, fountains, sculptures, hedgerows – even picket fences. The only limit is your imagination (and your in-game bank balance). … Expand"}, {"name": "Pinball FX3", "details_link": "https://www.metacritic.com/game/switch/pinball-fx3", "publisher": "Zen Studios", "release_date": "Dec 12 2017", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/925e37a28b7c1415911ab8b51c41422d-98.jpg", "descriptions": "Tailored specifically to make use of the unique possibilities of the system, Pinball FX3 supports vertical monitor orientation and HD Rumble, giving the game the perfect feel on this awesome handheld system. On the Switch, you’ll get unprecedented mobility to earn the coveted first spot on aTailored specifically to make use of the unique possibilities of the system, Pinball FX3 supports vertical monitor orientation and HD Rumble, giving the game the perfect feel on this awesome handheld system. On the Switch, you’ll get unprecedented mobility to earn the coveted first spot on a leaderboard. When that high-score and feeling is lit and you are in the flow, but need to catch a train – now you can. The transition from the living room to mobile is seamless with Switch. [Zen Studios]… Expand"}, {"name": "Hitman 2", "details_link": "https://www.metacritic.com/game/pc/hitman-2", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 13 2018", "developers": ["Io Interactive"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/b820abd01976af82264b3d68be5dc8bb-98.jpg", "descriptions": "Travel the globe and track your targets across exotic sandbox locations in Hitman 2. From sun-drenched streets to dark and dangerous rainforests, nowhere is safe from the world's most deadly assassin, Agent 47. Prepare to experience the ultimate spy thriller story -- your mission is toTravel the globe and track your targets across exotic sandbox locations in Hitman 2. From sun-drenched streets to dark and dangerous rainforests, nowhere is safe from the world's most deadly assassin, Agent 47. Prepare to experience the ultimate spy thriller story -- your mission is to eliminate the elusive Shadow Client and unravel his militia, but upon learning your target's true identity and the truth about 47's past, nothing will ever be the same.… Expand"}, {"name": "Hot Shots Golf: Open Tee 2", "details_link": "https://www.metacritic.com/game/psp/hot-shots-golf-open-tee-2", "publisher": "SCEA", "release_date": "Jun  3 2008", "developers": ["Clap Hanz"], "platforms": "PSP", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/acaea7d43295d3d80c8519777a9b51de-98.jpg", "descriptions": "(Also known as \"Everybody's Golf 2\")  Step out of the clubhouse and onto the open tee with Hot Shots Golf Open Tee 2. The classic, entertaining golf franchise returns to the PSP with new quirky characters, beautiful courses and a huge variety of customizable options that enable you to take(Also known as \"Everybody's Golf 2\")  Step out of the clubhouse and onto the open tee with Hot Shots Golf Open Tee 2. The classic, entertaining golf franchise returns to the PSP with new quirky characters, beautiful courses and a huge variety of customizable options that enable you to take your golf game wherever you go. Tee off in Hot Shots tournaments up to 16 players. 12 exotic courses - Play on tropical islands, the arid desert, beside snow-capped mountains and along the coast. In-depth character customization with more than 320 options. Experience the fun of Hot Shots Golf with the widely acclaimed classic game play. Tee off locally with up to 8 players and settle the score via Ad Hoc either head-to-head or in tournament play. Upgrade your clubs and golf balls to execute more accurate shots, longer drives, tighter approach shots and perfect putts. [Sony]… Expand"}, {"name": "Grounded", "details_link": "https://www.metacritic.com/game/xbox-series-x/grounded", "publisher": "Xbox Game Studios", "release_date": "Sep 27 2022", "developers": ["Obsidian Entertainment", "Xbox Game Studios"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Survival", "Action Adventure", "Sandbox"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/2c6112e7ee73b79876c9930f8f963356-98.jpg", "descriptions": "The world is a vast, beautiful, and dangerous place especially when you have been shrunken to the size of an ant. Explore, build, and survive together in this cooperative survival-adventure. Can you thrive alongside the hordes of giant insects, fighting to survive the perils of the backyard?The world is a vast, beautiful, and dangerous place especially when you have been shrunken to the size of an ant. Explore, build, and survive together in this cooperative survival-adventure. Can you thrive alongside the hordes of giant insects, fighting to survive the perils of the backyard? \r\r- Reactive World and Insect Life -\rExplore this immersive and persistent world, where the insect life reacts to your actions.\r - Base Building and Crafting -\rShelter and tools are critical to your survival. Build epic bases to protect you and your stuff from the insects and the elements. Craft weapons, tools, and armor, allowing you to better fight, explore and survive.\r - Online Co-op -\rYou can face the backyard alone or together, online, with up to three friends - it is your choice.\r - Campaign -\rUncover the secrets lurking in the shadows of Grounded as you freely explore the backyard and progress through its mysterious story.… Expand"}, {"name": "Streets of Rage 4", "details_link": "https://www.metacritic.com/game/xbox-one/streets-of-rage-4", "publisher": "DotEmu", "release_date": "Apr 30 2020", "developers": ["BlitWorks", "Lizardcube"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/2fd06bdd7c1a1e634b893f4a7a1bf1c8-98.jpg", "descriptions": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves andPublisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \r\rStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\r Famously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\r Featuring hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\r Whether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \r\rFeatures:\r * The comeback of the legendary Streets of Rage series.\r* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\r* Classic gameplay enhanced with brand new mechanics.\r* Soundtrack by a wide line-up of world-class musicians.\r* Braised chicken served on a pristine plate.… Expand"}, {"name": "Outer Wilds", "details_link": "https://www.metacritic.com/game/playstation-4/outer-wilds", "publisher": "Annapurna Interactive", "release_date": "Oct 15 2019", "developers": ["Mobius Digital", "LLC"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/deef060f3ceac79f11a39907ae13c66b-98.jpg", "descriptions": "Outer Wilds is an open world mystery about a solar system trapped in an endless time loop. You’re the newest recruit of Outer Wilds Ventures, a fledgling space program searching for answers in a strange, constantly evolving solar system. The planets are packed with hidden locations thatOuter Wilds is an open world mystery about a solar system trapped in an endless time loop. You’re the newest recruit of Outer Wilds Ventures, a fledgling space program searching for answers in a strange, constantly evolving solar system. The planets are packed with hidden locations that change with the passage of time.… Expand"}, {"name": "SingStar (2008)", "details_link": "https://www.metacritic.com/game/playstation-3/singstar-2008", "publisher": "SCEA", "release_date": "May 20 2008", "developers": ["SCEE London Studio"], "platforms": "PlayStation 3", "num_players": "1-8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 82, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/968d51eba731eba510e9c34de414849f-98.jpg", "descriptions": "SingStar PS3 takes the successful interactive singing experience established with the multi-million selling global PlayStation2 franchise to the next level with personalization and community taking center stage. SingStar PS3 allows you access to a catalog of hundreds of downloadable songsSingStar PS3 takes the successful interactive singing experience established with the multi-million selling global PlayStation2 franchise to the next level with personalization and community taking center stage. SingStar PS3 allows you access to a catalog of hundreds of downloadable songs featuring the real artists and videos, via the PS3 online SingStore. Become a global star as you share your SingStar experiences with friends and the online SingStar community via captured video, audio and photos. [SCEA]… Expand"}, {"name": "Lost Judgment", "details_link": "https://www.metacritic.com/game/playstation-5/lost-judgment", "publisher": "SegaSoft", "release_date": "Sep 24 2021", "developers": ["SegaSoft", "Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/aa80de3d0a3186af0dce4b4916145901-98.jpg", "descriptions": "SEIZE THE TRUTH - December 2021, Tokyo district court. Akihiro Ehara stands accused of groping a woman on a crowded train. A bystander’s video footage of his attempt to flee the scene and subsequent apprehension is all over the news, and public outcry demands a maximum sentence. “Three daysSEIZE THE TRUTH - December 2021, Tokyo district court. Akihiro Ehara stands accused of groping a woman on a crowded train. A bystander’s video footage of his attempt to flee the scene and subsequent apprehension is all over the news, and public outcry demands a maximum sentence. “Three days ago, a dead body was found in an abandoned building in Yokohama. Have you identified it yet?” he proclaims as confusion cuts through the court room. His defense lawyer, Saori Shirosaki, has no doubt that crucial details of the situation have been overlooked, as Ehara was not even tried for the murder. She contacts detective Takayuki Yagami to investigate this further.\r How could Ehara have committed two crimes at once? Was the sexual battery just a cover up? Has Ehara gamed the entire justice system? As victims surface and Yagami digs farther into the truth, he is faced with a question: Defend the law, or enact justice?\r From just a single stumble, one can become a monster…\r BRINGING JUSTICE AT THE EDGE OF THE LAW\r Put Yagami’s distinct martial arts forms to the test in order get to the bottom of the case. Harness the Crane, Tiger, and new Snake stance, a graceful style that can deflect and return an opponent’s strikes, using their energy against them.\r EVERYONE’S GOT A STORY\r Employ Yagami’s arsenal of detective tricks with new gadgets, stealthily tracking suspects, and crafty methods of infiltration. Leave no stone unturned in pursuit of the truth as you take on cases in both Tokyo and Yokohama.\r… Expand"}, {"name": "The Sexy Brutale", "details_link": "https://www.metacritic.com/game/xbox-one/the-sexy-brutale", "publisher": "Tequila Works", "release_date": "Apr 11 2017", "developers": ["Abstraction Games", "Tequila Works", "Cavalier Game Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/9efaf4b51f6eb268dbc31f025a7efb29-98.jpg", "descriptions": "The Sexy Brutale — a never-ending masked ball featuring intrigue, murder and the (quite possibly) occult! Relive the same mysterious day where the guests at the casino mansion are being murdered by the staff over and over again."}, {"name": "FIFA 07 Soccer", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-07-soccer", "publisher": "EA Sports", "release_date": "Oct  3 2006", "developers": ["Team Fusion"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/9a75074de0fd46efd1e43f970249ae76-98.jpg", "descriptions": "FIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new onlineFIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new online mode that enables you to pit your club against supporters of your real-world opponents. The online interactive leagues feature the F.A. Premier League, Bundesliga, French League and the Mexican 1st Division. Experience the future of online gaming as you play your games according to the real-world schedule. When they play, you play. Track your team's progress as the aggregate results determine your club's position in the league table. This year, new intelligent A.I. ensures that your 11 men on the pitch make realistic decisions, finding space and passing like professionals. A complete overhaul of the game engine now means that you have to employ real world tactics, make split-second decisions and think like a player in order to win matches.  Watch as your players jostle and collide realistically while trying to win balls. Experience the realism of the world's superstars, who come to life with signature moves and authentic playing styles and a more sophisticated shooting mechanic that gives you greater control to produce finesse shots.  Plus you now have the ability to apply topspin or backspin to the ball for more creative set-pieces. [Electronic Arts]… Expand"}, {"name": "Child of Light", "details_link": "https://www.metacritic.com/game/xbox-one/child-of-light", "publisher": "Ubisoft", "release_date": "Apr 30 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action", "General", "General", "Role-Playing", "General"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/9b42767f90ff468832120a36e48cf135-98.jpg", "descriptions": "Child of Light is a digital download, 2D side-scrolling role-playing game inspired by the art style of Studio Ghibli."}, {"name": "L.A. Noire: The VR Case Files", "details_link": "https://www.metacritic.com/game/pc/la-noire-the-vr-case-files", "publisher": "Rockstar Games", "release_date": "Dec 15 2017", "developers": ["Rockstar Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 82, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/0c175a8e1482e5058b9f199b38de2657-98.jpg", "descriptions": "A dark and violent crime thriller set against the backdrop of 1940’s Los Angeles, now in stunning virtual reality. L.A. Noire: The VR Case Files for HTC VIVE places you directly in the shoes of Detective Cole Phelps as you solve brutal crimes, plots and conspiracies inspired by real casesA dark and violent crime thriller set against the backdrop of 1940’s Los Angeles, now in stunning virtual reality. L.A. Noire: The VR Case Files for HTC VIVE places you directly in the shoes of Detective Cole Phelps as you solve brutal crimes, plots and conspiracies inspired by real cases from 1947 Los Angeles, one of the most corrupt and violent times in L.A. history. Featuring seven cases rebuilt specifically for virtual reality, L.A. Noire: The VR Case Files for HTC Vive adds new layers of immersion and realism to Rockstar Games’ atmospheric crime thriller as you solve select cases from the blockbuster original game, spanning mysteries from the Detective desks of Traffic, Arson, Homicide, and more. … Expand"}, {"name": "City of Villains", "details_link": "https://www.metacritic.com/game/pc/city-of-villains", "publisher": "NCSOFT", "release_date": "Oct 31 2005", "developers": ["Paragon Studios"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Modern", "Modern"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/e9209954b1f366b2d5c77911dca6ca1f-98.jpg", "descriptions": "City of Villains, the sequel to \"City of Heroes\", provides players with a chance to play the ?bad guy? in the comic-book inspired world created by Cryptic Studios. Take on the role of super-powered villains and create your own character using thousands of power and costume options. ThenCity of Villains, the sequel to \"City of Heroes\", provides players with a chance to play the ?bad guy? in the comic-book inspired world created by Cryptic Studios. Take on the role of super-powered villains and create your own character using thousands of power and costume options. Then battle heroes and become a true menace to society while plotting your way to world domination. Turn the tide on all the heroes and heroines and lead your crime syndicate into battle in the impressive 3D backdrop of Paragon City. [NCsoft]… Expand"}, {"name": "Cave Story 3D", "details_link": "https://www.metacritic.com/game/3ds/cave-story-3d", "publisher": "NIS America", "release_date": "Nov  8 2011", "developers": ["Nicalis"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D", "", "Metroidvania"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/d3935063b6ef9473ad5ff4a50b9febf9-98.jpg", "descriptions": "Originally released as a PC game and later for WiiWare/DSiWare, Cave Story is a side scrolling 2D action game."}, {"name": "The Banner Saga 2", "details_link": "https://www.metacritic.com/game/pc/the-banner-saga-2", "publisher": "Versus Evil", "release_date": "Apr 19 2016", "developers": ["Stoic"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/0aaaa65f9e0f731c0f4f704fca2ed3ac-98.jpg", "descriptions": "The aga continues in The Banner Saga 2. Continue your journey soon after the climactic events of The Banner Saga. The choices you made in the first game will affect who is alive and who is dead in this sequel."}, {"name": "Dorfromantik", "details_link": "https://www.metacritic.com/game/switch/dorfromantik", "publisher": "Toukana Interactive", "release_date": "Sep 29 2022", "developers": ["Toukana Interactive"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/5c16f6f52e8a481d318bdcccbaa2cbcf-98.jpg", "descriptions": "Dorfromantik is a peaceful building strategy and puzzle game where you create a beautiful and ever-growing village landscape by placing tiles. Explore a variety of colorful biomes, discover and unlock new tiles and complete quests to fill your world with life!"}, {"name": "Hatsune Miku: Project Diva MegaMix+", "details_link": "https://www.metacritic.com/game/pc/hatsune-miku-project-diva-megamix+", "publisher": "Sega", "release_date": "May 26 2022", "developers": ["Sega AM2"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 82, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/ef8399105ef39ba444212cf43be0835c-98.jpg", "descriptions": "Take the stage! The hit rhythm game series returns with exciting new features:- Mix it up and choose from two playable modes: traditional button control-based Arcade Mode or the new motion control-based Mix Mode. Featuring fan-favorite classics and new hits, choose from over 100 songs forTake the stage! The hit rhythm game series returns with exciting new features:- Mix it up and choose from two playable modes: traditional button control-based Arcade Mode or the new motion control-based Mix Mode. Featuring fan-favorite classics and new hits, choose from over 100 songs for endless rhythm fun!- Take advantage of new customization features! Choose from over 300 costumes, and design custom T-shirts in the new T-shirt editor.- Create playlists for your favorite music videos!No matter where or when, her music will be sure to reach your heart!… Expand"}, {"name": "Kaze and the Wild Masks", "details_link": "https://www.metacritic.com/game/pc/kaze-and-the-wild-masks", "publisher": "Soedesco", "release_date": "Mar 26 2021", "developers": ["Vox Game Studio", "PixelHive"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/dfdcb9fb4e9a7f1321247c7e5d9ccb67-98.jpg", "descriptions": "Let 90's inspired platformer Kaze and the Wild Masks take you on a trip down memory lane as you side-scroll your way through the Crystal Islands. In the colorful world of Kaze, you face enraged living vegetables in a variety of ways thanks to the powers of the Wild Masks. Pounce ferociouslyLet 90's inspired platformer Kaze and the Wild Masks take you on a trip down memory lane as you side-scroll your way through the Crystal Islands. In the colorful world of Kaze, you face enraged living vegetables in a variety of ways thanks to the powers of the Wild Masks. Pounce ferociously like a tiger, soar through the sky like an eagle, sprint fiercely like a lizard, and rule the sea like a shark.Kaze and the Wild Masks embraces all the classic 90's platformer elements and gives it a personal touch with modern-looking pixel art graphics. With simple and intuitive mechanics, difficult challenges, iconic bosses, and the satisfyingly smooth platforming and speed of the game, you will find yourself hooked to accomplish everything.… Expand"}, {"name": "The Wolf Among Us: Episode 2 - Smoke and Mirrors", "details_link": "https://www.metacritic.com/game/playstation-3/the-wolf-among-us-episode-2---smoke-and-mirrors", "publisher": "Telltale Games", "release_date": "Feb  4 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "Point-and-Click"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/1f9abc5a038c8c5bdd4bc76c6779e1f8-98.jpg", "descriptions": "The Wolf Among Us is a five episode series from the creators of the 2012 Game of the Year: The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore andThe Wolf Among Us is a five episode series from the creators of the 2012 Game of the Year: The Walking Dead. Based on Fables (DC Comics/Vertigo), an award-winning comic book series, it is an often violent, mature and hard-boiled thriller where the characters and creatures of myth, lore and legend are real and exist in our world. As Bigby Wolf - THE big bad wolf in human form - you will discover that the brutal, bloody murder of a Fable is just a taste of things to come, in a game series where your every decision can have enormous consequences.… Expand"}, {"name": "LEGO Marvel Super Heroes", "details_link": "https://www.metacritic.com/game/wii-u/lego-marvel-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 22 2013", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/5f48e6e4da3b25927584e41accb78696-98.jpg", "descriptions": "LEGO Marvel Super Heroes features an original story where players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world."}, {"name": "Kentucky Route Zero - Act II", "details_link": "https://www.metacritic.com/game/pc/kentucky-route-zero---act-ii", "publisher": "Cardboard Computer", "release_date": "May 31 2013", "developers": ["Cardboard Computer"], "platforms": "PC", "genres": ["Adventure", "General", "General"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/b868aaf076b781319567ab421b7dcea3-98.jpg", "descriptions": "Kentucky Route Zero is a magical realistic adventure game about a secret highway in the caves beneath Kentucky, and the mysterious folks who travel it."}, {"name": "Minecraft: Xbox 360 Edition", "details_link": "https://www.metacritic.com/game/xbox-360/minecraft-xbox-360-edition", "publisher": "Microsoft Game Studios", "release_date": "May  9 2012", "developers": ["4J Studios", "Mojang AB"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Fantasy", "Action Adventure", "Adventure", "3D", "Sandbox", "First-Person", "Fantasy"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/5b696f9127ded11219815fda5136d469-98.jpg", "descriptions": "The game involves players creating and destroying various types of blocks in a three dimensional environment. The player takes an avatar that can destroy or create blocks, forming fantastic structures, creations and artwork across the various multiplayer servers in multiple game modes."}, {"name": "MLB 07: The Show", "details_link": "https://www.metacritic.com/game/psp/mlb-07-the-show", "publisher": "SCEA", "release_date": "Feb 27 2007", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 2", "PlayStation 3", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/98c2bb4db7f03aebc817306ff800549b-98.jpg", "descriptions": "MLB 07 The Show for the PSP system continues to be a fan favorite with its core features and ability to play anytime, anywhere, on the go. Plus, sports fanatics can utilize the PSP system's online news service to get the latest MLB news feeds online or save them to the Memory Stick Duo andMLB 07 The Show for the PSP system continues to be a fan favorite with its core features and ability to play anytime, anywhere, on the go. Plus, sports fanatics can utilize the PSP system's online news service to get the latest MLB news feeds online or save them to the Memory Stick Duo and review them offline at their convenience. [SCEA]… Expand"}, {"name": "Dead Space: Extraction", "details_link": "https://www.metacritic.com/game/wii/dead-space-extraction", "publisher": "Electronic Arts", "release_date": "Sep 29 2009", "developers": ["Eurocom Entertainment Software", "Visceral Games", "Eurocom"], "platforms": ["PlayStation 3", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Horror", "Horror", "Shooter", "Light Gun"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/9fa44b84850f14755d990b3ac20575eb-98.jpg", "descriptions": "Built from the ground up and developed exclusively for the Wii, Dead Space Extraction is a prequel that reveals the events leading up to Isaac Clarke’s mission on the USG Ishimura in the original Dead Space game released in 2008. Dead Space Extraction marries the innovative motion controlsBuilt from the ground up and developed exclusively for the Wii, Dead Space Extraction is a prequel that reveals the events leading up to Isaac Clarke’s mission on the USG Ishimura in the original Dead Space game released in 2008. Dead Space Extraction marries the innovative motion controls of the Wii Remote with a frenetic first person perspective to create a new action-packed horror experience. Dead Space Extraction tells the story of a handful of space colonists desperately struggling to escape from a horrific infection on the Aegis VII mining colony deep in the furthest regions of space. The game introduces a new heroine to the fiction and as the crew fall victim to a mysterious contagion aboard the ship, it becomes clear that protecting her may be their only hope for survival. Dead Space Extraction introduces all new characters, weapons, enemies, puzzles and co-operative multiplayer gameplay. [Electronic Arts]… Expand"}, {"name": "NBA 2K10", "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k10", "publisher": "2K Sports", "release_date": "Oct  6 2009", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/7618eb8caf45cb10f001d076a4b5a378-98.jpg", "descriptions": "NBA Today - All the real world matchups, news and stats are automatically streamed right into your game. No longer will your commentary and overlays be stale and out of date. NBA Today keeps everything fresh and up to date based upon what is really happening in the NBA. My Player Mode -NBA Today - All the real world matchups, news and stats are automatically streamed right into your game. No longer will your commentary and overlays be stale and out of date. NBA Today keeps everything fresh and up to date based upon what is really happening in the NBA. My Player Mode - Create the ultimate NBA player and guide his every career move. Start as an undrafted rookie in the Summer Circuit; work hard enough and you may get an invite to participate in an NBA team’s training camp, or you may end up in the D-League. The road to being an NBA star is a long and hard battle. Living Rosters - The 2K Insider and his team of NBA analysts continue to keep NBA 2K10 fresh with up-to-date team and player information, including roster and lineup moves, trades, injuries and player ratings.  Now track all of the changes through the season with interactive menus and analysis. Seamless Online Experience - Forget the past, with NBA2K10 online play is fully incorporated into every mode of the game. Now you can play the AI, challenge the friend sitting next to you or play your buddy across town anytime, from anywhere in the game. Signature Play - Signature Play pulls together all of NBA 2K’s player Signature Styles and adds in all-new Signature Tendencies and facial expressions, creating NBA 2K10 teams that play and react like their real life counterparts for an unbelievably realistic NBA experience. [2K Sports]… Expand"}, {"name": "Project CARS 2", "details_link": "https://www.metacritic.com/game/playstation-4/project-cars-2", "publisher": "Bandai Namco Games", "release_date": "Sep 22 2017", "developers": ["Bandai Namco Games", "Slightly Mad Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 82, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/6603ede188cea527a8c3e3cd5b7ee946-98.jpg", "descriptions": "Project CARS 2 is the next evolution in the award-winning racing series, featuring the most iconic cars racing under the most thrilling conditions to deliver the Ultimate Driver Journey.\r Created by gamers, tested by world-class racing drivers from Team SMS-R, and the definitive choice ofProject CARS 2 is the next evolution in the award-winning racing series, featuring the most iconic cars racing under the most thrilling conditions to deliver the Ultimate Driver Journey.\r Created by gamers, tested by world-class racing drivers from Team SMS-R, and the definitive choice of Esports pros... Project CARS 2 captures the essence of real racing in the most beautiful, intense, authentic, and technically-advanced racing game on the planet.\r FEATURES:\r * Over 170 licensed cars from the most iconic brands.\r* The largest track roster of any console racing game including ice and dirt tracks.\r* New vehicle types and motorsport classes including Rallycross, IndyCar, and Oval.\r* Dynamic time of day, weather, and new seasonal conditions.\r* New Online Championships mode.\r* LiveTrack 3.0 powers dynamic surface conditions that affect vehicle performance and handling, and evolves the track over the course of a race weekend.\r* Esports built-in from day one with full ranking, and broadcasting / streaming functionality.\r* Bleeding-edge tire physics, advanced AI, and intuitive gamepad control.… Expand"}, {"name": "NBA Ballers", "details_link": "https://www.metacritic.com/game/xbox/nba-ballers", "publisher": "Midway", "release_date": "Apr  5 2004", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-3 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/ad88aa5a57d43aec4a997223d8fee0ba-98.jpg", "descriptions": "It's all about the chromed-out cars, jewelry, ladies, tattoos, and jets in NBA Ballers, the basketball game that highlights both the one-on-one confrontation and the glamorous lifestyle of NBA superstars. Choose from current and legendary NBA players, such as Tracy McGrady, Chris Webber,It's all about the chromed-out cars, jewelry, ladies, tattoos, and jets in NBA Ballers, the basketball game that highlights both the one-on-one confrontation and the glamorous lifestyle of NBA superstars. Choose from current and legendary NBA players, such as Tracy McGrady, Chris Webber, Magic Johnson, and Wilt Chamberlain, and face-off in some lavish player home courts. Although the game focuses on the one-on-one experience, you can also play in one-on-three and special-rules matches. After the tournaments, spend your winnings on anything from licensed cars to expensive mansions.… Expand"}, {"name": "Shadow of the Tomb Raider", "details_link": "https://www.metacritic.com/game/xbox-one/shadow-of-the-tomb-raider", "publisher": "Square Enix", "release_date": "Sep 12 2018", "developers": ["Eidos Montreal"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/6fd43ddb25b5e081ffbd389622c482cc-98.jpg", "descriptions": "Experience Lara Croft's defining moment as she becomes the Tomb Raider. In Shadow of the Tomb Raider, Lara must master a deadly jungle, overcome terrifying tombs, and persevere through her darkest hour. As she races to save the world from a Maya apocalypse, Lara will ultimately be forgedExperience Lara Croft's defining moment as she becomes the Tomb Raider. In Shadow of the Tomb Raider, Lara must master a deadly jungle, overcome terrifying tombs, and persevere through her darkest hour. As she races to save the world from a Maya apocalypse, Lara will ultimately be forged into the Tomb Raider she is destined to be.\r FEATURES:\r * Survive and Thrive In the Deadliest Place on Earth: Master an unforgiving jungle setting in order to survive. Explore underwater environments filled with crevasses and deep tunnel systems.\r * Become One With the Jungle: Outgunned and outnumbered, Lara must use the jungle to her advantage. Strike suddenly and disappear like a jaguar, use mud as camouflage, and instill fear in enemies to sow chaos.\r * Discover Dark and Brutal Tombs: Tombs are more terrifying than ever before, requiring advanced traversal techniques to reach them, and once inside they are filled with deadly puzzles.\r * Uncover Living History: Discover a hidden city and explore the biggest hub space ever found in a Tomb Raider game.… Expand"}, {"name": "Katamari Damacy REROLL", "details_link": "https://www.metacritic.com/game/playstation-4/katamari-damacy-reroll", "publisher": "Bandai Namco Games", "release_date": "Nov 20 2020", "developers": ["Bandai Namco Games"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/8b953cc5037ed02abd78422d425661d7-98.jpg", "descriptions": "The stop-at-nothing pushing prince is back and ready to reroll. When the King of All Cosmos accidentally destroys all the stars in the sky, he orders you, his pint-sized princely son, to put the twinkle back in the heavens above. Join the King and Prince of Cosmos on their wacky adventure toThe stop-at-nothing pushing prince is back and ready to reroll. When the King of All Cosmos accidentally destroys all the stars in the sky, he orders you, his pint-sized princely son, to put the twinkle back in the heavens above. Join the King and Prince of Cosmos on their wacky adventure to restore the stars now in full HD. The beloved roll-em-up game returns with fully updated graphics, completely recreated cutscenes and in full HD.… Expand"}, {"name": "Football Manager 2018", "details_link": "https://www.metacritic.com/game/pc/football-manager-2018", "publisher": "SegaSoft", "release_date": "Nov 10 2017", "developers": ["Sports Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 82, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/73750af8ca9c3b49e052a62072cc75f8-98.jpg", "descriptions": "Fast-track your way to footballing history with the Football Manager 2018. A double-sided Management Masterclass pull-out races you through your first steps in the digital dugout and gears you up for long-term success, helping you transform your team from contenders to champions andFast-track your way to footballing history with the Football Manager 2018. A double-sided Management Masterclass pull-out races you through your first steps in the digital dugout and gears you up for long-term success, helping you transform your team from contenders to champions and elevating you to managerial icon.\r Football Manager 2018 achieves an interactive reality in depth, emotion and control like never before, taking you places only accessible in the completely immersive game world. Quite simply, it's the closest thing to doing the job for real.\r They say football is a game of opinions and everyone has theirs, but it's only yours that counts around here. You make the decisions now, from who you sign and who you sell, to how you manage your budget. Will you build tactics around the players at your disposal or train them in your vision of how the game should be played? Who you pick and who you bench will affect squad harmony, and its up to you to manage it. Every decision comes back to you.\r Get it right and youll be the star of the show, grabbing the newspaper headlines and dominating trends on social media. Theyll write your name in footballing folklore... if you succeed, of course. With unparalleled choices both on and off the pitch, all within the immersive footballing world, it's time to decide what kind of manager do you want to be?… Expand"}, {"name": "Resident Evil: Revelations", "details_link": "https://www.metacritic.com/game/3ds/resident-evil-revelations", "publisher": "Capcom", "release_date": "Feb  7 2012", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "3DS"], "num_players": "2 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/26dcc4fdd15ec9b37a3bee620fdbec0d-98.jpg", "descriptions": "Resident Evil: Revelations tells the story of what happens between Resident Evil 4 and Resident Evil 5 on the Nintendo 3DS."}, {"name": "Tom Clancy's Splinter Cell: Blacklist", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-splinter-cell-blacklist", "publisher": "Ubisoft", "release_date": "Aug 20 2013", "developers": ["Ubisoft Toronto"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/81a201d62abea8a80f5d0116a01c63c8-98.jpg", "descriptions": "Unleash the force of the most lethal agent to ever exist. You are Sam Fisher, and you've been granted the ultimate license to protect innocents against an array of global terror attacks known as Blacklist - the freedom to use limitless power, to bend or break virtually every law, and to riseUnleash the force of the most lethal agent to ever exist. You are Sam Fisher, and you've been granted the ultimate license to protect innocents against an array of global terror attacks known as Blacklist - the freedom to use limitless power, to bend or break virtually every law, and to rise to the level of the world's most lethal operative. If you are successful, the President of the United States will deny your existence. If you fail, millions will likely face their deaths.… Expand"}, {"name": "You Don't Know Jack", "details_link": "https://www.metacritic.com/game/xbox-360/you-dont-know-jack", "publisher": "THQ", "release_date": "Feb  8 2011", "developers": ["Jellyvision", "Iron Galaxy Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/2009cace39f2d247060437ee5522ea11-98.jpg", "descriptions": "The classic smart-aleck quiz show game is making its debut on current-generation consoles."}, {"name": "Lost in Play", "details_link": "https://www.metacritic.com/game/switch/lost-in-play", "publisher": "HappyJuice Games", "release_date": "Aug 10 2022", "developers": ["HappyJuice Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/1cbc8a523956e399b6b9f300fb731743-98.jpg", "descriptions": "Go on a feel-good adventure with a brother and sister as they explore dreamscapes and befriend magical creatures. Lost in their imagination, Toto and Gal must stick together and solve puzzles to journey back home. This whimsical puzzle adventure game will make you feel like you're playing a Go on a feel-good adventure with a brother and sister as they explore dreamscapes and befriend magical creatures. Lost in their imagination, Toto and Gal must stick together and solve puzzles to journey back home. This whimsical puzzle adventure game will make you feel like you're playing a cartoon! … Expand"}, {"name": "Not For Broadcast", "details_link": "https://www.metacritic.com/game/pc/not-for-broadcast", "publisher": "tinyBuild", "release_date": "Jan 25 2022", "developers": ["NotGames"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/3652f3625b93385b91a25332fa202682-98.jpg", "descriptions": "Take control of the National Nightly News as a radical government comes to power. In this immersive, high-pressure, propaganda sim, you control what the people see and determine what’s Not For Broadcast."}, {"name": "Sam & Max Save the World Remastered", "details_link": "https://www.metacritic.com/game/pc/sam-max-save-the-world-remastered", "publisher": "Skunkape Games", "release_date": "Dec  2 2020", "developers": ["Skunkape Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 82, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/5a685bc10a4c650ce0ddcbcea8c1dff0-98.jpg", "descriptions": "The Freelance Police are back in a remastered version of their first season of episodic adventure games, lovingly updated by a small group of the original developers with the blessing of Sam & Max creator Steve Purcell."}, {"name": "SUPERHOT", "details_link": "https://www.metacritic.com/game/pc/superhot", "publisher": "SUPERHOT", "release_date": "Feb 25 2016", "developers": ["SUPERHOT"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/2892b497ae3d0bcebcc760a33c9a4744-98.jpg", "descriptions": "SUPERHOT is the first person shooter where time moves only when you move. With its gameplay and unique, stylized graphics SUPERHOT aims to finally add something new and disruptive to the FPS genre. See the bullets crawling towards you as you carefully plan your steps and aim your gun. EnjoySUPERHOT is the first person shooter where time moves only when you move. With its gameplay and unique, stylized graphics SUPERHOT aims to finally add something new and disruptive to the FPS genre. See the bullets crawling towards you as you carefully plan your steps and aim your gun. Enjoy the mayhem that is unleashed as you put that plan into motion. Dodge bullets. Take out your enemies. One step at a time. [SuperHot Team]… Expand"}, {"name": "LEGO Marvel Super Heroes", "details_link": "https://www.metacritic.com/game/playstation-3/lego-marvel-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 22 2013", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/e3516d91930645940a01f7604c3c51b4-98.jpg", "descriptions": "LEGO Marvel Super Heroes features an original story where players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world."}, {"name": "Pokemon Ruby Version", "details_link": "https://www.metacritic.com/game/game-boy-advance/pokemon-ruby-version", "publisher": "Nintendo", "release_date": "Mar 18 2003", "developers": ["Game Freak"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/6f9ccf5d22b440d9e86748dc29500ffb-98.jpg", "descriptions": "The race to catch 'em all is on again in Pokémon Ruby.  This entry in the Pokémon series features an all-new storyline, awesome new Pokémon, and addictive RPG gameplay.  One of the biggest additions to Pokémon Ruby is the two-on-two battle system, which allows youThe race to catch 'em all is on again in Pokémon Ruby.  This entry in the Pokémon series features an all-new storyline, awesome new Pokémon, and addictive RPG gameplay.  One of the biggest additions to Pokémon Ruby is the two-on-two battle system, which allows you to link up with three friends to battle competitively or cooperatively.  You can also showcase your Pokémon's coolness, beauty, cuteness, smartness, and toughness in Pokémon contests.  With new Pokémon, two-on-two battles, and an all-new region of Hoenn to explore, Pokémon Sapphire takes the Pokémon experience to the next level.… Expand"}, {"name": "MVP Baseball 2003", "details_link": "https://www.metacritic.com/game/xbox/mvp-baseball-2003", "publisher": "EA Sports", "release_date": "Mar 10 2003", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/cc43f3491ed5ac23b0bf89e783e4ffa9-98.jpg", "descriptions": "This year's installment of MVP Baseball gives you more control over the game than ever before.  MVP Baseball 2003 features a more intuitive pitching and batting system, picture-in-picture base-running, and an all-new throw meter in addition to new player animations, franchise mode play, andThis year's installment of MVP Baseball gives you more control over the game than ever before.  MVP Baseball 2003 features a more intuitive pitching and batting system, picture-in-picture base-running, and an all-new throw meter in addition to new player animations, franchise mode play, and deeper gameplay.  Experience a robust Franchise mode, which includes rookie drafts, player development, career-ending injuries, and hirings/firings.  The game also provides expert advice from leading MLB players Torii Hunter, Trot Nixon, Eric Chavez, and Tim Hudson.  This is your chance to showcase your baseball skills.… Expand"}, {"name": "NHL Hitz 20-03", "details_link": "https://www.metacritic.com/game/gamecube/nhl-hitz-20-03", "publisher": "Midway", "release_date": "Sep 16 2002", "developers": ["Midway"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Arcade"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/a2246ffa88a33b070d814c25964c71a4-98.jpg", "descriptions": "In the world of NHL Hitz 20-03, hard-checking and highlight-reel action is common. This year's installment in the action-packed NHL Hitz series showcases three-on-three gameplay with players who leap, glide, check, pass, and score on defenders. New features include a deeper New Season mode,In the world of NHL Hitz 20-03, hard-checking and highlight-reel action is common. This year's installment in the action-packed NHL Hitz series showcases three-on-three gameplay with players who leap, glide, check, pass, and score on defenders. New features include a deeper New Season mode, player trades, a playoff tree, and official NHL awards. The game also boasts bigger, stronger, and faster players, plus improved goalie logic, behavior, animations, and control, making it tougher to score.… Expand"}, {"name": "Gitaroo Man", "details_link": "https://www.metacritic.com/game/playstation-2/gitaroo-man", "publisher": "Koei", "release_date": "Feb 19 2002", "developers": ["Koei/Inis"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/7429f9103fbe5416febfbeb2315b6a7f-98.jpg", "descriptions": "An entirely new type of music/rhythm game, where your instrument is your weapon to fight against evil. Unlike traditional music games which simply featured pressing buttons in rhythm with on screen actions, Gitaroo-Man requires players to use both the analog stick and the controller buttonsAn entirely new type of music/rhythm game, where your instrument is your weapon to fight against evil. Unlike traditional music games which simply featured pressing buttons in rhythm with on screen actions, Gitaroo-Man requires players to use both the analog stick and the controller buttons at the same time, controlling the on-screen character with jumps, ducks and attacks. [KOEI]… Expand"}, {"name": "Theme Park Roller Coaster", "details_link": "https://www.metacritic.com/game/playstation-2/theme-park-roller-coaster", "publisher": "Electronic Arts", "release_date": "Dec  4 2000", "developers": ["Bullfrog Productions"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Tycoon"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/938b651489d0b9eb90a853146369d3bf-98.jpg", "descriptions": "Sim fans should get a major kick out of Theme Park Roller Coaster."}, {"name": "Dave Mirra Freestyle BMX", "details_link": "https://www.metacritic.com/game/playstation/dave-mirra-freestyle-bmx", "publisher": "Acclaim", "release_date": "Sep 26 2000", "developers": ["Z-Axis", "Ltd."], "platforms": ["PC", "PlayStation"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/237a616961b5214a538a765bcc4f963f-98.jpg", "descriptions": "The only major flaw in Dave Mirra Freestyle BMX is that the game is a touch on the easy side."}, {"name": "Karaoke Revolution Volume 3", "details_link": "https://www.metacritic.com/game/playstation-2/karaoke-revolution-volume-3", "publisher": "Konami", "release_date": "Nov  9 2004", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/c61df500550366897605639a071816f1-98.jpg", "descriptions": "In response to popular demand, Karaoke Revolution 3 will let karaoke crooners sing with - and compete against - friends with the addition of duel microphone support and exciting new modes for two mic gameplay. In addition, Karaoke Revolution Volume 3 includes more than 35 new songs. DuetsIn response to popular demand, Karaoke Revolution 3 will let karaoke crooners sing with - and compete against - friends with the addition of duel microphone support and exciting new modes for two mic gameplay. In addition, Karaoke Revolution Volume 3 includes more than 35 new songs. Duets mode lets aspiring pop stars play as a team and shoot for high scores by singing along to classic karaoke duet tunes such as \"Under Pressure,\" \"Love Shack\" and \"Ain't No Mountain High Enough.\" Players can even practice their separate parts and learn how to harmonize with each other to achieve the perfect score. For some friendly competition, two players can square off and take turns singing every other phrase in a song while joining together during the chorus in Sing-Off mode. The player with the most points at the end of the track wins. Knockout mode offers the fiercest karaoke battle yet, pitting players against each other while singing the same song in unison. A battle meter keeps track of the gamers' progress and when it fills up for one player, the other is knocked out! The collection of well-known tunes includes \"Beat It,\" \"Killing Me Softly,\" \"New York, New York\" and \"You're The One That I Want.\" [Konami]… Expand"}, {"name": "Dawn of Discovery", "details_link": "https://www.metacritic.com/game/ds/dawn-of-discovery", "publisher": "Ubisoft", "release_date": "Jun 17 2009", "developers": ["Keen Games"], "platforms": ["PC", "DS"], "genres": ["Simulation", "Strategy", "Real-Time", "General", "General", "Historic"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/5f30147acebdfaae3c1ebab22b806528-98.jpg", "descriptions": "(Also known as \"Anno 1404: Dawn of Discovery\")  Dawn of Discovery takes place in the year 1404, when King George's land is suffering from severe droughts and brutal famine. Aware of his people's distress, the king calls on his two sons, William and Edward, to acquire new territories in order(Also known as \"Anno 1404: Dawn of Discovery\")  Dawn of Discovery takes place in the year 1404, when King George's land is suffering from severe droughts and brutal famine. Aware of his people's distress, the king calls on his two sons, William and Edward, to acquire new territories in order to produce enough goods to satisfy the needs of his empire’s inhabitants. Whereas Edward suggests aggressive means to collect the precious resources, his brother William offers a peaceful solution, proposing to explore new and unsettled lands in the south of the kingdom. With his Father’s blessing, William heads south to the mysterious Orient and returns with valuable new technologies such as the water pump that allows dry lands to be cultivated in order to produce enough food for the people. But there are still many unmet needs within the king's empire, and players are tasked with the mission of fulfilling those needs while both expanding and sustaining the vast society. Build and sustain your own expansive empire. Explore the beautifully detailed world and discover new places to create your civilization. Set up trade posts in the spice mines of the Orient and explore new trade routes to keep your nation growing. Learn from other nearby cultures to expand your horizons and master the challenges of establishing a prosperous society. [Ubisoft]… Expand"}, {"name": "Professor Layton and the Miracle Mask", "details_link": "https://www.metacritic.com/game/3ds/professor-layton-and-the-miracle-mask", "publisher": "Nintendo", "release_date": "Oct 28 2012", "developers": ["Level 5"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/00f12dfa494581816b89cac4c01f9bca-98.jpg", "descriptions": "Professor Layton's first adventure on the Nintendo 3DS system takes him to the colorful city of Monte d'Or, where he must stop a mysterious man from wreaking havoc with the powerful Mask of Chaos."}, {"name": "Yakuza 5 Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/yakuza-5-remastered", "publisher": "Sega", "release_date": "Feb 11 2020", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/22ccf76ea2a17be6c3c6b1436081e67b-98.jpg", "descriptions": "The legendary dragon returns to the criminal underworld of Yakuza. Kazuma Kiryu, once known as the Dragon of Dojima, was living a quiet life as a taxi driver in Hakata after severing all his ties with the underworld.  However, at the dawn of the bloody war between the Tojo Clan and the OmiThe legendary dragon returns to the criminal underworld of Yakuza. Kazuma Kiryu, once known as the Dragon of Dojima, was living a quiet life as a taxi driver in Hakata after severing all his ties with the underworld.  However, at the dawn of the bloody war between the Tojo Clan and the Omi Alliance, Kazuma is forced to accept his inescapable fate and returns to a life filled with crime and violence to protect his loved ones.… Expand"}, {"name": "The Pinball Arcade", "details_link": "https://www.metacritic.com/game/playstation-4/the-pinball-arcade", "publisher": "Alliance Digital Media", "release_date": "Dec 17 2013", "developers": ["Farsight Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 82, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/4bec1a937ca64d35bf4b6395dd794815-98.jpg", "descriptions": "This downloadable pinball game features licensed tables from Williams Gottlieb, Bally, and Stern."}, {"name": "Monster Hunter 3 Ultimate", "details_link": "https://www.metacritic.com/game/wii-u/monster-hunter-3-ultimate", "publisher": "Capcom", "release_date": "Mar 19 2013", "developers": ["Capcom"], "platforms": ["3DS", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Fantasy", "Action RPG"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/22a0d328ee021ecd084b56c176e2dce1-98.jpg", "descriptions": "Traverse the grand world of Monster Hunter as you journey through more than two hundred quests, battle larger-than-larger-than-life monsters, and create a myriad of weapons and armor. Hunt with your pair of AI companions in single player quests or connect via the Wii U system with up to 3Traverse the grand world of Monster Hunter as you journey through more than two hundred quests, battle larger-than-larger-than-life monsters, and create a myriad of weapons and armor. Hunt with your pair of AI companions in single player quests or connect via the Wii U system with up to 3 friends in 4-player online engagements. Graphically rich 1080p HD visuals and online voice chat capabilities promise to make this the best Monster Hunter to date.… Expand"}, {"name": "SnowRunner", "details_link": "https://www.metacritic.com/game/pc/snowrunner", "publisher": "Focus Home Interactive", "release_date": "Apr 28 2020", "developers": ["Saber Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Simulation", "Racing", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 82, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/78f7720634893c1e71da65cb69e73802-98.jpg", "descriptions": "SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.Overcome mud,SnowRunner puts you in the driver's seat of powerful vehicles as you conquer extreme open environments with the most advanced terrain simulation ever. Drive 40 vehicles from brands such as Ford, Chevrolet, and Freightliner as you leave your mark on an untamed open world.Overcome mud, torrential waters, snow, and frozen lakes while taking on perilous contracts and missions. Expand and customize your fleet with many upgrades and accessories including an exhaust snorkel for heavy waters or chain tires to battle the snow.… Expand"}, {"name": "Saints Row: The Third", "details_link": "https://www.metacritic.com/game/playstation-3/saints-row-the-third", "publisher": "THQ", "release_date": "Nov 15 2011", "developers": ["Volition Inc."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/d9f05e9557f62682f68b71535d567110-98.jpg", "descriptions": "Years after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobble head dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrityYears after taking Stilwater for their own, the Third Street Saints have evolved from street gang to household brand name, with Saints sneakers, Saints energy drinks and Johnny Gat bobble head dolls all available at a store near you. The Saints are kings of Stilwater, but their celebrity status has not gone unnoticed. The Syndicate, a legendary criminal fraternity with pawns in play all over the globe, has turned its eye on the Saints and demands tribute. Refusing to kneel to the Syndicate, you take the fight to a new city, playing out the most outlandish gameplay scenarios ever seen. Strap it on. … Expand"}, {"name": "Borderlands: The Handsome Collection", "details_link": "https://www.metacritic.com/game/playstation-4/borderlands-the-handsome-collection", "publisher": "2K Games", "release_date": "Mar 24 2015", "developers": ["Gearbox Software", "Iron Galaxy Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/a39c84ab763de99951128e86d40a1691-98.jpg", "descriptions": "Borderlands: The Handsome Collection includes the definitive versions of both Borderlands 2 and Borderlands: The Pre-Sequel, built specifically for next-gen consoles."}, {"name": "Yakuza 6: The Song of Life", "details_link": "https://www.metacritic.com/game/pc/yakuza-6-the-song-of-life", "publisher": "Sega", "release_date": "Mar 25 2021", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/887042f5bb89c1b5de4b2681851da5af-98.jpg", "descriptions": "In Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family -- be those ties through blood or bond -- when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, anIn Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family -- be those ties through blood or bond -- when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, an older and weathered Kiryu comes to find out that his surrogate daughter, Haruka, has gone missing from the orphanage he looks after. The trail leads him to his old stomping grounds in Kamurocho, where he discovers that she has been struck by a car and now lies in a coma. To make matters worse, Kiryu learns that Haruka now has a son that he must look after. With baby in hand, Kiryu journeys to the seaside town of Onomichi, Hiroshima to unravel the truth about Haruka, her son, and a sinister secret that the Hiroshima yakuza are harbouring. From the unparalleled realism of the new setting of Onomichi, a beautiful, sleepy port town in Hiroshima Prefecture, to the latest evolution of Kamurocho, the biggest red-light district in Tokyo, Yakuza 6 is the ultimate iteration the game's blend of gritty crime story, hyper-explosive combat, and all the vices and distractions those locales have to offer.… Expand"}, {"name": "Tom Clancy's The Division 2", "details_link": "https://www.metacritic.com/game/playstation-4/tom-clancys-the-division-2", "publisher": "Ubisoft", "release_date": "Mar 12 2019", "developers": ["Massive Entertainment"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["First-Person", "Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 82, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/873b92d1223875b9b4dfc720a0fd0dab-98.jpg", "descriptions": "Set in Washington D.C., the game takes place 7 months after a deadly virus was released in New York City and the nation has become a shell of its former self. While the virus has been contained, its effects are most evident in the devastated streets of the nation's capital where survivorsSet in Washington D.C., the game takes place 7 months after a deadly virus was released in New York City and the nation has become a shell of its former self. While the virus has been contained, its effects are most evident in the devastated streets of the nation's capital where survivors cling to hope and struggle to rebuild. Enter The Division, a unit of civilian sleeper agents who now must work to stop enemy factions from completely taking over the city – and ultimately, the nation. As a universally-regarded seat of power, if D.C. falls, the nation falls. With civilians helpless and fearing for their lives, players will be the last line of defense in preventing the total collapse of society. [Ubisoft]… Expand"}, {"name": "Forza Horizon 2: Storm Island", "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-2-storm-island", "publisher": "Microsoft Game Studios", "release_date": "Dec 16 2014", "developers": ["Playground Games"], "platforms": "Xbox One", "genres": ["Driving", "GT / Street", "Racing", "Simulation", "Automobile"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/88f2f714733dad62cfdd4adab2796fb9-98.jpg", "descriptions": "The Storm Island expansion brings more beauty, more challenge, and more ways to compete with and against opponents."}, {"name": "Super Stardust Delta", "details_link": "https://www.metacritic.com/game/playstation-vita/super-stardust-delta", "publisher": "SCEA", "release_date": "Feb 14 2012", "developers": ["Housemarque"], "platforms": "PlayStation Vita", "genres": ["General", "Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/9448506838c50dc5ca3b41d25866d97b-98.jpg", "descriptions": "The Super Stardust franchise blasts its way into your hands with its latest iteration: Super Stardust Delta. With brand-new features made specifically for Vita, players continue to destroy everything in their sight. Create black holes, launch swarm missiles and unleash shockwaves withThe Super Stardust franchise blasts its way into your hands with its latest iteration: Super Stardust Delta. With brand-new features made specifically for Vita, players continue to destroy everything in their sight. Create black holes, launch swarm missiles and unleash shockwaves with all-new Vita controls. [Sony]… Expand"}, {"name": "Tiger Woods PGA Tour 09", "details_link": "https://www.metacritic.com/game/playstation-3/tiger-woods-pga-tour-09", "publisher": "Electronic Arts", "release_date": "Aug 26 2008", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/4edad9f54b6735f5ce493f15fc887362-98.jpg", "descriptions": "This year's Tiger features dynamic, personalized gameplay via Tiger Woods' personal coach, Hank Haney. Looking to drive the ball long and straight? Trying to nail the pin with the approach shot? An all-new addition to this year’s game, Haney will assist gamers as they hit the links and tryThis year's Tiger features dynamic, personalized gameplay via Tiger Woods' personal coach, Hank Haney. Looking to drive the ball long and straight? Trying to nail the pin with the approach shot? An all-new addition to this year’s game, Haney will assist gamers as they hit the links and try to advance their career to win the FedExCup.  In Tiger Woods PGA Tout 09, a player's skill level is dynamic, constantly adjusting throughout the round just as it would during a real afternoon out on the links.  Following each round, Haney will deliver customized feedback on a player's performance. This feedback system allows all gamers, rookies or PGA TOUR pros, to compete and enjoy the game at any level. EA SPORTS GamerNet is a ground-breaking online innovation that features a refined, easy-to-use interface in Tiger Woods PGA Tour 09. EA SPORTS GamerNet challenges, such as long drive, approach shots and putting will be delivered instantly throughout all game modes and players have the ability to post their challenges from the fairways. EA SPORTS GamerNet also features an all-new daily leaderboard and challenges customized to fit an individual's playing style. Online play has also been enhanced with Simultaneous Play. This all-new online engine gives up to four players the ability to play each hole at the same time, allowing players to get in a rhythm, swing when they are ready and make one round of golf even faster and more competitive than ever before possible. [Electronic Arts]… Expand"}, {"name": "Act of War: Direct Action", "details_link": "https://www.metacritic.com/game/pc/act-of-war-direct-action", "publisher": "Atari", "release_date": "Mar 15 2005", "developers": ["Eugen Systems"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/6d02a1292d241ed0cf1023673d8a9420-98.jpg", "descriptions": "Act of War: Direct Action tells a highly realistic, near-future story of a US elite force fighting an international plot to overthrow the current world order. While offering a \"First Look at Tomorrow's War\", the game takes you through a frightening and believable reality filled withAct of War: Direct Action tells a highly realistic, near-future story of a US elite force fighting an international plot to overthrow the current world order. While offering a \"First Look at Tomorrow's War\", the game takes you through a frightening and believable reality filled with suspense, international intrigue and geopolitical military conflict, wrapped in a top-quality strategy gaming experience. Act of War: Direct Action offers players the opportunity to zoom in and engage in the battle from street level perspective on urban battlefields such as San Francisco, Washington DC, London and Moscow, with incredible detail and without slowing down any of the action. Act of War features a single-player story mode and various multiplayer modes including 8-player online skirmishes. [Atari]… Expand"}, {"name": "Madden NFL 18", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-18", "publisher": "Electronic Arts", "release_date": "Aug 22 2017", "developers": ["Electronic Arts"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 82, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/7/bedc15b58198866316de858b3e648716-98.jpg", "descriptions": "Madden NFL 18 takes a significant visual leap with the power of the Frostbite engine. See stunning new stadium exteriors surrounded by vast cityscapes and watch the spectacle of NFL gameday come to life in the most photorealistic game to date. Play each matchup to your specifications byMadden NFL 18 takes a significant visual leap with the power of the Frostbite engine. See stunning new stadium exteriors surrounded by vast cityscapes and watch the spectacle of NFL gameday come to life in the most photorealistic game to date. Play each matchup to your specifications by selecting from three new Play Styles or play the best real world match ups each week in Play Now Live! With the introduction of even more ways to play, coupled with your modes, Madden Ultimate Team and Franchise, this is Madden like you've never seen before.… Expand"}, {"name": "South Park: The Stick of Truth", "details_link": "https://www.metacritic.com/game/xbox-360/south-park-the-stick-of-truth", "publisher": "Ubisoft", "release_date": "Mar  4 2014", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/352f3b62d1028f9cd8325352cdc5430a-98.jpg", "descriptions": "South Park: The Game is an epic role-playing adventure that will allow the user to befriend Stan, Kyle, Cartman and Kenny and explore the quiet little mountain town like never before. \r\rFrom the perilous battlefields of the 4th-grade playground, a young hero will rise, destined to be SouthSouth Park: The Game is an epic role-playing adventure that will allow the user to befriend Stan, Kyle, Cartman and Kenny and explore the quiet little mountain town like never before. \r\rFrom the perilous battlefields of the 4th-grade playground, a young hero will rise, destined to be South Park’s savior. From the creators of South Park, Trey Parker and Matt Stone, comes an epic quest to become… cool. Introducing South Park: The Stick of Truth. For a thousand years, the battle has been waged. The sole reason humans and elves are locked in a never-ending war: The Stick of Truth. But the tides of war are soon to change as word of a new kid spreads throughout the land, his coming foretold by the stars. As the moving vans of prophecy drive away, your adventure begins. Arm yourself with weapons of legend to defeat crab-people, underpants gnomes, hippies, and other forces of evil. Discover the lost Stick of Truth and earn your place at the side of Stan, Kyle, Cartman, and Kenny as their new friend. Succeed, and you shall be South Park’s savior, cementing your social status in South Park Elementary. Fail, and you will forever be known… as a loser. [Ubisoft]… Expand"}, {"name": "Geometry Wars 3: Dimensions", "details_link": "https://www.metacritic.com/game/xbox-one/geometry-wars-3-dimensions", "publisher": "Sierra Games", "release_date": "Nov 26 2014", "developers": ["Lucid Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Shooter", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/f5d7e366485d97c3907fcb0a43f732c6-98.jpg", "descriptions": "Over fifty single player levels including Adventure and Classic Arcade modes. 3D grids and over ten battle modes including Pacifism, King and Claustrophobia. Four distinct companion drones such as Attack, Collector, Ram and Snipe. Co-op and Online Competitive Multiplayer modes."}, {"name": "SUPERHOT: MIND CONTROL DELETE", "details_link": "https://www.metacritic.com/game/xbox-one/superhot-mind-control-delete", "publisher": "SUPERHOT", "release_date": "Jul 16 2020", "developers": ["SUPERHOT"], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 82, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/37d856f080b73a9d69e8dffdc1982b54-98.jpg", "descriptions": "ONE OF US. ONE OF US. Still outnumbered, still outgunned. Enemies swirl around you in a storm of slow motion violence. Battle after battle, each fallen foe pushes you closer to the secrets hiding in the game and each secret gives you more powers to fight the System’s unending opposition."}, {"name": "Flat Heroes", "details_link": "https://www.metacritic.com/game/switch/flat-heroes", "publisher": "Parallel Circles", "release_date": "Aug  2 2018", "developers": ["Parallel Circles"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/5dd727ab4d7841afbab6865fdd9e80be-98.jpg", "descriptions": "Flat Heroes is a minimalistic, super intense action game starring squares for 1 to 4 players. It features a delightful control that allows players to move around the scenario in a super fluid way allowing them to beat all the challenging scenarios that its cooperative mode offers. \r\rTheFlat Heroes is a minimalistic, super intense action game starring squares for 1 to 4 players. It features a delightful control that allows players to move around the scenario in a super fluid way allowing them to beat all the challenging scenarios that its cooperative mode offers. \r\rThe game also features four completely different versus modes for players to compete against each other or against the AI, each mode highlighting a different set of skills. \r\rThe graphic style is based on the latest graphic design trend, keeping a simple but direct aesthetic and polishing all the animations and transitions to create an eye candy experience.… Expand"}, {"name": "Stealth Inc 2: A Game of Clones", "details_link": "https://www.metacritic.com/game/wii-u/stealth-inc-2-a-game-of-clones", "publisher": "Curve Digital", "release_date": "Oct 30 2014", "developers": ["Curve Digital"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One", "Wii U"], "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/1e216e0b4e335fb0722a633f4d9bd95d-98.jpg", "descriptions": "Assume the role of a clone evading a notorious scientific testing facility. Stealth Inc 2 tests your mind and your reflexes over sixty levels linked together in a sprawling world."}, {"name": "Horizon Chase Turbo", "details_link": "https://www.metacritic.com/game/switch/horizon-chase-turbo", "publisher": "Aquiris Game Studio", "release_date": "Nov 28 2018", "developers": ["Aquiris Game Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/bd550eb6bfeeac11c45979815bfb9238-98.jpg", "descriptions": "Horizon Chase Turbo is a racing game inspired by the great hits of the 80's and 90's: Out Run, Top Gear, Rush and others. Race your way through the opponents and master the circuits as you relive the classic arcade gameplay with unbound speed limits of fun."}, {"name": "RiME", "details_link": "https://www.metacritic.com/game/xbox-one/rime", "publisher": "Tequila Works", "release_date": "May 26 2017", "developers": ["Tequila Works"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/fe2586030d711b47917bc90ee3929c6b-98.jpg", "descriptions": "The story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse.\r An end, and a new beginning.\r\n\r\nA strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is keyThe story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse.\r An end, and a new beginning.\r A strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is key to solving a series of ancient puzzles, you'll use an enigmatic artefact to manipulate your environment and even time itself.\r Thanks to the innovative control offered by the DUALSHOCK 4 controller, you'll find that light, sound and touch are all essential in your bid to escape the island.… Expand"}, {"name": "Tekken 7", "details_link": "https://www.metacritic.com/game/pc/tekken-7", "publisher": "Bandai Namco Games", "release_date": "Jun  1 2017", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "3D"], "meta_score": 82, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/29eee440d5c8384a8f9f2100520cca06-98.jpg", "descriptions": "Love, Revenge, Pride. Each one of us has a reason to fight. Values are what define us and make us human, regardless of our strengths or weaknesses. There are no wrong motives, just the paths we choose to take. Experience the conclusion of the Mishima clan and unravel the reasons behind eachLove, Revenge, Pride. Each one of us has a reason to fight. Values are what define us and make us human, regardless of our strengths or weaknesses. There are no wrong motives, just the paths we choose to take. Experience the conclusion of the Mishima clan and unravel the reasons behind each step of their ceaseless fight. Powered by Unreal Engine 4, Tekken 7 features story-driven cinematic battles and intense duels that can be enjoyed with friends and rivals alike through innovative fight mechanics.… Expand"}, {"name": "Runbow", "details_link": "https://www.metacritic.com/game/wii-u/runbow", "publisher": "13AM Games", "release_date": "Aug 27 2015", "developers": ["13AM Games"], "platforms": ["3DS", "PC", "PlayStation 4", "Switch", "Xbox One", "Wii U"], "num_players": "Up to 9 ", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/2f297e0683a4cac207ab6a43513573a6-98.jpg", "descriptions": "Runbow is a fast-paced action party game with a novel color mechanic: Up-to nine players race against each other as platforms and obstacles appear and disappear when the background changes vibrant colors."}, {"name": "Madden NFL 17", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-17", "publisher": "EA Sports", "release_date": "Aug 23 2016", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 82, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/8/0802534bfadd73220b99a998851e63a8-98.jpg", "descriptions": "Madden NFL 17 Franchise = Take your team all the way and put yourself at the center of your team’s Championship run in Franchise mode, delivering new ways to play and more decisions to make. Added features include the practice squad, full-player editing, and the in-game ticker that keeps youMadden NFL 17 Franchise = Take your team all the way and put yourself at the center of your team’s Championship run in Franchise mode, delivering new ways to play and more decisions to make. Added features include the practice squad, full-player editing, and the in-game ticker that keeps you updated with scores from around the league. Know your opponents’ tendencies every week, then pick the right drills to attack and counter those tendencies in game. This new level of strategy promises to deliver more variety and more fun when preparing for your next opponent, whether it’s a user or a computer simulated player. [Electronic Arts]… Expand"}, {"name": "Espgaluda II -Be Ascension. The Third Bright Stone of Birth-", "details_link": "https://www.metacritic.com/game/switch/espgaluda-ii--be-ascension-the-third-bright-stone-of-birth-", "publisher": "Live Wire", "release_date": "Sep  9 2021", "developers": ["Cave"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/698978649c18b308449ba48b4623966a-98.jpg", "descriptions": "Galuda is a biological weapon that connects the Holy Spirit and humans through alchemy and mechanical engineering.\r The \"Shinra\" military nation, which gained power from Galuda, was destroyed by the two Galuda \"Ageha\" and \"Tateha\" they created.\r\n\r\nThree years have passed since that war.Galuda is a biological weapon that connects the Holy Spirit and humans through alchemy and mechanical engineering.\r The \"Shinra\" military nation, which gained power from Galuda, was destroyed by the two Galuda \"Ageha\" and \"Tateha\" they created.\r Three years have passed since that war.\r After an experiment involving contraindications, \"Soma\" artificially acquired Galuda's abilities.\rAnd the only Galuda to be born, \"Asagi\" who was the assassin of King Soma.\r \"Tsubame\" and \"Janome\" who are also artificial Galuda and prince and princess of the Soma country chasing Asagi.\r Then Ageha and Tateha go to Asagi's rescue to stop the tragedy.\r The battle with the real Galuda and the Galuda built is about to begin. … Expand"}, {"name": "Ghosts 'n Goblins Resurrection", "details_link": "https://www.metacritic.com/game/xbox-one/ghosts-n-goblins-resurrection", "publisher": "Capcom", "release_date": "Jun  1 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/f58c4196d74d4b3772fd9f1aa0c12739-98.jpg", "descriptions": "GHOSTS 'N GOBLINS IS BACK FROM THE GRAVE!Watch as this nostalgic yet completely reimagined storybook world unravels before your very eyes.\n\nTaking cues from both Ghosts 'n Goblins and Ghouls 'n Ghosts and giving birth to something entirely new, Resurrection is a title worthy of its name.GHOSTS 'N GOBLINS IS BACK FROM THE GRAVE!Watch as this nostalgic yet completely reimagined storybook world unravels before your very eyes.Taking cues from both Ghosts 'n Goblins and Ghouls 'n Ghosts and giving birth to something entirely new, Resurrection is a title worthy of its name.Don't be fooledthis picturesque storybook world, while gorgeous, is a love-letter to the original titles and maintains the same punishing gameplay that fans have come to expect. So go on and test your mettle, for the gauntlet has been thrown!StoryA long time ago...In a far off land our tale begins, its beauty matched by none.The knight, Arthur, and the princess there, bathed in midday sun....but suddenly something's amiss, the town is up in flames,a cloud of darkness does emerge, the palace it does claim.The shadow then extends its reach, to the Umbral Tree divine.Its color fades, its vigor drained by powers most malign.And with this chaos wrought, the Demon Lord plays his vile hand.While Arthur's back is turned, the princess he kidnaps as planned.In haste does Arthur don his armor, to save his maiden fair.To the Demon Realm he does depart, so demons best beware.GameplayJust like its predecessors, Ghosts 'n Goblins Resurrection makes use of simple controls that anyone can enjoy. Use them to your advantage as you fight your way through weird and spooky stages filled with unique enemies in this enchanting world brought to life with modern technology and game design philosophy!Ghosts 'n Goblins is, well, hard. Its unyielding difficulty has been a defining characteristic of the series, and Resurrection pays respect to that legacy. You'll die, and you'll die again, but you'll dust yourself off and get better with every attempt as you learn more about your foes and further craft your strategy. You'll struggle, but you'll also bask in glory once you do eventually emerge victorious. That is Ghosts 'n Goblins.In Resurrection, Arthur can obtain 8 types of weapons, each with its own unique characteristics. Fell your foes with old favorites such as the Lance and the Dagger, shoot shockwaves with the Hammer to launch enemies, or send a Spiked Ball crashing along the ground to bowl them over instead! Use theseand moreto your advantage as you form your plan to progress through the Demon Realm!In addition to his large arsenal of weapons, Arthur can also learn a magnitude of magic and skills. Use Thunderstorm to unleash a hailstorm of bolts in four directions, or learn Kitted Out to increase Arthur's inventory space and carry more weapons. With tons more available, be sure to make room for magic and skills in your strategy!Make full use of Arthur's weapons, magic, and skills as you brave the ordeals of the Demon Realm to bring the princess home safely. Muster every ounce of grit you possess; you're going to need it!… Expand"}, {"name": "Mortal Kombat 11", "details_link": "https://www.metacritic.com/game/pc/mortal-kombat-11", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 23 2019", "developers": ["NetherRealm Studios"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 82, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/4/bc9b13ad158666d3bfb9215fcb7ac658-98.jpg", "descriptions": "Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment,Mortal Kombat is back and better than ever in the next evolution of the iconic franchise. The all new Custom Character Variations give you unprecedented control to customize the fighters and make them your own. The new graphics engine showcasing every skull-shattering, eye-popping moment, brings you so close to the fight you can feel it. And featuring a roster of new and returning Klassic Fighters, Mortal Kombat's best in class cinematic story mode continues the epic saga over 25 years in the making.… Expand"}, {"name": "Sokobond", "details_link": "https://www.metacritic.com/game/pc/sokobond", "publisher": "Alan Hazelden & Harry Lee", "release_date": "Aug 27 2013", "developers": ["Alan Hazelden & Harry Lee"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/df2b3929795a7b0f2ace20ff1f6dbbcd-98.jpg", "descriptions": "Sokobond sets players in oddly shaped rooms, where they must move a single atom, designated by a dashed outline, to form a molecule. Elements have been strategically placed throughout the area, and every atom must be bonded to the player’s own to successfully solve the puzzle."}, {"name": "Quell Memento", "details_link": "https://www.metacritic.com/game/playstation-vita/quell-memento", "publisher": "Fallen Tree Games", "release_date": "Jun  4 2013", "developers": ["Fallen Tree Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "Switch", "PlayStation Vita"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/3616b2a04dff58f98788bd6c25a8d258-98.jpg", "descriptions": "Forget the world. Fall in love with this enchanting zen puzzler.Set within an old abandoned house, the player restores order to the jumbled memories of the last occupant, and in doing so embarks on a haunting journey of self-discovery and reflection.* Over 150 cunningly crafted puzzles!*Forget the world. Fall in love with this enchanting zen puzzler.Set within an old abandoned house, the player restores order to the jumbled memories of the last occupant, and in doing so embarks on a haunting journey of self-discovery and reflection.* Over 150 cunningly crafted puzzles!* Perfectly balanced difficulty curve!* HD and Retina support hand-painted art!* Universal app with iCloud integration* GameCenter Achievements and Leaderboards* New soundtrack by composer Steven CravisSuitable for all ages, this is an experience that will stay with you long after you put it down.-------------------------------CURIOUS? More info on: bulkypix.comfacebook.com/Bulkypixtwitter.com/Bulkypixyoutube.com/Bulkypix… Expand"}, {"name": "MotoHeroz", "details_link": "https://www.metacritic.com/game/wii/motoheroz", "publisher": "RedLynx", "release_date": "Sep 15 2011", "developers": ["RedLynx"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/0458f87c6f1b5db00c1ee653cc58fd77-98.jpg", "descriptions": "MotoHeroz is a side-scrolling platform racer game for WiiWare."}, {"name": "Mario vs. Donkey Kong: Minis March Again!", "details_link": "https://www.metacritic.com/game/ds/mario-vs-donkey-kong-minis-march-again!", "publisher": "Nintendo", "release_date": "Jun  8 2009", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/8e619400b751c86ba50fc633b0fe654e-98.jpg", "descriptions": "[DSiWare]  Thanks to the runaway success of Super Mini Mario World, Mario and Pauline have expanded their toy-filled theme park and invited everyone to the opening celebration – everyone, that is, except Donkey Kong, who was too late to get in. Donkey Kong decides to crash the party and[DSiWare]  Thanks to the runaway success of Super Mini Mario World, Mario and Pauline have expanded their toy-filled theme park and invited everyone to the opening celebration – everyone, that is, except Donkey Kong, who was too late to get in. Donkey Kong decides to crash the party and kidnaps Pauline along the way. Can Mario and his Mini Marios rescue Pauline from Donkey Kong’s clutches yet again? Make sure to explore the Construction Zone, where you’ll find all the tools needed to make your own original levels. You can then share your masterpieces or download levels created by others, via a local wireless connection or with broadband Internet access and Nintendo Wi-Fi Connection. [Nintendo]… Expand"}, {"name": "A Plague Tale: Requiem", "details_link": "https://www.metacritic.com/game/pc/a-plague-tale-requiem", "publisher": "Focus Entertainment", "release_date": "Oct 17 2022", "developers": ["Asobo Studio"], "platforms": ["PlayStation 5", "Switch", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/1bc37243a54f8b7eb67e73c1691a21fd-98.jpg", "descriptions": "Embark on a heartrending journey into a brutal, breathtaking world twisted by supernatural forces.After escaping their devastated homeland, Amicia and Hugo travel far south, to new regions and vibrant cities. There, they attempt to start a new life and control Hugo's curse. But, whenEmbark on a heartrending journey into a brutal, breathtaking world twisted by supernatural forces.After escaping their devastated homeland, Amicia and Hugo travel far south, to new regions and vibrant cities. There, they attempt to start a new life and control Hugo's curse. But, when Hugo's powers reawaken, death and destruction return in a flood of devouring rats. Forced to flee once more, the siblings place their hopes in a prophesized island that may hold the key to saving Hugo.Discover the cost of saving those you love in a desperate struggle for survival. Strike from the shadows or unleash hell, overcoming foes and challenges with a variety of weapons, tools and unearthly powers.… Expand"}, {"name": "Zone of the Enders: The 2nd Runner", "details_link": "https://www.metacritic.com/game/playstation-2/zone-of-the-enders-the-2nd-runner", "publisher": "Konami", "release_date": "Mar 10 2003", "developers": ["KCEJ"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/964d0cb3b3e30d719b6de567e13aa5b3-98.jpg", "descriptions": "From \"Metal Gear Solid 2\" producer Hideo Kojima, comes the sequel to the anime inspired mech combat game \"Zone of the Enders.\" Take control of a lightning fast mechanized robot and fight an evil militaristic force with new weapons, maneuvers, and tactics. Conflicts and settings of ZOE2 takeFrom \"Metal Gear Solid 2\" producer Hideo Kojima, comes the sequel to the anime inspired mech combat game \"Zone of the Enders.\" Take control of a lightning fast mechanized robot and fight an evil militaristic force with new weapons, maneuvers, and tactics. Conflicts and settings of ZOE2 take place in cityscapes, enemy fortresses, and even in the depths of space! Features fast-paced fighting action with unbelievable cinematic visuals and a gripping epic storyline. Target and destroy hundreds of enemies on screen at the same time. All new sub weapons enhance strategic play during combat.  [Konami]… Expand"}, {"name": "CrossCode", "details_link": "https://www.metacritic.com/game/switch/crosscode", "publisher": "Radical Fish Games", "release_date": "Jul  9 2020", "developers": ["Radical Fish Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/bf695bb7dca577b0fdd7085a821c5f41-98.jpg", "descriptions": "This retro-inspired 2D Action RPG might outright surprise you. CrossCode combines 16-bit SNES-style graphics with butter-smooth physics, a fast-paced combat system, and engaging puzzle mechanics, served with a gripping sci-fi story.\r CrossCode is all about how it plays! Take the best outThis retro-inspired 2D Action RPG might outright surprise you. CrossCode combines 16-bit SNES-style graphics with butter-smooth physics, a fast-paced combat system, and engaging puzzle mechanics, served with a gripping sci-fi story.\r CrossCode is all about how it plays! Take the best out of two popular genres, find a good balance between them and make a great game. That’s what CrossCode does. You get the puzzles of Zelda-esque dungeons and are rewarded with the great variety of equipment you know and love from RPGs. During the fast-paced battles you will use the tools you find on your journey to reveal and exploit the enemies' weaknesses and at the same time will be able to choose equipment and skills for a more in-depth approach in fighting your enemies.… Expand"}, {"name": "F1 2016", "details_link": "https://www.metacritic.com/game/playstation-4/f1-2016", "publisher": "Codemasters", "release_date": "Aug 19 2016", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/51b8f60496b813009af1b10b2d660558-98.jpg", "descriptions": "Includes the full 2016 season calendar of 21 tracks, including the brand new Baku circuit in Azerbaijan, and the full roster of 22 drivers and 11 teams, including the new Haas F1 Team. F1 2016 immerses you in not only the on-track excitement of a FORMULA ONE career, including the inclusionIncludes the full 2016 season calendar of 21 tracks, including the brand new Baku circuit in Azerbaijan, and the full roster of 22 drivers and 11 teams, including the new Haas F1 Team. F1 2016 immerses you in not only the on-track excitement of a FORMULA ONE career, including the inclusion of the iconic Safety Car and also the Virtual Safety Car for the first time, but also uniquely offers the drama and vehicle development that goes on behind the scenes. Work with your agent, engineer and team to develop your car in the deepest ever career experience, spanning up to ten seasons. Forge your own path to glory, and rise to be the champion. … Expand"}, {"name": "Viva Pinata: Trouble in Paradise", "details_link": "https://www.metacritic.com/game/xbox-360/viva-pinata-trouble-in-paradise", "publisher": "Microsoft Game Studios", "release_date": "Sep  2 2008", "developers": ["Rare Ltd."], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/f572b55e93dbb52b5d989e4b28ac985d-98.jpg", "descriptions": "Now with full cooperative and online gameplay modes, the Viva Pinata franchise opens its doors even wider with a new game that provides hours of fun for gamers of all ages, fans of the animated series and animal lovers alike. Family members and friend now can share in the joy of creating aNow with full cooperative and online gameplay modes, the Viva Pinata franchise opens its doors even wider with a new game that provides hours of fun for gamers of all ages, fans of the animated series and animal lovers alike. Family members and friend now can share in the joy of creating a garden by simply plugging in an extra controller. The second player has access to all tools, actions and activities, but he or she also can collect magic by helping. Player two can spend magic by tinkering items, healing a sick pinata or filling a pinata candiosity meter. It's a new way to play. Trouble in Paradise also offers a vast level of customization within your main garden. Now, along with planting grass, trees and flowers, and digging ponds and lakes, players can place sand and snow in their garden to make exotic species of piñata feel more at home. Players also can choose to enhance their garden with themed object packs - make your garden into a space center, a pirate cove or a haunted graveyard. Buy objects to change the weather, or new toys for your piñata to play with. You have total freedom to create any kind of paradise you want! Thirty-two new species of pinata can run, crawl, fly and swim into your garden. Large, small, fierce and cute, the new pinatas will join all your favorites for thriving activity throughout your garden. Among these new species are sour piñatas that will infiltrate and wreak havoc in the garden. [Microsoft]… Expand"}, {"name": "Sam & Max Episode 105: Reality 2.0", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-105-reality-20", "publisher": "GameTap", "release_date": "Mar 29 2007", "developers": ["Telltale Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/39d4cd4cce0a07a64ade717127459f44-98.jpg", "descriptions": "With an internet crisis looming and a viral video game holding its players hostage, in this episode Sam and Max need to slip into a new reality to set things right. Can our heroes crack this virtual case in time to avoid a worldwide system failure? [Telltale Games]"}, {"name": "Destiny 2: Forsaken", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-2-forsaken", "publisher": "Activision", "release_date": "Sep  4 2018", "developers": ["Bungie Software", "Bungie"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 82, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/0d96ac0841c9f305e31dba62680d5943-98.jpg", "descriptions": "With 2 brand-new destinations to explore, and new weapons, armour and Supers to acquire, Forsaken takes players on an epic journey into the wild frontiers of our solar system where the lines between justice and revenge are blurred. Forsaken also features an all-new competitive andWith 2 brand-new destinations to explore, and new weapons, armour and Supers to acquire, Forsaken takes players on an epic journey into the wild frontiers of our solar system where the lines between justice and revenge are blurred. Forsaken also features an all-new competitive and collaborative endgame activity, called Gambit. A first-of-its kind for Destiny, Gambit is a new, hybrid 4v4 mode that merges both PvE and PvP experiences into an epic battle. This entirely new way to play Destiny 2 offers something for all types of gamers to enjoy, appealing to those who thrive on the competitive challenge of PvP gameplay, while seamlessly blending the collaborative and unpredictable elements of PvE. [Bungie] … Expand"}, {"name": "2010 FIFA World Cup South Africa", "details_link": "https://www.metacritic.com/game/playstation-3/2010-fifa-world-cup-south-africa", "publisher": "EA Sports", "release_date": "Apr 27 2010", "developers": ["EA Canada"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/085237a42a33f464f277cc220ff6c87e-98.jpg", "descriptions": "EA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from eachEA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from each qualifying region. Gamers can play as their home nation from qualification right through to a virtual reproduction of the FIFA World Cup Final and feel what it is like to score the goal that lifts a nation.  Everything fans love about the World Cup comes to life in spectacular  detail, including confetti rain, streamers, & fireworks - just like the official tournament. [Electronic Arts]… Expand"}, {"name": "Ruiner", "details_link": "https://www.metacritic.com/game/switch/ruiner", "publisher": "Devolver Digital", "release_date": "Jun 18 2020", "developers": ["Reikon Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/c4c399142ae9ff690bd80a180e5060de-98.jpg", "descriptions": "In the year 2091 pervasive advancements in technology and computerization haven't changed human nature. Playing with people's lives has never been more fun."}, {"name": "One Step From Eden", "details_link": "https://www.metacritic.com/game/pc/one-step-from-eden", "publisher": "Thomas Moon Kang", "release_date": "Mar 26 2020", "developers": ["Thomas Moon Kang"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/9c1fdc2e404d8aa684c5ef7137d1e7a8-98.jpg", "descriptions": "Build a powerful deck, cast spells on the fly, battle evolving enemies, find game-changing artifacts, make friends or make enemies, just make it to Eden."}, {"name": "Blazing Chrome", "details_link": "https://www.metacritic.com/game/xbox-one/blazing-chrome", "publisher": "The Arcade Crew", "release_date": "Jul 11 2019", "developers": ["JoyMasher", "Seaven Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/e353bd57991caf9a8876550cde9c8f86-98.jpg", "descriptions": "In Blazing Chrome, bring your best pal and kick some metal butts to free the humankind while enjoying a classic run’n’gun, fully loaded with action and exciting fights."}, {"name": "Operencia: The Stolen Sun", "details_link": "https://www.metacritic.com/game/xbox-one/operencia-the-stolen-sun", "publisher": "Zen Studios", "release_date": "Mar 29 2019", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/62a62c50bd7d1910569a16a65a04908a-98.jpg", "descriptions": "Zen Studios’ modern homage to classic first-person dungeon-crawlers takes you to the land of Operencia, an unconventional fantasy world inspired by a faraway land referenced in countless Central European folktales."}, {"name": "NHL 19", "details_link": "https://www.metacritic.com/game/xbox-one/nhl-19", "publisher": "Electronic Arts", "release_date": "Sep 11 2018", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Ice Hockey", "Sim"], "meta_score": 82, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/07e3088b2b53e9ceb3d7ec0fa773e2eb-98.jpg", "descriptions": "Play on outdoor rinks and journey from the ponds to the pros in new game modes. Compete with and against 200 of the greatest hockey legends to ever hit the ice, highlighted by Wayne Gretzky. Powered by cutting-edge new gameplay technology, experience explosive-edge skating that delivers morePlay on outdoor rinks and journey from the ponds to the pros in new game modes. Compete with and against 200 of the greatest hockey legends to ever hit the ice, highlighted by Wayne Gretzky. Powered by cutting-edge new gameplay technology, experience explosive-edge skating that delivers more acceleration, speed and responsiveness.… Expand"}, {"name": "Tales of Arise", "details_link": "https://www.metacritic.com/game/playstation-4/tales-of-arise", "publisher": "Bandai Namco Games", "release_date": "Sep 10 2021", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/61145bd569b65e23d8e78e4816c4d65a-98.jpg", "descriptions": "Challenge the Fate That Binds YouOn the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled overChallenge the Fate That Binds YouOn the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled over Dahna, pillaging the planet of its resources and stripping people of their dignity and freedom.Our tale begins with two people, born on different worlds, each looking to change their fate and create a new future. Featuring a new cast of characters, updated combat, and classic Tales of gameplay mechanics, experience the next chapter in the world-famous Tale of series, Tales of Arise.The Next ChapterExperience the next chapter in the Tales of series, brought to life in stunning HD powered by Unreal Engine 4Dynamic ActionDynamic Action RPG featuring an updated battle system that retains classic Tales of gameplayA New Tale AwaitsRich story featuring a vibrant world and new cast of charactersStunning VisualsHigh quality animation created by Ufotable… Expand"}, {"name": "Lovers in a Dangerous Spacetime", "details_link": "https://www.metacritic.com/game/xbox-one/lovers-in-a-dangerous-spacetime", "publisher": "Asteroid Base", "release_date": "Sep  9 2015", "developers": ["Asteroid Base"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Platformer", "2D", "Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/ea47261911be9d447cdf39bdceb672d6-98.jpg", "descriptions": "Lovers in a Dangerous Spacetime is a 2-player co-op micro-platformer set inside a neon spaceship locked in battle with hordes of space baddies. Players work together running back and forth between ship control rooms, manning turrets, lasers, shields and thrusters to rack up points and staveLovers in a Dangerous Spacetime is a 2-player co-op micro-platformer set inside a neon spaceship locked in battle with hordes of space baddies. Players work together running back and forth between ship control rooms, manning turrets, lasers, shields and thrusters to rack up points and stave off a vacuumy demise. In mish-mash terms you could describe it as Jumpman meets Asteroids meets Han saying \"Don't get cocky.\"… Expand"}]