[{"name": "Orangeblood", "details_link": "https://www.metacritic.com/game/pc/orangeblood", "publisher": "Active Gaming Media", "release_date": "Jan 13 2020", "developers": ["Grayfax Software"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 57, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/10f5bbb74ee6fc8e35c9ce268f1f5473-98.jpg", "descriptions": "Hey you! Do you like hardcore adventures where you take on the role of an even harder-core badass tasked with beating the crap out of a bunch of demons? Well, so do I, but sometimes it's fun to try out something a little different, you know?These four cute Asian girls couldn't care lessHey you! Do you like hardcore adventures where you take on the role of an even harder-core badass tasked with beating the crap out of a bunch of demons? Well, so do I, but sometimes it's fun to try out something a little different, you know?These four cute Asian girls couldn't care less about little photo stickers... They'd rather play with some 7.62x39mm rifles and filthy, filthy cash!Use simple controls to take down evil gang members and killer robots!Load up a shotgun so powerful you'd burn yourself to toast if the gas leaked and some brand-new fireproof sneakers, find a group of psychotic yakuza thugs, and personally deliver a handwritten invitation to BEATDOWN TOWN!… Expand"}, {"name": "Men of War: Condemned Heroes", "details_link": "https://www.metacritic.com/game/pc/men-of-war-condemned-heroes", "publisher": "1C-Softclub", "release_date": "Apr 12 2012", "developers": ["1C-Softclub"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "General", "Tactics"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/48a66557a699ffd9da2ad7f27fa01f5f-98.jpg", "descriptions": "Take command of one of these notorious companies and lead it to victory against all odds through most of the war on the Eastern front. Fight from desperate battles in 1942 in the area of Volyn in the Ukraine, to the massive operation \"Bagration\" in the Brest area, MagnushTake command of one of these notorious companies and lead it to victory against all odds through most of the war on the Eastern front. Fight from desperate battles in 1942 in the area of Volyn in the Ukraine, to the massive operation \"Bagration\" in the Brest area, Magnush bridgehead and Warsaw area in Poland and finally to attacks on the German Altdam and Stettin near the end of the war.… Expand"}, {"name": "Chulip", "details_link": "https://www.metacritic.com/game/playstation-2/chulip", "publisher": "Natsume", "release_date": "Feb 14 2007", "developers": ["Punchline"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 57, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/5fadcd76b39c9d42fd1e88c03e862d3e-98.jpg", "descriptions": "You and your father have just moved into a rural town famous for an ancient legend. It's been said that whoever kisses underneath the old tree on the hill will be destined to live happily ever after. With your eyes set on a girl living in a nearby pipe...you set out on your quest. FilledYou and your father have just moved into a rural town famous for an ancient legend. It's been said that whoever kisses underneath the old tree on the hill will be destined to live happily ever after. With your eyes set on a girl living in a nearby pipe...you set out on your quest. Filled with a new determination, you've sworn to yourself that you'll do whatever it takes to kiss this charming little girl underneath the ancient tree and spend the rest of your life with her. To do this, you need to improve your reputation. Many in town are tired of their repetitive lives...they are always worried about something and have lost all of their hopes and dreams. It is up to you...to bring back life to this town and to move their hearts! You will have to solve a variety of puzzles to help characters open their hearts, moving every closer to your destiny. [Natsume]… Expand"}, {"name": "Pool of Radiance: Ruins of Myth Drannor", "details_link": "https://www.metacritic.com/game/pc/pool-of-radiance-ruins-of-myth-drannor", "publisher": "Ubisoft", "release_date": "Sep 28 2001", "developers": ["Stormfront Studios"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 57, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/6d5f1e2b127886903419af81ae509fdf-98.jpg", "descriptions": "This RPG features new character classes and races such as Barbarians, Monks, Paladins and Half-Orcs. Cast over 100 spells: both Sorcerer & Cleric, plus Orisons and Cantrips all straight from the Dungeons & Dragons New 3rd Edition rules. The Dungeon Master® communicates all important eventsThis RPG features new character classes and races such as Barbarians, Monks, Paladins and Half-Orcs. Cast over 100 spells: both Sorcerer & Cleric, plus Orisons and Cantrips all straight from the Dungeons & Dragons New 3rd Edition rules. The Dungeon Master® communicates all important events and findings. [Ubi Soft]… Expand"}, {"name": "Sniper: Ghost Warrior 3", "details_link": "https://www.metacritic.com/game/xbox-one/sniper-ghost-warrior-3", "publisher": "City Interactive", "release_date": "Apr 25 2017", "developers": ["City Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/8c638f3bbf57da802c181dd4f6b98635-98.jpg", "descriptions": "Go behind enemy lines with the ultimate modern military shooter. Choose your missions across an unforgiven open world.\r Stay low and leave no traces in this third game of the tactical shooter franchise. Set in a modern day conflict based in Eastern Europe, players in Sniper: Ghost WarriorGo behind enemy lines with the ultimate modern military shooter. Choose your missions across an unforgiven open world.\r Stay low and leave no traces in this third game of the tactical shooter franchise. Set in a modern day conflict based in Eastern Europe, players in Sniper: Ghost Warrior 3 will be thrust into the role of a sniper caught between three warring factions, played out in a realistic and immersive environment. Dig deep into the Ghost Warrior DNA as you choose between taking out your targets up close or from a distance, while at the same time focusing on your survival through evasion and stealth. Non-linear, sandbox-style gameplay on large open-ended maps gives players the flexibility to play and replay the missions in a number of different ways. Sniper: Ghost Warrior 3 will offer intriguing challenges for tactically-minded gamers, while still remaining accessible to first-person shooter fans.… Expand"}, {"name": "The Nightmare of Druaga", "details_link": "https://www.metacritic.com/game/playstation-2/the-nightmare-of-druaga", "publisher": "Namco", "release_date": "Oct 26 2004", "developers": ["Arika"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "General"], "meta_score": 57, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/5c5bed2c65d063d5e024a58ef13d3739-98.jpg", "descriptions": "A PS2 sequel to the classic NES dungeons game \"Tower of Druaga\" integrating elements from both the \"Tower of Druaga\" and \"Mysterious Dungeons\" series. The player must search for the keys to open exits to the dungeons. All the actions have a speed parameter, and winning difficult battlesA PS2 sequel to the classic NES dungeons game \"Tower of Druaga\" integrating elements from both the \"Tower of Druaga\" and \"Mysterious Dungeons\" series. The player must search for the keys to open exits to the dungeons. All the actions have a speed parameter, and winning difficult battles requires strategic planning. The player carries a creature within the dungeon walls, which lights up the surrounding area. The light diminishes with each step the player makes, but he can restore the light by obtaining recovery items inside the particular dungeon.… Expand"}, {"name": "Dragon Ball: Raging Blast", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-ball-raging-blast", "publisher": "Namco Bandai Games America", "release_date": "Nov 10 2009", "developers": ["Spike"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/4f018e0b48a9c87491a55f8b80856796-98.jpg", "descriptions": "Interactive and destructible environments bring a new layer of intensity to the battle stages featured in Dragon Ball: Raging Blast. Smash opponents into rocks to increase their damage count and gain the upper hand in battles. Featuring the series’ trademark combat style, the game hosts aInteractive and destructible environments bring a new layer of intensity to the battle stages featured in Dragon Ball: Raging Blast. Smash opponents into rocks to increase their damage count and gain the upper hand in battles. Featuring the series’ trademark combat style, the game hosts a variety of the most popular characters taken from the series, all of which have enhanced features such as facial expressions for a deeper level of immersion into the Dragon Ball universe. Dragon Ball: Raging Blast boasts superior graphics that enhance the sense of the characters’ speed and power. In addition to classic signature moves, characters also benefit from a new \"Super Rising\" move which allows more variety in the battle stages and lets players explore new areas of the Dragon Ball universe. [Namco Bandai Games]… Expand"}, {"name": "Aegis of Earth: Protonovus Assault", "details_link": "https://www.metacritic.com/game/playstation-4/aegis-of-earth-protonovus-assault", "publisher": "Aksys Games", "release_date": "Mar 15 2016", "developers": ["Acquire"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/dadbeb6afa29fc351eb239fa3a3b70fa-98.jpg", "descriptions": "A frenetic new spin on action strategy gaming. Dig in, plan out and build up your defenses as hordes of hulking monstrosities bombard your heavily fortified city in an attempt to wipe you off the Earth for good. Command the final bastion of humanity as you fight for the survival of theA frenetic new spin on action strategy gaming. Dig in, plan out and build up your defenses as hordes of hulking monstrosities bombard your heavily fortified city in an attempt to wipe you off the Earth for good. Command the final bastion of humanity as you fight for the survival of the species using fantastic tech, cunning tactics and massive weapons. [Aksys]… Expand"}, {"name": "Cyberpunk 2077", "details_link": "https://www.metacritic.com/game/playstation-4/cyberpunk-2077", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Dec 10 2020", "developers": ["CD Projekt Red Studio", "CD Projekt"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 57, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/591a7e8a0d6a01707e436d20ed1ed9b5-98.jpg", "descriptions": "Cyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. Assume the role of V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality. You can customize your character’sCyberpunk 2077 is an open-world, action-adventure story set in Night City, a megalopolis obsessed with power, glamour and body modification. Assume the role of V, a mercenary outlaw going after a one-of-a-kind implant that is the key to immortality. You can customize your character’s cyberware, skillset and playstyle, and explore a vast city where the choices you make shape the story and the world around you. Become a cyberpunk, an urban mercenary equipped with cybernetic enhancements and build your legend on the streets of Night City. Take the riskiest job of your life and go after a prototype implant that is the key to immortality.… Expand"}, {"name": "Ruff Trigger: The Vanocore Conspiracy", "details_link": "https://www.metacritic.com/game/playstation-2/ruff-trigger-the-vanocore-conspiracy", "publisher": "Natsume", "release_date": "Jun 28 2006", "developers": ["Playstos Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/2cc4d815da00dc3675461c2893459296-98.jpg", "descriptions": "The Vanocore Corporation is about to invade the Tyke System's marketplace with a new genetic engineering marvel: the Piglot, a tender little pet destined to replace dogs and cats in every home. But before the Piglots can reach their final destination, the Vanocore cargo ships are forced toThe Vanocore Corporation is about to invade the Tyke System's marketplace with a new genetic engineering marvel: the Piglot, a tender little pet destined to replace dogs and cats in every home. But before the Piglots can reach their final destination, the Vanocore cargo ships are forced to make an emergency landing on the hostile planet of Endust. Ruff Trigger, the top bounty hunter for the Boss PI Agency, has just been assigned the delicate task of rescuing the Piglots, as well as the large supply of VPD (Vanocore Power Drink) accompanying them. As Ruff searchers for the lost Piglots he will start to discover this is more than a simple rescue mission...he has stumbled onto a shocking conspiracy to take over the Tyke system. [Natsume]… Expand"}, {"name": "Pulse", "details_link": "https://www.metacritic.com/game/pc/pulse", "publisher": "Team Pixel Pi", "release_date": "Oct 20 2015", "developers": ["Team Pixel Pi", "Pixel Pi Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "General"], "meta_score": 57, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/08d45fe468aec5f1938019b6e3845410-98.jpg", "descriptions": "Pulse is a first person, suspense/survival game in which you play as a young blind girl named Eva. First person? Blind? What's the catch? Eva uses a process similar to echolocation to \"see\" her environment. Sounds in the world allow her to imagine what the area looks like, and in turn allowsPulse is a first person, suspense/survival game in which you play as a young blind girl named Eva. First person? Blind? What's the catch? Eva uses a process similar to echolocation to \"see\" her environment. Sounds in the world allow her to imagine what the area looks like, and in turn allows the player to navigate. With the aid of cute, fuzzy, although stupid creatures called Mokos, Eva must create enough sound to solve the challenges of the world, while being careful not to alert the more dangerous forest creatures.… Expand"}, {"name": "RWBY: Grimm Eclipse", "details_link": "https://www.metacritic.com/game/xbox-one/rwby-grimm-eclipse", "publisher": "Rooster Teeth Games", "release_date": "Jan 17 2017", "developers": ["Rooster Teeth Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 57, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/f5806f7658f9902490a033fa0a7c6a6d-98.jpg", "descriptions": "Get ready for intense combat action as you battle Grimm across familiar locations of Remnant including new areas never before seen in the show. Play as Ruby, Weiss, Blake, and Yang in this character-driven adventure that explores new storylines, new Grimm types, and a new villain!\r TheGet ready for intense combat action as you battle Grimm across familiar locations of Remnant including new areas never before seen in the show. Play as Ruby, Weiss, Blake, and Yang in this character-driven adventure that explores new storylines, new Grimm types, and a new villain!\r The gameplay takes inspiration from Dynasty Warriors and Left 4 Dead offering over-the-top combat along with engaging missions and storytelling.… Expand"}, {"name": "Soul Axiom", "details_link": "https://www.metacritic.com/game/pc/soul-axiom", "publisher": "Wales Interactive", "release_date": "Feb 29 2016", "developers": ["Wales Interactive"], "platforms": ["PlayStation 4", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Adventure", "3D", "First-Person"], "meta_score": 57, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/abd827852486d34a86a5e3c140132c8d-98.jpg", "descriptions": "From the studio that brought you Master Reboot comes a first-person story-driven adventure puzzle game, set in the beautiful, haunting cyber-world of Elysia. Collect unique hand powers, discover multiple endings and choose your own destiny as you unravel the mystery of your digital afterlife."}, {"name": "Spider-Man: Edge of Time", "details_link": "https://www.metacritic.com/game/xbox-360/spider-man-edge-of-time", "publisher": "Activision", "release_date": "Oct  4 2011", "developers": ["Beenox"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "Beat-'Em-Up", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/be89cd763d0e731cebd4d3bb4fa275d4-98.jpg", "descriptions": "Developed by Activision-owned studio Beenox, Spider-Man: Edge of Time challenges the player to take on the roles of both classic Amazing Spider-Man and Spider-Man 2099 to correct a timestream gone awry and prevent a catastrophic future brought on by the early and untimely death of Peter Parker."}, {"name": "DRIV3R", "details_link": "https://www.metacritic.com/game/playstation-2/driv3r", "publisher": "Atari", "release_date": "Jun 21 2004", "developers": ["Reflections Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 57, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/28aedfea1fda75a4a31ab1be54ac6e31-98.jpg", "descriptions": "DRIV3R is an action-packed driving adventure game that recreates the excitement of a Hollywood blockbuster and plays like an interactive movie. DRIV3R stays true to its roots, incorporating the cinematic gameplay and gritty street crime of its predecessors with ground breaking graphics andDRIV3R is an action-packed driving adventure game that recreates the excitement of a Hollywood blockbuster and plays like an interactive movie. DRIV3R stays true to its roots, incorporating the cinematic gameplay and gritty street crime of its predecessors with ground breaking graphics and three mammoth wide open city environments. Featuring Hollywood-level production values and a gripping, narrative story line, DRIV3R casts players once again as Tanner, a jaw breaking, no-holds-barred undercover cop and master \"Wheelman\" who does whatever it takes to bring the bad guys down. Tanner, alongside his longtime partner, Tobias, must infiltrate a global car theft ring in tire squealing chases and fierce on-foot firefights while tailing gangsters, chasing witnesses, stealing cars and unloading massive clips of ammo to bring the criminals to justice.… Expand"}, {"name": "Dungeons & Dragons: Dark Alliance", "details_link": "https://www.metacritic.com/game/playstation-5/dungeons-dragons-dark-alliance", "publisher": "Wizards of the Coast", "release_date": "Jun 22 2021", "developers": ["Tuque Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 5 ", "genres": ["Role-Playing", "General"], "meta_score": 57, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/5/8837cac80066b6e1f65b81f89d6ac8c3-98.jpg", "descriptions": "Band together with friends, near or far, and fight against vicious monsters in the new co-op action RPG from Dungeons & Dragons."}, {"name": "Uncanny Valley", "details_link": "https://www.metacritic.com/game/xbox-one/uncanny-valley", "publisher": "Digerati Distribution", "release_date": "Feb 10 2017", "developers": ["Digerati Distribution", "Smartphone Labs (SPL)"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 57, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/1/33ce3948d6a445e7acfbf870d03892dd-98.jpg", "descriptions": "Uncanny Valley is a survival horror game that includes a mix of exploration, puzzle solving and a bit of action with a lot of optional story content. The game attempts to preserve the old survival horror kind of gameplay instead of following the modern trend of creating a third personUncanny Valley is a survival horror game that includes a mix of exploration, puzzle solving and a bit of action with a lot of optional story content. The game attempts to preserve the old survival horror kind of gameplay instead of following the modern trend of creating a third person shooter with horror elements.… Expand"}, {"name": "Catlateral Damage", "details_link": "https://www.metacritic.com/game/playstation-4/catlateral-damage", "publisher": "Fire Hose Games", "release_date": "Mar 22 2016", "developers": ["Manekoware"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 57, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/09409c595d590777b646ea829c1c4e8e-98.jpg", "descriptions": "Catlateral Damage is a first-person destructive cat simulator where you play as a cat on a rampage, knocking as much stuff onto the ground as possible."}, {"name": "The Great Escape", "details_link": "https://www.metacritic.com/game/playstation-2/the-great-escape", "publisher": "Gotham Games", "release_date": "Jul 23 2003", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 57, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/c51131ef2bc87d8abed81ad34513d3b7-98.jpg", "descriptions": "The Nazis have constructed the highest-security prisoner of war camp in history. As the Allies' top escape artist you must command your squad of POWs to break through the walls and wreak havoc on the soft underbelly of the Reich. You will command four unique soldiers, each with their ownThe Nazis have constructed the highest-security prisoner of war camp in history. As the Allies' top escape artist you must command your squad of POWs to break through the walls and wreak havoc on the soft underbelly of the Reich. You will command four unique soldiers, each with their own skills, strengths, and stories through their capture, escape, and vengeance in the heart of the evil Nazi empire. Use advanced espionage skills in stealth missions, a wide variety of weapons in combat sorties, and a huge array of authentic vehicles in your fight for freedom. Superstar Steve McQueen is digitally resurrected for the fistfights, shootouts, and vehicular mayhem of this WWII classic. You are the new mastermind in this saga of indomitable spirit and daring heroism, can you pull off The Great Escape? [Gotham Games]… Expand"}, {"name": "Batman: Vengeance", "details_link": "https://www.metacritic.com/game/pc/batman-vengeance", "publisher": "Ubisoft", "release_date": "Oct  8 2002", "developers": ["Ubisoft"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 57, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/4a82f76893805fe15926f1a707eff238-98.jpg", "descriptions": "Become Batman with blistering martial arts combos, over 500 unique animated moves, and a multi-functional cape with its own A.I. Wield such goodies as Batarangs, Batgrapples, Flash Bombs, Remote Charges, Batcuffs, Nets, the Batlauncher, Batscope, and more. [Ubi Soft]"}, {"name": "EOE: Eve of Extinction", "details_link": "https://www.metacritic.com/game/playstation-2/eoe-eve-of-extinction", "publisher": "Eidos Interactive", "release_date": "Feb 26 2002", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 57, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/fd212541e5ffadd914761eba3a0cf4a9-98.jpg", "descriptions": "Wisdom Incorporated is a distinguished conglomerate known for its great advances in the genetics industry--gene therapy, genome-based drugs, cloning technology and genetic modification of food. JOSH CALLOWAY is an employee of Wisdom and the subject of extensive biochemical experimentation.Wisdom Incorporated is a distinguished conglomerate known for its great advances in the genetics industry--gene therapy, genome-based drugs, cloning technology and genetic modification of food. JOSH CALLOWAY is an employee of Wisdom and the subject of extensive biochemical experimentation. With superior strength and reflexes, he proves to be the perfect genetic fit for Wisdom's latest research. He hopes to use his enhanced physical attributes for the betterment of medical science. Once Josh discovers Wisdom's true destructive miliary intentions, he decides to escape Wisdom with his girlfriend, Eliel Evergrand, also a co-worker taking part in the development of Legacy. Their escape attempt ended in failure. Eliel's soul is then forced into core of the most powerful Legacy ever made: code-named E.O.E. [Eidos Interactive]… Expand"}, {"name": "Ready 2 Rumble Boxing: Round 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/ready-2-rumble-boxing-round-2", "publisher": "Midway", "release_date": "May 30 2001", "developers": ["Midway"], "platforms": "Game Boy Advance", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/b8c23dd2f4e52970f0e4c784e73f61a9-98.jpg", "descriptions": "Ready 2 Rumble Boxing Round 2 for the Game Boy Advance is a surprisingly good interpretation of its console counterpart."}, {"name": "NCAA GameBreaker 2001", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-gamebreaker-2001", "publisher": "SCEA", "release_date": "Dec 18 2000", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/5f3015dbb3c4efac9b7b1fa5d041a017-98.jpg", "descriptions": "This game is streamlined and built for speed. With its combination of award-winning gameplay and 2001 updates, NCAA GameBreaker is the best college football game available.\rThe first college football game on the PlayStation 2 computer entertainment system, NCAA GameBreaker 2001 uses theThis game is streamlined and built for speed. With its combination of award-winning gameplay and 2001 updates, NCAA GameBreaker is the best college football game available.\rThe first college football game on the PlayStation 2 computer entertainment system, NCAA GameBreaker 2001 uses the power of this new system to put together the most menacing offensive line ever to take the college field. With every one of the 115 Division I-A teams and stadiums, your gridiron alma mater should be well represented if they're blue chip material. Mr. Keith Jackson is calling the action all the way in one of the most realistic football audio presentations that includes over 30 college fight songs and trash talk from coaches. And speaking of realism, no game of college ball has come close to the incredible details on the field of this game--look closely at the high-resolution graphics, and you'll see mouthpieces, flexing pads, eye grease, and even mesh holes in the jerseys!… Expand"}, {"name": "Toy Story 2: Buzz Lightyear to the Rescue!", "details_link": "https://www.metacritic.com/game/dreamcast/toy-story-2-buzz-lightyear-to-the-rescue!", "publisher": "Activision", "release_date": "Jun 30 2000", "developers": ["Traveller's Tales"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/7c22123a6d9cbc643232e18e64819a25-98.jpg", "descriptions": "The Countdown to Adventure is On!\r As space hero Buzz Lightyear, you've got your hands full. Your best buddy, Woody, has been kidnapped by a greedy toy collector and it's going to be an all-out race against time to save him. It's all up to you...Buzz Lightyear to the rescue!"}, {"name": "Moscow to Berlin: Red Siege", "details_link": "https://www.metacritic.com/game/pc/moscow-to-berlin-red-siege", "publisher": "Cinemaware Marquee", "release_date": "Jun 14 2006", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a4db1c5d8423599760c92cccf8c82505-98.jpg", "descriptions": "Moscow to Berlin follows in the footsteps Desert Rats vs Afrika Korps, D-Day, and 1944: Battle of the Bulge, bringing World War II action to your fingertips. Players will jump in the seat of both German and Russian tanks as they try their strategic skills on the Eastern Front. Engage inMoscow to Berlin follows in the footsteps Desert Rats vs Afrika Korps, D-Day, and 1944: Battle of the Bulge, bringing World War II action to your fingertips. Players will jump in the seat of both German and Russian tanks as they try their strategic skills on the Eastern Front. Engage in actual historic battles on painstakingly recreated battlefields. There is no resource management, so it's all action with your troops and tanks battling new and deadly challenges on every campaign.… Expand"}, {"name": "Disney Epic Mickey 2: The Power of Two", "details_link": "https://www.metacritic.com/game/playstation-vita/disney-epic-mickey-2-the-power-of-two", "publisher": "Disney Interactive Studios", "release_date": "Jun 18 2013", "developers": ["Blitz Games", "Disney Interactive Studios"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360", "PlayStation Vita"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/1782ee06a880af3ed1cee6ce8d849cbb-98.jpg", "descriptions": "Disney Epic Mickey 2: The Power of Two returns Mickey Mouse and Oswald the Lucky Rabbit to Wasteland, an alternate world filled with 80 years of forgotten Disney characters and theme park attractions. But for the first time, Mickey and Oswald will join forces as true partners - Mickey withDisney Epic Mickey 2: The Power of Two returns Mickey Mouse and Oswald the Lucky Rabbit to Wasteland, an alternate world filled with 80 years of forgotten Disney characters and theme park attractions. But for the first time, Mickey and Oswald will join forces as true partners - Mickey with his magical paint brush that wields paint and thinner, and Oswald with his powerful remote control that allows him to command electricity. This new co-op play combined with enhanced in-game physics will further enhance the idea that \"PlayStyle Matters\" - a unique approach to gameplay pioneered by Warren Spector where players dynamically tackle different challenges in order to explore all possibilities and storylines, but with consequences for their chosen actions.… Expand"}, {"name": "Lila's Sky Ark", "details_link": "https://www.metacritic.com/game/switch/lilas-sky-ark", "publisher": "Graffiti Games Desenvolvimento de Jogos Ltda", "release_date": "Apr 21 2022", "developers": ["Monolith of Minds"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Action Adventure", "General"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/8a6d907b1aa0dd19fc15522e6d0a02b3-98.jpg", "descriptions": "Lila’s psychedelic world is in grave danger. Help her and her eccentric friends stop the Conductor’s minions from destroying all things musical and magical in this meditative action-adventure game. Explore this dark yet groovy world as you unravel the poetic mystery that is Lila’s story.Lila’s psychedelic world is in grave danger. Help her and her eccentric friends stop the Conductor’s minions from destroying all things musical and magical in this meditative action-adventure game. Explore this dark yet groovy world as you unravel the poetic mystery that is Lila’s story. Discover secrets, solve puzzles, and battle bizarre beasts and punishing bosses as you attempt to unite the Spirits and save the mysterious Sky Island from ruin. Along the way, hunt down alchemy recipes to unlock new weapons. Battle enemies with rocks, Titan Eyes, cluster bombs, and anything else you can throw at them as you wander this music-inspired pixel dreamscape during Lila’s strange yet beautiful journey.… Expand"}, {"name": "Back to Bed", "details_link": "https://www.metacritic.com/game/pc/back-to-bed", "publisher": "Bedtime Digital Games", "release_date": "Aug  6 2014", "developers": ["Bedtime Digital Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Puzzle", "Action", "General"], "meta_score": 57, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/007faf66cff2a601188cef0d008b37cc-98.jpg", "descriptions": "Bob the sleepwalker has a habit of always falling asleep in hazardous places. Luckily for Bob, his subconscious protector, Subob, is always ready to save him. Now the challenge for Subob is to guide Bob to safety, across rooftops, avoiding falls, and around dangerous creatures from theBob the sleepwalker has a habit of always falling asleep in hazardous places. Luckily for Bob, his subconscious protector, Subob, is always ready to save him. Now the challenge for Subob is to guide Bob to safety, across rooftops, avoiding falls, and around dangerous creatures from the nightmares of Bob.… Expand"}, {"name": "Tiny Troopers", "details_link": "https://www.metacritic.com/game/pc/tiny-troopers", "publisher": "Iceberg Interactive", "release_date": "Aug 24 2012", "developers": ["Iceberg Interactive", "Kukouri Mobile Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 57, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/0fab99c551c12aebecc92adbcd096190-98.jpg", "descriptions": "Tiny Troopers puts you in command of a team of small soldiers. Guide them through 30 deadly missions with varied objectives: destroy enemy armored formations, save hostages and eliminate enemy generals to name but just a few.\r Your troopers will face enemy infantry, snipers, technical'sTiny Troopers puts you in command of a team of small soldiers. Guide them through 30 deadly missions with varied objectives: destroy enemy armored formations, save hostages and eliminate enemy generals to name but just a few.\r Your troopers will face enemy infantry, snipers, technical's and even tanks. Casualty rate is going to be high but there's endless supply of fresh recruits to step up to fill the ranks. Those lucky troopers who survive from mission to mission will be promoted and each new stripe they gain makes them tougher. \r\rTo increase their chances of survival, use Command Points to give them better equipment, reinforce their team with a specialist like machine gunner, medic or delta force and call in support drops during missions. War might be hell but this is the funniest way to fight in one!… Expand"}, {"name": "Paradise (2006)", "details_link": "https://www.metacritic.com/game/pc/paradise-2006", "publisher": "Ubisoft", "release_date": "May  3 2006", "developers": ["White Birds Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 57, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/7894cf812cdabb7da68ef7e10ec91b33-98.jpg", "descriptions": "A \"point and click\" adventure for casual gamers, Paradise has everything gamers have come to expect from Sokal's creations - an amazing storyline, exquisite art direction and a realistic fantasy universe. Set in the heart of Africa, puzzles are combined with action gameplay, as a young womanA \"point and click\" adventure for casual gamers, Paradise has everything gamers have come to expect from Sokal's creations - an amazing storyline, exquisite art direction and a realistic fantasy universe. Set in the heart of Africa, puzzles are combined with action gameplay, as a young woman crosses the continent to take a leopard back to Kilimanjaro, the place of his birth, encountering fabulous, unknown animals in the wilderness on the way. [Ubisoft]… Expand"}, {"name": "Trials of the Blood Dragon", "details_link": "https://www.metacritic.com/game/xbox-one/trials-of-the-blood-dragon", "publisher": "Ubisoft", "release_date": "Jun 13 2016", "developers": ["RedLynx"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 57, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/2a1ad4c8adb5348f30627182402cee82-98.jpg", "descriptions": "The year is 2019. Roxanne and Slayter, the offspring of the legendary Rex Power Colt, are going to Vietnam War 4 to save freedom, and save the world."}, {"name": "Pac-Man World Rally", "details_link": "https://www.metacritic.com/game/gamecube/pac-man-world-rally", "publisher": "Namco Bandai Games America", "release_date": "Aug 22 2006", "developers": ["Smart Bomb Interactive"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 57, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/a6d98d09e082dafbefc2bb7c04cc117e-98.jpg", "descriptions": "Join Pack-Man, his friends and a host of Namco characters in the fastest, most exciting kart-racing game ever! Race against your friends, against the computer, or fight it out in Battle Mode with exciting new weapons and crazy Pac-Powers."}, {"name": "Guitar Hero: Van Halen", "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-van-halen", "publisher": "Activision", "release_date": "Dec 22 2009", "developers": ["Neversoft Entertainment", "Underground Development"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 57, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/31ed6b931ddfa3522c43befe1f2fb40e-98.jpg", "descriptions": "Guitar Hero returns with another band-focused title, Guitar Hero: Van Halen. The game features 25 classic Van Halen tracks, three signature Eddie Van Halen guitar solos, and 19 hand-picked guest acts. Play in eight original venues specifically designed for Guitar Hero: Van Halen. Rock aroundGuitar Hero returns with another band-focused title, Guitar Hero: Van Halen. The game features 25 classic Van Halen tracks, three signature Eddie Van Halen guitar solos, and 19 hand-picked guest acts. Play in eight original venues specifically designed for Guitar Hero: Van Halen. Rock around the globe, from a small club in Los Angeles to arenas around the world, including the iconic \"S-stage\" from the Rock and Roll Hall of Famer’s 2007 world tour. Play as one of the four members of Van Halen or create your own personalized superstar with Rock Star Creator and watch your superstar party on stage. Rock out with up to four players locally or battle other bands with up to 8 players. With tracks ranging from the high-energy \"Jump\" to the legendary guitar solo \"Eruption,\" the easy to play, difficult to master game play that Guitar Hero fans have grown to love is back in Guitar Hero: Van Halen. [Activision]… Expand"}, {"name": "The Ward", "details_link": "https://www.metacritic.com/game/pc/the-ward", "publisher": "On Deck Interactive", "release_date": "Jan 22 2001", "developers": ["Fragile Bits"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/11f6b1261669046b38e65d027192fe66-98.jpg", "descriptions": "The Ward has some good puzzles and some interesting points in its story, but these moments only punctuate a very bland game."}, {"name": "The Last Oricru", "details_link": "https://www.metacritic.com/game/playstation-5/the-last-oricru", "publisher": "Prime Matter", "release_date": "Oct 13 2022", "developers": ["GoldKnights Studio"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 57, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/779edac47f37e4a6cbddab42d1663e38-98.jpg", "descriptions": "The Last Oricru is a story-driven action RPG, that puts you in the middle of an ongoing conflict between two races, on a partly terraformed planet, isolated from outer space by a protective barrier. Your decisions will bring interesting twists into the gameplay, as you can heavily influenceThe Last Oricru is a story-driven action RPG, that puts you in the middle of an ongoing conflict between two races, on a partly terraformed planet, isolated from outer space by a protective barrier. Your decisions will bring interesting twists into the gameplay, as you can heavily influence the conflict and its outcome. You will experience hundreds of intense fights in a brutal medieval meets sci-fi world, where every decision has its consequences.\r Level up your hero, improve your skills before facing one of many boss fights and get ready for an unprecedented amount of possibilities.… Expand"}, {"name": "Jet Car Stunts", "details_link": "https://www.metacritic.com/game/pc/jet-car-stunts", "publisher": "bitComposer Games", "release_date": "May  1 2014", "developers": ["True Axis"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Racing", "General", "Arcade", "Automobile"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/8937d91547da43203c49d6b7dd99f2a4-98.jpg", "descriptions": "------ Apple: Best Games of 2009 ----- AppModo: \"truly one of the best iPhone games\" ----- PocketFullOfApps: \"An absolute must have game!\" ----------- Customer: \"and I thought doodle jump was addictive\" ----- Many Customers: \"Best\" and------ Apple: Best Games of 2009 ----- AppModo: \"truly one of the best iPhone games\" ----- PocketFullOfApps: \"An absolute must have game!\" ----------- Customer: \"and I thought doodle jump was addictive\" ----- Many Customers: \"Best\" and \"Ever\"Jet Car Stunts is an award winning, over the top, adrenaline rush, 3D driving game, with massive jumps, mid-air hoops, floating platforms, spiral roadways and outlandish maneuvers in impossible environments. The original levels, tight controls and fast, smooth, addictive game play has landed Jet Car Stunts on many \"Best of 2009\" lists.**** Profesional Reviews ****(5/5) AppSmile: \"one of the best iDevice games we've ever played\"(5/5) TouchGen: \"I've played hundreds of games on my iPhone, and I can honestly say that this is the most fun I've had, thus far!\"(10/10) PocketFullOfApps: \"An absolute must have game!\"(5/5) apphunter.net - \"The controls are easy to master and the visual effects are simply stunning\"(4.6/5) AppVee: \"I recommend it\"(8/10) PocketGamer.co.uk: \"amazingly fun\"(9/10) IGN - \"excellent controls, a great drift mechanic\" - \"an amazing iPhone racer that you should absolutely buy\"(5/5) TouchArcade: \"Jet Car Stunts has really set the bar high in both visual appeal and handling\"(4/4) SlideToPlay: \"a thrill ride\" (5/5) AppAdvice: \"this one is a tight gripping, brow sweating, stunt filled marathon that you’ll enjoy every minute of\" - \"Jet Car Stuns is one experience everyone idevice owner should have\"(5/5) touchreviews.net: \"enough content in Jet Car Stunts to keep you playing the game again and again\"(5/5) AppSafari: \"truly one of the best racing games I’ve ever played\"(4.6/5) AppSpy: \"poetry in motion\"(4.5/5) iphoneachievements.org: \"simply magnificent\"(9.99/10) IpwnAge: \"the BEST app I've ever reviewed\"TheAppera: \"It’s a great game, one of my personal favorites on iPhone\"AppModo: \"truly one of the best iPhone games\"**** Accolades ****Apple: Best Games of 2009TouchGen: Biggest Surprise 2009AppAdvice: #5 in Top 100 iPhone Games through 2009PocketGamer.co.uk: Top 10 best iPhone games of 2009TouchArcade: Best iPhone Games November 2009TouchArcade: Best iPod Touch and iPhone Games: 2009IGN.COM: Game of the Month: November 2009IGN.COM Editors Choice AwardIGN.COM: #8 in The Top 25 iPhone GamesBestAppEver Awards: 3rd Place award for Best Racing Game**** Features ****- The smoothest, fastest game play of any App Store driving game. Perfectly smooth on 1st Gen iPhones and iPods.- The tightest, most responsive, yet most forgiving accelerometer driving controls in existence.- Smash Physics.- 36 insane tracks. Each track offers something new.- NEW: 26 new downloadable tracks available with an 'in app purchase'. Even more insane driving then before.- NEW: 8 free downloadable tracks from Jet Car Stunts Lite.- Multiple play modes.- Jet assisted drift handling.- Half car, half jet with in-air control surfaces.- Online leaderboards, achievements, challenges and downloadable replays.**** 3 PLAY MODES ****- Platforming - The challenge is simple, just get to the end. Each track is more challenging then the last.- Time Trial - Race to reach the next check point before the time runs out. Beat your best time.- Ghost Racing - Race other people through challenges or by downloading replaysWith 25 challenging Platforming levels and 11 Time Trail levels, this is some of the best value you can find on the App Store.**** CONNECTIVITY ****Jet Car Stunts uses OpenFeint for online community, leaderboards with replays, achievements and challenges. So let's see who are the best players in the world, we dare you!… Expand"}, {"name": "Little Deviants", "details_link": "https://www.metacritic.com/game/playstation-vita/little-deviants", "publisher": "SCEA", "release_date": "Feb 15 2012", "developers": ["Bigbig Studios"], "platforms": "PlayStation Vita", "genres": ["Action", "Miscellaneous", "Platformer", "Platformer", "Party / Minigame", "3D", "3D"], "meta_score": 57, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/9e95506b5777f57215aac32b675e3fd4-98.jpg", "descriptions": "Little Deviants is a series of madcap adventures that will showcase the multitude of features and functions of the NGP,  including rear touch pad, touch screen, the motion sensor, front and rear cameras, augmented reality and microphone."}, {"name": "Wrecked: Revenge Revisited", "details_link": "https://www.metacritic.com/game/xbox-360/wrecked-revenge-revisited", "publisher": "505 Games", "release_date": "Mar 28 2012", "developers": ["Supersonic Software"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 57, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/037f4e9a8b080f42cdcefb26b0d6a887-98.jpg", "descriptions": "In WRECKED, players are required to drive aggressively with a chip on their shoulders, utilizing a variety of weapons and vehicle enhancements to take their opponents out of the race. However, vanquished foes are able to exact vengeance against those who knocked them out through fiveIn WRECKED, players are required to drive aggressively with a chip on their shoulders, utilizing a variety of weapons and vehicle enhancements to take their opponents out of the race. However, vanquished foes are able to exact vengeance against those who knocked them out through five different aerial strikes.… Expand"}, {"name": "Deep Labyrinth", "details_link": "https://www.metacritic.com/game/ds/deep-labyrinth", "publisher": "Atlus", "release_date": "Aug 15 2006", "developers": ["Interactive Brains"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/d9092ee749365f969983657cd0ea38c7-98.jpg", "descriptions": "Deep Labyrinth lets you explore a world populated by magical creatures and monstrous foes. Descend, if you dare, into the dark heart of the Labyrinth, in the first 3D first-person RPG for the Nintendo DS. Take advantage of the DS's dual screens and touch screen to explore dozens of dungeonDeep Labyrinth lets you explore a world populated by magical creatures and monstrous foes. Descend, if you dare, into the dark heart of the Labyrinth, in the first 3D first-person RPG for the Nintendo DS. Take advantage of the DS's dual screens and touch screen to explore dozens of dungeon levels, fighting hordes of hideous monsters in real-time with swords and spells. Two engrossing scenarios weave two amazing stories -- one for newcomers to role-playing games, and one for RPG veterans. [Atlus]… Expand"}, {"name": "Supremacy: Four Paths to Power", "details_link": "https://www.metacritic.com/game/pc/supremacy-four-paths-to-power", "publisher": "Matrix Games", "release_date": "Mar  9 2005", "developers": ["Black Hammer Game"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f018ecebb577df6085ebf3ac0c092f97-98.jpg", "descriptions": "Supremacy is a futuristic turn-based game of strategic combat developed by Black Hammer Game, one of New York's most promising new game companies. The player takes command of one of four alien races in an effort to lead their troops to complete universal domination, either battling against aSupremacy is a futuristic turn-based game of strategic combat developed by Black Hammer Game, one of New York's most promising new game companies. The player takes command of one of four alien races in an effort to lead their troops to complete universal domination, either battling against a finely-tuned adaptive AI or against other players over the Internet. Combat happens both in space, where over a dozen unique ships attack and defend with a number of special attacks and upgrades, and on the ground, where armies clash using gigantic mechs, flamethrowers, suicide bombers and more. [Matrix Games]… Expand"}, {"name": "Capcom Fighting Evolution", "details_link": "https://www.metacritic.com/game/playstation-2/capcom-fighting-evolution", "publisher": "Capcom", "release_date": "Nov 16 2004", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 57, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/a03e6443531e53343c6859cb5bf63ed4-98.jpg", "descriptions": "Capcom Fighting Evolution includes popular characters from five classic titles in the Street Fighter and other Capcom series: Street Fighter II, Darkstalkers, Street Fighter III, Red Earth and Street Fighter Alpha. Players must strategically use their combat systems to defeat theirCapcom Fighting Evolution includes popular characters from five classic titles in the Street Fighter and other Capcom series: Street Fighter II, Darkstalkers, Street Fighter III, Red Earth and Street Fighter Alpha. Players must strategically use their combat systems to defeat their opponentas they square off in battle. The character change system allows players to choose a combatant for each round of the battle. Choosing the right fighter based on the strengths of the fighting systems will be the key to victory! Two-on-two team battles - Choose a character for each round of battle; strategically pick the combatant based on the opponent?s powers and weaknesses. Classic 6 button control scheme. Title specific combat systems - Characters maintain their original fighting styles from their specific titles. [Capcom]… Expand"}, {"name": "Vietcong: Purple Haze", "details_link": "https://www.metacritic.com/game/xbox/vietcong-purple-haze", "publisher": "Gathering", "release_date": "Sep 15 2004", "developers": ["Coyote Developments"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "10  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 57, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/f622756ad289a0d065393293ed2aee45-98.jpg", "descriptions": "Vietcong: Purple Haze contains all missions and multiplayer modes from the original Vietcong and its expansion pack, Fist Alpha. Now you can penetrate deeper into the deadly jungles of Vietnam to fight Vietcong guerillas and the North Vietnamese Army as they work their ways into Cambodia. InVietcong: Purple Haze contains all missions and multiplayer modes from the original Vietcong and its expansion pack, Fist Alpha. Now you can penetrate deeper into the deadly jungles of Vietnam to fight Vietcong guerillas and the North Vietnamese Army as they work their ways into Cambodia. In addition to pushing back the VC charge, you must gather intelligence on secret weapons factories hidden deep below ancient temples, safely return downed US fighter pilots back to base, and avoid and disarm lethal booby traps. You can fight with all-new weapons, call in an air strike, and jump in a Huey to unload several thousand rounds behind a mounted M60.… Expand"}, {"name": "Animal Force", "details_link": "https://www.metacritic.com/game/playstation-4/animal-force", "publisher": "Oasis Games", "release_date": "Jul 10 2018", "developers": ["Sony Interactive Entertainment", "ISVR"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "General", "Defense"], "meta_score": 57, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/bc70dd3b187061f9df757dadc01cddca-98.jpg", "descriptions": "Assemble your squad of superpowered beasts to save the world from a deadly alien invasion. Unleash your claws, paws, horns and fangs across huge 3D planetary battlefields in totally immersive 360º virtual reality – deploying mighty critters to fight waves of other-worldly enemies before theyAssemble your squad of superpowered beasts to save the world from a deadly alien invasion. Unleash your claws, paws, horns and fangs across huge 3D planetary battlefields in totally immersive 360º virtual reality – deploying mighty critters to fight waves of other-worldly enemies before they kidnap defenceless humans.… Expand"}, {"name": "Mugen Souls Z", "details_link": "https://www.metacritic.com/game/playstation-3/mugen-souls-z", "publisher": "NIS America", "release_date": "May 20 2014", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General", "Japanese-Style"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/4ecb5b7342b91288259a9766a66fc8fc-98.jpg", "descriptions": "Undisputed God of the Universe Chou-Chou returns with her crew for a brand-new story revolving around the zodiac. Taking place immediately after the first game, you take control of the goddess Syrma, who meets Chou-Chou just after the end of the first game's events. Syrma is out to stop anUndisputed God of the Universe Chou-Chou returns with her crew for a brand-new story revolving around the zodiac. Taking place immediately after the first game, you take control of the goddess Syrma, who meets Chou-Chou just after the end of the first game's events. Syrma is out to stop an ancient threat to her world that has recently awakened.… Expand"}, {"name": "Iridium Runners", "details_link": "https://www.metacritic.com/game/playstation-2/iridium-runners", "publisher": "SouthPeak Games", "release_date": "Feb 20 2008", "developers": ["Playstos Entertainment"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/7089081d68ae4e5d2ff77c177e92aa2d-98.jpg", "descriptions": "Set in the future where cars have been made obsolete by the blazing speed humanity has achieved on foot, Iridium Runners is a no holds barred, furiously fast racing game that allows players to step on shrunken opponents and knock others over the edge of the track and into oblivion. With 20Set in the future where cars have been made obsolete by the blazing speed humanity has achieved on foot, Iridium Runners is a no holds barred, furiously fast racing game that allows players to step on shrunken opponents and knock others over the edge of the track and into oblivion. With 20 characters and 8 sidekick pods, each with differing strengths and weaknesses, knowing the track, your opponents and which combination to pick is essential to winning, Iridium Runners features several game modes, from a deep Championship to a single race, as well as split-screen multiplayer. A team mode is also featured, allowing for two paired teammates to race and battle one another on all the tracks. [SouthPeak Interactive]… Expand"}, {"name": "Lionheart: Legacy of the Crusader", "details_link": "https://www.metacritic.com/game/pc/lionheart-legacy-of-the-crusader", "publisher": "Interplay", "release_date": "Aug 13 2003", "developers": ["Reflexive Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 57, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/a608cfae45a7c591d8a6012ace4507ac-98.jpg", "descriptions": "It is 1588 A.D., a critical year of an alternate history hauntingly familiar yet fantastically alien to our own. Because of one fateful event during the Third Crusade, the history of this world diverged. This event, the Disjunction, ripped open a long-sealed breach to other worlds. MagicIt is 1588 A.D., a critical year of an alternate history hauntingly familiar yet fantastically alien to our own. Because of one fateful event during the Third Crusade, the history of this world diverged. This event, the Disjunction, ripped open a long-sealed breach to other worlds. Magic energy and powerful spirits flowed into the world, changing the lands and the people forever. Cast into this world, you are a character of your own devices, strengths, and abilities. Set upon by human factions and powerful spirits, you must decide how to best develop your skills in order to triumph over obstacles that lie between you and your true fate. Lionheart brings a combination of story, dialogue interaction, and combat to the PC offering complex character development in a world never before seen in a computer role-playing game. [Interplay]… Expand"}, {"name": "Harbinger", "details_link": "https://www.metacritic.com/game/pc/harbinger", "publisher": "DreamCatcher Interactive", "release_date": "Feb 26 2003", "developers": ["Silverback Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 57, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/a0b6dd9c55afa29f81370cd81c5e02b3-98.jpg", "descriptions": "Under the Overlord's ruthless control, Harbinger's shadow has fallen across countless worlds. Ravaged by endless conflict, the lumbering war machine carries her scars like trophies. Where lesser ships have fallen, Harbinger stands: a monument to her master's destructive appetites. But withinUnder the Overlord's ruthless control, Harbinger's shadow has fallen across countless worlds. Ravaged by endless conflict, the lumbering war machine carries her scars like trophies. Where lesser ships have fallen, Harbinger stands: a monument to her master's destructive appetites. But within her cold walls the old alliances are fracturing. Today, the Overlord's dominance is threatened from all corners. The corruptive Vantir, first and oldest aboard Harbinger, continue to spread like a rampant infection throughout the ship. The tribal Scintilla, placated for decades with false promises and half-truths, are once again rising to take the blood oaths of their ancestors. But it's the newcomers that pose the greatest threat here. The bug-like Cimicidae have arrived and with them a wave of change that threatens to rip this ship apart. That is where you come in. A member of a small raider community, these corridors are the only home you've known. You've been living on scraps with enemies on all sides. Death is always a misstep behind. Sometimes you do the Overlord's dirty work. Sometimes you do your own. We live by unspoken laws down here and the bloodhungry are never far behind. This is your destiny. The choices you make now will affect everything from here on. Choose wisely. [DreamCatcher]… Expand"}, {"name": "NCAA Final Four 2003", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-final-four-2003", "publisher": "SCEA", "release_date": "Nov 27 2002", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/d57b942acbc82773ca89e23171de7b97-98.jpg", "descriptions": "Features 70 new player models, each consisting of over 4,500 polygons. From muscle definition to wrinkles in the uniform, players are more lifelike than ever before as upgraded gameplay features allow the performance of over 30 new dunks including reverses, follow-ups and 360 degree jams. [SCEA]"}, {"name": "Arctic Thunder", "details_link": "https://www.metacritic.com/game/xbox/arctic-thunder", "publisher": "Midway", "release_date": "Nov 15 2001", "developers": ["Inland Productions"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 57, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/029abbab711c4ed6b3aea8b9a260e74c-98.jpg", "descriptions": "Are you ready for the ultimate battle on snow? You get proximity missiles, atomic snowballs, and snow bombs to use against your opponents as you battle your way to the finish line. If those don't do the trick, you've always got your fists for those up close and personal encounters. ChooseAre you ready for the ultimate battle on snow? You get proximity missiles, atomic snowballs, and snow bombs to use against your opponents as you battle your way to the finish line. If those don't do the trick, you've always got your fists for those up close and personal encounters. Choose one of 19 different characters and sleds, each one giving you different capabilities, and prepare to wage battle on one of 12 outlandish tracks, from the Swiss Alps to Atlantis. Master your snowmobile and perform any of 62 different tricks, or lure your friends into one of the special battle arenas for a duel.… Expand"}, {"name": "NHL FaceOff 2001", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-faceoff-2001", "publisher": "SCEA", "release_date": "Feb  5 2001", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 57, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/a46b374ae111efe4927f13471d0fc037-98.jpg", "descriptions": "Without a mouthpiece, you will lose a tooth!\rLace up your skates and get physical in NHL Face Off 2001. Choose from 30 different NHL teams, including the new Minnesota Wild and Columbus Blue Jackets, and battle for the Stanley Cup. Play as or against 13 retired NHL legends including Mr.Without a mouthpiece, you will lose a tooth!\rLace up your skates and get physical in NHL Face Off 2001. Choose from 30 different NHL teams, including the new Minnesota Wild and Columbus Blue Jackets, and battle for the Stanley Cup. Play as or against 13 retired NHL legends including Mr. Hockey Gordie Howe, Bobby Hull, Phil Esposito, Marcel Dionne and more. Four new play modes including Tournament, ShootOut, Practice and Draft combined with fast, fluid game play make FaceOff 2001 the hockey game for PlayStation2.… Expand"}, {"name": "Sonic Adventure DX Director's Cut", "details_link": "https://www.metacritic.com/game/gamecube/sonic-adventure-dx-directors-cut", "publisher": "Sega", "release_date": "Jun 18 2003", "developers": ["Sonic Team"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 57, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/b4b92a145dafc365d273a37eaf1b5d76-98.jpg", "descriptions": "Sonic makes a speedy return in Sonic Adventure DX, which features new missions and gameplay modes. This time, Sonic must enlist the help of his friends to foil the evil Dr. Robotnik's plan to destroy Station Square and replace it with Robotnickland. As one of six playable characters, eachSonic makes a speedy return in Sonic Adventure DX, which features new missions and gameplay modes. This time, Sonic must enlist the help of his friends to foil the evil Dr. Robotnik's plan to destroy Station Square and replace it with Robotnickland. As one of six playable characters, each with unique skills and abilities, you'll speed through 50 expansive levels, bonus rounds, bosses, and minigames. In your missions, you can collect objects, capture villains, and race a track to collect hidden items.… Expand"}, {"name": "DreamWorks Kung Fu Panda: Legendary Warriors", "details_link": "https://www.metacritic.com/game/wii/dreamworks-kung-fu-panda-legendary-warriors", "publisher": "Activision", "release_date": "Nov  5 2008", "developers": ["Artificial Mind and Movement"], "platforms": "Wii", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/abb66a6ce47116c53286fc210946966c-98.jpg", "descriptions": "Po, Monkey, Tigress and Shifu (Po and Tigress only on DS) return in an all-new action-packed journey to protect the Valley of Peace from Tai Lung and his minions. Utilizing motion and gesture-based controls gamers perform acrobatic jump attacks, wield weapons against foes and unleashPo, Monkey, Tigress and Shifu (Po and Tigress only on DS) return in an all-new action-packed journey to protect the Valley of Peace from Tai Lung and his minions. Utilizing motion and gesture-based controls gamers perform acrobatic jump attacks, wield weapons against foes and unleash powerful Chi Attacks by simulating customizable symbols featured on-screen. A second player can jump into the epic kung fu battle at any time to help chop, kick and punch their way to awesomeness in the co-op or multiplayer modes. [Activision]… Expand"}, {"name": "Dawn of Mana", "details_link": "https://www.metacritic.com/game/playstation-2/dawn-of-mana", "publisher": "Square Enix", "release_date": "May 24 2007", "developers": ["Square Enix"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/5ea66fa814b0efbf8da4cd461044b0fa-98.jpg", "descriptions": "Dawn of Mana, the first true Mana sequel in a decade, reveals the origins of the legend behind the Mana Tree and the Sword of Mana. Breaking the series' 2D mould, Dawn of Mana brings the world of Mana to three-dimensional life while preserving the atmosphere that fans have come to know andDawn of Mana, the first true Mana sequel in a decade, reveals the origins of the legend behind the Mana Tree and the Sword of Mana. Breaking the series' 2D mould, Dawn of Mana brings the world of Mana to three-dimensional life while preserving the atmosphere that fans have come to know and love. Players can see for themselves how vividly characters and monsters move about these new yet familiar surroundings. This instalment of the Mana is a true action-adventure, with sweeping plains and mountains stretching as far as the eye can see. It's a world ripe for adventure! A World of Sensation: \"Touch\" is the theme of Dawn of Mana's world. You can virtually feel realistically rendered, lifelike objects. [Square Enix]… Expand"}, {"name": "Gigantosaurus: The Game", "details_link": "https://www.metacritic.com/game/xbox-one/gigantosaurus-the-game", "publisher": "Outright Games", "release_date": "Mar 27 2020", "developers": ["Cyber Group Studios"], "platforms": ["PC", "PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/6d754dea46d2cf2c653692c67958b1e6-98.jpg", "descriptions": "The most exciting episode of Gigantosaurus yet is one you get to play in. But will you be the most roarsome explorer or the fastest racer? Play together with friends and family to help Rocky, Tiny, Mazu and Bill save the day – before dino-dashing to the next zone. Dinosaurs have never hadThe most exciting episode of Gigantosaurus yet is one you get to play in. But will you be the most roarsome explorer or the fastest racer? Play together with friends and family to help Rocky, Tiny, Mazu and Bill save the day – before dino-dashing to the next zone. Dinosaurs have never had such giant fun!… Expand"}, {"name": "Submerged", "details_link": "https://www.metacritic.com/game/xbox-one/submerged", "publisher": "Uppercut Games Pty Ltd", "release_date": "Aug  7 2015", "developers": ["Uppercut Games Pty Ltd"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/9803fc90f0d8016d0ee81b4f5c1fa53f-98.jpg", "descriptions": "Submerged is a 3rd-person, combat-free game in which the gamer explores a mysterious, flooded city and discovers the beauty of desolation in vast outdoor environments. She takes on the role of Miku, a young girl who has brought her wounded brother to the city in their small fishing boat.Submerged is a 3rd-person, combat-free game in which the gamer explores a mysterious, flooded city and discovers the beauty of desolation in vast outdoor environments. She takes on the role of Miku, a young girl who has brought her wounded brother to the city in their small fishing boat. [Uppercut Games]… Expand"}, {"name": "Dementium Remastered", "details_link": "https://www.metacritic.com/game/3ds/dementium-remastered", "publisher": "Renegade Kid", "release_date": "Dec  3 2015", "developers": ["Renegade Kid"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 57, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/3da14f41bfbfd909c9bb94bf44189bc1-98.jpg", "descriptions": "Dementium Remastered tells the tale of a man who awakens to find himself alone in a mysterious, derelict hospital that is frozen in time. Confronted by the deadly, grotesque surgical experiments that wander the halls, a series of challenging puzzles, and a cast of peculiar characters, heDementium Remastered tells the tale of a man who awakens to find himself alone in a mysterious, derelict hospital that is frozen in time. Confronted by the deadly, grotesque surgical experiments that wander the halls, a series of challenging puzzles, and a cast of peculiar characters, he must face his deepest fears, unlock the mysteries of the hospital, and escape with his life. … Expand"}, {"name": "The Amazing Spider-Man 2", "details_link": "https://www.metacritic.com/game/pc/the-amazing-spider-man-2", "publisher": "Activision", "release_date": "Apr 29 2014", "developers": ["Beenox"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 57, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/962670e318d652518887e6ea6ab31c3c-98.jpg", "descriptions": "The Amazing Spider-Man, this all-new third-person action-adventure video game builds on the story of the previous game with an alternative take on the events of the upcoming movie, while also giving players an enhanced, free-roaming web-slinging experience through a greatly expanded New York City."}, {"name": "Shrek the Third", "details_link": "https://www.metacritic.com/game/wii/shrek-the-third", "publisher": "Activision", "release_date": "May 15 2007", "developers": ["Shaba Games", "Amaze Entertainment"], "platforms": ["PC", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 57, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/9/96344c235de3374f284975c301da4a40-98.jpg", "descriptions": "Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies,Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies, and visit never before seen lands from the movie and beyond. [Activision]… Expand"}, {"name": "Tony Hawk's Proving Ground", "details_link": "https://www.metacritic.com/game/wii/tony-hawks-proving-ground", "publisher": "Activision", "release_date": "Oct 15 2007", "developers": ["Page 44 Studios"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 57, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/7cc675490eebc69cad2813cbade1ad13-98.jpg", "descriptions": "For the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground featuresFor the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground features deeper customization than ever before, including a Video Editor with full-featured editing tools and visual effects for creating \"epic skate videos,\" and a fully customizable online Skate Lounge where players can skate with friends in the ultimate pad. In addition, players have the freedom to skate from single player to online seamlessly, as well as utilize new gameplay mechanics such as skateable terrain altering and building, and Bowl Carving. Tony Hawk’s Proving Ground also features even more Nail the Trick moves such as Nail the Grab and Nail the Manual intensifying the thrill of pulling off big tricks. [Activision]… Expand"}, {"name": "Warhammer 40,000: Squad Command", "details_link": "https://www.metacritic.com/game/ds/warhammer-40000-squad-command", "publisher": "THQ", "release_date": "Dec 17 2007", "developers": ["THQ"], "platforms": "DS", "num_players": "Up to 8 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "Tactics"], "meta_score": 57, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/11b7cc02c54c799b77e51273a92058c0-98.jpg", "descriptions": "Warhammer 40,000: Squad Command features fast, action-packed combat through turn-based strategy and an engaging, authentic single-player storyline. Gamers play as the elite Space Marines of the Ultramarines chapter and strive to combat the encroaching evil of the ruthless and daemonicWarhammer 40,000: Squad Command features fast, action-packed combat through turn-based strategy and an engaging, authentic single-player storyline. Gamers play as the elite Space Marines of the Ultramarines chapter and strive to combat the encroaching evil of the ruthless and daemonic influenced Chaos Space Marines through 13 cinematically-tied missions. With a robust multiplayer mode featuring 9 unique missions, gamers will team up and go head-to-head with other gamers worldwide as either the Imperium of Man or Chaos Space Marines, ensuring hours of unique replayability. Compelling single player game consisting of 13 unique missions. 9 unique multiplayer maps for Local or Global games, with small, medium and large map variants to cater for games from 2 to 8 players. Fully destructible, real time 3D battlefields mean that no two games will be the same. Pick from two Space Marine chapters or two Chaos Space Marine Legions to play as in Multiplayer games, in battles between Imperium vs. Imperium, Forces of Chaos vs. Forces of Chaos, or Imperium vs. Forces of Chaos.… Expand"}, {"name": "UberSoldier", "details_link": "https://www.metacritic.com/game/pc/ubersoldier", "publisher": "cdv Software", "release_date": "Mar 31 2006", "developers": ["Burut Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Historic", "Historic"], "meta_score": 57, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/91184bbdbb5b506e2b8b6ab996f4a055-98.jpg", "descriptions": "At the height of World War II, with the outcome still very much in doubt, secret Nazi experiments are searching for a way to bring life back to the dead. This experiment, led by a ruthless Nazi general, discovers that the shock people experience upon death endows their minds with powerfulAt the height of World War II, with the outcome still very much in doubt, secret Nazi experiments are searching for a way to bring life back to the dead. This experiment, led by a ruthless Nazi general, discovers that the shock people experience upon death endows their minds with powerful supernatural abilities. After countless attempts, they finally succeed at raising the first of a new breed of warrior - the UberSoldier. [CDV Software]… Expand"}, {"name": "Knock-knock", "details_link": "https://www.metacritic.com/game/pc/knock-knock", "publisher": "Ice-Pick Lodge", "release_date": "Oct  4 2013", "developers": ["Ice-Pick Lodge"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Miscellaneous", "Adventure", "General"], "meta_score": 57, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/ee95c13a1f82f10c27fcec6d2b651b36-98.jpg", "descriptions": "There is an atypical cabin deep in the woods. It had served as a lab and a home for three generations of Lodgers. But lately the current Lodger has been noticing weird changes in familiar surroundings; things are missing, noises and rattle heard. Something strange is coming out of the woods."}, {"name": "Far Cry 5: Lost on Mars", "details_link": "https://www.metacritic.com/game/playstation-4/far-cry-5-lost-on-mars", "publisher": "Ubisoft", "release_date": "Jul 17 2018", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 57, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/5d6751408bd4ddc74c29be28a84e21d9-98.jpg", "descriptions": "Nick Rye, the \"King of the Skies\" is ready to go - literally - above and beyond, to discover uncharted territories. Once you're stranded on the red planet, your mission is simple: stop the Martian Arachnid invasion and get back home safely."}, {"name": "Toy Home", "details_link": "https://www.metacritic.com/game/playstation-3/toy-home", "publisher": "SCEA", "release_date": "Dec 20 2007", "developers": ["Game Republic"], "platforms": "PlayStation 3", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 57, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/b5cd37313e3ec9e369e3e8833e8426df-98.jpg", "descriptions": "[Downloadable Game]  Toy Home is an exciting toy car racing game where your house becomes the racetrack. Weave between other toys strewn across a bedroom floor, hurtle across kitchen tables, dodge toy soldiers and zoom along model railway tracks in moonlit playrooms. The aim of the game is[Downloadable Game]  Toy Home is an exciting toy car racing game where your house becomes the racetrack. Weave between other toys strewn across a bedroom floor, hurtle across kitchen tables, dodge toy soldiers and zoom along model railway tracks in moonlit playrooms. The aim of the game is to collect coins, discover hidden medals and hit every checkpoint before the time runs out – and there are bonus points available for every jump, smash and flip you make. Toy Home is manic, miniature racing fun! Miniature Racing Action - 4 racing modes, including split-screen offline multiplayer and online battle modes, and 8 unique courses. SIXAXIS Wireless controller - Tilt the controller left or right to steer, perform back flips in the air, or master cornering. Global Online Ranking - Play for your personal best in Ranking Mode and challenge the high scores on the online leaderboard. [SCEA]… Expand"}, {"name": "Out There: Oceans of Time", "details_link": "https://www.metacritic.com/game/pc/out-there-oceans-of-time", "publisher": "Modern Wolf", "release_date": "May 26 2022", "developers": ["Mi-Clos Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "General", "Visual Novel"], "meta_score": 57, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/a95ec825128a412f1e19d999d51decbe-98.jpg", "descriptions": "The successor to the award-winning Out There, Oceans of Time blends roguelike, resource management and interactive fiction for a space survival epic where death is one wrong decision away.As Commander Nyx, explore a vast galaxy that is different every time you play, as you search for theThe successor to the award-winning Out There, Oceans of Time blends roguelike, resource management and interactive fiction for a space survival epic where death is one wrong decision away.As Commander Nyx, explore a vast galaxy that is different every time you play, as you search for the Archon; a cosmic villain set on dominating the civilisations of the galaxy.Encounter other strange lifeforms and learn to communicate, trade, and conduct diplomacy as you build a coalition of allies in your mission to find the Archon.Recruit new members from the alien races you cross paths with, and build a team capable of traversing the cosmos. Manage your crew, your ship and its systems; the mission's success is down to your decisions as Commander.… Expand"}, {"name": "Fade to Silence", "details_link": "https://www.metacritic.com/game/xbox-one/fade-to-silence", "publisher": "THQ Nordic", "release_date": "Apr 30 2019", "developers": ["Black Forest Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 57, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/044ba7c3eab2fd2c1716dd718100a808-98.jpg", "descriptions": "Fade to Silence is a Survival-RPG set in the cold and deadly world of a post-apocalyptic winter. You assume the role of Ash, a natural but tormented leader, exploring a post-apocalyptic frozen wasteland, gathering the resources necessary to establish a refuge for survival. With dwindlingFade to Silence is a Survival-RPG set in the cold and deadly world of a post-apocalyptic winter. You assume the role of Ash, a natural but tormented leader, exploring a post-apocalyptic frozen wasteland, gathering the resources necessary to establish a refuge for survival. With dwindling supplies, simple tasks like upgrading equipment and collecting materials require an immediate expedition to scavenge the necessary items. In the search for survival materials, players must navigate a vast territory, in which they will encounter Eldritch monsters and an even greater foe; the unrelenting winter. While freezing temperatures constantly take their toll on Ash, the deadliest event is a constant threat – a blizzard. If caught by surprise, it takes every ounce of skill, determination and luck to survive.\r… Expand"}, {"name": "Toren", "details_link": "https://www.metacritic.com/game/pc/toren", "publisher": "Versus Evil", "release_date": "May 11 2015", "developers": ["Swordtales"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 57, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/a4e35bcfdc015bff07def0c2c2bf470d-98.jpg", "descriptions": "Experience the mysterious world of Toren, the first adventure game from Brazilian indie developer Swordtales. You are Moonchild, destined to climb the tower (known as Toren) on a hauntingly solitary journey to find your purpose."}, {"name": "Akiba's Trip: Undead & Undressed", "details_link": "https://www.metacritic.com/game/playstation-4/akibas-trip-undead-undressed", "publisher": "XSEED Games", "release_date": "Nov 25 2014", "developers": ["Acquire"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/04e2a30c9f11c0978382f5059e436042-98.jpg", "descriptions": "Explore the supernatural mysteries of Akihabara in AKIBA'S TRIP: Undead & Undressed. A dark conspiracy plots to consume Japan's pop-culture mecca with an army of synthetic vampires. As a fugitive from their experiments, it's up to you to hunt these 'Synthisters' down, brawling with themExplore the supernatural mysteries of Akihabara in AKIBA'S TRIP: Undead & Undressed. A dark conspiracy plots to consume Japan's pop-culture mecca with an army of synthetic vampires. As a fugitive from their experiments, it's up to you to hunt these 'Synthisters' down, brawling with them in the streets and tearing off their clothes to roast them in the harsh light of day. Just remember, they can do the same to you!\r AKIBA'S TRIP: Undead & Undressed features an authentic open-world recreation of Japan's famous Electric Town. Explore and enjoy the world's premiere destination for anime, games, manga and figurines, with over 100 real-life shops recreated for gamers around the world.\r Fight alongside your 'otaku' (obsessive nerd) friends, wielding everything from rolled-up posters to replica laserswords in a battle for dorky dominance. Four potential love interests await you, each with her own endgame. Experience a geek-savvy, playfully sexy adventure in AKIBA'S TRIP: Undead & Undressed.… Expand"}, {"name": "Sherlock Holmes: The Mystery of the Mummy", "details_link": "https://www.metacritic.com/game/ds/sherlock-holmes-the-mystery-of-the-mummy", "publisher": "DreamCatcher Interactive", "release_date": "Jul 13 2009", "developers": ["Frogwares", "Mistic Software"], "platforms": ["PC", "DS"], "num_players": "1 Player", "genres": ["Adventure", "3D", "Point-and-Click", "First-Person", "Modern", "Modern"], "meta_score": 57, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/6/5880b4ec25219d6e58cdf2dae040f890-98.jpg", "descriptions": "After Lord Montcalfe's death, his daughter Elisabeth turns to the famous detective Sherlock Holmes to solve the mystery that surrounds her father's death. As Holmes' trusted assistant Doctor Watson is having a well deserved holiday with his family, Holmes decides to go to the manor on hisAfter Lord Montcalfe's death, his daughter Elisabeth turns to the famous detective Sherlock Holmes to solve the mystery that surrounds her father's death. As Holmes' trusted assistant Doctor Watson is having a well deserved holiday with his family, Holmes decides to go to the manor on his own. He will have to use all of his considerable skills to solve all the manor's riddles. Only then will he discover that behind this mysterious case lies a dreadful secret. In The Mystery of the Mummy, you're immersed in an incredible adventure full of mysteries and with many twisting plot developments. Take on the role of the famous detective Sherlock Holmes and get ready to avoid numerous diabolical traps while solving a variety of clever riddles. A mysterious murder, numerous suspects, and the famous mummy makes for a case that appears most challenging. [Focus Home Interactive]… Expand"}, {"name": "BattleZone", "details_link": "https://www.metacritic.com/game/psp/battlezone", "publisher": "Atari", "release_date": "Nov  6 2006", "developers": ["Paradigm Entertainment"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Action", "Simulation", "General", "General", "Vehicle", "Combat"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/294ccc855528ea65b548e0d9f04cf74a-98.jpg", "descriptions": "Set in futuristic international military environments, BattleZone puts players in control of highly maneuverable hover tanks, challenging them in close combat scenarios against their rivals. BattleZone features fast and furious gameplay, photo-realistic environments, eight uniqueSet in futuristic international military environments, BattleZone puts players in control of highly maneuverable hover tanks, challenging them in close combat scenarios against their rivals. BattleZone features fast and furious gameplay, photo-realistic environments, eight unique customizable team vehicles, an assortment of high-powered weapons and multiplayer battles. The four-player WiFi mode lets players go head to head, while unlockable weapons, vehicles and upgrades add even greater depth to the gameplay experience. In addition, extra game content will be available through the BattleZone web site, offering gamers news, leader boards and an exclusive online level builder tool that allows players to customize game maps. The extra content can then be downloaded to the players’ PSP system through a local PC-USB connection. BattleZone provides players with six popular and well-known game modes, including Deathmatch, Capture the Flag, Team Deathmatch, Hotzone, Knockout, and Fox and Hound.  For casual gamers, the single player mode offers an easy learning curve for pick-up and play gaming and a tournament progression to win upgrades and enhancements. [Atari]… Expand"}, {"name": "Shrek: Reekin' Havoc", "details_link": "https://www.metacritic.com/game/game-boy-advance/shrek-reekin-havoc", "publisher": "TDK Mediactive", "release_date": "Jul 30 2003", "developers": ["TOSE"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/974fae5d52b2d3f9260ec529712e84cc-98.jpg", "descriptions": "Unless you're a huge fan of the Shrek characters, your money would be better spent on something else."}, {"name": "The Incredible Hulk (2003)", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-incredible-hulk-2003", "publisher": "Universal Interactive", "release_date": "May 27 2003", "developers": ["Pocket Studios"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/64f3e10b187f433d290874a03843a357-98.jpg", "descriptions": "Prepare for the most furious game ever to hit the Game Boy® Advance. You are Dr. Bruce Banner, a government scientist transformed into The Hulk after a nuclear test gone wrong. Rage through more than 30 levels of intense action, crushing everythign and everyone in your way, and when youPrepare for the most furious game ever to hit the Game Boy® Advance. You are Dr. Bruce Banner, a government scientist transformed into The Hulk after a nuclear test gone wrong. Rage through more than 30 levels of intense action, crushing everythign and everyone in your way, and when you are done destroying your enemies, link up with your friends and battle it out in a multiplayer Hulk-Match!… Expand"}, {"name": "Army Men Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/army-men-advance", "publisher": "3DO", "release_date": "Jun 10 2001", "developers": ["DC Studios"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 57, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/d93852f9d9f0a53a4bde615b1627b966-98.jpg", "descriptions": "Plastro, the infamous leader of the Tan Army, has recruited alien forces from another world to aid in his ongoing war against the Green Nation. It's up to Sarge and Vikki G. to jump into action to save their troops from a variety of unknown enemies, and then track down Plastro himself for aPlastro, the infamous leader of the Tan Army, has recruited alien forces from another world to aid in his ongoing war against the Green Nation. It's up to Sarge and Vikki G. to jump into action to save their troops from a variety of unknown enemies, and then track down Plastro himself for a final confrontation!… Expand"}, {"name": "Death By Cube", "details_link": "https://www.metacritic.com/game/xbox-360/death-by-cube", "publisher": "Square Enix", "release_date": "Jan 20 2010", "developers": ["Premium Agency"], "platforms": "Xbox 360", "num_players": "1-8 ", "genres": ["Adventure", "General", "General"], "meta_score": 56, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/91064094b88a254142aeee6f9fce80d6-98.jpg", "descriptions": "[Xbox Live Arcade]  Developed by Premium Agency, DEATH BY CUBE is a strategic twin-stick shooter in which players attempt to defeat cube shaped enemy robots of all sizes. With simple yet challenging game play, DEATH BY CUBE allows players to destroy an army of oil covered enemies in[Xbox Live Arcade]  Developed by Premium Agency, DEATH BY CUBE is a strategic twin-stick shooter in which players attempt to defeat cube shaped enemy robots of all sizes. With simple yet challenging game play, DEATH BY CUBE allows players to destroy an army of oil covered enemies in addictive and map-specific combat.  Take on missions in single player mode or enjoy heated battles in online and offline multiplayer modes. LEO is a robot, one who awakes to find that he has lost his memory. All he knows is that he must reboot the heroine robot SELSIE, so he sets forth on a mission hoping to regain his memory. To his surprise, he finds the world is now filled with battalions of enemy robots, drenched in bright red oil, and shooting bullets every direction.  What will LEO find beyond the barrage of enemy robots, bullets and red oil? [Square Enix]… Expand"}, {"name": "Blood Bowl III", "details_link": "https://www.metacritic.com/game/pc/blood-bowl-iii", "publisher": "Bigben Interactive", "release_date": "Feb 23 2023", "developers": ["Cyanide"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Sports", "Football", "Arcade", "Team"], "meta_score": 56, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/1/490055700d7ed50bd5f5c31e4ff4daa5-98.jpg", "descriptions": "Brutal, crazy, tactical... this is BLOOD BOWL! The iconic death sport returns with the new video game of fantasy football faithfully using the latest board game rules and new content.Create your team, then crush, mulch and cheat your way to the top... leaving your opponents in the graveyard."}, {"name": "The Last of Us Part I", "details_link": "https://www.metacritic.com/game/pc/the-last-of-us-part-i", "publisher": "Sony Interactive Entertainment", "release_date": "Mar 28 2023", "developers": ["Naughty Dog"], "platforms": ["PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 57, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/1/90fd21ed836002379386db6308366957-98.jpg", "descriptions": "In a ravaged civilization, where infected and hardened survivors run rampant, Joel, a weary protagonist, is hired to smuggle 14-year-old Ellie out of a military quarantine zone. However, what starts as a small job soon transforms into a brutal cross-country journey. Includes the complete TheIn a ravaged civilization, where infected and hardened survivors run rampant, Joel, a weary protagonist, is hired to smuggle 14-year-old Ellie out of a military quarantine zone. However, what starts as a small job soon transforms into a brutal cross-country journey. Includes the complete The Last of Us single-player story and celebrated prequel chapter, Left Behind, which explores the events that changed the lives of Ellie and her best friend Riley forever.… Expand"}, {"name": "WWE 2K15", "details_link": "https://www.metacritic.com/game/xbox-one/wwe-2k15", "publisher": "2K Sports", "release_date": "Nov 18 2014", "developers": ["Yuke's"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Sports", "Fighting", "Individual", "Combat", "Wrestling"], "meta_score": 56, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/c71bdc6b3d0e8c4fe8ab2a0a19f302e6-98.jpg", "descriptions": "For the first time, guide your custom Superstar through an authentic WWE career in the MyCareer Mode. From NXT to RAW, make your way up to the WWE Championship and live the life of an actual WWE Superstar.  By using new motion capture technology, 2K15 includes many more new animations thanFor the first time, guide your custom Superstar through an authentic WWE career in the MyCareer Mode. From NXT to RAW, make your way up to the WWE Championship and live the life of an actual WWE Superstar.  By using new motion capture technology, 2K15 includes many more new animations than any previous WWE title. The game also includes a new chain wrestling system.… Expand"}, {"name": "Necromunda: Hired Gun", "details_link": "https://www.metacritic.com/game/xbox-series-x/necromunda-hired-gun", "publisher": "Focus Home Interactive", "release_date": "Jun  1 2021", "developers": ["Focus Home Interactive", "Streum On Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "Shooter", "First-Person", "Tactics", "Arcade"], "meta_score": 56, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/cffad753c8df2ec9487781d07ce67452-98.jpg", "descriptions": "Become a Hired Gun. The money’s good, the dog’s loyal, and the gun’s reliable. Embark on an indie fast-paced, violent, and thrilling FPS set in the darkest reaches of Warhammer 40,000’s most infamous hive city."}, {"name": "Guilty Gear 2: Overture", "details_link": "https://www.metacritic.com/game/xbox-360/guilty-gear-2-overture", "publisher": "Aksys Games", "release_date": "Oct  7 2008", "developers": ["Arc System Works"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Strategy", "Real-Time", "Beat-'Em-Up", "Fantasy", "General", "Fantasy"], "meta_score": 56, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/0b30e513d7f044ba03560ecdd7677bf1-98.jpg", "descriptions": "In the far future, humanity succeeded in developing an endless energy called the divine power. But although they were able to obtain wisdom, mankind could not cast aside their foolishness. Tension among the major powers led to the creation of biological weapons that were based on that powerIn the far future, humanity succeeded in developing an endless energy called the divine power. But although they were able to obtain wisdom, mankind could not cast aside their foolishness. Tension among the major powers led to the creation of biological weapons that were based on that power - Gears. Justice, the only Gear able to command the legions of biological weapons, went berserk and declared war on all of humanity. That was the beginning of the worst war in history - The Crusades. In response, mankind formed an order of elite knights, and with their participation, Justice was defeated. With her fall, all Gears ceased to function and entered a dormant state. The long-lasted Crusades came to an end, and it seemed like mankind restored peace. However, true history has yet to reveal itself. [Aksys Games]… Expand"}, {"name": "Don King Presents: Prizefighter", "details_link": "https://www.metacritic.com/game/xbox-360/don-king-presents-prizefighter", "publisher": "2K Sports", "release_date": "Jun 10 2008", "developers": ["Venom Games"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 56, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/d6aa5db6e7e1a40c86672ab420abf686-98.jpg", "descriptions": "This in-depth, documentary-style title promises to provide the deepest, most authentic and entertaining experience ever seen in a boxing video game. Prizefighter brings the realism of live action match-ups and the true tactics of the sweet science together for the first time. More than justThis in-depth, documentary-style title promises to provide the deepest, most authentic and entertaining experience ever seen in a boxing video game. Prizefighter brings the realism of live action match-ups and the true tactics of the sweet science together for the first time. More than just a night at the fights - players are responsible for building a career by overcoming adversity, avoiding temptation, and balancing their commitments to train and promote, all while focusing on the goal of ultimately winning and defending the title belt. The story is told by a revolutionary sports documentary-style narrative never before seen in a video game. [2K Games]… Expand"}, {"name": "Choo-Choo Charles", "details_link": "https://www.metacritic.com/game/pc/choo-choo-charles", "publisher": "Two Star Games", "release_date": "Dec  9 2022", "developers": ["Two Star Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 56, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/d17a9dd2000c11d50b96c48e611a1e8c-98.jpg", "descriptions": "Navigate an open-world island in an old train, upgrade it over time, and use it to fight an evil spider train named Charles."}, {"name": "D-Day", "details_link": "https://www.metacritic.com/game/pc/d-day", "publisher": "O3 Entertainment", "release_date": "Dec  7 2004", "developers": ["Digital Reality"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 56, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/fc8ae20f2bb29e472310f2e27d75d09b-98.jpg", "descriptions": "D-Day drops players into the role of World War II Allied forces in the final drive to liberate Europe. Throughout three campaigns and 12 missions in single player mode, D-Day challenge players to prepare troops for battle, create combat strategies, and execute one of the largest militaryD-Day drops players into the role of World War II Allied forces in the final drive to liberate Europe. Throughout three campaigns and 12 missions in single player mode, D-Day challenge players to prepare troops for battle, create combat strategies, and execute one of the largest military invasions in wartime history. Players must successfully plan and execute the turning points in the liberation of Europe: the first hours of the beach landing at Omaha Beach, the paratrooper attack on Sainte Mère Eglise, the taking of the Cherbourg harbor, operation Cobra, the battle of the Falaise pocket, and the liberation of Normandy in August 1944. During the campaigns, players can call in the help of resistant forces to recon the landing areas, take advantage of the Allies' air power (bomber, glider, paratroopers), and stop the German forces' counter attacks. D-Day features over 60 historically accurate units, including rifleman, paratroopers, artillery, tanks, transports, and air support. The multiplayer mode uses GameSpy's online Matchmaking network, allowing up to 8 players to play simultaneously on 12 different maps using 3 different modes. An editor allows players to create their own multiplayer maps. [Digital Jesters]… Expand"}, {"name": "Jungle Rumble: Freedom, Happiness and Bananas", "details_link": "https://www.metacritic.com/game/playstation-vita/jungle-rumble-freedom-happiness-and-bananas", "publisher": "Disco Pixel", "release_date": "Feb 10 2015", "developers": ["Disco Pixel"], "platforms": ["iPhone/iPad", "PlayStation Vita"], "genres": ["Action", "Rhythm", "Music"], "meta_score": 56, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/3705bc54bba616eaa52150a49992b114-98.jpg", "descriptions": null}, {"name": "Ravenbound", "details_link": "https://www.metacritic.com/game/pc/ravenbound", "publisher": "Systemic Reaction", "release_date": "Mar 30 2023", "developers": ["Systemic Reaction"], "platforms": "PC", "genres": ["Role-Playing", "Action RPG"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/7aea90f2ccf661e3b14be290ddef4016-98.jpg", "descriptions": "Fear everything and nothing for death brings you closer to victory in this challenging open world action-roguelite. As the Vessel of an ancient power you must use steel and skill to complete your mission in a dangerous fantasy world inspired by Scandinavian folklore."}, {"name": "Lovecraft's Untold Stories 2", "details_link": "https://www.metacritic.com/game/pc/lovecrafts-untold-stories-2", "publisher": "1C Entertainment", "release_date": "Sep 13 2022", "developers": ["LLC Blini Games"], "platforms": "PC", "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a5ef05d642d4be25ef4cda444733fb94-98.jpg", "descriptions": "Lovecraft's Untold Stories 2 is an action RPG with rogue-like elements that continues the story where Lovecraft's Untold Stories left off, taking the characters to a new stage in their fight against the Unknown, in a completely new graphics style.Loot drops of randomized gear and resourcesLovecraft's Untold Stories 2 is an action RPG with rogue-like elements that continues the story where Lovecraft's Untold Stories left off, taking the characters to a new stage in their fight against the Unknown, in a completely new graphics style.Loot drops of randomized gear and resources to craft your own, explore old and new procedurally generated locations, defend yourself against dozens of different enemies and face off against epic bosses! Beware, for the game is more challenging than ever before, and the tough nightmarish creatures opposing you will not give up easily!… Expand"}, {"name": "The Hong Kong Massacre", "details_link": "https://www.metacritic.com/game/switch/the-hong-kong-massacre", "publisher": "Untold Tales", "release_date": "Dec 26 2020", "developers": ["VRESKI"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 56, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/cdf57cdf05772b2289a8cf46a4f374b5-98.jpg", "descriptions": "Blast your way through the streets of Hong Kong in a fast-paced, top-down shooter.\r Inspired by classic action movies, The Hong Kong Massacre places you at the center of a hard-boiled revenge story, filled with brutal, cinematic shootouts and vivid underworld locations.\r\n\r\nTake on the roleBlast your way through the streets of Hong Kong in a fast-paced, top-down shooter.\r Inspired by classic action movies, The Hong Kong Massacre places you at the center of a hard-boiled revenge story, filled with brutal, cinematic shootouts and vivid underworld locations.\r Take on the role of a former police detective bent on exacting vengeance for his partner's murder and use of a mixture of raw firepower, slow-motion, and dive/dodge mechanics to tear your way through the criminal ranks.\r Dive through windows or dodge behind cover - every shot is lethal, so stay aware of your surroundings and exploit the environment however you can.\r When the heat is on, you can slow down time and plan for the next move. Avoiding bullets whilst taking out enemies is crucial for survival - but beware, your slow-motion ability is limited: plan fast, think ahead and bring down the bad guys unscathed.\r Each level features a range of challenges, allowing you to unlock new weapons as you progress, trading bullets from restaurants to rooftops across a moody, crime-riddled city.\r… Expand"}, {"name": "Cannibal Cuisine", "details_link": "https://www.metacritic.com/game/pc/cannibal-cuisine", "publisher": "Rocket Vulture", "release_date": "May 20 2020", "developers": ["Rocket Vulture"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/8660a920da51f0c433cb2f9a2dcf307c-98.jpg", "descriptions": "A chaotic couch co-op cooking game with a cannibal twist!1-4 players hunt tourists through jungles, temples and volcanoes to feed the cannibal gods. Fine DIEning!"}, {"name": "Naruto: Ninja Council 3", "details_link": "https://www.metacritic.com/game/ds/naruto-ninja-council-3", "publisher": "D3Publisher", "release_date": "May 22 2007", "developers": ["Aspect"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 56, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/a2da5f4aeeee68df92c85fd1d47dae96-98.jpg", "descriptions": "NARUTO: Ninja Council 3 is based on episodes from VIZ Media's anime series SHONEN JUMP NARUTO and will feature mission-based gameplay for up to four players. The ninja action game utilizes an interchangeable attack system allowing players to combine attack techniques from all availableNARUTO: Ninja Council 3 is based on episodes from VIZ Media's anime series SHONEN JUMP NARUTO and will feature mission-based gameplay for up to four players. The ninja action game utilizes an interchangeable attack system allowing players to combine attack techniques from all available characters in the mission to increase their chance of success. Using the new interchangeable attack system, players select a main character to complete the mission and then customize their attack scheme by selecting special techniques from other available characters -- increasing their chance of success by combining the best techniques for the mission. Players can activate special attacks using the Nintendo DS stylus on the touch screen or by blowing into the microphone. Just like a true ninja, in NARUTO: Ninja Council 3, players will have to protect, defend or defeat as they train hard to perfect their skills in order to progress through the ranks in over 40 missions ranging in difficulty from moderate to challenging. Up to four players (wireless) can choose from over 20 different characters with four different playing modes including Timed Mode, Scroll Collection Mode and Head-to-Head Versus Mode. [D3Publisher of America]… Expand"}, {"name": "Xevious", "details_link": "https://www.metacritic.com/game/xbox-360/xevious", "publisher": "Namco Bandai Games", "release_date": "May 23 2007", "developers": ["Namco Bandai Games"], "platforms": ["3DS", "PlayStation 4", "Switch", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/699c3f901711474b53925282f8c1fab4-98.jpg", "descriptions": "[Xbox Live Arcade]  The world's first vertical scrolling shooter, Xevious, comes to Xbox LIVE® Arcade with some unique gameplay features! Control your Solvalou ship and destroy the Xevious forces! Use blasters against air-based enemies and bombs against ground-based targets. Destroy the[Xbox Live Arcade]  The world's first vertical scrolling shooter, Xevious, comes to Xbox LIVE® Arcade with some unique gameplay features! Control your Solvalou ship and destroy the Xevious forces! Use blasters against air-based enemies and bombs against ground-based targets. Destroy the Andor Genesis mothership to earn bonus points! Arcade Hit: Xevious was released in 1982 by Namco and it became an instant hit. Revolutionary for its time, now you can enjoy its arcade goodness on Xbox LIVE Arcade. Classic Features: Unique enemies, a variety of scrolling environments, great background music, and many hidden gameplay features differentiated Xevious from other shooting games released at the time. Pure Shooting Fun: This is single player high-definition old-school arcade action at its best. [Microsoft]… Expand"}, {"name": "Data East Arcade Classics", "details_link": "https://www.metacritic.com/game/wii/data-east-arcade-classics", "publisher": "Majesco Games", "release_date": "Feb 19 2010", "developers": ["G1M2"], "platforms": "Wii", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 56, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/03642cef565a0447dd4d2b59ec1e293d-98.jpg", "descriptions": "Includes 15 classic arcade games: BurgerTime, Peter Pepper's Ice Cream Factory (the rare sequel to Burger Time), Bad Dudes vs. Dragon Ninja, Burnin' Rubber, Caveman Ninja, Crude Buster, Express Raider, Heavy Barrel, Lock ‘n' Chase, Magical Drop III, Secret Agent, Side Pocket, Street Hoop,Includes 15 classic arcade games: BurgerTime, Peter Pepper's Ice Cream Factory (the rare sequel to Burger Time), Bad Dudes vs. Dragon Ninja, Burnin' Rubber, Caveman Ninja, Crude Buster, Express Raider, Heavy Barrel, Lock ‘n' Chase, Magical Drop III, Secret Agent, Side Pocket, Street Hoop, Super Real Darwin and Wizard Fire. [Majesco]… Expand"}, {"name": "Borderlands: Mad Moxxi's Underdome Riot", "details_link": "https://www.metacritic.com/game/playstation-3/borderlands-mad-moxxis-underdome-riot", "publisher": "2K Games", "release_date": "Jan  7 2010", "developers": ["Gearbox Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 56, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/56c4d7563bb1d2f0e0e409e9cf0815c8-98.jpg", "descriptions": "[Playstation Network]  Mad Moxxi's Underdome Riot is an add-on pack for Borderlands that includes a new cooperative arena game mode and a stash to store your gear. Are you god's gift to gun fights? Think you're the best? Wanna prove it? Then help us celebrate the grand opening of Marcus Bank[Playstation Network]  Mad Moxxi's Underdome Riot is an add-on pack for Borderlands that includes a new cooperative arena game mode and a stash to store your gear. Are you god's gift to gun fights? Think you're the best? Wanna prove it? Then help us celebrate the grand opening of Marcus Bank (a subsidiary of Marcus Corp) by killing hundreds and hundreds of people in Mad Moxxi's Underdome Riot, the only competitive arena around where your next of kin can be assured that you're coming back famous . . . or not at all. [Microsoft]… Expand"}, {"name": "Age of Pirates: Caribbean Tales", "details_link": "https://www.metacritic.com/game/pc/age-of-pirates-caribbean-tales", "publisher": "Playlogic", "release_date": "Sep 12 2006", "developers": ["Akella"], "platforms": "PC", "num_players": "16  Online", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 56, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/87eea2794323b262813892722f1bbb85-98.jpg", "descriptions": "Age of Pirates – Carribean Tales is a naval game devoted to pirate adventures on the Caribbean seas of the 17th century. It models all the details of the pirate life and misses nearly no part of a swashbuckler's sword swinging adventures. Taking the role of reckless fortune-hunter Blaze orAge of Pirates – Carribean Tales is a naval game devoted to pirate adventures on the Caribbean seas of the 17th century. It models all the details of the pirate life and misses nearly no part of a swashbuckler's sword swinging adventures. Taking the role of reckless fortune-hunter Blaze or redheaded daredevil Beatrice – the player will navigate his sailor through the Caribbean, trade multiple goods, plunder merchant convoys, accomplish quests, build up his fleet, capture and rule colonies and much more. Following his lucky star he lives a life of high adventure, full of naval battles, bloody fights and treasure hunt, in a world of piracy and sea romance. In addition, the game can be played in 3rd person perspective, exploring your colonies and fighting side by side with your crew of loyal cutthroats and corsairs. [Playlogic]… Expand"}, {"name": "Globulos Party", "details_link": "https://www.metacritic.com/game/ds/globulos-party", "publisher": "GlobZ", "release_date": "Mar  1 2010", "developers": ["GlobZ"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/d391795e3736a98309acd7407ac865c7-98.jpg", "descriptions": "[DSiWare]  Globulos Party is a collection of mini-games that are very simple to understand and fun to master. The 20 games are: 4-Square, Arena, Basket, Bomber, Bomber-King, Croquet, Darts, Darts-King, Soccer, Funky-Soccer, Ice Hockey, Monster, Pétanque, Pinball, Rally, Football, Snooker,[DSiWare]  Globulos Party is a collection of mini-games that are very simple to understand and fun to master. The 20 games are: 4-Square, Arena, Basket, Bomber, Bomber-King, Croquet, Darts, Darts-King, Soccer, Funky-Soccer, Ice Hockey, Monster, Pétanque, Pinball, Rally, Football, Snooker, Sumo, Tic-Tac-Toe and Volley. Enjoy more than 15 hours of solo fun and nearly unlimited game play with the three multiplayer modes. [Nintendo]… Expand"}, {"name": "Guardians of Middle-Earth", "details_link": "https://www.metacritic.com/game/pc/guardians-of-middle-earth", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Aug 29 2013", "developers": ["Monolith Productions"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Strategy", "Real-Time", "MOBA", "MOBA"], "meta_score": 56, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/829331f6420228f953101a3799995ebc-98.jpg", "descriptions": "Guardians of Middle-earth brings up to 10 players together in five versus five competitive multiplayer battle arenas in the epic setting of Middle-earth. The game offers more than 20 iconic guardians, including Gandalf, Sauron, Gollum, Thrain and many more, for players to control in playerGuardians of Middle-earth brings up to 10 players together in five versus five competitive multiplayer battle arenas in the epic setting of Middle-earth. The game offers more than 20 iconic guardians, including Gandalf, Sauron, Gollum, Thrain and many more, for players to control in player versus player (PVP) matches. Gamers will have the ability to connect with other players via an in-game voice communication system, as well as access to a comprehensive online stat and leader board system where they can track friends' victories and defeats, and more.… Expand"}, {"name": "Rave Master: Special Attack Force", "details_link": "https://www.metacritic.com/game/game-boy-advance/rave-master-special-attack-force", "publisher": "Konami", "release_date": "Mar  8 2005", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/3e90f9ce40cb08372383038330a40e41-98.jpg", "descriptions": "It's time for the Rave-olution! Battle it out as Haru Glory, Elie, Musica and many other characters from the exciting new animated series. Wield powerful weapons and harness the skill of the Tension Gauge as you unleash explosive attack combos and incredible special moves to defeat yourIt's time for the Rave-olution! Battle it out as Haru Glory, Elie, Musica and many other characters from the exciting new animated series. Wield powerful weapons and harness the skill of the Tension Gauge as you unleash explosive attack combos and incredible special moves to defeat your enemies. Intense 4-player Battle Mode using the Game Link Cable. Master unique attack & combo moves to defeat enemies. Utilize the Tension Gauge to unleash battle cries & special moves to win. Multiple unique attack combos and weapons for each character.… Expand"}, {"name": "Teenage Mutant Ninja Turtles", "details_link": "https://www.metacritic.com/game/xbox/teenage-mutant-ninja-turtles", "publisher": "Konami", "release_date": "Oct 21 2003", "developers": ["Konami"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 56, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/f9c5b3fd85df20c1fd2f2c1f4c63781d-98.jpg", "descriptions": "Be your favorite Teenage Mutant Ninja Turtle and master your ninja skills in their action-packed world.  Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of foot ninjas.   Find scrolls to unlock specialBe your favorite Teenage Mutant Ninja Turtle and master your ninja skills in their action-packed world.  Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of foot ninjas.   Find scrolls to unlock special attack moves and effects.  Interact with characters from the animated television series, such as Splinter and Casey Jones.  Don't hide in your shell--be a hero.… Expand"}, {"name": "Starsky & Hutch", "details_link": "https://www.metacritic.com/game/pc/starsky-hutch", "publisher": "Gotham Games", "release_date": "Sep  9 2003", "developers": ["Minds-Eye Productions"], "platforms": ["PlayStation 2", "PC"], "genres": ["Driving", "Racing", "Arcade", "Mission-based", "GT / Street", "Automobile"], "meta_score": 56, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/3f5b606e7cee6782125e51871c000157-98.jpg", "descriptions": "Driving games are about to get a lot funkier. Based on the 70's television show, Starsky & Hutch will be careening to a home console near you this fall. Race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum - but don't go thinkingDriving games are about to get a lot funkier. Based on the 70's television show, Starsky & Hutch will be careening to a home console near you this fall. Race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum - but don't go thinking this will be a joy ride! If your driving and shooting skills can't keep the TV audience on the edge of their sofas, your ratings will plummet, the show will be cancelled, and it's game over! Don't think you can handle all the high-speed thrills by yourself? Find a partner and let them shoot while you drive. It's time to clean up the streets... in style! [Gotham Games]… Expand"}, {"name": "World Racing", "details_link": "https://www.metacritic.com/game/xbox/world-racing", "publisher": "TDK Mediactive", "release_date": "Mar 20 2003", "developers": ["Synetic"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 56, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/55521997d2461723498eac2e0b97d7fc-98.jpg", "descriptions": "World Racing gives you total control over your race. Stay on track, search for shortcuts, or simply free roam--you're in control as you take your Mercedes-Benz on a romp around the world. In one of 110 original cars, you'll take on 120 different tracks in seven expansive landscapes, rangingWorld Racing gives you total control over your race. Stay on track, search for shortcuts, or simply free roam--you're in control as you take your Mercedes-Benz on a romp around the world. In one of 110 original cars, you'll take on 120 different tracks in seven expansive landscapes, ranging from Nevada and Japan to the Alps and Mercedes' own Test Center. Defeat your rivals with powerslides, burnouts, and wild stunt driving en route to becoming the world's number one driver.… Expand"}, {"name": "Big Air Freestyle", "details_link": "https://www.metacritic.com/game/gamecube/big-air-freestyle", "publisher": "Atari", "release_date": "Sep 13 2002", "developers": ["Paradigm Entertainment"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 56, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/8de4b99fb207e6ebe10bd8f361fbea7f-98.jpg", "descriptions": "Big Air Freestyle lets you pull off wild tricks even the pros won't try. Freestyle arenas filled with tall jumps, rings of fire, exploding barrels, and destructible objects put you into a world of action. You can also catch air and pull tricks while tearing through more than 20 supercrossBig Air Freestyle lets you pull off wild tricks even the pros won't try. Freestyle arenas filled with tall jumps, rings of fire, exploding barrels, and destructible objects put you into a world of action. You can also catch air and pull tricks while tearing through more than 20 supercross and motocross tracks. Fluid control, animated riders, and fast action make Big Air Freestyle a total snowboarding rush in single-player or multiplayer modes. … Expand"}, {"name": "New Legends", "details_link": "https://www.metacritic.com/game/xbox/new-legends", "publisher": "THQ", "release_date": "Feb 17 2002", "developers": ["Infinite Machine"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/98ce91432491f2e4af28d0cacdf35eee-98.jpg", "descriptions": "New Legends™ is a third-person action game setting man against militia, in a world of tomorrow where both technology and tradition blend to create a rich, and threatening world. It's a thrilling combination of mysticism and machines, of religion and aggression, of blades and bullets."}]