[{"name": "Battlefield 2: Modern Combat", "details_link": "https://www.metacritic.com/game/playstation-2/battlefield-2-modern-combat", "publisher": "EA Games", "release_date": "Oct 24 2005", "developers": ["Digital Illusions"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "32  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/e7d3fc112353d647a83c56c9aa2185c9-98.jpg", "descriptions": "The first-ever Battlefield console installment drops players into the heat of battle on the high tech frontlines, entering a new modern era of combat with more firepower and new expansive environments. Armed with the latest modern weaponry, players can take control of over 30 vehicles,The first-ever Battlefield console installment drops players into the heat of battle on the high tech frontlines, entering a new modern era of combat with more firepower and new expansive environments. Armed with the latest modern weaponry, players can take control of over 30 vehicles, including tanks, helicopters and fast attack vehicles, to engage in major conflicts with up to 24 players in some of the largest online battles on the PlayStation 2 console. (Online play requires the PlayStation 2 console, a broadband connection, memory card, and network adaptor for the PlayStation 2). Voiceover communication is also supported via USB headset. Players will choose to fight for one of three military superpowers: the United States, the Chinese, or the newly formed Middle East Coalition. The game features large and detailed environments, from city streets to remote forests, in some of the globe's most notorious hot spots, allowing players to engage in multiplayer battles that could be ripped straight from tomorrow’s headlines. Battlefield: Modern Combat also includes over 70 state-of-the-art modern weapons and advanced weapon systems, including heat-seeking missiles and laser designated bombs. Additionally, with in-game success, players increase their rank and garner promotions in a persistent online world. [Electronic Arts]… Expand"}, {"name": "Dragon's Dogma: Dark Arisen", "details_link": "https://www.metacritic.com/game/playstation-3/dragons-dogma-dark-arisen", "publisher": "Capcom", "release_date": "Apr 23 2013", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/60a54e99bad3ed2222969d243edbe030-98.jpg", "descriptions": "Dragon's Dogma Dark Arisen is an expansion to the Dragon's Dogma universe."}, {"name": "Double Fine Happy Action Theater", "details_link": "https://www.metacritic.com/game/xbox-360/double-fine-happy-action-theater", "publisher": "Microsoft Game Studios", "release_date": "Feb  1 2012", "developers": ["Double Fine Productions"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Miscellaneous", "General", "General"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/71191ea6ef7ffe9f387dc940e341ebb7-98.jpg", "descriptions": "A collection of Kinect-based mini-games."}, {"name": "Tooth and Tail", "details_link": "https://www.metacritic.com/game/pc/tooth-and-tail", "publisher": "Pocketwatch Games", "release_date": "Sep 12 2017", "developers": ["Pocketwatch Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/c85de14108a438922c24e8dca3bca504-98.jpg", "descriptions": "Lead the revolution with an army of flamethrowing Boars, mustard gas-lobbing Skunks, and paratrooper-puking Owls. Tooth and Tail is a Real-Time-Strategy game featuring Single Player, Online Competitive Play, Split Screen, Replays, and more. Build a base, lead your army, eat your enemies!"}, {"name": "FIFA Soccer 06", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-soccer-06", "publisher": "EA Sports", "release_date": "Oct  4 2005", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/f7843c1cad36771001441d196bc96081-98.jpg", "descriptions": "FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy.FIFA Soccer 06 brings the total football experience to your fingertips. It delivers a combination of attacking gameplay, complete customization, pure authenticity and the deepest manager mode ever. Intuitive gameplay enables you to command every move of your player with pinpoint accuracy. Passing, shooting and tackling is now more responsive than ever and enables you to trap, shield and dribble like a world-class football player. Experience 90 minutes of heart pumping football, feel the Team Chemistry of your side and the sense of momentum shift as you battle for supremacy on the pitch. As the Midfield General you'll control the overarching strategy of the game, dictating the pace and performance of your players as you execute strategic decisions on the fly using the tactical play button configurations. [EA Sports]… Expand"}, {"name": "Madden NFL 19", "details_link": "https://www.metacritic.com/game/playstation-4/madden-nfl-19", "publisher": "Electronic Arts", "release_date": "Aug 10 2018", "developers": ["EA Tiburon"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 80, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/5/5c611d610f63605c3b9b15d8e7ee45e5-98.jpg", "descriptions": "Gameplay in Madden NFL 19 was developed with two primary objectives: 1. Player Control across the field; 2.Immersive NFL Experience from start to finish. To achieve these objectives, EA's goal is to deliver the most significant animation upgrade in Madden history. Madden NFL 19 introduces aGameplay in Madden NFL 19 was developed with two primary objectives: 1. Player Control across the field; 2.Immersive NFL Experience from start to finish. To achieve these objectives, EA's goal is to deliver the most significant animation upgrade in Madden history. Madden NFL 19 introduces a package of features known as Real Player Motion – featuring authentic player movement, more player control and responsiveness, and player signature behaviors that will immerse players into the NFL each and every game. [Electronic Arts]\r… Expand"}, {"name": "Men of War", "details_link": "https://www.metacritic.com/game/pc/men-of-war", "publisher": "Aspyr", "release_date": "Mar 16 2009", "developers": ["Best Way"], "platforms": "PC", "num_players": "16  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Tactics"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/2f02cc199f83d4fe830ed309e47cfe14-98.jpg", "descriptions": "Men of War is a Real-Time Strategy game that takes place during the height of World War II. Intense battles span Europe and North Africa as gamers play as Soviet, Allied or German forces across 19 massive single-player missions. Both online multiplayer and single-player conflicts featureMen of War is a Real-Time Strategy game that takes place during the height of World War II. Intense battles span Europe and North Africa as gamers play as Soviet, Allied or German forces across 19 massive single-player missions. Both online multiplayer and single-player conflicts feature authentic vehicles and weapons of the era and brutal combat that will take players into the heart of the fight. The Direct Control feature allows gamers to command any single unit on the field at any time. Players have complete control over the unit’s actions and can change, upgrade and repair equipment and vehicles. Three evolving storylines in the Soviet, Allied and German armies, comprising 19 missions in total. Realistic models of armament and military equipment recreated in accordance with design drawings and historical documents. Highly detailed WWII environments and characters faithfully recreated with a cutting-edge graphics engine. The single player campaign features a fully customizable user interface. Online play features a unique faction (the Japanese) and numerous gameplay modes including Capture the Flag and High-Value Cargo. [Aspyr Media]… Expand"}, {"name": "Mega Man Zero / ZX Legacy Collection", "details_link": "https://www.metacritic.com/game/playstation-4/mega-man-zero-zx-legacy-collection", "publisher": "Capcom", "release_date": "Feb 25 2020", "developers": ["Capcom", "Access Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/13e0b1df17cb3f296e95ce734c97791d-98.jpg", "descriptions": "Mega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent.In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual ScenarioMega Man Zero/ZX Legacy Collection brings together six classic titles in one game: Mega Man Zero 1, 2, 3, and 4, as well as Mega Man ZX and ZX Advent.In addition to the original games, this package includes an artwork gallery, music player, special filters, and much more. Casual Scenario Mode and a Save-Assist feature are available for those who would like to enjoy the story at their own pace. Players can also try their hand at the new leaderboard-based Z Chaser Mode, an exclusive new mode created just for this set of games.… Expand"}, {"name": "Blossom Tales: The Sleeping King", "details_link": "https://www.metacritic.com/game/switch/blossom-tales-the-sleeping-king", "publisher": "FDG Entertainment", "release_date": "Dec 21 2017", "developers": ["Castle Pixel", "LLC."], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/9d0449f76e39d86bdb4aa1d9daa0af7b-98.jpg", "descriptions": "Prove your worth by fighting through monster-infested dungeons to save the Kingdom of Blossom!"}, {"name": "SSX On Tour", "details_link": "https://www.metacritic.com/game/playstation-2/ssx-on-tour", "publisher": "EA Sports Big", "release_date": "Oct 11 2005", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/cbf5671a13bd78b11f07372b98be42fe-98.jpg", "descriptions": "SSX On Tour is a completely fresh take on the SSX franchise. Building on the core speed and trick gameplay that has been so successful in the past, players can now choose their way to become black diamond fiends. SSX On Tour allows players to create their own boarder or skier and take themSSX On Tour is a completely fresh take on the SSX franchise. Building on the core speed and trick gameplay that has been so successful in the past, players can now choose their way to become black diamond fiends. SSX On Tour allows players to create their own boarder or skier and take them from a wannabe to a mountain rockstar. Players can get noticed in all-new shred challenges where they earn an invitation to The Tour where they'll face the best racers in the SSX cast.  Fly down the all-new tracks, and master the new monster tricks for both boarding and skiing to make it to the top of The Charts. [Electronic Arts]… Expand"}, {"name": "Fallen Enchantress: Legendary Heroes", "details_link": "https://www.metacritic.com/game/pc/fallen-enchantress-legendary-heroes", "publisher": "Stardock", "release_date": "May 22 2013", "developers": ["Stardock"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "4X"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/69192c6308375b459e86e9cf7f2e24d8-98.jpg", "descriptions": "Fallen Enchantress: Legendary Heroes is an expansion to Stardock's popular Fallen Enchantress fantasy strategy game. The world of Elemental needs your help. The Fallen Enchantress seeks to destroy the fragile civilizations that have arisen from the ashes of the cataclysm. Fortunately, yourFallen Enchantress: Legendary Heroes is an expansion to Stardock's popular Fallen Enchantress fantasy strategy game. The world of Elemental needs your help. The Fallen Enchantress seeks to destroy the fragile civilizations that have arisen from the ashes of the cataclysm. Fortunately, your fame has spread far and wide attracting the great heroes to aid you.… Expand"}, {"name": "Medal of Honor Frontline", "details_link": "https://www.metacritic.com/game/gamecube/medal-of-honor-frontline", "publisher": "EA Games", "release_date": "Nov 10 2002", "developers": ["Dreamworks Games"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/f794e8371820a63d4ac1ea317aaeb2a6-98.jpg", "descriptions": "Head back behind enemy lines with Lt.  Jimmy Patterson in Medal of Honor Frontline.  In this installment of the Medal of Honor series, Lt.  Patterson is on a mission to infiltrate the German frontline and steal the HO-IX flying wing, an experimental Nazi weapon so powerful it could turn theHead back behind enemy lines with Lt.  Jimmy Patterson in Medal of Honor Frontline.  In this installment of the Medal of Honor series, Lt.  Patterson is on a mission to infiltrate the German frontline and steal the HO-IX flying wing, an experimental Nazi weapon so powerful it could turn the tide of World War II.  All 20 levels and six major missions in the game are based on real World War II events.  You'll also find authentic weapons, including the Colt .45, Springfield sniper rifle, Panzerschreck rocket launcher, and Browning automatic rifle.  The World War II experience just got more intense.… Expand"}, {"name": "Call of Duty 3", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-3", "publisher": "Activision", "release_date": "Nov 14 2006", "developers": ["Treyarch"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/2ea71ea0b08bc4a9853fe87c107ac772-98.jpg", "descriptions": "Call of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout.  Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle andCall of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout.  Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle and breathtaking action of the Allied offensive that changed the fate of the world. [Activision]… Expand"}, {"name": "Atelier Ryza 2: Lost Legends & the Secret Fairy", "details_link": "https://www.metacritic.com/game/switch/atelier-ryza-2-lost-legends-the-secret-fairy", "publisher": "Koei Tecmo Games", "release_date": "Jan 26 2021", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/41696785238e2af0234ee37ecc89a71d-98.jpg", "descriptions": "Ryza returns in the lead role, making her the first character in the history of the long-running Atelier franchise to take on the hero role in two successive entries. This all-new adventure, set three years after her heroic efforts in Atelier Ryza: Ever Darkness & the Secret Hideout. ThisRyza returns in the lead role, making her the first character in the history of the long-running Atelier franchise to take on the hero role in two successive entries. This all-new adventure, set three years after her heroic efforts in Atelier Ryza: Ever Darkness & the Secret Hideout. This dynamic sequel revolves around Ryza’s journey to the Royal Capital of Ashra-am Baird as she explores ancient ruins while seeking the truth behind the mystery of the lost legends. … Expand"}, {"name": "Pumpkin Jack", "details_link": "https://www.metacritic.com/game/xbox-one/pumpkin-jack", "publisher": "Headup Games", "release_date": "Oct 23 2020", "developers": ["Nicolas Meyssonnier"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/ab74d7cf68355a568218e65759e4a12a-98.jpg", "descriptions": "Pumpkin Jack is a Spooky Scary 3D platformer in which you embody Jack, the Mythical Pumpkin Lord! Dive into an Epic Adventure through otherworldly landscapes and help the Evil annihilate the Good!"}, {"name": "Darkwood", "details_link": "https://www.metacritic.com/game/xbox-one/darkwood", "publisher": "Crunching Koalas", "release_date": "May 17 2019", "developers": ["Acid Wizard Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/1ce87fa97a585da3bc47967b535a2faa-98.jpg", "descriptions": "Darkwood is a game about survival, exploration and fear, set in mysterious woods somewhere in the territory of the Soviet Bloc. It is a top-down, free-roam, surreal horror experience with a randomized world, taking cues from classic games, where oftentimes you had to figure things out forDarkwood is a game about survival, exploration and fear, set in mysterious woods somewhere in the territory of the Soviet Bloc. It is a top-down, free-roam, surreal horror experience with a randomized world, taking cues from classic games, where oftentimes you had to figure things out for yourself. By blending RPG, roguelike and adventure elements together with a challenging difficulty, Darkwood aims to please players craving for a deep and rewarding experience.\r The fear of unknown is powerful  and the unknown will try to remain unseen, forcing you to watch your back. Your senses will be deceived, your sight fooled, your smell tricked by Darkwood's surreal terrors. No answer will be given to you for free, yet somewhere in the woods lies the truth, an explanation to what has happened in this godforsaken place.\r Looking for your weakness, your inner demons, only to devour you. Welcome to Darkwood.… Expand"}, {"name": "Dragon's Dogma: Dark Arisen", "details_link": "https://www.metacritic.com/game/xbox-one/dragons-dogma-dark-arisen", "publisher": "Capcom", "release_date": "Oct  3 2017", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/40f79bd0e1b438ddee6e5774874c397d-98.jpg", "descriptions": "An epitaph speaks of another's demise...\r A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to beAn epitaph speaks of another's demise...\r A mysterious island known as Bitterblack Isle appears off the coast of Gransys. Its depths have claimed the lives of many Arisen their voices still haunt the labyrinth that lies deep beneath its surface--a labyrinth ripe with secrets waiting to be discovered.\r The time to take up arms has come once again. Delve into the isle's depths and uncover its dark secret!… Expand"}, {"name": "Danganronpa V3: Killing Harmony", "details_link": "https://www.metacritic.com/game/playstation-vita/danganronpa-v3-killing-harmony", "publisher": "NIS America", "release_date": "Sep 26 2017", "developers": ["Spike Chunsoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita"], "num_players": "2 ", "genres": ["Adventure", "Visual Novel"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/827dace45bacbf6ac70fcbdaf5d2cd34-98.jpg", "descriptions": "Welcome to a new world of Danganronpa, and prepare yourself for the biggest, most exhilarating episode yet. Set in a psycho-cool environment, a new cast of 16 characters find themselves kidnapped and imprisoned in a school. Inside, some will kill, some will die, and some will be punished.Welcome to a new world of Danganronpa, and prepare yourself for the biggest, most exhilarating episode yet. Set in a psycho-cool environment, a new cast of 16 characters find themselves kidnapped and imprisoned in a school. Inside, some will kill, some will die, and some will be punished. Reimagine what you thought high-stakes, fast-paced investigation was as you investigate twisted murder cases and condemn your new friends to death.\r KEY FEATURES:\r * A New Danganronpa Begins - Forget what you thought you knew about Danganronpa and join a completely new cast of Ultimates for a brand-new beginning.\r * Murder Mysteries - In a world where everyone is trying to survive, nobodys motivations are quite what they seem. Use your skills to solve each new murder or meet a gruesome end.\r * Lie, Panic, Debate! - The world is shaped by our perception of it. Fast-paced trial scenes will require lies, quick wits, and logic to guide your classmates to the right conclusions.\r * New Mini Games - Between the madness of murdered peers and deadly trials, enjoy an abundance of brand-new mini games!… Expand"}, {"name": "Star Wars Pinball: Heroes Within", "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-pinball-heroes-within", "publisher": "Zen Studios", "release_date": "Apr 29 2014", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 4"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball"], "meta_score": 80, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/3/025f89b6d6728045d54dc54116f8b3e3-98.jpg", "descriptions": "These four tables are Han Solo, Star Wars: Episode IV â€“ A New Hope, Star Wars Pinball: Droids, and Star Wars Pinball: Masters of the Force."}, {"name": "Metal Gear Rising: Revengeance", "details_link": "https://www.metacritic.com/game/playstation-3/metal-gear-rising-revengeance", "publisher": "Konami", "release_date": "Feb 19 2013", "developers": ["PlatinumGames"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/ab74b6a339c2df6e470bee5667899a0d-98.jpg", "descriptions": "Metal Gear Rising: Revengeance brings the infamous Metal Gear franchise into new territory by delivering a novel action experience. Coupling development teams at Kojima Productions and PlatinumGames, Revengeance was made with the goal of providing players with a fresh synergetic experienceMetal Gear Rising: Revengeance brings the infamous Metal Gear franchise into new territory by delivering a novel action experience. Coupling development teams at Kojima Productions and PlatinumGames, Revengeance was made with the goal of providing players with a fresh synergetic experience that combines the best elements of pure action and epic storytelling, all within the expansive Metal Gear universe. The game introduces Raiden as the lead character; a young soldier transformed into a half-man, half-machine cyborg ninja, equipped with a high-frequency katana blade and a soul fueled by revenge.… Expand"}, {"name": "The Walking Dead: Episode 4 - Around Every Corner", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-episode-4---around-every-corner", "publisher": "Telltale Games", "release_date": "Oct 10 2012", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/b16686f4f85035168fc7cc8c4f9cc8b1-98.jpg", "descriptions": "Episode 4 of the zombie apocalypse chronicle."}, {"name": "Tales of Monkey Island Chapter 4: The Trial and Execution of Guybrush Threepwood", "details_link": "https://www.metacritic.com/game/pc/tales-of-monkey-island-chapter-4-the-trial-and-execution-of-guybrush-threepwood", "publisher": "Telltale Games", "release_date": "Oct 30 2009", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/ac872b48e7a9fe3165b6c07e5dad6136-98.jpg", "descriptions": "The moment you've been waiting for is here! Come get The Trial and Execution of Guybrush Threepwood, the fourth chapter of Tales of Monkey Island and find out what happens when Guybrush is handed over to De Singe by the treacherous Morgan Le Flay back on Flotsam. [Telltale Games]"}, {"name": "Penny Arcade Adventures: Episode Two", "details_link": "https://www.metacritic.com/game/pc/penny-arcade-adventures-episode-two", "publisher": "Hothead Games", "release_date": "Nov  7 2008", "developers": ["Hothead Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/6622e901ece160025055463032d69473-98.jpg", "descriptions": "The madcap Penny Arcade experience continues. Meet all-new characters from Mike Krahulik, see newly revealed strip favorites and read laugh-out-loud dialogue from Jerry Holkins. Go crazy with a whole new level of customization. Even more options for you to design and develop your ownThe madcap Penny Arcade experience continues. Meet all-new characters from Mike Krahulik, see newly revealed strip favorites and read laugh-out-loud dialogue from Jerry Holkins. Go crazy with a whole new level of customization. Even more options for you to design and develop your own character, seeing it come to life in 3D and in the comic-style 2D cut scenes. Play it safe or go insane! New difficulty settings put you in charge of the action. A deeper RPG-Adventure experience. Get into the game with more puzzles, areas to explore and levels to gain. [Hothead Games]… Expand"}, {"name": "ESPN College Hoops", "details_link": "https://www.metacritic.com/game/xbox/espn-college-hoops", "publisher": "Sega", "release_date": "Nov 13 2003", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/6990e6d483e6078b8defda3226f2abe9-98.jpg", "descriptions": "ESPN College Hoops brings you all the tradition, pride, and competitive spirit of real college basketball with authentic college gameplay, 3-D crowds, and over 100 mascots.  Compete on both sides of the court with the new IsoMotion, listen to stellar commentary from Jay Bilas and MikeESPN College Hoops brings you all the tradition, pride, and competitive spirit of real college basketball with authentic college gameplay, 3-D crowds, and over 100 mascots.  Compete on both sides of the court with the new IsoMotion, listen to stellar commentary from Jay Bilas and Mike Patrick, or dive into the robust Legacy mode that allows you to recruit year-round.  ESPN College Hoops has real play, real emotion, and real heart.… Expand"}, {"name": "Splashdown: Rides Gone Wild", "details_link": "https://www.metacritic.com/game/playstation-2/splashdown-rides-gone-wild", "publisher": "THQ", "release_date": "Aug  5 2003", "developers": ["Rainbow Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Snow / Water"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/50905380a8e00f33e56250e3257ad25d-98.jpg", "descriptions": "Inspired by the spectacle and excitement of theme parks and thrill rides, SplashDown Rides Gone Wild has you blasting through huge, imaginative locales with amazing sights and startling events around every corner. Splashdown's famously beautiful water has evolved as well: bigger waves, swiftInspired by the spectacle and excitement of theme parks and thrill rides, SplashDown Rides Gone Wild has you blasting through huge, imaginative locales with amazing sights and startling events around every corner. Splashdown's famously beautiful water has evolved as well: bigger waves, swift currents, and treacherous downhill rivers. There are also plenty of tricky, technical indoor stadium courses, plus a freestyle stunt mode, an all-new technical time trials mode for hardcore racers, and more. [THQ]… Expand"}, {"name": "MotoGP 3", "details_link": "https://www.metacritic.com/game/playstation-2/motogp-3", "publisher": "Namco", "release_date": "Mar 17 2003", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/3c9a574dd32f75846b4aa3f018f61b46-98.jpg", "descriptions": "Officially licensed, MotoGP3 straps you to the greatest 2-stroke and 4-stroke performance cycles. New features include: 15 circuits plus 20 new Fantasy Tracks; 100 unique challenges to unlock specials; 4-player multi-player mode using multi-tap; Optional Brake Assist feature; Cockpit view;Officially licensed, MotoGP3 straps you to the greatest 2-stroke and 4-stroke performance cycles. New features include: 15 circuits plus 20 new Fantasy Tracks; 100 unique challenges to unlock specials; 4-player multi-player mode using multi-tap; Optional Brake Assist feature; Cockpit view; Updated stats, teams and riders. [Namco]… Expand"}, {"name": "All-Star Baseball 2004", "details_link": "https://www.metacritic.com/game/gamecube/all-star-baseball-2004", "publisher": "Acclaim", "release_date": "Feb 23 2003", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/e8f799c23adbabd9752cee11c95ffe5e-98.jpg", "descriptions": "Not only does All-Star Baseball 2004 simulate professional baseball, but it also gives you a look into baseball's history and homes. Now, in addition to today's baseball stars, you can play history's greatest players, from the MLB to the Negro Leagues. Take a panoramic tour of each stadiumNot only does All-Star Baseball 2004 simulate professional baseball, but it also gives you a look into baseball's history and homes. Now, in addition to today's baseball stars, you can play history's greatest players, from the MLB to the Negro Leagues. Take a panoramic tour of each stadium while learning about interesting facts and features. If you're new to the game, all-star Derek Jeter will guide and instruct you in the new Rookie mode tutorial.… Expand"}, {"name": "War of the Monsters", "details_link": "https://www.metacritic.com/game/playstation-2/war-of-the-monsters", "publisher": "SCEA", "release_date": "Jan 14 2003", "developers": ["Incognito Inc."], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/6f3d5bd420b910cdfb5263fd83236f51-98.jpg", "descriptions": "The most surprising game at 2002's E3 finds you as a giant beast on a rampage of destruction through various cities while beating the pulp out of other mythical creatures along the way."}, {"name": "Incredible Crisis", "details_link": "https://www.metacritic.com/game/playstation/incredible-crisis", "publisher": "Titus Software", "release_date": "Nov  6 2000", "developers": ["Polygon Magic"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/d04268bab706d124134b6e1c35aed5a1-98.jpg", "descriptions": "The severe fun of Incredible Crisis is all about maintaining your sanity, as you help Taneo's family get home in time for Grandma's Birthday.\rIt's a happy day and the worst day of their life, as they endure hundreds of hilarious and cardiac-arrest inducing dilemmas.\rYou'll laugh, cry,The severe fun of Incredible Crisis is all about maintaining your sanity, as you help Taneo's family get home in time for Grandma's Birthday.\rIt's a happy day and the worst day of their life, as they endure hundreds of hilarious and cardiac-arrest inducing dilemmas.\rYou'll laugh, cry, freak-out and perhaps soil your shorts, while your mental and physical reflexes are put the test.\rThe controls are simple, but thumb and forefinger injury is still a risk.\rBe warned, this game is severely fun and may cause obsessive compulsive behavior, if not nervous disorders and/or involuntary twitches.… Expand"}, {"name": "Time Commando", "details_link": "https://www.metacritic.com/game/pc/time-commando", "publisher": "Activision", "release_date": "Jul 31 1996", "developers": ["Adeline Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/7e0ffa8cc6972f324366f4aad158e4f8-98.jpg", "descriptions": "A deadly virus has invaded the military's top secret super computer. Its catastrophic time-warping effects now threaten to overtake the computer systems of the world. If you cannot restore core memory in time, the growing virus will cause the world's collapse. You must journey through theA deadly virus has invaded the military's top secret super computer. Its catastrophic time-warping effects now threaten to overtake the computer systems of the world. If you cannot restore core memory in time, the growing virus will cause the world's collapse. You must journey through the corridors of history to stop this technological demon. But vicious warriors await with lethal purpose. Instinct will be your only ally. All-out combat, your only choice. [Activision]… Expand"}, {"name": "Tiger Woods PGA Tour 08", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-08", "publisher": "EA Sports", "release_date": "Aug 28 2007", "developers": ["EA Salt Lake"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/2ec7aad4855141709232f5c802d8fa7e-98.jpg", "descriptions": "Photo Game Face is a new feature of Tiger Woods PGA Tour 08 for Playstation 3 and Xbox 360 that lets you use photos of your face to create an ultra-realistic likeness of yourself in the game. Your photo-based face can be used with any custom golfer profile you make. Customize your Photo GamePhoto Game Face is a new feature of Tiger Woods PGA Tour 08 for Playstation 3 and Xbox 360 that lets you use photos of your face to create an ultra-realistic likeness of yourself in the game. Your photo-based face can be used with any custom golfer profile you make. Customize your Photo Game Face just like any standard character using the tools in \"My Appearance\". For the first time ever, find out who truly is the world’s greatest golfer. In Tiger Woods PGA Tour 08, all of your golf game is recorded: from the first tee box in Play Now mode, to your final putt in a FedExCup tournament. Post your most amazing--and unthinkable--performances on EA SPORTS GamerNet, a revolutionary interactive gaming hub that hosts user-created content online. Set the bar high by sharing your top moments, or take on challenges set by others. Whether you’re uploading an unbeatable round or the craziest shot you’ve ever sunk, take on the golfing world with GamerNet and Tiger Woods PGA Tour 08. A Shot of ConfidenceAll-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. The Most Golf Courses EverExperience the all-new FedExCup championship format by playing a dream round of golf at Westchester Country Club, TPC Boston, Cog Hill, and East Lake. Take On PGA And LPGA Tour ProsChallenge the greatest PGA Tour pros, including Tiger Woods, John Daly, and Vijay Singh, plus LPGA Tour pros such as Annika Sorenstam, Natalie Gulbis, Christie Kerr, and Morgan Pressel. [Electronic Arts]… Expand"}, {"name": "Dragon Age: Origins - Awakening", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-age-origins---awakening", "publisher": "Electronic Arts", "release_date": "Mar 16 2010", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/f337e1d4205799a9c4026fe714d2e406-98.jpg", "descriptions": "Designed and written by the same team that brought you Dragon Age: Origins, the Awakening expansion pack offers a brand new area of the world to explore known as Amaranthine, featuring an epic story that will allow players to unravel the secrets of the darkspawn - and their true motivations!Designed and written by the same team that brought you Dragon Age: Origins, the Awakening expansion pack offers a brand new area of the world to explore known as Amaranthine, featuring an epic story that will allow players to unravel the secrets of the darkspawn - and their true motivations!  Players face a range of horrific and terrifying creatures including an evolved, intelligent breed of darkspawn and other menacing creatures such as the Inferno Golem and Spectral Dragon.  Dragon Age: Origins – Awakening provides exciting new ways for players to customize their heroes and party, including the ability to re-spec their character attributes, allowing even greater customization and replayability.  Featuring an increased level cap, new spells, abilities, specializations and items, plus five all-new party members, players can continue their adventures from Dragon Age: Origins, or begin with a brand new character. [BioWare]… Expand"}, {"name": "Metro: Last Light", "details_link": "https://www.metacritic.com/game/xbox-360/metro-last-light", "publisher": "Square Enix", "release_date": "May 14 2013", "developers": ["4A Games"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/15ac37c23627f87035937f6e2e81c7b0-98.jpg", "descriptions": "The year is 2034. Under the ruins of post-apocalyptic Moscow, in the tunnels of the Metro, what remains of mankind are besieged by deadly threats from without – and within. Mutants scale the catacombs beneath the desolate surface, and hunt the poisoned skies above. But instead of standingThe year is 2034. Under the ruins of post-apocalyptic Moscow, in the tunnels of the Metro, what remains of mankind are besieged by deadly threats from without – and within. Mutants scale the catacombs beneath the desolate surface, and hunt the poisoned skies above. But instead of standing united, the station-cities of the Metro are locked in a struggle for the ultimate power, a doomsday device from the military vaults of D6. A civil war is burgeoning that could wipe humanity from the face of the earth forever. As Artyom, burdened by guilt but motivated by hope, you hold the keys to our survival – the last light in our darkest hour.… Expand"}, {"name": "SoulCalibur: Broken Destiny", "details_link": "https://www.metacritic.com/game/psp/soulcalibur-broken-destiny", "publisher": "Namco Bandai Games America", "release_date": "Sep  1 2009", "developers": ["Bandai Namco Games", "Project Soul"], "platforms": "PSP", "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/8b56ecf286fb440af1cf7ea7699a6286-98.jpg", "descriptions": "Soulcalibur: Broken Destiny preserves all the fierce battles and gorgeous visuals the series has been known for to create the most comprehensive fighting experience ever on a handheld system with highly responsive controls and balanced gameplay. Adding depth to the combat, an all new singleSoulcalibur: Broken Destiny preserves all the fierce battles and gorgeous visuals the series has been known for to create the most comprehensive fighting experience ever on a handheld system with highly responsive controls and balanced gameplay. Adding depth to the combat, an all new single player mode has been specifically crafted for the PSP system that not only challenges a player's reflexes but also improves his fighting skills. Following in the footsteps of Soulcalibur IV, Critical Finish Moves return where opponents can be defeated with one spectacular attack. Furthermore, the game’s character customization feature has been outfitted with even more options than ever before for infinite possibilities to create an original fighter or customize a favorite warrior. Let the trash talking commence as Soulcalibur: Broken Destiny also allows gamers to engage in local wireless battles, allowing them to challenge a friend using the PSP system’s ad hoc networking. Now adrenaline pumping combat has never been so accessible. [Namco Bandai Games]… Expand"}, {"name": "Octopath Traveler", "details_link": "https://www.metacritic.com/game/pc/octopath-traveler", "publisher": "Square Enix", "release_date": "Jun  7 2019", "developers": ["Square Enix", "Acquire"], "platforms": ["Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/6214e2e7ebf40a858c7d132c179e8f19-98.jpg", "descriptions": "Eight travelers. Eight adventures. Eight roles to play in a new world brought to life by Square Enix. Explore each traveler's story and use their abilities in and out of battle. Will you expand your horizons as the Merchant or track down a traitor as the Warrior? Where will you go? Who willEight travelers. Eight adventures. Eight roles to play in a new world brought to life by Square Enix. Explore each traveler's story and use their abilities in and out of battle. Will you expand your horizons as the Merchant or track down a traitor as the Warrior? Where will you go? Who will join you? You alone can choose your path.\r Step into the shoes of a traveler to inherit their struggles and strengths. Use each character's special abilities to interact with the world and enhance your tactics in turn-based battles. The Dancer's alluring charm leads followers into battle, whereas the Apothecary can mix items to heal allies or unleash explosive attacks. Discover enemy weaknesses and target them to break through their defenses. Sore Boost Points each turn and spend them at strategic times to strengthn abilities, chain attacks, or provide aid. Choose the path you wish to walk and discover what lies beyond the horizon.\r * Explore multiple, distinct RPG adventures in a world created by Square Enix\r* Choose from eight characters, each with their own distinct story\r* The path you choose will affect where your adventure ends\r* Deep, strategic turn-based combat with a layered battle system\r* Music and visuals inspired by retro RPGs, brought to life with modern touches… Expand"}, {"name": "Lufia: Curse of the Sinistrals", "details_link": "https://www.metacritic.com/game/ds/lufia-curse-of-the-sinistrals", "publisher": "Natsume", "release_date": "Oct 12 2010", "developers": ["Neverland"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/e117074e35497c8441729068141d808f-98.jpg", "descriptions": "The Sinistrals, the four legendary harbingers of doom, are out to resurrect the ultimate evil and bring the world to its knees. It's up to the fiery monster hunter Maxim and his eclectic band of adventurers to put a stop to them once and for all. Their adventures will take them across anThe Sinistrals, the four legendary harbingers of doom, are out to resurrect the ultimate evil and bring the world to its knees. It's up to the fiery monster hunter Maxim and his eclectic band of adventurers to put a stop to them once and for all. Their adventures will take them across an expansive world packed with dangerous enemies, powerful items, and diabolical puzzles!… Expand"}, {"name": "Links 2004", "details_link": "https://www.metacritic.com/game/xbox/links-2004", "publisher": "Microsoft Game Studios", "release_date": "Nov 11 2003", "developers": ["Indie Built"], "platforms": "Xbox", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/9f6f8ccec34bc11c1e97f3146961ee9f-98.jpg", "descriptions": "Links, the golf franchise for the PC, has been rebuilt--from the ground up--exclusively for the Xbox.  Links 2004 delivers one of the most realistic and competitive golf experiences.  Through Xbox Live, golf fans worldwide can compete in friendly matches against old golfing buddies or inLinks, the golf franchise for the PC, has been rebuilt--from the ground up--exclusively for the Xbox.  Links 2004 delivers one of the most realistic and competitive golf experiences.  Through Xbox Live, golf fans worldwide can compete in friendly matches against old golfing buddies or in tournaments against the best golfers in the world.  Links 2004 also features top championship courses from around the world and top professionals, including Sergio Garcia.… Expand"}, {"name": "Ultimate Marvel vs. Capcom 3", "details_link": "https://www.metacritic.com/game/playstation-vita/ultimate-marvel-vs-capcom-3", "publisher": "Capcom", "release_date": "Feb 15 2012", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation Vita"], "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/654e15f51fcddffca283c642b94b61c2-98.jpg", "descriptions": "Ultimate Marvel vs. Capcom 3 takes the battle to new heights. With new iconic characters from the Marvel and Capcom universes, 48 characters included, a refined fighting system, eight new stages and new modes, Ultimate Marvel vs. Capcom 3 continues the Capcom fighting game legacy when itUltimate Marvel vs. Capcom 3 takes the battle to new heights. With new iconic characters from the Marvel and Capcom universes, 48 characters included, a refined fighting system, eight new stages and new modes, Ultimate Marvel vs. Capcom 3 continues the Capcom fighting game legacy when it releases at launch of the Playstation Vita. Features online and local multiplayer, touchscreen functionality, NEAR, Heroes & Heralds mode, special gold herald skins, replay mode, and everything you would find in the PlayStation 3 experience. Twelve new legends from Marvel and Capcom join the fray, bringing the roster of characters on the disc up to 48, and a total of 50 with DLC. Includes some of the most iconic and celebrated characters from the Marvel and Capcom universes, including Phoenix Wright on the Capcom side and Nova from the Marvel universe. The revamped roster also includes Vergil, Nemesis, Frank West, Strider and Firebrand from Capcom and Iron Fist, Doctor Strange, Rocket Raccoon, Ghost Rider and Hawkeye from Marvel. Includes eight new stages, including tons of tweaks and surprises added to existing stages. After many fan requests, Spectator mode is now available as part of an overall improved online experience along with other new modes and enhancements. Ultimate Marvel vs. Capcom 3 offers re-balanced gameplay that will provide accessible depth for both newcomers and pros alike. [Sony]\r… Expand"}, {"name": "Lost in Random", "details_link": "https://www.metacritic.com/game/playstation-4/lost-in-random", "publisher": "Electronic Arts", "release_date": "Sep 10 2021", "developers": ["Zoink!"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/b42cccec692aeff0994f76e41b3c36ab-98.jpg", "descriptions": "Play the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, fromPlay the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, from the award-winning Swedish game studio Zoink and penned by Eisner Award-winning Adventure Time and Marvel Comics The Unbeatable Squirrel Girl author Ryan North, you’ll join Even, a penniless girl who’s down on her luck, in a dark quest to save her beloved sister. With her companion Dicey, a small and strange living dice, Even must learn to embrace the chaos of Random, uncovering an age-old tale with a modern message. Walk Random’s mysterious cobbled streets, meet its unpredictable residents, and take on courageous quests. Engage in fearsome battles with a unique blend of tactical combat, card collection, and explosive dice gameplay. It’s time to adapt or perish, as you battle inside giant board game arenas that change with every dice throw! Learn how to tip the odds in your favor, and dive into a dark wonderland where only the brave survive.… Expand"}, {"name": "Super Bomberman R Online", "details_link": "https://www.metacritic.com/game/stadia/super-bomberman-r-online", "publisher": "Konami", "release_date": "Sep  1 2020", "developers": ["Konami"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Stadia"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/5e195daa8fb4d9f8642a36db749c1c26-98.jpg", "descriptions": "With the new Battle 64 mode, players will automatically be placed in one of many areas at the start of each match, and must battle it out against other players in the same area. Areas will begin to close down as the clock ticks and players must pass through the gates to the other remainingWith the new Battle 64 mode, players will automatically be placed in one of many areas at the start of each match, and must battle it out against other players in the same area. Areas will begin to close down as the clock ticks and players must pass through the gates to the other remaining areas before the timer runs out!\rThose who make it to the last remaining area must battle it out to become the last one standing!! … Expand"}, {"name": "Telling Lies", "details_link": "https://www.metacritic.com/game/switch/telling-lies", "publisher": "Annapurna Interactive", "release_date": "Apr 28 2020", "developers": ["Sam Barlow"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/00dd70ddedd965f9a72dfb991c34c1ec-98.jpg", "descriptions": "An investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. Starring Logan Marshall-Green, Alexandra Shipp, Kerry Bishé, Angela Sarafyan and directed by Sam Barlow, creator of Her Story and Silent Hill: ShatteredAn investigative thriller game with non-linear storytelling, Telling Lies revolves around a cache of secretly recorded video conversations. Starring Logan Marshall-Green, Alexandra Shipp, Kerry Bishé, Angela Sarafyan and directed by Sam Barlow, creator of Her Story and Silent Hill: Shattered Memories.… Expand"}, {"name": "The Sims 4: Cats & Dogs", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-cats-dogs", "publisher": "Electronic Arts", "release_date": "Nov 10 2017", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 80, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/9e77b9796e113fce802258b8fc8187b8-98.jpg", "descriptions": "Create a variety of cats and dogs, add them to your Sims' homes to forever change their lives, and care for neighbourhood pets as a veterinarian with The Sims 4: Cats & Dogs. The powerful new Create A Pet tool lets you personalise cats and dogs, each with their own unique appearances,Create a variety of cats and dogs, add them to your Sims' homes to forever change their lives, and care for neighbourhood pets as a veterinarian with The Sims 4: Cats & Dogs. The powerful new Create A Pet tool lets you personalise cats and dogs, each with their own unique appearances, distinct behaviours, and for the first time, expressive outfits! These wonderful, lifelong companions will change your Sims' lives in new and special ways. Treat animal ailments as a veterinarian and run your own clinic in a beautiful coastal world where theres so much for your Sims and their pets to discover.… Expand"}, {"name": "Wasteland 2: Director's Cut", "details_link": "https://www.metacritic.com/game/playstation-4/wasteland-2-directors-cut", "publisher": "Deep Silver", "release_date": "Oct 13 2015", "developers": ["InXile Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/9f0a1a595d61c2f5d6a2ff5ee355a625-98.jpg", "descriptions": "Wasteland 2 is the direct sequel to the first ever post-apocalyptic computer RPG. The original Wasteland was the inspiration for the FALLOUT series of games, and the first RPG to allow players to split parties for tactical considerations, to face players with moral choices, and to make themWasteland 2 is the direct sequel to the first ever post-apocalyptic computer RPG. The original Wasteland was the inspiration for the FALLOUT series of games, and the first RPG to allow players to split parties for tactical considerations, to face players with moral choices, and to make them deal with the consequences of their actions. It was the first to provide far more than the one-key-for-one-lock style of puzzle solving. It was groundbreaking, which is why IGN named it one of the top 25 PC games of all time, Computer Gaming World named it the Adventure Game of the year in 1988, and it was short-listed for inclusion in the Smithsonian Institutions current Art of the Computer Game exhibition.\r Wasteland was set in a dangerous, post-apocalyptic world in the American Southwest. Over the course of adventures rangers would receive promotions, acquire new skills and equipment, then face new challenges with outcomes that changed depending on the strategy used to defeat them. The game featured a strong storyline which required painful decisions by players; and a storyline that allowed for maximum re-playability. Wasteland 2, with your participation and insights, will recapture all that and provide more.  It'll finally be the game worthy to be a Wasteland sequel, as challenging and rewarding as the original, with all added capacity and dazzle of games today.… Expand"}, {"name": "Sins of a Solar Empire: Entrenchment", "details_link": "https://www.metacritic.com/game/pc/sins-of-a-solar-empire-entrenchment", "publisher": "Stardock", "release_date": "Feb 25 2009", "developers": ["Ironclad Games"], "platforms": "PC", "num_players": "10  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/856317ec718eeeeef19dfa475ce7afa9-98.jpg", "descriptions": "Entrenchment is the first micro-expansion for Sins of a Solar Empire, adding new structures, new technologies, and numerous other improvements to one of the most popular and award winning PC titles of 2008. Explore entirely new strategies with new units like starbases, mine layers, andEntrenchment is the first micro-expansion for Sins of a Solar Empire, adding new structures, new technologies, and numerous other improvements to one of the most popular and award winning PC titles of 2008. Explore entirely new strategies with new units like starbases, mine layers, and defense busters and brand new research technologies to customize and improve them. Each race relies more on their unique strengths than ever before, resulting in new defensive options and the necessary evolution of new offensive strategies. Sins of a Solar Empire: Entrenchment is a micro-expansion and requires the full version of Sins of a Solar Empire to play. [Stardock]… Expand"}, {"name": "FIFA Soccer 09 All-Play", "details_link": "https://www.metacritic.com/game/wii/fifa-soccer-09-all-play", "publisher": "EA Sports", "release_date": "Oct 28 2008", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/d2299b0f9fa68dfb099724949b31df27-98.jpg", "descriptions": "Step onto the pitch and play a unique football experience exclusively for the Wii. Enjoy FIFA 09 All-Play one of two ways—a Wii-specific take on the classic ‘11 vs. 11’ simulation or over-the-top arcade action with Wii versions of your favorite football superstars. FIFA 09 All-Play isStep onto the pitch and play a unique football experience exclusively for the Wii. Enjoy FIFA 09 All-Play one of two ways—a Wii-specific take on the classic ‘11 vs. 11’ simulation or over-the-top arcade action with Wii versions of your favorite football superstars. FIFA 09 All-Play is perfectly balanced for gamers of any ability to enjoy fun, football action. Choose to play the style that best suits your skills from advanced controls for experienced players to new EA SPORTS All-Play that enables novice players to focus on fun using simplified controls with AI assistance. EA SPORTS All-Play makes it easier and less intimidating for new players to play at their own level of ability. One gesture and one button press performs all the actions and increases your success rate on shots, free kicks and rebounds. Trouble deciding who to pass the ball to? Let the CPU point you in the right direction with on-screen pass indicators and one-button actions. Panic over picking the corner? Don’t worry, just blast away to find the back of the net with instant shots on goal. Plus, the game provides feedback and stats to track your progress. Experienced players using advanced controls can still access all the in-depth controls, now with refined gestures and a precision passing system with point-and-play control. Plus, you can even use a Classic controller or Nintendo GameCube controller for a more traditional FIFA game experience. Play with your Mii alongside your heroes Ronaldinho, Wayne Rooney and other football stars created as customized characters in an arcade version of the beautiful game. Play 8 vs 8 Footii Match mode for addictive pick-up-and-play arcade action suitable for all levels of ability. Steal the ball and make outrageous shots by simply waving your Wii Remote. You’ve never played football like this before! Plus, Footii Party Games called Table Football and Boot It have been overhauled for more great fun with family and friends. [Electronic Arts]… Expand"}, {"name": "Pokemon: Let's Go, Eevee!", "details_link": "https://www.metacritic.com/game/switch/pokemon-lets-go-eevee!", "publisher": "Nintendo", "release_date": "Nov 16 2018", "developers": ["Game Freak"], "platforms": "Switch", "num_players": "Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Trainer"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/ee47b155fe6387e303c9d3227d35e076-98.jpg", "descriptions": "Catch Pokémon Like Never Before. The Poké Ball Plus is a Poké Ball-shaped device that can be used to play Pokémon: Let's Go, Pikachu! and Pokémon: Let's Go, Eevee! in place of your Joy-Con. You'll be able to throw Poké Balls in-game with a flick of your wrist! In addition to motion controls,Catch Pokémon Like Never Before. The Poké Ball Plus is a Poké Ball-shaped device that can be used to play Pokémon: Let's Go, Pikachu! and Pokémon: Let's Go, Eevee! in place of your Joy-Con. You'll be able to throw Poké Balls in-game with a flick of your wrist! In addition to motion controls, the device lights up with a variety of colors, vibrates, and plays sounds. With the Poké Ball Plus, you can also take one of your favorite Pokémon from these games for a stroll as you go about your daily life in the real world. The Poké Ball Plus even works as a Pokémon GO Plus when playing Pokémon GO.\r Pikachu or Eevee:\rWhich Will You Choose?\r Pokémon: Let's Go, Pikachu! and Pokémon: Let's Go, Eevee! bring the experience of a classic Pokémon RPG to Nintendo Switch with gameplay that is easily approachable for newcomers to the series, but is also deep enough to keep veteran Trainers on their toes.\r The games also have two-player simultaneous play, so you can take the journey with a friend! And there's a deep connection between Pokémon: Let's Go, Pikachu! and Pokémon: Let's Go, Eevee! and Pokémon GO, so fans of the hit mobile game will find even more to enjoy.… Expand"}, {"name": "Spider-Man 2", "details_link": "https://www.metacritic.com/game/gamecube/spider-man-2", "publisher": "Activision", "release_date": "Jun 28 2004", "developers": ["Treyarch"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/41dae84cb5fe51b7269e37b33b4eca6d-98.jpg", "descriptions": "The city is at risk, and only you can save it from the evil clutches of an old enemy--the powerful Electro. He has a mysterious new device that makes his million volts of destruction even deadlier. But now Spider-Man has Insulated Armor, which makes him impervious to electricity, in additionThe city is at risk, and only you can save it from the evil clutches of an old enemy--the powerful Electro. He has a mysterious new device that makes his million volts of destruction even deadlier. But now Spider-Man has Insulated Armor, which makes him impervious to electricity, in addition to new powers such as Ice and Taser-Webbing. With your new bag of tricks, you can stop Electro, Sandman, and other villains' nefarious schemes to bring the city to its knees. … Expand"}, {"name": "Lock's Quest", "details_link": "https://www.metacritic.com/game/ds/locks-quest", "publisher": "THQ", "release_date": "Sep  8 2008", "developers": ["5TH Cell"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "DS"], "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Defense"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/7b17f6be73e38220ec932167b3e293ed-98.jpg", "descriptions": "From the creators of Drawn to Life, a diabolical mechanical army devastates a kingdom as village after village fall under their wrath. A young, brave hero, Lock, is the kingdom's last hope to survive the oncoming invasion. As a newly trained Archineer, Lock must utilize his skills to buildFrom the creators of Drawn to Life, a diabolical mechanical army devastates a kingdom as village after village fall under their wrath. A young, brave hero, Lock, is the kingdom's last hope to survive the oncoming invasion. As a newly trained Archineer, Lock must utilize his skills to build customized towers, traps, walls, weapons, and other defenses in order to preserve the precious source artifacts. Two modes of play: Building Mode & Battle Mode. Build and battle in 100 different areas with varying terrains. Challenge friends and battle against other kingdoms via multi-card play. Innovative game play that is completely stylus driven. [THQ]… Expand"}, {"name": "The Last Story", "details_link": "https://www.metacritic.com/game/wii/the-last-story", "publisher": "XSEED Games", "release_date": "Aug 14 2012", "developers": ["Mistwalker", "Artoon"], "platforms": "Wii", "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG", "General", "Action RPG"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/40643c29d4a38ca9311417f991bfb5f2-98.jpg", "descriptions": "The Last Story is a JRPG for the Wii console from Hironobu Sakaguchi that lets you take charge of a band of mercenaries and journey with them into a sprawling cinematic adventure. Enjoy the adventure alone in this epic Wii game or jump into online multiplayer modes with up to five otherThe Last Story is a JRPG for the Wii console from Hironobu Sakaguchi that lets you take charge of a band of mercenaries and journey with them into a sprawling cinematic adventure. Enjoy the adventure alone in this epic Wii game or jump into online multiplayer modes with up to five other players. [Nintendo UK]… Expand"}, {"name": "Crash Bandicoot 4: It's About Time", "details_link": "https://www.metacritic.com/game/switch/crash-bandicoot-4-its-about-time", "publisher": "Activision", "release_date": "Mar 12 2021", "developers": ["Toys for Bob"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/a3c702cf7390447b10a7928a121f36a3-98.jpg", "descriptions": "It's About Time - for a brand-wumping new Crash Bandicoot game! Crash fourward into a time shattered adventure with your favorite marsupials. Neo Cortex and N. Tropy are back at it again and launching an all-out assault on not just this universe, but the entire multiverse! Crash and Coco areIt's About Time - for a brand-wumping new Crash Bandicoot game! Crash fourward into a time shattered adventure with your favorite marsupials. Neo Cortex and N. Tropy are back at it again and launching an all-out assault on not just this universe, but the entire multiverse! Crash and Coco are here to save the day by reuniting the four Quantum Masks and bending the rules of reality. New abilities? Check. More playable characters? Yep. Alternate dimensions? Obviously. Ridonkulous bosses? For sure. Same awesome sauce? You bet your sweet jorts. Wait, are they actually jorts? Not in this universe!… Expand"}, {"name": "F1 2012", "details_link": "https://www.metacritic.com/game/pc/f1-2012", "publisher": "Codemasters", "release_date": "Sep 17 2012", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/369da72feb034f0dbf0981281fedf03f-98.jpg", "descriptions": "F1 2012 spotlights all of the official teams, drivers and circuits from the 2012 FIA Formula One World Championship."}, {"name": "Diablo II: Resurrected", "details_link": "https://www.metacritic.com/game/pc/diablo-ii-resurrected", "publisher": "Activision", "release_date": "Sep 23 2021", "developers": ["Blizzard Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/1/74d8ace10263e312223876fa8ac3bd4b-98.jpg", "descriptions": "Diablo® II: Resurrected™ is a remastered version of the quintessential action RPG Diablo® II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal. Features: Remastered graphics—monsters, heroes, items,Diablo® II: Resurrected™ is a remastered version of the quintessential action RPG Diablo® II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal. Features: Remastered graphics—monsters, heroes, items, spells, all resurrected. An epic story told through five distinct acts. Classic gameplay—the same Diablo II you know and love, preserved. Updated Battle.net support. Planned support for cross-progression—take your progress wherever you play. Diablo II: Resurrected includes all content from both Diablo II and its epic expansion Diablo II: Lord of Destruction®. Battle your way through icy caverns, horrific tombs filled with undead abominations, and frozen wastelands to the frigid summit of Mount Arreat and stop Baal, the Lord of Destruction. Raise hell with two Lord of Destruction playable classes—the cunning Assassin, master of traps and shadow disciplines, and the savage Druid, a bold shapeshifter and summoner who commands primal elemental magic.… Expand"}, {"name": "Dreamscaper", "details_link": "https://www.metacritic.com/game/pc/dreamscaper", "publisher": "Afterburner Studios", "release_date": "Aug  5 2021", "developers": ["Afterburner Studios"], "platforms": ["Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/89f21d21f5ce1dcd19713ae332c113b7-98.jpg", "descriptions": "A surreal, roguelite inspired ARPG with modernized hack'n'slash combat about lucid dreaming. Warp the dreamscape around you to battle a nightmarish depression that lives in a young woman’s subconscious. DREAM. DIE. WAKE. REPEAT."}, {"name": "Untitled Goose Game", "details_link": "https://www.metacritic.com/game/playstation-4/untitled-goose-game", "publisher": "House House", "release_date": "Dec 17 2019", "developers": ["House House"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "General", "Open-World"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/08743de8341da45f3c4418048d89ad89-98.jpg", "descriptions": "It's a lovely day in the village, and you are a horrible goose.\rUntitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting upIt's a lovely day in the village, and you are a horrible goose.\rUntitled Goose Game is a slapstick-stealth-sandbox, where you are a goose let loose on an unsuspecting village. Make your way around town, from peoples' back gardens to the high street shops to the village green, setting up pranks, stealing hats, honking a lot, and generally ruining everyone’s day.… Expand"}, {"name": "Nidhogg 2", "details_link": "https://www.metacritic.com/game/pc/nidhogg-2", "publisher": "Messhof", "release_date": "Aug 15 2017", "developers": ["Messhof"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "General"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/8a9585215fdf02d6b5e551c216331785-98.jpg", "descriptions": "The rules are simple. Reach the other side and kill anyone that stands in your way. Deftly parry and rend their throats, riddle their bowels with arrows, or squish their brains between your toes. The wurm cares not for chivalry."}, {"name": "The Turing Test", "details_link": "https://www.metacritic.com/game/xbox-one/the-turing-test", "publisher": "Square Enix", "release_date": "Aug 30 2016", "developers": ["Bulkhead Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/2ace989cfe245d44d52fd841cc8590b0-98.jpg", "descriptions": "The Turing Test is a challenging first-person puzzle game set on Jupiter’s moon, Europa. Assume the role of Ava Turing, an engineer for the International Space Agency (ISA) sent to discover the cause behind the disappearance of the ground crew stationed there."}, {"name": "BOXBOY!", "details_link": "https://www.metacritic.com/game/3ds/boxboy!", "publisher": "Nintendo", "release_date": "Apr  2 2015", "developers": ["HAL Labs"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/1aa1ff5a97120b174bd48764571b9fb5-98.jpg", "descriptions": "Think outside the box to save a world in danger. Traverse tricky landscapes by creating boxes to help Qbby navigate more than 20 puzzling worlds. Just watch out—tons of obstacles stand in your way, so fortify yourself with a Shielding Afro or other boxy defenses. Then beat some more stagesThink outside the box to save a world in danger. Traverse tricky landscapes by creating boxes to help Qbby navigate more than 20 puzzling worlds. Just watch out—tons of obstacles stand in your way, so fortify yourself with a Shielding Afro or other boxy defenses. Then beat some more stages to earn sweet square costumes, like a superhero outfit.… Expand"}, {"name": "WWE SmackDown vs. Raw 2007", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-smackdown-vs-raw-2007", "publisher": "THQ", "release_date": "Nov 14 2006", "developers": ["Yuke's"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "4  Online", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/bb35ead3e95ee37a3555c646d32bb373-98.jpg", "descriptions": "A brand new Analog Control System makes fighting more realistic than ever with intuitive movement and new elements of control. An enhanced Season Mode provides multiple branching storylines and unprecedented levels of player choice. In and out of the ring, dozens of user-controlledA brand new Analog Control System makes fighting more realistic than ever with intuitive movement and new elements of control. An enhanced Season Mode provides multiple branching storylines and unprecedented levels of player choice. In and out of the ring, dozens of user-controlled environmental hotspots let players take advantage of anything at their disposal to inflict damage on opponents in new and unique ways. Additionally, new high impact combination moves let players take the power of WWE Superstars into their own hands. Experience the intensity of WWE fans in a brand new, fully loaded interactive fighting area. Players can take advantage of multiple weapons, environmental damage and grabbing signs and weapons from the crowd. WWE SmackDown vs. RAW 2007 offers multiple enhancements, including incredible high definition graphics, updated rosters for both RAW and SmackDown, an expanded General Manager Mode, online multiplayer game play with voice chat support and more. [THQ]… Expand"}, {"name": "Knockout City", "details_link": "https://www.metacritic.com/game/pc/knockout-city", "publisher": "Electronic Arts", "release_date": "May 21 2021", "developers": ["Velan Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "General", "Sports", "Team", "Other"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/ea923b24c465dc52b1e9926d1db434ea-98.jpg", "descriptions": "Rule the city through lightning-fast multiplayer matches featuring mind-blowing dodgeball mechanics. Increase your attack by passing to power up dodgeballs, targeting your opponents with a variety of specialized balls, or “balling up” at any time to get thrown by teammates. Assemble anRule the city through lightning-fast multiplayer matches featuring mind-blowing dodgeball mechanics. Increase your attack by passing to power up dodgeballs, targeting your opponents with a variety of specialized balls, or “balling up” at any time to get thrown by teammates. Assemble an All-Star dodgeball Crew with your friends for multiplayer matches in a seamless cross-play experience! Together, knock out opponents in 3v3, 4v4, or free-for-all matches. Pass, throw, and strategize to dominate as a team and unlock distinctive, Crew-only rewards. [Electronic Arts]… Expand"}, {"name": "Kingdom Hearts III", "details_link": "https://www.metacritic.com/game/xbox-one/kingdom-hearts-iii", "publisher": "Square Enix", "release_date": "Jan 29 2019", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Action Adventure", "Fantasy", "Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/aefdaa8b1a43a6d78eb1d4164d54c6a0-98.jpg", "descriptions": "KINGDOM HEARTS III tells the story of the power of friendship and light vs. darkness as Sora and his friends embark on a perilous adventure. Set in a vast array of Disney and Pixar worlds, KINGDOM HEARTS follows the journey of Sora, an unknowing heir to a spectacular power. Sora is joined byKINGDOM HEARTS III tells the story of the power of friendship and light vs. darkness as Sora and his friends embark on a perilous adventure. Set in a vast array of Disney and Pixar worlds, KINGDOM HEARTS follows the journey of Sora, an unknowing heir to a spectacular power. Sora is joined by Donald Duck and Goofy to stop an evil force known as the Heartless from invading and overtaking the universe. Sora, Donald, and Goofy unite with iconic Disney-Pixar characters old and new to overcome tremendous challenges and persevere against the darkness threatening their worlds. [Square Enix]… Expand"}, {"name": "LEGO City Undercover", "details_link": "https://www.metacritic.com/game/wii-u/lego-city-undercover", "publisher": "Nintendo", "release_date": "Mar 18 2013", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/898baee5a41584e9352733d600edd510-98.jpg", "descriptions": "Take on the role of Chase McCain, an undercover detective armed with clever disguises. Your mission is to stifle the dastardly Rex Fury and end his crime wave in LEGO City. As players run, drive and fly through the city, they’ll use the Wii U GamePad controller as a new law enforcementTake on the role of Chase McCain, an undercover detective armed with clever disguises. Your mission is to stifle the dastardly Rex Fury and end his crime wave in LEGO City. As players run, drive and fly through the city, they’ll use the Wii U GamePad controller as a new law enforcement gadget. [Nintendo]… Expand"}, {"name": "Dragon's Crown Pro", "details_link": "https://www.metacritic.com/game/playstation-4/dragons-crown-pro", "publisher": "Atlus", "release_date": "May 15 2018", "developers": ["Vanillaware"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "Action RPG", "Beat-'Em-Up", "2D"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/6f59474b8ac57a045c104187931d41dd-98.jpg", "descriptions": "Dragon's Crown thrusts you into a fantastical medieval world packed with labyrinthine dungeons to explore, vile monstrosities to smite, and nearly endless online adventure. Your mission is to dive into the dank underworld, uncovering treasure and strengthening your mettle as you unlock theDragon's Crown thrusts you into a fantastical medieval world packed with labyrinthine dungeons to explore, vile monstrosities to smite, and nearly endless online adventure. Your mission is to dive into the dank underworld, uncovering treasure and strengthening your mettle as you unlock the secret behind the ancient dragon threatening the world. Simple, easy-to-learn controls allow anyone to dive into the fray and enjoy the breathtaking sword-and-sorcery action. In addition to long-lasting gameplay, the game also features a vast array of character customization features - with six wildly different classes to play as, raiding the catacombs for epic loot remains fresh and engaging.… Expand"}, {"name": "Luftrausers", "details_link": "https://www.metacritic.com/game/pc/luftrausers", "publisher": "Devolver Digital", "release_date": "Mar 18 2014", "developers": ["Vlambeer"], "platforms": ["PlayStation 3", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/ff3148f4ea56840468087e17bab03c4c-98.jpg", "descriptions": "Luftrausers is an arcade-style aerial combat shooter where ace pilots will be able to customize their own \"rauser\" and battle wily enemy fighters amongst the clouds or charge colossal battleships scattered across the open seas."}, {"name": "Blacktail", "details_link": "https://www.metacritic.com/game/pc/blacktail", "publisher": "Focus Home Interactive", "release_date": "Dec 15 2022", "developers": ["The Parasight"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/475b3a2f505585cf013aa5a8a236469c-98.jpg", "descriptions": "Create the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling set in a vibrant fairy tale world. Choose your path toCreate the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling set in a vibrant fairy tale world. Choose your path to become either the guardian of the woods or the terror nightmares are made of.\r You play as Yaga, a 16-year-old girl accused of witchcraft and expelled from an early medieval Slavic settlement. When living memories of her past return as foul, walking spirits, Yaga is faced with no other option than to hunt them down in hopes of unravelling her own mystery.… Expand"}, {"name": "The Sims 4: Werewolves", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-werewolves", "publisher": "Electronic Arts", "release_date": "Jun 16 2022", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/7016bec5eae01f2b51eb31c825df6a95-98.jpg", "descriptions": "What big teeth you’ll have! Transform into a werewolf and embrace (or fight) your animalistic nature. Beyond rocking a fearsome form werewolf Sims will have unique temperaments and abilities, be affected by the phase of the moon, and experience wolf-specific life events. Craft your werewolfWhat big teeth you’ll have! Transform into a werewolf and embrace (or fight) your animalistic nature. Beyond rocking a fearsome form werewolf Sims will have unique temperaments and abilities, be affected by the phase of the moon, and experience wolf-specific life events. Craft your werewolf identity. Were you bitten, or were you born into a werewolf family? However it happened, now you’ve got to decide what kind of wolf you want to be. Find a pack to prowl the night with, meet your fated mate atop Howling Point, or shun all that and try to make it as a lone wolf. There’s a lot to learn about werewolves and their origins. Unravel werewolf, vampire, and spellcaster lore as you read books, discover secret tunnels, grow your collection, and interact with denizens of Moonwood Mill.… Expand"}, {"name": "Cotton Fantasy", "details_link": "https://www.metacritic.com/game/playstation-4/cotton-fantasy", "publisher": "ININ Games", "release_date": "May 20 2022", "developers": ["Success", "Studio Saizensen"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/191d08d49be0a3462009ee0c12e40d7e-98.jpg", "descriptions": "Cotton Fantasy is a brand-new entry in the Cotton series that sees Cotton and Silk embark on another adventure, this time in HD graphics and with modernised gameplay, but true to its roots!"}, {"name": "Alwa's Legacy", "details_link": "https://www.metacritic.com/game/switch/alwas-legacy", "publisher": "Elden Pixels", "release_date": "Sep 29 2020", "developers": ["Elden Pixels"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D", "Metroidvania"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/0d2beb296dcf65b3a9c39826860e45ed-98.jpg", "descriptions": "Alwa’s Legacy is a modern retro game full of dangerous dungeons, magical items and ancient secrets. By upgrading your magic, any way forward is right in this non-linear adventure game full of exploration."}, {"name": "Arise: A Simple Story", "details_link": "https://www.metacritic.com/game/playstation-4/arise-a-simple-story", "publisher": "Techland", "release_date": "Dec  3 2019", "developers": ["Piccolo"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/72d46212adade739ad65514cbf3f38b3-98.jpg", "descriptions": "Set out on an emotional journey through the bittersweet lives of two people where memories come alive and time bends to your will. Lose yourself in moments of happiness and overcome every hardship as you relive your life’s story. A story of joy and sorrow. A simple story."}, {"name": "Children of Morta", "details_link": "https://www.metacritic.com/game/xbox-one/children-of-morta", "publisher": "Dead Mage", "release_date": "Oct 15 2019", "developers": ["Dead Mage"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Action RPG"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/f8460140b2bcade28f01cf1cbb6d4a48-98.jpg", "descriptions": "Children of Morta is a narrative-based roguelike hack’n slash game for PC, Mac and Linux which will involve you in the adventures of a family."}, {"name": "Borderlands: Game of the Year Edition", "details_link": "https://www.metacritic.com/game/xbox-one/borderlands-game-of-the-year-edition", "publisher": "Gearbox Publishing", "release_date": "Apr  3 2019", "developers": ["Take-Two Interactive"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Arcade"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/140e1387825bd6b8574407eec47a961c-98.jpg", "descriptions": "Lock, Load, & Face the Madness! Get ready for the mind-blowing insanity, as one of four trigger-happy mercenaries, taking out everything that stands in your way. With its addictive action, frantic first person shooter combat, massive arsenal of weaponry, RPG elements and four-player co-op,Lock, Load, & Face the Madness! Get ready for the mind-blowing insanity, as one of four trigger-happy mercenaries, taking out everything that stands in your way. With its addictive action, frantic first person shooter combat, massive arsenal of weaponry, RPG elements and four-player co-op, Borderlands is the breakthrough experience that challenges all the conventions of modern shooters. Borderlands places you in the role of a mercenary on the lawless and desolate planet of Pandora, hell bent on finding a legendary stockpile of powerful alien technology known as The Vault.… Expand"}, {"name": "Aaero: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/aaero-complete-edition", "publisher": "Mad Fellows Ltd", "release_date": "Dec 24 2018", "developers": ["Mad Fellows Ltd"], "platforms": ["Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Rail"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/6220f135a1e1108d71de94f94889de7c-98.jpg", "descriptions": "'Aaero: Complete Edition' is the definitive Aaero experience.The bundle includes the '1000DaysWasted - Drum & Bass Pack' and the 'Monstercat Pack' alongside the main game as well as the 'Comet', 'Sol' and 'Phaser' ship skins."}, {"name": "The Adventure Pals", "details_link": "https://www.metacritic.com/game/xbox-one/the-adventure-pals", "publisher": "Armor Games", "release_date": "Apr  3 2018", "developers": ["Massive Monster"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/5684be90b16d0c55910b91427dbd0446-98.jpg", "descriptions": "Your birthday is ruined when your dad is dad-napped by a madman. Now you, your pet rock, and Sparkles the giraffe will have to fight your way through levels filled with platforming, bizarre enemies, and big bosses in the name of friendship and hotdogs to save the world."}, {"name": "The Walking Dead: Season Two Episode 2 - A House Divided", "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-season-two-episode-2---a-house-divided", "publisher": "Telltale Games", "release_date": "Mar  5 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/4cb41f3091ed0ee93e46800a69571d99-98.jpg", "descriptions": "Season Two continues the story that began in Season One. You are Clementine, a young survivor in a world gone to hell. The dead have risen to feast on the living, and the living cannot be trusted. The story you experience in The Walking Dead Season Two is driven by the choices that you make.Season Two continues the story that began in Season One. You are Clementine, a young survivor in a world gone to hell. The dead have risen to feast on the living, and the living cannot be trusted. The story you experience in The Walking Dead Season Two is driven by the choices that you make. Because of that, your story could be very different from someone else’s. If you played Season One and the DLC episode ‘400 Days’, the choices you made there will affect Season Two.… Expand"}, {"name": "Naruto Shippuden: Ultimate Ninja Storm 3 Full Burst", "details_link": "https://www.metacritic.com/game/pc/naruto-shippuden-ultimate-ninja-storm-3-full-burst", "publisher": "Namco Bandai Games", "release_date": "Oct 24 2013", "developers": ["CyberConnect2"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/765b220000353a6c6ab9f704b2b278a4-98.jpg", "descriptions": "Live the 4th Great Ninja War and its overpowering boss fights or defy your friends in ultra dynamic online and offl ine ninja confrontations! Originally released in March 2013 for Xbox 360 and PlayStation 3 to wide critical and fan acclaim, NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 has beenLive the 4th Great Ninja War and its overpowering boss fights or defy your friends in ultra dynamic online and offl ine ninja confrontations! Originally released in March 2013 for Xbox 360 and PlayStation 3 to wide critical and fan acclaim, NARUTO SHIPPUDEN: Ultimate Ninja STORM 3 has been given a thorough overhaul for its FULL BURST comeback! The \"ULTIMATE\" Ninja Storm 3 edition features many new enhancements and additional content, including the feverishly anticipated chapter where Sasuke and Itachi take on Kabuto in a nail-biting confrontation.… Expand"}, {"name": "Stealth Bastard Deluxe", "details_link": "https://www.metacritic.com/game/pc/stealth-bastard-deluxe", "publisher": "Curve Studios", "release_date": "Nov 28 2012", "developers": ["Curve Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/0002f2c2359b4f8a54d1d9111d9d4e6a-98.jpg", "descriptions": "Armed with nothing but your wits and a pair of top of the range Stealthing Goggles, it’s your job to make your way through a deadly facility that’s determined to extinguish your fragile little life. With no weapons and no armor, being seen means instant death."}, {"name": "Kingdoms of Amalur: Reckoning", "details_link": "https://www.metacritic.com/game/xbox-360/kingdoms-of-amalur-reckoning", "publisher": "Electronic Arts", "release_date": "Feb  7 2012", "developers": ["Big Huge Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["PC-style RPG", "Role-Playing", "Action RPG", "Action RPG"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/7e2d3400643c57b8820ed3520e3829ea-98.jpg", "descriptions": "Immerse yourself in an all-new massive universe from the minds of bestselling author R.A. Salvatore, Spawn creator Todd McFarlane, and Elder Scrolls IV: Oblivion lead designer Ken Rolston. Choose your path and battle through a sprawling world featuring intense, responsive, and customizableImmerse yourself in an all-new massive universe from the minds of bestselling author R.A. Salvatore, Spawn creator Todd McFarlane, and Elder Scrolls IV: Oblivion lead designer Ken Rolston. Choose your path and battle through a sprawling world featuring intense, responsive, and customizable RPG combat.… Expand"}, {"name": "Space Invaders Infinity Gene", "details_link": "https://www.metacritic.com/game/playstation-3/space-invaders-infinity-gene", "publisher": "Square Enix", "release_date": "Sep 14 2010", "developers": ["Taito Corporation"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/52264144b0f4f30cf3b27bb65713e253-98.jpg", "descriptions": "The game starts off looking like the classic Space Invaders, but as you play through the game, it evolves. Unlock new stages, new power ups, and new features. In addition to Normal Mode, Challenge Mode pits you against 99 randomly-created stages. And Music Mode generates custom stages basedThe game starts off looking like the classic Space Invaders, but as you play through the game, it evolves. Unlock new stages, new power ups, and new features. In addition to Normal Mode, Challenge Mode pits you against 99 randomly-created stages. And Music Mode generates custom stages based on music stored on your console. The Invaders are back, and they're watching you. The more you play, the more the game evolves!\r… Expand"}, {"name": "Tom Clancy's Ghost Recon Advanced Warfighter", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-ghost-recon-advanced-warfighter", "publisher": "Ubisoft", "release_date": "May  3 2006", "developers": ["GRIN"], "platforms": ["Xbox 360", "PC"], "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/5f2b8bed0c21b3fc6752359997e7042d-98.jpg", "descriptions": "In 2013, the U.S. Army will implement the Integrated Warfighter System (IWS), evolving what we know as the modern soldier. IWS combines advanced weapon systems, satellite communication devices and enhanced survivability into one fully integrated combat system. The IWS program has beenIn 2013, the U.S. Army will implement the Integrated Warfighter System (IWS), evolving what we know as the modern soldier. IWS combines advanced weapon systems, satellite communication devices and enhanced survivability into one fully integrated combat system. The IWS program has been developed to meet these new threats head on. Now, it can be tested on the battlefield. Following an insurgence in the heart of Mexico City, the U.S. Army's most elite Special Forces team is deployed to the center of the conflict to regain control of the city. Greatly outnumbered but fully equipped with the IWS, this elite team is the first and last line of defense on the battlefield. They are the \"Quiet\" professionals. They are the Ghosts. Gain access to the future of military technology. Using a fully integrated combat system with cutting-edge weapons and revolutionary communication systems, gamers embody the soldier of the future. Based on actual U.S. Army research, the Ghosts give gamers a realistic view of how war will be fought in the next decade. Use the revolutionary Cross-Com, a communication device powered by satellite technology. Attached to the soldier's monocle, the Cross-Com provides full situational awareness and command of the battlefield. Command the Ghost squad and remote allied forces and drones, and direct artillery and air strikes. See what the squad sees and receive visual and auditory intel from allied forces and unmanned drones. [Ubisoft]… Expand"}, {"name": "Rock Band", "details_link": "https://www.metacritic.com/game/wii/rock-band", "publisher": "Electronic Arts", "release_date": "Jun 22 2008", "developers": ["Harmonix Music Systems"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "4  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/537f2392c5cd6fbdd250afeae524e78f-98.jpg", "descriptions": "Play together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordingsPlay together in your living room or across the world! Rock Band offers deep online functionality, allowing players to rock together whether they’re in Rhode Island or Reykjavik. Major record labels and leading music publishers have signed on to provide unrivaled access to master recordings and legendary rock artists – from punk, metal and alternative to classic and southern rock. Rock Band ships with 45 fearsome tracks from artists like Bon Jovi and The Ramones to Black Sabbath and Stone Temple Pilots. Don't forget to pick your specialized rockin’ instrument. Drumming in the spotlight! Showcase a real drum solo with Rock Band's freestyle drum fill windows featured in each song. Break out your own rhythm and style as anything goes! Vocalists can bring the crowd to their feet during Rock Band’s freestyle vocal fill windows. Ad-lib your own words or shout to the crowd to raise the rock intensity of the performance. Band mates can fail out of a song for poor performance, but the band still plays on. Rescue your failing mate by busting out signature moves and blistering solos to wow the crowd with showmanship. Earn bonus points for your band during Rock Band’s Unison Phrase opportunities if everyone plays perfectly. [Harmonix]… Expand"}, {"name": "LEGO Batman: The Videogame", "details_link": "https://www.metacritic.com/game/pc/lego-batman-the-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 23 2008", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/866a5e72c6bb922302da9516b4f86e00-98.jpg", "descriptions": "A stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as severalA stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as several baddie-bashing bat gadgets. [Warner Bros.]… Expand"}, {"name": "Catherine Classic", "details_link": "https://www.metacritic.com/game/pc/catherine-classic", "publisher": "Sega", "release_date": "Jan 10 2019", "developers": ["Atlus"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/d5c3ea9447b48bdf547c346c0bf6939e-98.jpg", "descriptions": "As Vincent, a man recently succumbed to the irresistible beauty of the game's titular diversion, players find themselves swept into a treacherous love triangle. Catherine's core themes those of free will, of the delicate nature of relationships and the choices we make within them, marryAs Vincent, a man recently succumbed to the irresistible beauty of the game's titular diversion, players find themselves swept into a treacherous love triangle. Catherine's core themes those of free will, of the delicate nature of relationships and the choices we make within them, marry perfectly with the intense, terrorfilled gameplay that serves to accurately reflect Vincent's growing sense of anxiety. It is an experience wholly unlike any to come before it, and is certain to leave gamers talking and thinking about Vincent's tribulations long after the credits have rolled.… Expand"}, {"name": "LEGO Indiana Jones: The Original Adventures", "details_link": "https://www.metacritic.com/game/ds/lego-indiana-jones-the-original-adventures", "publisher": "LucasArts", "release_date": "Jun  3 2008", "developers": ["TT Fusion"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Historic", "General"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/b9bb3f90162b5abca5936a47466e959f-98.jpg", "descriptions": "LEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones andLEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade). With a unique tongue-in-cheek take on the original adventures, LEGO Indiana Jones follows Dr. Jones escapades through the jungles of South America to the mountaintops of India. Fans can build, battle and brawl their way through their favorite cinematic moments, from Indy's entanglements with snakes to his dashing boulder run. Pop culture's most iconic archeologist whips through all the classic moments with the help of a host of supporting characters including Marion Ravenwood and Short Round. Players can also mix and match the body parts of more than 60 playable characters to create new heroes just as they could in the LEGO Star Wars games. [LucasArts]… Expand"}, {"name": "Valkyrie Profile: Lenneth", "details_link": "https://www.metacritic.com/game/psp/valkyrie-profile-lenneth", "publisher": "Square Enix", "release_date": "Jul 18 2006", "developers": ["TOSE"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/2c28834f1ca02fbd648a2044ab5f7fe5-98.jpg", "descriptions": "Asgard, the realm of the gods, remains locked in an eternal struggle between the benevolent Aesir and the demonic Vanir. With the end of the world approaching, Odin, Lord of Asgard, summons Lenneth Valkyrie to his side. Possessing the ability to hear the thoughts and feelings of men andAsgard, the realm of the gods, remains locked in an eternal struggle between the benevolent Aesir and the demonic Vanir. With the end of the world approaching, Odin, Lord of Asgard, summons Lenneth Valkyrie to his side. Possessing the ability to hear the thoughts and feelings of men and women in their dying moments, he charges Valkyrie to search Midgard, the world of mortals, to recruit and train the souls of worthy warriors to join the ranks of the Aesir in the Sacred War. Valkyrie Profile: Lenneth brings the classic PlayStation® game console title, originally released in 2000, to the PSP system with completely new CG cut scenes. tri-Ace, the developers behind the acclaimed Star Ocean series and \"Radiata Stories\", introduce new fans to the spectacular combo attacks, unique side-scrolling environment, and gripping storyline that first captivated players six years ago. To give players a deeper understanding of the plot and to complement the game’s dramatic storyline, additional CG cutscenes have been incorporated. Some of these new scenes contain links to the story of \"Valkyrie Profile 2: Silmeria.\" [Square Enix]… Expand"}, {"name": "MLB Power Pros", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-power-pros", "publisher": "2K Sports", "release_date": "Oct  3 2007", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/ffee058f326909def7ea9dd10e51210a-98.jpg", "descriptions": "MLB Power Pros delivers an original visual style to America’s favorite pastime. Every MLB player is represented in the \"Power Pro\" character style - a miniature toy-like figurine model. Gamers will recognize their favorite Baseball stars through comic usage of facial expressions, facialMLB Power Pros delivers an original visual style to America’s favorite pastime. Every MLB player is represented in the \"Power Pro\" character style - a miniature toy-like figurine model. Gamers will recognize their favorite Baseball stars through comic usage of facial expressions, facial hair, and hair styles. Every MLB ballpark has been faithfully replicated with their respective famous landmarks, bringing authenticity to every game. With Season Mode, players become an MLB team general manager with the goal of winning the World Series by controlling all aspects of the team including training players, purchasing better equipment, making trades, and much more. Success Mode combines traditional role-playing elements with baseball scenarios - this story-based mode puts the user in the role of a college baseball player with the goal of becoming a Major League player – gamers train the player in numerous games while dealing with real-world situations of academics, part-time jobs, and other social situations. [2K Sports/Konami]… Expand"}, {"name": "Kirby: Triple Deluxe", "details_link": "https://www.metacritic.com/game/3ds/kirby-triple-deluxe", "publisher": "Nintendo", "release_date": "May  2 2014", "developers": ["HAL Labs"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["General", "General", "Action", "Platformer", "2D"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/895b4bf57b07f3d1d3fa6624d0919016-98.jpg", "descriptions": "Pink? Check. Puffy? Check. Powerful? You have no idea. Devour trees, obstacles, and huge chunks of stages with Kirbys Hypernova ability and inhale enemies to copy epic new moves like Archer. Its a grand new Kirby adventure PLUS a new multiplayer battle mode, Kirby Fighters! When a mysteriousPink? Check. Puffy? Check. Powerful? You have no idea. Devour trees, obstacles, and huge chunks of stages with Kirbys Hypernova ability and inhale enemies to copy epic new moves like Archer. Its a grand new Kirby adventure PLUS a new multiplayer battle mode, Kirby Fighters! When a mysterious being kidnaps King Dedede atop a giant Dreamstalk, only Kirby can save the day! Jump from the foreground to the background in dynamic 3D side-scrolling environments while using new and returning copy abilities to defeat enemies. Duke it out in Kirby Fighters, a fierce 4-player battle mode where you fight using a chosen ability like Sword or Ninja. The last Kirby standing reigns supreme. Whether youre new to Kirby or an old fan, the Kirby: Triple Deluxe game offers a triple threat-action, adventure, and a battle mode!\r -Kirby's powerful copy ability returns, allowing him to inhale, spit and transform\r-Jump from the foreground to the background in dynamic 3D side-scrolling levels\r-Employ new and returning abilities, including:\r-Archer - Kirby wields a bow to strike silently from a distance\r-Beetle - Kirby grabs foes with his horn and slams them into the ground\r-Fire - Kirby can roll into a fireball and scorch through the air\r-Sword - Kirby dons a green cap and wields a sword\r-Kirbys new Hypernova ability lets him inhale obstacles and big chunks of levels!\r-Use the Download Play feature to duke it out in Kirby Fighters, a fierce battle mode for up to 4 players! You can also sharpen your skills by playing solo\r-Enjoy a selection of additional game modes including Dededes Drum Dash and Arena\r-Collect hidden keychains in every level, each resembling legacy Kirby characters\r-Unlock improved items and new keychains by using the StreetPass function to tag other players… Expand"}, {"name": "Stacking", "details_link": "https://www.metacritic.com/game/pc/stacking", "publisher": "THQ", "release_date": "Mar  6 2012", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/49cbb9be01dcf330a20353204d9b5583-98.jpg", "descriptions": "Stacking is the second downloadable game produced by THQ and the award-winning Double Fine Productions. The adventure of Stacking requires players to capture and stack dolls together, then use each doll's unique abilities to solve the game's challenges.  As more puzzles are solved, new dollsStacking is the second downloadable game produced by THQ and the award-winning Double Fine Productions. The adventure of Stacking requires players to capture and stack dolls together, then use each doll's unique abilities to solve the game's challenges.  As more puzzles are solved, new dolls are acquired and the game's visually lush, carefully constructed story unfolds.  … Expand"}, {"name": "Snoopy Flying Ace", "details_link": "https://www.metacritic.com/game/xbox-360/snoopy-flying-ace", "publisher": "Microsoft Game Studios", "release_date": "Jun  2 2010", "developers": ["Smart Bomb Interactive"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/0d972821c544dbf6d3d64f6158aa0c6c-98.jpg", "descriptions": "[Xbox Live Arcade]   You can't have aerial dogfighting without the dog! Join Snoopy, Charlie Brown, and the rest of the Peanuts gang in the premier online flight shooter on Xbox LIVE Arcade, Snoopy Flying Ace. With simple flight controls and a hangar full of customizable planes and weapons,[Xbox Live Arcade]   You can't have aerial dogfighting without the dog! Join Snoopy, Charlie Brown, and the rest of the Peanuts gang in the premier online flight shooter on Xbox LIVE Arcade, Snoopy Flying Ace. With simple flight controls and a hangar full of customizable planes and weapons, all you need are nerves of steel to climb the Leaderboards and become a Flying Ace. Snoopy Flying Ace takes addictive, fast-paced airborne combat to new heights, with fantastic solo and co-op challenges testing your skills against the Flying Circus of the dreaded Red Baron. Remember, it ain't the size of the dog in the fight … it's the size of the fight in the dog! [Xbox.com]… Expand"}, {"name": "The Darkness", "details_link": "https://www.metacritic.com/game/playstation-3/the-darkness", "publisher": "2K Games", "release_date": "Jun 25 2007", "developers": ["Starbreeze"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/c8358919ed30286793bf9ccd82093727-98.jpg", "descriptions": "The Darkness features a distinct blend of dark modern crime drama and supernatural horror with intense first person non-linear gameplay. The game is a dynamic first person shooter that allows players to call upon the forces of the evil underworld as they fight in gritty, urban environments.The Darkness features a distinct blend of dark modern crime drama and supernatural horror with intense first person non-linear gameplay. The game is a dynamic first person shooter that allows players to call upon the forces of the evil underworld as they fight in gritty, urban environments. Armed with an arsenal of guns, gamers battle an array of demonic creatures and supernatural powers. In the game, players assume the role of mafia hitman Jackie Estacado. On the night of his 21st birthday, Jackie is possessed by \"The Darkness,\" an ancient demonic entity that gives Jackie spectacular powers. The story, written by Eisner Award winner Paul Jenkins, follows Jackie and his fight with the fictional Francetti mafia. As the story unfolds, the player will learn to utilize traditional weapons and the extraordinary powers of The Darkness. [2K Games]… Expand"}, {"name": "Age of Wonders III", "details_link": "https://www.metacritic.com/game/pc/age-of-wonders-iii", "publisher": "Triumph Studios", "release_date": "Mar 31 2014", "developers": ["Triumph Studios"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/8f7f3e804f924a89995eaea0177afced-98.jpg", "descriptions": "Age of Wonders 3 marks a modern reimagining of the series, where players join a clash of kings, queens and dark lords for the spoils of an ancient paradise. By introducing unique RPG-inspired classes and specializations, players are able to craft empires of their own design, developingAge of Wonders 3 marks a modern reimagining of the series, where players join a clash of kings, queens and dark lords for the spoils of an ancient paradise. By introducing unique RPG-inspired classes and specializations, players are able to craft empires of their own design, developing unique strategies and play styles. The world-changing conflict plays out on sweeping landscapes, loaded with mythical locations waiting to be uncovered, conquered and exploited.… Expand"}, {"name": "Mario Party Superstars", "details_link": "https://www.metacritic.com/game/switch/mario-party-superstars", "publisher": "Nintendo", "release_date": "Oct 29 2021", "developers": ["Nintendo", "Nd Cube"], "platforms": "Switch", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/07d69700a9b374465242cf58e8442cd9-98.jpg", "descriptions": "A Superstar collection of classic Nintendo 64™ boards - Calling all Superstars! Mario Party™ is back with 5 classic boards from the Nintendo 64 Mario Party games. Frosting meets flowers as you race to get the most stars (and sabotage your opponents) on the Peach’s Birthday Cake board fromA Superstar collection of classic Nintendo 64™ boards - Calling all Superstars! Mario Party™ is back with 5 classic boards from the Nintendo 64 Mario Party games. Frosting meets flowers as you race to get the most stars (and sabotage your opponents) on the Peach’s Birthday Cake board from the original Mario Party game. Or watch the countdown that unleashes Bowser Coin Beam and hold onto those coins on the Space Land board. The tides can turn quickly in Mario Party, so stay vigilant, partygoers. This and all other modes can be played online**, too! 100 classic minigames return from the Nintendo 64 and Nintendo GameCube™ games and more!\r Try your hand at a Superstar collection of minigames from throughout the Mario Party series. Whether you are saving up coins for stars in board game mode or practicing in free play, there is nothing quite like being the last one standing in Mushroom Mix-Up or Shy Guy Says. All minigames are played with button controls, so you can stick to the Joy-Con™ controller or bust out the Nintendo Switch™ Pro Controller or a Nintendo Switch Lite system.\r Party with superstars near or far\r Bring the party anytime, anywhere with same-system***, local wireless***, or online** play. Matches with friends in board game mode save each turn, so feel free to take a break and pick up where you left off. Use stickers to praise or pester fellow players as you race across the board collecting stars. All modes support online multiplayer, so you can hop in with friends for a few minigames or a marathon 30-turn match. Victory is just as sweet (and stealing stars is just as satisfying) from anywhere across the globe.\r… Expand"}, {"name": "Skullgirls: 2nd Encore", "details_link": "https://www.metacritic.com/game/switch/skullgirls-2nd-encore", "publisher": "Lab Zero Games", "release_date": "Oct 22 2019", "developers": ["Lab Zero Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/d09d02b64d50c117bd5fb5bba67ba3ed-98.jpg", "descriptions": "Skullgirls 2nd Encore is a beautiful, fast-paced 2D fighting game that puts players in control of fierce warriors in an extraordinary Dark Deco world. Each of the 14 wildly original characters features unique gameplay mechanics and plenty of personality.Skullgirls 2nd Encore is the perfectSkullgirls 2nd Encore is a beautiful, fast-paced 2D fighting game that puts players in control of fierce warriors in an extraordinary Dark Deco world. Each of the 14 wildly original characters features unique gameplay mechanics and plenty of personality.Skullgirls 2nd Encore is the perfect fighting game for casual and competitive fighting game fans alike. Casual players will enjoy the fully voiced story mode, gorgeous animation and soundtrack by Michiru Yamane, while hardcore players will appreciate its balance, cross-platform multiplayer, and support for PlayStation3 system fight sticks.… Expand"}, {"name": "Life is Strange: Episode 3 - Chaos Theory", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-episode-3---chaos-theory", "publisher": "Square Enix", "release_date": "May 19 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/c8f2d3d9060e697a6a5e14e2c21842a4-98.jpg", "descriptions": "In the third installment of Life is Strange, Max & Chloe ramp up their investigation to find out what exactly is going on at Blackwell Academy and the whereabouts of Rachel Amber. Secrets will be uncovered and Max will find another use for her power."}, {"name": "Magic: The Gathering - Duels of the Planeswalkers 2013", "details_link": "https://www.metacritic.com/game/xbox-360/magic-the-gathering---duels-of-the-planeswalkers-2013", "publisher": "Microsoft Game Studios", "release_date": "Jun 20 2012", "developers": ["Stainless Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/bd20054dd9762f1029ecd04d3728abcc-98.jpg", "descriptions": "Face a stiffer challenge in this version of the franchise. Play with friends or the AI, take on new encounters and opponents, and face up to 3 other players in the Planechase multiplayer format. Featuring 10 customizable decks, Magic 2013 offers new game items to unlock and introduces theFace a stiffer challenge in this version of the franchise. Play with friends or the AI, take on new encounters and opponents, and face up to 3 other players in the Planechase multiplayer format. Featuring 10 customizable decks, Magic 2013 offers new game items to unlock and introduces the option to choose what lands to tap when you cast your spells.… Expand"}, {"name": "Rocksmith", "details_link": "https://www.metacritic.com/game/playstation-3/rocksmith", "publisher": "Ubisoft", "release_date": "Oct 18 2011", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/cec1cd99d418c80442a70b99d292abb7-98.jpg", "descriptions": "Featuring gameplay that automatically adjusts to the player's skill level and innovative game design that makes reading music visually fun and intuitive, Rocksmith engages experienced musicians and those who are picking up a guitar for the first time. The game includes a sizeable library ofFeaturing gameplay that automatically adjusts to the player's skill level and innovative game design that makes reading music visually fun and intuitive, Rocksmith engages experienced musicians and those who are picking up a guitar for the first time. The game includes a sizeable library of music from classic rock bands to current artists, such as The Animals, The Black Keys, David Bowie, Interpol, Nirvana and The Rolling Stones.… Expand"}, {"name": "Shantae and the Seven Sirens", "details_link": "https://www.metacritic.com/game/pc/shantae-and-the-seven-sirens", "publisher": "WayForward", "release_date": "May 28 2020", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/97b264fd728df7409cd03366bf048813-98.jpg", "descriptions": "New locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble inNew locations, abilities, and friends await in Shantae's biggest adventure yet!Shantae and the Seven Sirens sends the belly-dancing, hair-whipping, half-genie hero to a tropical island where Shantae and her friends encounter other Half-Genie allies, but they soon learn there's trouble in paradise. As Shantae gets caught up in the island's sinister secrets, she'll use all-new dance abilities and instant-transformation Fusion Magic to explore the nonlinear, interconnected world where she'll visit multiple towns, overcome treacherous labyrinths, and battle dastardly bosses. The game also features a new collectible card system that grants players the freedom to augment Shantae's powers to suit their own style of play. Key Features:* Explore an interconnected world using new Fusion Magic creature transformations, including a newt and other aquatic forms!* 4K-resolution hand-painted visuals (on 4K devices only)!* All-new characters and returning favorites like Rottytops, Sky, Bolo, and the nefarious Risky Boots!* Collect and power up with monster cards!* Enjoy minigames, acquire magic and items, and uncover secrets!* Gorgeously animated TV-style cutscenes!… Expand"}, {"name": "The Golf Club 2019 featuring PGA Tour", "details_link": "https://www.metacritic.com/game/xbox-one/the-golf-club-2019-featuring-pga-tour", "publisher": "2K Games", "release_date": "Aug 28 2018", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Golf", "Sim"], "meta_score": 80, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/7b870421504a7f70191c273fcbcbf7c7-98.jpg", "descriptions": "The Golf Club 2019 brings the majesty of the sport to modern consoles and PC, setting a new franchise benchmark for authenticity and realism through improved gameplay and visuals, and featuring licensed PGA Tour courses. The all-new officially licensed PGA TOUR career mode takes players onThe Golf Club 2019 brings the majesty of the sport to modern consoles and PC, setting a new franchise benchmark for authenticity and realism through improved gameplay and visuals, and featuring licensed PGA Tour courses. The all-new officially licensed PGA TOUR career mode takes players on an authentic journey through Q-School and the Web.com Tour to earn your right to play in a 32-tournament PGA TOUR season that includes beautifully precise replicas of PGA Tour courses that are accurate down to one-meter of resolution of the real-life courses.Bring your golf fantasies to life with virtually endless customization options for both your courses and characters. Compete online against friends or the world in two all-new modes -- Alt-Shot and Skins -- that have been highly requested by The Golf Club community. And finally, back by popular demand, the Online Societies feature has expanded to allow for greater accessibility and customisability.HB Studios, PGA TOUR, and 2K have joined forces as industry-leaders in sports, golf and gaming to deliver the deepest, most comprehensive virtual golf experience yet.… Expand"}, {"name": "The Legend of Heroes: Trails in the Sky SC", "details_link": "https://www.metacritic.com/game/pc/the-legend-of-heroes-trails-in-the-sky-sc", "publisher": "XSEED Games", "release_date": "Oct 29 2015", "developers": ["Falcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Console-style RPG", "Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/a2166203963fe60b5297cd11fa72e032-98.jpg", "descriptions": "Picking up shortly after The Legend of Heroes: Trails in the Sky, Estelle travels across Liberl in search of Joshua. The journey involves more than seeking loved ones, however, as the Bracer Guild also tasks her with unraveling the mysteries behind the newly unveiled Society of Uroboros."}, {"name": "Assassin's Creed: Revelations", "details_link": "https://www.metacritic.com/game/pc/assassins-creed-revelations", "publisher": "Ubisoft", "release_date": "Nov 29 2011", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/6115192d596ca1246fc6e2b14e2346c8-98.jpg", "descriptions": "Revelations follows master assassin Ezio Auditore as he walks in the footsteps of his legendary mentor, Altair, on a journey to recover five ancient seals that hold the keys to the future of the Assassins brotherhood. It's a perilous path - one that will take Ezio to Constantinople, theRevelations follows master assassin Ezio Auditore as he walks in the footsteps of his legendary mentor, Altair, on a journey to recover five ancient seals that hold the keys to the future of the Assassins brotherhood. It's a perilous path - one that will take Ezio to Constantinople, the heart of the Ottoman Empire, where a growing army of Templars threatens to destabilize the region. … Expand"}, {"name": "FIFA Soccer 06", "details_link": "https://www.metacritic.com/game/gamecube/fifa-soccer-06", "publisher": "EA Sports", "release_date": "Oct  4 2005", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/73e1965c51366afd4ac57a12fe1801d0-98.jpg", "descriptions": "You can experience the excitement of international soccer competition in FIFA 06. Extensive coaching options give you the opportunity to take control of all of your players on the pitch and determine their formation and strategy. FIFA 06 offers game modes ranging from a tournament toYou can experience the excitement of international soccer competition in FIFA 06. Extensive coaching options give you the opportunity to take control of all of your players on the pitch and determine their formation and strategy. FIFA 06 offers game modes ranging from a tournament to individual skill games. You can also play with real players from famous international teams from around the world. Multiplayer modes let you challenge other gamers.… Expand"}, {"name": "inFamous: Second Son", "details_link": "https://www.metacritic.com/game/playstation-4/infamous-second-son", "publisher": "SCEA", "release_date": "Mar 21 2014", "developers": ["Sucker Punch"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Action Adventure", "Sci-Fi", "Open-World"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/4d7c9f415e40c92ce51eb86e5e0ff1a7-98.jpg", "descriptions": "inFAMOUS Second Son is an action adventure game in which, surrounded by a society that fears them, superhumans are ruthlessly hunted down and caged by the Department of Unified Protection. Step into a locked-down Seattle as Delsin Rowe, who has recently discovered his superhuman power and isinFAMOUS Second Son is an action adventure game in which, surrounded by a society that fears them, superhumans are ruthlessly hunted down and caged by the Department of Unified Protection. Step into a locked-down Seattle as Delsin Rowe, who has recently discovered his superhuman power and is now capable of fighting back against the oppressive DUP. Enjoy your power as you choose how you will push your awesome abilities to the limit and witness the consequences of your actions as they affect the city and people around you. [Playstation]… Expand"}]