[{"name": "Power Rangers: Battle for the Grid", "details_link": "https://www.metacritic.com/game/switch/power-rangers-battle-for-the-grid", "publisher": "nWay", "release_date": "Mar 26 2019", "developers": ["nWay"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "Platformer", "Fighting", "2D"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/d2f8ef2a6db7be7b26c152bf921774ff-98.jpg", "descriptions": "A modern take on the 25-year franchise, showcasing an original story. Pit current and classic Rangers and villains against one another like never before in 3 vs. 3 tag battles. Test your skills online against friends and players from around the world for extra replayability."}, {"name": "The Spiderwick Chronicles", "details_link": "https://www.metacritic.com/game/wii/the-spiderwick-chronicles", "publisher": "Sierra Entertainment", "release_date": "Feb  5 2008", "developers": ["Stormfront Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/92f549793025c3437126d71fc062de80-98.jpg", "descriptions": "The Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon andThe Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon and Mallory Grace, putting gamers in their shoes as they discover a hidden world of fantastical creatures - sprites, ogres, goblins, brownies and more. [Sierra Entertainment]… Expand"}, {"name": "Trinity Universe", "details_link": "https://www.metacritic.com/game/playstation-3/trinity-universe", "publisher": "NIS America", "release_date": "Jun 29 2010", "developers": ["Gust", "Idea Factory"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 62, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/ad0d663cdd7fbbce8fd5ba9af7a7c1a4-98.jpg", "descriptions": "The Demon Dog King Kanata and Valkyrie Rizelea are both searching for their own solution about how to resolve the issue of drifting space debris appearing in the Netheruniverse. Explore the space debris, send them out of orbit, protect the Netheruniverse from destruction, and solve why theThe Demon Dog King Kanata and Valkyrie Rizelea are both searching for their own solution about how to resolve the issue of drifting space debris appearing in the Netheruniverse. Explore the space debris, send them out of orbit, protect the Netheruniverse from destruction, and solve why the universe's discarded items come to the land tucked away in the Netheruniverse: Empyria. [NIS America]… Expand"}, {"name": "Gunpey", "details_link": "https://www.metacritic.com/game/psp/gunpey", "publisher": "Namco Bandai Games", "release_date": "Nov 17 2006", "developers": ["Q Entertainment"], "platforms": "PSP", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 62, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/dd8d577f087703b4604afd0094cf7a82-98.jpg", "descriptions": "With Q Entertainment's tradition for visual style and original music, Gunpey offers a unique puzzle experience. As lines of various angles climb up the screen, the player's objective is to flip the lines, located in squares, to connect them over five columns.  Connecting lines from left toWith Q Entertainment's tradition for visual style and original music, Gunpey offers a unique puzzle experience. As lines of various angles climb up the screen, the player's objective is to flip the lines, located in squares, to connect them over five columns.  Connecting lines from left to right remove the connected row. If an incomplete line reaches the top of the screen, the game is over. Features 40 varied backgrounds and stylized music and two-player multiplayer over wireless ad-hoc connectivity. [Namco Bandai Games]… Expand"}, {"name": "Redemption Reapers", "details_link": "https://www.metacritic.com/game/pc/redemption-reapers", "publisher": "Binary Haze Interactive", "release_date": "Feb 22 2023", "developers": ["Adglobe"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/525e6f1f17d01036fbe1ae4cbc2a1029-98.jpg", "descriptions": "Descending suddenly on the world, the macabre Mort armies destroy nation after nation, leaving humanity decimated in their wake. Among the forces resisting the Mort is a small band of mercenaries known as the Ashen Hawk Brigade.Redemption Reapers is a dark fantasy simulation game set in aDescending suddenly on the world, the macabre Mort armies destroy nation after nation, leaving humanity decimated in their wake. Among the forces resisting the Mort is a small band of mercenaries known as the Ashen Hawk Brigade.Redemption Reapers is a dark fantasy simulation game set in a medieval world. Be immersed in the tale of the desperate struggle between the Ashen Hawk Brigade and the terrifying Mort legions.With despair looming as the menacing Mort horde marches ever closer, help your small resistance defeat the enemy masses by bringing together a rich variety of character builds and a meticulous strategy. Experience the exhilaration as you rise up to overcome the odds and achieve victory!… Expand"}, {"name": "CrossFire: Legion", "details_link": "https://www.metacritic.com/game/pc/crossfire-legion", "publisher": "Prime Matter", "release_date": "Dec  8 2022", "developers": ["Blackbird Interactive"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Tactics", "Command"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/8272f263fe9c49c727f318763779ff8f-98.jpg", "descriptions": "The world is in conflict. Black List and Global Risk are in a perpetual fight for the domination of their ideologies; but all is shaken up with the arrival of a new faction on the battlefield.Crossfire: Legion is a real time strategy game featuring tactical action in furious battles acrossThe world is in conflict. Black List and Global Risk are in a perpetual fight for the domination of their ideologies; but all is shaken up with the arrival of a new faction on the battlefield.Crossfire: Legion is a real time strategy game featuring tactical action in furious battles across a shattered version of the near future. Raise and customize your army to engage in intense online combat and carve your own path as you rise through the ranks.Whether you are looking for a highly competitive experience or prefer a slightly more relaxed approach, Crossfire: Legion has something in store for you.Prove your abilities in the online versus modes as you manage resources, consolidate a base and send your army to annihilate the enemies.Prepare yourself, on the field of battle, hesitation is your worst enemy.… Expand"}, {"name": "Haunted Dungeons: Hyakki Castle", "details_link": "https://www.metacritic.com/game/switch/haunted-dungeons-hyakki-castle", "publisher": "Happinet", "release_date": "Aug 30 2018", "developers": ["Asakusa Studios"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 62, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/867b70f4377cd13edf28619a4707ed26-98.jpg", "descriptions": null}, {"name": "The Little Acre", "details_link": "https://www.metacritic.com/game/pc/the-little-acre", "publisher": "Curve Digital", "release_date": "Dec 13 2016", "developers": ["Pewter Games Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Point-and-Click", "Linear"], "meta_score": 62, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/dab6901bd24ebc940025bdd91f761cd4-98.jpg", "descriptions": "The Little Acre is the story of Aidan and his daughter, Lily, set in 1950’s Ireland. After discovering clues as to the whereabouts of his missing father, Aidan begins investigating until he inadvertently finds himself transported to a strange new world."}, {"name": "Back to Bed", "details_link": "https://www.metacritic.com/game/playstation-4/back-to-bed", "publisher": "LOOT Entertainment", "release_date": "Aug 25 2015", "developers": ["Bedtime Digital Games", "LOOT Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 62, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/a4657a4873e39bba00ae28a842956b7f-98.jpg", "descriptions": "Bob the sleepwalker has a habit of always falling asleep in hazardous places. Luckily for Bob, his subconscious protector, Subob, is always ready to save him. Now the challenge for Subob is to guide Bob to safety, across rooftops, avoiding falls, and around dangerous creatures from theBob the sleepwalker has a habit of always falling asleep in hazardous places. Luckily for Bob, his subconscious protector, Subob, is always ready to save him. Now the challenge for Subob is to guide Bob to safety, across rooftops, avoiding falls, and around dangerous creatures from the nightmares of Bob.… Expand"}, {"name": "Breach & Clear: Deadline", "details_link": "https://www.metacritic.com/game/pc/breach-clear-deadline", "publisher": "Devolver Digital", "release_date": "Jul 20 2015", "developers": ["Mighty Rabbit Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 62, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/114638f62f4dd861ff8b4c772e15f296-98.jpg", "descriptions": "A deadly new breed of human monster is on the rise, and it’s up to players to stop the infestation before it spreads. Breach & Clear: DEADline is the all-new follow up to Breach & Clear, the critically acclaimed and commercially successful hybrid tactical strategy game."}, {"name": "Color Guardians", "details_link": "https://www.metacritic.com/game/playstation-4/color-guardians", "publisher": "Fair Play Labs", "release_date": "May 12 2015", "developers": ["Fair Play Labs"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Platformer", "3D"], "meta_score": 62, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/43581af4ca6cd65be65c1f14cbd10bdd-98.jpg", "descriptions": "Despite its colorful veneer, Color Guardians is a challenging platformer that requires skill, dexterity, and good memory. Easy to learn and quite impossible to master, the game challenges players to quickly negotiate an onslaught of obstacles while shifting between different guardians. It'sDespite its colorful veneer, Color Guardians is a challenging platformer that requires skill, dexterity, and good memory. Easy to learn and quite impossible to master, the game challenges players to quickly negotiate an onslaught of obstacles while shifting between different guardians. It's multi-tasking madness. [Fair Play Labs]… Expand"}, {"name": "Conception II: Children of the Seven Stars", "details_link": "https://www.metacritic.com/game/3ds/conception-ii-children-of-the-seven-stars", "publisher": "Atlus", "release_date": "Apr 15 2014", "developers": ["Spike", "Spike Chunsoft"], "platforms": ["PC", "PlayStation Vita", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Japanese-Style"], "meta_score": 62, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/4c75682bf0038ac3919255e2c02997f0-98.jpg", "descriptions": "Monsters have invaded the world of Aterra, and only a few special individuals, imbued with the power of the Star God, are equipped to fight it. With only a small group of warriors and a narrow window of time in which their powers are at their peak, the solution is clear: combine your StarMonsters have invaded the world of Aterra, and only a few special individuals, imbued with the power of the Star God, are equipped to fight it. With only a small group of warriors and a narrow window of time in which their powers are at their peak, the solution is clear: combine your Star power to make magical Star Children to boost up your forces in battle. The life of a student can be complicated when youre exploring dungeons, fighting monsters, AND trying to maintain a high school lifestyle. Learn to balance your activities because the deeper the bond you have with your classmates, the stronger the Star Children youll make! In this stimulating JRPG, youll be able to create bonds with 7 different female Disciples and create 24 classes of Star Children, so you must learn how to create the perfect Star Children for any situation. In no time, youll have dozens of powerful kids with different skills that can take on everything the monsters throw at you.\r -Combine Star power to make magical Star Children\r-Create bonds with 7 different female Disciples\r-Save Aterra, venture through dungeons & defeat monsters… Expand"}, {"name": "Bakugan: Defenders of the Core", "details_link": "https://www.metacritic.com/game/xbox-360/bakugan-defenders-of-the-core", "publisher": "Activision", "release_date": "Oct 26 2010", "developers": ["Now Production"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/00941336c40bd89c4d814d85dae45713-98.jpg", "descriptions": "In Bakugan Battle Brawlers: Defenders of the Core, players will create a new hero and lead the brawlers on an epic adventure to save Earth's cities from Spectra and his Vexos minions. Players will discover a whole new aspect of Bakugan by being given complete control over their creaturesIn Bakugan Battle Brawlers: Defenders of the Core, players will create a new hero and lead the brawlers on an epic adventure to save Earth's cities from Spectra and his Vexos minions. Players will discover a whole new aspect of Bakugan by being given complete control over their creatures when taking on their opponents as Bakugan transform from small balls into towering creatures. In the midst of intense battles, players will find themselves bravely exploring dangerous and dark areas to stop the evil spirits that are sucking the life force from the world. Players will unlock all-new levels and characters as they unearth hidden clues and defeat opponents in the quest to save the world from ultimate destruction. Bakugan Battle Brawlers: Defenders of the Core also features split-screen multiplayer action in three different game modes in the console versions, and linked multiplayer on Nintendo DS and PSP system. Coupled with real-time battle gameplay, this will be the first time that players can duke it out with their Bakugan in head-to-head duels, free for all, and strategic destruction battles.… Expand"}, {"name": "Spider-Man: Friend or Foe", "details_link": "https://www.metacritic.com/game/playstation-2/spider-man-friend-or-foe", "publisher": "Activision", "release_date": "Oct  2 2007", "developers": ["Next Level Games"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 62, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/3197398c59fcd829825e14d8acab29e0-98.jpg", "descriptions": "Spider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and oneSpider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and one of numerous Super Hero or Super Villain sidekicks, as they master unique fighting moves and styles while switching between characters to execute team combos and defeat foes. Spider-Man: Friend or Foe features a unique co-op mode in which a friend can join the game at any time and take control of Spidey’s sidekick as they battle through the game side-by-side and replay favorite levels. [Activision]… Expand"}, {"name": "Mysterious Journey II", "details_link": "https://www.metacritic.com/game/pc/mysterious-journey-ii", "publisher": "The Adventure Company", "release_date": "Nov 25 2003", "developers": ["Detalion"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 62, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/a8cc0031674b80aff7c361539d049bd4-98.jpg", "descriptions": "Initially believing that you alone have escaped a destructive war that  destroyed  your entire race ,  you soon discover a hidden region left untouched by conflict. Further exploration reveals a thriving civilization locked in struggle and the desolate world which surrounds their livingInitially believing that you alone have escaped a destructive war that  destroyed  your entire race ,  you soon discover a hidden region left untouched by conflict. Further exploration reveals a thriving civilization locked in struggle and the desolate world which surrounds their living oasis. It is here that you will discover what remain s  of a stunningly beautiful world full of hidden secrets, exotic beauty and treacherous loyalties.  Explore this world further and you will soon uncover the many myster ies  that lie waiting to be unravelled. Embrace this new challenge and allow your trained instincts  and  ingenuity to help you  reveal the  secrets of this mysterious journey. You alone must unlock the mysteries that hold the key to the rebirth of an entire civilization before it is lost forever. [Adventure Company]… Expand"}, {"name": "The Hobbit", "details_link": "https://www.metacritic.com/game/pc/the-hobbit", "publisher": "Sierra Entertainment", "release_date": "Nov 10 2003", "developers": ["Inevitable Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 62, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/c1ae3ac2cadc646c2dec9b5f25454513-98.jpg", "descriptions": "Set in the mythical world of Middle-earth, The Hobbit is an action adventure game in which the player assumes the role of Bilbo Baggins. Control Bilbo from his peaceful Hobbit hole in Hobbiton into the dark and harrowing Mirkwood forest and finally to the Lonely Mountain, in which lies SmaugSet in the mythical world of Middle-earth, The Hobbit is an action adventure game in which the player assumes the role of Bilbo Baggins. Control Bilbo from his peaceful Hobbit hole in Hobbiton into the dark and harrowing Mirkwood forest and finally to the Lonely Mountain, in which lies Smaug the dragon. Sent on a journey by Gandalf the wizard along with Thorin the dwarf and his stout and sturdy cohorts, Bilbo will acquire items, knowledge, and in the case of a Hobbit, courage to help him complete the quest as he comes face to face with elves, trolls, orcs, spiders, wolves, and more. [Sierra]… Expand"}, {"name": "Dragon's Lair 3D: Return to the Lair", "details_link": "https://www.metacritic.com/game/pc/dragons-lair-3d-return-to-the-lair", "publisher": "Ubisoft", "release_date": "Nov 18 2002", "developers": ["Dragonstone", "Dragonstone Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Linear", "3D", "3D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/567d67231956512235b79ef7f6d134da-98.jpg", "descriptions": "Guide Dirk the Daring, the valiant but clumsy knight whose bravery is famed throughout the land. You'll fight your way through the castle's treacherous, labyrinthine-like halls, and overcome new monsters and obstacles lurking in the shadows. Dragon's Lair 3D resurrects the popular charactersGuide Dirk the Daring, the valiant but clumsy knight whose bravery is famed throughout the land. You'll fight your way through the castle's treacherous, labyrinthine-like halls, and overcome new monsters and obstacles lurking in the shadows. Dragon's Lair 3D resurrects the popular characters and creatures featured in the original Dragon's Lair, and as a special bonus, new characters in Dragon's Lair 3D are being designed directly by legendary animator Don Bluth. [Ubi Soft]… Expand"}, {"name": "WWE SmackDown vs. Raw 2008", "details_link": "https://www.metacritic.com/game/ds/wwe-smackdown-vs-raw-2008", "publisher": "THQ", "release_date": "Nov 13 2007", "developers": ["Amaze Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/7ab8036cc92c087c7a88a05933e31f0d-98.jpg", "descriptions": "WWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and naturalWWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and natural control over their WWE Superstars by using the game's popular analog controls. Realism and strategy are at the forefront, as players now control the amount of pressure they apply to their opponents. In addition, WWE SmackDown! vs. Raw 2008 features a significant Extreme Championship Wrestling (ECW) presence, including a variety of Superstars, arenas and weapons. The game is also packed with significant updates requested by fans, including new rosters, more environmental hotspots, a combined Season and General Manager Mode experience, improved out-of-ring action, enhanced online community support and much more. The Nintendo DS version of the video game offers a unique game play experience, including touch screen control over Superstars, situation-based fighting with unique holds and a full year of nonstop action in WWE Season Mode. [THQ]… Expand"}, {"name": "Forza Horizon 2 Presents Fast & Furious", "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-2-presents-fast-furious", "publisher": "Microsoft Game Studios", "release_date": "Mar 27 2015", "developers": ["Playground Games"], "platforms": ["Xbox 360", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/4bfed592ccf0e043b35bd3a185233400-98.jpg", "descriptions": "For the first time , the Forza experience is combining with the Fast & Furious movie franchise to create an original expansion pack adventure filled with high-speed automotive action."}, {"name": "Sphinx and the Cursed Mummy", "details_link": "https://www.metacritic.com/game/switch/sphinx-and-the-cursed-mummy", "publisher": "THQ Nordic", "release_date": "Jan 29 2019", "developers": ["Eurocom"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/08013930b6681c532d356e3ae481d076-98.jpg", "descriptions": "Ancient Egyptian mythology comes to life in the Sphinx and the Cursed Mummy. You play the role of Sphinx, a headstrong demigod who travels the world via portals to foil the evil plans of Set. Equipped with a magical sword and a blowpipe, you'll need all your wits, agility, and special powersAncient Egyptian mythology comes to life in the Sphinx and the Cursed Mummy. You play the role of Sphinx, a headstrong demigod who travels the world via portals to foil the evil plans of Set. Equipped with a magical sword and a blowpipe, you'll need all your wits, agility, and special powers to overcome powerful enemies. When being inconspicuous is the only solution, control Sphinx's reluctant hero friend, The Mummy. By finding the stolen magical crowns of Egypt, Sphinx can stop Set and save the world.… Expand"}, {"name": "Athens 2004", "details_link": "https://www.metacritic.com/game/playstation-2/athens-2004", "publisher": "SCEA", "release_date": "Jul 14 2004", "developers": ["Eurocom Entertainment Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/191ac9013bf32d768c19050ee7865a38-98.jpg", "descriptions": "Athens 2004, The Official Videogame of the Olympic Games, celebrates the diversity of the Olympic Games by delivering a wide variety of Olympic sports. Aquatics includes the Swimming discipline featuring 100m Backstroke, 100m Breaststroke, 100m Butterfly and 100m Freestyle events. AthleticsAthens 2004, The Official Videogame of the Olympic Games, celebrates the diversity of the Olympic Games by delivering a wide variety of Olympic sports. Aquatics includes the Swimming discipline featuring 100m Backstroke, 100m Breaststroke, 100m Butterfly and 100m Freestyle events. Athletics includes Track and Field areas (including High Jump, Long Jump, Triple Jump, Discus Throw, Javelin Throw, Pole Vault, Shot Put, 100m, 200m, 400m, 800m, 1500m, 100m Hurdles and 110m Hurdles events), as well as the Combined area (including Decathlon and Heptathlon). Gymnastics features the Artistic discipline including Floor Exercise, Rings and Vault events. Additional sports include Archery (Individual 70m event); Equestrian (Individual Mixed event for Jumping); Shooting (Skeet event); and Weightlifting (Clean & Jerk event). [SCEA]… Expand"}, {"name": "Nickelodeon Danny Phantom: Urban Jungle", "details_link": "https://www.metacritic.com/game/ds/nickelodeon-danny-phantom-urban-jungle", "publisher": "THQ", "release_date": "Sep 19 2006", "developers": ["Altron"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/77625a125f685c744786fceeb9a28763-98.jpg", "descriptions": "A powerful new eco-ghost has turned Amity Park into a real urban jungle. Danny Phantom must battle his way through the twisted thorns and monstrous vegetation and learn an all new-freeze power to defeat this evil nemesis. Soar through ghostly 3-D worlds attacking all new enemies in frenziedA powerful new eco-ghost has turned Amity Park into a real urban jungle. Danny Phantom must battle his way through the twisted thorns and monstrous vegetation and learn an all new-freeze power to defeat this evil nemesis. Soar through ghostly 3-D worlds attacking all new enemies in frenzied shooter action. Travel to the Ghost Zone to learn Danny's new Freeze Power. Defeat new enemy Undergrowth as he tries to turn Amity Park into a nightmare of plants and vines. Pilot the Fenton Flier and Danny with new inventions from the Fenton lab. [THQ]… Expand"}, {"name": "F.E.A.R. Perseus Mandate", "details_link": "https://www.metacritic.com/game/pc/fear-perseus-mandate", "publisher": "Sierra Entertainment", "release_date": "Nov  6 2007", "developers": ["TimeGate Studios"], "platforms": "PC", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/87037d418a344c7cdcbaa9cff48c1676-98.jpg", "descriptions": "You are a member of a secondary F.E.A.R. team that is brought in to find more information regarding the secret project at Armacham. F.E.A.R. Perseus Mandate, an all-new stand-alone expansion pack, offers both seasoned gamers and those who have never played the original F.E.A.R. (FirstYou are a member of a secondary F.E.A.R. team that is brought in to find more information regarding the secret project at Armacham. F.E.A.R. Perseus Mandate, an all-new stand-alone expansion pack, offers both seasoned gamers and those who have never played the original F.E.A.R. (First Encounter Assault Recon) the ability to jump-in and experience the fright with a brand new team in an all-new experience. Uncover the mystery that surrounds Armacham and truth behind the Perseus project. Employ new weapons, including the Chain Lightning Gun, Grenade Launcher, and Advanced Rifle. Face off against a horrifying new enemy, the Nightcrawlers. [Sierra]… Expand"}, {"name": "Rory McIlroy PGA Tour", "details_link": "https://www.metacritic.com/game/playstation-4/rory-mcilroy-pga-tour", "publisher": "EA Sports", "release_date": "Jul 14 2015", "developers": ["EA Tiburon"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Traditional", "Sports", "Individual", "Golf", "Sim"], "meta_score": 61, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/5/a3b1872bbda44e08660ebd4e748e78b1-98.jpg", "descriptions": "Gameplay offers multiple ways to play, including arcade controls where the left stick is used to control power and accuracy, with the ability to add spin to the shot while the ball is in the air. In addition to the arcade controls, the return of 3-Click swings appeals to nostalgic gamers whoGameplay offers multiple ways to play, including arcade controls where the left stick is used to control power and accuracy, with the ability to add spin to the shot while the ball is in the air. In addition to the arcade controls, the return of 3-Click swings appeals to nostalgic gamers who prefer to set power and accuracy by tapping a button rather than moving a thumbstick. Those looking for an extra challenge can turn on Tour settings. When playing with Tour controls, the length of your backswing and speed of your follow through determine power, while the club path through the ball will be the most important factor in accounting for accuracy. Fans can also mix and match all three settings to create their own custom gameplay style. Courses themselves also affect how your shots are played, as firmer, links-style courses like St. Andrews provides more bounce and roll, while softer courses such as TPC Sawgrass have less bounce and be more receptive to spin. [EA Sports]… Expand"}, {"name": "99Vidas", "details_link": "https://www.metacritic.com/game/playstation-4/99vidas", "publisher": "QUByte Interactive", "release_date": "Jul 18 2017", "developers": ["QUByte Interactive"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/3f716c5588e258041b1b370ba7627504-98.jpg", "descriptions": "99Vidas is a brawler set in a contemporary world that pays tribute to both classic and new games in the industry. Brought to you in 16-bit pixelated glory, chock-full of references to not only gaming but also 80’s and 90’s pop culture."}, {"name": "Blacklight: Tango Down", "details_link": "https://www.metacritic.com/game/xbox-360/blacklight-tango-down", "publisher": "Ignition Entertainment", "release_date": "Jul  7 2010", "developers": ["Zombie Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/1bd5f75ea92c8af8dbd9a8bc376a2946-98.jpg", "descriptions": "[Xbox Live Arcade]   Participate in the “NetWar”: a hyper-realistic battlefield letting you fight tomorrow’s conflicts with or against your friends in the gritty Blacklight universe. Customize your character and weaponry from among thousands of combinations to become the soldier you always[Xbox Live Arcade]   Participate in the “NetWar”: a hyper-realistic battlefield letting you fight tomorrow’s conflicts with or against your friends in the gritty Blacklight universe. Customize your character and weaponry from among thousands of combinations to become the soldier you always wanted to be.… Expand"}, {"name": "Breach (2011)", "details_link": "https://www.metacritic.com/game/pc/breach-2011", "publisher": "Atomic Games", "release_date": "Jan 26 2011", "developers": ["Atomic Games"], "platforms": ["Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 61, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/4ee9e11004e180d59bc076eb67fefd82-98.jpg", "descriptions": "Breach is a multiplayer first-person shooter based on a CIA Special Activities Division."}, {"name": "Vigor", "details_link": "https://www.metacritic.com/game/xbox-one/vigor", "publisher": "Bohemia Interactive", "release_date": "Jul 31 2018", "developers": ["Bohemia Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/4cf1ded7e0b9e7c84df5d34ce43370ee-98.jpg", "descriptions": "1991. The nuclear war is over. Central Europe is devastated, Norway has become the last stand. You start as a nameless outlander, but who will you become? No time for uncertainty. Turn a shelter into your home. Fight, run or hide. Take risks, claim rewards, and survive this cut-throat experience."}, {"name": "Lost Planet 3", "details_link": "https://www.metacritic.com/game/playstation-3/lost-planet-3", "publisher": "Capcom", "release_date": "Aug 27 2013", "developers": ["Spark Unlimited"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/8fac72b55203ea27300b3e08392da857-98.jpg", "descriptions": "Lost Planet 3 is the third entry in the Lost Planet franchise. With numerous multiplayer modes and a cinematic single player experience, Lost Planet 3 delves deeper into the Lost Planet universe, uncovering hidden truths within the unique environment of E.D.N. III."}, {"name": "Dying Light 2 Stay Human: Bloody Ties", "details_link": "https://www.metacritic.com/game/playstation-5/dying-light-2-stay-human-bloody-ties", "publisher": "Techland", "release_date": "Nov 10 2022", "developers": ["Techland"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/36a9ab9df7a4ce0bb5490b7b42fa1d97-98.jpg", "descriptions": "The Nightrunners were a sign of better things to come. Unfortunately, all good things eventually come to an end, but for you, this is only the beginning. Get ready for the release of Chapter 1: In the Footsteps of a Nightrunner, the biggest free content update since the release. Get readyThe Nightrunners were a sign of better things to come. Unfortunately, all good things eventually come to an end, but for you, this is only the beginning. Get ready for the release of Chapter 1: In the Footsteps of a Nightrunner, the biggest free content update since the release. Get ready to meet Harper, a Nightrunner of old. Help him in his efforts to combat the Special Infected that are endangering the people of Villedor.… Expand"}, {"name": "Monster Rancher 1 & 2 DX", "details_link": "https://www.metacritic.com/game/pc/monster-rancher-1-2-dx", "publisher": "Koei Tecmo Games", "release_date": "Dec  8 2021", "developers": ["Koei Tecmo Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 61, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/3/af393395622c307598613f41b99327a5-98.jpg", "descriptions": "Enjoy “Monster Rancher” and “Monster Rancher 2” to the fullest!\r20 years since their release, the legendary monster training games “Monster Rancher” and “Monster Rancher 2”\rare bringing back the exciting days of growing, training, and competing with your unique monsters!\r\n\"Will you growEnjoy “Monster Rancher” and “Monster Rancher 2” to the fullest!\r20 years since their release, the legendary monster training games “Monster Rancher” and “Monster Rancher 2”\rare bringing back the exciting days of growing, training, and competing with your unique monsters!\r\"Will you grow your strongest monsters by doting on them or by developing an intense training regime? Find your own style among endless possibilities! \"\r [“Monster Rancher” and “Monster Rancher 2” Features]\r● Raise, train, and battle just like in the original!\rYou can acquire, train, and battle with all kinds of monsters just like in the original “Monster Rancher” games.\rIn addition, you can take advantage of the online features to both acquire new monsters and compete online. … Expand"}, {"name": "The Park", "details_link": "https://www.metacritic.com/game/xbox-one/the-park", "publisher": "Funcom", "release_date": "May  3 2016", "developers": ["Funcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/3dbedbac612b57a098e9fb4e83580f76-98.jpg", "descriptions": "Lorraine is a single mother who has to locate her missing son, Callum, who has run into an amusement park called Atlantic Island Park just as it was closing for the day. Although she can occasionally hear him calling for her, she is unable to immediately locate him and she soon finds thatLorraine is a single mother who has to locate her missing son, Callum, who has run into an amusement park called Atlantic Island Park just as it was closing for the day. Although she can occasionally hear him calling for her, she is unable to immediately locate him and she soon finds that park has closed down despite her remaining inside. As she travels through the park calling for her son Callum, Lorraine begins to find notes and flyers that hint at the disturbing past of the park.… Expand"}, {"name": "Gunscape", "details_link": "https://www.metacritic.com/game/playstation-4/gunscape", "publisher": "Blowfish Studios", "release_date": "Mar  1 2016", "developers": ["Blowfish Studios"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 20 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 61, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/1edd79a6edd5538641b6a9789a8aa28e-98.jpg", "descriptions": "Create, play and share your own FPS experiences. Mash-up your favourite classics into something amazing!"}, {"name": "Sym", "details_link": "https://www.metacritic.com/game/pc/sym", "publisher": "Mastertronic", "release_date": "Oct 31 2013", "developers": ["Atrax Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Action", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/716b5e7225cb3389bd009ef86b980608-98.jpg", "descriptions": "A puzzle-platformer that explores social anxiety disorder. Play as Josh, a teenage boy trying to reconcile a maze of two contrasting worlds that coexist within the blank spaces of each other - his perception of reality, and the world he created to avoid his fears."}, {"name": "Conflict: Global Terror", "details_link": "https://www.metacritic.com/game/pc/conflict-global-terror", "publisher": "2K Games", "release_date": "Oct  3 2005", "developers": ["Pivotal Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/2478efb1f7e4edd1211e7055ac2c7091-98.jpg", "descriptions": "(Also know as \"Conflict: Global Storm\")  Bradley, Jones, Connors and Foley. The original heroes of \"Conflict: Desert Storm\" are back, this time having undergone intense training in counter-terrorism and counter-insurgency techniques, all added to their wealth of extensive battlefield and(Also know as \"Conflict: Global Storm\")  Bradley, Jones, Connors and Foley. The original heroes of \"Conflict: Desert Storm\" are back, this time having undergone intense training in counter-terrorism and counter-insurgency techniques, all added to their wealth of extensive battlefield and special ops experience. In ensuring the safety of the team Foley goes MIA and the team must enlist the help of sniper Carrie Sherman. As the missions become more deadly and the team start to uncover more of March 33’s plans, its clear they face the greatest challenge of their careers to date. [SCi Games]… Expand"}, {"name": "Cooking Mama: Cook Off", "details_link": "https://www.metacritic.com/game/wii/cooking-mama-cook-off", "publisher": "Majesco Games", "release_date": "Mar 20 2007", "developers": ["OfficeCreate"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "General", "General", "Virtual", "Career"], "meta_score": 61, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/14f853ce0e8fc8b12af91182e617090b-98.jpg", "descriptions": "Making special use of the Wii Remote, Cooking Mama: Cook Off is an entertaining blend of mashing, slicing, chopping and stirring as players create more than 300 real-world recipes from 10 different nations. New realistic graphics and real-time cooking effects lend authenticity to playerMaking special use of the Wii Remote, Cooking Mama: Cook Off is an entertaining blend of mashing, slicing, chopping and stirring as players create more than 300 real-world recipes from 10 different nations. New realistic graphics and real-time cooking effects lend authenticity to player creations and help budding chefs determine when food is overcooked. Best of all, Cooking Mama: Cook Off offers 2-player kitchen competitions to determine who can cook the best meal the fastest. [Majesco]… Expand"}, {"name": "Gal Metal", "details_link": "https://www.metacritic.com/game/switch/gal-metal", "publisher": "XSEED Games", "release_date": "Oct 30 2018", "developers": ["Now Production", "DMM GAMES"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/6b9c37e634e59f7883874342728440bc-98.jpg", "descriptions": "Take down alien invaders with the power of metal. One night while on his way home from school, a high school boy is abducted by the Octoids, an extraterrestrial species bent on revenge. The boy's soul is transplanted into a high school girl's body in a sinister experiment. Now sharing aTake down alien invaders with the power of metal. One night while on his way home from school, a high school boy is abducted by the Octoids, an extraterrestrial species bent on revenge. The boy's soul is transplanted into a high school girl's body in a sinister experiment. Now sharing a body, the duo must work together with her high school band, K.M.G. (Kichijoji Metal Girls) to defeat the aliens with their greatest weakness: metal.… Expand"}, {"name": "Dinosaur King", "details_link": "https://www.metacritic.com/game/ds/dinosaur-king", "publisher": "Sega", "release_date": "Sep 23 2008", "developers": ["Climax Entertainment"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Role-Playing", "Strategy", "General", "General", "General"], "meta_score": 61, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/9fa594ef1ccdadb447c3587cdb4a740d-98.jpg", "descriptions": "As Max or Rex, members of a dinosaur-hunting team called the D-Kids, excavate realistic dinosaur fossils from all over the world using the Touch Screen - you'll even blow off the dirt covering them using the DS microphone. Once you bring them to life in 3D with the amazing DinoShotAs Max or Rex, members of a dinosaur-hunting team called the D-Kids, excavate realistic dinosaur fossils from all over the world using the Touch Screen - you'll even blow off the dirt covering them using the DS microphone. Once you bring them to life in 3D with the amazing DinoShot invention, take your favorite beast into battle. Collect and trade over 100 unique species of dinosaurs as you journey to stop the evil Alpha Gang from using the mighty creatures to take over the world. With special moves and various battle strategies, you and a friend will have a blast competing head-to-head to find out who is the ultimate king of the dinosaurs! [Sega]… Expand"}, {"name": "Saints Row", "details_link": "https://www.metacritic.com/game/playstation-5/saints-row", "publisher": "Deep Silver", "release_date": "Aug 23 2022", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 61, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/3/64ea47b9f0e3a1f1435e4e323f06b449-98.jpg", "descriptions": "Developed by Deep Silver Volition, Saints Row is a complete reboot and features a brand new setting, brand new characters and a brand new tone, all refreshed for today’s gamer. Saints Row is set in Santo Ileso, a vibrant fictional city in the American Southwest and one of the most varied andDeveloped by Deep Silver Volition, Saints Row is a complete reboot and features a brand new setting, brand new characters and a brand new tone, all refreshed for today’s gamer. Saints Row is set in Santo Ileso, a vibrant fictional city in the American Southwest and one of the most varied and diverse city locations ever built for a Saints Row game. Three friends join you on your incredible journey to become self made. Neenah, the driver and mechanic with Los Panteros, Kevin who is a DJ and a member of The Idols, and Eli who came to Santo Ileso to make his fortune as an entrepreneur. You play as The Boss and get to decide who you want to be, while building your very own criminal empire. Along the way you must take on three brutal enemy factions who currently control Santo Ileso: Los Panteros are the muscle and the power, The Idols are motivated by fame and notoriety, and Marshall Defense Technologies are a private military conglomerate. Players will be able to enjoy seamless and untethered two-player co-op together, whether they’re playing on the PS4 or PS5.  In terms of PS5 specifics, we’re implementing features for next-generation consoles and can’t wait to divulge details closer to the launch of the game. … Expand"}, {"name": "WRC 8 FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/switch/wrc-8-fia-world-rally-championship", "publisher": "Bigben Interactive", "release_date": "Oct 31 2019", "developers": ["Kylotonn"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/aacac58b7cb5d9847e66f5b416d30fc3-98.jpg", "descriptions": "The most complete and authentic official WRC simulation yet. New physics for all surfaces, a completely redesigned career mode, dynamic weather conditions, 50 teams, 14 countries, 100 tracks, weekly challenges and an eSports mode."}, {"name": "Friday the 13th: The Game", "details_link": "https://www.metacritic.com/game/playstation-4/friday-the-13th-the-game", "publisher": "Gun Media", "release_date": "May 26 2017", "developers": ["IllFonic", "Gun Media"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/ed3c44a3680bf4918b1cfd82523867ce-98.jpg", "descriptions": "Friday the 13th: The Game is a third-person horror, survival game in which players assume the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the worldFriday the 13th: The Game is a third-person horror, survival game in which players assume the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the world tracks you down and brutally slaughters you. Friday the 13th: The Game will strive to give every single player the tools to survive, escape or even try to take down the man who cannot be killed. Each and every gameplay session will give you an entirely new chance to prove if you have what it takes not only to survive, but to best the most prolific killer in cinema history, a slasher with more kills than any of his rivals. Meanwhile, Jason will be given an array of abilities to track, hunt and kill his prey. Stalk from the shadows, scare your targets and kill them when the time is right in as brutal a fashion as you can imagine. Take control of the legendary killer that is Jason Voorhees and terrify those unfortunate enough to cross your path.… Expand"}, {"name": "Pure Chess", "details_link": "https://www.metacritic.com/game/wii-u/pure-chess", "publisher": "Ripstone", "release_date": "Mar 20 2014", "developers": ["VooFoo Studios"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board Games", "Board / Card Game"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/5de78dd4d51951050479ba5f2a5ff0e4-98.jpg", "descriptions": "Pure Chess puts other games in checkmate! Are you a Grandmaster in the making?Experience one of the oldest known boardgames on the advanced technology of today. With ultra-realistic and unparalleled beautiful visuals you can almost reach out and touch the pieces. Created under thePure Chess puts other games in checkmate! Are you a Grandmaster in the making?Experience one of the oldest known boardgames on the advanced technology of today. With ultra-realistic and unparalleled beautiful visuals you can almost reach out and touch the pieces. Created under the watchful eye of a fully-fledged Grandmaster; Pure Chess allows players to experience the traditional game like never before, showcasing gorgeous environments and unbelievably stunning chess sets.You can now play Pure Chess cross-platform with your friends!Learn the basics through step-by-step tutorials or challenge yourself to tournaments, with full control of skill level depending on how challenged you wish to be.  An art, a science, a social engagement, a means for a challenge – whether you’re a beginner, an avid player or an ultimate Grandmaster, it’s time to experience one of the oldest board games known to man, brought to life on the modern technology of today!Pure Chess is a game that can be played by everyone, at any age, but mastered by only a few. The question is... Are you a Grandmaster in the making? Your move!Pure Chess is currently best played on iPhone 4S and iPad 2 upwards.… Expand"}, {"name": "Rig'n'Roll", "details_link": "https://www.metacritic.com/game/pc/rignroll", "publisher": "Atari", "release_date": "Apr 16 2010", "developers": ["Softlab-NSK"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "Truck", "Automobile"], "meta_score": 61, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/21898ad4b8c7e27349268cdc74d7aeb1-98.jpg", "descriptions": "Players will step into the shoes of a young man in the year 2014 as he arrives in California to pursue his dreams of road domination and capture the Californian cargo transportation market. There are miles of highways to conquer and cities and towns to reach as he becomes the greatestPlayers will step into the shoes of a young man in the year 2014 as he arrives in California to pursue his dreams of road domination and capture the Californian cargo transportation market. There are miles of highways to conquer and cities and towns to reach as he becomes the greatest trucker on the highways. Rig'n'Roll is a sequel to the famous Hard Truck series. This time the game world is true-to-life. Gamers can race high-powered Semis along thousands miles of real Californian roads, visiting San-Francisco to San Diego, San Jose to Los Angeles. [1C Company]… Expand"}, {"name": "Star Wars Battlefront: Elite Squadron", "details_link": "https://www.metacritic.com/game/ds/star-wars-battlefront-elite-squadron", "publisher": "LucasArts", "release_date": "Nov  3 2009", "developers": ["n-Space"], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 61, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/108b0347c6d5ad8b6b531d8d0aeaaae9-98.jpg", "descriptions": "For the first time ever in the Star Wars Battlefront series, players can fight on multi-level battlefronts, on the ground and in space. Players can start the fight on foot, commandeer a vehicle to battle on the ground or dogfight in space, and land their craft and fight on capital starships.For the first time ever in the Star Wars Battlefront series, players can fight on multi-level battlefronts, on the ground and in space. Players can start the fight on foot, commandeer a vehicle to battle on the ground or dogfight in space, and land their craft and fight on capital starships. The battles waged on each front are all directly effected by the player's actions, creating a combat experience where every shot fired and every enemy defeated can affect the outcome of a battle on another front. Star Wars Battlefront: Elite Squadron features a deep and engrossing single player campaign that spans the entire Star Wars Saga - and beyond. Gamers assume the identity of X2, a clone trooper created from the DNA of a Jedi Master. Originally tasked with eliminating Jedi during Order 66, X2 decides to leave his blood-stained past behind and joins the Rebellion. X2 isn’t the only Force-sensitive clone, however. X1, his clone brother, chooses a much more sinister path, leading to a confrontation that could determine the fate of both the Empire and the Rebellion. Additionally, players have at their disposal massive amounts of pick-up and play action for seemingly endless replay value. The PSP provides the deepest customization options ever seen in a Star Wars Battlefront title, allowing players to personalize and build their character with more weapons and items than ever before, including the weapons characters carry into battle, the armor they wear on their backs, their species, gender, appearance and physical strengths. Players can also unlock hundreds of other items and bonuses to help even the odds. On Nintendo DS, players can experience a unique class-based gameplay experience that allows them to outfit their characters with pre-determined weapon armaments, including heavy weapons, blasters and even lightsabers. Star Wars Battlefront: Elite Squadron on the PSP supports 16-player multiplayer, complete with in-depth stat tracking, and intense 4-player skirmishes on Nintendo DS across a wide number of modes, including the all-new \"Heroes and Villains.\" Take up arms as some of the most iconic Star Wars characters, including Luke Skywalker, Darth Vader, Boba Fett, Kit Fisto, Darth Maul and other familiar faces from Star Wars Battlefront: Renegade Squadron and Star Wars: The Force Unleashed. And battle for the fate of the galaxy on some of the most memorable Star Wars planets of all time, including the forest-covered landscape of Endor, the frozen wastes of Hoth and even the mysterious Yavin 4. [LucasArts]… Expand"}, {"name": "MLB 2004", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-2004", "publisher": "SCEA", "release_date": "Mar 10 2003", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 61, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/8174fc6d48d8bea78c3ac87b457d9d10-98.jpg", "descriptions": "Take the bump with All New Pitching Controls and Total Control Pitching - an MLB exclusive that puts you on the pitcher?s mound with the ability to nibble away at the corners as you control every pitch type, location and velocity in an effort to force batters to hit your pitch. Every aspectTake the bump with All New Pitching Controls and Total Control Pitching - an MLB exclusive that puts you on the pitcher?s mound with the ability to nibble away at the corners as you control every pitch type, location and velocity in an effort to force batters to hit your pitch. Every aspect of A.I. in MLB 2004 has been created with consultation from more than 24 pros. Play a 10-year career with the Career Mode or a single season with Season Mode. Get into a home run show down with Home Run Derby. Take a rookie from Spring Training to the World Series with Spring Training Mode.… Expand"}, {"name": "Lego Soccer Mania", "details_link": "https://www.metacritic.com/game/playstation-2/lego-soccer-mania", "publisher": "Electronic Arts", "release_date": "Jun 17 2002", "developers": ["Silicon Dreams"], "platforms": "PlayStation 2", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 61, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/b25b2fe06d3c68fc0fbcdbc3ebfdc318-98.jpg", "descriptions": "In Soccer Mania, play soccer the way you want. Customise the craziest mini-figure soccer teams and challenge awesome opposition. Use amazing power-ups in hilarious matches across action-packed, themed LEGO environments. It's an adventure that takes you from the Arctic to the Wild West toIn Soccer Mania, play soccer the way you want. Customise the craziest mini-figure soccer teams and challenge awesome opposition. Use amazing power-ups in hilarious matches across action-packed, themed LEGO environments. It's an adventure that takes you from the Arctic to the Wild West to Mars. [Lego Media]… Expand"}, {"name": "Pinobee: Wings of Adventure", "details_link": "https://www.metacritic.com/game/game-boy-advance/pinobee-wings-of-adventure", "publisher": "Activision", "release_date": "May 30 2001", "developers": ["Artoon"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/61ce41f3be4727cf6e7ca21cf3439595-98.jpg", "descriptions": "If you're the type of person who likes to uncover every last little secret in a game, Pinobee might be worth checking out."}, {"name": "Europa Universalis: Crown of the North", "details_link": "https://www.metacritic.com/game/pc/europa-universalis-crown-of-the-north", "publisher": "Strategy First", "release_date": "Nov  9 2000", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/4bf5fafad270a85256a40de097a50545-98.jpg", "descriptions": "From the developers of the award-winning Europa Universalis I and II and Hearts of Iron, comes the all-new Europa Universalis Crown of the North. Crown of the North takes place in the years between 1275 and 1340 in a time where nobility and the church held all the power and Sweden was aboutFrom the developers of the award-winning Europa Universalis I and II and Hearts of Iron, comes the all-new Europa Universalis Crown of the North. Crown of the North takes place in the years between 1275 and 1340 in a time where nobility and the church held all the power and Sweden was about to launch into its only civil war. Play as Norway, Sweden or Denmark and plot to change the historical legacy of a region seldom explored. [Strategy First]… Expand"}, {"name": "007: The World is not Enough", "details_link": "https://www.metacritic.com/game/playstation/007-the-world-is-not-enough", "publisher": "Electronic Arts", "release_date": "Nov  6 2000", "developers": ["Black Ops Entertainment"], "platforms": "PlayStation", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/5ec41c80be543fe5c58066e230d3c7e3-98.jpg", "descriptions": "Experience the intensity of being the world's top secret agent. Equipped with a full arsenal of Q-Lab gadgets and weaponry, you must be suave and resourceful as you carry out action-packed missions based on the blockbuster movie."}, {"name": "Mission: Impossible", "details_link": "https://www.metacritic.com/game/nintendo-64/mission-impossible", "publisher": "Ocean", "release_date": "Jul 18 1998", "developers": ["Infogrames"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/4aaf1ae758b21c6d21ad599b4b3e9f47-98.jpg", "descriptions": "Prepare to enter into the most demanding and dangerous Mission Impossible ever. Your mission, should you decide to accept it, will be to guide your team through a spectacular series of authorized worldwide missions encompassing over 20 levels of gameplay. Razor-sharp reflexes, the ability toPrepare to enter into the most demanding and dangerous Mission Impossible ever. Your mission, should you decide to accept it, will be to guide your team through a spectacular series of authorized worldwide missions encompassing over 20 levels of gameplay. Razor-sharp reflexes, the ability to make quick decisions, strategic thinking and an extremely high level of accuracy will prove essential. As always, should you, or any member of IM Force be caught or killed, the Secretary will disavow any knowledge of your actions. As usual, Ethan Hunt will be your point man. This game will not self-destruct in five seconds, but you may...… Expand"}, {"name": "Magnetic: Cage Closed", "details_link": "https://www.metacritic.com/game/pc/magnetic-cage-closed", "publisher": "Gambitious", "release_date": "May 26 2015", "developers": ["Guru Games"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Adventure", "3D", "First-Person"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/c2de3951c03dc07badb21cb202cc5a22-98.jpg", "descriptions": "Magnetic: Cage Closed is a first person puzzle game in which the player manipulates magnetic forces to accomplish their goals. The mechanics are focused around a single tool: The Magnet Gun which allows you to create electromagnetic fields with either positive or negative charges."}, {"name": "The Grim Adventures of Billy & Mandy", "details_link": "https://www.metacritic.com/game/wii/the-grim-adventures-of-billy-mandy", "publisher": "Midway", "release_date": "Nov 16 2006", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "Fighting", "2D", "3D"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/036566dcc8957dfde875ff9913929959-98.jpg", "descriptions": "The Grim Adventures of Billy & Mandy videogame pits 15 characters from the popular television show against each other in a fighting/adventure game filled with mayhem and chaos. Whether players use Billy's gas attack or Mandy's deadly smile, all of the characters will feature individualThe Grim Adventures of Billy & Mandy videogame pits 15 characters from the popular television show against each other in a fighting/adventure game filled with mayhem and chaos. Whether players use Billy's gas attack or Mandy's deadly smile, all of the characters will feature individual abilities based on their personalities. Players will be able to smash objects, destroy environments and battle in 20 fully interactive environments from the show. In battle mode, up to four players can use a multitude of weapons in destructible arenas like the \"Desert of Doom\" and the \"Underworld\" to battle it out and be the last one standing. Players also have the option to play on their own or with a friend in mission mode, a series of 45 missions where players can unlock new weapons and characters like Hoss Delgado and Fred Fredburger. [Midway]… Expand"}, {"name": "Naruto to Boruto: Shinobi Striker", "details_link": "https://www.metacritic.com/game/playstation-4/naruto-to-boruto-shinobi-striker", "publisher": "Bandai Namco Games", "release_date": "Aug 31 2018", "developers": ["CyberConnect2", "Soleil", "Soleil Ltd."], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/2338fc6040cb860c363592f0c000dea0-98.jpg", "descriptions": "The Naruto franchise is back with a brand new experience in Naruto to Boruto: Shinobi Striker. This new game lets gamers battle as a team of 4 to compete against other teams online! Graphically, Shinobi Striker is also built from the ground up in a completely new graphic style. Lead yourThe Naruto franchise is back with a brand new experience in Naruto to Boruto: Shinobi Striker. This new game lets gamers battle as a team of 4 to compete against other teams online! Graphically, Shinobi Striker is also built from the ground up in a completely new graphic style. Lead your team and fight online to see who the best ninjas are!\r FEATURES:\r * 4 vs. 4 team based gameplay with 8 ninjas fighting simultaneously; play co-op with your friends to become the best ninjas online.\r * Enjoy a new graphic style with more vivid colors for characters, maps and ninjutsu.\r * Dynamic 3rd person ninja gameplay lets players take advantage of an arena environment with vertical running and jumping.\r * Features favorite Naruto characters and teams from the series including Naruto, Sasuke, and Team 7.… Expand"}, {"name": "Sonic Frontiers", "details_link": "https://www.metacritic.com/game/xbox-series-x/sonic-frontiers", "publisher": "Sega", "release_date": "Nov  8 2022", "developers": ["Sega", "Sonic Team"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World", "Action", "Platformer", "3D"], "meta_score": 61, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/ef58228014ffe6b0ff59ea0f52ecd24c-98.jpg", "descriptions": "Worlds collide in Sonic the Hedgehog's newest adventure. Accelerate to new heights and experience the thrill of high velocity open-zone freedom. Battle powerful enemies as you speed through the Starfall Islands - landscapes brimming with dense forests, overflowing waterfalls, sizzlingWorlds collide in Sonic the Hedgehog's newest adventure. Accelerate to new heights and experience the thrill of high velocity open-zone freedom. Battle powerful enemies as you speed through the Starfall Islands - landscapes brimming with dense forests, overflowing waterfalls, sizzling deserts and more.… Expand"}, {"name": "World of Warriors", "details_link": "https://www.metacritic.com/game/playstation-4/world-of-warriors", "publisher": "Sony Interactive Entertainment", "release_date": "Mar 21 2018", "developers": ["Mind Candy"], "platforms": ["iPhone/iPad", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Beat-'Em-Up", "3D"], "meta_score": 61, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/9/14de65140d84d5c06135bb9817809704-98.jpg", "descriptions": "Let Battle commence! Coming exclusively to PS4, World of Warriors lets you summon the greatest warriors in history to do battle across the Wildlands."}, {"name": "Blood Bowl", "details_link": "https://www.metacritic.com/game/psp/blood-bowl", "publisher": "SouthPeak Games", "release_date": "Apr 13 2010", "developers": ["Cyanide"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PSP"], "genres": ["Sports", "Alternative", "Team", "Individual", "Football", "Other", "Other", "Arcade"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/6efd117eb8f62b9b45b15292c41f88b5-98.jpg", "descriptions": "A brutal team sport unfolding in a parallel fantasy world based on Warhammer and American football, Blood Bowl invites gamers to form a team of players from races including: Orcs, Elves, Humans, Dwarfs and many other fantasy creatures, and launch themselves into battle in the bloodiest ofA brutal team sport unfolding in a parallel fantasy world based on Warhammer and American football, Blood Bowl invites gamers to form a team of players from races including: Orcs, Elves, Humans, Dwarfs and many other fantasy creatures, and launch themselves into battle in the bloodiest of arenas. This strategy sports game combines a fine balance of tactics and bone crunching action! The game offers two game modes. The first, which is fully real time, offers spectacular gameplay with intense battles between blocking linemen and daring displays of agility of players leaping and dodging through opponents tackle zones, while powerful spells and dirty trick special plays are unleashed across the field. All this creates a highly charged atmosphere. Of course, since it is sometimes difficult to keep an eye on the entire field at once, the game's interface offers different tactical and strategic setups, while the AI is responsible for managing the players on the field. The second game mode, an actual turn-based game, is a treat for players of the original board game because it is an exact replica of Games Workshop's tabletop masterpiece. The original rules have been faithfully reproduced, and it contains all of the devices, strategies, play and rhythm of the original game. [Focus Home Interactive]… Expand"}, {"name": "Disney/Pixar Up", "details_link": "https://www.metacritic.com/game/xbox-360/disneypixar-up", "publisher": "THQ", "release_date": "May 26 2009", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/66b505a288a1be1803071e14a92835b7-98.jpg", "descriptions": "The UP video game takes players on an exotic adventure with Carl Fredricksen and his young sidekick, Wilderness Explorer Russell, as they set off on a wild journey through the undiscovered jungles of South America. Players experience all four main characters from the movie - Carl, Russell,The UP video game takes players on an exotic adventure with Carl Fredricksen and his young sidekick, Wilderness Explorer Russell, as they set off on a wild journey through the undiscovered jungles of South America. Players experience all four main characters from the movie - Carl, Russell, Dug the lovable dog or Kevin the prehistoric bird - while playing as a single-player or with a friend cooperatively throughout the entire game. Players encounter exciting, new environments as they navigate through treacherous jungle terrains, battle dangerous creatures and trek the slippery slopes of the Amazonian Tepuis. In addition, the game also features multi-player game modes, including an epic level that will allow up to four players to compete in aerial combat. [THQ]… Expand"}, {"name": "Disney Hannah Montana: Music Jam", "details_link": "https://www.metacritic.com/game/ds/disney-hannah-montana-music-jam", "publisher": "Disney Interactive Studios", "release_date": "Oct 16 2007", "developers": ["Gorilla Games"], "platforms": "DS", "genres": ["Action", "General", "Rhythm", "General", "Music"], "meta_score": 61, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/e21f001c0c66eda6dd353dddb7cbdcfd-98.jpg", "descriptions": "In Music Jam, you play as either Miley Stewart or her alter ego, pop sensation Hannah Montana. As the game unfolds, you'll take on another rising pop singer, Savannah Star, in the music jam video contest. Add to that the problem of Miley's friends being stolen away by a popular new girl inIn Music Jam, you play as either Miley Stewart or her alter ego, pop sensation Hannah Montana. As the game unfolds, you'll take on another rising pop singer, Savannah Star, in the music jam video contest. Add to that the problem of Miley's friends being stolen away by a popular new girl in the school and, well, it seems like a girl's work is never done. To develop your musical skills in the game, Music Jam will let you actually play a variety of instruments--from lead or rhythm guitar to bass, and even drums. You'll use a slightly different approach for each instrument, but the common denominator is always the combination of the stylus and touch screen. When playing rhythm guitar to one of Hannah's songs, for example, you'll simply strum the strings of a virtual guitar by moving your stylus across them, changing chords as you go by pressing buttons on the directional pad.… Expand"}, {"name": "Heracles Chariot Racing", "details_link": "https://www.metacritic.com/game/wii/heracles-chariot-racing", "publisher": "Neko Entertainment", "release_date": "Jul  6 2009", "developers": ["Neko Entertainment"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Other", "Other"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/3accb51d7d7a1f91801bfe944284898b-98.jpg", "descriptions": "[WiiWare]  The famous Heracles has taken on a challenge like none he has ever faced. Our hero will have to beat his opponents in a race across mythological kingdoms and be the first to reach the top of Mount Olympus. You can play as Heracles and help him return the sacred trophy, or play as[WiiWare]  The famous Heracles has taken on a challenge like none he has ever faced. Our hero will have to beat his opponents in a race across mythological kingdoms and be the first to reach the top of Mount Olympus. You can play as Heracles and help him return the sacred trophy, or play as one of the other varied mythological characters from Satyr to Poseidon and claim the prize for yourself. Race through three racing cups across 10 courses set in five mythic landscapes. Use awesome fantasy weaponry to defeat your opponents: tridents, fireballs, Zeus's lightning rods and more. Get your friends together for intense two-to-four-player split-screen multiplayer action in Championship, Single Race or Battle mode. [Nintendo]… Expand"}, {"name": "Tharsis", "details_link": "https://www.metacritic.com/game/pc/tharsis", "publisher": "Choice Provisions", "release_date": "Jan 11 2016", "developers": ["Choice Provisions"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 61, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/b11f2620deeb067532432e27006cc541-98.jpg", "descriptions": "Tharsis is a turn-based strategy game about humanity’s first mission to Mars. It’s an important mission, and not just because of its potential to greatly increase our knowledge of the red planet. No, this mission is humanity’s attempt to locate the source of a mysterious signal emanatingTharsis is a turn-based strategy game about humanity’s first mission to Mars. It’s an important mission, and not just because of its potential to greatly increase our knowledge of the red planet. No, this mission is humanity’s attempt to locate the source of a mysterious signal emanating from the red planet. [Choice Provisions]… Expand"}, {"name": "WWI Tannenberg: Eastern Front", "details_link": "https://www.metacritic.com/game/playstation-4/wwi-tannenberg-eastern-front", "publisher": "Blackmill Games", "release_date": "Jul 24 2020", "developers": ["M2H"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 61, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/f342558d14846be14af87b25c89f5b90-98.jpg", "descriptions": "Experience authentic First World War action with 64 player battles of maneuver on the Eastern Front. Warfare between the Russian Empire and the Central Powers is a tense battle for dominance – stay close to your squad to survive!"}, {"name": "Dungeons 2", "details_link": "https://www.metacritic.com/game/playstation-4/dungeons-2", "publisher": "Kalypso", "release_date": "May 24 2016", "developers": ["Kalypso"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Strategy", "General"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/5644a7950e88b77fdb664ebdda9fa222-98.jpg", "descriptions": "Assume control of the powerful Dungeon Lord and build an array of unique and terrifying dungeons, recruit an army of scary creatures and command 2 new factions. Prepare to defend your Kingdom against those pesky heroes, go above ground to wage war on their human cities and use the Hand ofAssume control of the powerful Dungeon Lord and build an array of unique and terrifying dungeons, recruit an army of scary creatures and command 2 new factions. Prepare to defend your Kingdom against those pesky heroes, go above ground to wage war on their human cities and use the Hand of Terror' to take direct control over your minions, issue commands, and even dish out a swift slap to keep them in line.… Expand"}, {"name": "WE ARE DOOMED", "details_link": "https://www.metacritic.com/game/playstation-4/we-are-doomed", "publisher": "Vertex Pop", "release_date": "Apr 14 2015", "developers": ["Vertex Pop"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 61, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/d916bbb36b0c13a13c5bd2fd1afb8bb4-98.jpg", "descriptions": "We Are Doomed is a twin-stick shooter in which you zap polygon baddies with an absurdly overpowered laserbeam. The laserbeam can be charged into a SUPERBEAM, which goes all the way across the screen zapping everything it touches in short order. The game features a unique lo-fi aesthetic,We Are Doomed is a twin-stick shooter in which you zap polygon baddies with an absurdly overpowered laserbeam. The laserbeam can be charged into a SUPERBEAM, which goes all the way across the screen zapping everything it touches in short order. The game features a unique lo-fi aesthetic, with bold shapes, glitching geometry, and neon colours. [Vertex Pop]… Expand"}, {"name": "Sixty Second Shooter Prime", "details_link": "https://www.metacritic.com/game/xbox-one/sixty-second-shooter-prime", "publisher": "Happion Laboratories", "release_date": "Jun 18 2014", "developers": ["Happion Laboratories"], "platforms": "Xbox One", "genres": ["Action", "Shooter", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/2e24d58484ce8bd200806bb038e6d7a9-98.jpg", "descriptions": "Sixty Second Shooter Prime is a twin stick shooter with a sixty second time limit. Youll be surprised how fun that is. You have one minute  and one life!  with which to deal as much destruction as possible. The enemy hordes are relentless, so only the sharpest wits and the fastest reflexesSixty Second Shooter Prime is a twin stick shooter with a sixty second time limit. Youll be surprised how fun that is. You have one minute  and one life!  with which to deal as much destruction as possible. The enemy hordes are relentless, so only the sharpest wits and the fastest reflexes will prevail. Will you press your luck and fly to the deep levels where the truly treacherous foes await? The clock is always ticking in this fast-paced dual-stick shooter. But thankfully, our intrepid scientists at Happion Laboratories have developed all-new weapons to help you in those sixty seconds of hell. Use missiles to build a large chain bonus or lure your opponents into deadly remote-detonating bombs. With these tools at your disposal, you can develop all kinds of strategies to make that minute last a lifetime!… Expand"}, {"name": "Tom Clancy's Ghost Recon Advanced Warfighter 2", "details_link": "https://www.metacritic.com/game/psp/tom-clancys-ghost-recon-advanced-warfighter-2", "publisher": "Ubisoft", "release_date": "Aug 23 2007", "developers": ["High Voltage Software", "Ubisoft Paris"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 61, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/5e154190b9cccf245c803d9aaa0f78ab-98.jpg", "descriptions": "Tom Clancy's Ghost Recon Advanced Warfighter 2 builds off of the events in the first game and places gamers in control of the U.S. military's elite fighting unit, the Ghosts. In the year 2014, the rising conflict between Mexican loyalists and insurgent rebel forces has thrown Mexico intoTom Clancy's Ghost Recon Advanced Warfighter 2 builds off of the events in the first game and places gamers in control of the U.S. military's elite fighting unit, the Ghosts. In the year 2014, the rising conflict between Mexican loyalists and insurgent rebel forces has thrown Mexico into full-scale civil war. Under the command of Captain Scott Mitchell, the Ghosts are called upon to face an imminent threat to the United States. The fate of two countries now lies in the hands of the Ghosts as they fend off an attack on U.S. soil. Equipped with the most cutting-edge weaponry and technology, the Ghosts must battle on both sides of the border to neutralize the escalating rebel threat. The Ghosts will battle enemies in mountain terrains, barren deserts and even on their home turf in El Paso, Texas. Each environment presents its own benefits and challenges and will call for fresh tactical approaches. Vastly Improved Artificial Intelligence (AI): Watch your back as rebels send their own team members to flank your position or gain vantage points by utilizing vertical gameplay to pick you off from the rooftops above. Improved squad-mate AI will now feed you more of the information you need with descriptive commands. The revolutionary new Cross-Com 2.0 will give the player more information than ever before. You will be able to see what your friendly forces see in the top left display and the click of a button will expand that to full-screen view for a clearer and more precise picture. Command lethal air strikes with jet fighters, gain mobile cover for otherwise impassable situations and replenish armaments on the battlefield using an unmanned artillery MULE. Players can now heal their team on the battlefield, including squad leader Scott Mitchell, with an all-new Medic class of soldier. [Ubisoft]… Expand"}, {"name": "Rayman 3D", "details_link": "https://www.metacritic.com/game/3ds/rayman-3d", "publisher": "Ubisoft", "release_date": "Mar 22 2011", "developers": ["Ubisoft Casablanca"], "platforms": ["iPhone/iPad", "PC", "3DS"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/48ccdddb29d77b71713f3099d119d05e-98.jpg", "descriptions": "One of the most popular franchises of all time lands on Nintendo 3DS with an outstanding platform experience that will take advantage of the Nintendo 3DS specifications with impressive graphics, stunning 3D effects and full use of the Circle Pad. An adaptation of the acclaimed Rayman 2One of the most popular franchises of all time lands on Nintendo 3DS with an outstanding platform experience that will take advantage of the Nintendo 3DS specifications with impressive graphics, stunning 3D effects and full use of the Circle Pad. An adaptation of the acclaimed Rayman 2 original game on Dreamcast, Rayman 3D will feature major updates on key game play elements such as accessibility, progression and learning curve.… Expand"}, {"name": "Arcade Classics Anniversary Collection", "details_link": "https://www.metacritic.com/game/switch/arcade-classics-anniversary-collection", "publisher": "Konami", "release_date": "Apr 18 2019", "developers": ["Konami"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 61, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/e55f515c01effbd3bf46126d6aea000f-98.jpg", "descriptions": "This collection includes 8 arcade masterpieces of the 80s, from Nemesis to Haunted Castle. Experience these KONAMI classics in all their retro glory, now enhanced with modern features."}, {"name": "The Lord of the Rings: War in the North", "details_link": "https://www.metacritic.com/game/xbox-360/the-lord-of-the-rings-war-in-the-north", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  1 2011", "developers": ["Snowblind Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/33581ec3cdae6d2ce8032266758d551f-98.jpg", "descriptions": "In The Lord of the Rings: War in the North, players can become the heroes in the great battle of the North as part of the epic War of the Ring. Exploring unseen lands, story elements and characters from Middle-earth as well as elements familiar from past feature films, gamers will experienceIn The Lord of the Rings: War in the North, players can become the heroes in the great battle of the North as part of the epic War of the Ring. Exploring unseen lands, story elements and characters from Middle-earth as well as elements familiar from past feature films, gamers will experience extensive character customization and development, expansive co-op gameplay options and upgradeable weapons, skills and special abilities.… Expand"}, {"name": "Harry Potter and the Order of the Phoenix", "details_link": "https://www.metacritic.com/game/playstation-2/harry-potter-and-the-order-of-the-phoenix", "publisher": "EA Games", "release_date": "Jun 25 2007", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 61, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/85ef81e99ed8c7962fbcc102885dd783-98.jpg", "descriptions": "In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster,In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster, Albus Dumbledore, is lying about Voldemort's return in order to undermine his power and take his job, the Minister for Magic, Cornelius Fudge, appoints a new Defense Against the Dark Arts teacher to keep watch over Dumbledore and the Hogwarts students. But Professor Dolores Umbridge's Ministry-approved course of defensive magic leaves the young wizards woefully unprepared to defend themselves against the dark forces threatening them and the entire wizarding community, so at the prompting of his friends Hermione and Ron, Harry takes matters into his own hands. Meeting secretly with a small group of students who name themselves \"Dumbledore’s Army,\" Harry teaches them how to defend themselves against the Dark Arts, preparing the courageous young wizards for the extraordinary battle that lies ahead. With the ability to play multiple characters, including Harry Potter, Dumbledore and Sirius Black, the videogame of Harry Potter and the Order of the Phoenix offers fans the opportunity to wield a wand, explore all around Hogwarts, and experience one of the most exciting and dangerous years in the life of the Boy Who Lived. [Electronic Arts / Warner Bros.]… Expand"}, {"name": "MX vs. ATV Alive", "details_link": "https://www.metacritic.com/game/playstation-3/mx-vs-atv-alive", "publisher": "THQ", "release_date": "May 10 2011", "developers": ["THQ Digital Studio Phoenix"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Rally / Offroad", "Motorcycle", "Other", "Motocross", "Motocross"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/3c14c546e1812048c0083654962e8495-98.jpg", "descriptions": "MX vs. ATV Alive is the newest title in this racing series."}, {"name": "Dynasty Warriors 5 Empires", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-5-empires", "publisher": "Koei", "release_date": "Mar 28 2006", "developers": ["Omega Force"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 61, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/98966f3daf97e60615625551672a131d-98.jpg", "descriptions": "In Dynasty Warriors 5 Empires, the armies of the kingdom are at your command. The player's ultimate goal is to conquer the 25 regions of Ancient China and build an entire Empire using cunning diplomacy and uncompromising force. Before each battle, the player will meet with the war council toIn Dynasty Warriors 5 Empires, the armies of the kingdom are at your command. The player's ultimate goal is to conquer the 25 regions of Ancient China and build an entire Empire using cunning diplomacy and uncompromising force. Before each battle, the player will meet with the war council to decide upon military and political policies for the kingdom, then it's time for war. The game gives armchair generals total control of their kingdom. Now, gamers can issue direct orders to each officer or signal general commands to officers on the field. Players will order when the army will take the offensive, defend their ground, or have all officers gather for an ambush. Gamers can also choose the officers for an attack force, entice captives into joining the kingdom's service and even expel officers from the kingdom. There's even greater authority over Government, Product Development, Diplomacy and Battle Tactics with the game's 25 new policies for a total of 75 in all. The game's imperial-sized action includes 4 scenarios to unlock, 2-Player Co-Op play in \"Empire\" and \"Free\" modes, new items to unlock, and control of over 200 officers! Once the dust has settled, there's the real history of Ancient China to discover in the game's detailed Encyclopedia. [KOEI]… Expand"}, {"name": "Friday the 13th: The Game", "details_link": "https://www.metacritic.com/game/pc/friday-the-13th-the-game", "publisher": "Gun Media", "release_date": "May 26 2017", "developers": ["IllFonic", "Gun Media"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 61, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/0bad1acc907da9616f20682aa13febc0-98.jpg", "descriptions": "Friday the 13th: The Game is a third-person horror, survival game in which players assume the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the worldFriday the 13th: The Game is a third-person horror, survival game in which players assume the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the world tracks you down and brutally slaughters you. Friday the 13th: The Game will strive to give every single player the tools to survive, escape or even try to take down the man who cannot be killed. Each and every gameplay session will give you an entirely new chance to prove if you have what it takes not only to survive, but to best the most prolific killer in cinema history, a slasher with more kills than any of his rivals. Meanwhile, Jason will be given an array of abilities to track, hunt and kill his prey. Stalk from the shadows, scare your targets and kill them when the time is right in as brutal a fashion as you can imagine. Take control of the legendary killer that is Jason Voorhees and terrify those unfortunate enough to cross your path.… Expand"}, {"name": "Lust from Beyond", "details_link": "https://www.metacritic.com/game/pc/lust-from-beyond", "publisher": "Movie Games S.A.", "release_date": "Mar 11 2021", "developers": ["Movie Games S.A.", "Movie Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/2e84bed2f9e64f9794b472d3fc5734a0-98.jpg", "descriptions": "A Victorian mansion. A cult worshipping an otherworldly erotic deity. Among all that - you. Explore a world inspired by the works of Lovecraft, Giger, and Beksiński. See for yourself that there are no limits to dark ecstasy."}, {"name": "Sword Art Online: Fatal Bullet", "details_link": "https://www.metacritic.com/game/pc/sword-art-online-fatal-bullet", "publisher": "Bandai Namco Games", "release_date": "Feb 23 2018", "developers": ["Dimps Corporation"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/919ab9615e3b094a3ec9f6d14b791561-98.jpg", "descriptions": "Your Choice is Heavier and Faster Than a Bullet. Become the hero of Gun Gale Online in the latest game of the SAO franchise in Sword Art Online: Fatal Bullet. Step into the versatile landscapes and environments of Gun Gale Online with unique and realistic designs resembling something out ofYour Choice is Heavier and Faster Than a Bullet. Become the hero of Gun Gale Online in the latest game of the SAO franchise in Sword Art Online: Fatal Bullet. Step into the versatile landscapes and environments of Gun Gale Online with unique and realistic designs resembling something out of a sci-fi movie and numerous other weapons and fighting styles to choose from. Interact with characters from the Sword Art Online original novels, anime and previous games as you navigate a world that is vastly personalized and visually enhanced. Play as the protagonist, battle against opponents using new weapons and further customize gameplay by creating skills and abilities. Full dive into Sword Art Online: Fatal Bullet!FEATURES:* Welcome to the World of Guns: Gun Gale Online from Sword Art Online II is visually enhanced and diverse with many landscapes to discover in an all new original story supervised by series creator, Reki Kawahara.* Unreal Visuals: Get lost in a lifelike world developed by Dimps with realistic and robust environments and textures made possible by Unreal Engine 4.* Friend or Foe: Challenge tough bosses that require friends in co-op or play against them in 4-on- 4 battles.* Realistic and Heroic Gun play: Plenty of one-of-a-kind and beautifully designed weapons to choose from and unique skills to create.* New to XBOX ONE: Sword Art Online will come to XBOX ONE and PS4 simultaneously for the first time in the history of the popular gaming series.… Expand"}, {"name": "WRC 3: FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/pc/wrc-3-fia-world-rally-championship", "publisher": "Plug In Digital", "release_date": "Apr 23 2013", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 3", "PlayStation Vita", "PC"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/c3301e3f93764bd4bead9f55e7a94d8a-98.jpg", "descriptions": "The game includes a revamped physics model allowing players to feel the same emotions of a driver racing a real WRC car. Although car behavior on track is really close to reality and gives experienced users a very satisfying feeling, WRC 3 offers a set of driving helps (Auto-Brake,The game includes a revamped physics model allowing players to feel the same emotions of a driver racing a real WRC car. Although car behavior on track is really close to reality and gives experienced users a very satisfying feeling, WRC 3 offers a set of driving helps (Auto-Brake, Auto-Transmission, Braking Assistance, Stability Help and Physical damage level) that allows beginners to perform a complete Special Stage and enjoy the game without too many difficulties. … Expand"}, {"name": "Shaun White Skateboarding", "details_link": "https://www.metacritic.com/game/playstation-3/shaun-white-skateboarding", "publisher": "Ubisoft", "release_date": "Oct 24 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Alternative", "Individual", "Other", "Other", "Skate / Skateboard"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/3d2ee8b3c4182c7477f6107d618113b5-98.jpg", "descriptions": "Shaun White Skateboarding, a game that puts an innovative twist on the action-sports genre, is the latest offering in the award-winning franchise developed in collaboration with dual-sport super-athlete, Shaun White. The most ambitious installment yet, Shaun White Skateboarding brings allShaun White Skateboarding, a game that puts an innovative twist on the action-sports genre, is the latest offering in the award-winning franchise developed in collaboration with dual-sport super-athlete, Shaun White. The most ambitious installment yet, Shaun White Skateboarding brings all the sensations of skateboarding to a wide audience making skate dreams possible and allowing players to transform a dull, lifeless city into their own extraordinary skating utopia.\r As players skate, they add color, life and brilliance to the city by extending handrails into endless grinds, carving alleys into half pipes, morphing streets into ramps and much more. Players can skate their way, any way they want, to create their own customized skating world that can also be shared with friends. Shaun White Skateboarding empowers skaters to push the limits of what’s possible.… Expand"}, {"name": "The Lord of the Rings: Conquest", "details_link": "https://www.metacritic.com/game/ds/the-lord-of-the-rings-conquest", "publisher": "Electronic Arts", "release_date": "Jan 13 2009", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/f07babf937d1484c3b63875d4908ccdd-98.jpg", "descriptions": "Set in The Lord of the Rings universe of J.R.R. Tolkien as depicted by the Academy Award-winning films, players will finally fight the entirety of these epic battles any way they want. In addition to crusading as the heroic forces of good, for the first time ever in a The Lord of the RingsSet in The Lord of the Rings universe of J.R.R. Tolkien as depicted by the Academy Award-winning films, players will finally fight the entirety of these epic battles any way they want. In addition to crusading as the heroic forces of good, for the first time ever in a The Lord of the Rings action title they'll conquer Middle-earth while playing as the legions of Saurons evil army, including Cave-trolls, Oliphaunts, the Balrog and Sauron himself. [Pandemic]… Expand"}, {"name": "Dokapon Kingdom", "details_link": "https://www.metacritic.com/game/playstation-2/dokapon-kingdom", "publisher": "Atlus Co.", "release_date": "Oct 14 2008", "developers": ["Sting"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Role-Playing", "General"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/19695acac2502c8cf5d714e0db2b52fd-98.jpg", "descriptions": "The King of Dokapon has offered you his throne; all he asks for in return is that you dispose of an invading horde of thieving monsters. Trouble is - you're not the only one he asked. Contend with up to three friends as you navigate playfields littered with challenges, monsters to defeat,The King of Dokapon has offered you his throne; all he asks for in return is that you dispose of an invading horde of thieving monsters. Trouble is - you're not the only one he asked. Contend with up to three friends as you navigate playfields littered with challenges, monsters to defeat, and rare secrets to unlock. Warning: Relationship counseling not included. Tired of shallow gameplay in party games? The genre gets retooled in this exuberant mix of role playing and board games! Encounter zany characters, collect rare items, and explore a fascinating kingdom on your quest to vanquish monsters, gather treasure, and level up! Turn the heat up on your rivalries! Take on up to three other soon-to-be-ex-friends in the race for Princess Penny and the crown. Battle, steal, deface – playing dirty is the name of the game – through a variety of locales and challenges. After your friendships are broken, the game is just as much fun to play alone. Tons of battles, magic spells, mini-games, and multiple play modes add up to endless replayability. Easy, intuitive, and effective combat system – This is no boring game of hack-and-slash. Players covertly choose their actions in an intuitive battle interface that guarantees every fight will surprise. [Atlus USA]… Expand"}, {"name": "Loki", "details_link": "https://www.metacritic.com/game/pc/loki", "publisher": "DreamCatcher Interactive", "release_date": "Oct  2 2007", "developers": ["Cyanide"], "platforms": "PC", "num_players": "6  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 61, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/abda33a5dee7b99358fbef06fd8010bc-98.jpg", "descriptions": "A journey through four great mythologies, Loki allows the player to take-on the role of one of four heroes: a mighty Norse warrior, a fierce Greek fighter, a powerful Egyptian sorcerer or a skilled Aztec shaman. Each comes from a different mythological background and each has differentA journey through four great mythologies, Loki allows the player to take-on the role of one of four heroes: a mighty Norse warrior, a fierce Greek fighter, a powerful Egyptian sorcerer or a skilled Aztec shaman. Each comes from a different mythological background and each has different strengths and skills and, therefore, radically different ways of fighting. During an epic adventure, the player gives battle to a multitude of enemies. Hundreds of creatures and opponents of every kind have been created for the game, so that the player is going to have to fight his/her way past skeletons, giant spiders, centaurs, mummies, harpies, wild animals, a vast array of soldiers, culminating in the showdowns with formidable bosses such as Medusa, Fenrir the wolf or Fafnir the dragon. Each boss has a particular way of fighting so the player must discover his weak points. As the hero(ine) advances through the game he/she isbe able to collect or exchange thousands of items, including 500 unique objects, such as Thor's hammer or Achilles' armour. [Focus Home Interactive]… Expand"}, {"name": "Medieval Moves: Deadmund's Quest", "details_link": "https://www.metacritic.com/game/playstation-3/medieval-moves-deadmunds-quest", "publisher": "SCEA", "release_date": "Nov 15 2011", "developers": ["Zindagi Games"], "platforms": "PlayStation 3", "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/e73b4b0f9c4d26a08827f0366208822b-98.jpg", "descriptions": "From the same team that brought you Sports Champions, one of the best selling Move titles, Medieval Moves: Deadmund’s Quest is a fantasy, action adventure game that is played with PlayStation Move that uses a unique set of motion control functionality, allowing players to seamlesslyFrom the same team that brought you Sports Champions, one of the best selling Move titles, Medieval Moves: Deadmund’s Quest is a fantasy, action adventure game that is played with PlayStation Move that uses a unique set of motion control functionality, allowing players to seamlessly transition between  throwing projectiles, sword fighting and archery for an intuitive and immersive gameplay experience.… Expand"}, {"name": "Ninety-Nine Nights", "details_link": "https://www.metacritic.com/game/xbox-360/ninety-nine-nights", "publisher": "Microsoft Game Studios", "release_date": "Aug 15 2006", "developers": ["Phantagram", "Q Entertainment"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/80d513f175d36acca2f010ffe3754d0a-98.jpg", "descriptions": "From the collaboration between famed game developer Tetsuya Mizuguchi of Q Entertainment and director SangYoun Lee of leading Korean developer Phantagram comes the Xbox 360-exclusive Ninety-Nine Nights. The title is a fantasy action game for Xbox 360 that allows players to experience anFrom the collaboration between famed game developer Tetsuya Mizuguchi of Q Entertainment and director SangYoun Lee of leading Korean developer Phantagram comes the Xbox 360-exclusive Ninety-Nine Nights. The title is a fantasy action game for Xbox 360 that allows players to experience an immersive and emotional story though the eyes of good and evil while they fight among hundreds of fellow soldiers through an epic adventure of fantasy and action. Each playable character will feature their own strengths and weaknesses, as players must choose the right combination of magic and might to overcome their adversaries. With hundreds of combatants on screen at once, players wield their armies with precision and skill in massive scale battles against ever evolving virtual opponents. In the epic and emotional campaign, gamers play through the heart of a fabulous fantasy realm with unparalleled depth. Each character has his or her own dedicated plotline that ultimately intertwines with that of a larger story. [Microsoft]… Expand"}, {"name": "Future Tactics: The Uprising", "details_link": "https://www.metacritic.com/game/playstation-2/future-tactics-the-uprising", "publisher": "Crave", "release_date": "May 10 2004", "developers": ["Zed Two Limited"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/48a93df2054b182b14ba00077b8e9501-98.jpg", "descriptions": "Packed with action, Future Tactics is a turn-based tactical RPG that looks and feels like an action/platform game. Built around a highly complex turn-based battle engine, the adventure showcases a single-player Story Mode, as well as a two-player Battle Mode.  The plot is set in the not tooPacked with action, Future Tactics is a turn-based tactical RPG that looks and feels like an action/platform game. Built around a highly complex turn-based battle engine, the adventure showcases a single-player Story Mode, as well as a two-player Battle Mode.  The plot is set in the not too distant future, when Earth as we know it has succumbed to a race of extra-dimensional creatures. Now the final hope for restoring order to the planet rests on the shoulders of a young boy, his sister and a rag-tag assembly of unlikely warriors. Future Tactics: The Uprising features: 18 stylized and high-polygon characters interacting in rich, full 3D environments; Unique, number-free turn-based tactical combat system designed to keep players immersed in the action, not the stats; 19 action-packed, highly intense levels waiting to be conquered; Massively deformable terrain. Landscape can be permanently destroyed, leaving behind craters and canyons; Compelling storyline told through fully animated and voiced cut scenes; Two-player customizable battle mode lets gamers tweak handicaps, power-ups and victory conditions; Experience point system allows custom building of team members, allocating upgrades as players see fit; Boot Camp tutorial mode allows novice players to learn good tactics right away. [Crave Entertainment]… Expand"}, {"name": "The Sinking City", "details_link": "https://www.metacritic.com/game/switch/the-sinking-city", "publisher": "Frogwares", "release_date": "Sep 12 2019", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/054282aba151784286f452157eb3d907-98.jpg", "descriptions": "The Sinking City is an action/investigation game set in an open world inspired by the universe of H.P. Lovecraft. In this new type of adventure, you take on the role of Charles W. Reed, an investigator in the 1920s United States. No sooner have you arrived in Oakmont, Massachusetts, than youThe Sinking City is an action/investigation game set in an open world inspired by the universe of H.P. Lovecraft. In this new type of adventure, you take on the role of Charles W. Reed, an investigator in the 1920s United States. No sooner have you arrived in Oakmont, Massachusetts, than you are led to investigate a mysterious flood inundating the city, in the hopes of shedding light on the darkness that has seized the place and corrupted the minds of the inhabitants - and yours...* An oppressive atmosphere and story inspired by the universe of H.P. Lovecraft.* A vast open world that can be explored on foot, by boat, in a diving suit* High replay value thanks to an open investigation system: each case can be solved in a number of ways, with different possible endings depending on your actions.* An arsenal of weapons from the 1920s with which to take on nightmarish creatures.* Manage your mental health to untangle the truth behind the madness.… Expand"}, {"name": "The Good Life", "details_link": "https://www.metacritic.com/game/playstation-4/the-good-life", "publisher": "Playism", "release_date": "Oct 15 2021", "developers": ["White Owls"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "genres": ["Role-Playing", "General"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/014cbdecaed4549d094bcf310fbfcd86-98.jpg", "descriptions": "Play as Naomi, a journalist from New York who moves to a backwoods British town called Rainy Woods in order to pay off her massive debt.The only way for her to escape from debt hell is to take pictures of happenings in the town and report on them. Of course, 'the happiest town in thePlay as Naomi, a journalist from New York who moves to a backwoods British town called Rainy Woods in order to pay off her massive debt.The only way for her to escape from debt hell is to take pictures of happenings in the town and report on them. Of course, 'the happiest town in the world' is not your average town... The inhabitants of the happiest town in the world are some of the most bizarre people you'll ever come across. You'll live alongside them as you solve mysteries and experience a hearty helping of craziness. We're sure that you'll eventually come to love all the mystery, horror, and good old charm that this town has to offer.… Expand"}, {"name": "King Arthur", "details_link": "https://www.metacritic.com/game/xbox/king-arthur", "publisher": "Konami", "release_date": "Nov 16 2004", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/04cee6b0b2d27a3d2cebbb2663e2c5fb-98.jpg", "descriptions": "Live the true story behind the epic legend of King Arthur and the Knights of the Round Table. Based on the King Arthur movie from producer Jerry Bruckheimer, the King Arthur game lets you take control of one of five heroes, including Arthur, Lancelot, and Guinevere, each with unique weaponsLive the true story behind the epic legend of King Arthur and the Knights of the Round Table. Based on the King Arthur movie from producer Jerry Bruckheimer, the King Arthur game lets you take control of one of five heroes, including Arthur, Lancelot, and Guinevere, each with unique weapons and skills. With three modes of battle, motion-captured fighting sequences and moves, and cutscenes from the film, King Arthur re-creates the events of this legendary tale.… Expand"}, {"name": "Galactic Wrestling: Featuring Ultimate Muscle", "details_link": "https://www.metacritic.com/game/playstation-2/galactic-wrestling-featuring-ultimate-muscle", "publisher": "Bandai", "release_date": "Jun 30 2004", "developers": ["Aki Corp."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/591ada477360b2e93837577209359cd3-98.jpg", "descriptions": "(Known in Japan as \"Kinniku Man Generations\") Bandai and the Aki Corporation brings you the sequel to last year's \"Ultimate Muscle: Legends Vs. New Generation\" for the GameCube. Slam your foes with outrageous super galactic moves! Pile on the mayhem, up to 4 players at a time! More than 45(Known in Japan as \"Kinniku Man Generations\") Bandai and the Aki Corporation brings you the sequel to last year's \"Ultimate Muscle: Legends Vs. New Generation\" for the GameCube. Slam your foes with outrageous super galactic moves! Pile on the mayhem, up to 4 players at a time! More than 45 wrestlers to choose from. KO the competition to unlock hidden wrestlers. 6 muscle-busting game modes including Tag Team and Battle Royal! Catch it now on the Fox Box! [Bandai]… Expand"}, {"name": "Yu-Gi-Oh! Reshef of Destruction", "details_link": "https://www.metacritic.com/game/game-boy-advance/yu-gi-oh!-reshef-of-destruction", "publisher": "Konami", "release_date": "Jun 29 2004", "developers": ["Konami"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/f9282a77ca6275ec0ed1a984078ec27f-98.jpg", "descriptions": "In your return to Battle City, you begin another mission to retrieve stolen millennium cards that can destroy the world. Yu-Gi-Oh! Reshef of Destruction features an all-new storyline that sets you off on a quest to stop Reshef from drowning the world in darkness. Since the game's battles areIn your return to Battle City, you begin another mission to retrieve stolen millennium cards that can destroy the world. Yu-Gi-Oh! Reshef of Destruction features an all-new storyline that sets you off on a quest to stop Reshef from drowning the world in darkness. Since the game's battles are fought with cards, you must build a strong deck from 800 different cards (including all three Egyptian god cards) to even stand a chance against your enemies.… Expand"}, {"name": "Beam Breakers", "details_link": "https://www.metacritic.com/game/pc/beam-breakers", "publisher": "JoWooD Entertainment AG", "release_date": "Oct 21 2002", "developers": ["Similis"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Automobile"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/a5064b2b41d484526f781c6ba9443f84-98.jpg", "descriptions": "2374 AD. Neo York, USA. The laws of rush-hour have changed. Forever. Since the invention of the antiGrav technology, public transport is not bound to earth anymore. Millions of commuters go about their lives following the guiding beams as they drive their antiGrav cars through the huge2374 AD. Neo York, USA. The laws of rush-hour have changed. Forever. Since the invention of the antiGrav technology, public transport is not bound to earth anymore. Millions of commuters go about their lives following the guiding beams as they drive their antiGrav cars through the huge canyons of the biggest metropolis on the planet. The face of racing has changed. Forever. Death-defying drivers from rival gangs risk everything in wild, illegal races in the middle of rush hour - always on the run from the MetroPolice. Now, a new challenge has come, and once again the rules are set to be broken. Five gangs. Five districts. One target. Beam Breakers. [JoWood]… Expand"}, {"name": "Disney's Aladdin in Nasira's Revenge", "details_link": "https://www.metacritic.com/game/playstation/disneys-aladdin-in-nasiras-revenge", "publisher": "SCEA", "release_date": "Mar 15 2001", "developers": ["Argonaut Games"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/13ec33d03edf159361fb3d74f0403a83-98.jpg", "descriptions": "Aladdin is about to face his biggest adventure yet. He's got to dart through the marketplace of Agrabah; break his way through the Palace; escape imprisonment in the dungeon; journey through an oasis; survive the fiery Cave of Wonders; rescue Jasmine from booby traps in the Pyramids; saveAladdin is about to face his biggest adventure yet. He's got to dart through the marketplace of Agrabah; break his way through the Palace; escape imprisonment in the dungeon; journey through an oasis; survive the fiery Cave of Wonders; rescue Jasmine from booby traps in the Pyramids; save the Sultan from the grasp of evil in the Ancient City; and battle Nasira in her secret lair, And Jafar is never far away...… Expand"}, {"name": "The Messenger (2001)", "details_link": "https://www.metacritic.com/game/pc/the-messenger-2001", "publisher": "DreamCatcher Interactive", "release_date": "Feb 14 2001", "developers": ["Index Multimedia"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/6bb42a908a287487dfb919c433346249-98.jpg", "descriptions": "Discover an unknown ancient time portal hidden deep in the Louvre, which will propel you to different eras in time on your search for the four objects of the apocalypse. Utilizing logic, stealth, hi-tech gadgets, and weaponry, delve into dangerous worlds of intrigue, murder, and mysticism.Discover an unknown ancient time portal hidden deep in the Louvre, which will propel you to different eras in time on your search for the four objects of the apocalypse. Utilizing logic, stealth, hi-tech gadgets, and weaponry, delve into dangerous worlds of intrigue, murder, and mysticism. [Dreamcatcher Interactive]… Expand"}, {"name": "Skully", "details_link": "https://www.metacritic.com/game/switch/skully", "publisher": "Modus Games", "release_date": "Aug  4 2020", "developers": ["Finish Line Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/5cee25d6903b1dbc5266e19c6a814ca4-98.jpg", "descriptions": "Fate has bestowed Skully a second chance at life when an enigmatic deity reanimates the skull through the power of magical clay after it washes upon the shore of a secluded isle. Skully must hop, skip, and roll through this diverse island habitat teeming with obstacles and puzzles toFate has bestowed Skully a second chance at life when an enigmatic deity reanimates the skull through the power of magical clay after it washes upon the shore of a secluded isle. Skully must hop, skip, and roll through this diverse island habitat teeming with obstacles and puzzles to intervene in a feud between the deity’s three siblings whose quarrel jeopardizes the place they call home. … Expand"}, {"name": "Hunter's Legacy", "details_link": "https://www.metacritic.com/game/xbox-one/hunters-legacy", "publisher": "Lienzo", "release_date": "Jan 20 2017", "developers": ["Lienzo"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D", "Metroidvania"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/9b442f91718608c0c7922a79140512ef-98.jpg", "descriptions": "Hunter’s Legacy is a 2D single-player platform action game made up of characters and worlds from Universe of Something, a concept of a connected world that would span different games. The game is inspired by classics that we grew up playing and is a simple yet fun title designed to challengeHunter’s Legacy is a 2D single-player platform action game made up of characters and worlds from Universe of Something, a concept of a connected world that would span different games. The game is inspired by classics that we grew up playing and is a simple yet fun title designed to challenge gamers of any kind. In Hunter’s Legacy, you control Ikki, huntress of Un’Amak, a bipedal cat equipped with a variety of weapons and abilities, including swords and a bow and arrows.… Expand"}, {"name": "Into the Stars", "details_link": "https://www.metacritic.com/game/pc/into-the-stars", "publisher": "Fugitive Games", "release_date": "Mar  4 2016", "developers": ["Fugitive Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 61, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/9/e3296e896851095c444618759469fe7b-98.jpg", "descriptions": "Into the Stars is a single player open-world journey through a distant solar system. Take the role of Captain as you explore a massive star system in search of a new home for humanity. Outfit your ship, select your crew and set off on a journey where you must scavenge resources, shelterInto the Stars is a single player open-world journey through a distant solar system. Take the role of Captain as you explore a massive star system in search of a new home for humanity. Outfit your ship, select your crew and set off on a journey where you must scavenge resources, shelter civilians and outrun a hostile alien force in order to survive.… Expand"}, {"name": "Neopets: The Darkest Faerie", "details_link": "https://www.metacritic.com/game/playstation-2/neopets-the-darkest-faerie", "publisher": "SCEA", "release_date": "Nov 16 2005", "developers": ["Idol Minds"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 61, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/c21c5673edaad8aae5c2ed582ad2309b-98.jpg", "descriptions": "In Neopets: The Darkest Faerie, players enter the land of Neopia for the first time in 3D and journey with Neopian characters on an adventure to rid the world from the evil Darkest Faerie. Together they will travel through new lands, meet strange inhabitants and discover a mystery unseen byIn Neopets: The Darkest Faerie, players enter the land of Neopia for the first time in 3D and journey with Neopian characters on an adventure to rid the world from the evil Darkest Faerie. Together they will travel through new lands, meet strange inhabitants and discover a mystery unseen by Neopian eyes. Complete quests, defend yourself against evil creatures under the influence of the Darkest Faerie, collect and use a variety of items throughout the adventure.  [SCEA]… Expand"}, {"name": "Hunted: The Demon's Forge", "details_link": "https://www.metacritic.com/game/pc/hunted-the-demons-forge", "publisher": "Bethesda Softworks", "release_date": "May 30 2011", "developers": ["InXile Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/242c5fa7affc6da39dcb15c464c33b0a-98.jpg", "descriptions": "Set in a dark fantasy world, Hunted: The Demon's Forge is an unforgettable cooperative action game, pitting you and your partner against waves of vicious enemies. Taking control of either E'lara, a ranged weapon expert, or Caddoc, a master swordsman, you must use a variety of weapons,Set in a dark fantasy world, Hunted: The Demon's Forge is an unforgettable cooperative action game, pitting you and your partner against waves of vicious enemies. Taking control of either E'lara, a ranged weapon expert, or Caddoc, a master swordsman, you must use a variety of weapons, powerful spells, and cover tactics to battle your way through menacing dungeons, overgrown ruins, and downtrodden towns. Discover secrets and complete co-op-based puzzles whilst exploring the sinister world to discover answers to the game’s deep, dark mysteries. The dark ages have become corrupted. Heinous creatures have emerged from underground. Townsfolk across the land are disappearing. Upon the promise of their fortune in gold, mercenaries E’lara and Caddoc take on the daunting task of discovering where the innocent villagers have been taken. Their journey will lead them on a dark and twisted path where they will encounter death, slavery, and sacrifice. Travel deep within the world of Kala Moor...and to the secrets of The Demon's Forge.… Expand"}, {"name": "Hellbound", "details_link": "https://www.metacritic.com/game/pc/hellbound", "publisher": "Saibot Studios", "release_date": "Aug  4 2020", "developers": ["Saibot Studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/2db865ee8df60803d5658cee86d12a4d-98.jpg", "descriptions": "Classic First Person Shooter style game. Like the good old days. An action game focused on speed, gore, guns, and metal music. Inspired by the 90s’ classics with modern visuals and audio."}, {"name": "Raging Justice", "details_link": "https://www.metacritic.com/game/playstation-4/raging-justice", "publisher": "Team17", "release_date": "May  8 2018", "developers": ["MakinGames"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/0ebf0d305bf98cb461191bdfa64d27c5-98.jpg", "descriptions": "Raging Justice is a classic beat ’em up game of epic proportions, dragging the savage charm of the genre kicking and screaming into the 21st century."}, {"name": "Nikoli's Pencil Puzzle", "details_link": "https://www.metacritic.com/game/3ds/nikolis-pencil-puzzle", "publisher": "Konami", "release_date": "Oct 25 2011", "developers": ["NATSUME ATARI Inc."], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "General", "Logic"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/4a91b2a58db865e635418e1faeb3d514-98.jpg", "descriptions": "Gamers can engage their minds with four challenging puzzle games including Sudoku, Hashiwokakero, Shikaku, and Akari."}, {"name": "Rayman: Hoodlum's Revenge", "details_link": "https://www.metacritic.com/game/game-boy-advance/rayman-hoodlums-revenge", "publisher": "Ubisoft", "release_date": "Mar 15 2005", "developers": ["Backbone Entertainment"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/a0487a8ffcb038b215f158769191e155-98.jpg", "descriptions": "The Hoodlums have returned to take over the world, and only Rayman can stop them. From a new 3D perspective, you can guide Rayman or Globox through 16 intense levels rife with Hoodlum armies. Rayman: Hoodlum's Revenge features new power-ups--including super-speed and fire resistance--thatThe Hoodlums have returned to take over the world, and only Rayman can stop them. From a new 3D perspective, you can guide Rayman or Globox through 16 intense levels rife with Hoodlum armies. Rayman: Hoodlum's Revenge features new power-ups--including super-speed and fire resistance--that can help you defeat enemies.… Expand"}, {"name": "Shadowrun Chronicles: Boston Lockdown", "details_link": "https://www.metacritic.com/game/pc/shadowrun-chronicles-boston-lockdown", "publisher": "Cliffhanger Productions", "release_date": "Mar 31 2014", "developers": ["Cliffhanger Productions", "Cliffhanger Productions"], "platforms": "PC", "genres": ["General", "Strategy", "Adventure", "Turn-Based", "General", "Tactics"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/9db61c4626919978501b3b26338eccc9-98.jpg", "descriptions": "Shadowrun Online is the second Kickstarter video game project set in the unique world of Shadowrun. The first project, Shadowrun Returns, focused primarily on providing a great single player adventure experience, while Shadowrun Online - like the pen & paper version - is all aboutShadowrun Online is the second Kickstarter video game project set in the unique world of Shadowrun. The first project, Shadowrun Returns, focused primarily on providing a great single player adventure experience, while Shadowrun Online - like the pen & paper version - is all about experiencing the awesome world and gritty atmosphere of Shadowrun together with friends. Fluid co-op gameplay and intense player vs player faction wars set in a persistent and evolving world - this is what Shadowrun Online is about.… Expand"}]