[{"name": "Suikoden II", "details_link": "https://www.metacritic.com/game/playstation/suikoden-ii", "publisher": "Konami", "release_date": "Aug 31 1999", "developers": ["Konami"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 82, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/2/83f186b479023e636d2c8beab6c4daae-98.jpg", "descriptions": "Sequel to the early PlayStation RPG. As a member of the Alliance, a military force only really hinted at in the original, you play the unwitting hero of the game: an orphan who has been raised by a quiet, unassuming battle hero in a seemingly ancient war. Alongside you in the ranks is yourSequel to the early PlayStation RPG. As a member of the Alliance, a military force only really hinted at in the original, you play the unwitting hero of the game: an orphan who has been raised by a quiet, unassuming battle hero in a seemingly ancient war. Alongside you in the ranks is your best friend Jowy, a boy born of nobility but who has never been able to receive approval in his stubborn father's eyes. As the game begins, you are immediately tossed into a tale of political strife, betrayal and war on a grand scale beyond your scope in the early stages. As the game wears on, the plot will twist, turn and develop in numerous ways that expose the personalities of each of the characters involved. The battle system is turn-based, with the option to equip Runes for special abilities, combine party member attacks to create chain combos or devastating spells, and the option to run the battle in Auto mode.… Expand"}, {"name": "Final Fight One", "details_link": "https://www.metacritic.com/game/game-boy-advance/final-fight-one", "publisher": "Capcom", "release_date": "Sep 26 2001", "developers": ["Sun-Tec"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/bf07dff5ecbb3a614dc0a365f9379b08-98.jpg", "descriptions": "Classic arcade action is unleased on the Game Boy® Advance system in Final Fight One. There's trouble in Metro City. The members of the Mad Gear Gang have kidnapped the mayor's daughter Jessica and the clock is ticking. The mayor, an ex-street fighter himself, calls in the big guns toClassic arcade action is unleased on the Game Boy® Advance system in Final Fight One. There's trouble in Metro City. The members of the Mad Gear Gang have kidnapped the mayor's daughter Jessica and the clock is ticking. The mayor, an ex-street fighter himself, calls in the big guns to help, enlisting the iron fist team of Cody and Guy. Now, it's a race against time to scour the city, defeat an army of the Mad Gear Gang's minions, and rescue Jessica before it's too late!… Expand"}, {"name": "Tom Clancy's Splinter Cell: Blacklist", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-splinter-cell-blacklist", "publisher": "Ubisoft", "release_date": "Aug 20 2013", "developers": ["Ubisoft Toronto"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/44db619754af068a9dc4506404020b94-98.jpg", "descriptions": "Unleash the force of the most lethal agent to ever exist. You are Sam Fisher, and you've been granted the ultimate license to protect innocents against an array of global terror attacks known as Blacklist - the freedom to use limitless power, to bend or break virtually every law, and to riseUnleash the force of the most lethal agent to ever exist. You are Sam Fisher, and you've been granted the ultimate license to protect innocents against an array of global terror attacks known as Blacklist - the freedom to use limitless power, to bend or break virtually every law, and to rise to the level of the world's most lethal operative. If you are successful, the President of the United States will deny your existence. If you fail, millions will likely face their deaths.… Expand"}, {"name": "Unravel Two", "details_link": "https://www.metacritic.com/game/switch/unravel-two", "publisher": "Electronic Arts", "release_date": "Mar 22 2019", "developers": ["Coldwood Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/e12560bc4a846c08f8944e3fdc3b5491-98.jpg", "descriptions": "In Unravel 2, you play as two Yarnys (tiny magical creatures made of yarn and joined by a thread) in a puzzle-platforming adventure. Run, jump, swing, and solve your way through a world of natural beauty and shadowy dangers, either on your own or with a friend in local co-op."}, {"name": "SteamWorld Dig", "details_link": "https://www.metacritic.com/game/playstation-4/steamworld-dig", "publisher": "Image & Form", "release_date": "Mar 18 2014", "developers": ["Image & Form"], "platforms": ["3DS", "PC", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General", "Platformer", "2D", ""], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/f81089a7bade6672b096793a7a2f64c4-98.jpg", "descriptions": "The clock has stopped around the turn of the 19th century, and humankind has prematurely blown itself to bits. The remaining scraps are huddling in caves beneath the surface, and steam-powered robots have taken over the Wild West."}, {"name": "Tekken 7", "details_link": "https://www.metacritic.com/game/playstation-4/tekken-7", "publisher": "Bandai Namco Games", "release_date": "Jun  2 2017", "developers": ["Bandai Namco Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 82, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/0d206504f8c37c56cd22b9d9445e4bfe-98.jpg", "descriptions": "Love, Revenge, Pride. Each one of us has a reason to fight. Values are what define us and make us human, regardless of our strengths or weaknesses. There are no wrong motives, just the paths we choose to take. Experience the epic conclusion of the Mishima clan and unravel the reasons behindLove, Revenge, Pride. Each one of us has a reason to fight. Values are what define us and make us human, regardless of our strengths or weaknesses. There are no wrong motives, just the paths we choose to take. Experience the epic conclusion of the Mishima clan and unravel the reasons behind each step of their ceaseless fight. Powered by Unreal Engine 4, Tekken 7 features story-driven cinematic battles and intense duels that can be enjoyed with friends and rivals alike through innovative fight mechanics.… Expand"}, {"name": "Metro: Last Light", "details_link": "https://www.metacritic.com/game/pc/metro-last-light", "publisher": "Deep Silver", "release_date": "May 13 2013", "developers": ["4A Games"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/78d169bc831edd027ebf015f54acbdf0-98.jpg", "descriptions": "The year is 2034. Beneath the rubble of post-apocalyptic Moscow, in the tunnels of the Metro, the remnants of our species are besieged by deadly threats. Mutants stalk the catacombs beneath the desolate surface, and hunt amidst the poisoned skies above. But rather than stand united, theThe year is 2034. Beneath the rubble of post-apocalyptic Moscow, in the tunnels of the Metro, the remnants of our species are besieged by deadly threats. Mutants stalk the catacombs beneath the desolate surface, and hunt amidst the poisoned skies above. But rather than stand united, the station-cities of the Metro are engaged in a struggle for the ultimate power, a doomsday device from the military vaults of D6. A civil war is stirring that could wipe humanity from the face of the earth forever. As Artyom, burdened by guilt but driven by hope, you hold the key to our survival – the last light in our darkest hour.… Expand"}, {"name": "Rising Storm", "details_link": "https://www.metacritic.com/game/pc/rising-storm", "publisher": "Tripwire Interactive", "release_date": "May 30 2013", "developers": ["Antimatter Games"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/3da20ea1e108923fef74f02272783445-98.jpg", "descriptions": "Rising Storm is the next game in the Red Orchestra franchise. You know the gameplay, features and realistic audio and graphics of RO2 - Rising Storm will take this to the Pacific Theater, adding even more features, new levels, new weapons and new factions. The game allows the player to fightRising Storm is the next game in the Red Orchestra franchise. You know the gameplay, features and realistic audio and graphics of RO2 - Rising Storm will take this to the Pacific Theater, adding even more features, new levels, new weapons and new factions. The game allows the player to fight across iconic locations from the famous island-hopping campaigns in the Pacific from 1942 to 1945, as the US Army and Marine Corps fight it out with the Imperial Japanese army and Special Naval Landing Forces. Players experience beach assaults, jungle fighting, close quarters night fighting and more across Guadalcanal, Iwo Jima and Saipan, among other iconic battles. The player is able to take the part of either side – American or Japanese – battling it out online in multiplayer on up to 64-player servers. Rising Storm also introduces an entirely new type of gameplay to the franchise - asymmetrical warfare. The American’s have the apparent advantage in firepower with their fast firing semi-automatic rifles, fully automatic weapons, and devastating flamethrower. The Japanese balance this out with gameplay elements that model their raw courage, ferocity, and cunning use of equipment. Their knee mortars allow them to rain indirect fire down on their enemies from anywhere in the map. Grenades can be planted and turned into booby-traps for unwary GIs. The Japanese put very high store on close-quarter combat, with a bayonet on almost every weapon – even machine guns and SMGs. Their banzai charge suppresses the enemy making it difficult for them to return fire and gives them an opportunity to close in to use bayonets and katanas on their opponents.… Expand"}, {"name": "NCAA Football 12", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-football-12", "publisher": "EA Sports", "release_date": "Jul 12 2011", "developers": ["EA Sports"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 82, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/5abdb490c4e68d0bd6e845f4ac4d644a-98.jpg", "descriptions": "NCAA Football 12 is the next iteration in EA's NCAA Football series."}, {"name": "Lethal League", "details_link": "https://www.metacritic.com/game/pc/lethal-league", "publisher": "Reptile", "release_date": "Aug 27 2014", "developers": ["Reptile"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Fighting", "2D"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/d71004f62415bf25e00c7ff19251cd37-98.jpg", "descriptions": "Lethal League is a competitive projectile fighting game where the goal is to launch a ball into the face of your opponent. Lethal League first gained notoriety when it was featured as the grand final ‘Mystery Game’ on UFGT9. It quickly became clear that the extreme nature of the game, mixedLethal League is a competitive projectile fighting game where the goal is to launch a ball into the face of your opponent. Lethal League first gained notoriety when it was featured as the grand final ‘Mystery Game’ on UFGT9. It quickly became clear that the extreme nature of the game, mixed with the stylized street visuals and chip-hop music hit a sweet spot with the crowd.… Expand"}, {"name": "Puzzle Quest: Challenge of the Warlords", "details_link": "https://www.metacritic.com/game/ds/puzzle-quest-challenge-of-the-warlords", "publisher": "D3Publisher", "release_date": "Mar 20 2007", "developers": ["1st Playable Productions"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/9e79dc665e301587730285a66a6058cb-98.jpg", "descriptions": "Set in the Warlords universe, Puzzle Quest challenges gamers to create, develop and customize the ultimate hero to save the land of Etheria from the evil Lord Bane. In order to advance, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinctSet in the Warlords universe, Puzzle Quest challenges gamers to create, develop and customize the ultimate hero to save the land of Etheria from the evil Lord Bane. In order to advance, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinct gameplay modes: Single-player allows gamers to battle against the computer AI as they embark on over 150 challenging quests, Instant Action allows gamers to jump in and immediately play continuous battles to level-up characters without participating in quests, and Multiplayer allows gamers to battle live opponents via wireless connectivity. Victory will advance the player’s hero, magical arsenal, creature companions and more - ultimately rewarding gamers at nearly every turn and providing endless hours of replayablity. [D3Publisher of America]… Expand"}, {"name": "Mega Man 11", "details_link": "https://www.metacritic.com/game/playstation-4/mega-man-11", "publisher": "Capcom", "release_date": "Oct  2 2018", "developers": ["Capcom"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/3a47cf30185d75c994ab6bc4fe461fad-98.jpg", "descriptions": "Thirty years ago, in 1987, a super robot named Mega Man was created. In 2018 after 30 years of unforgettable adventures the fight for everlasting peace continues! The tight action-platformer gameplay that made the series a success is alive and well. To save the day, the Blue Bomber mustThirty years ago, in 1987, a super robot named Mega Man was created. In 2018 after 30 years of unforgettable adventures the fight for everlasting peace continues! The tight action-platformer gameplay that made the series a success is alive and well. To save the day, the Blue Bomber must battle Robot Masters and take their powerful weapons for himself, which now changes the hero's appearance with new levels of detail. A new, vivid visual style refreshes the series' iconic colorfulness, combining hand-drawn environments with detailed, 3D character models.… Expand"}, {"name": "Ninja Five-O", "details_link": "https://www.metacritic.com/game/game-boy-advance/ninja-five-o", "publisher": "Konami", "release_date": "Apr 22 2003", "developers": ["Hudson"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/aca5992f23cb1637495c5955c82980b7-98.jpg", "descriptions": "Take on the roll of Ninja Five-0 as he uses all his skill, stealth and magic to rescue hostages and defeat his enemies. Master the art of ninja swords, shuriken throwing stars and ancient ninjitsu magic!"}, {"name": "Captain Toad: Treasure Tracker", "details_link": "https://www.metacritic.com/game/switch/captain-toad-treasure-tracker", "publisher": "Nintendo", "release_date": "Jul 13 2018", "developers": ["Nintendo EAD Tokyo ", "Nintendo Software Technology"], "platforms": ["3DS", "Wii U", "Switch"], "num_players": "2 ", "genres": ["Puzzle", "Action", "Platformer", "3D"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/114168718c1601180ef91af8a9850406-98.jpg", "descriptions": "The intrepid Captain Toad sets off on his own adventure for the very first time through a wide variety of tricky, enemy-infested, maze-like stages to find hidden gems and nab elusive gold stars."}, {"name": "Dauntless", "details_link": "https://www.metacritic.com/game/xbox-one/dauntless", "publisher": "Epic Games", "release_date": "May 21 2019", "developers": ["Phoenix Labs"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/a0f3713d77b11b7caaa684f813f528f9-98.jpg", "descriptions": "Discover a shattered world, forge powerful weapons, and hunt the ferocious behemoths threatening our survival."}, {"name": "Madden NFL 18", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-18", "publisher": "Electronic Arts", "release_date": "Aug 22 2017", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 82, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/6/9264351aeee3cc8bd3129cfd5a2b15b9-98.jpg", "descriptions": "Madden NFL 18 takes a significant visual leap with the power of the Frostbite engine. See stunning new stadium exteriors surrounded by vast cityscapes and watch the spectacle of NFL gameday come to life in the most photorealistic game to date. Play each matchup to your specifications byMadden NFL 18 takes a significant visual leap with the power of the Frostbite engine. See stunning new stadium exteriors surrounded by vast cityscapes and watch the spectacle of NFL gameday come to life in the most photorealistic game to date. Play each matchup to your specifications by selecting from three new Play Styles or play the best real world match ups each week in Play Now Live! With the introduction of even more ways to play, coupled with your modes, Madden Ultimate Team and Franchise, this is Madden like you've never seen before.… Expand"}, {"name": "Botanicula", "details_link": "https://www.metacritic.com/game/pc/botanicula", "publisher": "Amanita Design", "release_date": "Apr 19 2012", "developers": ["Amanita Design"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Third-Person", "General", "Point-and-Click", "Fantasy"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/6a2ff5d1aaea8038b5dffd96f5562b4d-98.jpg", "descriptions": "Botanicula is point'n'click exploration game created by Jara Plachy and Amanita Design."}, {"name": "OutRun 2006: Coast 2 Coast", "details_link": "https://www.metacritic.com/game/psp/outrun-2006-coast-2-coast", "publisher": "Sega", "release_date": "Apr 25 2006", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "Up to 6 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/b64e1acf8e61f45efd5c8f810991a7f6-98.jpg", "descriptions": "OutRun 2006: Coast to Coast features a choice of 15 fully licensed Ferrari models, featuring the all-new F430 and F430 Spider, as well as the dazzling Superamerica and the stunning 550 Barchetta. Power your way across 15 new American themed environments from the \"OutRun2 SP\" arcadeOutRun 2006: Coast to Coast features a choice of 15 fully licensed Ferrari models, featuring the all-new F430 and F430 Spider, as well as the dazzling Superamerica and the stunning 550 Barchetta. Power your way across 15 new American themed environments from the \"OutRun2 SP\" arcade experience. Race from coast to glorious coast with a fresh new mission structure, a license mode and online play, with up to 6 players for a thrilling head-to-head journey. [Sega]… Expand"}, {"name": "Nine Hours, Nine Persons, Nine Doors", "details_link": "https://www.metacritic.com/game/ds/nine-hours-nine-persons-nine-doors", "publisher": "Aksys Games", "release_date": "Nov 16 2010", "developers": ["ChunSoft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Horror", "3D", "Visual Novel", "First-Person", "Modern", "Modern"], "meta_score": 82, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/3/a2bc14dac9ffdec1b0f9b73b30bba9c1-98.jpg", "descriptions": "In this game, you must help Junpei reclaim his memories and play a game of life or death known as the Nonary Game."}, {"name": "A Short Hike", "details_link": "https://www.metacritic.com/game/pc/a-short-hike", "publisher": "adamgryu", "release_date": "Jul 30 2019", "developers": ["adamgryu"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/f18f62deff856a854fb83248d4401998-98.jpg", "descriptions": "Hike, climb, and soar through the peaceful mountainside landscapes of Hawk Peak Provincial Park as you make your way to the summit."}, {"name": "Darkest Dungeon: The Crimson Court", "details_link": "https://www.metacritic.com/game/pc/darkest-dungeon-the-crimson-court", "publisher": "Red Hook Studios", "release_date": "Jun 19 2017", "developers": ["Red Hook Studios"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 82, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/f0f816da955b7565c3fcb9c376ed9578-98.jpg", "descriptions": "Darkest Dungeon®: The Crimson Court is the first expansion for the award-winning grim and gothic RPG by Red Hook Studios. Crimson Court is a parallel campaign experienced alongside the main Darkest Dungeon content that will provide you with new challenges and variation at every difficultyDarkest Dungeon®: The Crimson Court is the first expansion for the award-winning grim and gothic RPG by Red Hook Studios. Crimson Court is a parallel campaign experienced alongside the main Darkest Dungeon content that will provide you with new challenges and variation at every difficulty level. The narrative grounding sheds some light on the Ancestor’s early days, and will be presented in the same style of cut-scenes you’ve seen elsewhere in the game.… Expand"}, {"name": "Life is Strange 2: Episode 5 - Wolves", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-2-episode-5---wolves", "publisher": "Square Enix", "release_date": "Dec  3 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 82, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/5a17914ae1b9cb71aa37a1e1ffa4992f-98.jpg", "descriptions": "After a tragic incident, brothers Sean and Daniel Diaz run away from home. Fearing the police, and dealing with Daniel’s new telekinetic power, the boys head to Mexico. Each stop on their journey brings new friends and new challenges."}, {"name": "She Remembered Caterpillars", "details_link": "https://www.metacritic.com/game/pc/she-remembered-caterpillars", "publisher": "Ysbryd Games", "release_date": "Jan 17 2017", "developers": ["Ysbryd Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 82, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/4120147e94f6d50bf3fb892f1275550d-98.jpg", "descriptions": "A fungipunk fantasy about love, loss, and holding on, told in the format of a color-based puzzle game. A tale as the bond between parent and child, this lush and bewildering title promises to have players testing their wits against a variety of challenges, all beautiful and very strange."}, {"name": "College Hoops 2K7", "details_link": "https://www.metacritic.com/game/xbox-360/college-hoops-2k7", "publisher": "2K Sports", "release_date": "Nov 20 2006", "developers": ["2K Sports"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/e197ac30198e467ff9070827c630faee-98.jpg", "descriptions": "With over 325 NCAA Division I schools, College Hoops 2K7 defines the college basketball experience. True College Atmosphere - The most immersive college game yet, College Hoops 2K7 puts the fans in the game and makes them a part of the team. No \"I\" in Team - Revamped defensive AI andWith over 325 NCAA Division I schools, College Hoops 2K7 defines the college basketball experience. True College Atmosphere - The most immersive college game yet, College Hoops 2K7 puts the fans in the game and makes them a part of the team. No \"I\" in Team - Revamped defensive AI and defensive controls means that better teams come up with the big stops. Leadership Matters - Team chemistry becomes an important factor in the game as teams with strong leadership tend to get the big upsets come tournament time. Improved Legacy Mode - Legacy mode gets a complete upgrade in College Hoops 2K7, with improvements in everything from a new simulation engine and recruiting tools to bracketology, NCAA record books and new broadcast shows like College Hoops Tonight. More Customization - Make your own schools with customized uniforms and uniquely designed arenas. With an even more robust player creation system, you can bring your own NCAA team to life like never before. [2K Sports]… Expand"}, {"name": "Joe Danger 2: The Movie", "details_link": "https://www.metacritic.com/game/xbox-360/joe-danger-2-the-movie", "publisher": "Microsoft Game Studios", "release_date": "Sep 14 2012", "developers": ["Hello Games"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Racing", "General", "General", "Arcade", "Other"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/4e63721942c31a685fa374936385437c-98.jpg", "descriptions": "On the set of the greatest blockbuster \"Movie\" ever made, create your own action film scene by scene, performing every stunt yourself."}, {"name": "Catherine", "details_link": "https://www.metacritic.com/game/xbox-360/catherine", "publisher": "Atlus", "release_date": "Jul 26 2011", "developers": ["Atlus"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/e689c29542c7aeae7a80b130ce0a983e-98.jpg", "descriptions": "Catherine is an action adventure game from Atlus."}, {"name": "Pro Evolution Soccer 2015", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2015", "publisher": "Konami", "release_date": "Nov 13 2014", "developers": ["Konami"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/9e3d13942546066cab387909d2ccf000-98.jpg", "descriptions": "KONAMI has reworked a number of elements to make sure that every pass, shot or off-the-ball run is balanced to give maximum player satisfaction within PES 2015's on-field action."}, {"name": "FIFA 15", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-15", "publisher": "Electronic Arts", "release_date": "Sep 23 2014", "developers": ["EA Sports"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/50c4bb85d5cff5f338ffc8c4b153747d-98.jpg", "descriptions": "New to this year's installment, players have memories and will show emotion based on the context of the match. With over 600 new emotional reactions, players now respond to pivotal moments on the pitch – bad tackles, missed chances, epic goals - as they would in real life.  RefinedNew to this year's installment, players have memories and will show emotion based on the context of the match. With over 600 new emotional reactions, players now respond to pivotal moments on the pitch – bad tackles, missed chances, epic goals - as they would in real life.  Refined commentary highlights unique fan reactions, while chants and behaviors will be relevant to country or even your club. New bench reactions, side line character animations, 10-man goal celebrations, and more will strive to keep you engaged in the story of the match. Your teammates and opponents now recognize what’s happening in the match and will adjust their tactics just like real players.… Expand"}, {"name": "PixelJunk Shooter Ultimate", "details_link": "https://www.metacritic.com/game/playstation-4/pixeljunk-shooter-ultimate", "publisher": "Double Eleven", "release_date": "Jun  3 2014", "developers": ["Double Eleven"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/10fbe36d3faacb72f163e87cdc5ae088-98.jpg", "descriptions": "Prime your trigger finger for an inventive twin-stick shooter and blast your way through murky caves packed with perils. Two classic games, one great package.\n\nPlayStation 3 hits PixelJunk Shooter and PixelJunk Shooter 2 are back - in one single, addictive experience. With redesignedPrime your trigger finger for an inventive twin-stick shooter and blast your way through murky caves packed with perils. Two classic games, one great package.PlayStation 3 hits PixelJunk Shooter and PixelJunk Shooter 2 are back - in one single, addictive experience. With redesigned visuals to take advantage of the power of PlayStation 4, you'll need a sharp eye and quick reactions to survive the dangers of over a dozen mysterious caverns.Team up with PlayStation Vita owning PixelJunk Shooter Ultimate friends via the Cross-Play feature, and take your game on the go with Cross-Save.… Expand"}, {"name": "Bookworm Adventures Deluxe", "details_link": "https://www.metacritic.com/game/pc/bookworm-adventures-deluxe", "publisher": "PopCap", "release_date": "Dec 20 2006", "developers": ["PopCap"], "platforms": "PC", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Logic", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/1576244ed3d87986d9404f912008b2eb-98.jpg", "descriptions": "Help Lex battle the biggest threat the Great Library has ever known! Perform wordy wonders to vanquish tons of villains. Boost your word power with gems, potions and treasures. Conquer exciting mini-games and brilliant bonus modes. It's the ultimate test of vocab valor. [PopCap Games]"}, {"name": "de Blob", "details_link": "https://www.metacritic.com/game/wii/de-blob", "publisher": "THQ", "release_date": "Sep 22 2008", "developers": ["Blue Tongue Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/bf13fb1d9f39cc43d7818ae996e9a9a0-98.jpg", "descriptions": "As de Blob, the player uses the city as a playground by rolling and bouncing through the streets crushing as many Leech Bots as possible. The Leech Bots are the machines/creatures that extract color from the city and carry this \"liquid color\" inside them. To restore color to the city de BlobAs de Blob, the player uses the city as a playground by rolling and bouncing through the streets crushing as many Leech Bots as possible. The Leech Bots are the machines/creatures that extract color from the city and carry this \"liquid color\" inside them. To restore color to the city de Blob crushes the Leech Bots, absorbs the pigment they carry, and uses the pigment/paint to color everything it touches. de Blob is forced to take on the evil INKT Corporation agents who want the world devoid of color because \"color is a crime!\" Constantly under attack, the Blob in his own quirky way fights back. Rolling, bouncing and crushing are his weapons. The object is to color and/or stencil as many buildings in the city as possible while avoiding the enemy. Race against time moving at Blob speed, or choose your own pace. The city is a canvas and de Blob is your paint brush! Vast cityscapes and urban sprawl offers players the freedom to explore and make their own game-experience. Complete levels as a fun, animated superhero who transforms a hostile city into a vibrant, colorful, happy place. Creative activities and puzzles give immediate and continuous rewards throughout the entire city. Multiple challenges must be found and accepted, which can guide the player through to the next level – the destination and objective for one challenge can be the starting point of the next. Successful completion of challenges earns rewards such as points, time, environmental improvements, additional challenges, and liberating zones. An intricate single player campaign, as well as a multiplayer experience that supports two to four competitors via split screen. Sprint challenges – short bursts of gameplay where the player attempts to accomplish a single skill-based objective. Replay sprint levels to earn higher achievement ratings, which enable the gamer to unlock additional content from the Art Gallery. [THQ]… Expand"}, {"name": "Wandersong", "details_link": "https://www.metacritic.com/game/switch/wandersong", "publisher": "Dumb and Fat Games", "release_date": "Sep 27 2018", "developers": ["Greg Lobanov", "Dumb and Fat Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/6610918e57bd1ce95a0c0a98c1ac847a-98.jpg", "descriptions": "A musical adventure where you use singing to save the world! Play as a silly bard who embarks on a globe-trotting journey to learn about the mysterious Earthsong, said to prevent the universe’s imminent end. It's up to you to sing your songs, unlock the world's secrets and make new friends."}, {"name": "The Lord of the Rings: The Battle for Middle-Earth", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-the-battle-for-middle-earth", "publisher": "Electronic Arts", "release_date": "Dec  6 2004", "developers": ["EA LA"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/fc4a3461f78cd2b1dc0c1d05e836c5c3-98.jpg", "descriptions": "The Lord of the Rings, The Battle for Middle-earth is an unprecedented real-time strategy game that delivers the epic scope and depth of J.R.R. Tolkien's amazing world. You are in complete control of the epic battles as depicted in all three installments of the blockbuster The Lord of theThe Lord of the Rings, The Battle for Middle-earth is an unprecedented real-time strategy game that delivers the epic scope and depth of J.R.R. Tolkien's amazing world. You are in complete control of the epic battles as depicted in all three installments of the blockbuster The Lord of the Rings movie trilogy. From waging all-out combat among Middle-earth’s vast armies to controlling your favorite heroes while managing the resources of your side, the fate of a living, breathing Middle-earth is in your hands. Built upon the acclaimed \"Command & Conquer Generals\" 3D game engine, The Battle for Middle-earth allows you to command the forces of light or darkness in two separate campaigns. You'll have to choose your forces wisely, since each army has its own unique strengths and weaknesses. Complete with all of the epic music, actor voices, and other film assets seamlessly integrated into the game, The Battle for Middle-earth offers a truly memorable entertainment experience. Command the heroes and armies of Middle-earth in over 25 missions based on all three films. Control one of four unique sides, each with its own playing styles, resource management, and base-building techniques. [Electronic Arts]… Expand"}, {"name": "ZEN Pinball 2", "details_link": "https://www.metacritic.com/game/playstation-4/zen-pinball-2", "publisher": "Zen Studios", "release_date": "Dec 24 2013", "developers": ["Zen Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "Wii U", "PlayStation 4"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/07d177e8972c381a56138ae8a3f2c193-98.jpg", "descriptions": "Zen Pinball 2 is full of exciting Wii U GamePad features such as controlling the plunger on the touch screen, rotating camera views, accessing information via the dot matrix, and Free View control by tilting the Wii U GamePad. Additional features include:\r- Unprecedented table visuals andZen Pinball 2 is full of exciting Wii U GamePad features such as controlling the plunger on the touch screen, rotating camera views, accessing information via the dot matrix, and Free View control by tilting the Wii U GamePad. Additional features include:\r- Unprecedented table visuals and the most advanced ball physics on Wii U\r- Trial version for all tables, try them out before you buy!\r- Local Hotseat multiplayer, and fast paced Split-screen multiplayer game modes\r- Action cameras to guide and emphasize spectacular moments\r- Ranking support for all tables, National Ranking, and Worldwide tournaments\r- Continue playing on the Wii U GamePad if the TV is occupied!\r- Robust social features with Challenges, Pro Score, and Team Score. Its up to you to become the Pinball Champion!\r- Awards for each table\r- Regular table releases through the Nintendo eShop… Expand"}, {"name": "Hitman: Blood Money", "details_link": "https://www.metacritic.com/game/pc/hitman-blood-money", "publisher": "Eidos Interactive", "release_date": "May 30 2006", "developers": ["Io Interactive"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/8b60a3170438db9a1987e32c1af4a675-98.jpg", "descriptions": "When assassins from Agent 47's contract agency, The ICA, are systematically eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. For Agent 47 it's business as usual, until suddenly he loses contact with The ICA. Sensing that he may be the next target,When assassins from Agent 47's contract agency, The ICA, are systematically eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. For Agent 47 it's business as usual, until suddenly he loses contact with The ICA. Sensing that he may be the next target, he travels to America, where he prepares to make a killing. Agent 47 is back and this time he's paid in cold, hard cash. How the money is spent will affect his passage through the game and the weapons at his disposal, resulting in a unique gameplay experience for each player. Powered by a new version of Io's stunning Glacier engine, Hitman: Blood Money delivers the most brutal and realistic simulation of life as the world's deadliest assassin. [Eidos Interactive]… Expand"}, {"name": "Bleach: Dark Souls", "details_link": "https://www.metacritic.com/game/ds/bleach-dark-souls", "publisher": "Sega", "release_date": "Oct  7 2008", "developers": ["Treasure"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/0bf0d47ac2ae8184dc003770a8cee63b-98.jpg", "descriptions": "Bleach: Dark Souls on the Nintendo DS brings an exclusive storyline, expanded cast of playable characters and fast multi-plane fighting action for up to four players via Wi-Fi. Players build a power-packed Spirit Card Deck and collect power crystals to augment their spirit card powers on theBleach: Dark Souls on the Nintendo DS brings an exclusive storyline, expanded cast of playable characters and fast multi-plane fighting action for up to four players via Wi-Fi. Players build a power-packed Spirit Card Deck and collect power crystals to augment their spirit card powers on the lower screen and dish out moves that directly affect their opponent's gameplay. With a burgeoning cast of 44 characters including the ability to play as Hollows, players can spend hours experiencing furious fighting gameplay and unlocking personal character stories all based on the series' story arc. [Sega]… Expand"}, {"name": "Burnout Paradise Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/burnout-paradise-remastered", "publisher": "Electronic Arts", "release_date": "Mar 16 2018", "developers": ["Criterion Games", "STELLAR ENTERTAINMENT SOFTWARE LTD"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/f4e53f69e13ad09db331334ec4757287-98.jpg", "descriptions": "Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!Burnout Paradise Remastered provides the ultimate driving playground for you and your friends to play online. This remaster includes all DLC from the Year of Paradise, including the Big Surf Island update, meticulously recreated and ready to wreck in 4K on the PlayStation 4 Pro and Xbox One X.… Expand"}, {"name": "RIVE: Ultimate Edition", "details_link": "https://www.metacritic.com/game/switch/rive-ultimate-edition", "publisher": "Two Tribes", "release_date": "Nov 17 2017", "developers": ["Two Tribes"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/87eb06613388523248b856d113c0d7cf-98.jpg", "descriptions": "RIVE is the metal wrecking, robot hacking shooter you've been waiting for! This 360-degree shooter/platformer hybrid lets you choreograph a dance of destruction in insanely spectacular battles and set-pieces. RIVE feels like the explosive games of yore, pumping megapixels in true 21st century style."}, {"name": "Bulletstorm: Full Clip Edition", "details_link": "https://www.metacritic.com/game/xbox-one/bulletstorm-full-clip-edition", "publisher": "Epic Games", "release_date": "Apr  7 2017", "developers": ["People Can Fly"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/8e9c5f47ef7a1479994672b7c3a194bf-98.jpg", "descriptions": "Step into the boots of Grayson Hunt after a crash landing on an abandoned resort planet forces him to make a hard choice: survival or revenge. An exiled member of the elite assassin group Dead Echo, Graysons blind desire for vengeance finds his crew stranded on Stygia where he can finallyStep into the boots of Grayson Hunt after a crash landing on an abandoned resort planet forces him to make a hard choice: survival or revenge. An exiled member of the elite assassin group Dead Echo, Graysons blind desire for vengeance finds his crew stranded on Stygia where he can finally confront the commander behind his betrayalor get his team off the planet alive.\r Battle your way through throngs of Stygias mutated inhabitants, performing masterful kills throughout the single-player campaignor one of 30 competitive score-challenge or 12 co-operative multiplayer mapsusing Bulletstorm: Full Clip Editions unique Skillshot system that rewards you for executing the most creative and deadly kills imaginable.\r Bulletstorm: Full Clip edition is the definitive Bulletstorm experience that includes all existing Bulletstorm add-ons, plus brand-new content exclusive to Full Clip!… Expand"}, {"name": "Need for Speed: Most Wanted (2005)", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-most-wanted-2005", "publisher": "Electronic Arts", "release_date": "Nov 15 2005", "developers": ["Black Box", "EA Black Box"], "platforms": ["Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/4ae9a3a0b5fe2d2d9a69bba9caa3a3cb-98.jpg", "descriptions": "Combining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel theCombining the thrill of illicit street racing and tuner customization with the intensity of strategic police pursuits that rivals any Hollywood-style chase scene, Need for Speed Most Wanted challenges players to become the most notorious and elusive street racer. Players instantly feel the thrill of the ride as they hit the streets in an open world environment where drivers can tune their cars to compete against any class of vehicles or use their wits to out-fox the law to satisfy their need for speed. Need for Speed Most Wanted delivers a unique, fast-paced and gripping ride in the racing genre as players build up their Rap Sheet and street cred to move their way up the Black List to become the most wanted racer on the streets. Players go head-to-head with the top drivers on the scene as well as strategically evade more than half dozen cops at any one time. Also included are a dynamic open world, new gameplay and customization as well as tuners, supercars, muscles and sports cars. [Electronic Arts]… Expand"}, {"name": "Saints Row 2", "details_link": "https://www.metacritic.com/game/playstation-3/saints-row-2", "publisher": "THQ", "release_date": "Oct 14 2008", "developers": ["Volition Inc."], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/96ced8fa68e38fdbbadeaa93ecd3ba20-98.jpg", "descriptions": "Saints Row 2 is set years after the original Saints Row in a Stilwater both familiar and strange. The explosive conclusion to Saints Row has left the player wounded, betrayed and thirsty for revenge, and now it's time to take back the city that has forgotten him. A sequel to the firstSaints Row 2 is set years after the original Saints Row in a Stilwater both familiar and strange. The explosive conclusion to Saints Row has left the player wounded, betrayed and thirsty for revenge, and now it's time to take back the city that has forgotten him. A sequel to the first open-world title on next-generation consoles, Saints Row 2 features all new customization options, including gender, age, voice, crib and gang customization. The sandbox just got larger with a totally transformed and expanded city of Stilwater, offering all new locations to explore with new vehicles, including motorcycles, boats, helicopters and planes. Saints Row 2 is playable online in 2-player co-op through the entire single-player campaign or in the all new open-world competitive multiplayer mode never before seen in the genre. [THQ]… Expand"}, {"name": "Severed", "details_link": "https://www.metacritic.com/game/playstation-vita/severed", "publisher": "DrinkBox Studios", "release_date": "Apr 26 2016", "developers": ["DrinkBox Studios"], "platforms": ["3DS", "iPhone/iPad", "Switch", "Wii U", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/25e66fa4f6c3d3f778fd1338e6431fc2-98.jpg", "descriptions": "Severed follows the saga of a distraught warrior, who is lost in a fantastical world, as she knits together pieces of her story from both the past and the future. As the heroine, players will embark on a journey through a surreal, nonlinear world by using a gesture-based combat mechanic toSevered follows the saga of a distraught warrior, who is lost in a fantastical world, as she knits together pieces of her story from both the past and the future. As the heroine, players will embark on a journey through a surreal, nonlinear world by using a gesture-based combat mechanic to defeat enemies in this first-person adventure. During their journey, players will unlock new abilities, discover secrets of the land, and grow in power as they master both offensive and defensive techniques.… Expand"}, {"name": "Star Wars: Battlefront", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-battlefront", "publisher": "LucasArts", "release_date": "Sep 20 2004", "developers": ["Pandemic Studios"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/5ebcf8576ebc7ac1f69430fac6fa4786-98.jpg", "descriptions": "Star Wars Battlefront is an action/shooter game that gives fans and gamers the opportunity to re-live and participate in all of the classic Star Wars battles like never before. Players can select one of a number of different soldier types, jump into any vehicle, man any turret on theStar Wars Battlefront is an action/shooter game that gives fans and gamers the opportunity to re-live and participate in all of the classic Star Wars battles like never before. Players can select one of a number of different soldier types, jump into any vehicle, man any turret on the battlefront and conquer the galaxy planet-by-planet online with their friends or offline in a variety of single player modes. Single player modes include \"Instant Action,\" \"Galactic Conquest\" and the story-based \"Historical Campaigns\" mode that lets gamers experience all of the epic Star Wars battles from Episodes I-VI, fighting from the perspective of each of the four factions within the game. [LucasArts]… Expand"}, {"name": "Among Us VR", "details_link": "https://www.metacritic.com/game/pc/among-us-vr", "publisher": "Innersloth", "release_date": "Nov 10 2022", "developers": ["Schell Games", "Innersloth"], "platforms": "PC", "num_players": "Up to 10 ", "genres": ["Action Adventure", "Survival"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/3afc9db5adcad1fdd44a09dbf327d3cb-98.jpg", "descriptions": "You're used to navigating Among Us in 2D, but what if you could BE the Crewmate?This new 3D experience will place you and our suspicious spacebeans in the heart of the Skeld, with all of the core mechanics of teamwork and betrayal you know and love. The VR edition will continue to supportYou're used to navigating Among Us in 2D, but what if you could BE the Crewmate?This new 3D experience will place you and our suspicious spacebeans in the heart of the Skeld, with all of the core mechanics of teamwork and betrayal you know and love. The VR edition will continue to support the multiplayer experience too, of course! Now you can really have an emergency meeting together. (Note: VR version won't be compatible with the original Among Us game, so you'll only be able to play against other VR beans.)… Expand"}, {"name": "Penko Park", "details_link": "https://www.metacritic.com/game/switch/penko-park", "publisher": "Secret Mode", "release_date": "Sep 27 2022", "developers": ["Ghostbutter"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/454421d5cece79b2256a3f2347ff9c05-98.jpg", "descriptions": "Penko Park is a game about exploring an abandoned wildlife park. Meet its mysterious inhabitants by taking photos and interacting with the world! Snap magnificent shots and discover the creatures' most interesting poses.\n\nCollect wildlife details & snapshots in your trusty park guidebook.Penko Park is a game about exploring an abandoned wildlife park. Meet its mysterious inhabitants by taking photos and interacting with the world! Snap magnificent shots and discover the creatures' most interesting poses.Collect wildlife details & snapshots in your trusty park guidebook.Uncover the park's history, secrets & many hidden paths.Use your trusty Penko Grappling Hand to interact with the environment.Enter the spooky realm by unlocking your camera's Ghost-o-Vision.… Expand"}, {"name": "Endling - Extinction is Forever", "details_link": "https://www.metacritic.com/game/playstation-4/endling---extinction-is-forever", "publisher": "HandyGames", "release_date": "Jul 19 2022", "developers": ["Herobeat Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/27d25cf561972ce96aed1710c2739b13-98.jpg", "descriptions": "Will the last mother fox on Earth be able to save its three little cubs? Experience how life would be in a world ravaged by mankind through the eyes of the last fox on Earth in this eco-conscious adventure. Discover the destructive eect of the human race, which corrupts day after day theWill the last mother fox on Earth be able to save its three little cubs? Experience how life would be in a world ravaged by mankind through the eyes of the last fox on Earth in this eco-conscious adventure. Discover the destructive eect of the human race, which corrupts day after day the most precious and needed resources of the natural environments. Explore Endling's 3D side-scrolling world and defend your cubs, three tiny and defenseless fur balls, feed them, see how they grow up level after level, notice their unique personalities and fears, and most importantly, make them survive. Use the cover of night to sneak with your litter towards a safer place. Spend the day resting in an improvised shelter and plan for your next movement carefully since it could be the last one for you or your cubs.… Expand"}, {"name": "Fuga: Melodies of Steel", "details_link": "https://www.metacritic.com/game/switch/fuga-melodies-of-steel", "publisher": "CyberConnect2", "release_date": "Jul 29 2021", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/804052d2ecd46deb5fc5e93a9fc0a4df-98.jpg", "descriptions": "The story takes place on a floating continent, an archipelago of both small and large floating islands where two species known as Caninu and Felineko live. Malt, a young Caninu shepherd, lives with his little sister Mei in Petit Mona, a little village located in the Free Lands of Gasco. OverThe story takes place on a floating continent, an archipelago of both small and large floating islands where two species known as Caninu and Felineko live. Malt, a young Caninu shepherd, lives with his little sister Mei in Petit Mona, a little village located in the Free Lands of Gasco. Over the course of a single night, the Berman Empire invades and throws the village into the flames of war.\r Malt and his friends manage to get away thanks to their families who were subsequently captured and taken away.\r Escaping to a mountain cave, Malt and the other children discover a gigantic tank called the Taranis. They jump aboard, heading out on a journey to save their families!… Expand"}, {"name": "Cyber Shadow", "details_link": "https://www.metacritic.com/game/pc/cyber-shadow", "publisher": "Yacht Club Games", "release_date": "Jan 26 2021", "developers": ["Aarne \"MekaSkull\" Hunziker"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/afcb2c16828a54109d73a77b05d09c99-98.jpg", "descriptions": "The world has been taken over by synthetic lifeforms. A desperate plea for help sets Shadow, the sole survivor of his clan, on one last mission to uncover what started the path to perpetual ruin."}, {"name": "Welcome to Elk", "details_link": "https://www.metacritic.com/game/pc/welcome-to-elk", "publisher": "Triple Topping Games", "release_date": "Sep 17 2020", "developers": ["Triple Topping Games"], "platforms": ["Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/eb22bec0295f9ac6daa794f171d87a88-98.jpg", "descriptions": "Welcome to Elk is a biographical adventure set on an island like no other, where every character you encounter has a story to tell. From the weird and wonderful to the dark and desperate, all the tales told on Elk are based on true stories of life on the road less traveled."}, {"name": "Pixel Ripped 1995", "details_link": "https://www.metacritic.com/game/playstation-4/pixel-ripped-1995", "publisher": "Arvore Immersive Experiences, LLC", "release_date": "May 12 2020", "developers": ["Arvore Immersive Experiences", "LLC"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 82, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/3e552bb7c9a009278e8c7f2218ffe66f-98.jpg", "descriptions": "Pixel Ripped is back with a brand new nostalgia-fueled virtual reality game-within-a-game, this time in the year 1995! To restore balance to multiple dimensions, our videogame hero Dot recruits the help of the best gamer from 1995, an unassuming 9-year-old boy named David. Join this unlikelyPixel Ripped is back with a brand new nostalgia-fueled virtual reality game-within-a-game, this time in the year 1995! To restore balance to multiple dimensions, our videogame hero Dot recruits the help of the best gamer from 1995, an unassuming 9-year-old boy named David. Join this unlikely duo through challenging throwbacks to all your favorite classics from the late 16-bit and early 32-bit era of games inside a virtual reality world.… Expand"}, {"name": "Fell Seal: Arbiter's Mark", "details_link": "https://www.metacritic.com/game/pc/fell-seal-arbiters-mark", "publisher": "1C Entertainment", "release_date": "Aug 16 2018", "developers": ["6 Eyes Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/2071a1bc04ce89e9e7616b39a9b88d5f-98.jpg", "descriptions": "Fell Seal: Arbiter's Mark is a turn-based tactical RPG with a focus on storytelling and strategic battles. Unfold a mature story as you progress through hand-crafted scenarios, controlling your own group of Arbiters, with each character customizable from a wide selection of classes and abilities."}, {"name": "Azure Striker Gunvolt: Striker Pack", "details_link": "https://www.metacritic.com/game/switch/azure-striker-gunvolt-striker-pack", "publisher": "Inti Creates", "release_date": "Aug 31 2017", "developers": ["Inti Creates"], "platforms": ["3DS", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/f2b2872a8be1ce2d2bdc1fbd7c70a488-98.jpg", "descriptions": "Gunvolt is back and hitting store shelves for the first time in the new Azure Striker Gunvolt: Striker Pack!\r The original critically acclaimed 2D action adventure, Azure Striker Gunvolt, is combined with its highly anticipated successor, Azure Striker Gunvolt 2, in one amazing gameGunvolt is back and hitting store shelves for the first time in the new Azure Striker Gunvolt: Striker Pack!\r The original critically acclaimed 2D action adventure, Azure Striker Gunvolt, is combined with its highly anticipated successor, Azure Striker Gunvolt 2, in one amazing game package. These incredible platforming games harken back to the Japanese classics of yesteryear with their great controls, crisp graphics, unique gameplay mechanics, memorable characters, and epic boss battles.\r Features:\r -Two games in one for retail! Players have the opportunity to own both Azure Striker Gunvolt and its sequel, Azure Striker Gunvolt 2, on one cartridge! For the first time, Gunvolt will be available at retail worldwide!\r-A powerful new enemy emerges! Gunvolt's battle with the Sumeragi Group may be over, but a brand new enemy is looming in the shadows. Can Gunvolt put a stop to the nefarious plot of this new threat before it's too late?\r-Gunvolt's rival, Copen joins the fray! In Azure Striker Gunvolt 2, Copen makes his debut as a playable character! Soar through the air with Copen's dash, slam into his enemies to lock on, and then unleash a devastating flurry of homing shots! His high-flying control scheme is completely unique and engaging on a whole new level, so Gunvolt players will be able to enjoy the game in an entirely new way!\r Exclusive Features:\r -Choose your game! Enjoy Azure Striker Gunvolt and Azure Striker Gunvolt 2 on a single cartridge! In one convenient package, play the game that started it all, Azure Striker Gunvolt, or the exciting new follow up in the series, Azure Striker Gunvolt 2!\r-Experience the Original Japanese Version! For the first time on the Nintendo 3DS, experience the original Japanese version of Azure Striker Gunvolt! The game now includes mid-stage dialogue that is fully voiced in Japanese with an updated English script that has been re-translated to better match the original Japanese version of the game.… Expand"}, {"name": "OlliOlli2: Welcome to Olliwood", "details_link": "https://www.metacritic.com/game/pc/olliolli2-welcome-to-olliwood", "publisher": "Devolver Digital", "release_date": "Aug 11 2015", "developers": ["roll7"], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox One", "PC"], "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 82, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/653b820a58b2daeca74ba396d3556092-98.jpg", "descriptions": "OlliOlli2: Welcome to Olliwood plucks the iconic skater from the street and dropping him squarely in the middle of the Big Screen’s most bodacious cinematic locations."}, {"name": "WildStar", "details_link": "https://www.metacritic.com/game/pc/wildstar", "publisher": "NCSOFT", "release_date": "Jun  3 2014", "developers": ["Carbine Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/7a77c1cd4c8282d0a8307138fde93349-98.jpg", "descriptions": "WildStar is an massively multiplayer online adventure game where players make their mark as Explorers, Soldiers, Scientists or Settlers and lay claim to a mysterious planet on the edge of known space."}, {"name": "Broken Age: Act 1", "details_link": "https://www.metacritic.com/game/pc/broken-age-act-1", "publisher": "Double Fine Productions", "release_date": "Jan 28 2014", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "3D", "Point-and-Click", "Third-Person", "Fantasy"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/ceb8dcac334fb131a69391145b6feac1-98.jpg", "descriptions": "The first graphic adventure by Tim Schafer in 16 years, Broken Age began with the help of a record-breaking Kickstarter campaign. Broken Age is a timeless coming-of-age story of barfing trees and talking spoons. Vella Tartine and Shay Volta are two teenagers in strangely similar situations,The first graphic adventure by Tim Schafer in 16 years, Broken Age began with the help of a record-breaking Kickstarter campaign. Broken Age is a timeless coming-of-age story of barfing trees and talking spoons. Vella Tartine and Shay Volta are two teenagers in strangely similar situations, but radically different worlds. The player can freely switch between their stories, helping them take control of their own lives, and dealing with the unexpected adventures that follow.… Expand"}, {"name": "Divinity II: The Dragon Knight Saga", "details_link": "https://www.metacritic.com/game/pc/divinity-ii-the-dragon-knight-saga", "publisher": "Focus Home Interactive", "release_date": "Nov  5 2010", "developers": ["Larian Studios Games"], "platforms": ["Xbox 360", "PC"], "genres": ["Role-Playing", "Miscellaneous", "Action RPG", "Compilation"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/53c16c14c4d87d8a63d671825605f4b1-98.jpg", "descriptions": "Divinity II - The Dragon Knight Saga includes the original adventure \"Ego Draconis\", and \"Flames of Vengeance\", the Dragon Knight's new adventure that continues the epic story and adds dozens of hours of additional gameplay. Divinity II - Ego Draconis appears here as anDivinity II - The Dragon Knight Saga includes the original adventure \"Ego Draconis\", and \"Flames of Vengeance\", the Dragon Knight's new adventure that continues the epic story and adds dozens of hours of additional gameplay. Divinity II - Ego Draconis appears here as an entirely new and re-mastered edition with improved graphics and content that make the game even more beautiful and more impressive than ever before!… Expand"}, {"name": "Starship Defense", "details_link": "https://www.metacritic.com/game/ds/starship-defense", "publisher": "Nintendo", "release_date": "Jan 18 2010", "developers": ["Q-Games"], "platforms": ["iPhone/iPad", "DS"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "Defense"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/0cbaa09aa19728e939b0ae96de1000da-98.jpg", "descriptions": "[DSiWare; also known as \"Starhip Patrol\"] STARSHIP DEFENSE takes the tower defense genre into outer space. Defend your space fleet from wave after wave of enemy attacks by equipping a variety of weapons and using a combination of strategic skills and resource management. Attach weapons to[DSiWare; also known as \"Starhip Patrol\"] STARSHIP DEFENSE takes the tower defense genre into outer space. Defend your space fleet from wave after wave of enemy attacks by equipping a variety of weapons and using a combination of strategic skills and resource management. Attach weapons to your ships using the touch screen, making sure to place them for maximum effect when planning your defense. If you don't, the relentless nature of your enemies could overwhelm you. Increase your chances of success by using energy collected from defeated enemies to install new and more powerful weapons, destroying particular enemies to obtain weapon upgrades, and watching for rare power crystals that unlock advanced attacks, including a devastating black hole. And if you still find yourself in trouble, select an SOS card to call on a special kind of assistance. You'll have to defend your fleet across 30 intense sectors, some with specific challenges, while advancing your rank from lowly recruit all the way to fleet admiral. Are you up to the challenge? [Nintendo]… Expand"}, {"name": "Out of the Park Baseball 9", "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-9", "publisher": "Out Of The Park Developments", "release_date": "Jun  1 2008", "developers": ["Out Of The Park Developments"], "platforms": "PC", "num_players": "32  Online", "genres": ["Sports", "Traditional", "Baseball", "Management"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/eed1f3724729e91580f71452d8e1e019-98.jpg", "descriptions": "The game lets you do almost anything a real life general manager can do to guide a baseball team to glory. Set your line-ups. Replace that aging veteran with a rookie from your minor leagues. Put your injured starter on the disabled list and scout the waiver wire for someone to fill thatThe game lets you do almost anything a real life general manager can do to guide a baseball team to glory. Set your line-ups. Replace that aging veteran with a rookie from your minor leagues. Put your injured starter on the disabled list and scout the waiver wire for someone to fill that roster spot. Put that disgruntled star heading for free agency on the trade block, and see what shakes out. Negotiate contracts with free agents and extensions with your own players. Set your scouting budget, and have your scouting director get a closer look at that free agent pitcher from Japan. The game has no limits, you can guide your team into the infinite future. But it does not end in the front office. OOTP 9 lets you call every play from the dugout, you have total control over your team on the diamond. The most realistic baseball simulation engine on the market handles all the games of your virtual baseball world. You can even save your most exciting games as replays and share them with your friends or the thriving OOTP community. [OOTP Developments]… Expand"}, {"name": "Tekken 5: Dark Resurrection", "details_link": "https://www.metacritic.com/game/playstation-3/tekken-5-dark-resurrection", "publisher": "Namco Bandai Games America", "release_date": "Mar  1 2007", "developers": ["Namco Bandai Games"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/e88b1831511f1db389e6262d01c6dd3c-98.jpg", "descriptions": "[Downloadable Game]  The beauty of TEKKEN is re-created at 1080p and optimized for the HD era, delivering one of the most realistic graphics on the PS3 platform. Play as one of over 30 characters, including classics Jin, Heihachi, Paul, Law and more. New to Dark Resurrection, play as[Downloadable Game]  The beauty of TEKKEN is re-created at 1080p and optimized for the HD era, delivering one of the most realistic graphics on the PS3 platform. Play as one of over 30 characters, including classics Jin, Heihachi, Paul, Law and more. New to Dark Resurrection, play as Jinpachi and take the final boss against all the other characters. Use your fight money to customize your characters. With more than double the items seen in TEKKEN 5, the sky's the limit on the unique look your character will have. [Namco Bandai Games]… Expand"}, {"name": "The Simpsons: Hit & Run", "details_link": "https://www.metacritic.com/game/pc/the-simpsons-hit-run", "publisher": "VU Games", "release_date": "Nov 13 2003", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Driving", "Action Adventure", "Mission-based", "Mission-based", "Open-World"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/a05e7350bd0b5b02fc16ec63df4af61b-98.jpg", "descriptions": "The Simpsons Hit & Run is a mission-based driving game featuring out-of-the-car platform action, the interactive world of Springfield,and the signature humor of the Simpsons. New story and dialogue crafted by writers from The Simpsons television show. All character voices supplied by theThe Simpsons Hit & Run is a mission-based driving game featuring out-of-the-car platform action, the interactive world of Springfield,and the signature humor of the Simpsons. New story and dialogue crafted by writers from The Simpsons television show. All character voices supplied by the cast of The Simpsons television show. Over 56 missions in 7 huge levels. Explore Springfield on foot as Homer, Bart, Lisa, Marge,and Apu. Hidden pick-ups containing trivia material from 300-plus episodes of The Simpsons. [Vivendi Universal]… Expand"}, {"name": "DDRMAX2 Dance Dance Revolution", "details_link": "https://www.metacritic.com/game/playstation-2/ddrmax2-dance-dance-revolution", "publisher": "Konami", "release_date": "Sep 23 2003", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/88c7c68627c35ba420edfb063c6a42a5-98.jpg", "descriptions": "The dance floor kicks into overdrive with DDRMAX2 Dance Dance Revolution. Packed with a smash-hit lineup of licensed music, all-new songs, exclusive songs for the U.S. and cool game modes, everybody will be movin' and groovin' to the pulsating beats. The latest installment of this highlyThe dance floor kicks into overdrive with DDRMAX2 Dance Dance Revolution. Packed with a smash-hit lineup of licensed music, all-new songs, exclusive songs for the U.S. and cool game modes, everybody will be movin' and groovin' to the pulsating beats. The latest installment of this highly anticipated series takes the revolution to the masses. All-new exclusive songs, licensed songs and dance hits. New game modes and graphical interface featuring music videos. Customize dance steps in Edit mode and exercise in Work Out mode. Links with previous games for special features. [Konami]… Expand"}, {"name": "NHL Hitz 20-03", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-hitz-20-03", "publisher": "Midway", "release_date": "Sep 16 2002", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Arcade"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/edcd466aea86c84f5cf28a35acc27b84-98.jpg", "descriptions": "As the only dedicated adrenaline-style hockey videogame franchise for next-generation platforms, NHL Hitz 20-03 showcases over-the-top 3-on-3 (plus goalies) gameplay with players who leap, glide, check, pass and score on would-be defenders. This newest version of Hitz runs up the score onAs the only dedicated adrenaline-style hockey videogame franchise for next-generation platforms, NHL Hitz 20-03 showcases over-the-top 3-on-3 (plus goalies) gameplay with players who leap, glide, check, pass and score on would-be defenders. This newest version of Hitz runs up the score on the hockey videogame category with new features such as the all-new franchise mode, which enhances the single gamer experience by giving users the power to create a team from infancy, grow that team through international competition, earn a franchise, and eventually compete for the Stanley Cup. [Midway]… Expand"}, {"name": "America's Army", "details_link": "https://www.metacritic.com/game/pc/americas-army", "publisher": "U.S. Army", "release_date": "Jul  4 2002", "developers": ["U.S. Army"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 82, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/090315f32a24c1f1081b4e7afa5c1f0a-98.jpg", "descriptions": "Become a member of the world's premier land force; trained and equipped to achieve decisive victory - anywhere. Earn the right to call yourself a Soldier, letting the enemies of freedom know that America's Army has arrived... [U.S. Army]"}, {"name": "Star Trek Bridge Commander", "details_link": "https://www.metacritic.com/game/pc/star-trek-bridge-commander", "publisher": "Activision", "release_date": "Feb 27 2002", "developers": ["Totally Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Large Spaceship", "Civilian"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/0cc1aa1fd12fa042693015993b0f30d6-98.jpg", "descriptions": "While on duty in a remote area of space, a nearby sun suddenly erupts releasing a deadly blast that damages your ship, kills your Captain and threatens nearby colonists. Now you must take control of your ship and lead your crew to solve the mystery. Your mission is clear -- discover theWhile on duty in a remote area of space, a nearby sun suddenly erupts releasing a deadly blast that damages your ship, kills your Captain and threatens nearby colonists. Now you must take control of your ship and lead your crew to solve the mystery. Your mission is clear -- discover the cause of the devastating explosion and prevent it from happening again. During the race you will battle the Cardassians, ally with the Klingons, investigate the unpredictable Romulans and reveal a secret plot that threatens the Federation itself. [Activision]… Expand"}, {"name": "Seaman", "details_link": "https://www.metacritic.com/game/dreamcast/seaman", "publisher": "Sega", "release_date": "Aug  9 2000", "developers": ["Vivarium"], "platforms": "Dreamcast", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/0d1996af8e86d712432f5dba29e5ca49-98.jpg", "descriptions": "Now that you have obtained your own Seaman egg, use the faithful recreation of Dr. Gasse's laboratory to follow in his footsteps, uncovering the secrets of the Seaman. When the Seaman egg hatches, the adventure begins..."}, {"name": "The Last Express", "details_link": "https://www.metacritic.com/game/pc/the-last-express", "publisher": "Broderbund", "release_date": "Mar 31 1997", "developers": ["Smoking Car Productions"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/a4d017be4dcca1c5841609aee379dc43-98.jpg", "descriptions": "Assume the role of Robert Cath, an American who recieves a mysterious dispatch from a friend to meet him on the Orient Express. However, once you get there you discover that things aren't quite as they should be! The game is set during the run up to World War 1. It has a very impressiveAssume the role of Robert Cath, an American who recieves a mysterious dispatch from a friend to meet him on the Orient Express. However, once you get there you discover that things aren't quite as they should be! The game is set during the run up to World War 1. It has a very impressive recreation of the Orient Express and features a historically accurate background.… Expand"}, {"name": "Wreckfest", "details_link": "https://www.metacritic.com/game/pc/wreckfest", "publisher": "THQ Nordic", "release_date": "Jun 14 2018", "developers": ["Bugbear"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Driving", "General", "General", "Racing", "Arcade", "Automobile"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/7b76b7120e8a2ac341aeed3273c1c067-98.jpg", "descriptions": "Wreckfest is a demolition derby themed racing game with soft-body damage modeling, sophisticated driving dynamics and in-depth vehicle upgrading, featuring both demolition derbies and more traditional track races. It’s all about fun, breakneck racing and over-the-top crashes."}, {"name": "A Plague Tale: Innocence", "details_link": "https://www.metacritic.com/game/playstation-4/a-plague-tale-innocence", "publisher": "Focus Home Interactive", "release_date": "May 14 2019", "developers": ["Asobo Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/624e31301677a338a562ee2a8c9188ea-98.jpg", "descriptions": "A Plague Tale: Innocence offers an adventure supported by an original scenario, with gameplay that blends action, adventure and stealth phases. Follow our protagonists Amicia and her little brother Hugo, both orphans and on the run from the terrifying Inquisition. Our young heroes will alsoA Plague Tale: Innocence offers an adventure supported by an original scenario, with gameplay that blends action, adventure and stealth phases. Follow our protagonists Amicia and her little brother Hugo, both orphans and on the run from the terrifying Inquisition. Our young heroes will also need to survive against an even greater danger: supernatural swarms of rats that appeared with the great plague infecting across cities and countryside. [Focus Home Interactive]… Expand"}, {"name": "Final Fantasy VII", "details_link": "https://www.metacritic.com/game/switch/final-fantasy-vii", "publisher": "Square Enix", "release_date": "Mar 26 2019", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/cb47d65e25f35a32c1eaa7adfb11ff7d-98.jpg", "descriptions": "Mako. The discovery of this natural resource drawn directly from the planet's life force marked the dawn of a new era, and now the energy sustains the lives of people across the world. However, the Shinra Company has monopolized mako production, and in doing so established a powerfulMako. The discovery of this natural resource drawn directly from the planet's life force marked the dawn of a new era, and now the energy sustains the lives of people across the world. However, the Shinra Company has monopolized mako production, and in doing so established a powerful hegemony--its influence reaching the far corners of the globe.\r Cloud, a former member of Shinra's military organization, SOLDIER, joins the anti-Shinra resistance group AVALANCHE, despite caring little for their motives. During one of the group's attempts to stop the company, they learn of the return of Sephiroth, Cloud's nemesis, and that with his reemergence, the planet is in greater danger than anyone had expected.\r With the fate of the world riding on their success, Cloud and his allies set out to quell this deadly threat.… Expand"}, {"name": "Blur", "details_link": "https://www.metacritic.com/game/playstation-3/blur", "publisher": "Activision", "release_date": "May 25 2010", "developers": ["Bizarre Creations"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 20 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/7855649d5183ddf12bfa20e4ac67be49-98.jpg", "descriptions": "Blur is a new style of powered-up racing. The game drops players into heart-pumping racing action with 20 cars on a track all targeting the finish line and battling each other as they trade paint and collect intense power-ups, including the ability to blast other cars out of the way withBlur is a new style of powered-up racing. The game drops players into heart-pumping racing action with 20 cars on a track all targeting the finish line and battling each other as they trade paint and collect intense power-ups, including the ability to blast other cars out of the way with huge bursts of energy, boost their speed, and more. Gamers can use offensive and defensive attacks as they battle for the lead and careen through real-world track locations ranging from L.A. and San Francisco to the streets of Hackney, UK and the treacherous roads of Barcelona, Spain. Beyond the action-packed racing filled with fast curves, sneaky alternate routes, hair-raising jumps and fully realized damage models that provide for spectacular crashes, Blur’s narrative is presented through Bizarre’s new community-based interface, reaching far beyond the game itself. This unique story-driving social network evolves dynamically as players compete in different races, make new friends, rivals and fans, and connect with other racers both in-game and in real life. Looking beyond Blur's single player story, gamers can engage in competitive and team-based multiplayer races with up to 20 players online, or on a single console via 4-player split-screen. Bizarre has also introduced Blur’s original social gaming experience - Custom Groups, where anyone can create unique multiplayer modes based on their favorite ways to play the game. These new modes are immediately shared through Blur’s social network, expanding the game in ways that are only limited by the gaming community’s creativity. [Activision]… Expand"}, {"name": "Resistance: Retribution", "details_link": "https://www.metacritic.com/game/psp/resistance-retribution", "publisher": "SCEA", "release_date": "Mar 17 2009", "developers": ["Sony Bend"], "platforms": "PSP", "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/f25a0105cdb3784edafaacd7efdc0d17-98.jpg", "descriptions": "Set in the weeks after Resistance: Fall of Man, Resistance: Retribution follows the story of former British Marine, James Grayson. After a personal tragedy – he is forced to kill his own brother inside a Chimeran conversion center – Grayson goes on a vendetta to destroy every conversionSet in the weeks after Resistance: Fall of Man, Resistance: Retribution follows the story of former British Marine, James Grayson. After a personal tragedy – he is forced to kill his own brother inside a Chimeran conversion center – Grayson goes on a vendetta to destroy every conversion center he can find. Eventually Grayson learns that his efforts have been futile... in Western Europe the Chimera have evolved a new method of converting humans. The European resistance – the Maquis – enlist Grayson's help, and he joins Cartwright and Parker in Operation Overstrike. The war to retake the European continent has begun. A third person action-adventure game created specifically for PSP with an advanced third person targeting system designed specifically for the platform. Over 10 different types of enemies, including Chimera from Resistance 2 and Resistance: Fall of Man – including the Titan, Slipskull, Hybrids and Leapers – and all new enemies like the Hag and Cloven. Intense eight player multiplayer gameplay with five game modes including Team Deathmatch, Capture the Flag, Containment and Assimilation available via ad-hoc and infrastructure. [SCEA]… Expand"}, {"name": "Hustle Kings", "details_link": "https://www.metacritic.com/game/playstation-3/hustle-kings", "publisher": "SCEA", "release_date": "Jan 28 2010", "developers": ["VooFoo Studios"], "platforms": ["PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "64+  Online", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/ad3f430c77271ba5a18bda82854cb0fe-98.jpg", "descriptions": "Whether you're into eight-ball, nine-ball or even killer pool, chalk up your cue and step up to the table for a competitive game against a roster of tough challengers. Earn Hustle King credits in Single Player Mode by potting balls, performing trick shots and beating computer-controlledWhether you're into eight-ball, nine-ball or even killer pool, chalk up your cue and step up to the table for a competitive game against a roster of tough challengers. Earn Hustle King credits in Single Player Mode by potting balls, performing trick shots and beating computer-controlled opponents, then go online and wager those Hustle King credits with other pool players in winner-takes-all single matches and tournaments. Stunning visuals and true 3D physics bring your favourite cue sport to life. Unique Hustle mode lets you wager your Hustle King credits online. Master the art of spin and challenge yourself with an array of trick shots. [SCEE]… Expand"}, {"name": "Hot Shots Golf: Out of Bounds", "details_link": "https://www.metacritic.com/game/playstation-3/hot-shots-golf-out-of-bounds", "publisher": "SCEA", "release_date": "Mar 18 2008", "developers": ["Clap Hanz"], "platforms": "PlayStation 3", "num_players": "44  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/dc099301b2af3cda60f31618072adf20-98.jpg", "descriptions": "(Also known as \"Everybody's Golf 5\", \"Hot Shots Golf 5\", and \"Everybody's Golf: World Tour\")  The fun, addicting and ever-popular Hot Shots Golf franchise, tees it up on the PLAYSTATION 3 system. High Definition) detail of course graphics accompanied with new, more accurate golf physics,(Also known as \"Everybody's Golf 5\", \"Hot Shots Golf 5\", and \"Everybody's Golf: World Tour\")  The fun, addicting and ever-popular Hot Shots Golf franchise, tees it up on the PLAYSTATION 3 system. High Definition) detail of course graphics accompanied with new, more accurate golf physics, brings a revolutionary new level of immersion to the already established signature style of pick-up and play gameplay. With vibrant new courses, zany new characters and a wealth of new online features, Hot Shots Golf: Out of Bounds strives to enter the next generation strokes ahead of the competition. [Sony]… Expand"}, {"name": "Siesta Fiesta", "details_link": "https://www.metacritic.com/game/3ds/siesta-fiesta", "publisher": "Mojo Bones", "release_date": "Jul 24 2014", "developers": ["Mojo Bones"], "platforms": "3DS", "genres": ["Puzzle", "Action", "General"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/4a5f93d107cad61c1d37b6460782d52c-98.jpg", "descriptions": "Siesta Fiesta is a colorful action game where players take control of the snoozing Siesta as he's taken on a one-of-a-kind tour of Fiestaville: home to the beloved Fiestas. Use Siesta's bed to bounce, boost and rebound across the island's 8 fun-filled regions. Siesta Fiesta combines variousSiesta Fiesta is a colorful action game where players take control of the snoozing Siesta as he's taken on a one-of-a-kind tour of Fiestaville: home to the beloved Fiestas. Use Siesta's bed to bounce, boost and rebound across the island's 8 fun-filled regions. Siesta Fiesta combines various elements of classic arcade gameplay to create a truly unique adventure. Use the ball-like Siesta to smash Pinata Blocks, activate Power-Ups, battle bosses and trigger a host of whacky contraptions. With its intuitive gameplay and varied level design, Siesta Fiesta aims to appeal to both long-time gamers and newcomers alike.… Expand"}, {"name": "Quake 4", "details_link": "https://www.metacritic.com/game/pc/quake-4", "publisher": "Activision", "release_date": "Oct 11 2005", "developers": ["Raven Software"], "platforms": ["Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/627d21daab3154759b3b23dd042a0211-98.jpg", "descriptions": "Quake 4 is the first game to utilize id Software's revolutionary DOOM 3 technology. In the game, you are Matthew Kane, an elite member of Rhino Squad and Earth's valiant invasion force. Fight alone, with your squad, and in hover tanks and mechanized walkers as you engage in a heroic missionQuake 4 is the first game to utilize id Software's revolutionary DOOM 3 technology. In the game, you are Matthew Kane, an elite member of Rhino Squad and Earth's valiant invasion force. Fight alone, with your squad, and in hover tanks and mechanized walkers as you engage in a heroic mission into the heart of the Strogg war machine. But, in this epic war between worlds, the only way to defeat the Strogg is to become one of them. Battle through early missions as a deadly marine, then after your capture as a marine-turned-Strogg with enhanced abilities and the power to turn the tide of the war. [Activision]… Expand"}, {"name": "Umurangi Generation", "details_link": "https://www.metacritic.com/game/switch/umurangi-generation", "publisher": "Playism", "release_date": "Jun  5 2021", "developers": ["ORIGAME DIGITAL"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 81, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/8c861c346f5e68e6c64b6f35a3e7575d-98.jpg", "descriptions": "Umurangi Generation is a first person photography game in the shitty future. Set in Tauranga Aotearoa off the back of an impending crisis you are a courier for the Tauranga Express. Throughout the game you will unlock a variety of lenses and equipment."}, {"name": "Closure", "details_link": "https://www.metacritic.com/game/playstation-3/closure", "publisher": "Eyebrow Interactive", "release_date": "Mar 27 2012", "developers": ["Eyebrow Interactive"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/f7d313a5d592aa1ece13af37f901857d-98.jpg", "descriptions": "In the dark and mysterious world of Closure, only what you see exists. Manipulate lights to phase objects in and out of reality in this multiple-award-winning puzzle game. Play as a strange spider-like demon who explores the stories of three human characters through beautiful, eerieIn the dark and mysterious world of Closure, only what you see exists. Manipulate lights to phase objects in and out of reality in this multiple-award-winning puzzle game. Play as a strange spider-like demon who explores the stories of three human characters through beautiful, eerie environments such as a decrepit factory, a murky forest, an abandoned carnival, and the strange, surreal realm that connects them together. [Sony]… Expand"}, {"name": "Kingdom Hearts HD 2.5 ReMIX", "details_link": "https://www.metacritic.com/game/playstation-3/kingdom-hearts-hd-25-remix", "publisher": "Square Enix", "release_date": "Dec  2 2014", "developers": ["Square Enix"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/3112528913ad49601b5637f2dce1e099-98.jpg", "descriptions": "KINGDOM HEARTS HD 2.5 ReMIX is an HD remastered compilation of KINGDOM HEARTS II FINAL MIX and KINGDOM HEARTS Birth by Sleep FINAL MIX."}, {"name": "Tom Clancy's Splinter Cell Chaos Theory", "details_link": "https://www.metacritic.com/game/gamecube/tom-clancys-splinter-cell-chaos-theory", "publisher": "Ubisoft", "release_date": "Mar 31 2005", "developers": ["Ubisoft Montreal"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Action Adventure", "Modern"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/6848df3814ea931dc805059abb6bc2d1-98.jpg", "descriptions": "As Sam Fisher, Third Echelon's most skilled Splinter Cell operative, you are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks originating in North Korea. At your disposal is a lethal array of tactics ranging from CombatAs Sam Fisher, Third Echelon's most skilled Splinter Cell operative, you are assigned to execute a hazardous series of operations to investigate and eliminate a new source of information attacks originating in North Korea. At your disposal is a lethal array of tactics ranging from Combat Knife techniques to experimental prototype weapons skills and more-radical hand-to-hand techniques such as the Inverted Chokehold. Experience the intensity of acting as a lone operative fighting tomorrow's threats in the field and of cooperating online with a partner to accomplish crucial missions.… Expand"}, {"name": "Dragon Quest Builders", "details_link": "https://www.metacritic.com/game/switch/dragon-quest-builders", "publisher": "Square Enix", "release_date": "Feb  9 2018", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/8d062301958e8f1a27ded532fdda6538-98.jpg", "descriptions": "Generations ago, the realm of Alefgard was plunged into darkness by the terrible and treacherous Dragonlord, ruller of all monsters. Mankind was robbed of the power to build and forced to wander the ruins of their former home, scrounging and scavenging in the dust to survive.\r Now its upGenerations ago, the realm of Alefgard was plunged into darkness by the terrible and treacherous Dragonlord, ruller of all monsters. Mankind was robbed of the power to build and forced to wander the ruins of their former home, scrounging and scavenging in the dust to survive.\r Now its up to you, a Legendary Builder chosen by the Goddess herself, to return the power of creation to the people and rebuild Alefgard. Only when the wonder of imagination has been returned will mankind be able to overthrow the evil Dragonlord once and for all!… Expand"}, {"name": "World of Warcraft Classic", "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-classic", "publisher": "Blizzard Entertainment", "release_date": "Aug 27 2019", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Massively Multiplayer", "Board / Card Game"], "meta_score": 81, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/5c88b1b54af5b4e98a9386c41287c5db-98.jpg", "descriptions": "The drums of war thunder once again Return to a lost era of Azeroth and experience the timeless stories that defined this world at war.\r World of Warcraft Classic is a faithful recreation of the original World of Warcraftit runs a bit smoother on today's computers, but the game still looksThe drums of war thunder once again Return to a lost era of Azeroth and experience the timeless stories that defined this world at war.\r World of Warcraft Classic is a faithful recreation of the original World of Warcraftit runs a bit smoother on today's computers, but the game still looks and feels like you're playing World of Warcraft from 2006. Combat mechanics, original character models and skill trees all contribute to a truly authentic experience, as do your interactions with other players. Your reliance on others to take on the world was at the heart of the original WoW and is at the heart of World of Warcraft Classic.\r * Experience the game as it was before the release of any of its expansion sets, and journey back to its beginnings.\r* Venture forth into epic encounters such as Molten Core, Onyxia and Maraudon at launchas players progress, we'll introduce more content like Alterac Valley, the Ahn'Qiraj War Effort and Naxxramas.… Expand"}, {"name": "Mega Man 10", "details_link": "https://www.metacritic.com/game/wii/mega-man-10", "publisher": "Capcom", "release_date": "Mar  1 2010", "developers": ["Inti Creates"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/321457d7d02af6c9276470600b331219-98.jpg", "descriptions": "[WiiWare]  Fans of all ages can enjoy the newest entry in this historic 8-bit franchise. As a special service to new players, there's an Easy Mode – a first for a Mega Man game. This new feature means novices and longtime fans alike can all have a shot at making it to the end of a Mega Man[WiiWare]  Fans of all ages can enjoy the newest entry in this historic 8-bit franchise. As a special service to new players, there's an Easy Mode – a first for a Mega Man game. This new feature means novices and longtime fans alike can all have a shot at making it to the end of a Mega Man game. Also, you can now play as Proto Man and try Time Attack Mode from the beginning, or watch play-through videos from players all over the world. [Capcom]… Expand"}, {"name": "Starbound", "details_link": "https://www.metacritic.com/game/pc/starbound", "publisher": "Chucklefish", "release_date": "Jul 22 2016", "developers": ["Chucklefish"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Fantasy", "General", "Fantasy", "Action Adventure", "Sandbox"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/cb45ff7f0a9a88ea5791bea4850d9979-98.jpg", "descriptions": "In Starbound, you take on the role of a character who’s just fled from their home planet, only to crash-land on another. From there you’ll embark on a quest to survive, discover, explore and fight your way across an infinite universe."}, {"name": "KORG DS-10 PLUS", "details_link": "https://www.metacritic.com/game/ds/korg-ds-10-plus", "publisher": "XSEED Games", "release_date": "Feb 16 2010", "developers": ["AQ Interactive"], "platforms": "DS", "genres": ["Miscellaneous", "Music Maker", "Music Maker", "Application"], "meta_score": 81, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/e6532aa46ee942cd231abc44c6097f05-98.jpg", "descriptions": "Turn your DS into an enhanced version of te KORG DS-10 synthesizer."}, {"name": "Condemned: Criminal Origins", "details_link": "https://www.metacritic.com/game/xbox-360/condemned-criminal-origins", "publisher": "Sega", "release_date": "Nov 16 2005", "developers": ["Monolith Productions"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/0755bde5c3c67e9b71719ac943670df2-98.jpg", "descriptions": "Condemned: Criminal Origins allows players to experience a heightened level of psychological tension as they use their instincts, forensic tools, and melee combat to hunt serial killers and bring them to justice. Agent Thomas, an FBI investigator in the Serial Crimes Unit (SCU), pursuesCondemned: Criminal Origins allows players to experience a heightened level of psychological tension as they use their instincts, forensic tools, and melee combat to hunt serial killers and bring them to justice. Agent Thomas, an FBI investigator in the Serial Crimes Unit (SCU), pursues relentless serial killer through detailed urban environments filled with deadly sociopaths lurking on the periphery of humanity. Presented in a first-person view for maximum visceral effect, Condemned: Criminal Origins is best played with the surround-sound up and the lights off. Given the power of next-generation hardware, this atmospheric thriller features photo-realistic backdrops, life-like physics, and highly sophisticated artificial intelligence. [Sega]… Expand"}, {"name": "Tony Hawk's Project 8", "details_link": "https://www.metacritic.com/game/xbox-360/tony-hawks-project-8", "publisher": "Activision", "release_date": "Nov  7 2006", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/4d49304744cd3471abca88ea551d9617-98.jpg", "descriptions": "Reengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players toReengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players to experience the intensity and pressure of skating against some of the world’s top pros in true to life competitions as they aim to become the #1 skater. [Activision]… Expand"}, {"name": "Saints Row IV", "details_link": "https://www.metacritic.com/game/xbox-360/saints-row-iv", "publisher": "Deep Silver", "release_date": "Aug 20 2013", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 81, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/2f2e8ce70afa5efb392f96bcc5f9a0f6-98.jpg", "descriptions": "The Saints have ankled from the crackhouse to the White House—but the Earth has been invaded and it’s your responsibility to free the world from Overlord Zinyak and his alien force. With homies new and old by your side, and an arsenal of superpowers and exotic weapons, you must save the world."}, {"name": "Doki Doki Literature Club Plus!", "details_link": "https://www.metacritic.com/game/pc/doki-doki-literature-club-plus!", "publisher": "Serenity Forge", "release_date": "Jun 30 2021", "developers": ["Team Salvato"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/6573ed19cba5ce1932b4148b970db529-98.jpg", "descriptions": "Welcome to the club! Write poems for your crush and experience the terror of school romance in this critically-acclaimed psychological horror story.\r Enter the #1 Psychological Horror Experience!\r\n\r\nWelcome to a terrifying world of poetry and romance! Write poems for your crush and eraseWelcome to the club! Write poems for your crush and experience the terror of school romance in this critically-acclaimed psychological horror story.\r Enter the #1 Psychological Horror Experience!\r Welcome to a terrifying world of poetry and romance! Write poems for your crush and erase any mistakes along the way to ensure your perfect ending. Now’s your chance to discover why DDLC is one of the most beloved psychological horror games of the decade!\r You play as the main character, who reluctantly joins the Literature Club in search of a romantic interest. With every poem you write and every choice you make, you’ll charm your crush and begin to unfold the horrors of school romance. Do you have what it takes to crack the code of dating sims and get the perfect ending?\r Now, the original mind-shattering DDLC experience is packed with tons of new features and content exclusive to Doki Doki Literature Club Plus!… Expand"}, {"name": "Injustice: Gods Among Us", "details_link": "https://www.metacritic.com/game/xbox-360/injustice-gods-among-us", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 16 2013", "developers": ["NetherRealm Studios"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/916a3944ee5b5c66a41c0ba61717906c-98.jpg", "descriptions": "Injustice: Gods Among Us is the first in a new fighting game franchise that introduces an original story featuring a large cast of DC Comics icons such as Batman, Harley Quinn, Solomon Grundy, Superman, The Flash, Wonder Woman and a variety of others.  Set in a world where the lines betweenInjustice: Gods Among Us is the first in a new fighting game franchise that introduces an original story featuring a large cast of DC Comics icons such as Batman, Harley Quinn, Solomon Grundy, Superman, The Flash, Wonder Woman and a variety of others.  Set in a world where the lines between good and evil can often be blurred, players experience heroes and villains engaging in epic battles on a vast scale.… Expand"}, {"name": "Nidhogg", "details_link": "https://www.metacritic.com/game/pc/nidhogg", "publisher": "Messhof", "release_date": "Jan 13 2014", "developers": ["Messhof"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "1-2 ", "genres": ["General", "Action", "Miscellaneous", "General"], "meta_score": 81, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/19609f61369f61e907cc4ae3c646bf2a-98.jpg", "descriptions": "Nidhogg is the epic award-winning fencing tug-of-war, full of graceful acrobatics and clumsy stabs. IRL yelling and excitement may occur, in this ultimate two-player showdown of fast-paced fencing and melee attacks. Beware, advantages in Nidhogg are often fleeting, as new opponentsNidhogg is the epic award-winning fencing tug-of-war, full of graceful acrobatics and clumsy stabs. IRL yelling and excitement may occur, in this ultimate two-player showdown of fast-paced fencing and melee attacks. Beware, advantages in Nidhogg are often fleeting, as new opponents continually spawn in your way.… Expand"}, {"name": "The Elder Scrolls V: Skyrim Special Edition", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-v-skyrim-special-edition", "publisher": "Bethesda Softworks", "release_date": "Oct 28 2016", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/00de09ceac6388f790028484aef4adb1-98.jpg", "descriptions": "Skyrim Special Edition brings the epic fantasy to life in detail. The Special Edition includes the game and add-ons with all-new features like remastered art and effects, volumetric god rays, dynamic depth of field, screen-space reflections, and more."}, {"name": "Battlefield 4", "details_link": "https://www.metacritic.com/game/pc/battlefield-4", "publisher": "Electronic Arts", "release_date": "Oct 19 2013", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 81, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/b0a31021bbeb6b0ad036c1a26bde3135-98.jpg", "descriptions": "Battlefield 4 is a military blockbuster that aims for unrivaled destruction. Fueled by Frostbite 3, Battlefield 4 allows you to demolish the buildings shielding your enemy. You will lead an assault from the back of a gun boat. Battlefield grants you the freedom to do more and be more whileBattlefield 4 is a military blockbuster that aims for unrivaled destruction. Fueled by Frostbite 3, Battlefield 4 allows you to demolish the buildings shielding your enemy. You will lead an assault from the back of a gun boat. Battlefield grants you the freedom to do more and be more while playing to your strengths and carving your own path to victory. Beyond its hallmark multiplayer, Battlefield 4 features an intense, dramatic character-driven campaign that starts with the evacuation of American VIPs from Shanghai and follows your squad's struggle to find its way home. Change the landscape in real-time with interactive environments that react to your every move. Dominate land, air and sea with all-new, intense water-based vehicular combat.… Expand"}, {"name": "NBA 2K8", "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k8", "publisher": "2K Sports", "release_date": "Oct  2 2007", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 81, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/350f7d5d845c115d2b39bc4189693265-98.jpg", "descriptions": "Sprite Slam Dunk Contest - Live from Las Vegas, 2K is bringing you the Sprite Slam Dunk Contest, hosted by street legend Bobbito Garcia. Choose from hundreds of dunks and a vast array of props as you compete against the NBA's finest dunkers in this 4 player event. The Sprite Slam DunkSprite Slam Dunk Contest - Live from Las Vegas, 2K is bringing you the Sprite Slam Dunk Contest, hosted by street legend Bobbito Garcia. Choose from hundreds of dunks and a vast array of props as you compete against the NBA's finest dunkers in this 4 player event. The Sprite Slam Dunk Contest is also playable online; it's here that you can prove to the world that you are the greatest dunker there is. More Signature Style - Customizable Free Throws, Dribble Moves, and Dunks give users total control over the way their favorite players play on the court. All new signature shots from many of your favorite NBA players, including #1 draft choice Greg Oden, as well as individual post and dribble moves, makes NBA 2K8 the most authentic NBA simulation on the market. Off-Ball Control - Run quick on the fly sets to get your favorite player the ball in the best situation for him to get a quick bucket. Use the Get Open button for a fast play, or call for the exact situation you want with the Off-Ball Control menu. On offense, you now have the option to switch off the ball handler to other players where you can call for alley-oops, jostle for post-position, set screens, etc. [2K Sports]… Expand"}, {"name": "Teenage Mutant Ninja Turtles: The Cowabunga Collection", "details_link": "https://www.metacritic.com/game/xbox-series-x/teenage-mutant-ninja-turtles-the-cowabunga-collection", "publisher": "Konami", "release_date": "Aug 30 2022", "developers": ["Konami", "Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/1dbf08e7a2d19c6ceef222cdd3613f34-98.jpg", "descriptions": "Teenage Mutant Ninja Turtles: The Cowabunga Collection assembles thirteen classic TMNT games by KONAMI in one incredible package. This collection provides a unique opportunity for gamers to experience these immensely popular and very influential games on modern consoles and includes aTeenage Mutant Ninja Turtles: The Cowabunga Collection assembles thirteen classic TMNT games by KONAMI in one incredible package. This collection provides a unique opportunity for gamers to experience these immensely popular and very influential games on modern consoles and includes a fantastic set of new quality of life features:* Added Online Play for certain games and Local Couch Play* Save Anytime and Rewind* Eleven Japanese Regional Versions* Button Mapping* Unique Development Art & Sketches* Historic TMNT Media ContentThe games are based on the characters and themes based on the 80's children's cartoon and comic book series, The Teenage Mutant Ninja Turtles. The game often takes place in a fictionalized New York City, in the sewers, inside futuristic enemy bases and even across time itself!… Expand"}, {"name": "Yuppie Psycho", "details_link": "https://www.metacritic.com/game/pc/yuppie-psycho", "publisher": "Another Indie", "release_date": "Apr 25 2019", "developers": ["Baroque Decay"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/827cfdc49a8da7c4d8c522086168e64f-98.jpg", "descriptions": "Join Brian Pasternack on his first day at one of the world’s largest companies, Sintracorp. Uncertain, unprepared, and massively unqualified, will Pasternack have what it takes to shine in Sintracorp’s hierarchy? It all depends on how he performs on his first assignment… and whether heJoin Brian Pasternack on his first day at one of the world’s largest companies, Sintracorp. Uncertain, unprepared, and massively unqualified, will Pasternack have what it takes to shine in Sintracorp’s hierarchy? It all depends on how he performs on his first assignment… and whether he survives it.\r… Expand"}, {"name": "Torment: Tides of Numenera", "details_link": "https://www.metacritic.com/game/pc/torment-tides-of-numenera", "publisher": "Techland", "release_date": "Feb 28 2017", "developers": ["InXile Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "General", "Role-Playing", "Western-Style"], "meta_score": 81, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/b21f8b1daec7d09c94763d81040dac86-98.jpg", "descriptions": "Torment: Tides of Numenera is a single-player role-playing game which continues the thematic legacy of the critically acclaimed Planescape: Torment by having to face complex and nuanced morality decisions, carefully contemplating deep and reactive choices with consequences that echoTorment: Tides of Numenera is a single-player role-playing game which continues the thematic legacy of the critically acclaimed Planescape: Torment by having to face complex and nuanced morality decisions, carefully contemplating deep and reactive choices with consequences that echo throughout the game all the while immersed into a new and strange vision taken from by renowned designer and writer Monte Cook's new tabletop role-playing game, Numenera. In Torment: Tides of Numenera, players must decide for themselves the answer to the eternal question, what does one life matter? Numenera's Ninth World is a fantastic vision of a world in which massive civilizations continue to rise and fall with only cities, monuments, and artifacts left behind to serve as reminders of their past existence. These reminders have become part of the accumulated detritus of eons and now this assortment of ancient power, called the numenera, is there for the taking. One of these humans has discovered a way to harness the numenera to grow strong, to cheat death, to skip across the face of centuries in a succession of bodies. But he discovers an unexpected side effect: You.… Expand"}, {"name": "Kalimba", "details_link": "https://www.metacritic.com/game/xbox-one/kalimba", "publisher": "Press Play", "release_date": "Dec 17 2014", "developers": ["Press Play"], "platforms": ["iPhone/iPad", "PC", "Xbox One"], "genres": ["Puzzle", "Action", "General"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/e3b7441e22b602ffc10baa9ecfb3a24d-98.jpg", "descriptions": "Kalimba plays in solid 60 fps full HD. It feels both retro and new at the same time and its puzzle design and twitch gameplay present challenge for the experienced gamer."}, {"name": "Tiger Woods PGA Tour 07", "details_link": "https://www.metacritic.com/game/xbox/tiger-woods-pga-tour-07", "publisher": "EA Sports", "release_date": "Oct 10 2006", "developers": ["EA Redwood Shores"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 81, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/f2d9d45f51f621012d961868c7ddca4c-98.jpg", "descriptions": "Tiger Woods Comes Alive -- See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure -- With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournamentTiger Woods Comes Alive -- See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure -- With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournament play. Enhanced Career Mode -- From working on your driving to mastering your putting skills, craft your game with training challenges in the Practice Facility, then take on the world's best golfers on the World Tour. All-New Championship Courses -- The course content doubles with the addition of new licensed courses, including Firestone Country Club, Glen Abbey, Princeville, Spyglass Hill, St Andrews, and Bandon Dunes. The game features 15 of the world's top players, including Tiger Woods, John Daly, Vijay Singh, Ian Poulter, Michael Campbell, and Annika Sorenstam, the most decorated golfer on the LPGA Tour. Show Your GameFace -- The innovative character creation tool is revamped with deeper modifications, more apparel, equipment licenses, and specialty items. Challenge up to three players in five new game modes, or play in online tournaments complete with money lists, full stat tracking, league leaders, and more. More Game Modes -- Work on your game or take on a friend in Match Play, Battle Golf, 21, OneBall, and more.… Expand"}, {"name": "Call of the Sea", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-the-sea", "publisher": "Raw Fury", "release_date": "Dec  8 2020", "developers": ["Out of the Blue", "Inc.", "Out of the Blue Games S.L."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/176ff8743bfe9c8c0ddfb0e7d6dad8b8-98.jpg", "descriptions": "A weird tale of otherworldly mystery. Call of the Sea is a first-person adventure puzzle game set in the 1930s that tells the story of Norah, a woman on the trail of her missing husband's expedition. The search takes place on a strange but beautiful island in the South Pacific, filled withA weird tale of otherworldly mystery. Call of the Sea is a first-person adventure puzzle game set in the 1930s that tells the story of Norah, a woman on the trail of her missing husband's expedition. The search takes place on a strange but beautiful island in the South Pacific, filled with secrets waiting to be unearthed. It is an otherworldly tale of mystery, adventure, and self-discovery.… Expand"}, {"name": "Cytus Alpha", "details_link": "https://www.metacritic.com/game/switch/cytus-alpha", "publisher": "PM Studios Inc.", "release_date": "Apr 25 2019", "developers": ["Rayark Inc."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/e2827bbc17b7c40d6351422a08999040-98.jpg", "descriptions": "Cytus Alpha is the evolutionary version of the popular mobile game, Cytus. The Switch version features new visuals and over 200 songs, including newly written songs and collaboration tracks. A new leaderboard mode is added where players can post scores against other players online."}]