[{"name": "Monster Hunter", "details_link": "https://www.metacritic.com/game/playstation-2/monster-hunter", "publisher": "Capcom", "release_date": "Sep 21 2004", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/9a5076e54b5cea382ff82b26d643455f-98.jpg", "descriptions": "Monster Hunter offers gamers the challenge of exploring vastly detailed environments confronting mammoth creatures and completing the numerous quests that await them. The game can be enjoyed either single player offline or four player online. In Monster Hunter, the world is a much simplerMonster Hunter offers gamers the challenge of exploring vastly detailed environments confronting mammoth creatures and completing the numerous quests that await them. The game can be enjoyed either single player offline or four player online. In Monster Hunter, the world is a much simpler placefor early civilization. Fantastic creatures from all walks of life coexist with mankind. The struggle to hunt or be hunted rules the world. As young monster hunters, players will face a variety of quests and battle against powerful beings either aloneor with the aid of others. Players begin by selecting and customizing their main character from a host of groups, each with their own arsenal and fighting techniques. Monster Hunter unfolds as expeditions are revealed and players are given the option to choose between the wide ranges of challenging assignments they would like to undertake. Objectives vary from defeating specific beasts, protecting a town or collecting items. Hunters are richly rewarded for every accomplished objective or the valiant efforts put forth during battle, allowing them to obtain more powerful weapons and equipment. The world continues to expand as difficult missions are successfully accomplished. [Capcom]… Expand"}, {"name": "Vandal Hearts: Flames of Judgment", "details_link": "https://www.metacritic.com/game/xbox-360/vandal-hearts-flames-of-judgment", "publisher": "Konami", "release_date": "Jan 20 2010", "developers": ["Hijinx Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Strategy", "Turn-Based", "Console-style RPG", "Console-style RPG", "Tactics"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/3e2bd9a6dd9534d86890e90985aa33f6-98.jpg", "descriptions": "[Xbox Live Arcade]  Konami's legendary tactical role-playing game (RPG) series returns with Vandal Hearts: Flames of Judgment on Xbox LIVE Arcade! On the continent of Sostegaria, two rival kingdoms stand on the brink of war. Caught in the tide of battle is young orphan Tobias Martin. Driven[Xbox Live Arcade]  Konami's legendary tactical role-playing game (RPG) series returns with Vandal Hearts: Flames of Judgment on Xbox LIVE Arcade! On the continent of Sostegaria, two rival kingdoms stand on the brink of war. Caught in the tide of battle is young orphan Tobias Martin. Driven to defend his homeland, and to avenge those already fallen, Tobias enlists with his comrades to fight for peace. But all is not what it seems, and they face a threat far deadlier—and closer—than they know. [Konami]… Expand"}, {"name": "Wallace & Gromit: Curse of the Were-Rabbit", "details_link": "https://www.metacritic.com/game/playstation-2/wallace-gromit-curse-of-the-were-rabbit", "publisher": "Konami", "release_date": "Sep 29 2005", "developers": ["Frontier Developments"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Modern"], "meta_score": 68, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/8/b2a2998524b57eb41c7c2b707443b0a3-98.jpg", "descriptions": "Konami's Wallace & Gromit: The Curse of the Were-Rabbit video game closely follows the events of the Aardman and DreamWorks film, with players using cooperative modes to guide any pairing of Wallace, Gromit or their rabbit friend, Hutch, through four huge areas. Players are given free reignKonami's Wallace & Gromit: The Curse of the Were-Rabbit video game closely follows the events of the Aardman and DreamWorks film, with players using cooperative modes to guide any pairing of Wallace, Gromit or their rabbit friend, Hutch, through four huge areas. Players are given free reign of the area as they attempt to solve the problems of the Giant Vegetable Competition. Their mission takes them from the seaside to suburbia as they venture out at night to confront the beast responsible for the vegetable-based carnage. [Konami]… Expand"}, {"name": "Hell Yeah! Wrath of the Dead Rabbit", "details_link": "https://www.metacritic.com/game/playstation-3/hell-yeah!-wrath-of-the-dead-rabbit", "publisher": "Sega", "release_date": "Sep 25 2012", "developers": ["Arkedo Studio"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/a8d708d4d695b8fd13bc581074744182-98.jpg", "descriptions": "Hell Yeah! is a crazy action-adventure platformer. In Hell. You are Ash, a devil rabbit and the prince of Hell. When some jerk finds it funny to post your secret intimate photos all over the Hell-ternet, you get VERY angry. Time to find him and destroy him once and for all. While you’re atHell Yeah! is a crazy action-adventure platformer. In Hell. You are Ash, a devil rabbit and the prince of Hell. When some jerk finds it funny to post your secret intimate photos all over the Hell-ternet, you get VERY angry. Time to find him and destroy him once and for all. While you’re at it, why not use this incredible journey to kill everybody else? It’s you against all Hell. It’s Hell Yeah!… Expand"}, {"name": "Ice Age 2: The Meltdown", "details_link": "https://www.metacritic.com/game/playstation-2/ice-age-2-the-meltdown", "publisher": "Vivendi Games", "release_date": "Mar 14 2006", "developers": ["Eurocom Entertainment Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/13e9b97bcce454570927a0f2ee26842b-98.jpg", "descriptions": "Their world is melting, and your Ice Age 2 The Meltdown pals need help escaping the biggest flash flood in prehistory. Swim, splash, and scurry through all the action and adventure from the new Ice Age 2 The Meltdown movie and unearth fun, laughter and surprises along the way. Play as Scrat,Their world is melting, and your Ice Age 2 The Meltdown pals need help escaping the biggest flash flood in prehistory. Swim, splash, and scurry through all the action and adventure from the new Ice Age 2 The Meltdown movie and unearth fun, laughter and surprises along the way. Play as Scrat, along with your favorite heroes from the film. Dive into a huge variety of exciting mini-games, like Sid's Slippery Sloth Slide Challenge. Journey through the amazing worlds of the Ice Age 2 The Meltdown movie... and new ones too. [Vivendi Universal]… Expand"}, {"name": "The Cave (2013)", "details_link": "https://www.metacritic.com/game/pc/the-cave-2013", "publisher": "Sega", "release_date": "Jan 23 2013", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PlayStation 3", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/993bd812c962aab73db0537194eee077-98.jpg", "descriptions": "The Cave is an adventure game from the mind of Ron Gilbert."}, {"name": "Atelier Iris 2: The Azoth of Destiny", "details_link": "https://www.metacritic.com/game/playstation-2/atelier-iris-2-the-azoth-of-destiny", "publisher": "NIS America", "release_date": "Apr 25 2006", "developers": ["Gust"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/ece9692dc27d2f4e222361a316bfdedb-98.jpg", "descriptions": "The sequel to Gust's RPG about an alchemist out to prove himself and make use of his awesome skills. Atelier Iris 2 focuses on two main characters whom you can assume at will. One character embarks on adventures in distant worlds, facing off against enemies via a turn-based battle system.The sequel to Gust's RPG about an alchemist out to prove himself and make use of his awesome skills. Atelier Iris 2 focuses on two main characters whom you can assume at will. One character embarks on adventures in distant worlds, facing off against enemies via a turn-based battle system. The other character stays behind at home and creates items and weapons.… Expand"}, {"name": "Commander: Conquest of the Americas", "details_link": "https://www.metacritic.com/game/pc/commander-conquest-of-the-americas", "publisher": "Paradox Interactive", "release_date": "Jul 30 2010", "developers": ["Nitro Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General", "Command"], "meta_score": 68, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/69fefd8fa5b900b851084ff1f1fbd1a6-98.jpg", "descriptions": "Choosing from 7 different European factions, take charge of a European power aiming to conquer the New World. Found new colonies and manage their resources, production, military, and much more as they develop into a full blown empire. Choose to command ships in RTS fashion or take directChoosing from 7 different European factions, take charge of a European power aiming to conquer the New World. Found new colonies and manage their resources, production, military, and much more as they develop into a full blown empire. Choose to command ships in RTS fashion or take direct control as your fleet engages ships of an enemy nation or blood thirsty pirates at a highly detailed tactical level. … Expand"}, {"name": "Dear Esther: Landmark Edition", "details_link": "https://www.metacritic.com/game/playstation-4/dear-esther-landmark-edition", "publisher": "The Chinese Room", "release_date": "Sep 20 2016", "developers": ["The Chinese Room"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/37895680cfad48afb4c0ce9f5a5acbd3-98.jpg", "descriptions": "Dear Esther is a first-person ghost story. Rather than traditional game-play the focus here is on exploration, uncovering the mystery of a lonely island, of who you are and why you are here. Fragments of story are randomly uncovered when exploring the various locations of the island, makingDear Esther is a first-person ghost story. Rather than traditional game-play the focus here is on exploration, uncovering the mystery of a lonely island, of who you are and why you are here. Fragments of story are randomly uncovered when exploring the various locations of the island, making every each journey a unique experience.… Expand"}, {"name": "Treasure World", "details_link": "https://www.metacritic.com/game/ds/treasure-world", "publisher": "Aspyr", "release_date": "Jun 30 2009", "developers": ["Aspyr"], "platforms": "DS", "genres": ["Simulation", "General", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/a6451232c8578d3b9777ce55cf6bd738-98.jpg", "descriptions": "Get out and explore to uncover thousands of wondrous treasures that are waiting to be found. Create a secret world that becomes more vibrant and melodic as your riches grow. Expand your world and join Club Treasure World where you can chat, set up trades and show off with other treasureGet out and explore to uncover thousands of wondrous treasures that are waiting to be found. Create a secret world that becomes more vibrant and melodic as your riches grow. Expand your world and join Club Treasure World where you can chat, set up trades and show off with other treasure hunters across the globe. [Aspyr]… Expand"}, {"name": "Zendoku", "details_link": "https://www.metacritic.com/game/ds/zendoku", "publisher": "Eidos Interactive", "release_date": "Jun 26 2007", "developers": ["Zoonami Ltd."], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/923380cd997a08044bbc34e5bd61ad9f-98.jpg", "descriptions": "ZENDOKU blends exciting puzzle battle action with addictive Sudoku gameplay. Set against a whimsical Far Eastern backdrop with a light-hearted martial arts theme, ZENDOKU offers a variety of colorful characters and a comprehensive range of single-player and wireless multi-player game modes.ZENDOKU blends exciting puzzle battle action with addictive Sudoku gameplay. Set against a whimsical Far Eastern backdrop with a light-hearted martial arts theme, ZENDOKU offers a variety of colorful characters and a comprehensive range of single-player and wireless multi-player game modes. Players choose a character and use the unique controls of the handheld console to attack or defend against a challenger, or race against the clock, all while completing one of an infinite number of ZENDOKU’s puzzle permutations. With an intuitive play style, an accessible learning curve, and entertaining character storylines, audiences everywhere can find the path to enlightenment with ZENDOKU. [Eidos Interactive]… Expand"}, {"name": "NBA 07", "details_link": "https://www.metacritic.com/game/psp/nba-07", "publisher": "SCEA", "release_date": "Sep 25 2006", "developers": ["SCEA"], "platforms": ["PlayStation 2", "PlayStation 3", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/b21426fbb3b58122efa444e0ec1bf7bd-98.jpg", "descriptions": "Delivering the most engaging NBA experience with fast, fluid gameplay, NBA '07 for the PSP expands upon the franchise by offering the most feature-rich, handheld NBA action available. Officially licensed by the NBA, and introducing all-new gameplay modes, mini-games, and presentation, NBADelivering the most engaging NBA experience with fast, fluid gameplay, NBA '07 for the PSP expands upon the franchise by offering the most feature-rich, handheld NBA action available. Officially licensed by the NBA, and introducing all-new gameplay modes, mini-games, and presentation, NBA '07 is ready to deliver the thrill of and excitement of NBA action on the go. An all-new Conquest Mode allows players to take a team and challenge NBA squads across the country, while a new Pick Up Mode give gamers a chance to choose from 10 different NBA players for a playground-style match-up. In addition to the instant replay function, a new Highlight Reel option provides players the opportunity to view a select reel of highlight shots, passes, steals, and dunks at the end of each game. Players will also have more choices of quick pick-up-and-play mini-games, including an all-new rhythm-based dunk contest as well as carnival-style games including skee-ball, pinball, and pop-a-shot. Additionally, the game brings back popular mini-games such as Dodgeball and HORSE, as well as a comprehensive ladder challenge and virtual trading cards. [SCEA]… Expand"}, {"name": "Justice League Heroes", "details_link": "https://www.metacritic.com/game/xbox/justice-league-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 17 2006", "developers": ["Snowblind Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/0435900ed9e35cd66b2bfd6601c5a25e-98.jpg", "descriptions": "Justice League Heroes is an action adventure game with role-playing customization featuring Superman, Batman, Green Lantern, The Flash, Wonder Woman, Martian Manhunter, Zatanna and other unlockable Justice League super heroes. Each hero possesses an array of character-specific, upgradeableJustice League Heroes is an action adventure game with role-playing customization featuring Superman, Batman, Green Lantern, The Flash, Wonder Woman, Martian Manhunter, Zatanna and other unlockable Justice League super heroes. Each hero possesses an array of character-specific, upgradeable superpowers resulting in unique controls and fighting-styles. Engaging in one-to-two player cooperative combat, gamers are be able to customize and master these superpowers as they travel through interactive and destructible environments spanning the farthest corners of the universe.… Expand"}, {"name": "Dark Summit", "details_link": "https://www.metacritic.com/game/gamecube/dark-summit", "publisher": "THQ", "release_date": "Feb  4 2002", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 68, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/15aedf87b0aa79881f7ea226f48cffcb-98.jpg", "descriptions": "UNLOCK THE MYSTERY!\rThe military has mysteriously closed the summit of Mt. Garrick and Chief O'Leary is trying desperately to drvive boarders off the mountain. Do you have what it takes to explore this vast terrain and expose the conspiracy shrouded at the summit?\rThe first actionUNLOCK THE MYSTERY!\rThe military has mysteriously closed the summit of Mt. Garrick and Chief O'Leary is trying desperately to drvive boarders off the mountain. Do you have what it takes to explore this vast terrain and expose the conspiracy shrouded at the summit?\rThe first action adventure on the slopes\rComplete 45 missions\rLocate bomb parts & launch avalanche cannons\rDetachable board tricks… Expand"}, {"name": "TSIOQUE", "details_link": "https://www.metacritic.com/game/pc/tsioque", "publisher": "OhNoo", "release_date": "Nov  7 2018", "developers": ["OhNoo"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/8b90ea3981e3f631f03d1c30737ad306-98.jpg", "descriptions": "TSIOQUE is a dark but playful Point & Click adventure, hand-animated in meticulous, frame-by-frame 2D. Escape the clutches of an Evil Wizard and discover the secrets hidden within the spellbound castle of your ancestors. We take the role of princess Tsioque, imprisoned in a castle overtakenTSIOQUE is a dark but playful Point & Click adventure, hand-animated in meticulous, frame-by-frame 2D. Escape the clutches of an Evil Wizard and discover the secrets hidden within the spellbound castle of your ancestors. We take the role of princess Tsioque, imprisoned in a castle overtaken by the Evil Wizard.\r… Expand"}, {"name": "Need for Speed", "details_link": "https://www.metacritic.com/game/pc/need-for-speed", "publisher": "Electronic Arts", "release_date": "Mar 15 2016", "developers": ["Ghost Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 68, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/02d216693d4d469df541413662a9860a-98.jpg", "descriptions": "One of the first things you’ll notice when tackling the front of your car is the ability to modify your stance. Whether you are changing the ride height by slamming it to the ground, raising it up, or anything in between, you choose your perfect ride height.  Throw in options for rake andOne of the first things you’ll notice when tackling the front of your car is the ability to modify your stance. Whether you are changing the ride height by slamming it to the ground, raising it up, or anything in between, you choose your perfect ride height.  Throw in options for rake and both front and rear track width, and you’re on your way to creating something truly unique. Suspension tuning is finished up with your camber. With the angle on both the front and rear wheels being set independently you’ve got the ability to create some truly out of this world looking cars. The PC version has new features, including unlocked framerate with 4K resolution, manual transmission, and steering wheel support for a selection of steering wheels.… Expand"}, {"name": "Ice Age 2: The Meltdown", "details_link": "https://www.metacritic.com/game/xbox/ice-age-2-the-meltdown", "publisher": "Vivendi Games", "release_date": "Mar 14 2006", "developers": ["Vivendi Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/c5b6b1287da84326458cd3d2edf67f73-98.jpg", "descriptions": "Their world is melting, and your Ice Age 2 The Meltdown pals need help escaping the biggest flash flood in prehistory. Swim, splash, and scurry through all the action and adventure from the new Ice Age 2 The Meltdown movie and unearth fun, laughter and surprises along the way. Play as Scrat,Their world is melting, and your Ice Age 2 The Meltdown pals need help escaping the biggest flash flood in prehistory. Swim, splash, and scurry through all the action and adventure from the new Ice Age 2 The Meltdown movie and unearth fun, laughter and surprises along the way. Play as Scrat, along with your favorite heroes from the film. Dive into a huge variety of exciting mini-games, like Sid's Slippery Sloth Slide Challenge. Journey through the amazing worlds of the Ice Age 2 The Meltdown movie... and new ones too.… Expand"}, {"name": "Tom Clancy's EndWar", "details_link": "https://www.metacritic.com/game/psp/tom-clancys-endwar", "publisher": "Ubisoft", "release_date": "Nov  4 2008", "developers": ["Funatics Software", "Funatics"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "genres": ["Strategy", "Real-Time", "Wargame", "Turn-Based", "Military", "Tactics"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/683182869e91c5bcc0066d721239e0fb-98.jpg", "descriptions": "Tom Clancy's EndWar for handhelds allows players to command an elite military force on the ground, in the air and on the seas during World War III. Take control of the elite U.S. Joint Strike Force, European Enforcers Corps or Russian Spetsnaz Guards Brigade and lead your faction to victoryTom Clancy's EndWar for handhelds allows players to command an elite military force on the ground, in the air and on the seas during World War III. Take control of the elite U.S. Joint Strike Force, European Enforcers Corps or Russian Spetsnaz Guards Brigade and lead your faction to victory in three separate yet interwoven single-player campaigns. Each campaign includes over 30 battle scenarios taking place on real-world battlefields including Paris and London, and features increasingly challenging missions and objectives. Fight against a friend in tense two-player battles in any of the 100 ready-to-play scenarios or in your own custom-created missions. Turn-based strategy with a twist: Simultaneous move and attack phases make the experience as intense and authentic as real-time strategy. Three campaigns, one for each faction, with increasingly challenging battle scenarios and objectives. Over 20 units and vehicles per faction including ground, air and naval units. Units gain experience in combat, dramatically improving their combat performance. Two-player versus multiplayer mode, including additional missions specifically designed for multiplayer battles. Easy-to-pick-up mission editor: Create and share your custom battlefields and battle scenarios to play solo or against another player. [Ubisoft]… Expand"}, {"name": "The Rumble Fish 2", "details_link": "https://www.metacritic.com/game/playstation-5/the-rumble-fish-2", "publisher": "3goo", "release_date": "Dec  7 2022", "developers": ["Dimps Corporation", "Suncrest Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 68, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/2a2d22003dcba768f36196f4e4ac4913-98.jpg", "descriptions": "At the close of the 20th century... A large-scale natural disaster struck the eastern area of a certain country. The disaster wiped out the financial sector and toppled high-rise buildings over a wide area, even as far as the main functions of the capital. This resulted in the loss of aAt the close of the 20th century... A large-scale natural disaster struck the eastern area of a certain country. The disaster wiped out the financial sector and toppled high-rise buildings over a wide area, even as far as the main functions of the capital. This resulted in the loss of a staggering 158,000 lives.At the dawn of the 21st century... Conglomerate PROBE-NEXUS, commonly known as Probe, begins reconstruction efforts in the eastern area of said country. Probe relocates its own base of operations to the ruined sector and builds a massive city run by the corporation. Lavished with colossal capital and cutting-edge technology, the modern-day Babylon is made up of skyscrapers that put the old high-rises to shame, the biggest shopping mall in the world, and recreational facilities one might mistake for a theme park.This was the dazzling birth of a symbol for the new century. It became the most essential place on the planet and was christened Zone Prime.The Rumble Fish is a 2D fighting game. The arcade version was developed in 2004. The arcade version of The Rumble Fish 2 came out in 2005, introducing new game mechanics and characters. It gained popularity with its sleek 2D visuals powered by S.M.A. (Smooth Model Animation), fascinating characters and strategic gameplay using 2 types of gauges.… Expand"}, {"name": "Thymesia", "details_link": "https://www.metacritic.com/game/playstation-5/thymesia", "publisher": "Team17", "release_date": "Aug 18 2022", "developers": ["OverBorder Studio"], "platforms": ["PC", "Switch", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/992b40c649b6a873fcc641fb3a174a8a-98.jpg", "descriptions": "Thymesia is a gruelling action-RPG with fast-paced combat and an intricate plague weapon system. In a kingdom where death spreads, play as a mysterious character known by the code name \"Corvus\". Prey upon your enemies, wield the power of disease and find the truth in your own memories."}, {"name": "Lydia", "details_link": "https://www.metacritic.com/game/switch/lydia", "publisher": "Nakana.io", "release_date": "Jan 17 2020", "developers": ["Platonic Partnership"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/d8014b60fac8c456375ed6764cf72258-98.jpg", "descriptions": "Lydia is a story-driven indie adventure game about substance abuse from a perspective of a small child. The story focuses on how a child processes adult’s problems through her imagination."}, {"name": "Blitzkrieg 3", "details_link": "https://www.metacritic.com/game/pc/blitzkrieg-3", "publisher": "Nival Interactive", "release_date": "Jun  2 2017", "developers": ["Nival Interactive", "Nival"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Historic", "Tactics"], "meta_score": 68, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/4/7bea9d0f084ce7fa4638a28913402e16-98.jpg", "descriptions": "Blitzkrieg 3 is a World War II real-time strategy game from Nival."}, {"name": "Alien Breed 3: Descent", "details_link": "https://www.metacritic.com/game/xbox-360/alien-breed-3-descent", "publisher": "Team17", "release_date": "Nov 17 2010", "developers": ["Team17"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/41ccd495001d4a51ab4266831323424f-98.jpg", "descriptions": "With the Leopold and its unwanted attachment breaching the surface of an imposing ice planet, you have only a few hours to wade your way through flooded corridors and locate the origin of the threat that has so far laid waste to your once proud space ship. For the first time Conrad canWith the Leopold and its unwanted attachment breaching the surface of an imposing ice planet, you have only a few hours to wade your way through flooded corridors and locate the origin of the threat that has so far laid waste to your once proud space ship. For the first time Conrad can venture outside of the ship in the breathtaking hull walk set pieces, and for those trigger-happy shooter fans there are vicious new enemies to fight, including the Electro-Shocker alien and the awe-inspiring final bosses. New armaments are also available in Descent, with the Electro-Link gun allowing for shockingly good crowd control whilst the formidable Project X weapon will tear through anything in its path. … Expand"}, {"name": "Harry Potter and the Goblet of Fire", "details_link": "https://www.metacritic.com/game/playstation-2/harry-potter-and-the-goblet-of-fire", "publisher": "Electronic Arts", "release_date": "Nov  8 2005", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-3 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/02c772b258b426ae09bba63e0a88693e-98.jpg", "descriptions": "In Harry Potter and the Goblet of Fire, Harry is mysteriously selected as the fourth competitor in the dangerous Triwizard Tournament. Each contestant in this international competition must confront a fire-breathing dragon, rescue friends from the icy depths of the Black Lake, and navigateIn Harry Potter and the Goblet of Fire, Harry is mysteriously selected as the fourth competitor in the dangerous Triwizard Tournament. Each contestant in this international competition must confront a fire-breathing dragon, rescue friends from the icy depths of the Black Lake, and navigate the twisting mysteries of a vast, dangerous maze. Players experience all the thrills of the movie - from the Quidditch World Cup campsite to a heart-stopping duel with Lord Voldemort himself. Harry, Ron, and Hermione are all playable characters, modeled after their big-screen counterparts. In this game, an all-new spell-casting system allows players to feel the magic for the first time as the controller shakes and reacts with every flick of the wand. Players can also team up with friends in co-operative play to combine their magic and produce more powerful spells than ever before. [Electronic Arts]… Expand"}, {"name": "Trine 3: The Artifacts of Power", "details_link": "https://www.metacritic.com/game/pc/trine-3-the-artifacts-of-power", "publisher": "Frozenbyte, Inc.", "release_date": "Aug 20 2015", "developers": ["Frozenbyte", "Inc."], "platforms": ["PlayStation 4", "Switch", "PC"], "genres": ["Action Adventure", "General", "Action", "Platformer", "2D"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/f54b5f02285615c16d3791e297f5d4b6-98.jpg", "descriptions": "Trine 3: The Artifacts of Power is a fairytale journey which takes you on a quest with three heroes: Amadeus the Wizard, Pontius the Knight, and Zoya the Thief."}, {"name": "Pure Pool", "details_link": "https://www.metacritic.com/game/xbox-one/pure-pool", "publisher": "Ripstone", "release_date": "Nov 14 2014", "developers": ["VooFoo Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Alternative", "Other", "Sports", "Miscellaneous", "Parlor", "Individual", "Billiards"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/2221f95b7004c0963119828502d97e76-98.jpg", "descriptions": "The DNA option attempts to play the game like you do."}, {"name": "Arcana Heart 3: LOVE MAX!!!!!", "details_link": "https://www.metacritic.com/game/playstation-3/arcana-heart-3-love-max!!!!!", "publisher": "Aksys Games", "release_date": "Sep 23 2014", "developers": ["Examu"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/a6534b12d9a3671f7174536c1a8d109d-98.jpg", "descriptions": "It has been 2 months since the Kantou Incident—the name given to Angelia Avalon’s failed attempt to punch through the walls between dimensions in the Kantou region of Japan. During the Incident, the Drexler Institute—an organization with ties to demons—began to stir, re-activating variousIt has been 2 months since the Kantou Incident—the name given to Angelia Avalon’s failed attempt to punch through the walls between dimensions in the Kantou region of Japan. During the Incident, the Drexler Institute—an organization with ties to demons—began to stir, re-activating various projects in different parts of the world. The Japanese branch of the Drexler Institute was annihilated by the European Celestial Union, but found new life as the Rosenberg Branch of the European Celestial Union. [Aksys Games]… Expand"}, {"name": "SPACECOM", "details_link": "https://www.metacritic.com/game/pc/spacecom", "publisher": "11 bit studios", "release_date": "Sep 17 2014", "developers": ["FLOW COMBINE"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/e5f85899bdf9555f11231ca7c702ca95-98.jpg", "descriptions": "Spacecom is a strategic-to-the-bone starfleet-command game with a heavy focus on multiplayer. Using three types of fleets (siege, invade, battle) and four types of planetary systems (hubs, shipyards, repairyards and supply systems) command your armies to dominate in the galaxy. Capture enemySpacecom is a strategic-to-the-bone starfleet-command game with a heavy focus on multiplayer. Using three types of fleets (siege, invade, battle) and four types of planetary systems (hubs, shipyards, repairyards and supply systems) command your armies to dominate in the galaxy. Capture enemy hubs using proven maneuvers learned from military legends (blitzkrieg, burnt-ground, cut supply lines, outflanking) or devise your own plans. Exalt smart thinking over fast clicking in galaxies with up to six players in MP mode.… Expand"}, {"name": "Picross e4", "details_link": "https://www.metacritic.com/game/3ds/picross-e4", "publisher": "Jupiter Corporation", "release_date": "May  1 2014", "developers": ["Jupiter Corporation"], "platforms": "3DS", "genres": ["Miscellaneous", "Puzzle", "Logic"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/7dbe5795fde4f33fa722af9c94be026b-98.jpg", "descriptions": "The 4th game in the Picross e series! Now with big 20x15 puzzles! With Micross and Mega Picross modes!\r The 4th game in the Picross e series, with a Navigation Feature! As fans requested, new 20x15 puzzles have been added. Micross and Mega Picross modes are also included, with 150+ newThe 4th game in the Picross e series! Now with big 20x15 puzzles! With Micross and Mega Picross modes!\r The 4th game in the Picross e series, with a Navigation Feature! As fans requested, new 20x15 puzzles have been added. Micross and Mega Picross modes are also included, with 150+ new puzzles! Tutorials and rule options let newcomers to the series start playing with ease. With save data from previous games, you can also play additional Special Puzzles. Picross is a \"Picture Crossword Puzzle Game\" where numbers act as hints to complete images. The rules are simple and easy to grasp. Anyone can do it!… Expand"}, {"name": "Labyrinth Legends", "details_link": "https://www.metacritic.com/game/playstation-3/labyrinth-legends", "publisher": "Creat Studios", "release_date": "Dec 18 2012", "developers": ["Creat Studios"], "platforms": "PlayStation 3", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/8193b94a54b5b0337d8c8e595f383cf9-98.jpg", "descriptions": "Labyrinth Legends, Creat Studios' quirky and addictive arcade action-adventure dungeon crawler, features a unique combination of crisp graphics and dazzling visuals, inviting exploration, tricky puzzles, and exciting monster-slashing arcade action.  Players explore hidden catacombs andLabyrinth Legends, Creat Studios' quirky and addictive arcade action-adventure dungeon crawler, features a unique combination of crisp graphics and dazzling visuals, inviting exploration, tricky puzzles, and exciting monster-slashing arcade action.  Players explore hidden catacombs and ancient tombs of lost civilizations as they evade concealed traps and solve an array of intuitive puzzles. While collecting gold and discovering hidden treasure, weapons, artifacts, they must stay alert to battle foreboding mummies, zombies, ghouls and other monsters seeking to defend their turf.… Expand"}, {"name": "Nightshade", "details_link": "https://www.metacritic.com/game/playstation-2/nightshade", "publisher": "Sega", "release_date": "Feb 10 2004", "developers": ["Wow Entertainment"], "platforms": ["PC", "Switch", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/2232d27f494cdae6f17052946b4544c5-98.jpg", "descriptions": "As menacing demons and monsters fill the city of Tokyo, panicked government officials call upon the extreme cunning and power of a new ninja talent named Hibana. The amazing skills of this young female fighter earned her respect at an early age and she was offered masterful training from oneAs menacing demons and monsters fill the city of Tokyo, panicked government officials call upon the extreme cunning and power of a new ninja talent named Hibana. The amazing skills of this young female fighter earned her respect at an early age and she was offered masterful training from one of the Oboro Clan's most esteemed warriors. With sharp precision and incredible speed, Hibana battles fierce enemies atop a moving fighter jet, trucks, and more, while narrowly dodging enemy missiles. Her mastery of the ancient Tate Attack allows her to slay an unlimited number of enemies at once. With the Stealth Dash, she leaves her shadowy likeness behind as she runs circles around her lumbering enemies, which confuses them and makes them vulnerable to her fatal sword blows. Hibana alone must power through 13 incredible, destructible environments to defeat hordes of Hellspawn newly awakened by the ancient Akujiki curse. [Sega]… Expand"}, {"name": "The Invincible Iron Man", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-invincible-iron-man", "publisher": "Activision", "release_date": "Dec 15 2002", "developers": ["Torus Games"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/d8374b0515cfb22c0e544868a7964751-98.jpg", "descriptions": "The Invincible Iron Man allows you to experience the powers of Iron Man as he fights hordes of enemies while tracking down the super-villains who have stolen his battle suit technology. Using a variety of battle suit weaponry he navigates diverse levels that are filled with environmentalThe Invincible Iron Man allows you to experience the powers of Iron Man as he fights hordes of enemies while tracking down the super-villains who have stolen his battle suit technology. Using a variety of battle suit weaponry he navigates diverse levels that are filled with environmental obstacles and imminent danger. Multiple power-ups, unlockable bonus items and special pick-ups provide fans with the ultimate Iron Man experience.… Expand"}, {"name": "Need for Speed: Hot Pursuit 2", "details_link": "https://www.metacritic.com/game/gamecube/need-for-speed-hot-pursuit-2", "publisher": "Electronic Arts", "release_date": "Sep 30 2002", "developers": ["EA Seattle"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/6e657b2e00783f7ab75bab610c88a4c2-98.jpg", "descriptions": "Need for Speed is back and faster than ever in Need For Speed Hot Pursuit 2.  Engage in the next generation thrill of arcade racing with the spiritual successor to Need For Speed III Hot Pursuit.  The sequel houses a stable of exclusive and exotic cars from the world's most coveted licensorsNeed for Speed is back and faster than ever in Need For Speed Hot Pursuit 2.  Engage in the next generation thrill of arcade racing with the spiritual successor to Need For Speed III Hot Pursuit.  The sequel houses a stable of exclusive and exotic cars from the world's most coveted licensors including Ferrari, Porsche, and Lamborghini.  Become the \"champion road racer\" by conquering numerous racing events, all carrying rewards such as cars, tracks, and high performance upgrades.  The game challenges the driver to dodge traffic, police, and natural elements in high speed and high style.  And it's up to you to evade any cops on your path, since getting busted just might end your career.… Expand"}, {"name": "Spider-Man", "details_link": "https://www.metacritic.com/game/pc/spider-man", "publisher": "Activision", "release_date": "Sep 17 2001", "developers": ["Gray Matter"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/e6ab03657ca51001e964a62fee0e0717-98.jpg", "descriptions": "With eight main locations throughout Manhattan and 30 3D levels, assume the role of the spider-bitten Peter Parker in the story told through cut scenes, voice-overs, and in-game dialogue."}, {"name": "Snack World: The Dungeon Crawl Gold", "details_link": "https://www.metacritic.com/game/switch/snack-world-the-dungeon-crawl-gold", "publisher": "Level 5", "release_date": "Feb 14 2020", "developers": ["Level 5", "h.a.n.d. Inc."], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/a04fd33310f2bbc8df605b05753fb8c1-98.jpg", "descriptions": "Become a heroic adventurer in this roguelike RPG, crawling through dungeons in your search for rare treasure, on a mission to seek revenge against the villainous Sultan Vinegar that violated your village! You can even tag along in teams of up to four to take down tenacious tyrants."}, {"name": "The Biggest Loser: Ultimate Workout", "details_link": "https://www.metacritic.com/game/xbox-360/the-biggest-loser-ultimate-workout", "publisher": "THQ", "release_date": "Nov  4 2010", "developers": ["Blitz Games Studios"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/bc19e7e53899d408c37cc8c3ae24a1f7-98.jpg", "descriptions": "Developed exclusively for Kinect, the Biggest Loser includes new features, such as video diaries and online workout friends."}, {"name": "Marvel's Avengers", "details_link": "https://www.metacritic.com/game/pc/marvels-avengers", "publisher": "Square Enix", "release_date": "Sep  4 2020", "developers": ["Crystal Dynamics", "Eidos Montreal", "Nixxes Software"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 68, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/8/07292681e5c3551adff2380bcc446cdd-98.jpg", "descriptions": "Marvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend theMarvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend the Earth from escalating threats.… Expand"}, {"name": "Rain of Reflections: Chapter 1", "details_link": "https://www.metacritic.com/game/pc/rain-of-reflections-chapter-1", "publisher": "Lionbite Games", "release_date": "Oct  4 2019", "developers": ["Lionbite Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Action Adventure", "Turn-Based", "General"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/f03979475cf66e799afd8381c8e8917e-98.jpg", "descriptions": "Rain of Reflections is an atmospheric, dystopian adventure game with exploration and deep character interactions. Its turn-based strategic confrontations are uniquely centered around a motivation mechanic."}, {"name": "Effie", "details_link": "https://www.metacritic.com/game/playstation-4/effie", "publisher": "Factoria Cultural Gestio, S.L.", "release_date": "Jun  4 2019", "developers": ["Inverge Studios", "Factoria Cultural Gestio", "S.L."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/f6d5875d52d2274be1ec0395b6078cb6-98.jpg", "descriptions": "Effie is a 3D action-adventure game that combines classic elements from the genre with the exploration of an expanded world. Live a unique fantasy adventure, free the cities from a powerful and dark evil, and relive the look and feel of old-school video games."}, {"name": "Crimsonland", "details_link": "https://www.metacritic.com/game/pc/crimsonland", "publisher": "Reflexive Entertainment", "release_date": "Sep  9 2003", "developers": ["10tons Entertainment", "10tons"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/0d2a15b809d6c58b07e02188f5214880-98.jpg", "descriptions": "Thousands of aliens, giant spiders, mutant lizards, and more are on the attack - can you survive the onslaught? Crimsonland is a top-down shooter with a touch of RPG. Unlock over 30 weapons and over 50 perks from quirky to brutal. Complete the quest and show your skills in five survival modes."}, {"name": "Banjo-Pilot", "details_link": "https://www.metacritic.com/game/game-boy-advance/banjo-pilot", "publisher": "THQ", "release_date": "Jan 12 2005", "developers": ["Rare Ltd."], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/60d96fe2fa32e221bee75cd990d625c4-98.jpg", "descriptions": "Banjo Pilot is a kart-style racing game which was originally slated to become \"Diddy Kong Pilot.\" It features at least eight characters from the Banjo-Kazooie series, each with its own aircraft and storyline, including Banjo, Mumbo Jumbo, Humba Wumba, Guntilda, Klungo, Jolly RogerBanjo Pilot is a kart-style racing game which was originally slated to become \"Diddy Kong Pilot.\" It features at least eight characters from the Banjo-Kazooie series, each with its own aircraft and storyline, including Banjo, Mumbo Jumbo, Humba Wumba, Guntilda, Klungo, Jolly Roger and Kazooie. The game includes link cable support for up to four players.… Expand"}, {"name": "Big Brain Academy: Wii Degree", "details_link": "https://www.metacritic.com/game/wii/big-brain-academy-wii-degree", "publisher": "Nintendo", "release_date": "Jun 11 2007", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "1-8 ", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/902afaa2b0f21212468313e9081b9dce-98.jpg", "descriptions": "Welcome to Big Brain Academy, the only school where you can school your friends and family! How big is your brain? Find out as you test yourself with numerous lightning-fast activities like across several categories. When you enroll, headmaster Professor Lobe will introduce you to Test mode,Welcome to Big Brain Academy, the only school where you can school your friends and family! How big is your brain? Find out as you test yourself with numerous lightning-fast activities like across several categories. When you enroll, headmaster Professor Lobe will introduce you to Test mode, challenging you with a bevy of hilarous and exciting brain-teasers. Then, when it's all over, the professor will calculate your brain weight, award you with a grade, and give you an idea of what career track is best suited for your brain weight. Don't worry, it's all in the spirit of fun! Features: The Wii Remote's easy hands-on control makes playing the game a breeze. People of any age or education level can play together. Show off your smarts in multiplayer versus and co-op play modes like Mind Sprint, Mental Marathon, and Brain Quiz. The better you get at an activity, the harder it becomes. Send your grades to friends with the Wii's WiFi connection feature, WiiConnect24. While Big Brain will keeps your neurons dancing in Practice and Test mode, multiplayer and co-op modes bring challenges like only the Wii can deliver. [Nintendo]… Expand"}, {"name": "Smoke and Sacrifice", "details_link": "https://www.metacritic.com/game/playstation-4/smoke-and-sacrifice", "publisher": "Curve Digital", "release_date": "Jan 15 2019", "developers": ["Solar Sail Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/6a37e485830cded280c8e1441614ebaa-98.jpg", "descriptions": "Smoke and Sacrifice sees Sachi, a mother forced to give up her son, adventure into a grotesque underworld on a quest that will lead her to a darker truth. As she ventures into a hidden land, will Sachi ever discover the truth of what happened to her son?"}, {"name": "WRC 6: World Rally Championship", "details_link": "https://www.metacritic.com/game/xbox-one/wrc-6-world-rally-championship", "publisher": "Bandai Namco Games", "release_date": "Oct  7 2016", "developers": ["Kylotonn"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 68, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/0/107f1017c8c740cbb196ae72ef79fc80-98.jpg", "descriptions": "All 14 rounds of the 2016 WRC season, including for the first time Rally China; All the star WRC drivers and also a wide selection of WRC 2 teams and competitors from the Junior WRC category eSports WRC, the first international online competition of the WRC, which was launched in JanuaryAll 14 rounds of the 2016 WRC season, including for the first time Rally China; All the star WRC drivers and also a wide selection of WRC 2 teams and competitors from the Junior WRC category eSports WRC, the first international online competition of the WRC, which was launched in January 2016 with WRC 5, will continue in WRC 6.… Expand"}, {"name": "EA Sports Active 2", "details_link": "https://www.metacritic.com/game/xbox-360/ea-sports-active-2", "publisher": "EA Sports", "release_date": "Nov 16 2010", "developers": ["EA Canada"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/7b28a02e43d2a40a7365400ff0fa5866-98.jpg", "descriptions": "EA SPORTS Active 2.0 provides total body conditioning using progressive exercise in new prescribed programs. A three-phase, nine-week program provides a fitness roadmap to help keep users motivated and on track of their fitness goals. Additional mini-programs will also be available to addEA SPORTS Active 2.0 provides total body conditioning using progressive exercise in new prescribed programs. A three-phase, nine-week program provides a fitness roadmap to help keep users motivated and on track of their fitness goals. Additional mini-programs will also be available to add on, keeping workouts fresh and inspiring. The EA SPORTS Active personal trainer will walk users through their workout and provide continued encouragement with feedback to ensure an optimal workout experience.  … Expand"}, {"name": "Tony Hawk's Project 8", "details_link": "https://www.metacritic.com/game/psp/tony-hawks-project-8", "publisher": "Activision", "release_date": "Nov 21 2006", "developers": ["Page 44 Studios"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/8df860c35fd195deb2495ba7dd4e9e98-98.jpg", "descriptions": "Reengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players toReengineered from the ground up, Tony Hawk’s Project 8 immerses players in the definitive skateboarding experience using ultra-realistic graphics, enhanced physics and responsive controls that simulate the feeling of skating with every trick and bail. The game challenges players to experience the intensity and pressure of skating against some of the world’s top pros in true to life competitions as they aim to become the #1 skater. [Activision]… Expand"}, {"name": "Astria Ascending", "details_link": "https://www.metacritic.com/game/pc/astria-ascending", "publisher": "Dear Villagers", "release_date": "Sep 30 2021", "developers": ["Artisan Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 68, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/1688f863289245405cbc36ac57e98d2c-98.jpg", "descriptions": "Explore a vast world on the brink of chaos in a mature, emotional JRPG. Experience an epic story with rewarding turn-based combat and expansive customization rendered in glorious 4K hand drawn visuals."}, {"name": "Crash Drive 3", "details_link": "https://www.metacritic.com/game/switch/crash-drive-3", "publisher": "M2H", "release_date": "Jul  8 2021", "developers": ["M2H"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/05defcb9c88bcd97aa7d4b3288324676-98.jpg", "descriptions": "Are you ready for THE craziest multiplayer car stunting playground? Crash Drive is back!\r Experience ridiculous fun in this cross-platform multiplayer, free-roaming game! Drive monster trucks, tanks and more amazing vehicles across a huge open world. Level up, play events, earn cash,Are you ready for THE craziest multiplayer car stunting playground? Crash Drive is back!\r Experience ridiculous fun in this cross-platform multiplayer, free-roaming game! Drive monster trucks, tanks and more amazing vehicles across a huge open world. Level up, play events, earn cash, unlock new cars and discover secrets.... Crash Drive is back!\r COMPETITIVE EVENTS\rDestroy a gigantic beach ball, catch robbers as a cop or steal the king's crown, these are just a few examples of the 10 fun game events this game has to offer. Participate in these random competitive events, beat your opponents to earn the most cash and buy awesome new cars or customisations.\r CRAZY CAR LEVELING\rBy using nitro boosts you increase the car’s nitro capacity, by driving at top speed you increase its top speed... catch the drift? ‘Maxing’ all stats for a car increases your player level allowing you to buy new cars or customisations. Collect over 50+ vehicles and customise your car with funky antennas, boosts and unique number plates with your in-game name on it. Reach the maximum player level to prestige and show who is the real Crash Drive 3 boss! Solid golden car anyone?\r OPEN WORLD EXPLORATION\rTo the moon and back! Drive around freely and explore the boundless and varied open world at your leisure. Fly a rocket to the moon, storm the king’s castle in the forest, go to the saloon in the wild west canyons or experience ice drifting fun in the arctic snow. Done with icy cold? How about a relaxing ferry trip to the tropics? Each area is unique and filled with secret areas, collectibles and special easter eggs... Think you’ll ever be done exploring this world?… Expand"}, {"name": "Re:ZERO - Starting Life in Another World: The Prophecy of the Throne", "details_link": "https://www.metacritic.com/game/playstation-4/rezero---starting-life-in-another-world-the-prophecy-of-the-throne", "publisher": "Spike Chunsoft", "release_date": "Jan 29 2021", "developers": ["Spike Chunsoft", "Chime"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/1c79bfc107afe3c1f7ae601e372875d8-98.jpg", "descriptions": "One month after subaru's new life in another world began, an emissary sent by the Royal castle suddenly appears with news that the Royal selection has been postponed, but offers no reason as to why. The postponement of this grand event that decides the next ruler of the kingdom of lugunicaOne month after subaru's new life in another world began, an emissary sent by the Royal castle suddenly appears with news that the Royal selection has been postponed, but offers no reason as to why. The postponement of this grand event that decides the next ruler of the kingdom of lugunica stirs Subaru and his friends into action. They return to the Royal Capital only to find that a sixth candidate has claimed their stake for the throne. But the Dragon Stone prophesizes that only five Candidates would be chosen. With one candidate being an imposter, suspicions are immediately cast toward One woman in particular: emilia. What answers lie beyond the mysterious web of assassination, betrayal, and conspiracies...? … Expand"}, {"name": "Alien Breed", "details_link": "https://www.metacritic.com/game/playstation-3/alien-breed", "publisher": "Team17", "release_date": "Feb 12 2013", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PlayStation Vita", "PlayStation Vita", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/1c4db3bdd363b626b304caddcd3a65a7-98.jpg", "descriptions": "With the PS3 and PS Vita version they introduce additional features, such as the ability for players to team up on either system via cross-platform play. There is also ad-hoc and online co-op multiplayer for PS Vita, and local and online co-op multiplayer for PS3. There is also aWith the PS3 and PS Vita version they introduce additional features, such as the ability for players to team up on either system via cross-platform play. There is also ad-hoc and online co-op multiplayer for PS Vita, and local and online co-op multiplayer for PS3. There is also a Cross-Platform Continuation Play in the mix too, allowing players to carry on their PS3 save game progress on their PS Vita and vice versa. [Playstation.com]… Expand"}, {"name": "Taito Legends", "details_link": "https://www.metacritic.com/game/playstation-2/taito-legends", "publisher": "Sega", "release_date": "Oct 25 2005", "developers": ["Empire Oxford"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 68, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/c1d8c0272626639b0c275fd15e7e8f0c-98.jpg", "descriptions": "The complete Taito Legends title list: Space Invaders (1978), Phoenix(1980), Space Invaders Part 2 (1980), Colony 7 (1981), Electric Yoyo (1982), Jungle Hunt (1982), Zoo Keeper (1982), Elevator Action (1983), Great Swordsman (1984), Return of the Invaders (1985), Bubble Bobble (1986),The complete Taito Legends title list: Space Invaders (1978), Phoenix(1980), Space Invaders Part 2 (1980), Colony 7 (1981), Electric Yoyo (1982), Jungle Hunt (1982), Zoo Keeper (1982), Elevator Action (1983), Great Swordsman (1984), Return of the Invaders (1985), Bubble Bobble (1986), Gladiator (1986), Tokio (1986), Exzisus (1987), Plump Pop (1987), Operation Wolf (1987), Rainbow Islands (1987), Rastan (1987), Super Qix (1987), The New Zealand Story (1988), Operation Thunderbolt (1988), Battle Shark (1989), Continental Circus (1989), Plotting (1989), Volfied (1989), Ninja Kids (1990), Space Gun (1990), Thunderfox (1990) Tube It (1993). [Sega]… Expand"}, {"name": "Resident Evil 0: HD Remaster", "details_link": "https://www.metacritic.com/game/pc/resident-evil-0-hd-remaster", "publisher": "Capcom", "release_date": "Jan 19 2016", "developers": ["Capcom"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/57126e4e6f6a2513f72971cc04a6fedc-98.jpg", "descriptions": "Resident Evil 0 reveals the truth behind the Mansion Incident, the catalyst for the entire storyline of the Resident Evil series. This remastered version takes the story and gameplay of the original and adds stunning HD graphics, 5.1 channel surround sound, optional modernized controls andResident Evil 0 reveals the truth behind the Mansion Incident, the catalyst for the entire storyline of the Resident Evil series. This remastered version takes the story and gameplay of the original and adds stunning HD graphics, 5.1 channel surround sound, optional modernized controls and widescreen TV compatibility. Get ready to discover the terrible secrets lurking in the origins of evil.… Expand"}, {"name": "Aliens vs. Predator", "details_link": "https://www.metacritic.com/game/pc/aliens-vs-predator", "publisher": "Sega", "release_date": "Feb 16 2010", "developers": ["Rebellion"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/cd8385c9cd0d9843b478252a0bfa2ae6-98.jpg", "descriptions": "Developed at Rebellion by the team responsible for the original 1999 PC classic, the all-new Aliens vs. Predator allows players to take the role of three infamous species: Colonial Marines, Predators and Aliens. The game features a unique three-way online multiplayer experience, allowingDeveloped at Rebellion by the team responsible for the original 1999 PC classic, the all-new Aliens vs. Predator allows players to take the role of three infamous species: Colonial Marines, Predators and Aliens. The game features a unique three-way online multiplayer experience, allowing gamers to battle for survival and the right to be crowned the deadliest species in the galaxy. Each race also has its own distinct action-packed single-player campaign mode, with a storyline that cleverly interweaves with the other two species’ paths. Set on planet BG-386; a human colonist mining group discovers an ancient pyramid containing a dark and horrible secret. Across the galaxy, a race of warriors is alerted to the discovery of their pyramid and a hunting party is dispatched to ensure that it remains sealed at all costs. Deep inside the ruined pyramid meanwhile, nature's deadliest species awakes from centuries of hibernation intent on finding new prey. The Colonial Marine's story is an incredible fight against all odds from horrors lurking in the dark. Surrounded on all sides yet armed to the teeth, the Colonial Marine represents humanity's last stand with the firepower to fight back. As the Alien, players discover what it's like to be the scariest, most murderous creature in the universe, with the ability to traverse any surface at lightning speed in order to get close enough to unleash its deadly claws, tail and teeth. A master of the hunt, the Predator grants the player an arsenal of exotic weaponry with which to stalk from the shadows. Earn the greatest honor by ambushing prey up-close, before butchering them for a gory trophy kill. [Sega]… Expand"}, {"name": "A Golden Wake", "details_link": "https://www.metacritic.com/game/pc/a-golden-wake", "publisher": "Wadjet Eye Games", "release_date": "Oct  9 2014", "developers": ["Grundislav Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "Point-and-Click"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/438d22fbdcdb8a0630de593e30a805a3-98.jpg", "descriptions": "A Golden Wake is a nostalgic adventure that spans two dramatic decades in American history. Set in the era of Gatsby with a plot that includes real people, locations, and events, A Golden Wake has story- and puzzle-driven gameplay, retro-styled pixel art, and a point-and-click interfaceA Golden Wake is a nostalgic adventure that spans two dramatic decades in American history. Set in the era of Gatsby with a plot that includes real people, locations, and events, A Golden Wake has story- and puzzle-driven gameplay, retro-styled pixel art, and a point-and-click interface reminiscent of classics like King's Quest and Monkey Island. Alfie's power of persuasion will play a unique role as he analyzes other characters' attitudes and weaknesses to figure out the best way to approach them.… Expand"}, {"name": "Lead and Gold: Gangs of the Wild West", "details_link": "https://www.metacritic.com/game/playstation-3/lead-and-gold-gangs-of-the-wild-west", "publisher": "Paradox Interactive", "release_date": "May  4 2010", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Historic", "Historic", "Arcade"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/1a3b5ef2f0b55067b5de0077a0852d3d-98.jpg", "descriptions": "[Playstation Network]  Lead and Gold: Gangs of the Wild West is a third person shooter delivering an intense team based multiplayer experience. Relive the violent era of the Wild West as it ought to be with adrenaline fueled action and fast paced gunfights. Fight gritty battles in[Playstation Network]  Lead and Gold: Gangs of the Wild West is a third person shooter delivering an intense team based multiplayer experience. Relive the violent era of the Wild West as it ought to be with adrenaline fueled action and fast paced gunfights. Fight gritty battles in beautifully rendered classic western settings. Test your mettle in genre specific game modes and levels tailor-made for satisfying team play. Lead and Gold features the unique Synergy system, a power up system encouraging co-operation and team tactics. The Synergy system permeates the frantic shooter gameplay and rewards the player for objective oriented gameplay. [Paradox Interactive]… Expand"}, {"name": "Serious Sam 4", "details_link": "https://www.metacritic.com/game/pc/serious-sam-4", "publisher": "Devolver Digital", "release_date": "Sep 24 2020", "developers": ["Croteam"], "platforms": ["PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/76edcda040f9acfdafecf9d7c694518e-98.jpg", "descriptions": "Serious Sam 4 reignites the classic FPS series in a high-powered prequel loaded with an explosive arsenal, intergalactic carnage, and perfectly timed one-liners."}, {"name": "Disgaea 6 Complete", "details_link": "https://www.metacritic.com/game/playstation-5/disgaea-6-complete", "publisher": "NIS America", "release_date": "Jun 28 2022", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 68, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/5/7726bcedeb4d6e104c8b123bca7f1b55-98.jpg", "descriptions": "Zed is a boastful zombie who wallows on the lowest rung on the Netherworld ladder alongside his sister Bieko. When a God of Destruction threatens their way of (un)life, Zed must harness his unique ability of Super Reincarnation to stand against the approaching menace. Along the way, he willZed is a boastful zombie who wallows on the lowest rung on the Netherworld ladder alongside his sister Bieko. When a God of Destruction threatens their way of (un)life, Zed must harness his unique ability of Super Reincarnation to stand against the approaching menace. Along the way, he will unite with twisted and colorful denizens of the Netherworld, face challenges around and within, and see if even an undying hooligan like himself can defy the odds! Disgaea 6: Defiance of Destiny unites a grim yet touching story with insane tactical combat, while introducing gameplay elements never before seen in previous installments. As a result, new and returning players alike can craft a truly memorable and unique journey through the Netherworld. Bring the pain in battle with special attacks and support from a plethora of ally units. Customizable settings such as Auto, Retry, and Replay allow both hardcore and casual players to fight their own way. And should things take a terrible turn, use Super Reincarnation to rejoin the fight and keep trying until you succeed. This truly is a Netherworld fit for everyone! From Grave to Glory: Join Zed in his quest to rise above his lowly status and challenge a God of Destruction. Along the way, meet zany characters, explore chaotic new worlds, and discover the power of sibling bonds and determination. Undying and Unstoppable: Experience over-the-top tactical combat, complete with insane special attacks and a wide variety of allies to choose from. And when things get too hairy, use Super Reincarnation to keep trying until you succeed! A Netherworld for Everyone: With customizable gameplay features such as Autoplay and Demon Intelligence, both new and returning players can forge a HL-raising experience that fits their lifestyle. Diving into DISGAEA has never been easier! Additionally, Disgaea 6 Complete includes new recolor DLC as well as all previously released character and cosmetic DLC. … Expand"}, {"name": "Reverie Knights Tactics", "details_link": "https://www.metacritic.com/game/playstation-4/reverie-knights-tactics", "publisher": "1C Entertainment", "release_date": "Jan 25 2022", "developers": ["40 Giants Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/daffd2c9ef38cdce8234c8bb93c62b1f-98.jpg", "descriptions": "Reverie Knights Tactics is a turn-based tactical RPG with strategic battles in isometric grids where every decision can alter the story. Travel through a hand-drawn fantasy world and lead your heroes in a story-rich adventure, visual novel style."}, {"name": "Arrog", "details_link": "https://www.metacritic.com/game/playstation-4/arrog", "publisher": "Nakana.io", "release_date": "Feb  5 2021", "developers": ["LEAP Game Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/93eadb860dff1f0549164e2d0a46067e-98.jpg", "descriptions": "Arrog is an enigmatic puzzle adventure game featuring hand-drawn art and set in a bizarre black-and-white world with color accents."}, {"name": "Yupitergrad", "details_link": "https://www.metacritic.com/game/pc/yupitergrad", "publisher": "Gamedust", "release_date": "Aug 27 2020", "developers": ["Gamedust"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Shooter", "First-Person", "3D", "Arcade"], "meta_score": 68, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/8072634efd569b3295c52a658ba3410b-98.jpg", "descriptions": "Brave dream of VR gaming. Grappling hooks, wacky humor, spatial stunts, motion sickness countermeasures, Dieselpunk adventure, space acrobatics, and out-of-the-box puzzles. Yupitergrad has it ALL."}, {"name": "Golf With Your Friends", "details_link": "https://www.metacritic.com/game/xbox-one/golf-with-your-friends", "publisher": "Team17", "release_date": "May 19 2020", "developers": ["Blacklight Interactive"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 68, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/6c136f510cff8f1c8ef68ddb389809c5-98.jpg", "descriptions": "Golf With Your Friends is an entertaining, challenging, multiplayer mini golf game for up to 12 players. The game currently has 3 levels containing 18 holes each. The controls are simple and the game is designed for the user to be able to host or join a game within a few seconds."}, {"name": "TT Isle of Man", "details_link": "https://www.metacritic.com/game/pc/tt-isle-of-man", "publisher": "Bigben Interactive", "release_date": "Mar 27 2018", "developers": ["Kylotonn"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 68, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/9b1d7686bcac8a23b88b85718b109b57-98.jpg", "descriptions": "For bikers, there are two types of speed races: the Isle of Man TT and the rest. No race is more difficult. Take up the challenge of the legendary Snaefell Mountain course: all 37.73 miles faithfully reproduced with the champions and their bikes."}, {"name": "Light Tracer", "details_link": "https://www.metacritic.com/game/playstation-4/light-tracer", "publisher": "Oasis Games", "release_date": "Sep 26 2017", "developers": ["Oasis Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/1ea7e8d06c2259157002a6a4b0eb936a-98.jpg", "descriptions": "Light Tracer is a VR platform puzzler in which the player is a godlike creature who has to guide a princess in despair up the enormous Tower of Bellbatis."}, {"name": "911 Operator", "details_link": "https://www.metacritic.com/game/pc/911-operator", "publisher": "PlayWay", "release_date": "Feb 24 2017", "developers": ["Jutsu Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/a80b34ad1cf7bcf5d1552c678a527a15-98.jpg", "descriptions": "911 OPERATOR is a game about the difficult work of people that manage emergency lines and services. Main task is to answer incoming calls and to react properly ­- give first aid instructions, advise, dispatch correct number of fireman, police, ambulances, or sometimes just ignore the call."}, {"name": "iO", "details_link": "https://www.metacritic.com/game/playstation-4/io", "publisher": "Gamious", "release_date": "Feb 14 2017", "developers": ["Gamious"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/72643fae8d993982ca08e5f6615b3044-98.jpg", "descriptions": "iO is an abstract Puzzle Platformer about size, speed, mass and momentum. Change your size, weight and speed in order to solve some of the trickiest puzzles. Toy with the laws of physics, reach your destination as quick as possible and grab that gold medal as your reward."}, {"name": "Rockstar Games presents Table Tennis", "details_link": "https://www.metacritic.com/game/wii/rockstar-games-presents-table-tennis", "publisher": "Rockstar Games", "release_date": "Oct 16 2007", "developers": ["Rockstar San Diego"], "platforms": ["Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Other", "Tennis"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/dc585ac8df1408f37217602ae3b7eb98-98.jpg", "descriptions": "\"Our goal was to create a game that is perfectly addictive in its focused simplicity, a game that showcases the true possibilities of a next gen experience, not just in looks but in feel and pace,\" stated Sam Houser, Founder and Executive Producer of Rockstar Games. \"We wanted to use the\"Our goal was to create a game that is perfectly addictive in its focused simplicity, a game that showcases the true possibilities of a next gen experience, not just in looks but in feel and pace,\" stated Sam Houser, Founder and Executive Producer of Rockstar Games. \"We wanted to use the power of the new hardware and the resolution of new televisions to give the game an immediacy, an intensity and a sense of physicality and reality, resulting in a purer, more visceral experience that simply was not possible previously.\" Houser continued, \"It is a distillation of game design philosophy, focusing on removing the traditional areas of compromise inherent in managing size and scope and concentrating the hardware's entire power on one activity, with the aim of doing that better than it's ever been done before.\" [Rockstar Games]… Expand"}, {"name": "UFO: Extraterrestrials", "details_link": "https://www.metacritic.com/game/pc/ufo-extraterrestrials", "publisher": "Tri Synergy", "release_date": "May  4 2007", "developers": ["Chaos Concept"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "Sci-Fi", "Tactics"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/f90abd6d4545b9aead36d35698f2b3d5-98.jpg", "descriptions": "The year is now 2025 and on the newly colonized planet Esperanza our space devices have not just been approached by alien machines but attacked. The player controls a squad of soldiers, light and heavy support combat vehicles, robots and air units located in a base on the planet EsperanzaThe year is now 2025 and on the newly colonized planet Esperanza our space devices have not just been approached by alien machines but attacked. The player controls a squad of soldiers, light and heavy support combat vehicles, robots and air units located in a base on the planet Esperanza that had been colonized by the spaceship Magalhaes in the year 2023. This squad was brought together by the Esperanza government to face a threat that comes from deep space. In case the player succeeds in averting an alien impact on Esperanza, the story will continue on the planet Earth which has been subdued by alien forces. The title combines global strategy with small, squad-based tactical combat against an alien invasion. To repel the alien invasion the player must take full advantage of the terrain and his surrounding environments. [Tri Synergy]… Expand"}, {"name": "Recompile", "details_link": "https://www.metacritic.com/game/pc/recompile", "publisher": "Dear Villagers", "release_date": "Aug 19 2021", "developers": ["Phigames"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/541c0c6fc47870b04df73547e68d28c7-98.jpg", "descriptions": "This atmospheric, Metroidvania hacking adventure lets you take control of a semi-sapient program struggling against deletion. In the sprawling 3D world of a Mainframe, Recompile features intense combat, tight 3D platforming, super-powered abilities and an environmental logic-based hacking This atmospheric, Metroidvania hacking adventure lets you take control of a semi-sapient program struggling against deletion. In the sprawling 3D world of a Mainframe, Recompile features intense combat, tight 3D platforming, super-powered abilities and an environmental logic-based hacking mechanic. … Expand"}, {"name": "DanceStar Party Hits", "details_link": "https://www.metacritic.com/game/playstation-3/dancestar-party-hits", "publisher": "SCEE", "release_date": "Oct 12 2012", "developers": ["SCEE"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/0e0222ad0813b58f337d6388eddbfd53-98.jpg", "descriptions": "Learn the hottest dance moves with an amazing track list packed with 40 pumping songs from your favourite artists. Get everyone at your party involved and score extra points by belting out those big choruses together. Groove along to original music videos and then check out your fancyLearn the hottest dance moves with an amazing track list packed with 40 pumping songs from your favourite artists. Get everyone at your party involved and score extra points by belting out those big choruses together. Groove along to original music videos and then check out your fancy footwork via video playbacks.… Expand"}, {"name": "Samba de Amigo", "details_link": "https://www.metacritic.com/game/wii/samba-de-amigo", "publisher": "Sega", "release_date": "Sep 23 2008", "developers": ["Gearbox Software"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/f16f1640515487ff67d654ce584c26d8-98.jpg", "descriptions": "Created exclusively for the Wii home video game system, this vibrant new game lets players shake to the beats of a samba-infused soundtrack comprised of popular new songs as well as fan-favourites from the original game. Playing as the grinning, sombrero-topped monkey, Amigo, players shakeCreated exclusively for the Wii home video game system, this vibrant new game lets players shake to the beats of a samba-infused soundtrack comprised of popular new songs as well as fan-favourites from the original game. Playing as the grinning, sombrero-topped monkey, Amigo, players shake the Wii Remote and Nunchuk like maracas, in time with the visual beats of the music on-screen. Samba De Amigo is packed with lively stages and a host of colourful characters. [Sega]… Expand"}, {"name": "Fable Anniversary", "details_link": "https://www.metacritic.com/game/xbox-360/fable-anniversary", "publisher": "Microsoft Game Studios", "release_date": "Feb  4 2014", "developers": ["Lionhead Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/9c06c1d4eb0ad5162a47f08ab2200173-98.jpg", "descriptions": "Create a hero based on your actions: age and evolve a hero or villain through the actions you select and the path you follow - be it for good, evil, or somewhere on the continuum. Fabricate your living legend: Through deeds and actions, build a name for yourself across the land. RecruitCreate a hero based on your actions: age and evolve a hero or villain through the actions you select and the path you follow - be it for good, evil, or somewhere on the continuum. Fabricate your living legend: Through deeds and actions, build a name for yourself across the land. Recruit allies and followers. Gain glory or notoriety. Who will you be? With an entirely new lighting system, slick new interface, all new textures, models and gameplay, Fable Anniversary is the full HD, definitive Fable experience. Fable Anniversary includes all-new Xbox 360 exclusive content, including Achievements, The Lost Chapters and Xbox SmartGlass integration.… Expand"}, {"name": "BioShock Infinite: Burial at Sea - Episode One", "details_link": "https://www.metacritic.com/game/xbox-360/bioshock-infinite-burial-at-sea---episode-one", "publisher": "2K Games", "release_date": "Nov 12 2013", "developers": ["Irrational Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/8eb90fb88d60cdba6bbcce6ac1299552-98.jpg", "descriptions": "Come back to Rapture in a story that finds Booker and Elizabeth on the eve of the underwater city's fall from grace. Developed by Irrational Games, the developer of the original BioShock and BioShock Infinite, this DLC features Rapture as you've never seen it before-a shining jewel at theCome back to Rapture in a story that finds Booker and Elizabeth on the eve of the underwater city's fall from grace. Developed by Irrational Games, the developer of the original BioShock and BioShock Infinite, this DLC features Rapture as you've never seen it before-a shining jewel at the bottom of the ocean, built almost entirely from scratch in the BioShock Infinite engine. Gameplay has been modified to give the player an original BioShock combat experience that merges the best parts of BioShock and BioShock Infinite: new weapons, new Plasmids/Vigors, Tears, Sky-Lines, and Big Daddies.… Expand"}, {"name": "Horse Life", "details_link": "https://www.metacritic.com/game/ds/horse-life", "publisher": "D3Publisher", "release_date": "Nov  6 2007", "developers": ["Neko Entertainment"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/80966b818e2518828d911a4d98a26c12-98.jpg", "descriptions": "Horse Life immerses players in the equestrian world by putting a horse right inside of their DS. Using the touch screen and microphone players must keep their horse happy and fit by feeding them, cleaning their stall and riding them. Most importantly, players put their training to the testHorse Life immerses players in the equestrian world by putting a horse right inside of their DS. Using the touch screen and microphone players must keep their horse happy and fit by feeding them, cleaning their stall and riding them. Most importantly, players put their training to the test by participating in national and international competitions to earn prestige and money to become a great champion. Players choose from three horse breeds, French Saddle, English Thoroughbred and Thoroughbred Arabian that they can customize by choosing the name and coat color. Once players begin their training they can visit the Tack Shop to purchase over 80 different items such as clothing, saddles or food and treats for their horse. As players complete levels of competition, they unlock the ultimate prize, a secret horse breed! [D3Publisher of America]… Expand"}, {"name": "Serious Sam Double D XXL", "details_link": "https://www.metacritic.com/game/xbox-360/serious-sam-double-d-xxl", "publisher": "Mastertronic", "release_date": "Feb 20 2013", "developers": ["Mommy's Best Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/8cbb4ec08d6ce241e2d8a8d8849941bd-98.jpg", "descriptions": "Inspired by the shout-out-loud awesome adventures of Serious Sam, this title is part of the Serious Sam Indie Series -- a collection of Serious Sam games designed and developed by some of the most talented independent developers in the world. Acclaimed indie developers take the reins of theInspired by the shout-out-loud awesome adventures of Serious Sam, this title is part of the Serious Sam Indie Series -- a collection of Serious Sam games designed and developed by some of the most talented independent developers in the world. Acclaimed indie developers take the reins of the award-winning series and unleash their own brand of mayhem on carnage-craving gamers.… Expand"}, {"name": "Throne of Darkness", "details_link": "https://www.metacritic.com/game/pc/throne-of-darkness", "publisher": "Sierra Entertainment", "release_date": "Sep 24 2001", "developers": ["Click Entertainment"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/29d1ebe03b374eb5b4638ecda2b9baa1-98.jpg", "descriptions": "In the ancient land of Yamato, an aging and power-hungry warlord, in his desire to live forever, has unleashed an unspeakable horror-the demon Zanshin and his horde of monsters and undead warriors. The land is soaked in the blood of your people, and the seven samurai in your party areIn the ancient land of Yamato, an aging and power-hungry warlord, in his desire to live forever, has unleashed an unspeakable horror-the demon Zanshin and his horde of monsters and undead warriors. The land is soaked in the blood of your people, and the seven samurai in your party are Yamato's only hope. Use magic, weaponry, and wits to destroy Zanshin - before his darkness becomes complete.  [Sierra Studios]… Expand"}, {"name": "Nintendo Labo: Toycon 02 Robot Kit", "details_link": "https://www.metacritic.com/game/switch/nintendo-labo-toycon-02-robot-kit", "publisher": "Nintendo", "release_date": "Apr 20 2018", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/cff0a23bd23c9ab95580e3bb19d61597-98.jpg", "descriptions": "The box for the Variety Kit is 17.7 x 13.6 x 2.6 inches, and the one for the Robot Kit is 17.7 x 13.6 x 2.9 inches. We took some pictures of the finished Toy-Con creations so you can get a sense of their size. Some Toy-Con projects include accessory parts, as well, like the knobs for theThe box for the Variety Kit is 17.7 x 13.6 x 2.6 inches, and the one for the Robot Kit is 17.7 x 13.6 x 2.9 inches. We took some pictures of the finished Toy-Con creations so you can get a sense of their size. Some Toy-Con projects include accessory parts, as well, like the knobs for the Toy-Con Piano and tools for the Toy-Con Robot. Organizing them this way makes it easy to store all your completed Variety Kit Toy-Con in one place.… Expand"}, {"name": "The Charnel House Trilogy", "details_link": "https://www.metacritic.com/game/pc/the-charnel-house-trilogy", "publisher": "Mastertronic", "release_date": "Apr 16 2015", "developers": ["Owl Cave"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/e47672ad964132fd8f0ad6aec9c2af56-98.jpg", "descriptions": "Witness The Charnel House Trilogy, the chronicle of one fateful night aboard a train bound for Augur Peak. Three horrifying adventure games in one, from the depths of the Sepulchre, starring Madeleine Roux, Peter Willington, Jonathan Grier, Jim Sterling, and Ben Chandler as Grub."}, {"name": "Galactic Assault: Prisoner of Power", "details_link": "https://www.metacritic.com/game/pc/galactic-assault-prisoner-of-power", "publisher": "Paradox Interactive", "release_date": "Sep 11 2007", "developers": ["Wargaming.net"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "General", "Tactics"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/ebe95eb929a11664dbbcbe3625d52cea-98.jpg", "descriptions": "Maxim Kammerer (Max) is a daring young man who enlists in his country's space exploration program. During a mission, his ship is shot down over Saraksh, a remote planet that is slowly recovering from a savage nuclear conflict. Upon recovering from the crash landing, Max finds himself in theMaxim Kammerer (Max) is a daring young man who enlists in his country's space exploration program. During a mission, his ship is shot down over Saraksh, a remote planet that is slowly recovering from a savage nuclear conflict. Upon recovering from the crash landing, Max finds himself in the Land of Unknown Fathers, a country ruled by a network of mind control transmissions. Max manages to destroy the center of the mind control network, which leads to several implications for the nation's inhabitants. Intent on destroying the entire race of the Land of the Fathers through warfare are three fierce and unrelenting enemies: The Khonties, Barbarians and the Insular Empire. Each race possesses and can easily develop distinguishable technologies. Heavy armor, transport and aviation units unique to each race are all represented on the battlefield. Combat takes place among 3D vivid extraterrestrial landscapes, with day and night changes affecting gameplay alongside dynamic weather conditions. A thick haze of exhaust hangs heavy over steel battle machines; the ground becomes scorched and scarred by the trademarks of tanks and other heavy vehicles; artillery fire scratches, burns and breaches heavily armored units. [Paradox Interactive]… Expand"}, {"name": "TT Isle of Man: Ride On The Edge", "details_link": "https://www.metacritic.com/game/xbox-one/tt-isle-of-man-ride-on-the-edge", "publisher": "Bigben Interactive", "release_date": "Mar  6 2018", "developers": ["Kylotonn", "Maximum Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/64adbfb934669c9abf4ca7ecadd0c4f9-98.jpg", "descriptions": "For bikers, there are only 2 types of speed races: the Isle of Man TT, and the rest. No other race is as grueling for the motorbikes and demanding for the riders. Assume the challenge of the Snaefell Mountain course: all 37.73 miles faithfully reproduced with the champions and their bikes."}, {"name": "Avencast: Rise of the Mage", "details_link": "https://www.metacritic.com/game/pc/avencast-rise-of-the-mage", "publisher": "Stardock", "release_date": "Nov  8 2007", "developers": ["ClockStone Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/082d6260f10b2776ea202c4f601795b4-98.jpg", "descriptions": "Avencast: Rise of the Mage is a Role Playing Game set in a perilous fantasy world. The player begins his journey as an adept attending the renowned magic academy – AVENCAST – a place of learning in a world of wizardry, wonder and untold mystery. When Avencast is descended upon by demonicAvencast: Rise of the Mage is a Role Playing Game set in a perilous fantasy world. The player begins his journey as an adept attending the renowned magic academy – AVENCAST – a place of learning in a world of wizardry, wonder and untold mystery. When Avencast is descended upon by demonic hordes the very survival of his world is at stake. While the hero grows in power and becomes a battle scrarred mage, he must fight off nightmarish creatures and transcend dimensions into the past to track down his own destiny. Avencast: Rise of the Mage is a game accessible to both novice RPG players while still challenging core RPG and Action fans with a variety of skills and strategies. [LightHouse Interactive]… Expand"}, {"name": "Nancy Drew: The Creature of Kapu Cave", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-the-creature-of-kapu-cave", "publisher": "Her Interactive", "release_date": "Oct 19 2006", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/ccc02bcf94206b6b58dd49302b6b4613-98.jpg", "descriptions": "You, as Nancy Drew, go to Hawaii to serve as a research assistant to Dr. Quigley Kim. A devastating scourge is destroying the pineapple crop causing residents to whisper that a local research compound has awoken the legendary Kane Okala.  Upon arriving, she discovers the camp ravaged withYou, as Nancy Drew, go to Hawaii to serve as a research assistant to Dr. Quigley Kim. A devastating scourge is destroying the pineapple crop causing residents to whisper that a local research compound has awoken the legendary Kane Okala.  Upon arriving, she discovers the camp ravaged with Dr. Kim missing. Coincidentally, the Hardy Boys are also on the Island to complete top secret mission, but it’s up to Nancy to uncover this intricate web of mysteries. [Her Interactive]… Expand"}, {"name": "Ninja Blade", "details_link": "https://www.metacritic.com/game/xbox-360/ninja-blade", "publisher": "Microsoft Game Studios", "release_date": "Apr  7 2009", "developers": ["From Software"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/cb1b85cf2df25d3c01326193782125e0-98.jpg", "descriptions": "Ninja Blade is an action adventure game set within modern day Tokyo. Parasites known as alpha-worms have mysteriously appeared, unleashing a wave of human destruction as they rapidly spread east, reaching the shores of Tokyo. With the future of humankind hanging in the balance, an exclusiveNinja Blade is an action adventure game set within modern day Tokyo. Parasites known as alpha-worms have mysteriously appeared, unleashing a wave of human destruction as they rapidly spread east, reaching the shores of Tokyo. With the future of humankind hanging in the balance, an exclusive and elite team possessing highly specialized skills is formed to eliminate the enemy onslaught, and ultimately save mankind from complete obliteration. Unique ninja abilities: Use your Ninja Vision to detect and analyze potential enemy weak points, secret paths, and hidden information within the environment, but be careful, as you are susceptible to extra damage while using your vision. And perform the todomé attack to destroy an enemy's core (heart), by dealing a fatal wound. Balanced and calculated use of both these abilities will be critical to progressing through the game. Variety of weapons, tools, and Ninjutsu: Specialized ninja powers offer an enticing array of options. Varied environments force players to think strategically about which set of weapons and tools will be most effective at conquering the different levels. From dual wielding swords to grapple wire hooks to grenades, every item has distinctive features and characteristics, so choose wisely! Ninjutsu is a special power that results in an explosive electrical force to either stun enemies or protect oneself from attack. Only true Ninja Masters can achieve this technique. Interactive quick-time events: Scattered throughout integral parts of the storyline, characters come across various quick-time events providing the opportunity to directly interact with in-game cut scenes. Quick reflexes are rewarded during the intense battles. Modern realism: Ninja Blade offers a fresh twist to the classic ninja saga by basing all 3-D gaming maps directly from the actual skyscrapers and building tops in modern day Tokyo. [Microsoft]… Expand"}, {"name": "The Callisto Protocol", "details_link": "https://www.metacritic.com/game/pc/the-callisto-protocol", "publisher": "KRAFTON Inc.", "release_date": "Dec  2 2022", "developers": ["Striking Distance Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/7709e72ebed88214ec8332eb22402297-98.jpg", "descriptions": "Set on Jupiter's moon Callisto in the year 2320, The Callisto Protocol is a next-generation take on survival horror. The game challenges players to escape the maximum security Black Iron Prison and uncover its terrifying secrets. A blend of horror, action, and immersive storytelling, theSet on Jupiter's moon Callisto in the year 2320, The Callisto Protocol is a next-generation take on survival horror. The game challenges players to escape the maximum security Black Iron Prison and uncover its terrifying secrets. A blend of horror, action, and immersive storytelling, the game aims to set a new bar for horror in interactive entertainment.… Expand"}, {"name": "Mega Man X8", "details_link": "https://www.metacritic.com/game/playstation-2/mega-man-x8", "publisher": "Capcom", "release_date": "Dec  7 2004", "developers": ["Valuewave Co.,Ltd."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/c8a5ceadd9549205870cdf1533d8d7df-98.jpg", "descriptions": "Starring Mega Man and allies Zero and Axl, the eighth \"X\" saga is an all new action-adventure packed with more features, depth and variety than the series has ever seen. Your quest begins with war-torn Earth, left in shambles after the fall-out of Sigma's war on the planet. Humankind,Starring Mega Man and allies Zero and Axl, the eighth \"X\" saga is an all new action-adventure packed with more features, depth and variety than the series has ever seen. Your quest begins with war-torn Earth, left in shambles after the fall-out of Sigma's war on the planet. Humankind, planning a mass exodus to the moon, has been mass-producing a new generation of robot reploids to start colonizing it. But Sigma has corrupted their DNA to make them turn on humans. This time, you and your team-mates must head to outer space and eventually the moon on an out-of-this world mission of epic proportions to save mankind! [Capcom]… Expand"}, {"name": "Soulstice", "details_link": "https://www.metacritic.com/game/pc/soulstice", "publisher": "Modus Games", "release_date": "Sep 20 2022", "developers": ["Reply Game Studios"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/1dbba7724ac8662a3c064c2330b4091c-98.jpg", "descriptions": "The balance of the Holy Kingdom of Keidas is compromised when powerful, feral creatures known as \"Wraiths\" invade from the other side of the Veil, threatening to consume the living. The \"Chimeras\", hybrid warriors born of the union of two souls, are the only ones who can protect humankind.The balance of the Holy Kingdom of Keidas is compromised when powerful, feral creatures known as \"Wraiths\" invade from the other side of the Veil, threatening to consume the living. The \"Chimeras\", hybrid warriors born of the union of two souls, are the only ones who can protect humankind.\r Briar and Lute are two sisters who have been reborn as a Chimera. The transformation has granted Briar superhuman strength and resilience, while Lute, who was sacrificed in order to bind her soul to her sister's, has become a ghost with mystical powers. Voiced by Stefanie Joosten (Metal Gear Solid 5), Briar and Lute are sent on a mission to reclaim a city in ruins that has been ravaged by the Wraiths, only to discover that the Order they belong to has a far more complex plan in mind.\r Explore a dark world brimming with hidden mysteries, master a diverse combat system, and inhabit the dual forces of two sisters in a coming-of-age fantasy story with fast-paced action, vicious enemies and breathtaking boss fights.… Expand"}, {"name": "Deliver Us The Moon", "details_link": "https://www.metacritic.com/game/pc/deliver-us-the-moon", "publisher": "KeokeN Interactive", "release_date": "Oct 10 2019", "developers": ["KeokeN Interactive"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/988f11aea35dd0852cb0738b291853e0-98.jpg", "descriptions": "Deliver Us The Moon is a Sci-Fi thriller set in an apocalyptic near future, where Earth's natural resources are depleted. A lone astronaut is sent to the moon on a critical mission to save humanity from extinction."}, {"name": "Fortune Street", "details_link": "https://www.metacritic.com/game/wii/fortune-street", "publisher": "Nintendo", "release_date": "Dec  5 2011", "developers": ["Marvelous AQL"], "platforms": "Wii", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/a78da85c12811870203d92a62be30ea4-98.jpg", "descriptions": "(Known as \"Boom Street\" in the UK/EU) Fortune Street lets players become familiar characters from the Nintendo and DRAGON QUEST universes in a board game that challenges them to play the real estate and stock markets wisely to win."}, {"name": "Top Spin 3", "details_link": "https://www.metacritic.com/game/wii/top-spin-3", "publisher": "2K Sports", "release_date": "Jun 23 2008", "developers": ["Pam Development"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/e04671cf2d4991ca98b2dac8b4bd7ad9-98.jpg", "descriptions": "The intuitive pick-up-and-play action in Top Spin Tennis allows gamers to use the Wii Remote and Nunchuk controllers in a way that matches the movements players would make on a real court. The Nunchuk controls the player and aim, while the vibration-enabled Wii Remote hits the ball like aThe intuitive pick-up-and-play action in Top Spin Tennis allows gamers to use the Wii Remote and Nunchuk controllers in a way that matches the movements players would make on a real court. The Nunchuk controls the player and aim, while the vibration-enabled Wii Remote hits the ball like a tennis racquet and determines the style of shot ranging from a top spin move to a slice. The Wii Remote also allows players to control the power and the quality of the shot and to serve in many different ways. The gameplay in Top Spin Tennis features an array of modes including singles, doubles, mixed and non-mixed matches, exhibition, tournament and more, with four levels of difficulty and ten international venues. It also features more than a dozen licensed tennis stars as well as ten original characters. Up to four players can play Top Spin Tennis using as many as four sets of controllers. To add to the group fun, there are a collection of party games included. [2K Sports]… Expand"}, {"name": "Minecraft: Story Mode - Episode 4: A Block and a Hard Place", "details_link": "https://www.metacritic.com/game/pc/minecraft-story-mode---episode-4-a-block-and-a-hard-place", "publisher": "Telltale Games", "release_date": "Dec 22 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "Adventure", "Point-and-Click", "Linear"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/06e84608678298d9515e937609ba6159-98.jpg", "descriptions": "Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon,Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your crew stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. [Telltale Games]… Expand"}, {"name": "BloodRayne: Betrayal", "details_link": "https://www.metacritic.com/game/xbox-360/bloodrayne-betrayal", "publisher": "Majesco Games", "release_date": "Sep  7 2011", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Fantasy", "General", "Platformer", "Fantasy", "Third-Person", "2D", "Fantasy"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/df38f062293a10373c930a3553395e38-98.jpg", "descriptions": "BloodRayne: Betrayal will be a 2D side-scrolling action game, with the titular half-vampire warrior and a new ally working together to thwart the plans of a group of evil vampires."}, {"name": "The Evil Within", "details_link": "https://www.metacritic.com/game/pc/the-evil-within", "publisher": "Bethesda Softworks", "release_date": "Oct 13 2014", "developers": ["Tango Gameworks"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/ac4b0de8c6fcb5cd315e64b26982221d-98.jpg", "descriptions": "While investigating the scene of a gruesome mass murder, Detective Sebastian Castellanos and his partners encounter a menacing and powerful force. After witnessing the slaughter of fellow officers, Sebastian is ambushed and knocked unconscious. When he awakens, he finds himself in a derangedWhile investigating the scene of a gruesome mass murder, Detective Sebastian Castellanos and his partners encounter a menacing and powerful force. After witnessing the slaughter of fellow officers, Sebastian is ambushed and knocked unconscious. When he awakens, he finds himself in a deranged world where hideous creatures wander among the dead. Facing unimaginable terror, and fighting for survival, Sebastian embarks on a daunting journey to unravel that which is behind this evil force.… Expand"}, {"name": "JETT: The Far Shore", "details_link": "https://www.metacritic.com/game/playstation-5/jett-the-far-shore", "publisher": "Superbrothers", "release_date": "Oct  5 2021", "developers": ["Superbrothers", "Pine Scented Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/02becf1f8af4f9ccf72d4c58c81e90df-98.jpg", "descriptions": "JETT: The Far Shore invites you on an interstellar trip to carve out a future for a people haunted by oblivion in this cinematic action-adventure. As scout Mei, be the first to deploy to a mythic ocean planet. Take the helm of a 'jett' and explore a vast unknown – skim low over waves, roarJETT: The Far Shore invites you on an interstellar trip to carve out a future for a people haunted by oblivion in this cinematic action-adventure. As scout Mei, be the first to deploy to a mythic ocean planet. Take the helm of a 'jett' and explore a vast unknown – skim low over waves, roar up pristine coastlines and carve through otherworldly woods. Adapt to an intricate, systemic open world and persevere through adversity alongside an intimate ensemble cast in this story of courage, wonder and regret.\r Embark on an exploratory single-player adventure presented in five captivating acts encompassing monumental moments, laid-back exploration, occasional white-knuckle action, moments of heartfelt companionship, and a helping of existential dread. \r… Expand"}, {"name": "Rango", "details_link": "https://www.metacritic.com/game/xbox-360/rango", "publisher": "Paramount Digital Entertainment", "release_date": "Mar  1 2011", "developers": ["Behaviour Interactive"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/86358dfca4c1833accdc65615afc4e27-98.jpg", "descriptions": "Rango The Video Game invites players to continue on Rango's journey through new adventures inspired by the movie."}, {"name": "Little Red Riding Hood's Zombie BBQ", "details_link": "https://www.metacritic.com/game/ds/little-red-riding-hoods-zombie-bbq", "publisher": "Destineer", "release_date": "Nov  6 2008", "developers": ["EnjoyUp Games"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Rail", "Rail"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/f9bf0820d24ba68c92603c8adc285a1f-98.jpg", "descriptions": "Blast hordes of wacky cartoon leper-zombies in this DS shooter."}, {"name": "Go! Go! Break Steady", "details_link": "https://www.metacritic.com/game/xbox-360/go!-go!-break-steady", "publisher": "Microsoft Game Studios", "release_date": "Jul 23 2008", "developers": ["Little Boy Games"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/d87b2c2dde9863017bd019a3d816213d-98.jpg", "descriptions": "[Xbox Live Arcade]  Take on DJ Scruffy and the Beatniks in this combination rhythm and puzzle game. Featuring original gameplay, a unique visual style, and six amazing characters breakdancing to 20 finger-tapping songs, Go! Go! Break Steady is the ultimate hybrid of two popular and[Xbox Live Arcade]  Take on DJ Scruffy and the Beatniks in this combination rhythm and puzzle game. Featuring original gameplay, a unique visual style, and six amazing characters breakdancing to 20 finger-tapping songs, Go! Go! Break Steady is the ultimate hybrid of two popular and challenging genres. Will Hydro and his \"All City Crew\" become the Break Steady Tournament Champs and take home the most prizes? The answer depends on your own rhythm and smarts. Play it solo, team up with your friends, or play online to see who has the real Break Steady \"skillz!\" This original game combines the best of the music and puzzle game genres. The game features a unique visual style with characters break dancing to the beats of twenty new songs. Enjoy both multiplayer versus and cooperative local and multiplayer modes. [Microsoft]… Expand"}, {"name": "Battlefield 2042", "details_link": "https://www.metacritic.com/game/pc/battlefield-2042", "publisher": "Electronic Arts", "release_date": "Nov 12 2021", "developers": ["EA DICE"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 68, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/1/cc367940467c7eaab726ad7efd1fc862-98.jpg", "descriptions": "Battlefield 2042 marks the return to the iconic all-out warfare of the franchise. Adapt and overcome dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal. With support for 128 players*, prepare for unprecedented scale on vast environments. Take on massiveBattlefield 2042 marks the return to the iconic all-out warfare of the franchise. Adapt and overcome dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal. With support for 128 players*, prepare for unprecedented scale on vast environments. Take on massive experiences, from updated multiplayer modes like Conquest and Breakthrough to the all-new Hazard Zone..… Expand"}, {"name": "The Blind Prophet", "details_link": "https://www.metacritic.com/game/pc/the-blind-prophet", "publisher": "ARS GOETIA", "release_date": "Feb  5 2020", "developers": ["ARS GOETIA"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/4d9307cab9d50e12980e53c7244338b1-98.jpg", "descriptions": "A point'n'Click adventure game. Resolve mysteries and fight the Great Evil."}, {"name": "The Long Journey Home", "details_link": "https://www.metacritic.com/game/pc/the-long-journey-home", "publisher": "Daedalic Entertainment", "release_date": "May 30 2017", "developers": ["Daedalic Studio West"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/c8c45c8ae7697c99a8a2933a9620a025-98.jpg", "descriptions": "Explore an endlessly shifting universe. Forge alliances with powerful alien races. Harness your crew’s skills, from research to archaeology to space combat. Do whatever it takes to get Home."}, {"name": "Spider-Man: Battle for New York", "details_link": "https://www.metacritic.com/game/ds/spider-man-battle-for-new-york", "publisher": "Activision", "release_date": "Nov 14 2006", "developers": ["Torus Games"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/d21d2061cde6f54600eae8137e3d17cd-98.jpg", "descriptions": "Spider-Man: Battle for New York allows gamers to take on the role of Spider-Man and one of his famed nemeses, Green Goblin, in an original storyline which builds upon their legendary comic book rivalry. For the first time in a handheld Spider-Man game, players can personalize their gamingSpider-Man: Battle for New York allows gamers to take on the role of Spider-Man and one of his famed nemeses, Green Goblin, in an original storyline which builds upon their legendary comic book rivalry. For the first time in a handheld Spider-Man game, players can personalize their gaming experiences by choosing what abilities and powers to upgrade and when, such as Spider-Man’s web maneuvers or Green Goblin’s fire attacks, as they progress through the game. Playing as both good and evil, gamers will experience levels packed with frenzied action, in-depth combat and a host of unique super moves as they embark on the ultimate quest to save New York City from almost certain disaster. [Activision]… Expand"}, {"name": "Tom Clancy's Splinter Cell Pandora Tomorrow", "details_link": "https://www.metacritic.com/game/game-boy-advance/tom-clancys-splinter-cell-pandora-tomorrow", "publisher": "Ubisoft", "release_date": "Mar 24 2004", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/c1ca55d61466e252cc612dacc8916c4d-98.jpg", "descriptions": "Tom Clancy's Splinter Cell: Pandora Tomorrow, the sequel to the stealth-action game Splinter Cell, once again casts you in the role of Sam Fisher, who is sent in to destroy top-secret documentation held in the embassy of militia leader Suhadi Sadono.  Use all-new moves and prototype gear toTom Clancy's Splinter Cell: Pandora Tomorrow, the sequel to the stealth-action game Splinter Cell, once again casts you in the role of Sam Fisher, who is sent in to destroy top-secret documentation held in the embassy of militia leader Suhadi Sadono.  Use all-new moves and prototype gear to infiltrate buildings and spare the hostages.  This time, you can take your games of espionage against three other players in online multiplayer mode, in which you choose to play as either a mercenary or spy.  You've got the moves and the gear, now put them to use.… Expand"}]