[{"name": "Saint Seiya: Brave Soldiers", "details_link": "https://www.metacritic.com/game/playstation-3/saint-seiya-brave-soldiers", "publisher": "Namco Bandai Games", "release_date": "Nov 26 2013", "developers": ["Dimps Corporation"], "platforms": "PlayStation 3", "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 55, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/28dc04e1a9fe29ef2b18b121acc466c1-98.jpg", "descriptions": "Developed by Osaka based game developer Dimps, Saint Seiya Brave Soldiers will feature playable characters from the Sanctuary, Poseidon and Hades arcs within the Saint Seiya universe. Players will realize their dreams of battling the most vile and evil characters from Saint Seiya inDeveloped by Osaka based game developer Dimps, Saint Seiya Brave Soldiers will feature playable characters from the Sanctuary, Poseidon and Hades arcs within the Saint Seiya universe. Players will realize their dreams of battling the most vile and evil characters from Saint Seiya in one-on-one bouts that take place through the storylines from the anime series. The game will present enhanced graphics and effects; bringing the animated series to life like never before. Saint Seiya Brave Soldiers also gives players the ability to execute devastating combos and special moves as seen in the TV show. As players progress through the game, they will access the ability to enhance their chosen character's hit-point, strength levels, and Cosmos Power Gauge. Explosive online encounters await players via versus and ranking modes. … Expand"}, {"name": "DiRT 2", "details_link": "https://www.metacritic.com/game/psp/dirt-2", "publisher": "Codemasters", "release_date": "Sep  8 2009", "developers": ["Codemasters", "Sumo Digital"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 55, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/960dc1ec9569abb43a0b79e786bb7c12-98.jpg", "descriptions": "(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking players on an exhilarating World Tour, DiRT 2 delivers over 100 stunning events, including aggressive, multi-vehicle races and intense solo challenges, set in the most diverse and demanding real-world environments. From the muddy tracks of the Malaysian rainforest to spectator-packed stadiums in London and Los Angeles, racers compete in contemporary off-road race disciplines covering Rallycross, Trailblazer, Raid, Landrush, and Rally. Embracing the culture and new heroes of modern off-road racing, DiRT 2 features an exciting line-up of the best new rally drivers - including the multi medal-winning Subaru Rally Team USA driver Ken Block alongside Travis Pastrana, Dave Mirra, and Tanner Faust, who help players build their racing career. [Codemasters]… Expand"}, {"name": "X-Men Origins: Wolverine", "details_link": "https://www.metacritic.com/game/ds/x-men-origins-wolverine", "publisher": "Activision", "release_date": "May  1 2009", "developers": ["Griptonite Games"], "platforms": "DS", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 55, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/41f239555cddd28b7cd50907ba841f90-98.jpg", "descriptions": "X-Men Origins: Wolverine is an action-adventure game based on the movie of the same name and will take you through and beyond the movie's storyline."}, {"name": "Disney Pirates of the Caribbean: At World's End", "details_link": "https://www.metacritic.com/game/playstation-3/disney-pirates-of-the-caribbean-at-worlds-end", "publisher": "Disney Interactive Studios", "release_date": "May 22 2007", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Action Adventure", "Historic", "Historic", "Linear"], "meta_score": 55, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/d683bf7dccf11cd44f6a3e608c925e9b-98.jpg", "descriptions": "At World's End video games from Disney Interactive Studios invite players to \"live and die by the sword\" as they venture to the worlds of the films and beyond while playing as Captain Jack Sparrow, Will Turner and Elizabeth Swann. [Disney Interactive Studios]"}, {"name": "Anamorphine", "details_link": "https://www.metacritic.com/game/playstation-4/anamorphine", "publisher": "Artifact 5", "release_date": "Jul 31 2018", "developers": ["Artifact 5"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 55, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/8/433e29b284cefa8dd82c69e952112386-98.jpg", "descriptions": "Anamorphine is a first-person surreal exploration game where the player experiences the memories of the main character after an unknown trauma. You play as Tyler, who is finding himself as he hits rock bottom. Discover what happened by journeying through Tyler's memories of his relationshipAnamorphine is a first-person surreal exploration game where the player experiences the memories of the main character after an unknown trauma. You play as Tyler, who is finding himself as he hits rock bottom. Discover what happened by journeying through Tyler's memories of his relationship with his wife Elena and her depression. Escape his reality, or face it and figure out how to move on as Tyler's subconscious twists the game in unexpected ways.… Expand"}, {"name": "Don King Boxing", "details_link": "https://www.metacritic.com/game/wii/don-king-boxing", "publisher": "2K Sports", "release_date": "Mar 31 2009", "developers": ["2K Shanghai"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 55, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/d1b71c39ae69e5908817511909573cf6-98.jpg", "descriptions": "2K Sports, in collaboration with legendary promoter Don King, brings you an unprecedented look into the sport of professional boxing. Feel what it's like to be a real PRO boxer in your very own living room with the Wii Balance Board™. Duck and dodge blows and throw counter punches with both2K Sports, in collaboration with legendary promoter Don King, brings you an unprecedented look into the sport of professional boxing. Feel what it's like to be a real PRO boxer in your very own living room with the Wii Balance Board™. Duck and dodge blows and throw counter punches with both hands, all while trying to maintain your center of balance on the Wii Balance Board. Add to that over 20 actual licensed boxers, a deep career mode, and an intuitive multiplayer split screen mode, and you’ve got a gaming experience that immerses players into the sport of boxing like never before. [2K Sports]… Expand"}, {"name": "Virtua Quest", "details_link": "https://www.metacritic.com/game/gamecube/virtua-quest", "publisher": "Sega", "release_date": "Jan 19 2005", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 55, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/9b02fb6a77cae5701cdc4005a96795e2-98.jpg", "descriptions": "In Virtua Quest, you play the role Sei, a young boy. As you explore each stage, you'll discover Virtua Souls, data clusters that contain information about the martial arts abilities of the legendary Virtua Fighter characters. With each cluster, you gain the ability to perform complexIn Virtua Quest, you play the role Sei, a young boy. As you explore each stage, you'll discover Virtua Souls, data clusters that contain information about the martial arts abilities of the legendary Virtua Fighter characters. With each cluster, you gain the ability to perform complex fighting moves. As the story progresses, you discover that only you can unlock the potential of the Virtua Souls--a discovery that soon gains the attention of Judgement 6, an evil syndicate.… Expand"}, {"name": "Kingdom Under Fire: Circle of Doom", "details_link": "https://www.metacritic.com/game/xbox-360/kingdom-under-fire-circle-of-doom", "publisher": "Microsoft Game Studios", "release_date": "Jan  8 2008", "developers": ["Blueside"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 55, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/d69b25c1038d7e260a7bc42daa9c8b40-98.jpg", "descriptions": "Departing from Action RTS formula of the previous Kingdom Under Fire series, Circle of Doom makes full use of the Xbox 360's power to present adrenaline-pumping action with stylish combat maneuvers and eye-popping effects. Players explore randomly generated vast dungeons and battle monstersDeparting from Action RTS formula of the previous Kingdom Under Fire series, Circle of Doom makes full use of the Xbox 360's power to present adrenaline-pumping action with stylish combat maneuvers and eye-popping effects. Players explore randomly generated vast dungeons and battle monsters swarming the screen in thousands and attacking from all directions along the floors, walls, and ceilings of the dungeons. As the game progresses, the heroes will find increasingly devastating and spectacular ways to defeat massive enemy forces in the forms of new abilities and weapons, or even create their own arsenal by combining the existing ones. Taking maximum advantage of the Xbox 360 online features, single-player and multiplayer modes are merged seamlessly. Players may choose to play alone, or better yet, recruit 4-player parties on the way and continue their quest as a team via Xbox Live. Each player can take their single-player characters to the co-op mode or create a new character with useful skills to compliment each other. They can even trade their own custom-crafted items with other party members. [Blueside]… Expand"}, {"name": "Centipede & Millipede", "details_link": "https://www.metacritic.com/game/xbox-360/centipede-millipede", "publisher": "Atari", "release_date": "May  2 2007", "developers": ["Stainless Games"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Shooter", "Shooter", "Compilation", "Static", "Static"], "meta_score": 55, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/7893076f04477c3b7101fa52d884b3cd-98.jpg", "descriptions": "[Xbox Live Arcade]  Atari's Centipede is easy to learn, but the tension builds relentlessly as the game progresses. Destroy the Centipede as it moves faster and faster through a colorful mushroom field, as well as protect yourself from a deadly Flea and a ferocious Spider. As with Centipede,[Xbox Live Arcade]  Atari's Centipede is easy to learn, but the tension builds relentlessly as the game progresses. Destroy the Centipede as it moves faster and faster through a colorful mushroom field, as well as protect yourself from a deadly Flea and a ferocious Spider. As with Centipede, Atari's Millipede is easy to learn, but the tension builds relentlessly as the game progresses. You'll find many more bugs and the ability to start at higher levels.  Hi-def experience: The game includes support for 4:3 and 16:9 aspects rations, including HDTV. Start playing with full-screen anti-aliasing and Dolby Digital surround sound. See the top scores on the Xbox LIVE Leaderboards and score 12 achievements. You can download the game onto your Memory Unit and take your game with you. [Microsoft]… Expand"}, {"name": "Jaws Unleashed", "details_link": "https://www.metacritic.com/game/pc/jaws-unleashed", "publisher": "Majesco Games", "release_date": "Oct 18 2006", "developers": ["Appaloosa Interactive"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 55, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/c8c7b2c65a89e92a3fee8011cab31683-98.jpg", "descriptions": "In Majesco's Jaws, players assume the role of a Great White shark driven to a predacious frenzy by the sonic emanations of underwater oil drilling equipment. To defend their underwater territory, players undertake a campaign to drive the raiders away while simultaneously solving a series ofIn Majesco's Jaws, players assume the role of a Great White shark driven to a predacious frenzy by the sonic emanations of underwater oil drilling equipment. To defend their underwater territory, players undertake a campaign to drive the raiders away while simultaneously solving a series of action-based puzzles designed to thwart the player. Taking the game to realistic heights is Appaloosa's advanced game engine that produces stunning underwater visuals and realistic physics that enable the Great White to perform a variety of leaping, twisting assaults, thus rendering havens such as dive platforms and boats vulnerable to attack. [Majesco]… Expand"}, {"name": "BurgerTime: World Tour", "details_link": "https://www.metacritic.com/game/xbox-360/burgertime-world-tour", "publisher": "MonkeyPaw Games", "release_date": "Nov  2 2011", "developers": ["MonkeyPaw Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/009aab60ee8e18cdaa2a91668e21481b-98.jpg", "descriptions": "Take the role of Peter Pepper and traverse the globe defeating chefs from the world capitals of cuisine. Forty sizzling levels in all!"}, {"name": "Mega Man Star Force 2: Zerker x Saurian", "details_link": "https://www.metacritic.com/game/ds/mega-man-star-force-2-zerker-x-saurian", "publisher": "Capcom", "release_date": "Jun 24 2008", "developers": ["Capcom"], "platforms": "DS", "num_players": "1-6 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 55, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/2766761d1ca8a028e0c1325132cfe48b-98.jpg", "descriptions": "Mega Man Star Force 2 continues two months after the previous game left off. Geo Stelar and crew return to battle a whole host of UMA’s (unidentified animated beings) and a new rival character appears named \"Rogue.\" Amidst this new conflict, a mysterious organization emerges with plans toMega Man Star Force 2 continues two months after the previous game left off. Geo Stelar and crew return to battle a whole host of UMA’s (unidentified animated beings) and a new rival character appears named \"Rogue.\" Amidst this new conflict, a mysterious organization emerges with plans to revive the ancient civilization of \"Mu\" by utilizing the force of an ancient heritage \"OOPArt.\" It's up to Geo and his virus-busting buddy, Omega-Xis, to thwart this latest threat. Mega Man Star Force 2 blends a unique formula of RPG exploration elements with fast-paced action, as players travel and battle between coexisting worlds, the physical world and the virtual Wave World, to unravel the mystery around this new troublemaker. Players encounter enemies in the virtual Wave World and battle them on three-by-five battle grids with their Battle Card deck. Mega Man Star Force 2 also adds an upgraded Transer system. [Capcom]… Expand"}, {"name": "Fury (2007)", "details_link": "https://www.metacritic.com/game/pc/fury-2007", "publisher": "Gamecock Media Group", "release_date": "Oct 16 2007", "developers": ["Auran"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 55, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/c4f8dfc1936735d2ff1a0493a12efad4-98.jpg", "descriptions": "Taking the brightest elements emblazoned in the hearts of MMO fans and combining them with traditional RPG gameplay, Fury has culminated in the ultimate competitive online RPG. Advanced combat, in-depth character advancement and teamwork mixed with fast paced and diverse game types make upTaking the brightest elements emblazoned in the hearts of MMO fans and combining them with traditional RPG gameplay, Fury has culminated in the ultimate competitive online RPG. Advanced combat, in-depth character advancement and teamwork mixed with fast paced and diverse game types make up the core of Fury's gameplay. The dynamic cycle lets you fight, earn rewards and customize your avatar with a richness and depth never before seen or attempted. The evolution of Fury's combat system is a union of hardcore RPG factors with elemental changes, providing action packed gaming at a feverish pace. Bring these outstanding battle scenarios together with unparalleled matchmaking ensures players will always experience a fun and well matched fight. Plus, character development has been brought to all new levels letting your unique personality and style shine through at every level. Unleash the fury. [Gamecock]… Expand"}, {"name": "Sense: A Cyberpunk Ghost Story", "details_link": "https://www.metacritic.com/game/switch/sense-a-cyberpunk-ghost-story", "publisher": "Top Hat Studios Inc", "release_date": "Jan  7 2021", "developers": ["Suzaku"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 55, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/e96aa546bed15f0113b9911a37b4b19e-98.jpg", "descriptions": "A 2.5D horror game inspired by Clock Tower and Fatal Frame, mixing cyberpunk with traditional Cantonese folklore. With careful attention to pacing, atmosphere and storytelling, Sense hopes to return the horror genre to its roots by celebrating visceral horror and the slow, fearful creep of dread."}, {"name": "A.W.: Phoenix Festa", "details_link": "https://www.metacritic.com/game/playstation-vita/aw-phoenix-festa", "publisher": "Bandai Namco Games", "release_date": "Jul 26 2016", "developers": ["Bandai Namco Games"], "platforms": "PlayStation Vita", "genres": ["Role-Playing", "Action RPG"], "meta_score": 55, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/1/4e8c1aaa85dba7f8ebcb43a5c3b4c541-98.jpg", "descriptions": "Live the Events of the Asterisk War. In this action RPG, experience the events of The Asterisk War series. Assume the role of hero Ayato Amagiri and go through Rikka Academy and the Phoenix Festa storyline. Players trip simulated high school experiences while fighting in over-the-top tournaments."}, {"name": "X-Men: The Official Game", "details_link": "https://www.metacritic.com/game/game-boy-advance/x-men-the-official-game", "publisher": "Activision", "release_date": "May 16 2006", "developers": ["WayForward"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 55, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/a4a17cd31b8fe295b224facb9c26b897-98.jpg", "descriptions": "Master the power of the X-Men--Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms asMaster the power of the X-Men--Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms as lightning-fast Iceman. For even more power, utilize fury and adrenaline modes. Become a part of the X-Men movie universe--Embark on a globe-spanning conflict featuring every element of the X-Men universe--from favorite villains to famous locations such as Alkali Lake, plus the voices and likenesses of key actors from the films. Battle fierce enemies, join forces with comrades--Face off against movie villains such as Pyro, Magneto and Sabretooth, plus added foes like legions of Sentinels. Storm, Colossus and Cyclops join forces with you in gameplay that includes melee fighting, stealth-style action and time-based missions.… Expand"}, {"name": "Tecmo Classic Arcade", "details_link": "https://www.metacritic.com/game/xbox/tecmo-classic-arcade", "publisher": "Tecmo", "release_date": "Sep 14 2005", "developers": ["Tecmo"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/13d23552e55c0fcf24a42ac814b43fdd-98.jpg", "descriptions": "Tecmo offers you a dose of nostalgia in the game compilation Tecmo Classic Arcade. Eleven of Tecmo's early games are included, along with a gallery that shows artwork from each game. The disc includes Tecmo Bowl, Rygar, Star Force, Solomon's Key, Bomb Jack, Tecmo Cup, Pinball Action,Tecmo offers you a dose of nostalgia in the game compilation Tecmo Classic Arcade. Eleven of Tecmo's early games are included, along with a gallery that shows artwork from each game. The disc includes Tecmo Bowl, Rygar, Star Force, Solomon's Key, Bomb Jack, Tecmo Cup, Pinball Action, Pleiades, Senjyo, Swimmer, and Stratofighter.… Expand"}, {"name": "Salt Lake 2002", "details_link": "https://www.metacritic.com/game/game-boy-advance/salt-lake-2002", "publisher": "Ubisoft", "release_date": "Jan 19 2002", "developers": ["DC Studios"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 55, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/e97935f698cb3d878ece35bf6760e922-98.jpg", "descriptions": "This game will feature six official events based on the 2002 Olympic Winter Games."}, {"name": "Homefront: The Revolution", "details_link": "https://www.metacritic.com/game/pc/homefront-the-revolution", "publisher": "Deep Silver", "release_date": "May 17 2016", "developers": ["Deep Silver Dambuster Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Shooter", "Modern", "Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 54, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/3/26c34e5c38f4883cac7c03f1cb85bb5f-98.jpg", "descriptions": "Coming to Xbox One, the all-in-one games and entertainment system from Microsoft, PlayStation 4, PC, Mac and Linux in 2015, Homefront: The Revolution throws players into a near future dystopia. Catastrophic events have brought the United States to its knees and enabled the Korean People'sComing to Xbox One, the all-in-one games and entertainment system from Microsoft, PlayStation 4, PC, Mac and Linux in 2015, Homefront: The Revolution throws players into a near future dystopia. Catastrophic events have brought the United States to its knees and enabled the Korean People's Army forces to impose a brutal military occupation. Trapped in this American nightmare, Philadelphia has become a police state, where surveillance drones and armored patrols keep her once-proud citizens at heel, crushing any dissent with totalitarian force.… Expand"}, {"name": "Moebius: Empire Rising", "details_link": "https://www.metacritic.com/game/pc/moebius-empire-rising", "publisher": "Phoenix Online Publishing", "release_date": "Apr 15 2014", "developers": ["Pinkerton Road Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 54, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/ab675fe8765638f1b909c31f39c17c0d-98.jpg", "descriptions": "Moebius: Empire Rising is a contemporary adventure that merges classic point-and-click puzzle solving with Jane Jensen’s sophisticated storytelling. Travel the world using Malachi’s unique deductive powers to analyze suspects, make historical connections, and uncover the truth behind aMoebius: Empire Rising is a contemporary adventure that merges classic point-and-click puzzle solving with Jane Jensen’s sophisticated storytelling. Travel the world using Malachi’s unique deductive powers to analyze suspects, make historical connections, and uncover the truth behind a theory of space and time the government will defend at any cost. … Expand"}, {"name": "The Legend of Spyro: The Eternal Night", "details_link": "https://www.metacritic.com/game/playstation-2/the-legend-of-spyro-the-eternal-night", "publisher": "Sierra Entertainment", "release_date": "Oct  2 2007", "developers": ["Krome Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 54, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/d57dbd0f61feabeb79c316183ee7a6b2-98.jpg", "descriptions": "The Legend of Spyro: The Eternal Night continues the strong action-infused gameplay focus established in The Legend of Spyro: A New Beginning and takes it even further with new powers, including: Four new, upgradeable Breath Attacks (one for each element type), such as Ice Bomb, ElectricThe Legend of Spyro: The Eternal Night continues the strong action-infused gameplay focus established in The Legend of Spyro: A New Beginning and takes it even further with new powers, including: Four new, upgradeable Breath Attacks (one for each element type), such as Ice Bomb, Electric Orb, Earth Vine, Enhanced Fire; Four new elemental melee moves, including Comet Dash, Artic Blast, Earth Pound, Electric Spin; Four new Fury attacks – Earth, Electricity, Ice, Fire; Monstrous new and explosive boss battles against the likes of Skabb the Pirate, Gaul the Ape King and more. The Legend of Spyro: The Eternal Night also expands Spyro's combat arsenal by adding \"Dragon Time,\" a new advanced move that allows Spyro to bend time to his will.  Players can engage Dragon Time to dodge attacks, out-maneuver enemies or solve tricky time-based environmental puzzles. [Sierra Entertainment]… Expand"}, {"name": "MUD - FIM Motocross World Championship", "details_link": "https://www.metacritic.com/game/xbox-360/mud---fim-motocross-world-championship", "publisher": "Namco Bandai Games", "release_date": "Feb 26 2013", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "General", "Arcade", "Motorcycle", "Automobile", "Motocross", "Motocross"], "meta_score": 54, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/4724ba8ba50984648eba0b60e4b10aa6-98.jpg", "descriptions": "MUD - FIM Motocross World Championship is the only videogame that exclusively features the MX1 and MX2 championships, as well as the amazing Monster Energy FIM Motocross of Nations. The brand new game engine features 14 different bikes, 84 riders (including stars such as Ryan Villopoto, TonyMUD - FIM Motocross World Championship is the only videogame that exclusively features the MX1 and MX2 championships, as well as the amazing Monster Energy FIM Motocross of Nations. The brand new game engine features 14 different bikes, 84 riders (including stars such as Ryan Villopoto, Tony Cairoli, Chad Reed, Ryan Dungey and Ken Roczen) and 12 official tracks, and also features fully deformable terrain conditions, a realistic MX handling model and much more. MUD - FIM Motocross World Championship promises to deliver the most challenging and fulfilling motocross gaming experience ever seen.… Expand"}, {"name": "Disney*Pixar WALL-E", "details_link": "https://www.metacritic.com/game/ds/disneypixar-wall-e", "publisher": "THQ", "release_date": "Jun 24 2008", "developers": ["Helixe"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Platformer", "Party / Minigame", "3D", "3D"], "meta_score": 54, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/6d0e351192a0530ad076520b12cc5e3d-98.jpg", "descriptions": "What if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets aWhat if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets a sleek search robot named EVE. EVE comes to realize that WALL-E has inadvertently stumbled upon the key to the planet’s future, and races back to space to report her findings to the humans (who have been eagerly awaiting word that it is safe to return home). Meanwhile, WALL-E chases EVE across the galaxy and sets into motion one of the most exciting and imaginative comedy adventures ever brought to the big screen. Joining WALL-E on his fantastic journey across a universe of never-before-imagined visions of the future, is a hilarious cast of characters including a pet cockroach, and a heroic team of malfunctioning misfit robots. Players of the game take control of WALL-E and EVE through a fast-paced adventure based on the Disney/Pixar film. The game allows fans to relive some of the movie’s most thrilling moments as they explore 10 worlds filled with non-stop action and adventure, along with head-to-head multiplayer challenges. Players will recognize the storyline, characters and key locations from the WALL-E film as they carry out intense missions, dodge dangerous enemies and navigate their way through a futuristic world. In addition, the game contains new storylines and environments that movie-goers will not see in theaters. [THQ]… Expand"}, {"name": "CSI: Miami", "details_link": "https://www.metacritic.com/game/pc/csi-miami", "publisher": "Ubisoft", "release_date": "Nov 16 2004", "developers": ["369 Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 54, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/e04317fb469f8f8d1f6adc48fe6aff3c-98.jpg", "descriptions": "CSI: Miami follows the format of Ubisoft's successful \"CSI: Crime Scene Investigation\" game series. Players will solve a number of complex cases working with the stars of the show. Investigation includes using high-tech forensic tools to find the evidence, as well as interrogation and puzzleCSI: Miami follows the format of Ubisoft's successful \"CSI: Crime Scene Investigation\" game series. Players will solve a number of complex cases working with the stars of the show. Investigation includes using high-tech forensic tools to find the evidence, as well as interrogation and puzzle solving. \"CSI: Miami\" is a fast-paced drama inspired by the top-rated series CSI: Crime Scene Investigation that follows a South Florida team of forensic investigators who use both cutting-edge scientific methods and old-fashioned police work to solve crimes. [Ubisoft]… Expand"}, {"name": "I Heart Geeks!", "details_link": "https://www.metacritic.com/game/ds/i-heart-geeks!", "publisher": "cdv Software", "release_date": "Dec 20 2011", "developers": ["SevenOne Intermedia"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 54, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/53a05660e1d04b03e6e1ce8f64e851e7-98.jpg", "descriptions": "Produced in cooperation with Marc Ecko Entertainment, the game features a tongue-in-cheek story and hip art style where the brainy geek overcomes the brawny (and bullying) jocks, winning the heart of the beautiful cheerleader. A friendly interface and helpful tutorials along with the gradualProduced in cooperation with Marc Ecko Entertainment, the game features a tongue-in-cheek story and hip art style where the brainy geek overcomes the brawny (and bullying) jocks, winning the heart of the beautiful cheerleader. A friendly interface and helpful tutorials along with the gradual introduction of puzzles of ever-increasing difficulty and complexity, multiple solutions, and wireless support to allow players to face off against one another in timed puzzle-solving races round out the features. [cdv Software]… Expand"}, {"name": "Anthem", "details_link": "https://www.metacritic.com/game/playstation-4/anthem", "publisher": "Electronic Arts", "release_date": "Feb 22 2019", "developers": ["BioWare"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 54, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/0/8557d72bda1b29772a20eb12e1158bc6-98.jpg", "descriptions": "Anthem is a shared-world action-RPG in which players delve into a vast world teeming with amazing technology and forgotten treasures. The world is also filled with savage beasts and ruthless marauders where Freelancers are called to defeat the forces plotting to conquer humanity. In Anthem,Anthem is a shared-world action-RPG in which players delve into a vast world teeming with amazing technology and forgotten treasures. The world is also filled with savage beasts and ruthless marauders where Freelancers are called to defeat the forces plotting to conquer humanity. In Anthem, up to 4 friends unravel the world’s mysteries and take on its most fearsome challenges together. Shared danger means shared glory, and successful Freelancers are all be richly rewarded for successful exploits. Throughout their adventure, players outfit their Freelancers with powerful Javelin exosuits, each of which are equipped with unique weapons and abilities. Players also customize their Javelin with gear they earn and craft throughout the adventure, and leave a lasting mark on the world. [Electronic Arts]… Expand"}, {"name": "POSTAL Redux", "details_link": "https://www.metacritic.com/game/pc/postal-redux", "publisher": "Running With Scissors", "release_date": "May 20 2016", "developers": ["Running With Scissors"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 54, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/9daa12a0a2895ef7e07ea2166476ffa4-98.jpg", "descriptions": "POSTAL Redux is an HD remake of the dark and surreal twin-stick isometric shooter. Assume control of The Postal Dude as he fights to survive in a world gone mad with violence."}, {"name": "Knack", "details_link": "https://www.metacritic.com/game/playstation-4/knack", "publisher": "SCEA", "release_date": "Nov 15 2013", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 4", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 54, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/79001199c84db28192bd5c2a8a96c3a9-98.jpg", "descriptions": "Knack is an action game for the PlayStation 4 announced by lead system architect Mark Cerny at the PlayStation Meeting. Players take control of a robot named Knack who is created to help neutralize the goblin threat that has taken over the peaceful land."}, {"name": "Soul Axiom", "details_link": "https://www.metacritic.com/game/xbox-one/soul-axiom", "publisher": "Wales Interactive", "release_date": "Jun  8 2016", "developers": ["Wales Interactive"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/1b9a5b9f93e4cfa44d10655396bd7686-98.jpg", "descriptions": "From the studio that brought you Master Reboot comes a first-person story-driven adventure puzzle game, set in the beautiful, haunting cyber-world of Elysia. Collect unique hand powers, discover multiple endings and choose your own destiny as you unravel the mystery of your digital afterlife."}, {"name": "Gemini: Heroes Reborn", "details_link": "https://www.metacritic.com/game/pc/gemini-heroes-reborn", "publisher": "Phosphor Games Studio, LLC", "release_date": "Jan 18 2016", "developers": ["Phosphor Games Studio", "LLC", "Phosphor Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 54, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/dee27c199645210b7d4cd92fe6de89bf-98.jpg", "descriptions": "Gemini: Heroes Reborn is a first person action-adventure that asks users to enter into the role of Cassandra, on a journey to unlock incredible powers, unique in the Heroes Universe."}, {"name": "Battle of Europe", "details_link": "https://www.metacritic.com/game/pc/battle-of-europe", "publisher": "Strategy First", "release_date": "Mar 23 2006", "developers": ["MAUS Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Historic", "Historic", "Arcade"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/bde268ffeedb411dd5c6b836bd1c1538-98.jpg", "descriptions": "Battle of Europe is a fully 3D arcade action game. Taking place in the skies over Europe, players are taken through breathtaking terrain modeled for London, Norway, Dunkirk and Berlin. A full hanger of fighters and bombers completely submerse the player in the reality of the World War IIBattle of Europe is a fully 3D arcade action game. Taking place in the skies over Europe, players are taken through breathtaking terrain modeled for London, Norway, Dunkirk and Berlin. A full hanger of fighters and bombers completely submerse the player in the reality of the World War II flying aces; risking their lives daily in countless dog fights, and returning home in a smoking plane littered with bullet holes ...if at all. [Strategy First]… Expand"}, {"name": "Grand Theft Auto: The Trilogy - The Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-5/grand-theft-auto-the-trilogy---the-definitive-edition", "publisher": "Rockstar Games", "release_date": "Nov 11 2021", "developers": ["Rockstar Games", "Grove Street Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 54, "users_score": 0.9, "image": "https://static.metacritic.com/images/products/games/9/71aa3a5706af39170926466d75730826-98.jpg", "descriptions": "Three iconic cities, three epic stories. Play the genre-defining classics of the original Grand Theft Auto Trilogy: Grand Theft Auto III, Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas updated for a new generation, now with across-the-board enhancements including brilliant newThree iconic cities, three epic stories. Play the genre-defining classics of the original Grand Theft Auto Trilogy: Grand Theft Auto III, Grand Theft Auto: Vice City and Grand Theft Auto: San Andreas updated for a new generation, now with across-the-board enhancements including brilliant new lighting and environmental upgrades, high-resolution textures, increased draw distances, Grand Theft Auto V-style controls and targeting, and much more, bringing these beloved worlds to life with all new levels of detail.… Expand"}, {"name": "DOLMEN", "details_link": "https://www.metacritic.com/game/pc/dolmen", "publisher": "Massive Work Studio", "release_date": "May 20 2022", "developers": ["Massive Work Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/92f304dc3fc844a6b691993b759ba02d-98.jpg", "descriptions": "Cosmic Horror and Sci-Fi are two ways to talk about Dolmen. It is a third person action game with RPG elements but with a lovecraftian plot that calls players to find what's behind the darkest secret of the universe! A forgotten planet called Revion Prime will be the place where the actionCosmic Horror and Sci-Fi are two ways to talk about Dolmen. It is a third person action game with RPG elements but with a lovecraftian plot that calls players to find what's behind the darkest secret of the universe! A forgotten planet called Revion Prime will be the place where the action takes part. And it won't be easy: Adaptation and exploration will be your main weapons as you craft new items and equipments from your enemies' carcasses! Every step can be your last one!\r Use your experience points to improve yourself and face what no human has ever faced. After all, quoting David Hume: \"The life of man is of no greater importance to the universe than that of an oyster.\" Maybe he was right Or not.… Expand"}, {"name": "Backbreaker", "details_link": "https://www.metacritic.com/game/xbox-360/backbreaker", "publisher": "505 Games", "release_date": "Jun  1 2010", "developers": ["NaturalMotion"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 54, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/e7622065ff803e83a140712a5f3ade7d-98.jpg", "descriptions": "It's tackle football like never before. Backbreaker is taking sports video games to a place where the action is never the same and every hit looks and feels as realistic as a Sunday afternoon. Utilizing NaturalMotion's euphoria motion synthesis engine, the same technology featured in \"GrandIt's tackle football like never before. Backbreaker is taking sports video games to a place where the action is never the same and every hit looks and feels as realistic as a Sunday afternoon. Utilizing NaturalMotion's euphoria motion synthesis engine, the same technology featured in \"Grand Theft Auto IV\" and \"Star Wars: The Force Unleashed,\" you'll never see the same tackle again. For the first time in a sports game, this mix of technology, biology and tenacious attitude is turning the gridiron of past, full of canned animations and repetitious gameplay, into a dangerous form of self expression. Every unique tackle in the world of Backbreaker is an artistic exercise in hard hits and athletic skill. It's time to show your friends just how painful art can be. Through a combination of biology and robotics research, euphoria uses the CPU power of next-generation consoles to simulate the nervous system, muscles, and biomechanics of the football players in real-time. This is the first time this technology is being employed for a sports game. While conventional football games can only load a finite number of animations from a disc, Backbreaker's real-time technology will never allow the gameplay to become stale. Forget about prim and proper, Backbreaker presents a fast-paced, gritty gameplay experience that's more Burnout than Madden. [NaturalMotion]… Expand"}, {"name": "Feather", "details_link": "https://www.metacritic.com/game/switch/feather", "publisher": "Samurai Punk", "release_date": "Apr  5 2019", "developers": ["Samurai Punk"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Simulation", "Adventure", "Flight", "3D", "Third-Person", "Civilian"], "meta_score": 54, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/cb24acf08b1a3ca96c6638d62f370c52-98.jpg", "descriptions": "Feather is a relaxing bird simulation perfect for unwinding. Whether solo or with other online players, Feather will have you become a bird and explore stunning locations as you soar through the skies! No enemies, no combat, no threats - just peaceful flight by yourself or with otherFeather is a relaxing bird simulation perfect for unwinding. Whether solo or with other online players, Feather will have you become a bird and explore stunning locations as you soar through the skies! No enemies, no combat, no threats - just peaceful flight by yourself or with other birds. Yes, the passive multiplayer in Feather allows you to join a flock and enjoy flying with others or just relax on your own!Explore a vast open world, finding new songs in every nook and cranny... Immerse yourself in a beautiful island that responds to your presence with a hum, tone and rhythm beyond human comprehension.… Expand"}, {"name": "The Tomorrow Children", "details_link": "https://www.metacritic.com/game/playstation-4/the-tomorrow-children", "publisher": "SCEA", "release_date": "Sep  6 2016", "developers": ["Q-Games"], "platforms": "PlayStation 4", "genres": ["Sci-Fi", "Strategy", "Action Adventure", "Real-Time", "Sandbox", "General"], "meta_score": 54, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/33434b7473a7a6ec32fbaf098d0abaa5-98.jpg", "descriptions": "When an ambitious experiment designed to unite the minds of all humanity goes horribly wrong, almost all life on Earth disappears instantly, melting down into the planet to form “the Void”. Years later, a handful of survivors begin to rebuild civilisation, but their endeavours are hamperedWhen an ambitious experiment designed to unite the minds of all humanity goes horribly wrong, almost all life on Earth disappears instantly, melting down into the planet to form “the Void”. Years later, a handful of survivors begin to rebuild civilisation, but their endeavours are hampered by “the Izverg”, giant beasts formed from the residue of negativity and nightmares that now roam the land. Fortunately, engineers discover the ability to develop “projection clones” – new life forms capable of venturing deep into the Void in search of preserved human DNA. It is with these clones that mankind begins the long journey back to its former glory …… Expand"}, {"name": "King Arthur: Fallen Champions", "details_link": "https://www.metacritic.com/game/pc/king-arthur-fallen-champions", "publisher": "Paradox Interactive", "release_date": "Sep 16 2011", "developers": ["NeocoreGames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 54, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/d09f31059a54626392f44fa65873c3a0-98.jpg", "descriptions": "King Arthur: Fallen Champions features the story of three brave souls - a knight, an enchantress, and a prophet – who venture through uncharted lands beyond the Forest of Bedegraine in fulfillment of their individual quests. Sir Lionel, a brave knight from Britannia, is on a quest to rescueKing Arthur: Fallen Champions features the story of three brave souls - a knight, an enchantress, and a prophet – who venture through uncharted lands beyond the Forest of Bedegraine in fulfillment of their individual quests. Sir Lionel, a brave knight from Britannia, is on a quest to rescue a damsel in distress. Lady Corrigan of the Sidhe, an enchantress of the twilight, is seeking the secret pathways that will lead her back to her lost home of Tir na nOg. Drest the Chosen, a prophet of the North, is drawn by the mystic voices and visions to explore the wild lands. Tied together by strings of fate, these three heroes must join hands in order to prevail as champions of a forgotten battle that began long time ago.… Expand"}, {"name": "Sadame", "details_link": "https://www.metacritic.com/game/3ds/sadame", "publisher": "Rising Star Games", "release_date": "Feb 25 2016", "developers": ["Mebius", "Intergrow"], "platforms": "3DS", "genres": ["Role-Playing", "Action RPG"], "meta_score": 54, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/74ea9e563c88e4c3fd763c6d3d4a7a1d-98.jpg", "descriptions": "Choose the role of a Samurai, Ninja, Monk or Rogue and confront an invasion of Japanese traditional Yokai taking over the nation. Hack and slash your way through an army of monsters using Swordsmanship, Ninjitsu, pole sword, bow, and supernatural powers. Enhance your skills by defeatingChoose the role of a Samurai, Ninja, Monk or Rogue and confront an invasion of Japanese traditional Yokai taking over the nation. Hack and slash your way through an army of monsters using Swordsmanship, Ninjitsu, pole sword, bow, and supernatural powers. Enhance your skills by defeating waves of enemies and slaying evil bosses lying in wait. Level up and customize your hero to take on tougher foes and learn new combo skills for devasting attacks. Unselected heroes will support you as an Assist - or you can send them to Assist other players via StreetPass™! Hack your way through 23 stages based on Japanese historic battles across four chapters, all beautifully hand-drawn using classic 2D Japanese art style.\r… Expand"}, {"name": "2Dark", "details_link": "https://www.metacritic.com/game/playstation-4/2dark", "publisher": "Gloomywood", "release_date": "Mar 10 2017", "developers": ["Gloomywood"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 54, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/570b1aa262b2c4f6235699a94ee83927-98.jpg", "descriptions": "From Frédérick Raynal, the creator of Alone in the Dark and pioneer of survival-horror, 2Dark is a grim journey of stealth and courage into the heart of corruption. Use your cunning to infiltrate Gloomywood’s bastions of cruelty. Investigate to uncover the secrets of the deranged psychopathsFrom Frédérick Raynal, the creator of Alone in the Dark and pioneer of survival-horror, 2Dark is a grim journey of stealth and courage into the heart of corruption. Use your cunning to infiltrate Gloomywood’s bastions of cruelty. Investigate to uncover the secrets of the deranged psychopaths within, seek retribution for their crimes, and bring the children to safety. [Playstation.com]… Expand"}, {"name": "True Crime: New York City", "details_link": "https://www.metacritic.com/game/pc/true-crime-new-york-city", "publisher": "Aspyr", "release_date": "Mar 24 2006", "developers": ["Luxoflux", "Inc."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 54, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/1783a380d0d23a411e2a2252b04a5970-98.jpg", "descriptions": "Players assume the role of former gang member turned cop Marcus Reed as they fight crime on the GPS-accurate streets of Manhattan, complete with subways, hundreds of interiors, internationally recognized landmarks and real neighborhoods from Harlem to Chinatown to Times Square. PlayersPlayers assume the role of former gang member turned cop Marcus Reed as they fight crime on the GPS-accurate streets of Manhattan, complete with subways, hundreds of interiors, internationally recognized landmarks and real neighborhoods from Harlem to Chinatown to Times Square. Players navigate the city the way New Yorkers do, by taking cabs, riding subways, walking and driving cars and motorcycles. Gamers experience all the sights and sounds of New York, complete with the energy and architecture authentic to the city’s diverse neighborhoods, the voices and likenesses of real New Yorkers, and the cacophony of ambient traffic and bustling noises unique to the city. The game also includes character concentrations specific to each neighborhood. For example, the player will find a plethora of tourists amidst the lights and large buildings of Times Square, but predominantly locals near the brownstones of Harlem. [Activision]… Expand"}, {"name": "Pac-Man World Rally", "details_link": "https://www.metacritic.com/game/playstation-2/pac-man-world-rally", "publisher": "Namco Bandai Games America", "release_date": "Aug 22 2006", "developers": ["Smart Bomb Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 54, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/5a83dd61f734670896b49e802df58b09-98.jpg", "descriptions": "In Pac Man World Rally, players can race through a variety of environments from Pac Man World as Pac Man, Pac Jr. and other characters from past Namco classics. Players kart race for the win or fight it out in colorful Battle Arenas with special weapons, power ups and variety Pac-Man powers.In Pac Man World Rally, players can race through a variety of environments from Pac Man World as Pac Man, Pac Jr. and other characters from past Namco classics. Players kart race for the win or fight it out in colorful Battle Arenas with special weapons, power ups and variety Pac-Man powers. The game also features the Prince of all Cosmos from the award-winning Katamari series as an unlockable character. Making a debut in his first kart racing game, the Prince can be unlocked by winning a Gold Trophy in all Circuit Cups within the EASY difficulty setting. [Namco Bandai]… Expand"}, {"name": "Port Royale 3: Pirates and Merchants", "details_link": "https://www.metacritic.com/game/pc/port-royale-3-pirates-and-merchants", "publisher": "Kalypso", "release_date": "May  4 2012", "developers": ["Kalypso", "Gaming Minds Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 54, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/e7a8cb505566c9a6c15ae2ca8d777534-98.jpg", "descriptions": "In Port Royale 3, players will embark upon an epic adventure through the Caribbean during the 17th century."}, {"name": "Scooby Doo!  Who's Watching Who?", "details_link": "https://www.metacritic.com/game/psp/scooby-doo!-whos-watching-who", "publisher": "THQ", "release_date": "Oct 16 2006", "developers": ["THQ", "Savage Entertainment"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 54, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/25ddd51932e9ede72a10f3499bfa94ab-98.jpg", "descriptions": "Yet another of Scooby's handheld misadventures from THQ."}, {"name": "Super Bubble Pop", "details_link": "https://www.metacritic.com/game/gamecube/super-bubble-pop", "publisher": "Jaleco Entertainment", "release_date": "Jan  3 2003", "developers": ["Runecraft"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 54, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/413df0e915660dfcb80037feff5cfb11-98.jpg", "descriptions": "Dance to the beat of crazy music and play 150 levels of bubble popping action in this 3D puzzle game.  Make your move and work quickly to take out the bubbles before they take you out.  A crazy collection of DJs are waiting inside for their chance to become the ultimate popper.  You areDance to the beat of crazy music and play 150 levels of bubble popping action in this 3D puzzle game.  Make your move and work quickly to take out the bubbles before they take you out.  A crazy collection of DJs are waiting inside for their chance to become the ultimate popper.  You are given the chance to pick from one of up to five characters each with their own unique special attack.  Special attacks and bubbles keep the gameplay fast and furious.  With rocking soundtracks and fast-paced gameplay, Super Bubble Pop will keep you grooving to the beat for hours.… Expand"}, {"name": "Reign of Fire", "details_link": "https://www.metacritic.com/game/gamecube/reign-of-fire", "publisher": "Bam Entertainment", "release_date": "Nov 26 2002", "developers": ["Kuju Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 54, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/b411c67b8b0c2a22d6c4dc63577221c0-98.jpg", "descriptions": "Based on the movie, Reign of Fire lets you play as either a human or a dragon in an epic battle. As a human, you'll take the role of a resistance fighter who's trying to defend the last remaining humans from attack. You must make your way to the site of the sole male dragon using a varietyBased on the movie, Reign of Fire lets you play as either a human or a dragon in an epic battle. As a human, you'll take the role of a resistance fighter who's trying to defend the last remaining humans from attack. You must make your way to the site of the sole male dragon using a variety of well-equipped vehicles and high-tech weaponry. As a dragon, you'll take the role of an infant, led by instinct to attack foes, and you'll attempt to eradicate the human race. With your natural fire-breathing and flying abilities, you can destroy everything on the ground or in the skies.… Expand"}, {"name": "Orphen: Scion of Sorcery", "details_link": "https://www.metacritic.com/game/playstation-2/orphen-scion-of-sorcery", "publisher": "Activision", "release_date": "Oct 23 2000", "developers": ["Shade"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/763953ecd2ab74e99bc64c844a803542-98.jpg", "descriptions": "As Orphen, the powerful but lazy sorcerer, you're always thought being a hero was too much work. But now you don't have a choice. Harnessed into a risky adventure, you must use your dark powers to help your desperate companions resolve their unique quests."}, {"name": "Mario Party Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/mario-party-advance", "publisher": "Nintendo", "release_date": "Mar 28 2005", "developers": ["Hudson"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 54, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/25024c05e15b4ca68dc21941efda95fe-98.jpg", "descriptions": "Mario Party Advance takes all the minigame mayhem of the console games and puts it in your hands. This version for the Game Boy Advance features all-new games and a host of Professor E. Gadd's incredible gadgets, including trinkets, toys, detectors, and tricks. \"Tricks\" let youMario Party Advance takes all the minigame mayhem of the console games and puts it in your hands. This version for the Game Boy Advance features all-new games and a host of Professor E. Gadd's incredible gadgets, including trinkets, toys, detectors, and tricks. \"Tricks\" let you play pranks on your friends, test your compatibility, and more. Earn coins in single-player game boards; compete against a friend in a two-player battle game; or trade gadgets, minigames, and coins with other players.… Expand"}, {"name": "Colossal Cave", "details_link": "https://www.metacritic.com/game/pc/colossal-cave", "publisher": "Cygnus Entertainment", "release_date": "Jan 19 2023", "developers": ["Cygnus Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/ee278492b6eef2347c4461aa18535e29-98.jpg", "descriptions": "Colossal Cave Reimagined by Roberta Williams, is an exciting new action-adventure game from the founders of Sierra On-Line, Ken and Roberta Williams. Colossal Cave Reimagined by Roberta Williams is an exciting and thrilling adventure for a new generation to undertake. Immerse yourself inColossal Cave Reimagined by Roberta Williams, is an exciting new action-adventure game from the founders of Sierra On-Line, Ken and Roberta Williams. Colossal Cave Reimagined by Roberta Williams is an exciting and thrilling adventure for a new generation to undertake. Immerse yourself in the world of Colossal Cave, explore its vast caverns and vistas, seek the diverse treasures within, and encounter both friends and foes in your quest to explore this mysterious and wonderful locale.… Expand"}, {"name": "Buildings Have Feelings Too!", "details_link": "https://www.metacritic.com/game/playstation-4/buildings-have-feelings-too!", "publisher": "Merge Games", "release_date": "Apr 22 2021", "developers": ["Blackstaff Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/72baa93c5e54132212413f2a022119d5-98.jpg", "descriptions": "An exciting new city-management/puzzle game about buildings and the city they inhabit. You must grow your city to a bustling metropolitan centre with an array of shops, offices, entertainment facilities and amenities, to help your buildings thrive; or risk them being demolished forever."}, {"name": "Bitlogic - A Cyberpunk Arcade Adventure", "details_link": "https://www.metacritic.com/game/switch/bitlogic---a-cyberpunk-arcade-adventure", "publisher": "OXiAB Game Studio", "release_date": "Jun 27 2019", "developers": ["OXiAB Game Studio"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/2d292afc7a79e85e9a8a483fa7d31198-98.jpg", "descriptions": "Bitlogic is an action and adventure game elegantly classic but enhanced with new adapted graphics. In the game you take control of Bit, your personal avatar in a virtual cyberpunk world full of dangerous enemies, hidden paths and digital mysteries.Immerse yourself in Bit's universe andBitlogic is an action and adventure game elegantly classic but enhanced with new adapted graphics. In the game you take control of Bit, your personal avatar in a virtual cyberpunk world full of dangerous enemies, hidden paths and digital mysteries.Immerse yourself in Bit's universe and dare to uncover the secrets behind the source code.Explore, defend yourself and find the correct way to the heart and soul of Bitlogic.… Expand"}, {"name": "Kholat", "details_link": "https://www.metacritic.com/game/xbox-one/kholat", "publisher": "IMGN.PRO", "release_date": "Jun  9 2017", "developers": ["IMGN.PRO"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 54, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/9e7da183c2c33a881fc869d139e94075-98.jpg", "descriptions": "Narrated by one of the most popular British actors, Sean Bean and powered by Unreal Engine 4, Kholat is an exploration adventure game with elements of horror, inspired by a true event known as the Dyatlov Pass incident -- a mysterious death of nine Russian hikers, which led to countless,Narrated by one of the most popular British actors, Sean Bean and powered by Unreal Engine 4, Kholat is an exploration adventure game with elements of horror, inspired by a true event known as the Dyatlov Pass incident -- a mysterious death of nine Russian hikers, which led to countless, unconfirmed hypotheses. The player will plunge directly into the boundless scenery of the inhospitable Ural Mountains with the task to find out what really happened. In the course of events, you may come across more speculations than expected...… Expand"}, {"name": "Black Mirror", "details_link": "https://www.metacritic.com/game/playstation-4/black-mirror", "publisher": "THQ Nordic", "release_date": "Nov 28 2017", "developers": ["THQ Nordic"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 54, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/0f134ff158f0ebbcef8cb1c9f8c21c95-98.jpg", "descriptions": "Scotland, 1926. Following the death of his father, David Gordon visits his ancestral home for the first time in his life. A life that is soon threatened by the dark secrets that claimed the sanity of many Gordons before him. Black Mirror Castle demands an offering."}, {"name": "Fret Nice", "details_link": "https://www.metacritic.com/game/xbox-360/fret-nice", "publisher": "Tecmo", "release_date": "Feb 24 2010", "developers": ["Tecmo", "Pieces Interactive"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/5c961d5efa67beeaf9515839b7382a7c-98.jpg", "descriptions": "[Xbox Live Arcade]  Rock on and harmonize the unity between music and 2D platformer! As you control your character through the artful stages, you play the game as if it was a jammin’ rock song. Blast your enemies with riff combos and create your own soundtracks with each “strum” of a chord.[Xbox Live Arcade]  Rock on and harmonize the unity between music and 2D platformer! As you control your character through the artful stages, you play the game as if it was a jammin’ rock song. Blast your enemies with riff combos and create your own soundtracks with each “strum” of a chord. You will have an ever-changing experience each time a stage is repeated. [Pieces Interactive]… Expand"}, {"name": "Shaq Fu: A Legend Reborn", "details_link": "https://www.metacritic.com/game/xbox-one/shaq-fu-a-legend-reborn", "publisher": "Saber Interactive", "release_date": "Jun  5 2018", "developers": ["Big Deez Productions"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 54, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/40ac53424f60bb5058346914ccd843a6-98.jpg", "descriptions": "Shaq Fu: A Legend Reborn is what the original game should have been an instant classic. We're talking Streets of Rage meets Street Fighter meets Devil May Cry. It's a modern day take on the classic beat 'em up. Play as Shaquille O'Neal learn hundreds of moves and battle techniques, take onShaq Fu: A Legend Reborn is what the original game should have been an instant classic. We're talking Streets of Rage meets Street Fighter meets Devil May Cry. It's a modern day take on the classic beat 'em up. Play as Shaquille O'Neal learn hundreds of moves and battle techniques, take on thousands of enemies with dozens of cool melee weapons, battle bosses in dynamic arenas, master cool finishing moves and play with your buddies in COOP mode or against each other in player vs player combat.In Shaq Fu, dozens of unique and varied enemies await which require careful use of tactics. The game also features destructive environments, awesome power ups and a series of well-designed, beautiful levels with interesting progression. This is all tied together by what very well might be the story of the century, a performance worthy of an Oscar, by the Big Diesel, in his battle against a villain for the ages the mysterious Black Star Ninja.… Expand"}, {"name": "The Political Machine 2012", "details_link": "https://www.metacritic.com/game/pc/the-political-machine-2012", "publisher": "Stardock", "release_date": "Jul 31 2012", "developers": ["Stardock"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Modern", "General"], "meta_score": 54, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/360a3dec21c647baa664e93dd383a7fc-98.jpg", "descriptions": "The Political Machine 2012 lets players play as Barack Obama, Mitt Romney, Rick Santorum, Ron Paul, Newt Gingrich or create their own candidate to take to the campaign trail."}, {"name": "NBA Ballers: Chosen One", "details_link": "https://www.metacritic.com/game/playstation-3/nba-ballers-chosen-one", "publisher": "Midway", "release_date": "Apr 21 2008", "developers": ["Midway"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 54, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/77d6d017ef0d1f51bc4f9f336772ff7e-98.jpg", "descriptions": "NBA Ballers: Chosen One is a fantasy basketball entertainment experience featuring one-on-one and two-on-two action with the NBA's elite players. More than 65 of the NBA's top superstar athletes come to life as the NBA Ballers franchise continues its legacy. NBA Ballers: Chosen One putsNBA Ballers: Chosen One is a fantasy basketball entertainment experience featuring one-on-one and two-on-two action with the NBA's elite players. More than 65 of the NBA's top superstar athletes come to life as the NBA Ballers franchise continues its legacy. NBA Ballers: Chosen One puts players up-close and into the action with new \"action movie\" style game cameras that highlight every move. Create-a-Baller and take on the challenge of the epic \"Chosen One Tournament\", brought to you live from the most exotic courts around the world. As you progress through the game, earn the right to use an NBA star's \"Shut 'Em Down\" Super Move or take your Baller online to test your playing skills against others. [Midway]… Expand"}, {"name": "Pocketbike Racer", "details_link": "https://www.metacritic.com/game/xbox-360/pocketbike-racer", "publisher": "King Games", "release_date": "Nov 19 2006", "developers": ["Blitz Games"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 54, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/b63cf27dacf6c2e676ed2bf741ab357c-98.jpg", "descriptions": "[Playable on the Xbox and Xbox 360. Available only at Burger King Restaurants from Nov. 19 through Dec. 24, 2006 for $3.99 and the purchase of a BK Value Meal.]  Welcome to the wild world of Pocketbike racing where players race the King and his miniature motorbike crew through five fun, yet[Playable on the Xbox and Xbox 360. Available only at Burger King Restaurants from Nov. 19 through Dec. 24, 2006 for $3.99 and the purchase of a BK Value Meal.]  Welcome to the wild world of Pocketbike racing where players race the King and his miniature motorbike crew through five fun, yet challenging speedways. Each track varies in level of difficulty and players navigate long straights, tight bends and sharp turns at high speeds while attempting to earn enhancements and tools that they can use to gain an advantage over opponents. Featuring HAVE IT YOUR WAY customization options, players select a bike and a driver and then hit the track of their choice of a BURGER KING restaurant parking lot, a construction site, a backyard, the King's garden or the fabled Fantasy Ranch set. In addition to individual play, four players can race against each other in classic split-screen set-up or eight players can battle it out online using XBOX Live. [King Games]… Expand"}, {"name": "River King: Mystic Valley", "details_link": "https://www.metacritic.com/game/ds/river-king-mystic-valley", "publisher": "Natsume", "release_date": "Apr 29 2008", "developers": ["TOSE"], "platforms": "DS", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/c6772c66c9be039eb3dca57977fa3b55-98.jpg", "descriptions": "(Also known as \"Harvest Fishing\")  Journey to rivers, swamps, ponds and hidden fishing spots as you look for the mysterious River King to help your younger sister wake from her unexplained slumber. But you are not alone on this adventure, make friends with the magical creatures of Mystic(Also known as \"Harvest Fishing\")  Journey to rivers, swamps, ponds and hidden fishing spots as you look for the mysterious River King to help your younger sister wake from her unexplained slumber. But you are not alone on this adventure, make friends with the magical creatures of Mystic Valley and unlock their special abilities to help you. You are your sister’s last hope and it will take all of your fishing skill to catch the elusive River King. Innovative fishing engine using the Touch Screen. Amass a collection of bait, lures, rods and more. Participate in a variety of mini-games. Have a fishing tournament with your friends via Nintendo Wi-Fi Connection. [Natsume]… Expand"}, {"name": "Import Tuner Challenge", "details_link": "https://www.metacritic.com/game/xbox-360/import-tuner-challenge", "publisher": "Ubisoft", "release_date": "Sep 26 2006", "developers": ["Genki"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 54, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/2b2290488bd5996ef4c65d379de88dd9-98.jpg", "descriptions": "Import Tuner Challenge is an authentic and extremely customizable street-racing game that challenges racers to immerse themselves in Tokyo's underground to take on the fastest street-racing teams. Players can customize and race licensed import sports cars using real tuner parts and tuningImport Tuner Challenge is an authentic and extremely customizable street-racing game that challenges racers to immerse themselves in Tokyo's underground to take on the fastest street-racing teams. Players can customize and race licensed import sports cars using real tuner parts and tuning techniques. Includes real Tokyo highways and regions, all the hottest licensed import sports cars and concept vehicles and the most prized import tuner part manufacturers. More than five million customizations: Select from a vast warehouse of specialized parts to customize a car's interior, exterior and engine. Includes everything from authentic aero kits from Mazdaspeed, C-West and Veilside to racing seats from Recaro and Bride. Tune your car like a mechanic: Install custom parts with the click of a button and hit the streets wheels spinning. Players can fine-tune their parts to suit a specific race. Conquer the toughest and fastest street-racing teams: With more than 400 unique opponents with different strengths, weaknesses and custom cars, never play the same game twice. Take your ride to the Xbox Live online gaming service: See how your custom tuner stacks up in head-to-head in Versus mode – take your most extreme mods straight to the streets to dominate all who challenge. [Ubisoft]… Expand"}, {"name": "Rustler", "details_link": "https://www.metacritic.com/game/switch/rustler", "publisher": "Maximum Games", "release_date": "Aug 31 2021", "developers": ["Jutsu Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Action Adventure", "Open-World"], "meta_score": 54, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/7aa14f8c72944fb709f061e3a229314d-98.jpg", "descriptions": "Become a medieval thug in a crazy open-world action game, full of pop-culture references. Complete insane quests, kill heroes, steal horses, fight guards, rob peasants, listen to some bard music, and much more! All packed in old-school gameplay style!"}, {"name": "Iron Man 2", "details_link": "https://www.metacritic.com/game/ds/iron-man-2", "publisher": "Sega", "release_date": "May  4 2010", "developers": ["Sega Studios San Francisco"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 54, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/692df913d9f3ca6d051247ee57f6a881-98.jpg", "descriptions": "Packed with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinctPacked with favorites from the movie and comic book worlds, Iron Man 2: The Video Game offers gamers a chance to choose between Iron Man and War Machine, as they battle through hugely destructible indoor and outdoor environments. Tony and Rhodey both come equipped with their own distinct assortments of fully customizable, earth-shattering weapons, as well as vicious melee combat moves, all of which will come in handy against the likes of Crimson Dynamo and other classic Marvel foes. [Sega]… Expand"}, {"name": "UFC: Sudden Impact", "details_link": "https://www.metacritic.com/game/playstation-2/ufc-sudden-impact", "publisher": "Global Star Software", "release_date": "Apr 21 2004", "developers": ["Opus"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 54, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/243c811df63e512df3843cf61d8e97e0-98.jpg", "descriptions": "(Known in Japan as \"UFC 2004\") UFC: Sudden Impact brings fighting to the \"ultimate\" fans. Experience the full contact intensity found only in the Octagon. Create the Ultimate Fighter, train him to be a master and brawl you way through five different modes of play including the fan favorite,(Known in Japan as \"UFC 2004\") UFC: Sudden Impact brings fighting to the \"ultimate\" fans. Experience the full contact intensity found only in the Octagon. Create the Ultimate Fighter, train him to be a master and brawl you way through five different modes of play including the fan favorite, Tournament Mode, and an all-new, enhanced Story Mode. Become an Ultimate Fighter while throwing down some real-time cuts and bruising. Create, train and kick some butt with your fully customizable character or your favorite UFC fighter. Go head-to-head with over 35 real UFC fighters, including UFC superstars Chuck Liddell, Tito Ortiz, Frank Shamrock and Matt Hughes. Unlock and unleash 10 secret hidden fighters. All new unique moves to each fighting style. Choose from 15 different fighting disciplines, new fighting positions and a greater variety of moves.… Expand"}, {"name": "Hot Wheels Velocity X", "details_link": "https://www.metacritic.com/game/playstation-2/hot-wheels-velocity-x", "publisher": "THQ", "release_date": "Nov 11 2002", "developers": ["Beyond Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 54, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/22efcd30a14cc277fd5a9427cd9fb8aa-98.jpg", "descriptions": "Criminal racing gangs, gravity defying stunts, huge loops, insane speeds, spectacular crashes, driving up walls and an arsenal of weapons... Can you handle a typical Hot Wheels day? [THQ]"}, {"name": "Pac-Man Fever", "details_link": "https://www.metacritic.com/game/gamecube/pac-man-fever", "publisher": "Namco", "release_date": "Sep  3 2002", "developers": ["Mass Media"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 54, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/7fa572f9c6ea412f3e110c09a922053e-98.jpg", "descriptions": "Pac-Man takes break from eating dots and ghosts in the fun new party game Pac-Man Fever.  In addition to our yellow hero, the game also features Ms. Pac-Man and many other Namco favorites from franchises such as Tekken, Ridge Racer, and Soul Calibur.  Up to four players partake in more thanPac-Man takes break from eating dots and ghosts in the fun new party game Pac-Man Fever.  In addition to our yellow hero, the game also features Ms. Pac-Man and many other Namco favorites from franchises such as Tekken, Ridge Racer, and Soul Calibur.  Up to four players partake in more than 30 minigames and three differently themed game boards.  Try to recover all of the minigames stolen by those pesky, party-crashing Ghosts and determine who the real party animal is.… Expand"}, {"name": "Jumping Joe & Friends", "details_link": "https://www.metacritic.com/game/switch/jumping-joe-friends", "publisher": "QubicGames", "release_date": "May 25 2018", "developers": ["Vixa Games / QubicGames S.A.", "Vixa Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 54, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/65eb779a0a684bab8808fae28b1888ba-98.jpg", "descriptions": "The creators of Robonauts and Astro Bears Party proudly present a new title perfect for intense playtimes with your friends and family.Help Joe and his fellas on their upwards journey. Be quick as a flash and dodge roaring cannonballs, vicious bats and other traps. Perform high scores orThe creators of Robonauts and Astro Bears Party proudly present a new title perfect for intense playtimes with your friends and family.Help Joe and his fellas on their upwards journey. Be quick as a flash and dodge roaring cannonballs, vicious bats and other traps. Perform high scores or leave your competitors in the dust!… Expand"}, {"name": "Elevator Action Deluxe", "details_link": "https://www.metacritic.com/game/playstation-3/elevator-action-deluxe", "publisher": "Square Enix", "release_date": "Aug 30 2011", "platforms": "PlayStation 3", "genres": ["Action", "Adventure", "General", "General", "Platformer", "2D"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/b3b15188fa5a8177a64ae7f24d29fc6a-98.jpg", "descriptions": "Elevator Action Deluxe allows you to experience the legendary arcade game Elevator Action once more in HD."}, {"name": "Frogger: Ancient Shadow", "details_link": "https://www.metacritic.com/game/playstation-2/frogger-ancient-shadow", "publisher": "Konami", "release_date": "Sep 27 2005", "developers": ["Hudson Soft"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 54, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/c919a5602d7b6740d1b6f59162e413b1-98.jpg", "descriptions": "Frogger is Back to His Classic Beginnings. His home of Firefly Swamp is being overrun by Dr. Wani and his evil plans. Join Frogger in his latest adventure as he explores seven different worlds and tries to restore order to his beloved swamp. Features classic, addictive \"hop and dodge\"Frogger is Back to His Classic Beginnings. His home of Firefly Swamp is being overrun by Dr. Wani and his evil plans. Join Frogger in his latest adventure as he explores seven different worlds and tries to restore order to his beloved swamp. Features classic, addictive \"hop and dodge\" gameplay. Mini games with up to 4 players on all platforms. Over 30 levels of play. Wide range of character moves, such as the double jump, tongue grab, and more. Special bonus - orignial 1981 Frogger arcade game included on all platforms. [Konami]… Expand"}, {"name": "Flower, Sun, and Rain", "details_link": "https://www.metacritic.com/game/ds/flower-sun-and-rain", "publisher": "XSEED Games", "release_date": "Jun 16 2009", "developers": ["h.a.n.d. Inc."], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 54, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/71b93a11ad890f37d51cc410d459782a-98.jpg", "descriptions": "Flower, Sun and Rain is an intriguing mystery adventure very much in the vein of Groundhog Day. You play a detective charged with locating and defusing a bomb by solving thought-provoking puzzles with a wealth of bizarre outcomes. Solving the mystery of what is happening to him and hisFlower, Sun and Rain is an intriguing mystery adventure very much in the vein of Groundhog Day. You play a detective charged with locating and defusing a bomb by solving thought-provoking puzzles with a wealth of bizarre outcomes. Solving the mystery of what is happening to him and his surroundings is necessary before he eventually goes insane. \r\rOriginally released on the Sony PlayStation®2, Flower, Sun and Rain was never available outside of Japan and has been high on wish lists of every Suda51 fan since Killer7 was unleashed on the western market in 2005.  This updated Nintendo DS version features all the creative quirks that made the original a hit and uniquely utilises the touch screen to solve mysteries, offering players a more intimate experience. [Rising Star Games]… Expand"}, {"name": "Ace Combat Infinity", "details_link": "https://www.metacritic.com/game/playstation-3/ace-combat-infinity", "publisher": "Namco Bandai Games America", "release_date": "May 27 2014", "developers": ["Project Aces"], "platforms": "PlayStation 3", "num_players": "Up to 8 ", "genres": ["Flight", "Action", "Simulation", "Flight", "Combat"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/378b087cfceeacf337339544df134d83-98.jpg", "descriptions": "The infinite blue of the open skies awaits not only veteran but also budding flying aces in Ace Combat Infinity, the first free-to-play game in the hit franchise from Namco Bandai Games. Evolving the legendary series with a brand new story and innovative multiplayer, the game turns the skyThe infinite blue of the open skies awaits not only veteran but also budding flying aces in Ace Combat Infinity, the first free-to-play game in the hit franchise from Namco Bandai Games. Evolving the legendary series with a brand new story and innovative multiplayer, the game turns the sky into an endless blue battleground, bursting with aerial drama and destruction. Ace Combat Infinity will let every player become a deadly flying ace, as they embark on a series of high velocity missions.… Expand"}, {"name": "Brain Challenge", "details_link": "https://www.metacritic.com/game/xbox-360/brain-challenge", "publisher": "Microsoft Game Studios", "release_date": "Mar 12 2008", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Edutainment", "Edutainment"], "meta_score": 54, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/278869d297ee46de727ca89931118ca4-98.jpg", "descriptions": "[Xbox Live Arcade]  Get your brain in shape with fun daily exercises - these challenging and entertaining puzzles act like a vitamin boost for your brain. Brain Challenge is your personal coach for mental fitness. Twenty different games in five categories (Memory, Visual, Logic, Math, and[Xbox Live Arcade]  Get your brain in shape with fun daily exercises - these challenging and entertaining puzzles act like a vitamin boost for your brain. Brain Challenge is your personal coach for mental fitness. Twenty different games in five categories (Memory, Visual, Logic, Math, and Focus) train all areas of your brain. Keep track of your progress every day, and easily evaluate your level of brain activity. Brain Challenge is the easy and enjoyable way to keep your brain alert. Challenge friends with four-player offline and online multiplayer modes. Thirty games are broken down into different categories—Memory, Visual, Logic, Math, and Focus. Training room: Play all the mini-games within each category freely. Creative mode: Relax by exploring your brain's creative abilities through five games. Stress mode: Test your abilities under stressful conditions. Personal coach: Choose your favorite coach to accompany you through all your brain development steps and develop a unique relationship with him or her. Brain charts: View your overall performance and progression with detailed stats and graphs. [Microsoft]… Expand"}, {"name": "Reality Fighters", "details_link": "https://www.metacritic.com/game/playstation-vita/reality-fighters", "publisher": "SCEA", "release_date": "Mar 13 2012", "developers": ["Novarama"], "platforms": "PlayStation Vita", "genres": ["Action", "General", "General"], "meta_score": 54, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/72cd9dda0cac89dd6a08299935d34541-98.jpg", "descriptions": "Reality fighters is an augmented reality fighting game in which you can capture yourself using the NGP camera and duke it out against other fighters around the world."}, {"name": "The Elder Scrolls V: Skyrim - Hearthfire", "details_link": "https://www.metacritic.com/game/xbox-360/the-elder-scrolls-v-skyrim---hearthfire", "publisher": "Bethesda Softworks", "release_date": "Sep  4 2012", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 54, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/a4573656f8b47123bbbd9277c7ea5104-98.jpg", "descriptions": "With this add-on to The Elder Scrolls V: Skyrim, you may purchase land and build your home from the ground up - from a simple one-room cottage to a sprawling compound complete with an armory, alchemy laboratory, stable, garden, and more. Use all-new tools like the drafting table andWith this add-on to The Elder Scrolls V: Skyrim, you may purchase land and build your home from the ground up - from a simple one-room cottage to a sprawling compound complete with an armory, alchemy laboratory, stable, garden, and more. Use all-new tools like the drafting table and carpenter’s workbench to transform quarried stone, clay, and sawn logs into structures and furnishings. Even transform your house into a home by adopting children.… Expand"}, {"name": "Apex Legends", "details_link": "https://www.metacritic.com/game/switch/apex-legends", "publisher": "Electronic Arts", "release_date": "Mar  9 2021", "developers": ["Panic Button", "Respawn Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 60 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/7fa1aab93c4fc1d35f0df65cbd214e94-98.jpg", "descriptions": "Conquer with character in Apex Legends, a free-to-play* Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame & fortune on the fringes of the Frontier. Master an ever-growing roster of diverse Legends, deep tactical squad play and bold newConquer with character in Apex Legends, a free-to-play* Battle Royale shooter where legendary characters with powerful abilities team up to battle for fame & fortune on the fringes of the Frontier. Master an ever-growing roster of diverse Legends, deep tactical squad play and bold new innovations that level up the Battle Royale experienceall within a rugged world where anything goes. Welcome to the next evolution of Battle Royale.A Roster of Legendary Characters-Master a growing roster of powerful Legends, each with their own unique personality, strengths and abilities that are easy to pick up but challenging to truly master.Build Your Crew-Choose your Legend and combine their unique skills together with other players to form the ultimate crew.Strategic Battle Royale-Use your abilitiesand your witsto make strategic calls on the fly, adapting your crew's strengths to meet new challenges as the match evolves.Genre-Evolving Innovation-Experience a brand-new array of innovative features that level up the Battle Royale genre, including Respawn Beacons, Smart Comms, Intelligent Inventory and an all-new way to drop into the action with Jumpmaster deployment.Sweet, Sweet Loot-Drop in and loot up with a host of powerful weapons, diverse attachments and useful armor to protect you in battle. After the fight, collect a wealth of cosmetic options for personalizing your character and weapons, and unlock new ways to show off during the match.… Expand"}, {"name": "Dream Trigger 3D", "details_link": "https://www.metacritic.com/game/3ds/dream-trigger-3d", "publisher": "D3Publisher", "release_date": "May 10 2011", "developers": ["Art Co.", "Ltd."], "platforms": "3DS", "num_players": "2  Online", "genres": ["Action", "General", "Shooter", "Shooter", "Static", "Rail", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 54, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/479175d30492b60610f092f2aed9d2b4-98.jpg", "descriptions": "Dream Trigger 3D is a shooter for the 3DS with a mixture of explosive graphics and nonstop action."}, {"name": "El Matador", "details_link": "https://www.metacritic.com/game/pc/el-matador", "publisher": "Red Mile Entertainment", "release_date": "Sep 29 2006", "developers": ["Plastic Reality"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 54, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/9e858c9c74267896b9c3b4745c72141f-98.jpg", "descriptions": "El Matador is a third person, tactical action game, where the player takes on the role of a DEA agent, whose aim is to bring down the narkomafia, an organised crime syndicate in South America. Driven by revenge for what the narkomafia did to his brother, the player will progress through aEl Matador is a third person, tactical action game, where the player takes on the role of a DEA agent, whose aim is to bring down the narkomafia, an organised crime syndicate in South America. Driven by revenge for what the narkomafia did to his brother, the player will progress through a story which weaves its way throughout the adventure, combines all the essential features of surprise, unexpected twists and dramatic developments. It is a tale of corruption, revenge, moral ambiguity and ultimate justice. The game features a wide varieties of essential gadgets which facilitate completion of stealth based missions, allowing the player to slip unnoticed through enemy lines. [Cenega Publishing]… Expand"}, {"name": "Dragon Age: Origins - Return to Ostagar", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-age-origins---return-to-ostagar", "publisher": "Electronic Arts", "release_date": "Jan 13 2010", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 54, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/75737580213c38ce99838400f94b5287-98.jpg", "descriptions": "(Downloadable Content)  Your memories of the battle of Ostagar will haunt you for years to come. It laid waste to your order and claimed the lives of many great men and women, including the brash young King Cailan and your mentor, Duncan. Now, there are rumors that a fellow survivor of the(Downloadable Content)  Your memories of the battle of Ostagar will haunt you for years to come. It laid waste to your order and claimed the lives of many great men and women, including the brash young King Cailan and your mentor, Duncan. Now, there are rumors that a fellow survivor of the battle has escaped from captivity and is seeking the Grey Wardens' help. The time has come for the Grey Wardens to make their return to Ostagar and exact their revenge upon the darkspawn. [Electronic Arts]… Expand"}, {"name": "Night Watch", "details_link": "https://www.metacritic.com/game/pc/night-watch", "publisher": "cdv Software", "release_date": "Jun 26 2006", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 54, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/43a22d3aa0a9ef06726fe6e716da7554-98.jpg", "descriptions": "For as long as humanity has existed, there have been \"Others\" walking among us in the form of Witches, Vampires and Shape-Shifters, all soldiers in the eternal war between Light and Dark. The Light \"Others\" protect mankind from the Dark \"Others\", who plague and torture humans. Now you canFor as long as humanity has existed, there have been \"Others\" walking among us in the form of Witches, Vampires and Shape-Shifters, all soldiers in the eternal war between Light and Dark. The Light \"Others\" protect mankind from the Dark \"Others\", who plague and torture humans. Now you can bring the action home in Night Watch, a unique turn-based tactical RPG set in the epic universe of the \"Others\". A universe forged by one of Russia's most popular sci-fi writers, Sergey Lukyanenko, and brought to the big screen in the blockbuster film of the same name. In Night Watch, you slip into the role of a Light Other and use your magic to protect humanity in thrilling battles spanning across parallel realities - including real-world locations in modern-day Moscow as well as surreal universes of the \"Others\" and the secret world of the \"Dusk\". Dive headfirst into a plot which promises many unexpected twists and turns as you struggle against evil to swing the balance of power into the Light. [CDV Software]… Expand"}, {"name": "Blind Fate: Edo no Yami", "details_link": "https://www.metacritic.com/game/pc/blind-fate-edo-no-yami", "publisher": "101XP", "release_date": "Sep 15 2022", "developers": ["Troglobytes Games", "S.L."], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 54, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/ebbd4b73609dc22f2090972d02f54113-98.jpg", "descriptions": "It's a new, dark and machine-filled Edo period, and the Shogunate rules over Japan with its just, but pitiless hand: you.You follow orders. You obey. You kill.\n\nUntil your sight is taken from you, and you must learn to \"feel\" the world anew...\n\nDive into a world that mixes Sci-Fi andIt's a new, dark and machine-filled Edo period, and the Shogunate rules over Japan with its just, but pitiless hand: you.You follow orders. You obey. You kill.Until your sight is taken from you, and you must learn to \"feel\" the world anew...Dive into a world that mixes Sci-Fi and ancient tradition. Slash through robots with a trusty katana, use hi-tech implants to navigate the surroundings, dodge enemy attacks, and land devastating finishers. Reclaim the past following the way of the Japanese samurai in the fantastic period of New Edo.… Expand"}, {"name": "Pokemon Dream Radar", "details_link": "https://www.metacritic.com/game/3ds/pokemon-dream-radar", "publisher": "Nintendo", "release_date": "Oct  7 2012", "developers": ["Creatures Inc."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Miscellaneous", "General", "General"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/145008ad22a962992aa62da6afdf55d3-98.jpg", "descriptions": "Pokemon Dream Radar is a motion-controlled shooting game where, using Augmented Reality technology, you chase down Pokemon that appear as if they're in the real world."}, {"name": "SpellForce 2: Demons of the Past", "details_link": "https://www.metacritic.com/game/pc/spellforce-2-demons-of-the-past", "publisher": "Nordic Games Publishing", "release_date": "Jan 14 2014", "developers": ["Mind over Matter"], "platforms": "PC", "genres": ["Strategy", "General"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/21454593a722b94466b703fc8513203a-98.jpg", "descriptions": "Demons Of The Past is the finale in the endearing Spellforce 2 series and, like its earlier incarnations, combines RPG and RTS elements that puts players at the center of the mysterious and wonderful SpellForce universe. Demons Of The Past adds five new maps, offering eight in total to explore."}, {"name": "The Chronicles of Narnia: Prince Caspian", "details_link": "https://www.metacritic.com/game/ds/the-chronicles-of-narnia-prince-caspian", "publisher": "Disney Interactive Studios", "release_date": "May 15 2008", "developers": ["Fall Line Studio"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General"], "meta_score": 54, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/55063bd3ac315b48e5ea370206325bf5-98.jpg", "descriptions": "The Chronicles of Narnia: Prince Caspian for Nintendo DS, which is an action/role playing game, debuts DGamer, Disney Interactive Studios’ innovative new technology that provides a fun, connected game community for Disney video game fans. With DGamer, players earn content, interact and chatThe Chronicles of Narnia: Prince Caspian for Nintendo DS, which is an action/role playing game, debuts DGamer, Disney Interactive Studios’ innovative new technology that provides a fun, connected game community for Disney video game fans. With DGamer, players earn content, interact and chat with others on Nintendo DS through the Nintendo Wi-Fi Connection or on a computer through the Disney.com website. [Disney Interactive]… Expand"}, {"name": "Scooby-Doo! Mystery Mayhem", "details_link": "https://www.metacritic.com/game/gamecube/scooby-doo!-mystery-mayhem", "publisher": "THQ", "release_date": "Mar  2 2004", "developers": ["Artificial Mind and Movement"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 54, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/e25d6d6fcba748a2bbe644b7fa167303-98.jpg", "descriptions": "Scooby and the Gang are back in an all-new adventure.  Join your favorite slackers as they try to solve a mystery of supernatural proportions.  The gang starts out on a routine case in the search of ghosts.  During their search, a scheming business tycoon, who will stop at nothing to growScooby and the Gang are back in an all-new adventure.  Join your favorite slackers as they try to solve a mystery of supernatural proportions.  The gang starts out on a routine case in the search of ghosts.  During their search, a scheming business tycoon, who will stop at nothing to grow his empire, uses the Tome of Doom to unlock some of the creepiest monsters our gang has every seen.  Help Scooby and Shaggy find the Tome of Doom, capture monsters, and solve the mystery.  Would you help Scooby and Shaggy solve this mystery for a Scooby Snack?… Expand"}, {"name": "BMX XXX", "details_link": "https://www.metacritic.com/game/playstation-2/bmx-xxx", "publisher": "Acclaim", "release_date": "Nov 16 2002", "developers": ["Z-Axis", "Ltd."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 54, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/622386625d20675f535dcbd90e050a9e-98.jpg", "descriptions": "Features hilarious scripted events written by Hollywood's best comedians. Mind-blowing mature content that will have you belly laughing and coming back for more. Create-a-Rider and Park Editor gives you the choice to create your own BMX experience. With the addition of Flatland riding, weFeatures hilarious scripted events written by Hollywood's best comedians. Mind-blowing mature content that will have you belly laughing and coming back for more. Create-a-Rider and Park Editor gives you the choice to create your own BMX experience. With the addition of Flatland riding, we now feature over 2000 different tricks. Challenge your friends with a wide array of split screen multi-player games plus, for the first time: Paint Ball BMX, Strip BMX and more. Authentic competition levels - compete against other hardcore riders at UGP's Roots Jam 2002 or at the fabled Rampage Skate Park. 8 massive levels featuring superb game design and all of the freestyle BMX disciplines like park, street, vert, dirt and flatland. [Acclaim]… Expand"}, {"name": "Real War: Rogue States", "details_link": "https://www.metacritic.com/game/pc/real-war-rogue-states", "publisher": "Simon & Schuster", "release_date": "Oct  1 2002", "developers": ["Rival Interactive"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 54, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/d967eed43f7f0ddf4cce874cbe26e1a5-98.jpg", "descriptions": "Includes 14 new single player missions, 20 new skirmish maps, new artificial intelligence called \"ADVANCED ORDERS\", new units and buildings, and new interface graphics. [SSI]"}, {"name": "Army Men: Sarge's Heroes 2", "details_link": "https://www.metacritic.com/game/playstation-2/army-men-sarges-heroes-2", "publisher": "3DO", "release_date": "Mar 20 2001", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/00df77cd1303f196383272745abc7cfe-98.jpg", "descriptions": "Sarge and the Bravo Company Commandos managed to foil the Tan Army's first assault, but do they have what it takes this time?\rGeneral Plasto has teamed up with Brigitte Bleu, a diabolically treacherous Blue Spy, the destroy the Green Nation once and for all.\rThe adventure continues asSarge and the Bravo Company Commandos managed to foil the Tan Army's first assault, but do they have what it takes this time?\rGeneral Plasto has teamed up with Brigitte Bleu, a diabolically treacherous Blue Spy, the destroy the Green Nation once and for all.\rThe adventure continues as Sarge and Vikki fight their way over pool tables, around a bedroom and across desktops to the final showdown against Plastro and his troops. Prepare for another gigantic battle!… Expand"}, {"name": "Sonic Shuffle", "details_link": "https://www.metacritic.com/game/dreamcast/sonic-shuffle", "publisher": "Sega", "release_date": "Nov 13 2000", "developers": ["Sega"], "platforms": "Dreamcast", "genres": ["Adventure", "Party"], "meta_score": 54, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/e202323b16528f3c3d90fb922d61eade-98.jpg", "descriptions": "Illumina, the Guardian Angel, needs your help. The mysterious monster Void has locked up the power of the Precioustones, and it's up to you to guide Sonic and his friends through incredible game boards to recover them. Play with up to 3 friends to find out who will be the first to save theIllumina, the Guardian Angel, needs your help. The mysterious monster Void has locked up the power of the Precioustones, and it's up to you to guide Sonic and his friends through incredible game boards to recover them. Play with up to 3 friends to find out who will be the first to save the land of Maginaryworld. Play minigames, fight bosses, work your way through special events, and more, in Sonic's latest adventure!… Expand"}, {"name": "Watchmen: The End Is Nigh", "details_link": "https://www.metacritic.com/game/playstation-3/watchmen-the-end-is-nigh", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  4 2009", "developers": ["Deadline Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/97b822ad074bc0cbb73f367a1d6753fe-98.jpg", "descriptions": "[Playstation Network]  The episodic videogame based on the Watchmen film is a mature action-brawler, which delves into the past of characters from the film and adds new challenges and rivalries for players. The game provides gamers with visceral superhero combat as urban vigilantes Rorschach[Playstation Network]  The episodic videogame based on the Watchmen film is a mature action-brawler, which delves into the past of characters from the film and adds new challenges and rivalries for players. The game provides gamers with visceral superhero combat as urban vigilantes Rorschach and Nite Owl. A complex, multi-layered mystery adventure, the film \"Watchmen\" is set in an 1985 America in which costumed superheroes are part of the fabric of everyday society, and the \"Doomsday Clock\" – which charts the USA's tension with the Soviet Union – is permanently set at five minutes to midnight. When one of his former colleagues is murdered, the washed up but no less determined masked vigilante Rorschach sets out to uncover a plot to kill and discredit all past and present superheroes. As he reconnects with his former crime-fighting legion – a ragtag group of retired superheroes, only one of whom has true powers – Rorschach glimpses a wide-ranging and disturbing conspiracy with links to their shared past and catastrophic consequences for the future. Their mission is to watch over humanity . . . but who is watching the Watchmen? [Warner Bros. Interactive]… Expand"}, {"name": "Dungeon Munchies", "details_link": "https://www.metacritic.com/game/switch/dungeon-munchies", "publisher": "Chorus Worldwide", "release_date": "Dec 15 2021", "developers": ["maJAJa"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/e2e20faa6c964c091af4f20d8745bbc2-98.jpg", "descriptions": "Hunt down monsters to cook and eat them!\r You’ve been revived in a massive underground complex and you must leave this bizarre facility. Aided by the undead Necro-Chef Simmer, you must stay safe, get fed, find a way to get out.\r\n\r\nDungeon Munchies is a side-scrolling action RPG with aHunt down monsters to cook and eat them!\r You’ve been revived in a massive underground complex and you must leave this bizarre facility. Aided by the undead Necro-Chef Simmer, you must stay safe, get fed, find a way to get out.\r Dungeon Munchies is a side-scrolling action RPG with a focus on hunting down creatures, cooking them, and eating dishes to gain certain abilities. The combination of dishes you choose to eat will impact your entire play style.\r Big Menu for a Big Stomach\rWith a stomach that can only take seven dishes, you must put together a meal that maximises your abilities. Guava juice, grilled shrimp, or crab stirfry may mean the difference between health recovery, damage output or a watery shield.\r Tools of the Trade\rCraft all kinds of deadly weapons out of the animal and plant parts you can't eat. Pair them with your favorite dishes to create the most overpowered combat combo.\r Farm-fresh & Locally-sourced\rIn this day and age, ingredients are hard to come by. You should be prepared to face off electrical snails, razor-sharp shrimp claws, and laser wasps to get the delicious parts you need.\r Something Doesn’t Feel Right...\rFrom the self-professed-AAA-license-holding necro-chef, to the diabolical voodoo “Lord of the Forest”, to the radical revolutionaries of the fruit revolution, everyone wants you to do their thing, but no one's really right in the head. What’s really happening down in this dungeon?\r… Expand"}, {"name": "Metal Gear Survive", "details_link": "https://www.metacritic.com/game/pc/metal-gear-survive", "publisher": "Konami", "release_date": "Feb 21 2018", "developers": ["Konami"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 54, "users_score": 1.3, "image": "https://static.metacritic.com/images/products/games/7/9b976bd83174fa794e4c12171894dbbd-98.jpg", "descriptions": "Metal Gear Survive picks up from the ending of METAL GEAR SOLID V: GROUND ZEROES, to an alternate timeline caused by unexplained wormholes forming in the sky."}, {"name": "LEGO The Lord of the Rings", "details_link": "https://www.metacritic.com/game/playstation-vita/lego-the-lord-of-the-rings", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 30 2012", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Adventure", "General", "General", "Compilation", "Linear"], "meta_score": 54, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/1fffe040f6cb7830db42109f7a4c9f59-98.jpg", "descriptions": "LEGO The Lord of the Rings retells the story of the Lord of the Rings Trilogy through the visuals of the LEGO universe."}, {"name": "Rise of the Argonauts", "details_link": "https://www.metacritic.com/game/xbox-360/rise-of-the-argonauts", "publisher": "Codemasters", "release_date": "Dec 16 2008", "developers": ["Liquid Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 54, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/015f623f42b29193e0ba342f29aee0bc-98.jpg", "descriptions": "Rise of the Argonauts immerses gamers in a gladiatorial adventure, set in wondrously imagined vision of ancient Greece. With deep exploration and epic quests, players live a life of brutal combat as they lead a team of iconic warriors - including Jason, Hercules and Atalanta - through aRise of the Argonauts immerses gamers in a gladiatorial adventure, set in wondrously imagined vision of ancient Greece. With deep exploration and epic quests, players live a life of brutal combat as they lead a team of iconic warriors - including Jason, Hercules and Atalanta - through a world ruled by mythological gods. [Codemasters]… Expand"}, {"name": "RIDE", "details_link": "https://www.metacritic.com/game/xbox-one/ride", "publisher": "Bandai Namco Games", "release_date": "Oct  6 2015", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Racing", "Simulation", "General", "Automobile"], "meta_score": 54, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/5/ce36e0457b2dce2ea85e2776118222bb-98.jpg", "descriptions": "The game features over one hundred bike models across 4 different categories: Superbikes, Supersports, Naked Bikes and Historic Bikes."}, {"name": "Sonic and the Black Knight", "details_link": "https://www.metacritic.com/game/wii/sonic-and-the-black-knight", "publisher": "Sega", "release_date": "Mar  3 2009", "developers": ["Sonic Team"], "platforms": "Wii", "genres": ["Action", "Adventure", "Platformer", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 54, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/22c82294ae8608787e2913257f8c34ce-98.jpg", "descriptions": "Sonic and the Black Knight is a Wii-exclusive adventure. Part of the storybook series of games that began with Sonic and the Secret Rings, this title brings Sonic into the world of Arthurian legend and offers the world's most famous blue hedgehog the chance to become a knight. Using theSonic and the Black Knight is a Wii-exclusive adventure. Part of the storybook series of games that began with Sonic and the Secret Rings, this title brings Sonic into the world of Arthurian legend and offers the world's most famous blue hedgehog the chance to become a knight. Using the unique Wii control system, this game takes advantage of both the Wii Remote and the Nunchuk to offer an interactive experience that Sonic fans will love. Created by Sonic Team in Japan, this innovative game takes Sonic into a medieval world and arms him with a sword to aid in his effort to save the day. Sonic and the Black Knight hosts an irresistible cast of characters and teaches Sonic fans what it takes to be a true hero and the ultimate knight. With a series of missions set in stunning Arthurian-inspired locations, Sonic and the Black Knight promises a fast-paced adventure. [Sega]… Expand"}, {"name": "Road to Guangdong", "details_link": "https://www.metacritic.com/game/xbox-one/road-to-guangdong", "release_date": "Aug 28 2020", "developers": ["Just Add Oil Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/78f1d4892cf3541ca7aa45887f13ee0d-98.jpg", "descriptions": "A family emergency reunites a young art graduate and her elderly aunt for a memorable road trip across 1990s China. Sunny’s life is at a crossroads. She knows everything’s about to change. She just doesn’t know how yet. She glances again at the contract. The good news is she’s now the proudA family emergency reunites a young art graduate and her elderly aunt for a memorable road trip across 1990s China. Sunny’s life is at a crossroads. She knows everything’s about to change. She just doesn’t know how yet. She glances again at the contract. The good news is she’s now the proud owner of her family‘s cherished restaurant. The bad news? It’s seen better days.\rA tap at the door announces the arrival of her aunt, Guu Ma.\rYep, everything’s about to change alright. But the “how” part will be decided by a bunch of strangers she’s only seen in faded photographs.… Expand"}, {"name": "Need for Speed Undercover", "details_link": "https://www.metacritic.com/game/wii/need-for-speed-undercover", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["Exient Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 54, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/b5b43431f16ed1158c92d9ee58cb20b5-98.jpg", "descriptions": "Need for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a uniqueNeed for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a unique technology that generates incredible high-performance moves at 180 miles per hour during breathtaking highway battles. A mix of computer graphics and live-action movies immerses gamers in the rich world of the Tri-City Bay Area. The city’s open-world environment features over 80 miles of roads, including an enormous highway system that sets the stage for highway battles. These high-speed, high-stake chase sequences push players to the limit as they fight off cops and opponents while whipping through traffic at 180 miles per hour. An intelligent new A.I. mechanic delivers a realistic and high-energy action driving experience. Going back to the franchise’s roots, Need for Speed Undercover features more aggressive and intelligent cops whose sole purpose is to take down the player quickly and by any means necessary. Need for Speed Undercover also features the series' signature car customization, real-world damage and realistic driving physics. The game includes some of the hottest licensed cars such as the Audi R8, BMW M6 and Lexus IS-F. [Electronic Arts]… Expand"}, {"name": "Radiation Island", "details_link": "https://www.metacritic.com/game/switch/radiation-island", "publisher": "Atypical Games", "release_date": "Feb 22 2018", "developers": ["Atypical Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Pinball", "Survival"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/76510e429d242d84d7837f306cd299bd-98.jpg", "descriptions": "Radiation Island is a survival adventure game where you craft your own destiny in a huge open world environment. As part of the Philadelphia Experiment you have become stranded in a parallel, alternate reality. Discover this new and mysterious world, with all its surprises. Use everythingRadiation Island is a survival adventure game where you craft your own destiny in a huge open world environment. As part of the Philadelphia Experiment you have become stranded in a parallel, alternate reality. Discover this new and mysterious world, with all its surprises. Use everything you find to survive it and solve its puzzle to get back to the real world.Follow your own path in an environment of breathtaking beauty and gigantic scope. Explore huge forests inhabited by dangerous wolves, bears and mountain lions. Investigate abandoned villages and old military compounds where zombies guard vital tools, weapons and clues to the secrets of this world. You can even swim and dive, if you can avoid the hungry crocodiles.Hunt wild animals, fish or gather fruits to overcome hunger. Mine for resources and craft weapons, tools and basic vehicles. Find hidden treasures, equipment and fire arms to prevail in a world full of perils: radiation, anomalies, harsh weather and enraged zombies.Experience the full day-night cycle and face the dangers of darkness and cold.… Expand"}, {"name": "Duke Nukem Forever", "details_link": "https://www.metacritic.com/game/pc/duke-nukem-forever", "publisher": "2K Games", "release_date": "Jun 13 2011", "developers": ["Gearbox Software", "3D Realms"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 54, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/881d9cbf6aa1b5ac786cbbb632e0cf37-98.jpg", "descriptions": "The release date of this game is \"When it's done\".  Anything else, and we mean anything else is someone's speculation.  There is no date.  We don't know any date.  If you have a friend who claims they have \"inside info\", or there's some game news site, or some computer store at the mall whoThe release date of this game is \"When it's done\".  Anything else, and we mean anything else is someone's speculation.  There is no date.  We don't know any date.  If you have a friend who claims they have \"inside info\", or there's some game news site, or some computer store at the mall who claims they know - they do not.  They are making it up. (So is Metacritic!)  There is no date.  Period. And yes, we know the game has taken a long time.  There's no possible joke you could make about the game's development time that we haven't already heard.  :) [3D Realms]… Expand"}, {"name": "Valkyria Revolution", "details_link": "https://www.metacritic.com/game/playstation-4/valkyria-revolution", "publisher": "SegaSoft", "release_date": "Jun 27 2017", "developers": ["Media.Vision"], "platforms": ["PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "Action RPG", "Tactics"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/4712b388a75bad5742ad46c9fc752f4b-98.jpg", "descriptions": "Jutlands elite soldiers, the Vanargand, must band together to defeat the Ruzi Empire and stop death itself - the Valkyria. This grizzled anti-Valkyria squad is equipped with advanced mana weaponry and has the powerful ability to wield ragnite spells to combat this terrifying threat. The unitJutlands elite soldiers, the Vanargand, must band together to defeat the Ruzi Empire and stop death itself - the Valkyria. This grizzled anti-Valkyria squad is equipped with advanced mana weaponry and has the powerful ability to wield ragnite spells to combat this terrifying threat. The unit is comprised of soldiers who have a high affinity for ragnite, and even Jutlands own Princess Ophelia has joined the ranks. The princess carries the utmost love for her country and has answered the call of duty to liberate those who are suffering from the Ruzis tyranny. However, Amleth Gronkjaer, the commanding officer of Vanargand hides a terrible secret. Is he friend or foe to the country he has sworn to protect?… Expand"}, {"name": "Astro Boy", "details_link": "https://www.metacritic.com/game/playstation-2/astro-boy", "publisher": "Sega", "release_date": "Aug 18 2004", "developers": ["Sonic Team"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 54, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/9c541214f95ad32a08e6392e8fd20494-98.jpg", "descriptions": "(Known in Japan as \"Astro Boy Tetsuwan Atom\") As the skies of Metro City fill with giant mechs, Astro, a robot with human emotions, arrives in a blaze of glory to defend all that is good. Fueled by jet-powered legs, he buzzes the menacing beasts and blasts them with lethal laser fire from(Known in Japan as \"Astro Boy Tetsuwan Atom\") As the skies of Metro City fill with giant mechs, Astro, a robot with human emotions, arrives in a blaze of glory to defend all that is good. Fueled by jet-powered legs, he buzzes the menacing beasts and blasts them with lethal laser fire from his fingertips. Astro will stop at nothing to protect the humans and robots of his city and as he does, he discovers he is far more powerful than he ever realized. [Sega]… Expand"}, {"name": "Harry Potter for Kinect", "details_link": "https://www.metacritic.com/game/xbox-360/harry-potter-for-kinect", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct  9 2012", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": "Xbox 360", "genres": ["Adventure", "General", "Action Adventure", "General", "Fantasy"], "meta_score": 54, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/0d5e9ec67ddcfb058f8702c459f0c916-98.jpg", "descriptions": "Harry Potter for Kinect allows you to join Harry Potter, Ron Weasley, and Hermione Granger as they embark on a harrowing journey."}]