[{"name": "Shadowbane", "details_link": "https://www.metacritic.com/game/pc/shadowbane", "publisher": "Ubisoft", "release_date": "Mar 25 2003", "developers": ["Wolfpack Studios"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/0dda516df870ad1baca86f301ef9548b-98.jpg", "descriptions": "After a millennium of strife, toil, and struggle, the world of Aerynth suffered a massive catastrophe from which it has yet to recover. You must choose how to survive in this new and treacherous land. Whether the path is to quest alone, build a city, rule an empire or siege enemy kingdoms,After a millennium of strife, toil, and struggle, the world of Aerynth suffered a massive catastrophe from which it has yet to recover. You must choose how to survive in this new and treacherous land. Whether the path is to quest alone, build a city, rule an empire or siege enemy kingdoms, you are empowered to follow your calling. Only in Shadowbane, can you truly change your world. [Ubi Soft]… Expand"}, {"name": "Fire Emblem: Three Houses - Side Story: Cindered Shadows", "details_link": "https://www.metacritic.com/game/switch/fire-emblem-three-houses---side-story-cindered-shadows", "publisher": "Nintendo", "release_date": "Feb 13 2020", "developers": ["Intelligent Systems"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/760cb2e13ad8a6f4fbbe59206b16ee38-98.jpg", "descriptions": "Work with a group called the Ashen Wolves, a forgotten group of students who inhabit the underground facility called Abyss. Yuri, Hapi, Balthus, and Constance are the four members of the Ashen Wolves."}, {"name": "Immortal Cities: Children of the Nile", "details_link": "https://www.metacritic.com/game/pc/immortal-cities-children-of-the-nile", "publisher": "Myelin Media", "release_date": "Nov  8 2004", "developers": ["Tilted Mill"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/944ed0aa6108246d048582fabe23a7f8-98.jpg", "descriptions": "Children of the Nile is the next generation of city-building game, where, as Pharaoh, you lead the people of ancient Egypt, uniting them as you elevate your status, striving to become a supreme and god-like ruler. You design and build glorious cities in which hundreds of seemingly realChildren of the Nile is the next generation of city-building game, where, as Pharaoh, you lead the people of ancient Egypt, uniting them as you elevate your status, striving to become a supreme and god-like ruler. You design and build glorious cities in which hundreds of seemingly real people live and work in an interconnected societal web, each facet of their lives played out in vivid detail. Eventually you will forge the most advanced civilization of the ancient world, achieve works of wonder and build a lasting and unique empire to stand for the ages with you as its personification. You'll dispatch your armies and navies to all corners of the known world, and erect monuments of splendor, including your own magnificent tomb. Come, enter your realm: the black land, Egypt. [Myelin Media]… Expand"}, {"name": "Farming Simulator 22", "details_link": "https://www.metacritic.com/game/playstation-5/farming-simulator-22", "publisher": "Giants Software", "release_date": "Nov 22 2021", "developers": ["Giants Software"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 6 ", "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/a781f86274d86457a0f6cdda17e97fd4-98.jpg", "descriptions": "Assume the role of a modern farmer in three diverse American and European environments. Take on a huge variety of farming operations focusing on agriculture, animal husbandry and forestry - now with the exciting addition of seasonal cycles. More than 400 machines and tools from over 100 realAssume the role of a modern farmer in three diverse American and European environments. Take on a huge variety of farming operations focusing on agriculture, animal husbandry and forestry - now with the exciting addition of seasonal cycles. More than 400 machines and tools from over 100 real agricultural brands like John Deere, CLAAS, Case IH, New Holland, Fendt, Massey Ferguson, Valtra and many more are included. New machine categories, crops and mechanics will add to the experience.\r Run your farm cooperatively in multiplayer and extend the game by a multitude of free community-created modifications. Start farming and let the good times grow! … Expand"}, {"name": "Test Drive Unlimited", "details_link": "https://www.metacritic.com/game/playstation-2/test-drive-unlimited", "publisher": "Atari", "release_date": "Mar 20 2007", "developers": ["Melbourne House"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/fd0eeda7fe3c0d4879bcb15964a9781e-98.jpg", "descriptions": "Test Drive Unlimited is the only game that immerses you into the car and bike enthusiast lifestyle, with total freedom to race however and wherever you want within a huge, online-persistent environment. Visit the most sophisticated car and bike dealers to purchase new vehicles or simply takeTest Drive Unlimited is the only game that immerses you into the car and bike enthusiast lifestyle, with total freedom to race however and wherever you want within a huge, online-persistent environment. Visit the most sophisticated car and bike dealers to purchase new vehicles or simply take them for a spin. Collect and trade rare performance parts and customize each vehicle to make it one-of-a-kind. Test Drive Unlimited challenges players online to experience the most exotic and fastest vehicles on more than 1000 miles of diverse Hawaiian roads. Gamers win races, challenges, missions and tournaments to earn credits and purchase new cars, bikes, rare performance parts, clothes, apparel, homes and garages. Features more than 125 licensed vehicles from exclusive manufacturers including Lamborghini, Ducati, Aston Martin, Mercedes, Saleen, Shelby, and Jaguar; Upgrade each car or bike with options from the actual manufacturers' catalog. Players create characters, buy new homes and garages, and tune and upgrade vehicles with aftermarket parts; Extracurricular activities such as expanding your garage, getting clothes and fashion accessories for your avatar, helping hitchhikers catch planes, picking up girls, chasing car thieves, and escaping from a psychopath. [Atari]… Expand"}, {"name": "The Maw", "details_link": "https://www.metacritic.com/game/xbox-360/the-maw", "publisher": "Twisted Pixel Games", "release_date": "Jan 21 2009", "developers": ["Twisted Pixel Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/1347687dd3536984ddf565b9920dd2c9-98.jpg", "descriptions": "[Xbox Live Arcade]  The pinnacle of alien evolution, Maw is a cowardly fat blob concerned mostly with snacking and lounging. He can, however, absorb the traits of anything he eats, is virtually indestructible, and can grow to unlimited size. If he wasn't a danger to all life in the universe,[Xbox Live Arcade]  The pinnacle of alien evolution, Maw is a cowardly fat blob concerned mostly with snacking and lounging. He can, however, absorb the traits of anything he eats, is virtually indestructible, and can grow to unlimited size. If he wasn't a danger to all life in the universe, he'd make the perfect pet. In this action/adventure game, he's the best friend of our hero Frank, and only by working together can Maw eat their way to freedom. The Maw was honored with the Audience Choice Award in the 2008 PAX-10 showcase of independent games, and is a finalist at this year's Independent Games Festival for Technical Excellence. [Twisted Pixel]… Expand"}, {"name": "Crossing Souls", "details_link": "https://www.metacritic.com/game/playstation-4/crossing-souls", "publisher": "Devolver Digital", "release_date": "Feb 13 2018", "developers": ["Fourattic"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/e51c16ae0322467c7799f5d6e8695f76-98.jpg", "descriptions": "It’s 1986 in California. A group of friends discover a mysterious pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control five kids with specials skills while fightingIt’s 1986 in California. A group of friends discover a mysterious pink stone that allows to travel between two realms. This gang will live the summer of their lives in an adventure that will get them involved in a government conspiracy. Control five kids with specials skills while fighting and solving puzzles.… Expand"}, {"name": "Raskulls", "details_link": "https://www.metacritic.com/game/xbox-360/raskulls", "publisher": "Halfbrick Studios", "release_date": "Dec 29 2010", "developers": ["Halfbrick Studios"], "platforms": "Xbox 360", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/9fd27ef2dc4cf42bd6f6a375f86622fe-98.jpg", "descriptions": "Raskulls is a puzzle platform game available for download on Xbox Live Arcade."}, {"name": "ISLANDERS: Console Edition", "details_link": "https://www.metacritic.com/game/switch/islanders-console-edition", "publisher": "GrizzlyGames", "release_date": "Aug 11 2021", "developers": ["GrizzlyGames"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/572aa2a7af834ed6eebd4eaa8cc37f3d-98.jpg", "descriptions": "You want to build beautiful cities without investing hours on end into stressful resource management? Say no more! ISLANDERS should be right up your alley. ISLANDERS is a minimalist strategy game about building cities on colorful islands. Explore an infinite number of ever-changing newYou want to build beautiful cities without investing hours on end into stressful resource management? Say no more! ISLANDERS should be right up your alley. ISLANDERS is a minimalist strategy game about building cities on colorful islands. Explore an infinite number of ever-changing new lands, expand your settlements from sprawling villages to vast cities and enjoy the relaxing atmosphere.… Expand"}, {"name": "Jurassic World Evolution: Complete Edition", "details_link": "https://www.metacritic.com/game/switch/jurassic-world-evolution-complete-edition", "publisher": "Frontier Developments", "release_date": "Nov  3 2020", "developers": ["Frontier Developments"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/8e4e1dabc59597f1d304600fe8b776bb-98.jpg", "descriptions": "Build your own Jurassic World for the first time or relive the adventure on the go with Jurassic World Evolution: Complete Edition! Packed with every piece of downloadable content available, Jurassic World Evolution: Complete Edition for Nintendo Switch includes all three major narrativeBuild your own Jurassic World for the first time or relive the adventure on the go with Jurassic World Evolution: Complete Edition! Packed with every piece of downloadable content available, Jurassic World Evolution: Complete Edition for Nintendo Switch includes all three major narrative expansions – Jurassic World Evolution: Return to Jurassic Park, Jurassic World Evolution: Claire’s Sanctuary, and Jurassic World Evolution: Secrets of Dr. Wu- as well as four Dinosaur Packs and the Raptor Squad Skin Collection.\r Take charge of operations on the legendary islands of The Cinco Muertes Archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for science, entertainment or security interests in an uncertain world where life always finds a way.\r Bioengineer over 60 dinosaurs that think, feel and react intelligently to the world around them. Play with life itself to give your dinosaurs unique behaviours, traits and appearances, then contain and profit from them to fund your global search for lost dinosaur DNA.\r Control the big picture with deep management tools or go hands-on to confront challenges on the ground or in the air. Expand your islands and choose your own journey in an captivating narrative featuring iconic characters from across the film franchise and decades of Jurassic World lore at your fingertips.\r Embark on a journey with captivating stories, challenging missions and more remarkable dinosaurs with three major expansions:\r Jurassic World Evolution: Return to Jurassic Park: Following the events of the iconic 1993 film, you are invited to return to the island where it all started to rebuild the original Jurassic Park. Reclaim the park from the dinosaurs, rebuild beloved locations, and overcome challenges guided by Dr. Alan Grant, Dr. Ellie Sattler, and Dr. Ian Malcolm in an original narrative voiced by the film cast.\r Jurassic World Evolution: Claire’s Sanctuary: The once dormant Mt. Sibo is expected to erupt at any time and threatens to send the dinosaurs of Isla Nublar back to extinction. Leap into action with former Jurassic World Park Operations Manager, Claire Dearing, and work together on this rescue mission to save these magnificent creatures.\r Jurassic World Evolution: Secrets of Dr. Wu: Hidden within Las Cinco Muertes is an intriguing storyline featuring campaign missions from Dr. Henry Wu, who remains dedicated to his research with hybrid dinosaurs.… Expand"}, {"name": "Crying Suns", "details_link": "https://www.metacritic.com/game/pc/crying-suns", "publisher": "Alt Shift", "release_date": "Sep 18 2019", "developers": ["Alt Shift"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/b191299b1fd4465051631eb02100e931-98.jpg", "descriptions": "Crying Suns is a tactical rogue-lite that puts you in the role of a space fleet commander as you explore a mysteriously fallen empire. In this story rich experience inspired by Dune and Foundation, each successful run will uncover the truth about the Empire... and yourself as well."}, {"name": "Heavy Rain", "details_link": "https://www.metacritic.com/game/pc/heavy-rain", "publisher": "Quantic Dream", "release_date": "Jun 24 2019", "developers": ["Quantic Dream", "Virtuos"], "platforms": ["PlayStation 3", "PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/0ea984a7a58125e0e8cd8de9b900cb7a-98.jpg", "descriptions": "Experience a gripping psychological crime thriller filled with innumerable twists and turns, where even the smallest actions and choices can cause dramatic consequences. The hunt is on for the Origami Killer, named after his calling card of leaving folded paper shapes on victims. FourExperience a gripping psychological crime thriller filled with innumerable twists and turns, where even the smallest actions and choices can cause dramatic consequences. The hunt is on for the Origami Killer, named after his calling card of leaving folded paper shapes on victims. Four characters, each with their own motives, take part in a desperate attempt to stop the killer from claiming a new victim.… Expand"}, {"name": "BattleForge", "details_link": "https://www.metacritic.com/game/pc/battleforge", "publisher": "Electronic Arts", "release_date": "Mar 23 2009", "developers": ["EA Phenomic"], "platforms": "PC", "num_players": "12  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/94ce294ac9f52dcb624b865d9e43bbaa-98.jpg", "descriptions": "BattleForge is a fantasy online real-time strategy game where you assemble your own army with collectible trading cards. Win, trade and buy your cards online to create your ultimate deck. Mix and match the elements of your cards to play with your friends online and conquer massive onlineBattleForge is a fantasy online real-time strategy game where you assemble your own army with collectible trading cards. Win, trade and buy your cards online to create your ultimate deck. Mix and match the elements of your cards to play with your friends online and conquer massive online battlegrounds. For mortals caught in a clash between insane gods and ancient giants, standing together is the only option. Using the forces of Fire, Frost, Nature and Shadow a mysterious Forge which makes legends come to life, is their single hope to create armies powerful enough to overcome these impossible odds. It is now time to set out and reclaim an epic fantasy world which has been overthrown by sinister powers in the twilight of a dying sun. [Electronic Arts]… Expand"}, {"name": "Madden NFL 08", "details_link": "https://www.metacritic.com/game/psp/madden-nfl-08", "publisher": "EA Sports", "release_date": "Aug 14 2007", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/bdcb51ae5997df9339969d88f47c19c7-98.jpg", "descriptions": "All-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. New Superstar Challenge: A PSP exclusive, playAll-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. New Superstar Challenge: A PSP exclusive, play as an NFL superstar and determine the outcome of the biggest moments from the 2006 NFL season. [EA Sports]… Expand"}, {"name": "Patapon 2 Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/patapon-2-remastered", "publisher": "SCEA", "release_date": "Jan 30 2020", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/6aa12a234e9725734ff3272714ab8354-98.jpg", "descriptions": "The story of the Patapon tribe marches forth as they hunt for the fabled Earthend. Shipwrecked in a new and strange continent the Patapon are depending on you, their god, to lead them safely through this perilous new land. As you guide the tribe through this new world with your mysticalThe story of the Patapon tribe marches forth as they hunt for the fabled Earthend. Shipwrecked in a new and strange continent the Patapon are depending on you, their god, to lead them safely through this perilous new land. As you guide the tribe through this new world with your mystical drum, they will come face to face with a new tribe, encounter a mysterious and mighty Hero Patapon and uncover the ruins of Patapolis, a mystical place long spoken of by the Patapon. All-new modes to Patapon 2 include thrilling multiplayer stages, a huge array of missions and deep tutorials that will have you drumming to the beat of the Patapon in no time. Head to patapon-game.com for the captivating mini-game, The Art Of War, where the goal is to collect as many Patapon characters as you can and then immortalise your battle with the Patapon Wallpaper creator. Lead your loyal followers through 60 rhythmic stages. Keep the beat going with tons of hidden items and mini-games to reveal. Drum along with friends and tackle multiplayer missions.… Expand"}, {"name": "Gravity Ghost", "details_link": "https://www.metacritic.com/game/pc/gravity-ghost", "publisher": "Ivy Games LLC", "release_date": "Jan 26 2015", "developers": ["Ivy Games LLC"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/7f0373cc5c74d47d05c6170fb7447bac-98.jpg", "descriptions": "Gravity Ghost is a physics-based title with a twist. Run, jump, and soar around planets, using gravity to glide through the air. Explore a shattered galaxy and rescue its survivors, armed with powerups and mysterious terraforming powers."}, {"name": "WWE SmackDown vs. Raw 2011", "details_link": "https://www.metacritic.com/game/xbox-360/wwe-smackdown-vs-raw-2011", "publisher": "THQ", "release_date": "Oct 26 2010", "developers": ["Yuke's"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/506c5c8e5119c053bacc231a763c333b-98.jpg", "descriptions": "WWE SmackDown vs. Raw 2011 will empower players more than ever to to define their gameplay experiences in a dynamic and ever-changing WWE.  Along the way, gameplay scenarios will change based on player decisions, allowing for more spontaneous WWE action in and out of the ring.  Players willWWE SmackDown vs. Raw 2011 will empower players more than ever to to define their gameplay experiences in a dynamic and ever-changing WWE.  Along the way, gameplay scenarios will change based on player decisions, allowing for more spontaneous WWE action in and out of the ring.  Players will also enjoy a greater level of interactivity and have increased control of their destinies in the game's popular Road to WrestleMania story-driven mode.  … Expand"}, {"name": "Elebits", "details_link": "https://www.metacritic.com/game/wii/elebits", "publisher": "Konami", "release_date": "Dec 12 2006", "developers": ["Konami"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/148c0f5cf2e3402c8a6864feda86cb8f-98.jpg", "descriptions": "(Also known as \"Eledees\")  A revolutionary game of hide and seek. Search high and low for mischievous little Elebits using the features of the Nintendo Wii controller to push, pull, lift, throw and interact with anything and everything in the environment. Full interactivity with any object(Also known as \"Eledees\")  A revolutionary game of hide and seek. Search high and low for mischievous little Elebits using the features of the Nintendo Wii controller to push, pull, lift, throw and interact with anything and everything in the environment. Full interactivity with any object in the environment. Hundreds of Elebits to search for and find. Gain additional abilities as you capture more Elebits. [Konami]… Expand"}, {"name": "Full Metal Furies", "details_link": "https://www.metacritic.com/game/xbox-one/full-metal-furies", "publisher": "Cellar Door Games", "release_date": "Jan 17 2018", "developers": ["Cellar Door Games"], "platforms": ["PC", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/f9909f0f6b2cdaaa3c797e74538ec6a3-98.jpg", "descriptions": "From the creators of Rogue Legacy comes a \"true-cooperative\" action RPG. FULL METAL FURIES puts an emphasis on team play with a unique combat system where everyone is important. Play on the couch, alone or with friends, or make it an online party for up to four players."}, {"name": "The Evil Within", "details_link": "https://www.metacritic.com/game/playstation-4/the-evil-within", "publisher": "Bethesda Softworks", "release_date": "Oct 14 2014", "developers": ["Tango Gameworks"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/ffa2a803ade277eb89f0c975c23a7ff0-98.jpg", "descriptions": "While investigating the scene of a gruesome mass murder, Detective Sebastian Castellanos and his partners encounter a menacing and powerful force. After witnessing the slaughter of fellow officers, Sebastian is ambushed and knocked unconscious. When he awakens, he finds himself in a derangedWhile investigating the scene of a gruesome mass murder, Detective Sebastian Castellanos and his partners encounter a menacing and powerful force. After witnessing the slaughter of fellow officers, Sebastian is ambushed and knocked unconscious. When he awakens, he finds himself in a deranged world where hideous creatures wander among the dead. Facing unimaginable terror, and fighting for survival, Sebastian embarks on a daunting journey to unravel that which is behind this evil force.… Expand"}, {"name": "AquaPazza: AquaPlus Dream Match", "details_link": "https://www.metacritic.com/game/playstation-3/aquapazza-aquaplus-dream-match", "publisher": "Atlus", "release_date": "Nov 19 2013", "developers": ["Examu"], "platforms": "PlayStation 3", "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/bf8f3835a5f411f4827ee06bb36c4632-98.jpg", "descriptions": "What is AquaPazza? Legend speaks of an amazing magical power that would grant its controllers desires, but what happens when such an influential power is misused? Choose from 13 main characters and 13 support characters to fight in a world corrupted by powerful magic in this uniquelyWhat is AquaPazza? Legend speaks of an amazing magical power that would grant its controllers desires, but what happens when such an influential power is misused? Choose from 13 main characters and 13 support characters to fight in a world corrupted by powerful magic in this uniquely illustrated, wildly entertaining, all-out fighting game. Use flashy combos, partner attacks, and high emotion to restore balance to the world! \r\rGather a team of two, thrust into battle, and go crazy with your attacks! From bookshelves to lancesuse all weapons at your disposal! AquaPazza utilizes mechanics that allow players to easily link together attacks and break through even the toughest of defenses. Fighting isnt all about being physically strong! Players who keep their character's morale high during battle will be granted an advantage, allowing attacks to deal more damage and defense to become higher than ever!… Expand"}, {"name": "River City Ransom EX", "details_link": "https://www.metacritic.com/game/game-boy-advance/river-city-ransom-ex", "publisher": "Atlus Co.", "release_date": "May 25 2004", "developers": ["Million"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/b7eb3db9b024a805cfc6238f9ed31c04-98.jpg", "descriptions": "The classic NES game returns with improved graphics and even more role-playing action. As in the original game, River City Ransom for the Game Boy Advance blends action, fighting, and role-playing elements into one game. You'll play one of two young heroes who must battle their way past cityThe classic NES game returns with improved graphics and even more role-playing action. As in the original game, River City Ransom for the Game Boy Advance blends action, fighting, and role-playing elements into one game. You'll play one of two young heroes who must battle their way past city gangs and then defeat the gang lord to free the students of River City High. More than just a side-scrolling fighting game, River City Ransom EX features a character-building system and customization options. … Expand"}, {"name": "Moonscars", "details_link": "https://www.metacritic.com/game/pc/moonscars", "publisher": "Humble Games", "release_date": "Sep 27 2022", "developers": ["Black Mermaid"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 75, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/6b24d1a4230c1fd4362966f1bcee80ee-98.jpg", "descriptions": "Push the limits of your combat skills, and master new abilities to progress through an unforgiving nonlinear 2D world. Face off against the relentless darkness that seeks to destroy you. In Moonscars, every death is a lesson learnt—and as you overcome each challenge, new truths will be revealed."}, {"name": "The Elder Scrolls Online: Morrowind", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-online-morrowind", "publisher": "Bethesda Softworks", "release_date": "Jun  6 2017", "developers": ["Bethesda Softworks"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/1de20d87b2949523c9539485507f8f7a-98.jpg", "descriptions": "Return to Morrowind in this new chapter of the online role-playing series, The Elder Scrolls Online. Morrowind is on the verge of destruction, and it's up to you to save it from a deadly Daedric threat. Embark on a dangerous journey through legendary locales, from volcanic ashlands toReturn to Morrowind in this new chapter of the online role-playing series, The Elder Scrolls Online. Morrowind is on the verge of destruction, and it's up to you to save it from a deadly Daedric threat. Embark on a dangerous journey through legendary locales, from volcanic ashlands to mushroom-filled forests. Includes The Elder Scrolls Online: Tamriel Unlimited, the first game of the acclaimed series.… Expand"}, {"name": "Folklore", "details_link": "https://www.metacritic.com/game/playstation-3/folklore", "publisher": "SCEA", "release_date": "Oct  9 2007", "developers": ["Game Republic", "JapanStudio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/e6a1239dc46872ee0c92340414eaa37b-98.jpg", "descriptions": "Folklore is a unique, dark fantasy adventure inspired by western fairy tales. Set in the mysterious town of Doolin, two strangers, Keats and Ellen, are drawn together to uncover a mysterious legend in a remote village that exists on the border between dreams and reality. They soon learn thatFolklore is a unique, dark fantasy adventure inspired by western fairy tales. Set in the mysterious town of Doolin, two strangers, Keats and Ellen, are drawn together to uncover a mysterious legend in a remote village that exists on the border between dreams and reality. They soon learn that the town serves as a gateway to fantastic realms, full of creatures, spirits and monsters. In order to solve the mystery of the town, and their past, the pair must journey through these worlds to uncover its secrets. [SCEA]… Expand"}, {"name": "Syndicate", "details_link": "https://www.metacritic.com/game/playstation-3/syndicate", "publisher": "Electronic Arts", "release_date": "Feb 21 2012", "developers": ["Starbreeze"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "Shooter", "General", "Shooter", "First-Person", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/9bbc08694e7a1743946484941b9406ba-98.jpg", "descriptions": "2069 - No longer governed by politicians, the world is divided into regions controlled by mega-corporations known as Syndicates. These Syndicates have revolutionized the way consumers interact with the digital world. Consumers no longer require a device to access the world's data and control2069 - No longer governed by politicians, the world is divided into regions controlled by mega-corporations known as Syndicates. These Syndicates have revolutionized the way consumers interact with the digital world. Consumers no longer require a device to access the world's data and control their technology - they can achieve this with the blink of an eye after a neural chip implant. Civilians clamored to be \"chip'd\" and to enjoy all that their selected syndicate has to offer. Housing, medical, banking, insurance, education, entertainment, and employment.  One complete package - one complete lifestyle. In return, the syndicates gained unprecedented insights, and control, over individuals and their behavior. With insufficient government oversight, business has become war. The Syndicates stop at nothing for ultimate market dominance. On the front lines of this war are the Agents, the syndicates' bio-engineered and chip-augmented enforcers. They can breach anything in the wired dataverse including their enemies, their weapons, and the environment surrounding them, making them the most efficient and deadly technological weapons in the world. Assume the role of Miles Kilo, Eurocorp's latest prototype Agent, and embark on a brutal action adventure of corruption and revenge. [Electronic Arts]… Expand"}, {"name": "Magic: The Gathering - Duels of the Planeswalkers", "details_link": "https://www.metacritic.com/game/xbox-360/magic-the-gathering---duels-of-the-planeswalkers", "publisher": "Wizards of the Coast", "release_date": "Oct 16 2009", "developers": ["Stainless Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/61f63bfb00bbdbaf9c07eacbf9bd0e04-98.jpg", "descriptions": "An extension of the world's premier trading card game, Magic: The Gathering: Duels of the Planeswalkers' brings a pulse-pounding mix of strategic thinking, fantastic artwork, and arcade-style thrills to Xbox LIVE Arcade. Experience an epic game of fantasy and strategy, as never before, whenAn extension of the world's premier trading card game, Magic: The Gathering: Duels of the Planeswalkers' brings a pulse-pounding mix of strategic thinking, fantastic artwork, and arcade-style thrills to Xbox LIVE Arcade. Experience an epic game of fantasy and strategy, as never before, when you take on the mantle of a planeswalker - a powerful mage capable of traversing the infinite planes of existence - and forge your destiny! [Wizards of the Coast]… Expand"}, {"name": "RIVE", "details_link": "https://www.metacritic.com/game/playstation-4/rive", "publisher": "Two Tribes", "release_date": "Sep 13 2016", "developers": ["Two Tribes"], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/258a46fb0116248d4bda8a39bd1106a2-98.jpg", "descriptions": "Rive is a metal-wrecking, robot-hacking shooter. This 360-degree shooter/platformer hybrid lets you choreograph a dance of destruction during an insane sequence of spectacular battles and set pieces. Rive feels like the explosive games of yore, pumping megapixels in true 21st century style.Rive is a metal-wrecking, robot-hacking shooter. This 360-degree shooter/platformer hybrid lets you choreograph a dance of destruction during an insane sequence of spectacular battles and set pieces. Rive feels like the explosive games of yore, pumping megapixels in true 21st century style. [Playstation.com]… Expand"}, {"name": "Frontlines: Fuel of War", "details_link": "https://www.metacritic.com/game/xbox-360/frontlines-fuel-of-war", "publisher": "THQ", "release_date": "Feb 25 2008", "developers": ["Kaos Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/27019c9780b5be28329d66195c6af9b5-98.jpg", "descriptions": "Not too far in the future, the global natural resources are on the brink of depletion. As our economies and our way of life tumble into chaos, the superpowers clash to gain control. Set in a fictional future based upon the headlines of today, F.O.W. brings players into the world's next greatNot too far in the future, the global natural resources are on the brink of depletion. As our economies and our way of life tumble into chaos, the superpowers clash to gain control. Set in a fictional future based upon the headlines of today, F.O.W. brings players into the world's next great war. As society succumbs to a worldwide energy crisis, a new global depression takes hold. Amidst this desperate backdrop, two superpower alliances emerge. Join the battle on the frontlines of tomorrow as the Western Coalition (U.S./E.U.) or the Red Star Alliance (Russia/China). Tomorrow's weapons, today: As depicted in F.O.W., the U.S./E.U. and Russia/China have combined their military research and budgets, and the result is over 60 next-gen vehicles and weapons inspired by military designs for the near future. This includes remote controlled drones, gun cams, and next-generation counter-measures systems, all of which are player-controllable. Use high-tech combat systems to collect and relay recon, targeting, and threat information between team mates. Target acquisition and sharing between vehicle occupants is just one example of F.O.W.'s focus on an advanced team play experience. The customization system allows players to grow their soldier to fit their play style by choosing a weapons loadout, as well as a technical specialization (role). As the game progresses each role will upgrade, providing advanced equipment and abilities. The system is a mix of RPG-like depth but with the accessibility of a fast-paced FPS. Frontline combat system: The main game mechanic featured in F.O.W. in both in single player and multiplayer, is the ability to join the forces on the front line. This front expands across large portions of a mission and will require a strategy to achieve the contextual objectives in order to move this front forward. Not only does this system keep the battle centric and players in the midst of the action, it gives a unique sense of advancement as your Division is rewarded with territory for their victories. Choose your path to victory: Within the front, players can take advantage of a sandbox of destructible elements and various weapons of war to create their own unique paths and strategies. Instead of failing and re-playing the same sequence of events, players can 'chip-away' with varied approaches, allowing diverse missions with high replay value. [THQ]… Expand"}, {"name": "Total War: Rome Remastered", "details_link": "https://www.metacritic.com/game/pc/total-war-rome-remastered", "publisher": "SegaSoft", "release_date": "Apr 29 2021", "developers": ["Feral Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 75, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/f88c09367420815222db8507374451a0-98.jpg", "descriptions": "Total War: ROME REMASTERED lets you relive the legacy that defined the award-winning strategy game series. Remastered to 4K with multiple improvements to visuals as well as refinements to gameplay, it’s time to revisit a true classic. Not everyone gets a second chance to conquer the Roman Empire."}, {"name": "Dead or Alive 5 Ultimate", "details_link": "https://www.metacritic.com/game/xbox-360/dead-or-alive-5-ultimate", "publisher": "Tecmo Koei America Corp.", "release_date": "Sep  3 2013", "developers": ["Team Ninja"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/23b04d1b86ccab13ab2ea84d345af462-98.jpg", "descriptions": "DEAD OR ALIVE 5 ULTIMATE is the definitive DEAD OR ALIVE 5 package, with new content aimed to bring players the best 3D DoA fighting experience to date. The addition of modes from DEAD OR ALIVE 5 PLUS, including Move Details Plus and a tutorial mode, will allow novice and expert fighters toDEAD OR ALIVE 5 ULTIMATE is the definitive DEAD OR ALIVE 5 package, with new content aimed to bring players the best 3D DoA fighting experience to date. The addition of modes from DEAD OR ALIVE 5 PLUS, including Move Details Plus and a tutorial mode, will allow novice and expert fighters to refine their fighting style with precision.… Expand"}, {"name": "Victor Vran", "details_link": "https://www.metacritic.com/game/pc/victor-vran", "publisher": "EuroVideo Medien", "release_date": "Jul 24 2015", "developers": ["Haemimont Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["General", "Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/3112f73e9b708e2feefd1288c5d95152-98.jpg", "descriptions": "Victor Vran is an isometric Action-RPG with a vast selection of weapons, items, outfits, demon powers and destiny cards. Experience combat action with dozens of enemies attacking you from all sides and unleash powerful skills to finish them off."}, {"name": "Dying Light", "details_link": "https://www.metacritic.com/game/pc/dying-light", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jan 27 2015", "developers": ["Techland"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Horror", "Horror", "Action Adventure", "Survival"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/6091d74cc5e4c4a541a3523be4126c74-98.jpg", "descriptions": "Dying Light allows you traverse an open world mired into chaos and destruction. In this environment, you scrap for survival against an array of enemies as the infected are not the only threat: accosting other desperate human beings is typically the only way to get precious supplies."}, {"name": "Resident Evil: Revelations 2 - Episode 1: Penal Colony", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-revelations-2---episode-1-penal-colony", "publisher": "Capcom", "release_date": "Feb 24 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/346632da308bfb323ac739adafd4a2e3-98.jpg", "descriptions": "The first episode is entitled Penal Colony. Claire Redfield, one of the only survivors of the Raccoon City incident of 1998, has since joined an NGO called Terra Save, whose mission is to assist victims of biological weaponry. During an event at Terra Save’s HQ, a mysterious force abductsThe first episode is entitled Penal Colony. Claire Redfield, one of the only survivors of the Raccoon City incident of 1998, has since joined an NGO called Terra Save, whose mission is to assist victims of biological weaponry. During an event at Terra Save’s HQ, a mysterious force abducts Claire and her co-workers and moves them to a creepy deserted island.… Expand"}, {"name": "Endling - Extinction is Forever", "details_link": "https://www.metacritic.com/game/pc/endling---extinction-is-forever", "publisher": "HandyGames", "release_date": "Jul 19 2022", "developers": ["Herobeat Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Action Adventure", "General"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/6a9326d6e0080ff4de25e3de4d7f4e89-98.jpg", "descriptions": "Will the last mother fox on Earth be able to save its three little cubs? Experience how life would be in a world ravaged by mankind through the eyes of the last fox on Earth in this eco-conscious adventure. Discover the destructive eect of the human race, which corrupts day after day theWill the last mother fox on Earth be able to save its three little cubs? Experience how life would be in a world ravaged by mankind through the eyes of the last fox on Earth in this eco-conscious adventure. Discover the destructive eect of the human race, which corrupts day after day the most precious and needed resources of the natural environments. Explore Endling's 3D side-scrolling world and defend your cubs, three tiny and defenseless fur balls, feed them, see how they grow up level after level, notice their unique personalities and fears, and most importantly, make them survive. Use the cover of night to sneak with your litter towards a safer place. Spend the day resting in an improvised shelter and plan for your next movement carefully since it could be the last one for you or your cubs.… Expand"}, {"name": "Roundabout", "details_link": "https://www.metacritic.com/game/pc/roundabout", "publisher": "No Goblin", "release_date": "Sep 18 2014", "developers": ["No Goblin"], "platforms": ["PlayStation 4", "PlayStation Vita", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Mission-based", "Automobile"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/2e9542dabfe09275486357af28d308da-98.jpg", "descriptions": "Roundabout is an open world driving puzzle game where you control a constantly rotating limousine. Pick up passengers, find secret collectables, take on dangerous missions, and fall in love while reliving the 1977 rise to fame story of Georgio Manos."}, {"name": "The Night of the Rabbit", "details_link": "https://www.metacritic.com/game/pc/the-night-of-the-rabbit", "publisher": "Daedalic Entertainment", "release_date": "May 28 2013", "developers": ["Daedalic Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/0781bed8e303c689e0b0a42cca54cb48-98.jpg", "descriptions": "Becoming a magician and learning the craft of magic is the greatest dream of 12 year old Jeremiah Hazelnut. During the last two days of his summer vacation this dream finally seems to come true. Out of thin air, an elegantly dressed rabbit who goes by the name the Marquis de HotoBecoming a magician and learning the craft of magic is the greatest dream of 12 year old Jeremiah Hazelnut. During the last two days of his summer vacation this dream finally seems to come true. Out of thin air, an elegantly dressed rabbit who goes by the name the Marquis de Hoto appears,carrying Jerry with him into an enchanted realm...… Expand"}, {"name": "Me & My Katamari", "details_link": "https://www.metacritic.com/game/psp/me-my-katamari", "publisher": "Namco", "release_date": "Mar 21 2006", "developers": ["Namco"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/41206b66a2012bc38630e926843e957d-98.jpg", "descriptions": "Taking a break from celestial construction, the King of All Cosmos takes the royal family on vacation to a tropical island paradise, where they become tasked with the responsibility of creating new katamari islands for homeless animals. An epic undertaking of this time, earthly proportions,Taking a break from celestial construction, the King of All Cosmos takes the royal family on vacation to a tropical island paradise, where they become tasked with the responsibility of creating new katamari islands for homeless animals. An epic undertaking of this time, earthly proportions, the King calls upon his pint-sized son, the Prince, and all of his cousins for help. New features found in Me and My Katamari include: Wireless play for up to four people on the PSP system; A cast of playable characters that includes the Prince and his cousins – a mix of familiar faces and new additions; A host of customization options for player characters, including new masks and headgear, as well as the ability to wear them on the head, face and body; A new island interface that highlights player options and the different stages represented by animals in need of new homes. [Namco]… Expand"}, {"name": "Archer Maclean's Mercury", "details_link": "https://www.metacritic.com/game/psp/archer-macleans-mercury", "publisher": "Ignition Entertainment", "release_date": "Apr  6 2005", "developers": ["Awesome Studios"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/01b86b77097e07c7577641a786a5b598-98.jpg", "descriptions": "Using the PSP's powerful graphics, processing abilities and Wi-Fi modes, Awesome Studios has produced a brand new genre-defining puzzle game, the aim of which is simple: Guide your various, colored mercury blobs around each 3D maze simply by \"tilting\" the level. Watch as the liquid metalUsing the PSP's powerful graphics, processing abilities and Wi-Fi modes, Awesome Studios has produced a brand new genre-defining puzzle game, the aim of which is simple: Guide your various, colored mercury blobs around each 3D maze simply by \"tilting\" the level. Watch as the liquid metal blobs ebb and flow around the countless challenges encountered along the way. After a short spell in the training camp world, experience a smooth learning curve as you work your way through each level from start to finish, eventually unlocking the next world beyond. Negotiate obstacles and hazards, solve puzzles, and compete against ever- tightening time and percentage limits while avoiding traps and predators. Finally, defeat end of level boss modes to complete each world. The game has instant pick-up-and-play appeal with no instructions needed, and you can spend minutes or hours immersed in the game. Skill, timing, and dexterity are all required to navigate the 72 levels that spread across 6 unique, thematic worlds. [Ignition]… Expand"}, {"name": "Front Mission 4", "details_link": "https://www.metacritic.com/game/playstation-2/front-mission-4", "publisher": "Square Enix", "release_date": "Jun 15 2004", "developers": ["Square Enix"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/d2d46ecf0ec6bd241717738bdb67f307-98.jpg", "descriptions": "Front Mission 4 (FM4) marks the debut of the popular mech-based strategy game series on the PS2. Utilizing the technological capabilities of the system, FM4 brings you the newest chapter in the best-selling series. While boasting an enhanced battle system, outstanding new graphics andFront Mission 4 (FM4) marks the debut of the popular mech-based strategy game series on the PS2. Utilizing the technological capabilities of the system, FM4 brings you the newest chapter in the best-selling series. While boasting an enhanced battle system, outstanding new graphics and dramatic voiceovers, FM4 maintains the strategic gameplay that has won acclaim from both gamers and press worldwide. As in the previous games, players can fully customize their wanzers, or mech units, with a variety of powerful weaponry and parts. In addition, new tactical features such as the \"Link System\" bring a new dimension of strategy to the game. Set in 2096, FM4 opens as an unidentified group of wanzers assaults and destroys an E.C. German base. The player?s point of view switches between two main characters that find themselves trapped within a dangerous global conspiracy. Elsa, a new recruit in the E.C.'s Durandal corps, is sent to Germany with her team to investigate the attack. The story then shifts to Darril, a U.C.S. Army sergeant in South America. He and his company are sent to Venezuela after its governor declares independence from the U.C.S. Though Darril's squad seems far more interested in slacking off than fighting a war, their plans for early retirement are put on hold after they witness a fateful plane crash in the jungle. [Square Enix]… Expand"}, {"name": "All-Star Baseball 2005", "details_link": "https://www.metacritic.com/game/xbox/all-star-baseball-2005", "publisher": "Acclaim", "release_date": "Mar 23 2004", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/159db12e79f5f6b2dc546235933637c9-98.jpg", "descriptions": "As the baseball season gets into full swing, immerse yourself in the game with All-Star Baseball 2005, which features online head-to-head play and a deeper Franchise mode. Realistic views from the new FielderCam and BroadcastCam bring you closer to plays. Find the perfect swing withAs the baseball season gets into full swing, immerse yourself in the game with All-Star Baseball 2005, which features online head-to-head play and a deeper Franchise mode. Realistic views from the new FielderCam and BroadcastCam bring you closer to plays. Find the perfect swing with analog-control batting, and then show your slugging skills either online or in the deep Franchise mode. All-Star Baseball 2005 also features extra challenges, create-a-player, and over 80 stadiums--including current MLB parks, legendary stadiums, spring training stadiums, and fantasy parks.… Expand"}, {"name": "I-Ninja", "details_link": "https://www.metacritic.com/game/xbox/i-ninja", "publisher": "Namco", "release_date": "Dec  4 2003", "developers": ["Argonaut Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/e84b4cb461bc51083afc40b0630539ed-98.jpg", "descriptions": "He might be small, but he's one angry Ninja.  I-Ninja stars a consummate warrior who has spent years mastering his weapons and honing his skills.  Challenged by the world's most wicked villain, Master O-Dor, and his menacing army of Ranx, the young ninja must now put his skills to use.  WithHe might be small, but he's one angry Ninja.  I-Ninja stars a consummate warrior who has spent years mastering his weapons and honing his skills.  Challenged by the world's most wicked villain, Master O-Dor, and his menacing army of Ranx, the young ninja must now put his skills to use.  With access to multiple weapons, including shurikens, swords, blowguns, and rocket launchers, guide I-Ninja through imaginative missions, mini-quests, and a face off with a menacing 150-foot robot.  There is no challenge too big or risk to great for I-Ninja.… Expand"}, {"name": "Dark Age of Camelot: Trials of Atlantis", "details_link": "https://www.metacritic.com/game/pc/dark-age-of-camelot-trials-of-atlantis", "publisher": "Mythic Entertainment", "release_date": "Oct 28 2003", "developers": ["Mythic Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/9a9b195f206c541bc23c1e8b3f0180a7-98.jpg", "descriptions": "Dark Age of Camelot: Trials of Atlantis is an exciting new expansion pack for the award-winning MMORPG Dark Age of Camelot. The expansion will add the capability for players to explore the primarily underwater lost civilization of Atlantis. The background story is based on the idea that theDark Age of Camelot: Trials of Atlantis is an exciting new expansion pack for the award-winning MMORPG Dark Age of Camelot. The expansion will add the capability for players to explore the primarily underwater lost civilization of Atlantis. The background story is based on the idea that the citizens of Atlantis, forecasting the demise of their society, built an obstacle course of Trials into the ruins of their civilization to be overcome by future cultures exploring the ancient lands. In Dark Age of Camelot: Trials of Atlantis, the three Realms have each found a portal to the fabled land of Atlantis. Now it's up to Hibernia, Midgard and Albion to uncover the magic and power left behind in the ruins. To do so, players must traverse the perilous ocean and confront terrifying monsters, both on land and undersea. [Mythic Entertainment]… Expand"}, {"name": "Monster Truck Madness", "details_link": "https://www.metacritic.com/game/game-boy-advance/monster-truck-madness", "publisher": "THQ", "release_date": "Aug 11 2003", "developers": ["Tantalus"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Driving", "Racing", "Truck"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/2fd774fb5e3a14cfabb79c01f04acd53-98.jpg", "descriptions": "Based on the PC game of the same name, Monster Truck Madness comes to the Game Boy Advance sporting a variety of vehicles and tracks. Now you can get behind the steering wheel of one of 10 monster trucks, each with unique attributes, to compete in different challenges. All 30 tracks featureBased on the PC game of the same name, Monster Truck Madness comes to the Game Boy Advance sporting a variety of vehicles and tracks. Now you can get behind the steering wheel of one of 10 monster trucks, each with unique attributes, to compete in different challenges. All 30 tracks feature destructible objects, such as fences and crates, and an array of power-ups. Play dirty or play fair in three game modes, including Instant Action, Race, and Time Trial.… Expand"}, {"name": "The Lost Vikings", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-lost-vikings", "publisher": "Blizzard Classic Arcade", "release_date": "Mar 30 2003", "developers": ["Mass Media"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/72c2d8027d29b9add473644f86dfabb2-98.jpg", "descriptions": "Before Warcraft... three hairy Norsemen set the stage for a decade of legendary adventure. Meet Erik the Swift, Baleog the Fierce and Olaf the Stout--your typical, borderline insane Vikings who just happen to get abducted by aliens. Now it's up to you to slash, smash and solve their wayBefore Warcraft... three hairy Norsemen set the stage for a decade of legendary adventure. Meet Erik the Swift, Baleog the Fierce and Olaf the Stout--your typical, borderline insane Vikings who just happen to get abducted by aliens. Now it's up to you to slash, smash and solve their way home. Intense arcade action--from the makers of Warcraft®, StarCraft® and Diablo.®… Expand"}, {"name": "Star Wars Jedi Knight II: Jedi Outcast", "details_link": "https://www.metacritic.com/game/gamecube/star-wars-jedi-knight-ii-jedi-outcast", "publisher": "LucasArts", "release_date": "Nov 20 2002", "developers": ["Vicarious Visions"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/ff109fb9a6f9d4bcb41181442fe7b2bd-98.jpg", "descriptions": "In the tradition of Jedi Knight, rebel agent Kyle Katarn returns in thrilling first-person action.  Several years have passed since Kyle avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi.  When a new and menacing threat to the galaxy emerges,In the tradition of Jedi Knight, rebel agent Kyle Katarn returns in thrilling first-person action.  Several years have passed since Kyle avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi.  When a new and menacing threat to the galaxy emerges, Kyle knows he must reclaim his past in order to save his future.  You assume the role of Kyle and employ a unique mix of weapons, Force powers, and your lightsaber in both solo and multiplayer modes.  … Expand"}, {"name": "Aggressive Inline", "details_link": "https://www.metacritic.com/game/game-boy-advance/aggressive-inline", "publisher": "Acclaim", "release_date": "Aug 27 2002", "developers": ["Full-Fat"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skating"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/fcccd94c59446baaeff75b7bc5bdb4c7-98.jpg", "descriptions": "Aggressive Inline pushes your inline skating skills to the limit with a new Juice Meter, challenging objectives, and expansive levels. You can choose from an array of professional inline skaters--including Jaren Grob, Chris Edwards, and Shane Yost--and showcase your talent in variousAggressive Inline pushes your inline skating skills to the limit with a new Juice Meter, challenging objectives, and expansive levels. You can choose from an array of professional inline skaters--including Jaren Grob, Chris Edwards, and Shane Yost--and showcase your talent in various interactive skate parks. Perform a variety of manuals, grinds, big-air tricks, wall flips, hand plants, and more, to build up your Juice Meter and avoid elimination. Aggressive Inline also includes a Park Editor that lets you design your own skate park, complete with rails, ramps, and pipes.… Expand"}, {"name": "Bomberman Max 2: Blue Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/bomberman-max-2-blue-advance", "publisher": "Majesco Games", "release_date": "May 30 2002", "developers": ["Hudson"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/0675ac11509cdc1605ba006801965369-98.jpg", "descriptions": "Bomberman and Max have been shrunk to the size of an ant by the evil Mujie's secret weapon. Work together with max to find and destroy the device before Mujoe can take control of the universe. And so the newest adventures of Bomberman begins!"}, {"name": "Spider-Man: The Movie", "details_link": "https://www.metacritic.com/game/pc/spider-man-the-movie", "publisher": "Activision", "release_date": "Apr 16 2002", "developers": ["Gray Matter"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Shooter", "General", "Beat-'Em-Up", "Open-World", "Third-Person", "2D", "3D", "Fantasy"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/1f3345fdc9d6d79b58710484277526c2-98.jpg", "descriptions": "Assume the role of the super hero himself, weighing great power with great responsibility as he embarks on a career to thwart crime and put an end to a mastermind criminal, the Green Goblin, and his legions of evil. The game features all-new aerial combat and maneuverability, an advancedAssume the role of the super hero himself, weighing great power with great responsibility as he embarks on a career to thwart crime and put an end to a mastermind criminal, the Green Goblin, and his legions of evil. The game features all-new aerial combat and maneuverability, an advanced combat system with dozens of combos, and new super villians including Shocker, Vulture, and experimental HK units compliments of Oscorp Industries.… Expand"}, {"name": "The Typing of the Dead", "details_link": "https://www.metacritic.com/game/pc/the-typing-of-the-dead", "publisher": "Empire Interactive", "release_date": "Sep 23 2001", "developers": ["Sega"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/e0780b76e9fcadd099c708624112c81a-98.jpg", "descriptions": "Run through \"House of the Dead 2,\" but instead of firing a light-gun you type a word that is displayed onscreen in front of the creature attacking you. The faster and more accurately you type the words, the faster you'll kill the zombies and the higher you're score will be.  [Empire Interactive]"}, {"name": "SimCoaster", "details_link": "https://www.metacritic.com/game/pc/simcoaster", "publisher": "EA Games", "release_date": "Jan 29 2001", "developers": ["Bullfrog Productions"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/a0c1250fdec5a8368552e072f3ab03d3-98.jpg", "descriptions": "SimCoaster dismisses the elegant design of its predecessor, and instead favors the often-overwhelming amount of management found in the original Theme Park."}, {"name": "Super Bust-A-Move", "details_link": "https://www.metacritic.com/game/playstation-2/super-bust-a-move", "publisher": "Acclaim", "release_date": "Nov 26 2000", "developers": ["Taito Corporation"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/554fd0b3f1b2c4c7796a268e42cba095-98.jpg", "descriptions": "BUST into a world of bubble-bursting puzzle-popping fun! Unlock secret characters, rescue captives and more. Conveyer belts challenge your Super BAM skills. Mind blowing, puzzle-packed addictive gameplay. Match bubble-berakng wits with a friend in 2 player Battle mode."}, {"name": "Tom Clancy's Rainbow Six: Rogue Spear", "details_link": "https://www.metacritic.com/game/dreamcast/tom-clancys-rainbow-six-rogue-spear", "publisher": "Red Storm Entertainment", "release_date": "Nov 20 2000", "developers": ["Pipe Dream Interactive"], "platforms": "Dreamcast", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/c5d95bbfee2329c320f0899f30ba184b-98.jpg", "descriptions": "Lead the Rainbow team of elite multi-national special operatives against two deadly terrorist organizations. Life or death missions will take you to real world settings across the globe, including a Jumbo Jet airplane and a famous art museum."}, {"name": "Kessen", "details_link": "https://www.metacritic.com/game/playstation-2/kessen", "publisher": "Electronic Arts", "release_date": "Nov 13 2000", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Historic"], "meta_score": 75, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/b80f76a4611a9543b55cfae0668b7b1a-98.jpg", "descriptions": "Japanese history buffs will definitely love this game, and even novice players will appreciate the game, with its stunning visuals and sounds."}, {"name": "Ruiner", "details_link": "https://www.metacritic.com/game/pc/ruiner", "publisher": "Devolver Digital", "release_date": "Sep 26 2017", "developers": ["Reikon Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/9b235269c72c4f1fcd016c7593e30bdc-98.jpg", "descriptions": "RUINER is a brutal action shooter set in the year 2091 in the cyber metropolis Rengkok. A wired sociopath lashes out against a corrupt system to uncover the truth and retrieve his kidnapped brother under the guidance of a secretive hacker friend."}, {"name": "The Sims 2", "details_link": "https://www.metacritic.com/game/playstation-2/the-sims-2", "publisher": "Electronic Arts", "release_date": "Oct 24 2005", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 75, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/3/a1a986235dbe2444a898d2245ca97044-98.jpg", "descriptions": "If the world was a blank canvas, how would you fill it in? Create a cast of characters and tell your own stories in The Sims 2. Create Sims, give them personalities, and directly control every move they make. Then customize their world, building their homes, creating their food, andIf the world was a blank canvas, how would you fill it in? Create a cast of characters and tell your own stories in The Sims 2. Create Sims, give them personalities, and directly control every move they make. Then customize their world, building their homes, creating their food, and designing their fashions. Help them in their careers and aspirations as they build a network of friends and avoid their enemies. Enjoy the peaks of pleasure and the trials of pain in your Sims' lives.  Immerse yourself in a world created, customized, and controlled by you. Develop a master plan for your Sim's social life, career, and pathway to greatness...or live in chaos! Genuine console controls let you directly control every move your Sims make. Create thousands of your own food recipes and clothing designs from items you acquire throughout your Sims' world. Sims now have memories, adding a new dimension to managing your Sims' relationships. Play copperatively with a friend for double the fun with new split-screen 2-player mode. Experience endless possibilities! There's a surprise around every corner ... and in the couch ... and on the toilet. Investigate your Sim's world to find hidden opportunities that can help (or hurt) in achieving your Sim's goals. [Electronic Arts]… Expand"}, {"name": "Call of Duty: Black Ops II - Revolution", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops-ii---revolution", "publisher": "Activision", "release_date": "Jan 29 2013", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Arcade"], "meta_score": 75, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/5bc39226c75ba761a25ba94019395ba5-98.jpg", "descriptions": "The first DLC Map Pack that offers a massive amount of content, including four all-new Multiplayer maps, a new Zombies map, a new Zombies game mode, and -- for the first time in a Call of Duty game -- a brand new Multiplayer weapon."}, {"name": "Get Even", "details_link": "https://www.metacritic.com/game/pc/get-even", "publisher": "Bandai Namco Games", "release_date": "Jun 20 2017", "developers": ["The Farm 51"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/f22a1dbd57a4ea8cdf25ec6d480aa4b2-98.jpg", "descriptions": "Cole Black wakes up in an old, abandoned asylum. He is confused and his sole memory is the attempted rescue of a teenage girl with a bomb strapped to her chest. With a strange technology fused to his head – used to read and replay human memory – Black travels into the depths of his own mindCole Black wakes up in an old, abandoned asylum. He is confused and his sole memory is the attempted rescue of a teenage girl with a bomb strapped to her chest. With a strange technology fused to his head – used to read and replay human memory – Black travels into the depths of his own mind to discover the truth about his past. Every step he takes, leads to the mysterious Red, whose intentions it is difficult to guess. Get Even is a game maintained in convention of a thriller, where action is shown in first-person perspective (FPP). Raising fundamental questions about the understanding of justice and reality. The player discovers the story piece-by-piece through exploration of interactive environments.… Expand"}, {"name": "Culdcept Saga", "details_link": "https://www.metacritic.com/game/xbox-360/culdcept-saga", "publisher": "Namco Bandai Games America", "release_date": "Feb  5 2008", "developers": ["Omiya Soft", "Jamsworks"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/62baa2069375385528b58bd2855698d8-98.jpg", "descriptions": "Culdcept SAGA follows the journey of a princess and unlikely hero trying to bring peace back to their beleaguered country and free the land from the evil tyranny of their vicious adversaries. Summoning beasts of great power and skill, these adventurers will attempt to control strategicCuldcept SAGA follows the journey of a princess and unlikely hero trying to bring peace back to their beleaguered country and free the land from the evil tyranny of their vicious adversaries. Summoning beasts of great power and skill, these adventurers will attempt to control strategic locations on the battlefield until all areas are freed from their enemies' influence. In Culdcept SAGA, individuals known as Cepters move around a game board by the roll of the dice, using magical cards to call upon creatures and cast spells to occupy each area they encounter. Using alluring cards designed by Japan's top illustrators, players can customize different decks to assist in their struggle for territorial dominance. As they maneuver their way around the board and land on occupied properties, opponents can opt to pay a fee for their brief stay or attack the guarding creature to inhabit the zone. Players can fortify their decks and develop strategies in single player mode, then apply those tactics against up to 3 friends on Xbox Live or on a single console. Gamers can further modify the game with their own unique style when they alter their characters' appearances using parts won during matches, providing a distinctive experience for every personality. [Namco Bandai Games]… Expand"}, {"name": "PHOGS!", "details_link": "https://www.metacritic.com/game/pc/phogs!", "publisher": "Coatsink Software", "release_date": "Dec  3 2020", "developers": ["Coatsink Software"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/ab3004ea21e0e199c5a8495fcc9e17ba-98.jpg", "descriptions": "In PHOGS! you play as a duo of dogs on a captivating, puzzle-filled adventure. Linked by a stretchy belly, you’ll need to bark, bite and bounce your way through obstacles set across the themed worlds of Food, Sleep and Play, in co-op or single-player."}, {"name": "Battlezone: Gold Edition", "details_link": "https://www.metacritic.com/game/xbox-one/battlezone-gold-edition", "publisher": "Rebellion", "release_date": "May  1 2018", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Simulation", "Arcade", "Vehicle", "Combat"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/3e716a63f4737c70d8497bcc7302fb37-98.jpg", "descriptions": "The reboot of the 1980s sci-fi tank shooter for a new generation. Battlezone Gold Edition features all additional content ever released for Battlezone, including all tank skins, bobbleheads and horns, as well as the Classic Mode that recreates the look of the arcade original."}, {"name": "Pokemon Picross", "details_link": "https://www.metacritic.com/game/3ds/pokemon-picross", "publisher": "Nintendo", "release_date": "Dec  3 2015", "developers": ["Nintendo", "Jupiter Corporation"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "Puzzle", "Logic"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/bd78f3c4654847d992bd861cfa49aad7-98.jpg", "descriptions": "Turn puzzles into portraits. Pokémon Picross can be downloaded without charge from Nintendo eShop for systems in the Nintendo 3DS family. In Pokémon Picross, solve number puzzles to complete pictures of your favorite Pokémon. When you complete a puzzle, you’ll add that Pokémon to yourTurn puzzles into portraits. Pokémon Picross can be downloaded without charge from Nintendo eShop for systems in the Nintendo 3DS family. In Pokémon Picross, solve number puzzles to complete pictures of your favorite Pokémon. When you complete a puzzle, you’ll add that Pokémon to your collection.… Expand"}, {"name": "Spin the Bottle: Bumpie's Party", "details_link": "https://www.metacritic.com/game/wii-u/spin-the-bottle-bumpies-party", "publisher": "KnapNok Games", "release_date": "Aug  8 2013", "developers": ["Redgrim AB"], "platforms": "Wii U", "num_players": "1-8 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/b8b13bfd2bf1cd81260537db2beb8ded-98.jpg", "descriptions": "Spin the Bottle: Bumpie's Party is a game for 2-8 players where players sit in a circle around a GamePad and spin a virtual bottle."}, {"name": "PlayStation All-Stars Battle Royale", "details_link": "https://www.metacritic.com/game/playstation-vita/playstation-all-stars-battle-royale", "publisher": "SCEA", "release_date": "Nov 20 2012", "developers": ["Bluepoint Games"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/c2949719ff57abdfb4207790cfb96b95-98.jpg", "descriptions": "PlayStation All-Stars Battle Royale is a four-player brawler pitting a vast array of Sony and third-party game characters against each other.  Take the fight online or mix it up with your friends in your living room."}, {"name": "Iron Brigade", "details_link": "https://www.metacritic.com/game/pc/iron-brigade", "publisher": "Microsoft Game Studios", "release_date": "Aug 13 2012", "developers": ["Double Fine Productions"], "platforms": ["Xbox 360", "Xbox 360", "PC"], "genres": ["Action", "Strategy", "Shooter", "Real-Time", "General", "Third-Person", "Defense", "Sci-Fi"], "meta_score": 75, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/663b66f9a3753418f3472fd643b75974-98.jpg", "descriptions": "Iron Brigade is a third-person shooter in which players pilot and control giant weaponized mechs to defend against robotic enemies."}, {"name": "Naruto: Ultimate Ninja Storm", "details_link": "https://www.metacritic.com/game/playstation-3/naruto-ultimate-ninja-storm", "publisher": "Namco Bandai Games", "release_date": "Nov  4 2008", "developers": ["CyberConnect2"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/a0f201db98cd3d3c4a1d09008d8c605c-98.jpg", "descriptions": "Evolving the head-to-head fighting action of the Ultimate Ninja series, NARUTO: Ultimate Ninja STORM allows players to battle in full 3D across massive environments. Players unleash powerful jutsu attacks, perform acrobatic evasive maneuvers and even run up walls and over water as theyEvolving the head-to-head fighting action of the Ultimate Ninja series, NARUTO: Ultimate Ninja STORM allows players to battle in full 3D across massive environments. Players unleash powerful jutsu attacks, perform acrobatic evasive maneuvers and even run up walls and over water as they pursue their opponent for ninja supremacy. Players customize their character's fighting style and recruit up to two support characters to put their own stamp on the action. Each character in the game is capable of unleashing powerful Awakening abilities under certain gameplay conditions, offering new traits and talents to the game's ninja roster of 25 popular characters from the animated series. NARUTO: Ultimate Ninja STORM supports head-to-head multiplayer fighting for up to two players. Allowing players to further immerse themselves in the world of NARUTO, NARUTO: Ultimate Ninja STORM introduces all-new free-roaming exploration across the Hidden Leaf Village and the Forest of Death. Players can search every inch of these iconic environments to take on more than 100 unique missions, collect valuable scrolls and interact with additional characters from the NARUTO animated series. Injecting additional variety to the game's head-to head combat, these missions include races, special deliveries and large-scale battles against massive opponents. [Namco Bandai Games]… Expand"}, {"name": "I Am Setsuna", "details_link": "https://www.metacritic.com/game/switch/i-am-setsuna", "publisher": "Square Enix", "release_date": "Mar  3 2017", "developers": ["Tokyo RPG Factory"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/b3e59ca90be3f550023ea6356fce3803-98.jpg", "descriptions": "This is the story of Setsuna; a young woman of incredible inner strength and the sacrifice she must make to save the people of her land.\r The Island had a custom.\r\nTo maintain peace, once a decade, a sacrifice was offered to a fiend on the island.\r\n\r\nHowever, one year, the fiend grewThis is the story of Setsuna; a young woman of incredible inner strength and the sacrifice she must make to save the people of her land.\r The Island had a custom.\rTo maintain peace, once a decade, a sacrifice was offered to a fiend on the island.\r However, one year, the fiend grew violent before the next sacrifice was due.\rThose living on the island were afraid and tried to calm the fiend by offering a sacrifice; Setsuna, chosen because of her powers of enchantment.\r Setsuna must leave with her safeguards for the farthest land, where the ceremony of sacrifice will be held.\r Key Features:\r *   A great homage to JRPG masterpieces of yesteryear, using the latest technology to develop a truly memorable story and player experience and bring the authentic JRPG style to current hardware.\r*    A new battle system inspired by the timeless JRPG classic, Chrono Trigger.\r*   An emotionally impactful and memorable story which immerses players in the narrative of Setsuna, whose story portrays heartrending sorrow.\r*   Beautiful character designs and varied in-game locales evoke nostalgia for classic RPGs.… Expand"}, {"name": "Alice: Madness Returns", "details_link": "https://www.metacritic.com/game/pc/alice-madness-returns", "publisher": "Electronic Arts", "release_date": "Jun 14 2011", "developers": ["Spicy Horse"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Adventure", "General", "Horror", "Horror", "Survival"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/0c04d078cc6b3fa146a9888b91a2a9cf-98.jpg", "descriptions": "American McGee's Alice returns, with his own brand of creepy supernatural Victoriana."}, {"name": "Concrete Genie", "details_link": "https://www.metacritic.com/game/playstation-4/concrete-genie", "publisher": "Pixel Opus", "release_date": "Oct  8 2019", "developers": ["Pixel Opus"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/d657aab82977aca217c9e919f4ba5870-98.jpg", "descriptions": "Life is tough for young Ash -- isolated and bullied, it's only in the discovery that he can bring his paintings to life that things become so much... brighter. And with the small fishing town of Denska now polluted and abandoned, only Ash has the power to cleanse the streets and alleywaysLife is tough for young Ash -- isolated and bullied, it's only in the discovery that he can bring his paintings to life that things become so much... brighter. And with the small fishing town of Denska now polluted and abandoned, only Ash has the power to cleanse the streets and alleyways with beautiful, living artwork.Use the Dualshock 4 wireless controller's motion sensor function to effortlessly paint stunning landscapes and bring unique creatures to life in this colourful and gorgeous action adventure -- and help bring a little light not only to Ash's life, but a whole town in the process.… Expand"}, {"name": "Hitman - Intro Pack", "details_link": "https://www.metacritic.com/game/pc/hitman---intro-pack", "publisher": "Square Enix", "release_date": "Mar 11 2016", "developers": ["Io Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/3/a5d53600682f60c4035dbf29e9835a14-98.jpg", "descriptions": "With the Intro Pack, you'll get an introduction to the world of HITMAN, with the Prologue and Paris episode. You'll get full access to Contracts Mode, Escalation Mode, elusive targets and all other live content."}, {"name": "Not a Hero", "details_link": "https://www.metacritic.com/game/pc/not-a-hero", "publisher": "Devolver Digital", "release_date": "May 14 2015", "developers": ["roll7"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Shooter", "2D", "Shoot-'Em-Up", "Horizontal"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/21109e71036796687bf77529de84d445-98.jpg", "descriptions": "Professional assassin turned amateur campaign manager Steve has been tasked with cleaning up his city by an anthropomorphic rabbit and mayoral candidate from the future named BunnyLord."}, {"name": "Afterparty", "details_link": "https://www.metacritic.com/game/pc/afterparty", "publisher": "Night School Studio", "release_date": "Oct 29 2019", "developers": ["Night School Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/f756a0f712e202c14d6ef2fb060f65fa-98.jpg", "descriptions": "In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you.In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you. Time to go on the best bender ever, uncover the mystery of why you’ve been damned, and drink the big guy under the table. [Night School]… Expand"}, {"name": "LEGO Rock Band", "details_link": "https://www.metacritic.com/game/playstation-3/lego-rock-band", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  3 2009", "developers": ["TT Fusion"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/3405e476c43cfccb3cd75d8491a5015d-98.jpg", "descriptions": "The game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed withThe game, which allows families, tweens and teens to experience a wild journey to rock stardom where they can \"Build a Band and Rock the Universe,\" combines the multiplayer music experience of Rock Band with the fun, customization and humor of the LEGO videogame franchise packed with brilliant chart-topping songs and classic favorites suitable for younger audiences, including: Blur's \"Song 2\", Carl Douglas's \"Kung Fu Fighting\", Europe's \"The Final Countdown\", Good Charlotte's \"Boys and Girls\", and Pink's \"So What.\" Players become rockers as they embark on a journey to stardom that the whole family can enjoy as they work their way through local venues, stadiums and fantasy locations on Earth and beyond that mimic the imaginative settings that the LEGO world offers. Also continuing the LEGO \"build-and-play\" gaming experience, players are able to create their own LEGO Rock Band style as they customize their minifigure avatars, band and entourage, including roadies, managers and crew. LEGO Rock Band supports Rock Band instruments, as well as other music game controllers. [Warner Bros.]… Expand"}, {"name": "Bloodroots", "details_link": "https://www.metacritic.com/game/switch/bloodroots", "publisher": "Paper Cult", "release_date": "Feb 28 2020", "developers": ["Paper Cult"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/076dc315c0925c1e96890cddc970c503-98.jpg", "descriptions": "Betrayed and left for dead, Mr. Wolf is hell-bent on finding his killer and enacting revenge - alone, and vastly outnumbered. Thankfully for Mr. Wolf, the world is your weapon in Bloodroots - a relentless action game that unfolds across the sprawling Weird West. You’ll choreographBetrayed and left for dead, Mr. Wolf is hell-bent on finding his killer and enacting revenge - alone, and vastly outnumbered. Thankfully for Mr. Wolf, the world is your weapon in Bloodroots - a relentless action game that unfolds across the sprawling Weird West. You’ll choreograph spectacular, ultra-violent combos by making use of everything around you, from hatchets, to ladders, to...carrots? It’s improvise or die, as Mr. Wolf fights his way to the center of the mystery: why was he betrayed?… Expand"}, {"name": "Persona Dancing: Endless Night Collection", "details_link": "https://www.metacritic.com/game/playstation-4/persona-dancing-endless-night-collection", "publisher": "Atlus", "release_date": "Dec  4 2018", "developers": ["Atlus"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/6b9c825e46a6e54c0f3285a527afae5f-98.jpg", "descriptions": "Jam out to all your favorite Persona music with both Persona 3: Dancing in Moonlight and Persona 5: Dancing in Starlight in an exclusive collector's box featuring character art by Shigenori Soejima."}, {"name": "Valentino Rossi The Game", "details_link": "https://www.metacritic.com/game/playstation-4/valentino-rossi-the-game", "publisher": "Milestone", "release_date": "Jun 17 2016", "developers": ["Milestone", "Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/e432810a03b8671ad3197591bb810b4b-98.jpg", "descriptions": "A videogame entirely dedicated to the career of Valentino Rossi, the 9 time World Champion. Experience the career of Valentino from his perspective in a series of 20 challenges from his first race in 1996 up to 2015. Jump into a new career starting at the VR|46 Academy and taking you up toA videogame entirely dedicated to the career of Valentino Rossi, the 9 time World Champion. Experience the career of Valentino from his perspective in a series of 20 challenges from his first race in 1996 up to 2015. Jump into a new career starting at the VR|46 Academy and taking you up to World Champion. During the championship, Valentino will ask you to take part in different events like drifting, flat, R1M-only races, and rally in order to improve his abilities. … Expand"}, {"name": "GRID Autosport", "details_link": "https://www.metacritic.com/game/playstation-3/grid-autosport", "publisher": "Codemasters", "release_date": "Jun 24 2014", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/f2eeb4dea389248fd50a4ba323a1422b-98.jpg", "descriptions": "It’s all about the teams, the rivals and the race as you become a driver for hire, specialising in your favourite disciplines or conquering them all in an intense world of professional motorsport. GRID Autosport features over 100 routes across 22 incredible locations, the return of in-carIt’s all about the teams, the rivals and the race as you become a driver for hire, specialising in your favourite disciplines or conquering them all in an intense world of professional motorsport. GRID Autosport features over 100 routes across 22 incredible locations, the return of in-car view, authentic handling and the world’s most exciting contemporary and classic high-performance racing cars.﻿… Expand"}, {"name": "Star Trek: Bridge Crew", "details_link": "https://www.metacritic.com/game/playstation-4/star-trek-bridge-crew", "publisher": "Ubisoft", "release_date": "May 30 2017", "developers": ["Ubisoft", "Red Storm Entertainment"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/d0035473bcb240d788df328215d500f9-98.jpg", "descriptions": "Developed specifically for VR, Star Trek: Bridge Crew is the only game to offer a true-to-life level of immersion in the Star Trek universe, where- as officers of the Federation- every action and decision you make together will determine the fate of your ship and crew."}, {"name": "The Sims 2", "details_link": "https://www.metacritic.com/game/xbox/the-sims-2", "publisher": "Electronic Arts", "release_date": "Oct 24 2005", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/ab5bcbbafb5c8c559e7c0784704fac1c-98.jpg", "descriptions": "In The Sims 2, you can control your Sims over an entire lifetime for the first time. With the addition of genetics, the game lets your Sims pass their DNA down through generations. Every life choice you make has a relevant and dramatic effect on the lifetime of your Sim. Now it's up to youIn The Sims 2, you can control your Sims over an entire lifetime for the first time. With the addition of genetics, the game lets your Sims pass their DNA down through generations. Every life choice you make has a relevant and dramatic effect on the lifetime of your Sim. Now it's up to you to take your Sims from the cradle to the grave, while fulfilling their dreams and pushing them to extremes.… Expand"}, {"name": "Attack on Titan 2", "details_link": "https://www.metacritic.com/game/playstation-4/attack-on-titan-2", "publisher": "Koei Tecmo Games", "release_date": "Mar 20 2018", "developers": ["Omega Force"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "General"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/594bf73312ac0192f53d390a73c0068b-98.jpg", "descriptions": "Based on the anime series and building on the fast-paced action the series is famous for, ATTACK ON TITAN 2 is the sequel to 2016's action game and features new gameplay mechanics. Players once again don the renowned Omni-Directional Manoeuver Gear as they fight and repel the fearsome TitansBased on the anime series and building on the fast-paced action the series is famous for, ATTACK ON TITAN 2 is the sequel to 2016's action game and features new gameplay mechanics. Players once again don the renowned Omni-Directional Manoeuver Gear as they fight and repel the fearsome Titans that threaten humanity, to restore peace within the walls. … Expand"}, {"name": "Scarface: The World Is Yours", "details_link": "https://www.metacritic.com/game/playstation-2/scarface-the-world-is-yours", "publisher": "Vivendi Games", "release_date": "Oct  8 2006", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 75, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/457afc0fefe7dfcc1a7a97a9ba23437c-98.jpg", "descriptions": "In a complex world filled with excess and greed, players can take the role of Tony Montana, one of the most ruthless gangsters ever depicted on film. Highly acclaimed screenwriter, David McKenna, has written an original event-driven storyline for the interactive game that leads the playerIn a complex world filled with excess and greed, players can take the role of Tony Montana, one of the most ruthless gangsters ever depicted on film. Highly acclaimed screenwriter, David McKenna, has written an original event-driven storyline for the interactive game that leads the player through a sordid underworld. The Scarface video game creates a gameplay environment that authentically recreates the historical time period of the film, touching on politics, news items and events of the day. Players travel through the steamy, often violent streets of Miami, the irie islands of the Florida Keys, the Bahamas and various other locales and interact with a world full of seedy and dangerous characters to procure information, negotiate business deals, smuggle contraband and avoid rivals and DEA on a mission to rebuild their fallen empire. [Vivendi Universal]… Expand"}, {"name": "Zombieland: Headshot Fever Reloaded", "details_link": "https://www.metacritic.com/game/playstation-5/zombieland-headshot-fever-reloaded", "publisher": "XR Games", "release_date": "Feb 22 2023", "developers": ["XR Games"], "platforms": "PlayStation 5", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/125800aef11e274c9ff798ca47f0b9ec-98.jpg", "descriptions": "Zombieland: Headshot Fever is a modern take on the classic arcade light gun shooter, built from the ground up for VR, and rebuilt for PlayStation®VR2. Join the Zombieland crew as you take on zombie hordes against the clock. Headshot combos slow down time, meaning the most precise shooter isZombieland: Headshot Fever is a modern take on the classic arcade light gun shooter, built from the ground up for VR, and rebuilt for PlayStation®VR2. Join the Zombieland crew as you take on zombie hordes against the clock. Headshot combos slow down time, meaning the most precise shooter is the fastest. Challenge the leaderboards with skill, speed, and accuracy.\r - Zombieland: Headshot Fever Reloaded is the ultimate version of the hit VR game, rebuilt to take advantage of PlayStation®5 and PlayStation®VR2.\r- Experience Zombieland: Headshot Fever as never before, with 4K 90fps gameplay, headset rumble, and controller haptics, making you feel every oncoming zombie and every bullet fired.\r- Zombieland: Headshot Fever Reloaded on PlayStation®VR2 benefits from a brand new cel-shaded art style, new character models, new animations, new lighting, ragdoll physics, new music, completely re-designed progression system, a new game hub and so much more.\r- Zombieland: Headshot Fever Reloaded on PlayStation®VR2 also includes a whole host of brand new gameplay content, including a new story level, three new remix levels, new Gun Range challenges, new guns, new perks, new gun skins and more.\r- Zombieland: Headshot Fever Reloaded also includes Arcade Mode: a roguelite game mode that asks players to compete for the best run across five levels. Spend earned currency in between levels to purchase special upgrades, perks and guns, or will you exchange one of your three lives for extra time?… Expand"}, {"name": "Cyberpunk 2077", "details_link": "https://www.metacritic.com/game/playstation-5/cyberpunk-2077", "publisher": "CD Projekt Red Studio", "release_date": "Feb 15 2022", "developers": ["CD Projekt Red Studio"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/cc28aabf3ae28001c6bd8e5c909dd8d4-98.jpg", "descriptions": "Night City, California. Year 2077. The world is broken. MegaCorps manage every aspect of life from the top floors of their sky-scraping fortresses. Down below, the streets are run by drug pushing gangs, tech hustlers, and illegal braindance slingers. The in-between is where decadence, sexNight City, California. Year 2077. The world is broken. MegaCorps manage every aspect of life from the top floors of their sky-scraping fortresses. Down below, the streets are run by drug pushing gangs, tech hustlers, and illegal braindance slingers. The in-between is where decadence, sex and pop culture mix with violent crime, extreme poverty and the unattainable promise of the American Dream. \r\rYou are V, a cyberpunk. In a world of cyberenhanced street warriors, tech-savvy netrunners and corporate life-hackers, today is your first step to becoming an urban legend...\r Cyberpunk 2077 is an ambitious RPG for mature audience, set in the corrupt and tech-advanced world of the year 2077 and is being developed by CD Projekt RED in association with the Cyberpunk Pen & Paper system author, Mike Pondsmith.… Expand"}, {"name": "Voice of Cards: The Isle Dragon Roars", "details_link": "https://www.metacritic.com/game/playstation-4/voice-of-cards-the-isle-dragon-roars", "publisher": "Square Enix", "release_date": "Oct 28 2021", "developers": ["A-lim"], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/17dce47bc8e7f6d236cb0aa03bfea92b-98.jpg", "descriptions": "Open your mind and let the story unfold. Voice of Cards: The Isle Dragon Roars is an RPG set in a world of swords and sorcery, told entirely through the medium of cards.\rThe story follows a self proclaimed hero as they set off to slay a recently awakened dragon, presented in the manner of aOpen your mind and let the story unfold. Voice of Cards: The Isle Dragon Roars is an RPG set in a world of swords and sorcery, told entirely through the medium of cards.\rThe story follows a self proclaimed hero as they set off to slay a recently awakened dragon, presented in the manner of a tabletop RPG and playing out through narration from the gamesmaster.\rEnjoy an all new, yet appealingly nostalgic gaming experience from YOKO TARO (Creative Director), Keiichi Okabe (Music), Kimihiko Fujisaka (Character Design.)\r *This product is also included in other bundles sold separately. Please take care not to re-purchase the same content.\r* Please be aware that parts of the game which require an internet connection may cease to be supported at any point.\r… Expand"}, {"name": "Ministry of Broadcast", "details_link": "https://www.metacritic.com/game/switch/ministry-of-broadcast", "publisher": "PM Studios Inc.", "release_date": "Apr 30 2020", "developers": ["Homeless Unicorn", "Ministry of Broadcast Studios"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/ebcecda95cebaebff314c520faad325e-98.jpg", "descriptions": "Inspired by games such as Prince of Persia (1989) and Oddworld: Abe’s Exoddus, Ministry of Broadcast revives the spirit of classic cinematic platformers where players need nimble run-and-jump reflexes as well as a healthy aversion to falling from precarious heights."}, {"name": "Ghost of a Tale", "details_link": "https://www.metacritic.com/game/pc/ghost-of-a-tale", "publisher": "Ghost of a Tale", "release_date": "Mar 13 2018", "developers": ["Ghost of a Tale", "SeithCG"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/40c18272bdb20de29f0e03827876494d-98.jpg", "descriptions": "Ghost of a Tale is an action-RPG game in which you assume the role of Tilo, a mouse and minstrel thrown into a perilous adventure. Through stealth and cunning you’ll be able to explore the secrets of Dwindling Heights Keep and navigate its dangers."}, {"name": "Tokyo Xanadu eX+", "details_link": "https://www.metacritic.com/game/playstation-4/tokyo-xanadu-ex+", "publisher": "Aksys Games", "release_date": "Dec  8 2017", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/2128a8b2bd629680c86402d49578a059-98.jpg", "descriptions": "Tokyo Xanadu eX+ a massive action RPG. When high school student Kou Tokisaka encounters the nightmare realm known as the Eclipse, his world is forever changed."}, {"name": "Table Top Racing: World Tour", "details_link": "https://www.metacritic.com/game/xbox-one/table-top-racing-world-tour", "publisher": "Playrise Digital", "release_date": "Mar 10 2017", "developers": ["Playrise Digital"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 75, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/60c5ec8583aaed9f63ceaf4a97d1634b-98.jpg", "descriptions": "Get behind the wheel of 12 ultra-cool, fully tune-able miniaturized racing cars and take on 20 race tracks and some devious opponents through a comprehensive 'Championship Mode' and a multitude of 'Special Events'. Get online for an 8 player multi-player battle and become the ultimateGet behind the wheel of 12 ultra-cool, fully tune-able miniaturized racing cars and take on 20 race tracks and some devious opponents through a comprehensive 'Championship Mode' and a multitude of 'Special Events'. Get online for an 8 player multi-player battle and become the ultimate Table Top racer! Crush your enemies using cunning 'Power-ups' and unique 'Wheel Weapons' and blast your way to victory! Miniaturized, combat racing has never looked so good or been so much fun.… Expand"}, {"name": "Transformers: Devastation", "details_link": "https://www.metacritic.com/game/xbox-one/transformers-devastation", "publisher": "Activision", "release_date": "Oct  6 2015", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/05663845c20baa22328a50e0954a67bc-98.jpg", "descriptions": "PlatinumGames' fast-paced action allows instant robot to vehicle attacks, slam downs, counterattacks, and infinite combos for a unique and customizable combat system."}, {"name": "Cloudberry Kingdom", "details_link": "https://www.metacritic.com/game/wii-u/cloudberry-kingdom", "publisher": "Ubisoft", "release_date": "Aug  1 2013", "developers": ["Pwnee Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/e51ac59e100aa04c830de109fbd4b1cb-98.jpg", "descriptions": "Cloudberry Kingdom has players jump and dodge their way through billions of levels on a last ditch mission to conquer infinity."}, {"name": "And Yet It Moves", "details_link": "https://www.metacritic.com/game/pc/and-yet-it-moves", "publisher": "Broken Rules", "release_date": "Apr  2 2009", "developers": ["Broken Rules"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 75, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/dec5749a33c85c622088366338a43c6d-98.jpg", "descriptions": "And Yet It Moves is a puzzle-platformer, set in a unique world, made of ripped paper. Within the paper collage, you can jump, run and last but certainly not least: rotate the world. Learn how to apply the physical consequences of rotation to master the many tricky situations you mayAnd Yet It Moves is a puzzle-platformer, set in a unique world, made of ripped paper. Within the paper collage, you can jump, run and last but certainly not least: rotate the world. Learn how to apply the physical consequences of rotation to master the many tricky situations you may encounter. You can play a race against the clock on different levels, too, competing against previous clocked times. Your run will be recorded, as a »Ghost« which can be submitted, along with your time, to the global high scores online. You can download other users' Ghosts to compete with friends and strangers around the world and see who found the fastest route. Following the acclaim of the previously awarded prototype for And Yet It Moves, we present the full version, containing three exciting and beautiful environments and lots of new challenges. [Broken Rules]… Expand"}, {"name": "Top Spin 3", "details_link": "https://www.metacritic.com/game/playstation-3/top-spin-3", "publisher": "2K Sports", "release_date": "Jun 23 2008", "developers": ["Pam Development"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/f115c3099ad2b9d21b7c35b40ba1a57e-98.jpg", "descriptions": "Top Spin 3 immerses players in a visually and physically realistic tennis experience. Using next generation technology, gameplay and graphics, Top Spin 3 is a tennis experience with dynamic weather changes, evolutionary player visuals and comprehensive online offerings. In Top Spin 3,Top Spin 3 immerses players in a visually and physically realistic tennis experience. Using next generation technology, gameplay and graphics, Top Spin 3 is a tennis experience with dynamic weather changes, evolutionary player visuals and comprehensive online offerings. In Top Spin 3, players compete online and offline to rise in the ranks against current top ranked professional players. Adding a unique user-generated component, players can also use new player creator features that include free-form body sculpting, makeup and tattoos. [2K Sports]… Expand"}, {"name": "Fenix Rage", "details_link": "https://www.metacritic.com/game/pc/fenix-rage", "publisher": "Reverb Triple XP", "release_date": "Sep 24 2014", "developers": ["Green Lava Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/994bd165c1614a509bb9184cd4dd83a8-98.jpg", "descriptions": "Fenix Rage is a stylish 2D platformer that will have gamers exclaim in frustration and exult in victory as they navigate through hundreds of palm-sweating levels to reach a cookie?! Best played with patience and a glass of milk."}, {"name": "Uplink: Hacker Elite", "details_link": "https://www.metacritic.com/game/pc/uplink-hacker-elite", "publisher": "Strategy First", "release_date": "Oct  9 2001", "developers": ["Introversion"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "Third-Person", "Virtual", "Sci-Fi", "Sci-Fi", "Career"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/870ea87c56bf5291955e78c8933524ad-98.jpg", "descriptions": "High tech computer crime and industrial espionage on the Internet of 2010. You play an Uplink Agent who makes a living by performing jobs for major corporations. Your tasks involve hacking into rival computer systems, stealing research data, sabotaging other companies, laundering money,High tech computer crime and industrial espionage on the Internet of 2010. You play an Uplink Agent who makes a living by performing jobs for major corporations. Your tasks involve hacking into rival computer systems, stealing research data, sabotaging other companies, laundering money, erasing evidence, or framing innocent people. You use the money you earn to upgrade your computer systems, and to buy new software and tools. As your experience level increases you find more dangerous and profitable missions become available. You can speculate on a fully working stock market (and even influence its outcome). You can modify peoples academic or criminal records. You can divert money from bank transfers into your own accounts. You can even take part in the construction of the most deadly computer virus ever designed. [Introversion]… Expand"}, {"name": "Another World", "details_link": "https://www.metacritic.com/game/switch/another-world", "publisher": "DotEmu", "release_date": "Jul  9 2018", "developers": ["The Digital Lounge"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/e36a30f9726fdd37cf6c58f38d5393f2-98.jpg", "descriptions": "Also known as Out Of This World, Another World is a pioneer action/platformer that released across more than a dozen platforms since its debut in 1991. Along the years, Another World has attained cult status among critics and sophisticated gamers alike.\r Another World chronicles the storyAlso known as Out Of This World, Another World is a pioneer action/platformer that released across more than a dozen platforms since its debut in 1991. Along the years, Another World has attained cult status among critics and sophisticated gamers alike.\r Another World chronicles the story of Lester Knight Chaykin a young scientist hurtled through space and time by a nuclear experiment that goes wrong. In an alien and inhospitable world, you will have to dodge, outwit, and overcome the host of alien monsters, while surviving an environment as deadly as your enemies. Only a perfect blend of logic and skill will get you past the deadly obstacles that lie in wait.… Expand"}, {"name": "Sakura Wars: So Long, My Love", "details_link": "https://www.metacritic.com/game/wii/sakura-wars-so-long-my-love", "publisher": "NIS America", "release_date": "Mar 30 2010", "developers": ["Idea Factory"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/1dabc93ce4b6a61b60d77cb3918d742d-98.jpg", "descriptions": "Sakura Wars: So Long, My Love combines the epic battles of an RPG with the character interaction and development of a sim game in the free-roaming environment of 1920s New York City. Pilot mechs, perform in plays, and experience action and adventure in this Steampunk Extravaganza."}, {"name": "Quake 4", "details_link": "https://www.metacritic.com/game/xbox-360/quake-4", "publisher": "Activision", "release_date": "Nov 18 2005", "developers": ["Raven Software"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/5358a0ffdfc853cc9b0352f89cf9e20e-98.jpg", "descriptions": "Quake 4 is the first game to utilize id Software's revolutionary DOOM 3 technology.  In the game, you are Matthew Kane, an elite member of Rhino Squad and Earth's valiant invasion force.  Fight alone, with your squad, and in hover tanks and mechanized walkers as you engage in a heroicQuake 4 is the first game to utilize id Software's revolutionary DOOM 3 technology.  In the game, you are Matthew Kane, an elite member of Rhino Squad and Earth's valiant invasion force.  Fight alone, with your squad, and in hover tanks and mechanized walkers as you engage in a heroic mission into the heart of the Strogg war machine.  But, in this epic war between worlds, the only way to defeat the Strogg is to become one of them.  Battle through early missions as a deadly marine, then after your capture as a marine-turned-Strogg with enhanced abilities and the power to turn the tide of the war. [Activision]… Expand"}, {"name": "Crash Bandicoot 2: N-Tranced", "details_link": "https://www.metacritic.com/game/game-boy-advance/crash-bandicoot-2-n-tranced", "publisher": "Universal Interactive", "release_date": "Jan  7 2003", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/adfaebc09fdec9bfd271ef9b0b50802d-98.jpg", "descriptions": "Crash is back and ready to take on an all-new nefarious villain.  After the events of Crash Bandicoot: The Huge Adventure, Tropy, with the help of N. Trance, kidnaps Coco and Crunch, planning to brainwash them to the evil side.  Now, Crash must travel to N. Trance's twisted realm, battle andCrash is back and ready to take on an all-new nefarious villain.  After the events of Crash Bandicoot: The Huge Adventure, Tropy, with the help of N. Trance, kidnaps Coco and Crunch, planning to brainwash them to the evil side.  Now, Crash must travel to N. Trance's twisted realm, battle and rescue Coco and Crunch, and ultimately defeat N. Trance and N. Tropy.  To achieve these goals, you must use all of Crash's spin, slide, and jumping abilities across 24 different levels.  As you progress through the game, you'll find yourself flying a helicopter, water-skiing, and piloting a spaceship--all for the sake of saving your friends.… Expand"}, {"name": "Dead Head Fred", "details_link": "https://www.metacritic.com/game/psp/dead-head-fred", "publisher": "D3Publisher", "release_date": "Aug 28 2007", "developers": ["Vicious Cycle"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/e0c251c35a03fabbad1ac7b0896aedd6-98.jpg", "descriptions": "Dead Head Fred draws players into an original alternative universe as they embark on a quest for vengeance to solve their own murder by using the decapitated heads of enemies to battle through environments designed to showcase each head's unique abilities. In Dead Head Fred, players take onDead Head Fred draws players into an original alternative universe as they embark on a quest for vengeance to solve their own murder by using the decapitated heads of enemies to battle through environments designed to showcase each head's unique abilities. In Dead Head Fred, players take on the persona of private detective Fred Neuman. Savagely murdered and then resurrected in a bizarre scientific experiment, Fred is without his memory or his head! The game immerses players in the action with the most revolutionary camera to date on a handheld device as they collect, upgrade and switch heads on the fly to strategically fight malformed mutants, ghoulish gangsters, and maniacal mob bosses in a unique and compelling story of revenge and redemption. [D3Publisher of America]… Expand"}, {"name": "DiRT Showdown", "details_link": "https://www.metacritic.com/game/xbox-360/dirt-showdown", "publisher": "Codemasters", "release_date": "Jun 12 2012", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Rally / Offroad", "Driving", "Racing", "Simulation", "Rally / Offroad", "Automobile"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/80a75597d3be1de44a592804f01d1d6d-98.jpg", "descriptions": "Dirt Showdown is an arcade spin-off of the Dirt series featuring over-the-top Hoonigan, Demolition, and Race events."}]