[{"name": "Ninja Gaiden: Master Collection", "details_link": "https://www.metacritic.com/game/xbox-one/ninja-gaiden-master-collection", "publisher": "Koei Tecmo Games", "release_date": "Jun 10 2021", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/f71811b2eb67df9812ace47c3d572761-98.jpg", "descriptions": "Three extremely high speed and intense ninja action games are now available in one package. Enjoy 3 games from the NINJA GAIDEN series in this single collection.  The nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battles withThree extremely high speed and intense ninja action games are now available in one package. Enjoy 3 games from the NINJA GAIDEN series in this single collection.  The nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battles with fearsome opponents. In addition to Ryu Hayabusa, the 4 female characters Ayane, Rachel, Momiji, and Kasumi are also playable. Pair up favorite characters, and switch between characters during battles. The heroines included in this title are the same as the original versions. In addition, the characters that are playable and scenes (modes) vary for each title.\r Most of the previously released game modes and DLC costumes for each title are included in this thrilling collection. In addition to Ryu Hayabusa, each of the other characters also have many different costumes to choose from, allowing for action packed battles in outfits of your choice.\r Included Titles:\r * NINJA GAIDEN Sigma (NINJA GAIDEN )\r* NINJA GAIDEN Sigma 2 (NINJA GAIDEN 2)\r* NINJA GAIDEN 3: Razor's Edge\rClassic Costumes Included\r DLC costumes included… Expand"}, {"name": "Ancestors: The Humankind Odyssey", "details_link": "https://www.metacritic.com/game/xbox-one/ancestors-the-humankind-odyssey", "publisher": "Panache Digital Games", "release_date": "Dec  6 2019", "developers": ["Panache Digital Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 72, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/84320791617e20461b352df09c9b9e4c-98.jpg", "descriptions": "Ancestors: The Humankind Odyssey is a third-person open world survival game from independent studio Panache Digital Games and published by Private Division. From Creative Director Patrice Désilets, experience the beauty and danger of Africa 10 million years ago as your hominid clan mustAncestors: The Humankind Odyssey is a third-person open world survival game from independent studio Panache Digital Games and published by Private Division. From Creative Director Patrice Désilets, experience the beauty and danger of Africa 10 million years ago as your hominid clan must Explore, Expand, and Evolve to survive over the course of 8 million years. Write your own unique story of human evolution and see if you can survive like our ancestors before us.… Expand"}, {"name": "The Golf Club 2019 featuring PGA Tour", "details_link": "https://www.metacritic.com/game/pc/the-golf-club-2019-featuring-pga-tour", "publisher": "HB Studios Multimedia", "release_date": "Aug 28 2018", "developers": ["HB Studios Multimedia"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Golf", "Sim"], "meta_score": 72, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/44d51df639e901cf7029b3953c558047-98.jpg", "descriptions": "Do you have what it takes to win PGA TOUR’s FedExCup? Compete in the all new officially licensed PGA TOUR Career mode. Play on famous courses like TPC Boston, TPC Sawgrass and more."}, {"name": "Skylanders Imaginators", "details_link": "https://www.metacritic.com/game/switch/skylanders-imaginators", "publisher": "Activision", "release_date": "Mar  3 2017", "developers": ["Toys for Bob"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "Switch"], "genres": ["Action", "Platformer", "3D"], "meta_score": 72, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/6dd3050fe99e702ac2ce5110304c3299-98.jpg", "descriptions": "Use the power of your imagination to create Imaginator Skylanders to battle in the ultimate adventure alongside the almighty Senseis to save Skylands."}, {"name": "Big Pharma", "details_link": "https://www.metacritic.com/game/pc/big-pharma", "publisher": "Positech Games", "release_date": "Aug 27 2015", "developers": ["Twice Circled"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/0c5d8af202a60bd9fcb85ad707f7c96f-98.jpg", "descriptions": "What if you had it in your power to rid the world of disease, to improve the lives of millions, to ease suffering and cure the sick… and earn a tidy profit? As the head of your own Pharmaceutical Conglomerate you have this power resting in your hands. Will you use it for good?"}, {"name": "Let It Die", "details_link": "https://www.metacritic.com/game/playstation-4/let-it-die", "publisher": "GungHo", "release_date": "Dec  3 2016", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/dee2c40c798a43c809c86f01f2663715-98.jpg", "descriptions": "In the year 2026 AD, a large tectonic disturbance occurred causing mass destruction around the world. South Western Tokyo split off into the ocean and became an island covered by a deep fog. Continuous seismic activity then caused a large spire to rise out of the ocean through the islandIn the year 2026 AD, a large tectonic disturbance occurred causing mass destruction around the world. South Western Tokyo split off into the ocean and became an island covered by a deep fog. Continuous seismic activity then caused a large spire to rise out of the ocean through the island creating a tower-like structure that pierces the clouds. Many mysteries remain hidden from the eyes of mankind await those courageous enough to dare approach the tower…\r… Expand"}, {"name": "FlatOut", "details_link": "https://www.metacritic.com/game/pc/flatout", "publisher": "Empire Interactive", "release_date": "Jul 12 2005", "developers": ["Bugbear"], "platforms": ["PlayStation 2", "PC"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Demolition Derby", "Arcade", "Demolition Derby", "Automobile"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/d0b1a8a7aaf7bcde85c0012042b79d99-98.jpg", "descriptions": "Experience the drive of your life as you throw yourself around 45 challenging tracks in one of 16 fully upgradeable cars. Fences will shatter, tyre walls will explode, water tanks and barrels will fly across the track into other cars. Every time you lose control, you will truly feel theExperience the drive of your life as you throw yourself around 45 challenging tracks in one of 16 fully upgradeable cars. Fences will shatter, tyre walls will explode, water tanks and barrels will fly across the track into other cars. Every time you lose control, you will truly feel the weight of the car as it collides with and destroys a barn, or smashes into the pack of cars ahead of you, and with 40 deformable pieces on every car sparks are guaranteed to fly! Anything you destroy or alter stays a part of the race, increasing the carnage to unprecedented levels! Broken fences, free rolling tyres, and even mangled parts of cars are left scattered around the track, increasing the mayhem with every lap. An extensive championship mode will keep you 'FlatOut' for months on end, as you battle through a huge variety of races, mini-games and the most outrageous arenas of destruction you could possibly imagine. Unparalleled realistic scenery and debris damage with fully destructible driving environments with 3000 + items on each track to smash. [Empire Interactive]… Expand"}, {"name": "State of Decay: Year One Survival Edition", "details_link": "https://www.metacritic.com/game/xbox-one/state-of-decay-year-one-survival-edition", "publisher": "Microsoft Game Studios", "release_date": "Apr 28 2015", "developers": ["Undead Labs"], "platforms": ["PC", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/36e33ce2e17c7a15d27e25aec58bf982-98.jpg", "descriptions": "How will you survive the zombie apocalypse? State of Decay: Year-One Survival Edition brings the zombie survival-fantasy franchise to Xbox One. State of Decay, along with major Add-Ons Breakdown and Lifeline, is now fully remastered in 1080p. New missions, weapons, and extra content, alongHow will you survive the zombie apocalypse? State of Decay: Year-One Survival Edition brings the zombie survival-fantasy franchise to Xbox One. State of Decay, along with major Add-Ons Breakdown and Lifeline, is now fully remastered in 1080p. New missions, weapons, and extra content, along with improved lighting, textures, animations, and combat mechanics, will pull you even deeper into the post-outbreak world. How will you survive the zombie apocalypse? Purchase the Day One Edition and get the exclusive Preppers Pack.… Expand"}, {"name": "Kingdoms of Amalur: Re-Reckoning", "details_link": "https://www.metacritic.com/game/playstation-4/kingdoms-of-amalur-re-reckoning", "publisher": "THQ Nordic", "release_date": "Sep  8 2020", "developers": ["Kaiko"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/e8c843e206132b2ed0cbd36d930614ea-98.jpg", "descriptions": "The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, spawn creator Todd mcfarlane, and Elder Scrolls IV: oblivion lead designer Ken rolston, comes kingdoms of amalur: re-reckoning. Remastered with stunning visuals and refined gameplay re-reckoning delivers intense,The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, spawn creator Todd mcfarlane, and Elder Scrolls IV: oblivion lead designer Ken rolston, comes kingdoms of amalur: re-reckoning. Remastered with stunning visuals and refined gameplay re-reckoning delivers intense, customizable RPG combat inside a sprawling game world. Uncover the secrets of amalur, from the vibrant city of rathir to the vast region of dalentarth to the grim dungeons of the brigand Hall caverns. Rescue a world torn apart by a vicious war and control the keys to immortality as the first Warrior ever to be resurrected from the grips of death. \r\r* Build the ideal character for the most intense combat, choosing from a countless combinations of skills, abilities, weapons and pieces of armor\r* The revolutionary destiny system allows you to continuously evolve your character class to your style of play\r* Seamlessly Integrate magical and melee attacks as you take on scores of enemies in grand fight sequences and finish them Off with brutal fate shift kills\r* Extend your experience in amalur with all DLC from the original release, from teeth of naros to Legend of Dead kel and more!\r* Hundreds of hours of RPG play await! Travel from the vibrant city of rathir, to the vast region of dalentarth, and the grim dungeons of the brigand Hall caverns as you uncover the secrets of amalur!… Expand"}, {"name": "Beyond Blue", "details_link": "https://www.metacritic.com/game/pc/beyond-blue", "publisher": "E-Line Media", "release_date": "Jun 11 2020", "developers": ["E-Line Media"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "Adventure", "3D", "Third-Person"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/ae7fb5c62c581dae5e1b6fcb78eb63ed-98.jpg", "descriptions": "Beyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact withBeyond Blue takes players into the near future, where they will have the opportunity to explore the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. She and her newly-formed research team will use groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than has ever been attempted. The game features an evocative narrative and exploration of an untouched world. Embracing the same inclusive development process that was used to create Never Alone (Kisima Ingitchuna), E-Line’s BAFTA award-winning game about Alaska Native culture, the company partnered with BBC Studios (developers of the acclaimed Blue Planet II), OceanX Media, world-class game makers, and some of science’s leading ocean experts to craft an experience that reflects the awesome wonder and unbounded mystery that infuses our planet’s beating blue heart.… Expand"}, {"name": "WWE 2K16", "details_link": "https://www.metacritic.com/game/xbox-one/wwe-2k16", "publisher": "2K Sports", "release_date": "Oct 27 2015", "developers": ["Yuke's"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "General", "Individual", "Combat", "Wrestling"], "meta_score": 72, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/10d055e2efc23b03cfa5b2a23548a846-98.jpg", "descriptions": "Offering more than 120 unique playable characters, including cover Superstar Stone Cold Steve Austin alongside Seth Rollins, Daniel Bryan, Dean Ambrose, Bad News Barrett, Paige and Finn Bálor, WWE 2K16 includes the largest roster in WWE games history. The roster contains a combination ofOffering more than 120 unique playable characters, including cover Superstar Stone Cold Steve Austin alongside Seth Rollins, Daniel Bryan, Dean Ambrose, Bad News Barrett, Paige and Finn Bálor, WWE 2K16 includes the largest roster in WWE games history. The roster contains a combination of current WWE Superstars and Divas, emerging NXT talent, WWE Hall of Famers and WWE alumni from multiple eras.… Expand"}, {"name": "NHL 07", "details_link": "https://www.metacritic.com/game/pc/nhl-07", "publisher": "EA Sports", "release_date": "Sep 12 2006", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 72, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/a5ef782ab77161619144daec2a5e57ba-98.jpg", "descriptions": "The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro.The golden age of console hockey returns with NHL 07, featuring gameplay innovations that make players feel like they are actually on the ice. Featuring an unmatched level of freedom and control, NHL 07 allows hockey purists and casual fans alike to feel like they can play like a pro. [Electronic Arts]… Expand"}, {"name": "Puzzle Quest: Galactrix", "details_link": "https://www.metacritic.com/game/pc/puzzle-quest-galactrix", "publisher": "D3Publisher", "release_date": "Feb 24 2009", "developers": ["Infinite Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/266b1e0cdee79a0c8c1bc99a43fca8fc-98.jpg", "descriptions": "Enjoy a new board, new weapons, new tactics and more in this incredibly addictive puzzle gameboard battle. Collect a fleet of customizable spaceships, which endow your player with new skills and abilities, and fight in over 150 battles. Save the galaxy in your custom-made fleet of starships.Enjoy a new board, new weapons, new tactics and more in this incredibly addictive puzzle gameboard battle. Collect a fleet of customizable spaceships, which endow your player with new skills and abilities, and fight in over 150 battles. Save the galaxy in your custom-made fleet of starships. Manipulate the puzzle gems in zero gravity on an all-new hexagonal puzzle board. Battle across the galaxy in multiplayer wars and compete for rankings in online leaderboards. Short, easy pick-up and play battles, with incredible depth and RPG-style character building. [Aspyr Media]… Expand"}, {"name": "Total Overdose: A Gunslinger's Tale in Mexico", "details_link": "https://www.metacritic.com/game/pc/total-overdose-a-gunslingers-tale-in-mexico", "publisher": "Eidos Interactive", "release_date": "Sep 27 2005", "developers": ["Deadline Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/9dcb5499099c2174604cdf1f06cf0496-98.jpg", "descriptions": "1989: Deep in the heart of the Mexican jungle, undercover agent Ernesto Cruz blasts his way through an armed militia to board a DEA plane bound for home. He never made it, the victim of an alleged 'overdose'. Present Day: After uncovering new evidence, Ernesto's son, Ramiro is set free from1989: Deep in the heart of the Mexican jungle, undercover agent Ernesto Cruz blasts his way through an armed militia to board a DEA plane bound for home. He never made it, the victim of an alleged 'overdose'. Present Day: After uncovering new evidence, Ernesto's son, Ramiro is set free from jail to join his twin brother Tommy, on the trail of their father’s killer as they go on a super-cool, tequila fuelled rampage through Mexico’s gun-toting, drug-pushing underworld. Features: A Rich storyline taking the player through 18 different environments, from the seedy red light district of Los Toros, to the depths of the Mexican desert. A free-style combat and stunt system to take down your enemy with more outrageous moves than you can shake a hot chilli at. Cutting edge soundtrack featuring Molotov, Delinquent Habits, Control Machete. [SCi Games]… Expand"}, {"name": "Resonance of Fate", "details_link": "https://www.metacritic.com/game/playstation-3/resonance-of-fate", "publisher": "Sega", "release_date": "Mar 16 2010", "developers": ["Tri-Ace"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/d6c587f7db34e579fc4761fcc5250668-98.jpg", "descriptions": "In Resonance of Fate, players control members of a private military contracting firm in a world where most of Earth has been rendered uninhabitable. The only remaining pockets of civilization surround the tower of Basel, an experimental air purifier with a mind of its own. The game carries aIn Resonance of Fate, players control members of a private military contracting firm in a world where most of Earth has been rendered uninhabitable. The only remaining pockets of civilization surround the tower of Basel, an experimental air purifier with a mind of its own. The game carries a steampunk aesthetic, with the ordinary RPG trappings of swords and sorcery traded in for guns and acrobatic attacks.… Expand"}, {"name": "Phoenix Point: Behemoth Edition", "details_link": "https://www.metacritic.com/game/playstation-4/phoenix-point-behemoth-edition", "publisher": "Deep Silver", "release_date": "Oct  1 2021", "developers": ["Snapshot Games Inc."], "platforms": ["Xbox One", "Xbox Series X", "Xbox Series X", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/e997de2486c2b6b9aa9d0fc560773c37-98.jpg", "descriptions": "Phoenix Point delivers a new breed of turn-based strategy and action. Earth has been overrun. A mutating alien menace threatens the last remnants of mankind. Only the Phoenix Project, a secret organization of the greatest minds and bravest soldiers left, can fight back and save the world.Phoenix Point delivers a new breed of turn-based strategy and action. Earth has been overrun. A mutating alien menace threatens the last remnants of mankind. Only the Phoenix Project, a secret organization of the greatest minds and bravest soldiers left, can fight back and save the world. It’s up to you to lead Earth’s resistance: explore a ravaged planet, build your bases, research and develop new techniques and technologies, manage resources on a global scale, and fight in full-scale, turn-based tactical battles to survive. But you won't be alone. Work together with different factions to unite mankind and take back the planet via Phoenix Point's diplomacy system, or crush all your rivals with military might. No matter what you choose, you’re in for a brutal challenge with endless replayability.… Expand"}, {"name": "PixelJunk Monsters 2", "details_link": "https://www.metacritic.com/game/playstation-4/pixeljunk-monsters-2", "publisher": "Spike Chunsoft", "release_date": "May 18 2018", "developers": ["Spike Chunsoft", "Q-Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/6a177f1022686353d55f51bb1e3cf5fc-98.jpg", "descriptions": "Get ready to experience the next generation of real-time tower defense gameplay in the PixelJunk Monsters series."}, {"name": "Assassin's Creed: The Ezio Collection", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-the-ezio-collection", "publisher": "Ubisoft", "release_date": "Nov 15 2016", "developers": ["Ubisoft Montreal"], "platforms": ["Switch", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/e64abf487632f2c19868e26baa9524e4-98.jpg", "descriptions": "Make history as the legendary Master Assassin, Ezio Auditore da Firenze, in Assassin's Creed: The Ezio Collection, which includes the acclaimed single-player campaigns and single-player add-on content from Assassin's Creed II, Assassin's Creed: Brotherhood, and Assassin's Creed: RevelationsMake history as the legendary Master Assassin, Ezio Auditore da Firenze, in Assassin's Creed: The Ezio Collection, which includes the acclaimed single-player campaigns and single-player add-on content from Assassin's Creed II, Assassin's Creed: Brotherhood, and Assassin's Creed: Revelations with enhanced graphics for Xbox One and PlayStation4 system.\r Live the life of Ezio and learn the ways of the Assassin as he seeks vengeance for the betrayal of his family. Travel through 15th-century Renaissance Italy, including the capital Rome and finally onto 16th-century Constantinople.\r Assassin's Creed II - Ezio's saga begins as you fight and explore through the open world of the Italian Renaissance in an era of arts, riches, and murderous conspiracy.\r Assassin's Creed: Brotherhood - Journey into Italy's greatest city, Rome. The centre of power, greed, and corruption, as Ezio takes leadership of an entire Brotherhood of Assassins.\r Assassin's Creed: Revelations - Two Assassins, one destiny. Embark on Ezio's final adventure as he walks in the footsteps of his great mentor, Altair, on a journey of discovery and revelation in 16th-century Constantinople and the heart of the Ottoman Empire.… Expand"}, {"name": "Wild Earth: Photo Safari", "details_link": "https://www.metacritic.com/game/pc/wild-earth-photo-safari", "publisher": "Ubisoft", "release_date": "May  2 2006", "developers": ["Super X Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "First-Person", "Edutainment", "Modern"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/1bbe3fc20fc234089ff9cc85e4bb4791-98.jpg", "descriptions": "(Also known as \"Wild Earth Africa\")  Featuring breathtaking landscapes from the African Serengeti National Park, Wild Earth is an adventure which allows players to experience the African wildlife in its natural environment. Players embark on various assignments, each of which feature(Also known as \"Wild Earth Africa\")  Featuring breathtaking landscapes from the African Serengeti National Park, Wild Earth is an adventure which allows players to experience the African wildlife in its natural environment. Players embark on various assignments, each of which feature different photographic objectives, challenging the player to explore the lush 3D world and take the best photographs of animals and environmental features. At the end of each assignment, an html article is created using the player's own photographs which provides additional in-depth information and insight. These articles can be printed, saved or shared. [Digital Jesters]… Expand"}, {"name": "rain", "details_link": "https://www.metacritic.com/game/playstation-3/rain", "publisher": "SCEA", "release_date": "Oct  1 2013", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Fantasy", "General", "General", "Fantasy", "Linear"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/59caa6322bf69f806f9791bfcb659333-98.jpg", "descriptions": "Developed by PlayStation C.A.M.P!, the creative minds behind TOKYO JUNGLE and Echochrome rain is developed exclusively for the PlayStation 3 computer entertainment system as a digital download through the PlayStation Network. rain is the enchanting tale of a boy who chases after a girl withDeveloped by PlayStation C.A.M.P!, the creative minds behind TOKYO JUNGLE and Echochrome rain is developed exclusively for the PlayStation 3 computer entertainment system as a digital download through the PlayStation Network. rain is the enchanting tale of a boy who chases after a girl with an invisible silhouette. After discovering that the girl is being hunted by ghostly creatures, he embarks on his own journey into the mysterious world of rain to save her. Upon entering the world he discovers that he has also become invisible and he must learn to navigate through the unknown, using the rain to guide and protect him.… Expand"}, {"name": "Call of Juarez", "details_link": "https://www.metacritic.com/game/pc/call-of-juarez", "publisher": "Ubisoft", "release_date": "Jun 12 2007", "developers": ["Techland"], "platforms": ["Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/f8e46e63e388e54edaa459e60b0b262f-98.jpg", "descriptions": "Call of Juarez is a unique first-person shooter set in the classic Wild West. Call of Juarez features classic gunslinging action including duels, shootouts and barroom brawls. Players relive the days of the Wild West in numerous settings including local saloons and brothels. In theCall of Juarez is a unique first-person shooter set in the classic Wild West. Call of Juarez features classic gunslinging action including duels, shootouts and barroom brawls. Players relive the days of the Wild West in numerous settings including local saloons and brothels. In the single-player campaign, players enter the world of two opposing characters equipped with contrasting weapons and styles. Ray is the retired gunslinger turned rough-and-tumble preacher. Billy, a sneaky and elusive man befriended and trained by Native Americans, is on the run. Authentic Western situations chronicle the cat-and-mouse game played by Ray and Billy. Players are forced to make split-second decisions to escape the grasp of Ray or get their hands on Billy, and outwit secondary characters throughout this Western setting. Call of Juarez leverages Techland's Chrome game engine which allows players to use objects found in the world as weapons or tools to solve problems. Graphics, artificial intelligence and multiplayer features will immerse players in the Wild West like never before. [Ubisoft]… Expand"}, {"name": "Guild of Dungeoneering", "details_link": "https://www.metacritic.com/game/pc/guild-of-dungeoneering", "publisher": "Versus Evil", "release_date": "Jul 14 2015", "developers": ["Gambrinous"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 72, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/5857ea34c6389026cc8255114886b273-98.jpg", "descriptions": "Guild of Dungeoneering is a turn-based dungeon crawler with a twist: instead of controlling the hero you're tasked with building the dungeon around him. Using cards drawn from your Guild decks you lay down rooms, monsters, traps and of course loot."}, {"name": "NiGHTS into Dreams...", "details_link": "https://www.metacritic.com/game/xbox-360/nights-into-dreams", "publisher": "Sega", "release_date": "Oct  5 2012", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/b9de109de46c22e327631c491aa1465d-98.jpg", "descriptions": "The Sega Saturn 3D classic returns with HD graphics, trophies, leaderboards, and an optional original Saturn mode."}, {"name": "Ray Gigant", "details_link": "https://www.metacritic.com/game/playstation-vita/ray-gigant", "publisher": "Bandai Namco Games", "release_date": "May  3 2016", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation Vita"], "genres": ["Role-Playing", "General"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/64e92ad01426a2d914fed5a05b4f3d97-98.jpg", "descriptions": "This adventure is set in the not-too-distant future... Earth’s major cities have been ravaged by giant, terrifying creatures known as Gigants. Across the globe,  military forces from every nation attempted to counter the attacks but, to their horror, failed miserably. In a twist of fate, itThis adventure is set in the not-too-distant future... Earth’s major cities have been ravaged by giant, terrifying creatures known as Gigants. Across the globe,  military forces from every nation attempted to counter the attacks but, to their horror, failed miserably. In a twist of fate, it was reported that a boy named Ichiya Amakaze defeated a Gigant. The boy defeated the Gigants using a mysterious power called the Yorigami. This victory was short-lived, however. Ichiya lost control of his power and tragically destroyed the city he tried so hard to protect. After this fateful experience, he fell unconscious. Ichiya was then detained and sent to a safe location where his fate would soon unfold...… Expand"}, {"name": "Max: The Curse of Brotherhood", "details_link": "https://www.metacritic.com/game/xbox-one/max-the-curse-of-brotherhood", "publisher": "Microsoft Game Studios", "release_date": "Dec 20 2013", "developers": ["Press Play"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "genres": ["Fantasy", "Action Adventure", "General", "Fantasy"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/83cc8805f66e53b40fc6ab8db9022c45-98.jpg", "descriptions": "When Max wishes for his annoying little brother, Felix, to be whisked away by unknown evil forces, he gets more than he bargained for. Armed only with a marker and a hope of undoing what he has just done, he sets out on a perilous journey across deserts, eerie lantern-lit bogs, ancientWhen Max wishes for his annoying little brother, Felix, to be whisked away by unknown evil forces, he gets more than he bargained for. Armed only with a marker and a hope of undoing what he has just done, he sets out on a perilous journey across deserts, eerie lantern-lit bogs, ancient temples and lush green forests to get his younger sibling back. Along the way Max gains the power to manipulate his environment and overcome seemingly impossible obstacles.… Expand"}, {"name": "Rock of Ages 3: Make & Break", "details_link": "https://www.metacritic.com/game/pc/rock-of-ages-3-make-break", "publisher": "Modus Games", "release_date": "Jul 21 2020", "developers": ["ACE Team"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "General", "Defense"], "meta_score": 72, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/37c53f7bf7960f87b3836b92894ed378-98.jpg", "descriptions": "Competitive tower defense meets arcade action and gets rolled up with ACE Team's quirky, Monty Python-esque humor into one giant, creative game for the ages. This time around, you can even make your own levels."}, {"name": "Late Shift", "details_link": "https://www.metacritic.com/game/xbox-one/late-shift", "publisher": "Wales Interactive", "release_date": "Apr 18 2017", "developers": ["Wales Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/70cf2f24f366eb16c2155a9d90448526-98.jpg", "descriptions": "Late Shift is a high stakes FMV crime thriller. Forced into a brutal London heist, you must choose your own adventure in this interactive cinematic experience with adaptable storylines that lead to one of seven conclusions. Your decisions are you."}, {"name": "Tom Clancy's Rainbow Six: Lockdown", "details_link": "https://www.metacritic.com/game/gamecube/tom-clancys-rainbow-six-lockdown", "publisher": "Ubisoft", "release_date": "Sep 27 2005", "developers": ["Red Storm Entertainment", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/0ff3660916750a1fdf7e67c48d27a84d-98.jpg", "descriptions": "The next installment in the Rainbow Six series introduces a new single-player experience featuring advanced equipment and new storylines. This time, you can play as either Ding Chavez (the leader of Team Rainbow) or Dieter Weber (a sniper in charge of covering his team's movement). You mustThe next installment in the Rainbow Six series introduces a new single-player experience featuring advanced equipment and new storylines. This time, you can play as either Ding Chavez (the leader of Team Rainbow) or Dieter Weber (a sniper in charge of covering his team's movement). You must lead your counterterrorist unit into unfamiliar territory to battle a bioterrorist threat. Rainbow Six 3 also features online multiplayer modes, including the PS2-exclusive rivalry mode and the Xbox-exclusive career mode.… Expand"}, {"name": "Shaman King: Master of Spirits 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/shaman-king-master-of-spirits-2", "publisher": "Konami", "release_date": "Aug  2 2005", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/2354c85e763f2310f9e5b1859a058596-98.jpg", "descriptions": "This anime-inspired role-playing game will allow you to command the spirits of vanquished opponents in subsequent battles."}, {"name": "Dragon Ball: Xenoverse 2", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-ball-xenoverse-2", "publisher": "Bandai Namco Games", "release_date": "Oct 25 2016", "developers": ["Dimps Corporation"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/037da903d4485b85cb24f970c5aa4fa4-98.jpg", "descriptions": "DRAGON BALL XENOVERSE 2 builds upon the DRAGON BALL XENOVERSE with enhanced graphics that will further immerse players into the largest and most detailed Dragon Ball world ever developed.\r DRAGON BALL XENOVERSE 2 delivers a new hub city and the most character customization choices to dateDRAGON BALL XENOVERSE 2 builds upon the DRAGON BALL XENOVERSE with enhanced graphics that will further immerse players into the largest and most detailed Dragon Ball world ever developed.\r DRAGON BALL XENOVERSE 2 delivers a new hub city and the most character customization choices to date among a multitude of new features and special upgrades.\r *    Relive the Dragon Ball story by time traveling and protecting historic moments in the Dragon Ball universe\r*    Brand new hub city more than 7X the size of the original game with 300 players online at the same time\r*    Next-gen visuals bring the Dragon Ball anime experience to life\r*    New characters and boss fights\r*    More in depth character creation system and battle adjustments\r*    Free updates and post launch support for more than a year… Expand"}, {"name": "Attack on Titan 2", "details_link": "https://www.metacritic.com/game/switch/attack-on-titan-2", "publisher": "Koei Tecmo Games", "release_date": "Mar 20 2018", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "General"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/ed5101243c6b8a11fbabf65cb2d9f052-98.jpg", "descriptions": "Attack on Titan 2 is the sequel to the action game based on the worldwide hit anime series \"Attack on Titan.\" Experience the story of the anime alongside Eren and his companions, as they fight to save humanity from the threat of the deadly human devouring Titans. Try your hand in operatingAttack on Titan 2 is the sequel to the action game based on the worldwide hit anime series \"Attack on Titan.\" Experience the story of the anime alongside Eren and his companions, as they fight to save humanity from the threat of the deadly human devouring Titans. Try your hand in operating the omni-directional mobility gear, maneuvering and flying through the sky to counter the Titans, and feel the thrill and satisfaction of battling giant opponents.… Expand"}, {"name": "The Incredible Adventures of Van Helsing", "details_link": "https://www.metacritic.com/game/pc/the-incredible-adventures-of-van-helsing", "publisher": "NeocoreGames", "release_date": "May 22 2013", "developers": ["NeocoreGames"], "platforms": ["Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/44c2486764ace237ae6352479f70d8e3-98.jpg", "descriptions": "Set in a gothic-noir universe resembling a fantastical 19th century Europe filled with monsters, magic, and weird technology, The Incredible Adventures of Van Helsing will follow the son of the famed hunter, known in-game as Van Helsing, in a tale wrought with wry humor and snappy dialogue.Set in a gothic-noir universe resembling a fantastical 19th century Europe filled with monsters, magic, and weird technology, The Incredible Adventures of Van Helsing will follow the son of the famed hunter, known in-game as Van Helsing, in a tale wrought with wry humor and snappy dialogue. Van Helsing, a larger-than-life hero possessing a dark yet romantic charm, will follow his path to the dismal land of Borgovia where former supernatural foes have enlisted his help to defeat a new scourge terrorizing the ravaged Eastern European city. With an assortment of extraordinary characters, an engrossing storyline, and a beautifully dark and gothic art style, The Incredible Adventures of Van Helsing looks to bring RPG enthusiasts an anachronistic adventure like no other.… Expand"}, {"name": "DiRT Showdown", "details_link": "https://www.metacritic.com/game/pc/dirt-showdown", "publisher": "Codemasters", "release_date": "May 23 2012", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 72, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/2e1b7f86a08a084b6700b794be25f35a-98.jpg", "descriptions": "DiRT Showdown is an arcade spin-off of the Dirt series featuring over-the-top Hoonigan, Demolition, and Race events."}, {"name": "Dragon Ball Z: Budokai Tenkaichi 3", "details_link": "https://www.metacritic.com/game/wii/dragon-ball-z-budokai-tenkaichi-3", "publisher": "Atari", "release_date": "Dec  3 2007", "developers": ["Spike", "Namco Bandai Games"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/c57c4d40feb5dbded9ed178286874571-98.jpg", "descriptions": "Dragon Ball Z: Budokai Tenkaichi 3 delivers an extreme 3D fighting experience, improving upon last year's game with over 150 playable characters, enhanced fighting techniques, beautifully refined effects and shading techniques, making each character's effects more realistic, and over 20Dragon Ball Z: Budokai Tenkaichi 3 delivers an extreme 3D fighting experience, improving upon last year's game with over 150 playable characters, enhanced fighting techniques, beautifully refined effects and shading techniques, making each character's effects more realistic, and over 20 battle stages. In addition, an improved control system for the Wii will allow players to easily mimic signature moves and execute devastating energy attacks as they are performed in the Dragon Ball Z animated series. In addition to the unprecedented number of characters and improved Wii control system, the environments have also been enhanced to feature day and night stages. The power of the moon in the night stages gives players additional ways to transform their characters and lets fans recreate some of their favorite memories from the show. [Atari]… Expand"}, {"name": "Superdimension Neptune VS Sega Hard Girls", "details_link": "https://www.metacritic.com/game/playstation-vita/superdimension-neptune-vs-sega-hard-girls", "publisher": "Idea Factory", "release_date": "Oct 18 2016", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation Vita"], "genres": ["Action", "General", "Role-Playing", "Japanese-Style"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/b8ed61c04b59375a94e4a3061dee0fc0-98.jpg", "descriptions": "Our story begins in the mysterious halls of an ancient library...\r The Grand Library holds the history of the world within its shelves. Legend says that if one was to tamper with the books kept there, the past itself could be completely rewritten... A daring adventurer known as IFOur story begins in the mysterious halls of an ancient library...\r The Grand Library holds the history of the world within its shelves. Legend says that if one was to tamper with the books kept there, the past itself could be completely rewritten... A daring adventurer known as IF discovered the location of this revered library and finally crossed its threshold. Little did she know, a disaster of historical proportions was about to occur before her very eyes. Books began to vanish from the library's shelves; the history of the world was disappearing before her and the reasons for this occurrence were shrouded in mystery.\r IF sets out on a journey across time to uncover the truth! Will she be able to work together with both the Sega Hard Girls and Goddesses to recover the lost history? Will they really be able to save the world?… Expand"}, {"name": "FIFA 21", "details_link": "https://www.metacritic.com/game/playstation-4/fifa-21", "publisher": "Electronic Arts", "release_date": "Oct  6 2020", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 72, "users_score": 0.9, "image": "https://static.metacritic.com/images/products/games/1/f3e048a48985c3523f2ebc6c7263e972-98.jpg", "descriptions": "On the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new AgileOn the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new Agile Dribbling system gives you the means to unleash your creativity in 1-on-1 situations. Use fast footwork, more responsive close control, and new skill moves like the ball roll fake to explode past defenders. In FIFA 21, increased positional awareness elevates footballers’ in-game intelligence to put them in the right place at the right time. See world-class forwards hold their runs in line with the last defender, creative playmakers find space to play through balls, and midfielders shut off passing lanes as players better live up to their real-world understanding of space and time on the pitch. [Electronic Arts]… Expand"}, {"name": "Jotun: Valhalla Edition", "details_link": "https://www.metacritic.com/game/playstation-4/jotun-valhalla-edition", "publisher": "Thunder Lotus Games", "release_date": "Sep  9 2016", "developers": ["Thunder Lotus Games"], "platforms": ["PC", "Stadia", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/08d348cda73c07bc2ebc7c8ff6eb5608-98.jpg", "descriptions": "In Jotun, you play Thora, a Norse warrior who has died an inglorious death and must face the challenges of Viking purgatory to prove herself to the Gods and enter Valhalla."}, {"name": "Gotham City Impostors", "details_link": "https://www.metacritic.com/game/playstation-3/gotham-city-impostors", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  7 2012", "developers": ["Monolith Productions"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Adventure", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Fantasy", "Arcade"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/dec3f6ff71333bd8bf795bf43bd93518-98.jpg", "descriptions": "Gotham City Impostors is a multiplayer game unlike any other, giving players the opportunity to rebel against conformity as they customize their own characters.  Posing as amateur vigilantes or villains, gamers will create their very own Bats and Jokerz characters using unprecedentedGotham City Impostors is a multiplayer game unlike any other, giving players the opportunity to rebel against conformity as they customize their own characters.  Posing as amateur vigilantes or villains, gamers will create their very own Bats and Jokerz characters using unprecedented customization options including insane costumes, homebrewed gadgets and a wide range of traditional and imagined weapons.… Expand"}, {"name": "Blazing Angels 2: Secret Missions of WWII", "details_link": "https://www.metacritic.com/game/pc/blazing-angels-2-secret-missions-of-wwii", "publisher": "Ubisoft", "release_date": "Sep 21 2007", "developers": ["Ubisoft Romania"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 72, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/151c99fb26b12bcad1dc0c8a16699864-98.jpg", "descriptions": "Blazing Angels 2: Secret Missions shows World War II from a different perspective – that of an elite pilot who is part of a secret team. In the game, the player undertakes some of the most dangerous missions in exotic locations all over the globe. As an elite pilot, the player goes from oneBlazing Angels 2: Secret Missions shows World War II from a different perspective – that of an elite pilot who is part of a secret team. In the game, the player undertakes some of the most dangerous missions in exotic locations all over the globe. As an elite pilot, the player goes from one great adventure to another, while battling the most lethal experimental weapons of the Third Reich. The squad's mission is to prevent the ultimate weapon from being built. To help players in this quest, they have at their disposal an assortment of highly experimental aircraft and weaponry. Secret Missions comes straight out of the history books of World War II's most top secret projects. Fly above hills and mountains, navigate through treacherous mountain passes and dogfight in the clouds with enemies. Take part in large-scale battles through various conditions: darkness, rain, snow, and air turbulence. Secret Missions takes players around the world, from Paris, Rome and Moscow to exotic locations like Rangoon and Cairo and the highest mountain ranges of the Himalayas. Each mission brings its own surprises, twists and unique challenges. Players have access to some of the most advanced and unusual aircraft and weapons of WWII, as well as access to a huge assortment of weapons, including high-velocity cannons and early guided missiles. Multiplayer features free-for-all, co-op and squad-based play, including the brand new Capture the Flag and Epic Battle modes, the latter pitting two teams of players against each other in a large-scale battle with conquerable bases and objectives that can be destroyed in order to gain the upper hand on the opponent. [Ubisoft]… Expand"}, {"name": "Planet Alpha", "details_link": "https://www.metacritic.com/game/pc/planet-alpha", "publisher": "Team17", "release_date": "Sep  4 2018", "developers": ["Adrian Lazar"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/bbbeed3a41cebee7357c3af6a2167c06-98.jpg", "descriptions": "PLANET ALPHA, a beautiful alien world filled with mystery and danger. Pursued by relentless enemies, you must harness the power of night and day as you struggle to survive."}, {"name": "Dungeon Siege III", "details_link": "https://www.metacritic.com/game/xbox-360/dungeon-siege-iii", "publisher": "Square Enix", "release_date": "Jun 21 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "General", "Action RPG"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/2136203eb09bbe169603956ffdfc95de-98.jpg", "descriptions": "DUNGEON SIEGE 3 seamlessly blends intuitive action gameplay, a robust RPG system featuring a large selection of abilities, an extensive multiplayer component and the depth of story Square Enix and Obsidian Entertainment are known for creating."}, {"name": "Alone With You", "details_link": "https://www.metacritic.com/game/playstation-4/alone-with-you", "publisher": "Benjamin Rivers", "release_date": "Aug 23 2016", "developers": ["Benjamin Rivers"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 72, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/2833a5bf2a388ecab0bd89247c9ccf5f-98.jpg", "descriptions": "Assume the role of the last survivor of a doomed space colony, trying to repair your ship and escape a planet before it implodes around you. Spend your days searching for clues and parts you need with your troubled AI companion, and your nights in the colony’s holo-sim chamber, experiencingAssume the role of the last survivor of a doomed space colony, trying to repair your ship and escape a planet before it implodes around you. Spend your days searching for clues and parts you need with your troubled AI companion, and your nights in the colony’s holo-sim chamber, experiencing some surprising, story-defining relationships. [Playstation.com]… Expand"}, {"name": "UEFA Champions League 2006-2007", "details_link": "https://www.metacritic.com/game/playstation-2/uefa-champions-league-2006-2007", "publisher": "EA Games", "release_date": "Mar 20 2007", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Soccer", "Management"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/c9698ddac4328825cde290f1bfd5fb93-98.jpg", "descriptions": "Feel the weight of history as you walk out to a deafening roar and onto the biggest stage in club football. In the cauldron-like atmosphere of a stadium alive with the dreams of thousands and heaving with the pressure of expectation, kick off alongside the most formidably talentedFeel the weight of history as you walk out to a deafening roar and onto the biggest stage in club football. In the cauldron-like atmosphere of a stadium alive with the dreams of thousands and heaving with the pressure of expectation, kick off alongside the most formidably talented footballers in Europe – and outplay them. Here is the ultimate test. Here history is made. Write yourself into legend with the only official UEFA Champions League 2006-2007 videogame. Test your management credentials with over 400 objectives to accomplish across all game modes. Take your pick from an array of gameplay options, including The Treble, where you have just one season in your bid to score European football's dream hat-trick. Thanks to a fluid, pacy movement system, players can now release more incisive defence-splitting one-twos, first touches and through passes. With five challenging game modes to test your managerial skill at the top level, it's down to you to write yourself into UEFA Champions League history. [Electronic Arts]… Expand"}, {"name": "SOCOM: U.S. Navy SEALs Tactical Strike", "details_link": "https://www.metacritic.com/game/psp/socom-us-navy-seals-tactical-strike", "publisher": "SCEA", "release_date": "Nov  6 2007", "developers": ["Slant Six"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/1aaf1f1baf93043a9804c4ef58da3ec2-98.jpg", "descriptions": "In the midst of rising instability, insurgents have abducted the U.S. ambassador. Sanctioned by the Panamanian government, America's elite fighting force has been deployed to rescue and extract the ambassador. Take control of an entire SEAL team and engage in real-time tactical combat, whereIn the midst of rising instability, insurgents have abducted the U.S. ambassador. Sanctioned by the Panamanian government, America's elite fighting force has been deployed to rescue and extract the ambassador. Take control of an entire SEAL team and engage in real-time tactical combat, where you evaluate each situation, determine a plan of action, and then execute on your command. [Sony]… Expand"}, {"name": "Syberia", "details_link": "https://www.metacritic.com/game/xbox/syberia", "publisher": "XS Games", "release_date": "Jul 23 2003", "developers": ["Microids"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/13ebea2f461285838bdcb106b837cc0b-98.jpg", "descriptions": "For the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws allFor the young Kate Walker, an ambitious lawyer, the Voralberg toy company acquisition seemed like a textbook case--a quick stopover to a small alpine village in France to buy-out an old automaton factory, then straight back home to New York.  But her journey across land and time throws all she values into question, and the deal she set out to sign turns into a pact with destiny.  Follow Kate through a magical world of automatons, amazing characters, and mysterious environments.  This puzzle-driven adventure blends logical problem-solving with a complex and involving storyline.… Expand"}, {"name": "Gato Roboto", "details_link": "https://www.metacritic.com/game/switch/gato-roboto", "publisher": "Devolver Digital", "release_date": "May 30 2019", "developers": ["Doinksoft"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/3f7ca1e969ee1ebbeb3cfc42c38bffae-98.jpg", "descriptions": "Pounce inside of your cozy armored mech and set off on a dangerous trek through an alien underworld full of irritable creatures and treacherous obstacles in a valiant effort to save your stranded captain and his crashed spaceship. Tiptoe outside the friendly confines of your technologicalPounce inside of your cozy armored mech and set off on a dangerous trek through an alien underworld full of irritable creatures and treacherous obstacles in a valiant effort to save your stranded captain and his crashed spaceship. Tiptoe outside the friendly confines of your technological marvel and follow your feline instincts through tight tunnels and mysterious waterways to scavenge for new weapons and gear. Adventure awaits the most curious of cats in Gato Roboto.… Expand"}, {"name": "LEGO The Hobbit", "details_link": "https://www.metacritic.com/game/playstation-4/lego-the-hobbit", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  8 2014", "developers": ["TT Games"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Action Adventure", "General", "Fantasy"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/d7a709495ebd1ed20d837d165e20e3d0-98.jpg", "descriptions": "From the makers of LEGO The Lord of the Rings, comes LEGO The Hobbit, inspired by the first two films in The Hobbit Trilogy: The Hobbit: An Unexpected Journey and The Hobbit: Desolation of Smaug as well as the collection  of LEGO The Hobbit constructions sets.  The interactive game of LEGOFrom the makers of LEGO The Lord of the Rings, comes LEGO The Hobbit, inspired by the first two films in The Hobbit Trilogy: The Hobbit: An Unexpected Journey and The Hobbit: Desolation of Smaug as well as the collection  of LEGO The Hobbit constructions sets.  The interactive game of LEGO The Hobbit allows gamers to play along with their favorite scenes from the films, and follows the Hobbit Bilbo Baggins as he is recruited by the Wizard Gandalf to aid Thorin Oakenshield and his Company of Dwarves. Bilbo leaves the comforts of the Shire on a journey through Middle-earth to help the Dwarves reclaim their lost Kingdom of Erebor within the Lonely Mountain. Along the way, he is introduced to ravenous Trolls, dangerous Orcs and, of course, Gollum and his precious Ring.  Players utilize and combine the Dwarves’ unique abilities to solve a diverse array of Quests.… Expand"}, {"name": "Medal of Honor", "details_link": "https://www.metacritic.com/game/pc/medal-of-honor", "publisher": "Electronic Arts", "release_date": "Oct 12 2010", "developers": ["Dice", "Danger Close"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/e0b3bbd8d32d17c4f8d99cfe2a930d2d-98.jpg", "descriptions": "EALA is crafting this single-player component of this modern-day, Afghanistan-set reboot of the classic shooter series; DICE is working on the multiplayer."}, {"name": "WWE '12", "details_link": "https://www.metacritic.com/game/playstation-3/wwe-12", "publisher": "THQ", "release_date": "Nov 22 2011", "developers": ["Yuke's"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/6b5bdbead1e897178c895dd56c9123f8-98.jpg", "descriptions": "WWE '12 is the next iteration in this wrestling series with Smackdown vs Raw being no more."}, {"name": "Primordia", "details_link": "https://www.metacritic.com/game/pc/primordia", "publisher": "Wadjet Eye Games", "release_date": "Dec  5 2012", "developers": ["Wormwood Studios"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "Point-and-Click"], "meta_score": 72, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/666c434114f7d4e48daa7eeac0c6590e-98.jpg", "descriptions": "Primordia is a sci-fi adventure with an in-depth story and a philosophical bent."}, {"name": "Wolfenstein", "details_link": "https://www.metacritic.com/game/xbox-360/wolfenstein", "publisher": "Activision", "release_date": "Aug 18 2009", "developers": ["id Software", "Raven Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/ae5dbe3abc2b2b67466dd0c066db753d-98.jpg", "descriptions": "Set within a near-fictional, historical WWII setting, players take on the role of the heroic OSA agent BJ Blazkowicz as they are thrust into the unknown and unexpected to battle against combat troops, otherworldly forces, and the dark science created by a supernatural Nazi force hell-bent onSet within a near-fictional, historical WWII setting, players take on the role of the heroic OSA agent BJ Blazkowicz as they are thrust into the unknown and unexpected to battle against combat troops, otherworldly forces, and the dark science created by a supernatural Nazi force hell-bent on world domination.  Wolfenstein offers players an action-packed experience as they investigate the powers of a dark parallel dimension, join with resistance forces, and employ an arsenal of conventional and otherworldly weapons in attempts to annihilate the Nazi war machine. Ensuring a deep variety of action, Wolfenstein provides gamers with an assortment of interlinked missions that drive an intense, story-driven combat experience; while the Wolfenstein multiplayer experience continues the world-renowned tradition of class-based team objective gameplay with a full arsenal of conventional and supernatural weapons for addictive online warfare. [Activision]… Expand"}, {"name": "Styx: Shards of Darkness", "details_link": "https://www.metacritic.com/game/pc/styx-shards-of-darkness", "publisher": "Focus Home Interactive", "release_date": "Mar 14 2017", "developers": ["Cyanide"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/64f55a3f4f4cb81151d8de4c649cc511-98.jpg", "descriptions": "Following the fall of Akenash tower, an extraordinary matter has forced Styx out of hiding and into Korrangar, city of the Dark Elves. Supposedly impregnable, a diplomatic summit offers Styx a chance at slipping in unnoticed. His infiltration complete, Styx will stop at nothing to accomplishFollowing the fall of Akenash tower, an extraordinary matter has forced Styx out of hiding and into Korrangar, city of the Dark Elves. Supposedly impregnable, a diplomatic summit offers Styx a chance at slipping in unnoticed. His infiltration complete, Styx will stop at nothing to accomplish the robbery of a lifetime: stealing a scepter of immense and indomitable power.\r Embark upon a stealthy adventure with new enemies, new environments, and a plethora of new mechanics refining the abilities of Styx - grappling around corners, climbing ropes, and using his trusty knife to zip line!… Expand"}, {"name": "Section 8", "details_link": "https://www.metacritic.com/game/pc/section-8", "publisher": "SouthPeak Games", "release_date": "Aug 25 2009", "developers": ["TimeGate Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/5fb67a3dfa2ab630aa8fa7915ec0510e-98.jpg", "descriptions": "On the war-torn planets of tomorrow, mankind's greatest battle is about to begin. With its frontier colonies devastated by a growing insurrection, Earth dispatches the elite 8th Armored Infantry (nicknamed \"Section 8\") to repel the coming onslaught. The nickname refers to an old UnitedOn the war-torn planets of tomorrow, mankind's greatest battle is about to begin. With its frontier colonies devastated by a growing insurrection, Earth dispatches the elite 8th Armored Infantry (nicknamed \"Section 8\") to repel the coming onslaught. The nickname refers to an old United States military regulation where a soldier would be dismissed from service through being mentally unfit for duty. The near-suicidal missions that this division volunteers for brands them as insane by other military units. Section 8 deploys by 'burning in' from their orbital drop ships tens of thousands of feet above the battlefield, utilizing the most advanced arsenal of military hardware known to man. Their mission: to scout and secure difficult objectives and smash enemy defenses in lightning-quick assaults. An intense first-person shooter, Section 8 allows players to dynamically alter the flow of combat as they see fit. Employing tactical assets and on-demand vehicle deliveries, players are given unprecedented strategic control over epic sci-fi battlefields. [SouthPeak Interactive]… Expand"}, {"name": "The Red Star", "details_link": "https://www.metacritic.com/game/playstation-2/the-red-star", "publisher": "XS Games", "release_date": "Apr 23 2007", "developers": ["XS Games"], "platforms": ["iPhone/iPad", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/eb80b1104af761fd27adb64eae89d13e-98.jpg", "descriptions": "Over the course of several generations, the once mighty empire known as The United Republics of The Red Star (U.R.R.S.) slaughtered millions of its own people by the order of a single man. This man was their leader, Imbohl; a mighty sorcerer whose insanity turned his people's Utopian dreamsOver the course of several generations, the once mighty empire known as The United Republics of The Red Star (U.R.R.S.) slaughtered millions of its own people by the order of a single man. This man was their leader, Imbohl; a mighty sorcerer whose insanity turned his people's Utopian dreams into a nightmarish scheme driven by the desire to forge his own immortality. Haunted by the ghosts of their nation's tragic past, the Heroes of the Red Star, at the battle of Kar Dathra's Gate, discover the true nature of their people's struggle, abandon their duties as soldiers of the Red Fleet, and embark upon a quest to liberate their people from Imbohl's dark legacy. [Acclaim]… Expand"}, {"name": "Stranger of Paradise: Final Fantasy Origin", "details_link": "https://www.metacritic.com/game/playstation-5/stranger-of-paradise-final-fantasy-origin", "publisher": "Square Enix", "release_date": "Mar 15 2022", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Action Adventure", "Linear", "Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/ebd83515fca8d25301564cb88ef0abbc-98.jpg", "descriptions": "Players of the STRANGER OF PARADISE FINAL FANTASY ORIGIN TRIAL VERSION can explore this dark fantasy world as they battle an array of iconic monsters from the FINAL FANTASY series, using powerful spells and abilities from a sample of jobs including warrior, dragoon and black mage."}, {"name": "Champions Online", "details_link": "https://www.metacritic.com/game/pc/champions-online", "publisher": "Atari", "release_date": "Sep  1 2009", "developers": ["Cryptic Studios"], "platforms": "PC", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/3f4b87bf0bbf5db4d28311a2086cfd4d-98.jpg", "descriptions": "Earth's first and best line of defense is its heroes. For generations, brave men and women have answered the call to protect the world from the villains who threaten its safety and security. Today, organizations such as VIPER, ARGENT and PSI use both superpowers and super technology in theirEarth's first and best line of defense is its heroes. For generations, brave men and women have answered the call to protect the world from the villains who threaten its safety and security. Today, organizations such as VIPER, ARGENT and PSI use both superpowers and super technology in their dastardly plots to control the world. Creatures from outer space and other dimensions seek to enslave humanity. Super scientist Teleios is creating an army of clones and superpowered constructs to do his bidding. The greatest threat of all is Doctor Destroyer. A superhuman genius driven to conquer, Destroyer will not stop until all of humanity bends knee to his greatness. In 1992, Destroyer obliterated the city of Detroit and killed thousands. With years to prepare, his next attack is sure to put the entire planet in peril. Led by The Champions, protectors of Millennium City, the world's heroes have launched a crusade for peace, security and justice. But they need allies. Defender is calling for a new generation of superheroes to fight in a war against evil that spans the globe - and beyond. Save the world. Be a Champion. [Atari]… Expand"}, {"name": "Mahokenshi", "details_link": "https://www.metacritic.com/game/pc/mahokenshi", "publisher": "Iceberg Interactive", "release_date": "Jan 24 2023", "developers": ["GameSourceStudio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/e157c9c541e382d09061b76d7463c7e8-98.jpg", "descriptions": "Mahokenshi is a potent combination of deck building and hex-grid strategy combining the deep tactical play of card games, with the strategic turn-based thinking of board games. As a Mahokenshi - a Samurai Mage from one of the Celestial Isles' four houses - you will need to protect theMahokenshi is a potent combination of deck building and hex-grid strategy combining the deep tactical play of card games, with the strategic turn-based thinking of board games. As a Mahokenshi - a Samurai Mage from one of the Celestial Isles' four houses - you will need to protect the Kingdom against an encroaching corruption. Through strategy, positioning and tactics, utilise your card deck to explore the world, vanquish demons and banish the evil that plagues the land.\r Brimming with challenge, Mahokenshi invites players to explore a vibrant world filled with quests, cards and formidable foes, to restore peace one hex at a time.… Expand"}, {"name": "Saturnalia", "details_link": "https://www.metacritic.com/game/playstation-5/saturnalia", "publisher": "Santa Ragione", "release_date": "Oct 27 2022", "developers": ["Santa Ragione"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "Survival"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/f3257af67ec4637150ec8d3cf41fdd4f-98.jpg", "descriptions": "A game inspired and heavily influenced by the folklore of Sardinia, Italy (a region rich with unique traditions and culture) where you play as four characters, experiencing a deeply connected storyline that ties back to the haunting traditions of an ancient village.Die, and watch theA game inspired and heavily influenced by the folklore of Sardinia, Italy (a region rich with unique traditions and culture) where you play as four characters, experiencing a deeply connected storyline that ties back to the haunting traditions of an ancient village.Die, and watch the village reconfigure itself into a new form. Solve puzzles and open shortcuts to new areas with tools and items you find along the way, unlocking every piece of the story with different characters, each with its own power and suited for another aspect of exploration and investigation.With a limited supply of matches to light your way and darkness encroaching, can you find your way through the fog to reveal the truth? Or will you be engulfed by the secrets this town doesn't want you to know?… Expand"}, {"name": "The Battle of Polytopia", "details_link": "https://www.metacritic.com/game/switch/the-battle-of-polytopia", "publisher": "Midjiwan", "release_date": "Oct 12 2022", "developers": ["Midjiwan"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/2f89df78521d0276027bd7222cc7d44d-98.jpg", "descriptions": "Welcome to the unique turn-based strategy game set in the strange, flat world of the Square. Lead one of 12 distinct civilizations to victory by expanding your empire, researching technologies and ultimately become ruler of the world! Play in single-player or multiplayer mode for up to 15 players."}, {"name": "Bear and Breakfast", "details_link": "https://www.metacritic.com/game/pc/bear-and-breakfast", "publisher": "Armor Games", "release_date": "Jul 28 2022", "developers": ["Gummy Cat"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/88cd1cefa1f3b3f1be2a9aff09a48b5d-98.jpg", "descriptions": "Bear and Breakfast is a laid-back management adventure game where you build and run a bed and breakfast...but you’re a bear."}, {"name": "Pupperazzi", "details_link": "https://www.metacritic.com/game/pc/pupperazzi", "publisher": "Kitfox Games", "release_date": "Jan 20 2022", "developers": ["Sundae Month"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Action Adventure", "Open-World"], "meta_score": 72, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/fc4a76fee691b768ae74a738f0645e06-98.jpg", "descriptions": "Put your love for pups to the test - we have a bunch of dogs that need their photos taken, doggone it! Photograph and catalogue the finest (and derpiest) dogs to build your career, upgrade your camera, and discover new canines. WOOF."}, {"name": "Prinny Presents NIS Classics Volume 1", "details_link": "https://www.metacritic.com/game/switch/prinny-presents-nis-classics-volume-1", "publisher": "NIS America", "release_date": "Aug 31 2021", "developers": ["Nippon Ichi Software"], "platforms": "Switch", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/1af4d8404a9d835b22a12858d270c414-98.jpg", "descriptions": "This is the first installment of a quintessential Strategy RPG lover’s collection, which boasts 2 games in 1! With over 60 hours of gameplay between both games, and an exclusive physical Deluxe Edition that includes a CD soundtrack and art book (with music and art from both titles), This is the first installment of a quintessential Strategy RPG lover’s collection, which boasts 2 games in 1! With over 60 hours of gameplay between both games, and an exclusive physical Deluxe Edition that includes a CD soundtrack and art book (with music and art from both titles), returning fans can relive time-honored favorites, while new (and old) fans can discover hits they may have missed! … Expand"}, {"name": "Before We Leave", "details_link": "https://www.metacritic.com/game/pc/before-we-leave", "publisher": "Team17", "release_date": "May 13 2021", "developers": ["Balancing Monkey Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/60c1d06f269a1b5f737c09a2b6b145fc-98.jpg", "descriptions": "Before We Leave is a non-violent city building game set in your own cozy corner of the universe. Rediscover and rebuild civilization. Create a multi-planet resource network. Overcome ancient challenges and fend off hungry space whales."}, {"name": "Monster Truck Championship", "details_link": "https://www.metacritic.com/game/xbox-series-x/monster-truck-championship", "publisher": "Maximum Games", "release_date": "Mar 16 2021", "developers": ["Teyon", "Maximum Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 72, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/ba1f846371a02541980125ba02f18997-98.jpg", "descriptions": "From Las Vegas to Orlando, go head-to-head against experienced drivers in drag races and freestyle competitions! But before you can pull off doughnuts, wheelies and bicycles, you must first tune your truck to perfection. These machines are colossal and spectacular yet highly technical toFrom Las Vegas to Orlando, go head-to-head against experienced drivers in drag races and freestyle competitions! But before you can pull off doughnuts, wheelies and bicycles, you must first tune your truck to perfection. These machines are colossal and spectacular yet highly technical to drive. The game faithfully reproduces all the unique demands of mastering these powerful trucks, including independent front and rear wheel management, mass transfer anticipation in bends, and predicting bounces after jumps.But what's performance without style? Customise your monster truck to reflect your style and show it off to your 7 opponents in online mode.… Expand"}, {"name": "Rhythm Fighter", "details_link": "https://www.metacritic.com/game/switch/rhythm-fighter", "publisher": "Coconut Island Games", "release_date": "Jan 14 2021", "developers": ["echo games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/5176e93f117d66fe2aee0deeb75e4526-98.jpg", "descriptions": "Commander Chaos, the most infamous Beatarain in this universe. Finally, he set his mind on the Planet Earth, and destroy the peaceful life of animals and vegetables. He use dark Beat Energy, and turn all the lovely vegetables into evil minions in a blink. They wreak havoc all over the world.Commander Chaos, the most infamous Beatarain in this universe. Finally, he set his mind on the Planet Earth, and destroy the peaceful life of animals and vegetables. He use dark Beat Energy, and turn all the lovely vegetables into evil minions in a blink. They wreak havoc all over the world. Countless animal heroes have sacrificed. The evil purpose of Commander Chaos will succeed in an instant.At the critical moment, a mysterious man, Mr. Disco, who also came from Beatara, has befall this planet. He use bright Beat Energy and revival all exhausted heroes. With all the help from this mysterious force, heroes gradually mastered a way to defeat darkness. They can follow the beat! Then, they embark on a journey to save the planet. But the true purpose, no one knows...Rhythm Fighter is a hardcore game that combine 2D Roguelike with rhythm. In this game, you need to follow the beat, fist to meat. At the same time, you need to pay attention to move, roll, batter, etc. You need to face strong opponent and show your courage, create your signature move. Start the game, go to the battlefeild, and follow the beat!… Expand"}, {"name": "Nickelodeon Kart Racers 2: Grand Prix", "details_link": "https://www.metacritic.com/game/switch/nickelodeon-kart-racers-2-grand-prix", "publisher": "GameMill Publishing", "release_date": "Oct  6 2020", "developers": ["Bamtang", "GameMill Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/dc37a1b41880942944fbad15df8d2b38-98.jpg", "descriptions": "Nickelodeon Kart Racers is back! We've brought the whole gang and more!Choose from 30 of Nickelodeon's Hall of Fame, incluuding Jojo Siwa, Spongebob Squarepants, The Teenage Mutant Ninja Turtles, the babies from Rugrats, the cool kids from Hey Arnold!, Ren and Stimpy, Lincoln Loud and hisNickelodeon Kart Racers is back! We've brought the whole gang and more!Choose from 30 of Nickelodeon's Hall of Fame, incluuding Jojo Siwa, Spongebob Squarepants, The Teenage Mutant Ninja Turtles, the babies from Rugrats, the cool kids from Hey Arnold!, Ren and Stimpy, Lincoln Loud and his sisters, and more! Speed your way across 28 slime filled tracks to win highly coveted cups and over 80 upgrades for your kart! Shift into next gear by challenging your friends in local or online multiplayer and see who can cross the finish line first! On your marks, get set, slime!Features:- More than Double the Racers! 30 of the most iconic Nickelodeon characters; SpongeBob, TMNT, Hey Arnold!, Rugrats, Jojo Siwa and more.- Race on 28 different slime-filled tracks, new and old.- Featuring 80 Karts with multiple power-ups and special attacks- Local and and Online Multi-Player! Non-stop action the entire family will love… Expand"}, {"name": "PGA Tour 2K21", "details_link": "https://www.metacritic.com/game/switch/pga-tour-2k21", "publisher": "2K Games", "release_date": "Aug 21 2020", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Golf", "Sim"], "meta_score": 72, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/2/c3d0f5f85a61e2ce116d8bfcf444fb59-98.jpg", "descriptions": "ALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\r  PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life coursesALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\r  PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life courses including TPC Sawgrass, East Lake Golf Club, and more.\r  BUILD YOUR MYPLAYER & DREAM COURSE: Create and personalize your MyPLAYER with equipment and apparel from brands you love. Design your ultimate course with 1,000s of custom options.\r  DOMINATE THE GREEN AT ANY SKILL LEVEL: Rookies can take advantage of real-time tutorials, tips and shot suggestions. Already a pro? Master your game with Pro Vision, Distance Control, Putt Preview, and other innovations.\r  GET THE PARTY STARTED: Hit the links with friends by playing local and online matches, including Alt-Shot, Stroke Play, Skins and 4-Player Scramble.\r  MAKE YOUR OWN RULES: Command your Clubhouse with Online Societies. Run full seasons and tournaments and earn bragging rights on the course. Create entry rules and requirements as well as handicap and event settings.\r  THE MOST REALISTIC COURSES EVER: Real-world scanning brings the fairway, green, bunkers, trees, lakes and ponds to life! True-to-form PGA TOUR broadcast presentation features slick graphics, dynamic cut-scenes and a seamless replay system, all anchored by the play-by-play commentary of Luke Elvy and Rich Beem.… Expand"}, {"name": "Disney Classic Games: Aladdin and the Lion King", "details_link": "https://www.metacritic.com/game/xbox-one/disney-classic-games-aladdin-and-the-lion-king", "publisher": "Nighthawk Interactive", "release_date": "Oct 29 2019", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/8/03b9ab13615087d29dbb664ab71fc7cb-98.jpg", "descriptions": "Two Disney games make their long-awaited return to modern consoles in Disney Classic Games: Aladdin and The Lion King. This package of Disney classics is filled with tons of new features, enhancements, game modes, and display options, plus multiple versions of the games. Join Aladdin and hisTwo Disney games make their long-awaited return to modern consoles in Disney Classic Games: Aladdin and The Lion King. This package of Disney classics is filled with tons of new features, enhancements, game modes, and display options, plus multiple versions of the games. Join Aladdin and his sidekick, Abu, as they race through the marketplace toward their date with destiny. Relive Aladdin’s classic adventure as you travel through Agrabah, the Cave of Wonders and more to defeat Jafar and rescue Jasmine.  Jump, fight, dodge and carpet-ride your way through this adventure, collecting gems along the way.  The Lion King brings to life the majesty and mystery of Africa through the tale of Simba, a lion cub faced with the challenging transition to maturity. Now, you too can be part of the adventure.  Driven into the wilderness by his evil uncle Scar, Simba finds salvation and Hakuna Matata with Pumbaa the warthog and Timon the meerkat.  Tackle heinous hyenas in the elephant’s graveyard, avoid the trampling hooves of stampeding wildebeest as you battle through 10 levels to ensure Simba claims his rightful place as The Lion King.… Expand"}, {"name": "When Ski Lifts Go Wrong", "details_link": "https://www.metacritic.com/game/switch/when-ski-lifts-go-wrong", "publisher": "Curve Digital", "release_date": "Jan 23 2019", "developers": ["Huge Calf Studios"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Ski / Snowboard"], "meta_score": 72, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/5/9ed3ec5ae731cab5d313e02409e39d75-98.jpg", "descriptions": null}, {"name": "Super Daryl Deluxe", "details_link": "https://www.metacritic.com/game/switch/super-daryl-deluxe", "publisher": "Dan & Gary Games", "release_date": "Apr 10 2018", "developers": ["Dan & Gary Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/7c6d55306d9c85cb48af5bb338c8ff5d-98.jpg", "descriptions": "Super Daryl Deluxe is an RPGvania with brawler-style combat set inside of a perfectly normal, sprawling, multi-dimensional high school."}, {"name": "The Raven Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/the-raven-remastered", "publisher": "THQ Nordic", "release_date": "Mar 13 2018", "developers": ["THQ Nordic"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 72, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/735fd99f62f11c4e9c8536fd39bc7971-98.jpg", "descriptions": "London, 1964. An ancient ruby has been stolen from the British Museum. At the crime scene: a raven feather. Is someone trying to follow in the footsteps of The Raven, the legendary master thief who disappeared years before?"}, {"name": "Sword Art Online: Fatal Bullet", "details_link": "https://www.metacritic.com/game/xbox-one/sword-art-online-fatal-bullet", "publisher": "Bandai Namco Games", "release_date": "Feb 23 2018", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/a7ea9e339040e76a553ef2b3d1977ac3-98.jpg", "descriptions": "Your Choice is Heavier and Faster Than a Bullet. Become the hero of Gun Gale Online in the latest game of the SAO franchise in Sword Art Online: Fatal Bullet. Step into the versatile landscapes and environments of Gun Gale Online with unique and realistic designs resembling something out ofYour Choice is Heavier and Faster Than a Bullet. Become the hero of Gun Gale Online in the latest game of the SAO franchise in Sword Art Online: Fatal Bullet. Step into the versatile landscapes and environments of Gun Gale Online with unique and realistic designs resembling something out of a sci-fi movie and numerous other weapons and fighting styles to choose from. Interact with characters from the Sword Art Online original novels, anime and previous games as you navigate a world that is vastly personalized and visually enhanced. Play as the protagonist, battle against opponents using new weapons and further customize gameplay by creating skills and abilities. Full dive into Sword Art Online: Fatal Bullet!FEATURES:* Welcome to the World of Guns: Gun Gale Online from Sword Art Online II is visually enhanced and diverse with many landscapes to discover in an all new original story supervised by series creator, Reki Kawahara.* Unreal Visuals: Get lost in a lifelike world developed by Dimps with realistic and robust environments and textures made possible by Unreal Engine 4.* Friend or Foe: Challenge tough bosses that require friends in co-op or play against them in 4-on- 4 battles.* Realistic and Heroic Gun play: Plenty of one-of-a-kind and beautifully designed weapons to choose from and unique skills to create.* New to XBOX ONE: Sword Art Online will come to XBOX ONE and PS4 simultaneously for the first time in the history of the popular gaming series.… Expand"}, {"name": "Tiny Trax", "details_link": "https://www.metacritic.com/game/playstation-4/tiny-trax", "publisher": "FuturLab", "release_date": "Jul 25 2017", "developers": ["FuturLab"], "platforms": "PlayStation 4", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 72, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/18feef7d7d8c3f3fe4856664de45fab2-98.jpg", "descriptions": "Epic racing in a tiny world. Childhood imagination comes to life as tiny racers boost around your body, jump overhead and drift around bends inches from your face."}, {"name": "BUTCHER", "details_link": "https://www.metacritic.com/game/xbox-one/butcher", "publisher": "Crunching Koalas", "release_date": "May 10 2017", "developers": ["Crunching Koalas"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/e4c98c057e9c24e9ba724aeeb588070c-98.jpg", "descriptions": "BUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre. As a cyborg programmed to eradicate the last remains of humanity, your sole purpose is to well... annihilate anything that moves.So grab your weapon of choice (from chainsaw, throughBUTCHER is a fast-paced 2D shooter and a blood-soaked love letter to the cult classics of the genre. As a cyborg programmed to eradicate the last remains of humanity, your sole purpose is to well... annihilate anything that moves.So grab your weapon of choice (from chainsaw, through shotgun, to grenade launcher) and kill your way through underground hideouts, post-apocalyptic cities, jungles and more. And if you're feeling creative, there are plenty other ways of ending your enemies' misery - hooks, lava pits, saws... no death will ever be the same.If kicking corpses into a lava pit and adorning walls with blood is your idea of a good time, BUTCHER is THE game for you.… Expand"}, {"name": "Narcosis", "details_link": "https://www.metacritic.com/game/xbox-one/narcosis", "publisher": "Honor Code, Inc.", "release_date": "May 10 2017", "developers": ["Honor Code", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/120b7c0cddd2d4e5badbf023deb082c5-98.jpg", "descriptions": "Narcosis is a survival story set at the hostile depths of the Pacific Ocean. Stranded after an accident, an industrial diver takes desperate steps to surface before his oxygen - and sanity - give out."}, {"name": "Duke Nukem 3D: 20th Anniversary World Tour", "details_link": "https://www.metacritic.com/game/pc/duke-nukem-3d-20th-anniversary-world-tour", "publisher": "Gearbox Software", "release_date": "Oct 11 2016", "developers": ["Gearbox Software"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/44ae2603b7c1bfe66a668ea062627e44-98.jpg", "descriptions": "Frag like it’s 1996 – this time with even more asses to kick! Join the world’s greatest action hero in Duke Nukem 3D: 20th Anniversary World Tour as he saves Earth once again, kicking alien ass and saving babes across the globe along the way."}, {"name": "Psycho-Pass: Mandatory Happiness", "details_link": "https://www.metacritic.com/game/playstation-4/psycho-pass-mandatory-happiness", "publisher": "NIS America", "release_date": "Sep 13 2016", "developers": ["5pb"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/5d4a0664fd5cd9426cd7d9d05dfece04-98.jpg", "descriptions": "2112, Tokyo. Decide the fates of Nadeshiko Kugatachi and Takuma Tsurugi, two new detectives assigned to Division 1. Every decision has its own repercussion, victims can become criminals, and the story may end quicker than expected. [Playstation.com]"}, {"name": "LEGO Star Wars: The Force Awakens", "details_link": "https://www.metacritic.com/game/pc/lego-star-wars-the-force-awakens", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 27 2016", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/4ff324caa5f8fc7fe7a714e3566ec274-98.jpg", "descriptions": "In LEGO Star Wars: The Force Awakens, relive the epic action from the blockbuster film in way that only LEGO can offer, featuring brand new story content from the Star Wars Universe that explores the time between Star Wars: Return of the Jedi and Star Wars: The Force Awakens."}, {"name": "UEFA EURO 2016", "details_link": "https://www.metacritic.com/game/playstation-4/uefa-euro-2016", "publisher": "Konami", "release_date": "Apr 21 2016", "developers": ["Konami"], "platforms": "PlayStation 4", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/07842f26ca74b839159f53ad529f5762-98.jpg", "descriptions": "KONAMI’s official UEFA EURO 2016 title is added to PES 2016’s main menu screen and instantly visible on loading the game. The disc-based release contains both the full PES 2016 game and UEFA EURO 2016 content. The UEFA EURO 2016 mode features full iconography and presentation elements fromKONAMI’s official UEFA EURO 2016 title is added to PES 2016’s main menu screen and instantly visible on loading the game. The disc-based release contains both the full PES 2016 game and UEFA EURO 2016 content. The UEFA EURO 2016 mode features full iconography and presentation elements from this year’s tournament, and also includes the Stade de France stadium, which hosts the final in July. From the 24 qualified teams that feature real players with hundreds of authentic player faces, 15 fully licensed teams will be included with the latest strips for England, Wales, Germany, Spain, Portugal, Italy, Ukraine, Czech Republic, Croatia, Slovakia, Iceland, Turkey, Albania, Northern Ireland and hosts France, all perfectly recreated. All squads will also be in line with those of the qualifying nations with the various playing styles perfectly replicated via the game’s innovative Player ID and Team ID systems, which mimic the exact playing styles of both individual players and the team as a whole. [Konami]… Expand"}, {"name": "Minecraft: Story Mode - Episode 5: Order Up!", "details_link": "https://www.metacritic.com/game/playstation-4/minecraft-story-mode---episode-5-order-up!", "publisher": "Telltale Games", "release_date": "Mar 29 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Adventure", "Point-and-Click", "Linear"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/0ce9199d79342830e6bab3965298011c-98.jpg", "descriptions": "In Episode 5, on a tip from Ivor, Jesse and friends head to an abandoned temple holding mysterious treasures. Ambushed by former Ocelot Aiden and his crew, our heroes find themselves in an entirely new world: Sky City! As they explore, the Order finds that resources are at a premium, andIn Episode 5, on a tip from Ivor, Jesse and friends head to an abandoned temple holding mysterious treasures. Ambushed by former Ocelot Aiden and his crew, our heroes find themselves in an entirely new world: Sky City! As they explore, the Order finds that resources are at a premium, and nothing but 'The Void' exists below the known world. When Aiden convinces Sky City's ruler that the New Order of the Stone are up to no good, you'll need to make some tough choices to clear your name, and keep Aiden from destroying an innocent world.… Expand"}, {"name": "Just Cause 3: Sky Fortress", "details_link": "https://www.metacritic.com/game/playstation-4/just-cause-3-sky-fortress", "publisher": "Square Enix", "release_date": "Mar 15 2016", "developers": ["Avalanche Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/3d428bdbf32aea28ac774755889a93b8-98.jpg", "descriptions": "Just Cause 3: Sky Fortress is the first PDLC pack from the Air, Land & Sea Expansion pass. Be the master of the skies with Rico's all new and fully armed, Bavarium Wingsuit. Save Medici from the threat of the terrifying Sky Fortress and its army of deadly robotic drones. This content packJust Cause 3: Sky Fortress is the first PDLC pack from the Air, Land & Sea Expansion pass. Be the master of the skies with Rico's all new and fully armed, Bavarium Wingsuit. Save Medici from the threat of the terrifying Sky Fortress and its army of deadly robotic drones. This content pack includes new missions, challenges, the \"Bavarium Splitter\" assault rifle and the \"Evictor\" personal defence drone, all of which can be carried over into the main game.… Expand"}, {"name": "Way of the Samurai 4", "details_link": "https://www.metacritic.com/game/pc/way-of-the-samurai-4", "publisher": "Ghostlight", "release_date": "Jul 23 2015", "developers": ["Acquire"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/363c2a7d6e884003af5013d169aa4a59-98.jpg", "descriptions": "Set in post-isolationist Japan, Way of the Samurai 4 offers a unique way to experience an era that forever changed a nation. The era's cultural landscape offers countless opportunities for the ambitious, and players are thrown into this world as a ronin (masterless samurai) looking to make aSet in post-isolationist Japan, Way of the Samurai 4 offers a unique way to experience an era that forever changed a nation. The era's cultural landscape offers countless opportunities for the ambitious, and players are thrown into this world as a ronin (masterless samurai) looking to make a name for himself. Taking their place in the overall power struggle, players will be given the choice to align themselves with one of three factions: the shogunate pro-governmental forces, the nationalistic isolationists and the growing foreign powers, and their loyalty and interaction with each of the three factions will shape the story towards one of ten possible different endings.… Expand"}, {"name": "Devil May Cry 4: Special Edition", "details_link": "https://www.metacritic.com/game/pc/devil-may-cry-4-special-edition", "publisher": "Capcom", "release_date": "Jun 23 2015", "developers": ["Capcom"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/d942c43309aa8464f4a77d9d388479a5-98.jpg", "descriptions": "Devil May Cry 4 throws you into a gothic supernatural world, where a new protagonist clashes with a familiar hero. As the new leading man, Nero, you unleash incredible attacks and non-stop combos using a new gameplay mechanic, his powerful \"Devil Bringer\" arm. On the coast of a distant landDevil May Cry 4 throws you into a gothic supernatural world, where a new protagonist clashes with a familiar hero. As the new leading man, Nero, you unleash incredible attacks and non-stop combos using a new gameplay mechanic, his powerful \"Devil Bringer\" arm. On the coast of a distant land you'll find the castle town of Fortuna. It is here that the group known as the Order of the Sword practices an elusive religion. They revere the demon warrior Sparda, who as their god fought to protect humans, and are committed to the extermination of all demons. Nero, a young knight from the Order, is tasked with finding Dante, the mysterious assassin who murdered the head of the Order of the Sword. Simultaneously, more demons begin to surface throughout the city. Nero soon comes to discover the motives behind Dante's appearance and the truth behind the intentions of the Order of the Sword. … Expand"}, {"name": "The Inner World", "details_link": "https://www.metacritic.com/game/pc/the-inner-world", "publisher": "Meridian4", "release_date": "Sep 27 2013", "developers": ["Headup Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/1821a98e154e8175484c76a8e8c9e9e2-98.jpg", "descriptions": "The Inner World is a wonderfully twisted point-and-click adventure game that takes place in Asposia, a land that defies all laws of physics by existing in an enormous hollow space."}, {"name": "Phantom Breaker: Battle Grounds", "details_link": "https://www.metacritic.com/game/xbox-360/phantom-breaker-battle-grounds", "publisher": "5pb", "release_date": "Feb 27 2013", "developers": ["Division2"], "platforms": ["PC", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/f8d443a58c18c6b0830871f2f957fb4a-98.jpg", "descriptions": "Phantom Breaker: Battle Grounds is a 2D beat 'em up from Mages/5pb, the makers of Steins;Gate, Bullet Soul, and other great games. Choose a fighter and battle against the bizarre minions of the evil wizard Phantom. Enjoy classic beat 'em up gameplay with a fighting game twist. Dash throughPhantom Breaker: Battle Grounds is a 2D beat 'em up from Mages/5pb, the makers of Steins;Gate, Bullet Soul, and other great games. Choose a fighter and battle against the bizarre minions of the evil wizard Phantom. Enjoy classic beat 'em up gameplay with a fighting game twist. Dash through colorful Tokyo locales, strengthen your characters, team up with your friends, fight dragons and killer robots!\r Story Mode - Enjoy a lighthearted story as you battle Phantom's minions across 8 stages inspired by famous Tokyo districts.\r Arcade Mode - Challenge yourself to get the biggest combo, the highest score, or the fastest completion time.\r Multiplayer - Easy to learn mechanics make playing with your friends a snap. Team up with your friends for the local co-op or online campaign, or go to the battlegrounds arena and fight a pitched PVP battle! Up to 4 players supported.\r Customizable, Persistent Characters - 4 starting characters and 6 unlockable ones. Each character has a fully customizable stat and skill tree, and levels persist between all modes. Choose a favorite character and build them how you like! Every character has unique special attacks.\r Retro Charm - Vibrant sprite graphics and a catchy chiptune-inspired soundtrack for the discerning retro gamer!… Expand"}, {"name": "Papo & Yo", "details_link": "https://www.metacritic.com/game/playstation-3/papo-yo", "publisher": "Minority", "release_date": "Aug 14 2012", "developers": ["Minority", "Minority Media Inc."], "platforms": ["PC", "PlayStation 3"], "genres": ["Adventure", "General", "General"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/35c504005c4ca660a779d9db40229054-98.jpg", "descriptions": "Papo & Yo will take players on an emotional journey that explores the relationship between a boy and his sometimes-scary best friend. As players progress, Monster will react differently to their actions based on his current desires. If Monster is in a good mood, he will play with QuicoPapo & Yo will take players on an emotional journey that explores the relationship between a boy and his sometimes-scary best friend. As players progress, Monster will react differently to their actions based on his current desires. If Monster is in a good mood, he will play with Quico and help with tasks; if Monster is hungry, he will seek out food; if that food happens to be a poisonous frog, he’ll transform into a terrifying killing machine bent on nothing but destruction. Players will need to learn to use Monster’s emotions, both good and bad, to their advantage if they want to complete their search for a cure and save their pal.… Expand"}, {"name": "Brink", "details_link": "https://www.metacritic.com/game/playstation-3/brink", "publisher": "Bethesda Softworks", "release_date": "May 10 2011", "developers": ["Splash Damage"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/cc81cf31757a2bb9b933f5c9805721df-98.jpg", "descriptions": "Brink is an immersive shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character across all modes of play. You decide the role you want to assume in the world of Brink as you fight to save yourself and mankind’sBrink is an immersive shooter that blends single-player, co-op, and multiplayer gameplay into one seamless experience, allowing you to develop your character across all modes of play. You decide the role you want to assume in the world of Brink as you fight to save yourself and mankind’s last refuge for humanity. Brink offers a compelling mix of dynamic battlefields, extensive customization options, and an innovative control system that will keep you coming back for more. A man-made floating city called the Ark, made up of hundreds of separate floating islands, is on the brink of all-out civil war. Originally built as an experimental self-sufficient and 100% \"green\" habitat, the reported rapid rise of the Earth's oceans has forced the Ark to become a refuge for humanity.  Crammed with the original Ark founders, their descendants, as well as tens of thousands of refugees, the Ark exists in total isolation from the rest of the world. With 25 years of social unrest, the inhabitants of the Ark have reached their breaking point. It's up to you to decide the future of the Ark and the human race. Blurring the Lines Between Offline and Online - Advance your character’s development across every gameplay mode: single player, co-op, and multiplayer. Gain experience points that you can spend on customizing and upgrading your skills and abilities, designing an entirely unique look and feel for your character. Brink uses the familiar shooter controls that you're used to, without frustrating, artificial constraints and takes advantage of a new feature: the SMART button.  When you press the SMART button, the game dynamically evaluates where you’re trying to get to, and makes it happen. No need to perfectly time a jump or vault, the game knows what you want to do. Objectives, communications, mission generation, and inventory selection are all dynamically generated based on your role, your status, your location, your squad-mates, and the status of the battle in all gameplay modes.  You'll always know exactly where to go, what to do when you get there, and what your reward will be for success. Brink’s proprietary technology, Virtual Texturing, breaks new ground on current-gen consoles and PCs with an even greater focus on highly detailed characters, realistic environments, lighting, effects, and atmospherics. This competitive lead on the squad-combat genre helps thrust players into the gritty reality of the Ark's epic secluded arcology. [Bethesda Softworks]… Expand"}, {"name": "LEGO Harry Potter: Years 1-4", "details_link": "https://www.metacritic.com/game/ds/lego-harry-potter-years-1-4", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 29 2010", "developers": ["TT Fusion"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/7144c44c5f36e8aeddfc269a15a92533-98.jpg", "descriptions": "Build the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creativeBuild the adventure from Privet Drive to the Triwizard Tournament and experience the fun of the first four Harry Potter stories – Lego style. Explore Hogwarts School of Witchcraft and Wizardry, learn spells, brew potions and relive the adventures with tongue-in-cheek humor and creative customization that is unique to LEGO videogames.… Expand"}, {"name": "Stoked: Big Air Edition", "details_link": "https://www.metacritic.com/game/xbox-360/stoked-big-air-edition", "publisher": "Destineer", "release_date": "Nov 23 2009", "developers": ["Bongfish"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/7e32edd2a29210899a2919f8056b81e1-98.jpg", "descriptions": "Stoked, which has the highest Metacritic score of any advanced-generation snowboarding game, is now faster, bigger, easier to control, and even more gorgeous in Stoked: Big Air Edition. New features include racing, marked trails that make it easy to find great runs, lots of park objects toStoked, which has the highest Metacritic score of any advanced-generation snowboarding game, is now faster, bigger, easier to control, and even more gorgeous in Stoked: Big Air Edition. New features include racing, marked trails that make it easy to find great runs, lots of park objects to use for tricks, two new mountains, better visuals, and faster and smoother riding. [Destineer]… Expand"}, {"name": "World in Conflict: Soviet Assault", "details_link": "https://www.metacritic.com/game/pc/world-in-conflict-soviet-assault", "publisher": "Ubisoft", "release_date": "Mar 10 2009", "developers": ["Massive Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 72, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/da16096828d5d6dd9952c1f2930bd7ac-98.jpg", "descriptions": "World in Conflict: Soviet Assault allows players to relive the Cold War in a dramatic, gritty, real world setting driven by compelling characters and storyline. This one of a kind strategy game offers players a unique team-oriented experience on chillingly realistic battlegrounds. SovietWorld in Conflict: Soviet Assault allows players to relive the Cold War in a dramatic, gritty, real world setting driven by compelling characters and storyline. This one of a kind strategy game offers players a unique team-oriented experience on chillingly realistic battlegrounds. Soviet Assault features all-new characters, gameplay from the Soviet perspective, ten new films, new multiplayer maps and more. [Ubisoft]… Expand"}, {"name": "Juiced 2: Hot Import Nights", "details_link": "https://www.metacritic.com/game/ds/juiced-2-hot-import-nights", "publisher": "THQ", "release_date": "Sep 17 2007", "developers": ["Juice Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/99127020637db24e9ad3ea4a7e4056d6-98.jpg", "descriptions": "Juiced 2: HIN evolves the current street racing scene, letting players experience the culture of the real-life HIN tour, the nation's largest lifestyle custom car show in an intense racing experience. Featuring track and drift racing at real-world locations around the globe, next-gen AI andJuiced 2: HIN evolves the current street racing scene, letting players experience the culture of the real-life HIN tour, the nation's largest lifestyle custom car show in an intense racing experience. Featuring track and drift racing at real-world locations around the globe, next-gen AI and vehicle customization, Juiced 2: HIN brings street racing to life, allowing players to test their skills at live street racing events against a back-drop of DJs, fashion, models and musicians. New features include addictive drift/ powersliding races and \"Driver DNA\" that tracks gamers' personal driving traits. These profiles, along with the profiles of select celebrities will be available for download across all online gaming systems. Racing developer Juice Games has evolved the game-play in its online racing, giving players the power to create their car, assemble their crew and put it all on the line in intense pink slip and crew races. Gamers can bet cash on each event, bringing a gambling element to the game that greatly increases the importance of each race. [THQ]… Expand"}, {"name": "Carol Vorderman's Sudoku", "details_link": "https://www.metacritic.com/game/psp/carol-vordermans-sudoku", "publisher": "Eidos Interactive", "release_date": "Mar  6 2007", "developers": ["Empire Interactive"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/34361df202304d8c8530dece769c2328-98.jpg", "descriptions": "Carol will talk you through a number of topics including: An introduction to Sudoku: Learn the origins and rules of this popular puzzle. A step-by-step guide on how to play the game that has become a global obsession. Carol will lend a hand and help you solve an entire puzzle from start toCarol will talk you through a number of topics including: An introduction to Sudoku: Learn the origins and rules of this popular puzzle. A step-by-step guide on how to play the game that has become a global obsession. Carol will lend a hand and help you solve an entire puzzle from start to finish. Hints and tips: Gain knowledge on how to become a great Sudoku player. Tutorials for every level of player, if you're a master or novice, find out how to improve your game with live action, easy to follow tutorials. Multi-player Hot seat and wireless play: Go head to head or take on the hot seat and win by solving puzzles in the fastest time. 4 difficulty levels, a level to suit all players, from beginners to experts. 1,000,000 plus unique Sudoku puzzles! That's right over a million boards to choose from. Easy to use interface and grid assistance: If you need to erase a number or ask for help it's simple. Puzzle Solver: Solve any puzzle from any source. Multiple game modes: Choose from never seen before game modes and even challenge Carol herself. Classic Sudoku - Career mode- work your way up to a Sudoku master. Challenge Carol mode – can you beat the best? 2-player modes. Head to head wireless play and Hot seat. Multiple Arcade modes: Beat The Clock, Extra Time, Perfection, 3 Strikes. [Xplosiv]… Expand"}, {"name": "Naruto: Clash of Ninja", "details_link": "https://www.metacritic.com/game/gamecube/naruto-clash-of-ninja", "publisher": "D3", "release_date": "Mar  7 2006", "developers": ["Tomy Corporation"], "platforms": "GameCube", "num_players": "24  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/cab26e42b9634bfb563cf035a1437cdf-98.jpg", "descriptions": "Naruto: Clash of Ninja is a 3D fighting game based on the Japanese manga, Naruto. Take control of your favorite Naruto characters, including Naruto, Sasuke, Sakura, and more as you battle it out to determine who the greatest ninja is. Cel-shaded graphics parallel the style set forth in theNaruto: Clash of Ninja is a 3D fighting game based on the Japanese manga, Naruto. Take control of your favorite Naruto characters, including Naruto, Sasuke, Sakura, and more as you battle it out to determine who the greatest ninja is. Cel-shaded graphics parallel the style set forth in the cartoon, while special character-specific moves add to the feeling of authenticity. … Expand"}, {"name": "Sega GT Online", "details_link": "https://www.metacritic.com/game/xbox/sega-gt-online", "publisher": "Sega", "release_date": "Jan 27 2004", "developers": ["Wow Entertainment"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/a428f6415c2d9a4a3eb9f3a697f76d1c-98.jpg", "descriptions": "It's time to take your glorious Sega GT 2002 race car out of hiding and show her off to the world.  Pit your superior racer against the revved up Xbox Live community and kiss bumpers with up to 12 drivers from around the globe while talking in real-time.  In this car-lovers paradise thereIt's time to take your glorious Sega GT 2002 race car out of hiding and show her off to the world.  Pit your superior racer against the revved up Xbox Live community and kiss bumpers with up to 12 drivers from around the globe while talking in real-time.  In this car-lovers paradise there are over 165 top-of-the-line race cars from 25 different manufacturers just waiting to be customized and put to the ultimate test of will and speed.  When you're not tearing around the pristine tracks at breakneck speeds, be sure to stop by the new Gathering mode to play minigames which will earn you cash and unlock new cars for racing in Sega GT 2002 mode.  … Expand"}, {"name": "Dynasty Warriors 4: Xtreme Legends", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-4-xtreme-legends", "publisher": "Koei", "release_date": "Nov  4 2003", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/2536279c19a2c7b472dc568108a68050-98.jpg", "descriptions": "Features all 42 characters from the original Dynasty Warriors 4, with new gameplay elements. Engage in randomly generated skirmishes in Xtreme Mode. Live the exploits of all 42 warriors in Legends Mode. Engage in endurance style duels in the Arena Challenge. Play it by itself or Remix withFeatures all 42 characters from the original Dynasty Warriors 4, with new gameplay elements. Engage in randomly generated skirmishes in Xtreme Mode. Live the exploits of all 42 warriors in Legends Mode. Engage in endurance style duels in the Arena Challenge. Play it by itself or Remix with the original. [KOEI]… Expand"}, {"name": "Yu-Gi-Oh! Worldwide Edition: Stairway to the Destined Duel", "details_link": "https://www.metacritic.com/game/game-boy-advance/yu-gi-oh!-worldwide-edition-stairway-to-the-destined-duel", "publisher": "Konami", "release_date": "Apr  8 2003", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 72, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/c25342a1af6b5204de4d1d9e4ff381cc-98.jpg", "descriptions": "This is a game designed specifically for Yu-Gi-Oh! enthusiasts, and they'll be the people who get the most out of it."}, {"name": "The Omega Stone: Riddle of the Sphinx II", "details_link": "https://www.metacritic.com/game/pc/the-omega-stone-riddle-of-the-sphinx-ii", "publisher": "DreamCatcher Interactive", "release_date": "Mar 19 2003", "developers": ["Omni Creative Group"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Fantasy"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/d3994dbc47f830c380fc8cc55a1af89d-98.jpg", "descriptions": "After years of digging, noted archaeologist, Sir Gil Blythe Geoffreys uncovered a secret chamber and an ancient papyrus scroll overlooked for centuries that revealed the whereabouts of a treasure sought after throughout the millennia, the Ark of the Covenant. Further exploration led to theAfter years of digging, noted archaeologist, Sir Gil Blythe Geoffreys uncovered a secret chamber and an ancient papyrus scroll overlooked for centuries that revealed the whereabouts of a treasure sought after throughout the millennia, the Ark of the Covenant. Further exploration led to the discovery of another prophetic scroll, the contents of which unravels an ominous mystery. Sir Gil Blythe Geoffreys, calls on you to lead the exploration and examination of the origins of this sacred scroll, whose symbols point to cultures of great intelligence and refined intellects. [The Adventure Company]… Expand"}, {"name": "Summoner: A Goddess Reborn", "details_link": "https://www.metacritic.com/game/gamecube/summoner-a-goddess-reborn", "publisher": "THQ", "release_date": "Jan 31 2003", "developers": ["Cranky Pants Games"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/9305c743dc6cf5a723f2d7639ff7dc0e-98.jpg", "descriptions": "As the Queen of Halassar, your fate is written in the Book of the Prophets as the savior of all creation. Millions adore you as the goddess reborn, yet enemies surround you. You must fulfill the prophecy and become the goddess Laharah. But the path you follow remains a mystery that takes theAs the Queen of Halassar, your fate is written in the Book of the Prophets as the savior of all creation. Millions adore you as the goddess reborn, yet enemies surround you. You must fulfill the prophecy and become the goddess Laharah. But the path you follow remains a mystery that takes the Queen and her companions to the far-flung corners of the world and beyond. To save your people, you must learn to summon godlike powers to let your destiny unfold.… Expand"}, {"name": "Star Wars: The Clone Wars", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-the-clone-wars", "publisher": "LucasArts", "release_date": "Dec 10 2002", "developers": ["Pandemic Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/6907d8d5604e48c98f9bab7b21baf436-98.jpg", "descriptions": "You are thrust into the heat of battle in the galaxy's most unforgettable conflict. Lead the Republic army in the greatest battles of the epic Clone Wars as Anakin Skywalker, Mace Windu, and Obi-Wan Kenobi. Your directive: stop the Separatists from reassembling an ancient Sith weapon of massYou are thrust into the heat of battle in the galaxy's most unforgettable conflict. Lead the Republic army in the greatest battles of the epic Clone Wars as Anakin Skywalker, Mace Windu, and Obi-Wan Kenobi. Your directive: stop the Separatists from reassembling an ancient Sith weapon of mass annihilation! Take over where Episode II ends. Play out the greatest battles of the epic Clone Wars. Undertake missions ranging from intense close combat engagements to enormous large-scale battles. Pilot over five unique craft (Republic gunship, speeder bike, fighter tank, assault walker and even a maru) against over 30 different combat units. Play four entirely different multiplayer modes: team-based strategy, deathmatch, king-of-the-hill, and co-op endurance. Engage in sixteen single-player missions on six expansive worlds from the Star Wars universe. [LucasArts]… Expand"}, {"name": "Swingerz Golf", "details_link": "https://www.metacritic.com/game/gamecube/swingerz-golf", "publisher": "Eidos Interactive", "release_date": "Oct 23 2002", "developers": ["Telenet"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/24f12456fa55708342fe132b8cd83b56-98.jpg", "descriptions": "Grab your clubs and hit the links in Swingerz Golf. You'll tee up on six courses featuring diverse terrains, from a cactus-filled desert to a classic English course. Play as or against 14 offbeat golfers, each with distinct personalities and golfing abilities. You can battle three of yourGrab your clubs and hit the links in Swingerz Golf. You'll tee up on six courses featuring diverse terrains, from a cactus-filled desert to a classic English course. Play as or against 14 offbeat golfers, each with distinct personalities and golfing abilities. You can battle three of your friends in various gameplay modes, including Tournament, Stroke, Match, and Short Course. With challenging weather conditions, minigames, and intense tournaments, Swingerz Golf gives you a realistic and fun golfing experience.… Expand"}]