[{"name": "Harry Potter: Quidditch World Cup", "details_link": "https://www.metacritic.com/game/gamecube/harry-potter-quidditch-world-cup", "publisher": "Electronic Arts", "release_date": "Oct 28 2003", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Other"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/770cb6651cbf0ccf53dd011a92a776c6-98.jpg", "descriptions": "Take to the air in a game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards.  In Harry Potter: Quidditch World Cup, you'll experience the full complexity and exciting challenge of Quidditch, whichTake to the air in a game that allows players to fully experience the magical speed, power, and competition of Quidditch, the favorite sport of witches and wizards.  In Harry Potter: Quidditch World Cup, you'll experience the full complexity and exciting challenge of Quidditch, which involves two teams of seven players who fly on broomsticks, playing four balls simultaneously.  You control every position on a team, including three Chasers who try to score with the Quaffle, two Beaters who control the dangerous Bludgers, the Keeper who protects the goal, and the Seeker who chases the elusive Golden Snitch that must be caught to end the match.  … Expand"}, {"name": "NBA Jam", "details_link": "https://www.metacritic.com/game/xbox/nba-jam", "publisher": "Acclaim", "release_date": "Sep 23 2003", "developers": ["Acclaim"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/03eed885a9853fe13d1763d65262d167-98.jpg", "descriptions": "The popular granddaddy of arcade-style basketball is back.  NBA Jam brings the supercharged, \"in-your-face\" highlights of NBA play to life with over-the-top, thrilling three-on-three basketball.  Perform monster dunks and alley-oops and shoot from valuable hotspots to catchThe popular granddaddy of arcade-style basketball is back.  NBA Jam brings the supercharged, \"in-your-face\" highlights of NBA play to life with over-the-top, thrilling three-on-three basketball.  Perform monster dunks and alley-oops and shoot from valuable hotspots to catch \"on-fire\" and obliterate the competition.  You can choose from all 29 current NBA teams, players, and arenas and even outdoor playground courts like Rucker Park and LA's Venice Beach.  With no fouls to slow down the game, be as rough and flashy as you can be.… Expand"}, {"name": "Line of Sight: Vietnam", "details_link": "https://www.metacritic.com/game/pc/line-of-sight-vietnam", "publisher": "Atari", "release_date": "Mar  5 2003", "developers": ["Nfusion"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Arcade"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/ac4bde45503406da7fb11f49e1b505fb-98.jpg", "descriptions": "In 1968 the U.S. Army assigned a young sniper to the 5th Special Forces compound in Nha Tong, Vietnam. His mission: disrupt the enemy?s command structure, scout Viet Cong positions, and ambush the enemy in the dead of night. For him, success depended on a rifle, a target, and a clear Line ofIn 1968 the U.S. Army assigned a young sniper to the 5th Special Forces compound in Nha Tong, Vietnam. His mission: disrupt the enemy?s command structure, scout Viet Cong positions, and ambush the enemy in the dead of night. For him, success depended on a rifle, a target, and a clear Line of Sight.In LINE OF SIGHT: VIETNAM your job is to locate elusive enemy soldiers and pick them off one-by-one. Whether patiently waiting for the enemy to show himself or delivering a pre-emptive strike, the method is the same - be quick, be quiet, and be careful. That's what will get you home alive. Thick vegetation in fully detailed environments provide cover for you... or the enemy. Select the right weapon for the job from over 12 authentic firearms. Face 12 missions alone or play cooperatively in multiplayer games. [Infogrames]… Expand"}, {"name": "Driven", "details_link": "https://www.metacritic.com/game/game-boy-advance/driven", "publisher": "Bam Entertainment", "release_date": "Nov 28 2001", "developers": ["Crawfish Interactive"], "platforms": ["PlayStation 2", "Game Boy Advance"], "genres": ["Driving", "Racing", "Formula One"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/845772978d18fe5a7276f82a613eea30-98.jpg", "descriptions": "The real fun of Driven is that it is so easy to play and yet so strategic in execution."}, {"name": "Batman: Vengeance", "details_link": "https://www.metacritic.com/game/playstation-2/batman-vengeance", "publisher": "Ubisoft", "release_date": "Oct 15 2001", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/d49c8fa31e7272dbfe14e4e12ea26fc9-98.jpg", "descriptions": "Become Batman with blistering martial arts combos, over 500 unique animated moves, and a multi-functional cape with its own A.I.  Wield such goodies as Batarangs, Batgrapples, Flash Bombs, Remote Charges, Batcuffs, Nets, the Batlauncher, Batscope, and more.  [Ubi Soft]"}, {"name": "Starship Troopers: Terran Ascendancy", "details_link": "https://www.metacritic.com/game/pc/starship-troopers-terran-ascendancy", "publisher": "MicroProse", "release_date": "Oct 23 2000", "developers": ["Blue Tongue Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Strategy", "Real-Time", "Shooter", "First-Person", "Sci-Fi", "Tactics", "Sci-Fi"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/972d9b9d0707f7943b8e2c6a2386218d-98.jpg", "descriptions": "Lead a squad of heavily armored, over-the-top troopers on a series of in-your-face, real-time battles against vicious bug battalions. Call in air strikes, capture prisoners, and nuke bug holes. It's survival of the fittest and the last one standing wins. Answer the call and defend yourLead a squad of heavily armored, over-the-top troopers on a series of in-your-face, real-time battles against vicious bug battalions. Call in air strikes, capture prisoners, and nuke bug holes. It's survival of the fittest and the last one standing wins. Answer the call and defend your planet!  [Microprose]… Expand"}, {"name": "Break 'Em All", "details_link": "https://www.metacritic.com/game/ds/break-em-all", "publisher": "D3Publisher", "release_date": "Jun 20 2006", "developers": ["Warashi"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/369924a56c26297760e164a368f232da-98.jpg", "descriptions": "Jam packed with levels ranging from the super simple to mensa difficult, Break'em All offers classic arcade puzzle solving action as players fight their way through multiple levels and out-duel challenging bosses. Three unique gameplay modes such as Tokoton, Quest and Survival offerJam packed with levels ranging from the super simple to mensa difficult, Break'em All offers classic arcade puzzle solving action as players fight their way through multiple levels and out-duel challenging bosses. Three unique gameplay modes such as Tokoton, Quest and Survival offer compelling single player action or multiplayer games for 2-8 players via the wireless feature for Nintendo DS. Players will control their paddle with pin-point accuracy using the touch pad and stylus and select from diverse bonus powers to power-up their ball. [D3]… Expand"}, {"name": "The Simpsons Game", "details_link": "https://www.metacritic.com/game/playstation-2/the-simpsons-game", "publisher": "EA Games", "release_date": "Oct 30 2007", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/f9a60553b86be13a10f9ad916584b08a-98.jpg", "descriptions": "The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart,The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart, and Lisa use exciting, all-new powers to save the world from rising chaos. To help the Simpsons, gamers at home must journey through all of Springfield (as well as vast worlds beyond!), vanquish an amazing array of villains, and fight their way through parodies of popular games. [Electronic Arts]… Expand"}, {"name": "MotoGP 08", "details_link": "https://www.metacritic.com/game/xbox-360/motogp-08", "publisher": "Capcom", "release_date": "Oct 28 2008", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/a3c87a29f67a48994c09c1fd80caaa39-98.jpg", "descriptions": "The official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GPThe official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GP class bikes. You'll also get an opportunity to race in teh new circuits of Indianapolis in the US an drace at night in Qatar. Be successful and you'll earn rider points that you can then use to upgrade your bike. [Capcom]… Expand"}, {"name": "Justice League Heroes", "details_link": "https://www.metacritic.com/game/playstation-2/justice-league-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 17 2006", "developers": ["Snowblind Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/96496ff45f99c87ccc24cf523acf4498-98.jpg", "descriptions": "Justice League Heroes is an action adventure game with role-playing customization featuring Superman, Batman, Green Lantern, The Flash, Wonder Woman, Martian Manhunter, Zatanna and other unlockable Justice League super heroes. Each hero possesses an array of character-specific, upgradeableJustice League Heroes is an action adventure game with role-playing customization featuring Superman, Batman, Green Lantern, The Flash, Wonder Woman, Martian Manhunter, Zatanna and other unlockable Justice League super heroes. Each hero possesses an array of character-specific, upgradeable superpowers resulting in unique controls and fighting-styles. Engaging in one-to-two player cooperative combat, gamers are be able to customize and master these superpowers as they travel through interactive and destructible environments spanning the farthest corners of the universe. [Eidos Interactive]… Expand"}, {"name": "The Past Within", "details_link": "https://www.metacritic.com/game/pc/the-past-within", "publisher": "Rusty Lake", "release_date": "Nov  2 2022", "developers": ["Rusty Lake"], "platforms": ["iPhone/iPad", "PC"], "num_players": "2 ", "genres": ["Adventure", "Point-and-Click"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/09afe150b802650adfef965dc2fabcfa-98.jpg", "descriptions": "The past and future cannot be explored alone! Team up with a friend and piece together the mysteries surrounding Albert Vanderboom. Communicate what you see around you to help one another solve various puzzles and explore the worlds from different perspectives!The Past Within is aThe past and future cannot be explored alone! Team up with a friend and piece together the mysteries surrounding Albert Vanderboom. Communicate what you see around you to help one another solve various puzzles and explore the worlds from different perspectives!The Past Within is a multiplayer point-and-click adventure by the creators of the Cube Escape & Rusty Lake series.… Expand"}, {"name": "Biomutant", "details_link": "https://www.metacritic.com/game/xbox-one/biomutant", "publisher": "THQ Nordic", "release_date": "May 25 2021", "developers": ["Experiment 101"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/36c386ce835c3e9749e02d4533a6f270-98.jpg", "descriptions": "Biomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action. Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruiningBiomutant is an open-word, post-apocalyptic Kung-Fu fable RPG, with a unique martial arts styled combat system allowing you to mix melee, shooting and mutant ability action. Your actions play a major part in the unfolding of a story where End is coming to the New World. A plague is ruining the land and the Tree-of-Life is bleeding death from its roots. The Tribes stand divided, in need of someone strong enough to unite them or bring them all down...\rAlthough you are guided through the world by a Storyteller that narrates every step of your journey, it's your actions and choices that'll decide how your story of survival ends.… Expand"}, {"name": "Chronicle of Innsmouth: Mountains of Madness", "details_link": "https://www.metacritic.com/game/pc/chronicle-of-innsmouth-mountains-of-madness", "publisher": "Psychodev", "release_date": "Mar 23 2021", "developers": ["Psychodev"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/172d195961c481995bc8ec305d453fb4-98.jpg", "descriptions": "The second chapter in the \"Chronicle of Innsmouth\" saga. A team of scientists are attempting to be the first to reach a previously unknown chain of mountains higher than the Himalayas. Within a huge cavern they discover the alien bodies of hithertofore unknown creatures frozen in the ice walls."}, {"name": "Citizens Unite!: Earth x Space", "details_link": "https://www.metacritic.com/game/switch/citizens-unite!-earth-x-space", "publisher": "Kemco", "release_date": "Jan 28 2021", "developers": ["Eden Industries"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7db6a7116e8f30ee59d98773e3c9f2e5-98.jpg", "descriptions": "Citizens Unite! is a comical adventure RPG which includes both Citizens of Earth and Citizens of Space. It’s two games in one for double the fun. Citizens of Earth tells the story of the Vice President of the World who realizes that many strange calamities are cropping up around the Earth.Citizens Unite! is a comical adventure RPG which includes both Citizens of Earth and Citizens of Space. It’s two games in one for double the fun. Citizens of Earth tells the story of the Vice President of the World who realizes that many strange calamities are cropping up around the Earth. By joining forces with its unique Citizens, their investigation into the mysterious disappearance of the local coffee shop is only the beginning of their globe-trotting adventure. In Citizens of Space, the Earth has gone missing! And it’s up to the Ambassador from Earth to lead a new cast of colorful Citizens on a journey around the galaxy in search of the missing Earth. On top of that, Citizens Unite! includes brand-new elements that can be enjoyed by going back and forth between the two titles, with your actions in one game influencing the other. A true ending that unites the stories of the two games awaits players who play through both games and the new content!… Expand"}, {"name": "Root Letter", "details_link": "https://www.metacritic.com/game/playstation-4/root-letter", "publisher": "PQube", "release_date": "Nov  8 2016", "developers": ["Kadokawa"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/748e938a0b58d4f39ef753212d99177f-98.jpg", "descriptions": "Root Letter is the first in a new Kadokawa Game Mystery series — a collection of Visual Novels with exceptionally high production values. Set in Shimane prefecture — a place rich in history, culture and natural beauty — Root Letter revolves around the mystery of Fumino Aya, your old highRoot Letter is the first in a new Kadokawa Game Mystery series — a collection of Visual Novels with exceptionally high production values. Set in Shimane prefecture — a place rich in history, culture and natural beauty — Root Letter revolves around the mystery of Fumino Aya, your old high school pen friend who went missing 15 years ago.… Expand"}, {"name": "Lord of Magna: Maiden Heaven", "details_link": "https://www.metacritic.com/game/3ds/lord-of-magna-maiden-heaven", "publisher": "XSEED Games", "release_date": "Jun  2 2015", "developers": ["Marvelous Inc."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Fantasy"], "meta_score": 68, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/29f13535850db335fe537571fd9cd9bc-98.jpg", "descriptions": "Residing on the outskirts of town as the proprietor of a quiet, rustic inn, Luchs has lived through much of his life proudly clinging to a code of honour passed down from father to son for generations:\r \"When our cherished guests finally arrive, think of them as nothing less thanResiding on the outskirts of town as the proprietor of a quiet, rustic inn, Luchs has lived through much of his life proudly clinging to a code of honour passed down from father to son for generations:\r \"When our cherished guests finally arrive, think of them as nothing less than family.\"\r Unfortunately, the inn has not yet had even a single guest since its foundation, leaving Luchs no choice but to excavate and sell crystals - the islands most valuable fuel source - in order to make ends meet. It is during one such routine excavation that he happens upon a beautiful maiden encased inside a massive crystal, and her abrupt awakening triggers a series of unexpected events that include foul fiends, astonishing abilities, and miraculous mysteries...\r Features:\r-Seven heroines, seven stories - each of the seven heroines who come to inhabit the inn have their own stories to tell, and building relationships with them will unlock new, specialised attacks to aid in combat when they join the battle party.\r-Strategic combat makes every turn count - \"Bowl\" over as many enemies with a single strike as possible, challenging players to line up melee, ranged and magical attacks so frontline enemies are knocked into others for maximum collateral damage.\r-Craft your way to new skills  in addition to unlocking new abilities, participating in Free Battles and registering for Street Pass can provide rare crafting items for use in creating new skills to help turn the tides of battle.\r-Adjustable difficulty levels and more - players can toggle among Easy, Normal and Hard difficulties, use the Fast Forward feature to speed up combat as desired, or relive fond memories via in-game movie and art galleries.… Expand"}, {"name": "Scribblenauts Unmasked: A DC Comics Adventure", "details_link": "https://www.metacritic.com/game/pc/scribblenauts-unmasked-a-dc-comics-adventure", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 24 2013", "developers": ["5TH Cell"], "platforms": ["3DS", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/4b9b187bf728f9585594cb39c4c68f65-98.jpg", "descriptions": "Challenge your imagination as you battle the mightiest villains in an exciting and action-filled adventure through GOTHAM CITY, METROPOLIS, ATLANTIS and other iconic locales from the DC Comics universe.  Enjoy endless replayability with new, dynamic puzzles that feature a different missionChallenge your imagination as you battle the mightiest villains in an exciting and action-filled adventure through GOTHAM CITY, METROPOLIS, ATLANTIS and other iconic locales from the DC Comics universe.  Enjoy endless replayability with new, dynamic puzzles that feature a different mission every time you play. \r\rBring out your inner super hero (or villain!) with the all-new Super Hero Creator by crafting completely original objects out of parts of existing DC Comics characters. Then assign unique properties to your creations and use them to solve puzzles, or share them online with friends - which they can use in game or further modify as they like.… Expand"}, {"name": "The Occupation", "details_link": "https://www.metacritic.com/game/pc/the-occupation", "publisher": "Humble", "release_date": "Mar  5 2019", "developers": ["White Paper Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 68, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/0/0d1c15997bf8765cc97f2a69a16f894b-98.jpg", "descriptions": "It's 1987 in North West England; A time of 80's British pop, grand architecture and political unrest. An explosion has triggered a controversial act which threatens to erode civil liberties of the population to be rushed into place. You are tasked with investigating and questioning people onIt's 1987 in North West England; A time of 80's British pop, grand architecture and political unrest. An explosion has triggered a controversial act which threatens to erode civil liberties of the population to be rushed into place. You are tasked with investigating and questioning people on their actions from a tumultuous night which resulted in the loss of many lives. Each person has a different account of the night's event and you must use the tools at your disposal to get the results you need for your investigation.\r Will you take the most direct route at the risk of getting caught, or plan your approach carefully whilst precious time ticks by? Events happen in real-time and you must make decisions based on the evidence. You are the reporter. You decide the narrative.… Expand"}, {"name": "Digimon World: Dawn", "details_link": "https://www.metacritic.com/game/ds/digimon-world-dawn", "publisher": "Namco Bandai Games", "release_date": "Sep 18 2007", "developers": ["Bec", "Bandai Namco Games"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Trainer"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/ba4dbbf76400dac7c7bd8a3611f3edab-98.jpg", "descriptions": "A huge earthquake has stricken the Sunshine and Dark Moon districts, damaging the access points to the Digital World and causing many Digimon to mysteriously devolve into Digi-Eggs. In Dawn, rumors have spread that the Night Crow Team, from Dark Moon, was responsible for the incident.A huge earthquake has stricken the Sunshine and Dark Moon districts, damaging the access points to the Digital World and causing many Digimon to mysteriously devolve into Digi-Eggs. In Dawn, rumors have spread that the Night Crow Team, from Dark Moon, was responsible for the incident.  However, a conflicting report surfaces in Dusk claiming the responsibility falls on the Light Fang team from the Sunshine district.  With both sides accusing the other, players take the role of an opposing tamer to investigate and uncover the truth behind the dangerous tremors. In Digimon World Dawn and Dusk, players are given two different perspectives of the catastrophe through the eyes of opposing tamers all the while collecting and evolving more than 400 Digimon from eight different species. Additionally, each game contains rare and unique Digimon that can only be obtained through wireless communication with the other version. New and improved Digifarms can help foster abilities and boost Digimon stats that can help gain an edge over enemies. [Namco Bandai Games]… Expand"}, {"name": "SpongeBob SquarePants: The Cosmic Shake", "details_link": "https://www.metacritic.com/game/xbox-one/spongebob-squarepants-the-cosmic-shake", "publisher": "THQ Nordic", "release_date": "Jan 31 2023", "developers": ["Purple Lamp Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 68, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/016c31984355654c266a12fa1f1d8c79-98.jpg", "descriptions": "Wish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that'sWish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that's nothing everyone's favorite sponge can't handle - with the right cosmic costume! Everybody do the Cosmic Shake!Features* Unlock classic and new platforming skills like the Fishhook Swing and Karate Kick* Don more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar* Travel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom* Experience all the buddy movie banter with SpongeBob's permanent companion Balloon-Patrick* Meet all your favorite Bikini Bottomites from the series, voiced by their original actors* Enjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory… Expand"}, {"name": "Tesla Effect: A Tex Murphy Adventure", "details_link": "https://www.metacritic.com/game/pc/tesla-effect-a-tex-murphy-adventure", "publisher": "Atlus", "release_date": "May  7 2014", "developers": ["Big Finish Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 68, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/65deaf6c7de9c50df53f3a985556d372-98.jpg", "descriptions": "Tesla Effect revives the glory years of PC adventure games with a return to the full-motion video (FMV) game genre. Known for its sardonic humor, Tesla Effect will be the first Tex Murphy game since 1998. ATLUS and Big Finish games will release Tesla Effect on Steam and other PC platformsTesla Effect revives the glory years of PC adventure games with a return to the full-motion video (FMV) game genre. Known for its sardonic humor, Tesla Effect will be the first Tex Murphy game since 1998. ATLUS and Big Finish games will release Tesla Effect on Steam and other PC platforms worldwide in early 2014.… Expand"}, {"name": "Game Dev Tycoon", "details_link": "https://www.metacritic.com/game/pc/game-dev-tycoon", "publisher": "Greenheart Games", "release_date": "Apr 28 2013", "developers": ["Greenheart Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/5b3c89a01c879bb78aabe2ec4bfb8608-98.jpg", "descriptions": "Game Dev Tycoon is a business simulation game in which you replay the history of the gaming industry by starting your own video game development company in the 80s. Create best selling games. Research new technologies and invent new game types. Become the leader of the market and gainGame Dev Tycoon is a business simulation game in which you replay the history of the gaming industry by starting your own video game development company in the 80s. Create best selling games. Research new technologies and invent new game types. Become the leader of the market and gain worldwide fans.… Expand"}, {"name": "Lost Magic", "details_link": "https://www.metacritic.com/game/ds/lost-magic", "publisher": "Ubisoft", "release_date": "Apr 25 2006", "developers": ["Taito Corporation"], "platforms": "DS", "num_players": "2  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/4abd5fcbb4c9e40a2d9ccac67d351467-98.jpg", "descriptions": "In LOSTMAGIC, designed by renowned art director Yoshiharu Sato, peace in the world is challenged by a new evil force. The only hope lies with the wizard Isaac and the seven magic wands left behind by the creator. Monsters wield unimaginable power in this realm, and as Issac, the player willIn LOSTMAGIC, designed by renowned art director Yoshiharu Sato, peace in the world is challenged by a new evil force. The only hope lies with the wizard Isaac and the seven magic wands left behind by the creator. Monsters wield unimaginable power in this realm, and as Issac, the player will use the stylus to unleash magic spells and command numerous monster squads in magical battles. Cast Spells With the Stylus – Your stylus becomes your magic wand. Use different motions to unleash your magic. Evolving Magic System – Players can combine up to three single spells to create more than 350 magic combinations using a symbol system exclusive to the DS. Collect and Command Monsters – Learn to use each monster's special skill to gain the advantage in battle. Use the Stylus to Open Up a New Frontier in RPGs – Experience strategy like never before. LOSTMAGIC’s innovative RTS-type RPG makes full use of the unique capabilities of the DS. Control your units directly on-screen using a point-and-click interface that PC strategy gamers have enjoyed for years. Challenge Others via Nintendo Wi-Fi connectivity– Create new characters and challenge friends over a Wi-Fi connection. In Dueling mode, players can test their magic casting skills and strategies against each other. [Ubisoft]… Expand"}, {"name": "Smash Court Tennis 3", "details_link": "https://www.metacritic.com/game/psp/smash-court-tennis-3", "publisher": "Namco Bandai Games America", "release_date": "Jul 16 2007", "developers": ["Namco Bandai Games America", "Namco Bandai Games"], "platforms": ["Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 68, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/cbbe96f3249c48b137fdb1a9cc713939-98.jpg", "descriptions": "It'll be game, set and match as players compete as or against 16 of their favorite Pro-Tennis stars including #1 ranked Roger Federer and 2006 French Open champions Rafael Nadal and Justine Henin. Smash Court Tennis 3 arms players with twice as many customizable items than its predecessorIt'll be game, set and match as players compete as or against 16 of their favorite Pro-Tennis stars including #1 ranked Roger Federer and 2006 French Open champions Rafael Nadal and Justine Henin. Smash Court Tennis 3 arms players with twice as many customizable items than its predecessor including racquets, sportswear and more as they compete to be #1 in the world. Perfect a devastating array of strokes from a selection of top ranked and promising professional tennis stars, each of whom are modeled after their real-life counterparts. Own the court by developing and acquiring new skills such as increasing your hit speed or serve accuracy. Mental elements also play into how characters act and look, so stay focused on your game. Test your skills in various gameplay modes including Arcade, Exhibition, and Pro Tour Mode. Want a quick hiatus from the circuit? Try one of the imaginative and addicting mini games. Smash Court Tennis 3 boasts a game sharing system, where players can go head-to-head with a friend in versus mode using a single UMD. Intensify bragging rights as local rankings add to the fun of wireless play via Ad Hoc mode. [Namco Bandai Games]… Expand"}, {"name": "Batora: Lost Haven", "details_link": "https://www.metacritic.com/game/pc/batora-lost-haven", "publisher": "Team17", "release_date": "Oct 20 2022", "developers": ["Stormind Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/f586b7c183d0828d349be61338fa57ad-98.jpg", "descriptions": "Avril never thought she'd have to step up and be a hero but after a mysterious and devastating event, her world was flipped upside down. With her homeworld on the brink of destruction, Avril has been gifted extraordinary powers and will have to journey across the universe to uncover ancientAvril never thought she'd have to step up and be a hero but after a mysterious and devastating event, her world was flipped upside down. With her homeworld on the brink of destruction, Avril has been gifted extraordinary powers and will have to journey across the universe to uncover ancient secrets and reckon with a series of life-changing decisions.Embark on an epic adventure to save Earth in this interplanetary action RPG. Harness the ancient powers of Sun and Moon to take on a variety of unique enemies while solving diverse puzzles and exploring stunning sci-fi worlds, each with its own curious stories, inhabitants, and mysteries.… Expand"}, {"name": "The Company Man", "details_link": "https://www.metacritic.com/game/switch/the-company-man", "publisher": "Leoful", "release_date": "Jan 21 2022", "developers": ["Forust"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/18c042e0313a644755800109b5013c80-98.jpg", "descriptions": "Battle the corporate machine in The Company Man! A 2D action-adventure where you can hit your crazy co-workers with a keyboard and shoot your evil bosses with emails. Survive the struggles of working life and fulfill your lifelong quest to be CEO!Jim finally graduates from university,Battle the corporate machine in The Company Man! A 2D action-adventure where you can hit your crazy co-workers with a keyboard and shoot your evil bosses with emails. Survive the struggles of working life and fulfill your lifelong quest to be CEO!Jim finally graduates from university, ready to launch his epic career in the Good Water Company. But things quickly spiral into insanity as he finds himself fighting to keep his job.Drink coffee to survive the tortures of working life. Learn the quirks of each department, from the air-conditioned ice lands of accounting to the mountains of paperwork in human resources, beating every floor on your journey to the top!… Expand"}, {"name": "Where the Heart Leads", "details_link": "https://www.metacritic.com/game/playstation-4/where-the-heart-leads", "publisher": "Armature Studio", "release_date": "Jul 13 2021", "developers": ["Armature Studio"], "platforms": ["PlayStation 5", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/01b9dd653aecaa4c0e1073a821617df6-98.jpg", "descriptions": "On the kind of stormy night that can change a person’s destiny, an enormous sinkhole opens in the middle of Whit Anderson’s farm. Braving the rumbling thunder and the driving rain, Casey—their curious Golden Retriever—ventures too close to the gaping maw and tumbles in. Desperate to saveOn the kind of stormy night that can change a person’s destiny, an enormous sinkhole opens in the middle of Whit Anderson’s farm. Braving the rumbling thunder and the driving rain, Casey—their curious Golden Retriever—ventures too close to the gaping maw and tumbles in. Desperate to save her, Whit descends into the darkness, and emerges in a realm beyond his imagining. In this strange world, constantly shifting like the stops and starts of a dream, Whit bears witness to the story of his life and gains the power to change it.\r… Expand"}, {"name": "Sniper Elite VR", "details_link": "https://www.metacritic.com/game/pc/sniper-elite-vr", "publisher": "Rebellion", "release_date": "Jul  8 2021", "developers": ["Rebellion", "Just Add Water", "Coatsink Software"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/15d69b2ea54dd4ff02a6c4fe6f80152a-98.jpg", "descriptions": "A brand new addition to Rebellion's multi-million selling Sniper Elite series. You will experience a powerful World War II story through the eyes of an Italian Partisan, rising with your brothers and sisters to protect your homeland from the fascist forces that threaten to destroy your homeland."}, {"name": "Darius Cozmic Collection: Console", "details_link": "https://www.metacritic.com/game/playstation-4/darius-cozmic-collection-console", "publisher": "ININ Games", "release_date": "Jun 16 2020", "developers": ["M2"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/5d0745255bf302217523c48f1c7748ac-98.jpg", "descriptions": "The Darius Cozmic Collection Console contains 6 legendary console titles in a total of 9 versions:\r DARIUS II (Mega Drive JP version)\r\n  SAGAIA (Genesis version)\r\n  SAGAIA (Master System EU version)\r\n  DARIUS TWIN (Super Famicom JP version)\r\n  DARIUS TWIN (Super NES US version)The Darius Cozmic Collection Console contains 6 legendary console titles in a total of 9 versions:\r DARIUS II (Mega Drive JP version)\r  SAGAIA (Genesis version)\r  SAGAIA (Master System EU version)\r  DARIUS TWIN (Super Famicom JP version)\r  DARIUS TWIN (Super NES US version)\r  DARIUS FORCE (Super Famicom JP version)\r  SUPER NOVA (Super NES US version)\r  DARIUS ALPHA (PC Engine JP version)\r  DARIUS PLUS (PC Engine JP version)\r… Expand"}, {"name": "Close to the Sun", "details_link": "https://www.metacritic.com/game/playstation-4/close-to-the-sun", "publisher": "Wired Productions", "release_date": "Oct 29 2019", "developers": ["Storm in a Teacup"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 68, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/a5992bf78963c55cefa6e403142ae856-98.jpg", "descriptions": "It’s 1897. Deep in international waters, the Helios stands still. An unbound utopia for scientific research, born of Nikola Tesla’s vision. Journalist Rose Archer steps aboard in search of her sister Ada, quickly to discover not all is as it seems. The stench of rotting flesh lingers in theIt’s 1897. Deep in international waters, the Helios stands still. An unbound utopia for scientific research, born of Nikola Tesla’s vision. Journalist Rose Archer steps aboard in search of her sister Ada, quickly to discover not all is as it seems. The stench of rotting flesh lingers in the air. Silence. A single word is painted across the entrance… QUARANTINE!… Expand"}, {"name": "Marvel's Guardians of the Galaxy - Episode 4: Who Needs You", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-guardians-of-the-galaxy---episode-4-who-needs-you", "publisher": "Telltale Games", "release_date": "Oct 10 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-partIn the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure.… Expand"}, {"name": "iO", "details_link": "https://www.metacritic.com/game/xbox-one/io", "publisher": "Gamious", "release_date": "Feb 14 2017", "developers": ["Gamious"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/e9e9c74fd2ac92def569db15f8efc325-98.jpg", "descriptions": "iO is an abstract Puzzle Platformer about size, speed, mass and momentum. Change your size, weight and speed in order to solve some of the trickiest puzzles. Toy with the laws of physics, reach your destination as quick as possible and grab that gold medal as your reward!"}, {"name": "Earth's Dawn", "details_link": "https://www.metacritic.com/game/playstation-4/earths-dawn", "publisher": "Rising Star Games", "release_date": "Nov  1 2016", "developers": ["One or Eight"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/74494ddfb8e2d2753bdba943ca4626ad-98.jpg", "descriptions": "Earth’s Dawn is looming and the fate of the planet hangs in the balance. Become a member of A.N.T.I. — a squad of super-human soldiers powered by alien technology — and fight to reclaim Earth from the alien invasion known as E.B.E. [Playstation.com]"}, {"name": "Age of Empires II: HD Edition", "details_link": "https://www.metacritic.com/game/pc/age-of-empires-ii-hd-edition", "publisher": "Microsoft Game Studios", "release_date": "Apr  9 2013", "developers": ["Ensemble Studios", "Hidden Path Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Real-Time", "Compilation", "Historic", "Command"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/a5618cbb062455e10a860e00091e487a-98.jpg", "descriptions": "In Age of Empires II: HD Edition, fans of the original game and new players alike will fall in love with the classic Age of Empires II experience. Explore all the original single player campaigns from both Age of Kings and The Conquerors expansion, choose from 18 civilizations spanning overIn Age of Empires II: HD Edition, fans of the original game and new players alike will fall in love with the classic Age of Empires II experience. Explore all the original single player campaigns from both Age of Kings and The Conquerors expansion, choose from 18 civilizations spanning over a thousand years of history, and head online to challenge other Steam players in your quest for world domination throughout the ages. Originally developed by Ensemble Studios and reimagined in high definition by Hidden Path Entertainment, Microsoft Studios is proud to bring Age of Empires II: HD Edition to Steam!… Expand"}, {"name": "Enslaved: Odyssey to the West - Pigsy's Perfect 10", "details_link": "https://www.metacritic.com/game/xbox-360/enslaved-odyssey-to-the-west---pigsys-perfect-10", "publisher": "Namco Bandai Games", "release_date": "Nov 23 2010", "developers": ["Ninja Theory"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/c9032d58779041c22c2c60786422c04e-98.jpg", "descriptions": "Pigsy, the comical porcine character known for his one-line zingers and questionable hygiene, finally gets his time in the spotlight. The Titan Graveyard is a lonely place and Pigsy really needs some companionship beyond the mechs that roam the area. He dreams of the perfect woman andPigsy, the comical porcine character known for his one-line zingers and questionable hygiene, finally gets his time in the spotlight. The Titan Graveyard is a lonely place and Pigsy really needs some companionship beyond the mechs that roam the area. He dreams of the perfect woman and embarks on a mission to build one from scratch using scrap parts he finds around the junkyard. In contrast to the main game which features strong, capable Monkey as the playable character, Pigsy is much more of a lover than a fighter. Pigsy's gameplay will have a completely different gameplay dynamic, with a focus on stealth and sharp-shooting. He has plenty of tricks up his sleeves including a far-reaching hookshot, trusty sniper rifle, various grenades and devices, Trouble Vision eye piece and the aid of his trusty mechanical sidekick Truffles.… Expand"}, {"name": "Magnetica", "details_link": "https://www.metacritic.com/game/ds/magnetica", "publisher": "Nintendo", "release_date": "Jun  5 2006", "developers": ["Mitchell"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/e1e40c60b9bdd4f736b48e94c6b434e6-98.jpg", "descriptions": "(Also known as \"Actionloop\" and  \"Puzzleloop\") Marbles are exclusively controlled by the stylus in this title that satisfies even the strongest puzzle addiction. Marbles are rolling relentlessly down a twisted track toward you. Stop them by launching launch new marbles with your stylus. When(Also known as \"Actionloop\" and  \"Puzzleloop\") Marbles are exclusively controlled by the stylus in this title that satisfies even the strongest puzzle addiction. Marbles are rolling relentlessly down a twisted track toward you. Stop them by launching launch new marbles with your stylus. When three or more like-colored marbles match up, they vanish. Tons of power-ups, multiple tracks and a great multiplayer mode make Magnetica a must for puzzle/action fans. Innovative use of stylus to flick marbles.Ultrarealistic magnetic physics: Launched marbles will curve toward like-colored balls. Three single-player modes: Challenge, Quest and Puzzle. Multiple paths and scads of power-ups and hazards will keep you on your toes. Consult the all-in-one dashboard on your top screen. Show off your Magnetica personalty by battling a friend head-to-head. Single-player items boost your score, slow down or stop time, or reverse the course of the marbles. Versus weaponry includes Ion Clouds (smoke screens you'll have to blow away via the DS mic), Recoils (which block marbles), Black Holes (which suck up launched marbles), Viruses (which deflect marbles) and Gravitons (which alter the path of launched marbles). A seemingly endless array of fresh twists will keep drawing you back to single-player Magnetica. Switches, tracks that pass over or below each other, and moving barriers that deflect marbles will keep you flicking marbles for hours. [Nintendo]… Expand"}, {"name": "Ty the Tasmanian Tiger 3: Night of the Quinkan", "details_link": "https://www.metacritic.com/game/gamecube/ty-the-tasmanian-tiger-3-night-of-the-quinkan", "publisher": "Activision Value", "release_date": "Oct 12 2005", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/6a11551f348d4e8a43bbf9f1ae88dd2d-98.jpg", "descriptions": "TY and his mates face their biggest challenge yet - an otherworldly invasion by an ancient evil known as the Quinkan. With Bush Rescue disbanded, TY begins the challenging task of reforming his team and leading the fight against the dark oppressors. In this next chapter, players will embarkTY and his mates face their biggest challenge yet - an otherworldly invasion by an ancient evil known as the Quinkan. With Bush Rescue disbanded, TY begins the challenging task of reforming his team and leading the fight against the dark oppressors. In this next chapter, players will embark on a series of engaging missions and challenges filled with new and upgradeable weapons - including his trade mark boomerang collection -- and vehicles. TY's new adventures will take him into a shadowy world full of dangerous creatures, and will see him face bigger and badder enemies.… Expand"}, {"name": "Ty the Tasmanian Tiger 3: Night of the Quinkan", "details_link": "https://www.metacritic.com/game/playstation-2/ty-the-tasmanian-tiger-3-night-of-the-quinkan", "publisher": "Activision Value", "release_date": "Oct 12 2005", "developers": ["Krome Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/b91ae6c9d83862b1b84e4fa8c0ab4d6d-98.jpg", "descriptions": "TY and his mates face their biggest challenge yet – an otherworldly invasion by an ancient evil known as the Quinkan. With Bush Rescue disbanded, TY begins the challenging task of reforming his team and leading the fight against the dark oppressors. In this next chapter, players will embarkTY and his mates face their biggest challenge yet – an otherworldly invasion by an ancient evil known as the Quinkan. With Bush Rescue disbanded, TY begins the challenging task of reforming his team and leading the fight against the dark oppressors. In this next chapter, players will embark on a series of engaging missions and challenges filled with new and upgradeable weapons – including his trade mark boomerang collection -- and vehicles. TY’s new adventures will take him into a shadowy world full of dangerous creatures, and will see him face bigger and badder enemies. [Krome]… Expand"}, {"name": "Deadlight", "details_link": "https://www.metacritic.com/game/xbox-360/deadlight", "publisher": "Microsoft Game Studios", "release_date": "Aug  1 2012", "developers": ["Tequila Works"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/15cf52e4d5e2b1e0971f5fef4f05e538-98.jpg", "descriptions": "Deadlight is a cinematic action puzzle platformer from Tequila Works set in the American west coast in an apocalyptic world."}, {"name": "Rocket Arena", "details_link": "https://www.metacritic.com/game/playstation-4/rocket-arena", "publisher": "Electronic Arts", "release_date": "Jul 14 2020", "developers": ["Final Strike Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 68, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/d49321c946f3f7fd97330ee69d4cfc85-98.jpg", "descriptions": "Welcome to a world where the rules are written in rocket fuel. Rockets control everything in Rocket Arena, an explosive 3v3 shooter where you’re never out of the action. Master your hero’s unique rockets and abilities to rule the arena and become a champion."}, {"name": "The Bureau: XCOM Declassified", "details_link": "https://www.metacritic.com/game/xbox-360/the-bureau-xcom-declassified", "publisher": "2K Games", "release_date": "Aug 20 2013", "developers": ["2K Marin"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/775ac4dda957a5f6cba92c6e422e99e2-98.jpg", "descriptions": "It's 1962. John F. Kennedy is the U.S. President and the Cold War has the nation gripped with fear – but a far more viscous and insidious enemy than communism is threatening America. Known only to a scant few, a covet government unit called The Bureau begins investigating and concealing aIt's 1962. John F. Kennedy is the U.S. President and the Cold War has the nation gripped with fear – but a far more viscous and insidious enemy than communism is threatening America. Known only to a scant few, a covet government unit called The Bureau begins investigating and concealing a series of mysterious attacks by an alien enemy. As special agent William Carter, you make the decisions, pull the trigger and lead your squad in a third-person tactical shooter set within a high-stakes, covert war to defend the human race. The Bureau’s mission is clear – survive, adapt and overcome the enemy threat (Heartbreak Ridge-style) to protect the citizens from the truth.  … Expand"}, {"name": "The Falconeer", "details_link": "https://www.metacritic.com/game/pc/the-falconeer", "publisher": "Wired Productions", "release_date": "Nov 10 2020", "developers": ["Tomas Sala"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 68, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/5376d857d25d75a8b09d92fcb2319e08-98.jpg", "descriptions": "Generations of poisonous decisions and treason swirl in the deep, as factions collide. Become the Falconeer and soar through the skies aboard a devastatingly powerful Warbird. Uncover secrets lost to the sea as you join or oppose different factions and clans scattered throughout The GreatGenerations of poisonous decisions and treason swirl in the deep, as factions collide. Become the Falconeer and soar through the skies aboard a devastatingly powerful Warbird. Uncover secrets lost to the sea as you join or oppose different factions and clans scattered throughout The Great Ursee. Take advantage of multiple Falconeer classes with individual stats, weapons and warbirds that can be upgraded through winning battles, completing quests, discovering secrets, or applying Mutagens or Chants. Use ocean thermals and energy to dive, dodge, barrel-roll, and twist to gain an advantage. The Falconeer is an open-world air combat game, featuring fast, brutal aerial dogfights and deep exploration of an incredible fantasy open-world set not only above the clouds, but also amongst the waves and down through the sunken, ocean depths.… Expand"}, {"name": "Hyperdevotion Noire: Goddess Black Heart", "details_link": "https://www.metacritic.com/game/playstation-vita/hyperdevotion-noire-goddess-black-heart", "publisher": "Idea Factory", "release_date": "Feb 24 2015", "developers": ["Sting"], "platforms": ["PC", "PlayStation Vita"], "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 68, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/53ba6a0430b6a4bbc0a09cb20f37f196-98.jpg", "descriptions": "Right before Noire attains her ambition for a united Gamarket under Lastation’s rule, someone cuts off the source of the four CPUs’ powers – their Shares. To save their world, which has been thrust into a state of chaos, the CPUs decide to join forces in order to bring Gamarket togetherRight before Noire attains her ambition for a united Gamarket under Lastation’s rule, someone cuts off the source of the four CPUs’ powers – their Shares. To save their world, which has been thrust into a state of chaos, the CPUs decide to join forces in order to bring Gamarket together under one single, unified banner. [Idea Factory]… Expand"}, {"name": "Earth Defense Force: Insect Armageddon", "details_link": "https://www.metacritic.com/game/xbox-360/earth-defense-force-insect-armageddon", "publisher": "D3Publisher", "release_date": "Jul  1 2011", "developers": ["Vicious Cycle"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/979f825cb26ce36e9c75392dd60c765d-98.jpg", "descriptions": "Taking place in the fictional city of New Detroit, Earth Defense Force: Insect Armageddon is a completely new game developed by Vicious Cycle that takes on the concept of Earth Defense Force 2017 (Japanese Title \"Earth Defense Force 3\" developed by SANDLOT).  Insect ArmageddonTaking place in the fictional city of New Detroit, Earth Defense Force: Insect Armageddon is a completely new game developed by Vicious Cycle that takes on the concept of Earth Defense Force 2017 (Japanese Title \"Earth Defense Force 3\" developed by SANDLOT).  Insect Armageddon continues to follow the rich history of casual fun and addictive gameplay that made the franchise a cult classic.  Insect Armageddon also adds a new aspect to the Earth Defense Force  series that was born in Japan, with additional elements for all EDF soldiers to experience.  The Campaign mode that lets up to three players team up online to battle the insects and aliens across a completely destroyable city.  Every EDF soldier is armed with over 150 weapons and four upgradeable armor sets and engages in nonstop arcade action that is the fastest and deadliest in the series.  In addition, the game also features a six-player Survival mode that pits a human squad against a nonstop onslaught of the largest enemies the aliens have to offer.  New Detroit's giant bug problem is unavoidable, and mankind's last hope lies with the Earth Defense Force to defend the world from the insect swarm, even if it means blowing up the entire city as part of the extermination process.… Expand"}, {"name": "Beyond Blue", "details_link": "https://www.metacritic.com/game/switch/beyond-blue", "publisher": "E-Line Media", "release_date": "Nov 11 2021", "developers": ["E-Line Media"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/8081e1f509150e5bda9ce20724f66f6e-98.jpg", "descriptions": "Set in the near future, Beyond Blue explores the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. Become a part of a newly-formed research team using groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than hasSet in the near future, Beyond Blue explores the mysteries of our ocean through the eyes of Mirai, a deep-sea explorer and scientist. Become a part of a newly-formed research team using groundbreaking technologies to see, hear, and interact with the ocean in a more meaningful way than has ever been attempted.… Expand"}, {"name": "Saturday Morning RPG", "details_link": "https://www.metacritic.com/game/switch/saturday-morning-rpg", "publisher": "Limited Run Games", "release_date": "Apr 26 2018", "developers": ["Joystick Labs", "LLC"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/ef13f2ca09928ad3a7d2984c73a90d5f-98.jpg", "descriptions": "Saturday Morning RPG is an episodic role-playing game set in world heavily inspired by 1980s Saturday morning cartoons. Players take the role of Martin Marty Michael Hall, an average high-school student who has just been granted an incredible power. This power leads him to attract the ire ofSaturday Morning RPG is an episodic role-playing game set in world heavily inspired by 1980s Saturday morning cartoons. Players take the role of Martin Marty Michael Hall, an average high-school student who has just been granted an incredible power. This power leads him to attract the ire of the worlds most notorious villain, Commander Hood.… Expand"}, {"name": "Battlezone: Combat Commander", "details_link": "https://www.metacritic.com/game/pc/battlezone-combat-commander", "publisher": "Rebellion", "release_date": "Mar  1 2018", "developers": ["Big Boat Interactive"], "platforms": "PC", "num_players": "Up to 5 ", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/d578be2e8639b877a8255b74f12f7197-98.jpg", "descriptions": "Battlezone: Combat Commander remasters FPS-RTS classic Battlezone II with new visuals, new achievements, Steam Workshop support and more. The solar system is at war. Take command."}, {"name": "Rollers of the Realm", "details_link": "https://www.metacritic.com/game/pc/rollers-of-the-realm", "publisher": "Atlus Co.", "release_date": "Nov 18 2014", "developers": ["Phantom Compass"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Parlor", "Action", "Pinball"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/3b4f801ef10b87b0e85f764226ec7517-98.jpg", "descriptions": "Rollers of the Realm is set in an era of medieval lands, corrupt kings, and castles of days gone by with a twist: bounce on and attack enemies as a pinball. Your characters are the balls."}, {"name": "Pro Cycling Manager Season 2012: Le Tour de France", "details_link": "https://www.metacritic.com/game/pc/pro-cycling-manager-season-2012-le-tour-de-france", "publisher": "Focus Home Interactive", "release_date": "Jun 22 2012", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Sports", "Alternative", "Individual", "Biking", "Biking"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/7a1cbe3ca4b158b439c562c693f956b6-98.jpg", "descriptions": "Pro Cycling Manager: Season 2012, the definitive PC cycling simulator,\ris back again to thrill cycling and management fans!\r\r\nBecome the head coach, choose from over 80 professional teams and enter\r\nthe legendary Tour de France! Sponsors, riders, contracts, equipment...\r\nyou will have toPro Cycling Manager: Season 2012, the definitive PC cycling simulator,\ris back again to thrill cycling and management fans!\r Become the head coach, choose from over 80 professional teams and enter\rthe legendary Tour de France! Sponsors, riders, contracts, equipment...\ryou will have to manage every aspect of your team to lead it to victory and take\rhome the famed yellow jersey.\r Manage your runners during action-packed races, where only the fi nest strategies\rwill top the incredibly realistic AI. Claim the top step of the podium in the most\rprestigious races in the world, like the Vuelta, the Giro, the Tour of Australia and\rthe granddaddy of them all, the Tour de France. Compete with 20 other team\rmanagers from all over the world in a brand-new multiplayer mode. This year,\rplayers will challenge one another in a persistent world with a schedule to respect,\rwhere every victory counts!… Expand"}, {"name": "JumpStart: Escape From Adventure Island", "details_link": "https://www.metacritic.com/game/wii/jumpstart-escape-from-adventure-island", "publisher": "Knowledge Adventure Inc.", "release_date": "Nov 17 2009", "developers": ["Knowledge Adventure Inc."], "platforms": "Wii", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/ade960e0c0833b8edf840860bf8545d1-98.jpg", "descriptions": "JumpStart Escape from Adventure Island is the second title in the JumpStart series of adventure-based learning games for the Wii."}, {"name": "Little Inferno", "details_link": "https://www.metacritic.com/game/pc/little-inferno", "publisher": "Tomorrow Corporation", "release_date": "Nov 19 2012", "developers": ["Tomorrow Corporation"], "platforms": ["iPhone/iPad", "Switch", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/b68a89427a44763d850e2fbb577d0ec2-98.jpg", "descriptions": "Burn flaming logs, screaming robots, credit cards, batteries, exploding fish, unstable nuclear devices, and tiny galaxies. An adventure that takes place almost entirely in front of a fireplace - about looking up up up out of the chimney, and the cold world just on the other side of the wall.Burn flaming logs, screaming robots, credit cards, batteries, exploding fish, unstable nuclear devices, and tiny galaxies. An adventure that takes place almost entirely in front of a fireplace - about looking up up up out of the chimney, and the cold world just on the other side of the wall. [Tomorrow Corporation]… Expand"}, {"name": "Need for Speed: The Run", "details_link": "https://www.metacritic.com/game/xbox-360/need-for-speed-the-run", "publisher": "Electronic Arts", "release_date": "Nov 15 2011", "developers": ["Black Box", "EA Black Box"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/b7041cb48a5089d4e61d8fe72a646ac6-98.jpg", "descriptions": "Need for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on – and it isn’t just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passesNeed for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on – and it isn’t just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passes and navigate narrow canyons at breakneck speeds. Powered by DICE’s state-of-the-art Frostbite 2 engine, Need for Speed The Run takes the action racing genre to new heights with stunning visuals and car physics that hug the road even at top speeds all built around a gripping storyline. The cars are hot, the racing is intense and the story will have you at the edge of your seat… all the way from the Golden Gate Bridge to the Empire State building.… Expand"}, {"name": "Disney G-Force", "details_link": "https://www.metacritic.com/game/playstation-3/disney-g-force", "publisher": "Disney Interactive Studios", "release_date": "Jul 21 2009", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/5072bd99f844715b87b3295a98f408bc-98.jpg", "descriptions": "G-Force is a fast-paced action-platform game featuring a unique elite team of specially trained guinea pigs that use high-tech gadgets and specialized talents to complete a dangerous government mission. G-Force puts players in control of both Darwin, the guinea pig leader of the covertG-Force is a fast-paced action-platform game featuring a unique elite team of specially trained guinea pigs that use high-tech gadgets and specialized talents to complete a dangerous government mission. G-Force puts players in control of both Darwin, the guinea pig leader of the covert intelligence G-Force squad, and housefly surveillance sidekick, Mooch, as they team up with the other G-Force agents and use their gadgets, stealth mastery and pint-sized teamwork as mankinds only hope to complete a dangerous high-level government mission. G-Force uses innovative gameplay featuring a unique sense of scale, puzzle solving that requires players to manipulate environments and enemies, including diabolical waffle irons among evil household appliances. [Disney Interactive Studios]… Expand"}, {"name": "Spacebase Startopia", "details_link": "https://www.metacritic.com/game/playstation-5/spacebase-startopia", "publisher": "Kalypso", "release_date": "Mar 26 2021", "developers": ["Realmforge Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 68, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/e1f3916daa3ec5181c602762eab87669-98.jpg", "descriptions": "SPACEBASE STARTOPIA is an original mix of economic simulation and empire building strategy paired with classic RTS fights. In addition to the single player Campaign and Skirmish mode, there’s also a competitive and co-op multiplayer mode for up to 4 players. And as if maintaining the 3 SpaceSPACEBASE STARTOPIA is an original mix of economic simulation and empire building strategy paired with classic RTS fights. In addition to the single player Campaign and Skirmish mode, there’s also a competitive and co-op multiplayer mode for up to 4 players. And as if maintaining the 3 Space Station Decks, entertaining the 8 Alien races and defending against invaders were not enough of a challenge, the dynamic narrator AI is not going to mince matters and commentates the events.… Expand"}, {"name": "Gal*Gun Returns", "details_link": "https://www.metacritic.com/game/switch/galgun-returns", "publisher": "PQube", "release_date": "Feb 12 2021", "developers": ["Inti Creates"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/49984744c1f0770c62f1cde43b311f6e-98.jpg", "descriptions": "Gal*Gun is the entertaining story of a young man who becomes \"super popular\" with the opposite sex and is now living the \"unfortunate\" life of having every lady that looks his way confessing their undying love for him. But he must steel himself and fend these would-be lovers off with hisGal*Gun is the entertaining story of a young man who becomes \"super popular\" with the opposite sex and is now living the \"unfortunate\" life of having every lady that looks his way confessing their undying love for him. But he must steel himself and fend these would-be lovers off with his 'special weapon' (known as the Pheromone Shot), as he tries to win the affections of one of the main protagonists. Gal*Gun is the crazy combination of arcade-style shooting action and dating sim that truly has no equal. … Expand"}, {"name": "Zwei: The Arges Adventure", "details_link": "https://www.metacritic.com/game/pc/zwei-the-arges-adventure", "publisher": "XSEED Games", "release_date": "Jan 24 2018", "developers": ["Falcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/90a3832f0c458fa22be020c4bdf331c0-98.jpg", "descriptions": "Filterless fashionista Pipiro and poindextrous punster Pokkle are ordinary step-siblings facing an ordinary day in their ordinary little burg...until a grand theft macguffin occurs and they decide to become unlikely heroes for cash and glory (in that order). This goes about as well as you’dFilterless fashionista Pipiro and poindextrous punster Pokkle are ordinary step-siblings facing an ordinary day in their ordinary little burg...until a grand theft macguffin occurs and they decide to become unlikely heroes for cash and glory (in that order). This goes about as well as you’d expect.\r… Expand"}, {"name": "3D Classics: TwinBee", "details_link": "https://www.metacritic.com/game/3ds/3d-classics-twinbee", "publisher": "Nintendo", "release_date": "Sep 22 2011", "developers": ["Arika"], "platforms": ["PlayStation 4", "Switch", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/4617eac49a18630e8c13243241ee7cc8-98.jpg", "descriptions": "The popular Japanese arcade shooter is now available in 3D. Guide TwinBee as you shoot through the clouds."}, {"name": "Infinite Undiscovery", "details_link": "https://www.metacritic.com/game/xbox-360/infinite-undiscovery", "publisher": "Square Enix", "release_date": "Sep  2 2008", "developers": ["Tri-Ace"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/2ba2d45787a2200c34d9f51096819a75-98.jpg", "descriptions": "In Infinite Undiscovery, players are drawn into a real-time world woven of countless threads where their choices spin untold discoveries. The actions taken by the player with each discovery have a real-time impact on the world. Situational Battles: Players are confronted with a variety ofIn Infinite Undiscovery, players are drawn into a real-time world woven of countless threads where their choices spin untold discoveries. The actions taken by the player with each discovery have a real-time impact on the world. Situational Battles: Players are confronted with a variety of dramatic “situational battles” such as executing a daring escape while a gigantic ogre follows in hot pursuit, or waging battle amidst towering tidal waves. The dynamic environments change and respond in real-time to player commands, creating an entirely new experience never before seen in the genre. A Seamless World and Real-time Action: Combat, exploration, and other actions all take place within the same environment, seamlessly shifting between each game facet. Battles are carried out in real-time, bringing the vibrant fighting sequences of the STAR OCEAN series out of the traditional battle screen into a beautiful and lush environment. [Square Enix]… Expand"}, {"name": "Death Jr. II: Root of Evil", "details_link": "https://www.metacritic.com/game/psp/death-jr-ii-root-of-evil", "publisher": "Konami", "release_date": "Oct 31 2006", "developers": ["Backbone Entertainment"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/4c8ac16bf9571a72ab7abfe9580eb666-98.jpg", "descriptions": "Death Jr. returns to the PSP in an all-new adventure in a spooky tree house of terror. Teaming up for even more firepower, DJ and Pandora will take on a variety of possessed enemies as they progress through an adventure that seamlessly blends smooth platforming, intense combat, complex enemyDeath Jr. returns to the PSP in an all-new adventure in a spooky tree house of terror. Teaming up for even more firepower, DJ and Pandora will take on a variety of possessed enemies as they progress through an adventure that seamlessly blends smooth platforming, intense combat, complex enemy AI and a unique sense of humor. Destroy spirits and enemies with all new upgradable weapons like the C4 Hamster Mark II's, Pandora's Tommy Gun, Cherry Bomb Launcher and the Flaming TP Thrower. [Konami]… Expand"}, {"name": "The Last Blade: Beyond the Destiny", "details_link": "https://www.metacritic.com/game/switch/the-last-blade-beyond-the-destiny", "publisher": "SNK Corporation", "release_date": "Oct 28 2020", "developers": ["Code Mystics Inc.", "SNK Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/3c90b58c77f08f7256cb2ec37752a13a-98.jpg", "descriptions": "Originally released on the NEOGEO POCKET in 2000, \"THE LAST BLADE\" is coming to Nintendo Switch. The popular weapons-based fighting game: THE LAST BLADE, is now available in a special edition. Enjoy intense battles, an epic story, mini-games, and more.\r - The game features a variety ofOriginally released on the NEOGEO POCKET in 2000, \"THE LAST BLADE\" is coming to Nintendo Switch. The popular weapons-based fighting game: THE LAST BLADE, is now available in a special edition. Enjoy intense battles, an epic story, mini-games, and more.\r - The game features a variety of modes, including STORY MODE, SURVIVAL, and TRAINING, in which you can enjoy the story of this series.\r - The game includes two mini-games and power-up scrolls unique to the main game. Play the game to unlock them.\r - You can also play VS battles against other players in tabletop mode or handheld mode. Play epic battles against your friends!\r *The manual included in the game it is from the NEOGEO POCKET Color edition. Therefore, some of the controls may vary on Nintendo Switch.\r… Expand"}, {"name": "Ice Age: Dawn of the Dinosaurs", "details_link": "https://www.metacritic.com/game/xbox-360/ice-age-dawn-of-the-dinosaurs", "publisher": "Activision", "release_date": "Jun 30 2009", "developers": ["Activision"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 68, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/945a213fb6649e3d5bafe16d837f93e4-98.jpg", "descriptions": "Ice Age: Dawn of the Dinosaurs reunites fans with Scrat, Sid, Manny and Diego in an all-new quest based on the upcoming film from Twentieth Century Fox. As the unlikely herd travels across the tundra and beyond, they stumble upon another world - a lush Dinosaur World teeming with jungles,Ice Age: Dawn of the Dinosaurs reunites fans with Scrat, Sid, Manny and Diego in an all-new quest based on the upcoming film from Twentieth Century Fox. As the unlikely herd travels across the tundra and beyond, they stumble upon another world - a lush Dinosaur World teeming with jungles, mysterious plants, fierce dinosaurs, wild new adventures and several new friends. Taking on the role of more than six playable characters, including everyone's favorite Ice Age friends and newly introduced characters, players master their unique skills and abilities across more than 15 action-packed levels. In addition to the expanded features of the single-player gameplay, for the first time in an Ice Age game, players can team up with friends and family in eight competitive multiplayer mini-games. Experience continuously changing gameplay through more than 15 levels - Every level presents new and exciting challenges as players learn and master each character’s abilities in order to defeat enemies, traverse dangerous landscapes, avoid obstacles and escape from perilous situations. [Activision]… Expand"}, {"name": "NBA Live 08", "details_link": "https://www.metacritic.com/game/playstation-2/nba-live-08", "publisher": "EA Sports", "release_date": "Oct  1 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/25f63f97d7063ab5c384f660e817d857-98.jpg", "descriptions": "Taking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay mechanic is mapped to the right analog stick and gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that letTaking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay mechanic is mapped to the right analog stick and gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that let you dominate on the perimeter. Pass the ball inside and win the battle in the post with all-new 'own the paint' post play for the big men down low. Use the new shot-countershot control to string together combos of fakes and shots to fool your defender into committing and create space for the game-defining bucket. NBA Live 08 introduces hot spots, where real NBA shot data is used to illuminate the locations on the floor where your players are most effective. Couple this with all-new signature go-to moves that capture the essence of the NBA's best, and you can now play the game on a console like you see it from the stands. [Electronic Arts]… Expand"}, {"name": "XGRA: Extreme-G Racing Association", "details_link": "https://www.metacritic.com/game/playstation-2/xgra-extreme-g-racing-association", "publisher": "Acclaim", "release_date": "Sep 11 2003", "developers": ["Acclaim Studios Cheltenham"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 68, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/8c93e89381309fcfe994b9c55f69fa55-98.jpg", "descriptions": "In the future racing is faster - much faster. More dangerous - much more dangerous. And it's totally merciless, which means anything goes. Run by the XGRA (the Extreme Gravity Racing Association), this motorized bloodsport throws teams of futuristic bikes and daredevil riders against oneIn the future racing is faster - much faster. More dangerous - much more dangerous. And it's totally merciless, which means anything goes. Run by the XGRA (the Extreme Gravity Racing Association), this motorized bloodsport throws teams of futuristic bikes and daredevil riders against one another through dangerous tracks that crisscross vast and treacherous landscapes pushing all to their limits.... And beyond! [Acclaim]… Expand"}, {"name": "Devil May Cry 2", "details_link": "https://www.metacritic.com/game/playstation-2/devil-may-cry-2", "publisher": "Capcom", "release_date": "Jan 25 2003", "developers": ["Capcom"], "platforms": ["Switch", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/db0810e70de21be6959a5176eaa33575-98.jpg", "descriptions": "Dante is back! Prepare for the next, stylish chapter of Capcom's ultimate action thriller, Devil May Cry. Dante, the mysterious half-man, half-demon action hero is back to battle the legions of the underworld. Sporting trash-taling attitude and rock star good looks, Dante launches into a newDante is back! Prepare for the next, stylish chapter of Capcom's ultimate action thriller, Devil May Cry. Dante, the mysterious half-man, half-demon action hero is back to battle the legions of the underworld. Sporting trash-taling attitude and rock star good looks, Dante launches into a new adventure with twice the environments, twice the graphic sizzle and twice the gameplay of the original. [Capcom]… Expand"}, {"name": "Sea Trader: Rise of Taipan", "details_link": "https://www.metacritic.com/game/game-boy-advance/sea-trader-rise-of-taipan", "publisher": "Jaleco Entertainment", "release_date": "Jan  3 2003", "developers": ["Jaleco Entertainment"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/e7957b77c24d98d98e5c418c447abde2-98.jpg", "descriptions": "It's time to discover new lands on the first ever Game Boy Advance trading game. You'll be the captain of your own ship, with a band of wacky sailors at your command. Become the supreme Sea Trader as you trade in silk, grain, silver, and gold to increase your wealth. Fight off pirates whenIt's time to discover new lands on the first ever Game Boy Advance trading game. You'll be the captain of your own ship, with a band of wacky sailors at your command. Become the supreme Sea Trader as you trade in silk, grain, silver, and gold to increase your wealth. Fight off pirates when they try to steal your goods, or even attack other ships to plunder their spoils. And when you're victorious, carousing is optional.… Expand"}, {"name": "Turok: Evolution", "details_link": "https://www.metacritic.com/game/xbox/turok-evolution", "publisher": "Acclaim", "release_date": "Aug 31 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/e381f140752acb4187add39e959c9763-98.jpg", "descriptions": "Get locked and loaded in an exciting prequel to the Turok series.   Turok: Evolution is an epic adventure set against the backdrop of living jungles, mysterious temples, and deadly dinosaurs.  Battle over 32 types of dinosaurs as Tal'Set, a warrior caught in the midst of a brutal war in theGet locked and loaded in an exciting prequel to the Turok series.   Turok: Evolution is an epic adventure set against the backdrop of living jungles, mysterious temples, and deadly dinosaurs.  Battle over 32 types of dinosaurs as Tal'Set, a warrior caught in the midst of a brutal war in the Lost Land.  Use your arsenal of all-new weapons including Variable Payload Cruise Missiles, Gravity Disruptor beams, and the Swarm Bore.  Soar through the skies on a winged Quetzalcoatlus, or set out on foot on of the lush interactive environments.  Experience an adventure before time.… Expand"}, {"name": "Charge 'N Blast", "details_link": "https://www.metacritic.com/game/dreamcast/charge-n-blast", "publisher": "Xicat Interactive", "release_date": "Feb  7 2001", "developers": ["Xicat Interactive"], "platforms": "Dreamcast", "genres": ["Action", "Shooter", "Rail"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/c1653b9de234b885c4336b8803dfb967-98.jpg", "descriptions": "Charge 'N Blast doesn't have any glaring flaws, but it also doesn't excel in any general category."}, {"name": "Dry Drowning", "details_link": "https://www.metacritic.com/game/pc/dry-drowning", "publisher": "VLG", "release_date": "Aug  2 2019", "developers": ["Studio V"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/136d0632b283375088e2447deeb02a9a-98.jpg", "descriptions": "Dry Drowning is a psychological investigative visual novel set in a futuristic dystopian city. Follow the story of Mordred Foley, unscrupulous private detective haunted by his dark past, and look into a series of macabre serial killings inspired by Greek mythology."}, {"name": "Dead Nation", "details_link": "https://www.metacritic.com/game/playstation-vita/dead-nation", "publisher": "SCEA", "release_date": "Apr 15 2014", "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "genres": ["Action", "Shooter", "Third-Person", "Shoot-'Em-Up", "Modern", "Top-Down"], "meta_score": 68, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/aeb76220bb75da9c035d3d2fd22360db-98.jpg", "descriptions": "Dead Nation features online and offline two-player cooperative play, a lengthy campaign littered with hidden treasures, hugely upgradeable weapons and armor, and tremendous replay value thanks to a host of difficulty levels. The fifth and final difficulty level -- \"Undead\" -- willDead Nation features online and offline two-player cooperative play, a lengthy campaign littered with hidden treasures, hugely upgradeable weapons and armor, and tremendous replay value thanks to a host of difficulty levels. The fifth and final difficulty level -- \"Undead\" -- will leave you breathless!… Expand"}, {"name": "WWE SmackDown vs. Raw 2008", "details_link": "https://www.metacritic.com/game/psp/wwe-smackdown-vs-raw-2008", "publisher": "THQ", "release_date": "Nov 13 2007", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360", "PSP"], "num_players": "1-4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 68, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/1fb89d8d851f5c8cfd6c41dae2c976fe-98.jpg", "descriptions": "WWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and naturalWWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and natural control over their WWE Superstars by using the game's popular analog controls. Realism and strategy are at the forefront, as players now control the amount of pressure they apply to their opponents. In addition, WWE SmackDown! vs. Raw 2008 features a significant Extreme Championship Wrestling (ECW) presence, including a variety of Superstars, arenas and weapons. The game is also packed with significant updates requested by fans, including new rosters, more environmental hotspots, a combined Season and General Manager Mode experience, improved out-of-ring action, enhanced online community support and much more. [THQ]… Expand"}, {"name": "Mass Effect 2: Arrival", "details_link": "https://www.metacritic.com/game/playstation-3/mass-effect-2-arrival", "publisher": "EA Games", "release_date": "Mar 29 2011", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 68, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/399066544b7161393eee0b0d28807e73-98.jpg", "descriptions": "In Mass Effect: Arrival, Commander Shepard is sent to the edge of the galaxy to rescue an undercover operative who may have evidence of an imminent Reaper invasion that has been looming since the very beginning of the series. Returning and playing a prominent role in Mass Effect: Arrival isIn Mass Effect: Arrival, Commander Shepard is sent to the edge of the galaxy to rescue an undercover operative who may have evidence of an imminent Reaper invasion that has been looming since the very beginning of the series. Returning and playing a prominent role in Mass Effect: Arrival is fan favorite Admiral Hackett, who is voiced by legendary science-fiction actor Lance Henriksen (Alien, Terminator).… Expand"}, {"name": "Sniper Ghost Warrior Contracts 2", "details_link": "https://www.metacritic.com/game/playstation-4/sniper-ghost-warrior-contracts-2", "publisher": "CI Games", "release_date": "Jun  4 2021", "developers": ["CI Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/2c2630832fd995964f07260b1009c287-98.jpg", "descriptions": "Sniper Ghost Warrior players have never taken down targets from such extreme distances before. Sniper Ghost Warrior Contracts 2 introduces fans to a dramatic single-player campaign where the stakes are at their highest, deep inside enemy territory. Players take on the role of Reaper,Sniper Ghost Warrior players have never taken down targets from such extreme distances before. Sniper Ghost Warrior Contracts 2 introduces fans to a dramatic single-player campaign where the stakes are at their highest, deep inside enemy territory. Players take on the role of Reaper, contract sniper assassin, operating in the heart of a lawless region of the Middle East along the Lebanese and Syrian borders. Tasked with a seemingly impossible mission - to topple an insidious criminal syndicate and bring them to justice. For the first time, Sniper Ghost Warrior Contracts 2 delivers precision long-range shooting campaign with targets over 1,000 meters away. Developed by the same studio behind the highly celebrated original Contracts, Sniper Ghost Warrior Contracts 2 pushes boundaries with the most realistic and challenging experience that the studio has ever created.\r… Expand"}, {"name": "Juiced", "details_link": "https://www.metacritic.com/game/playstation-2/juiced", "publisher": "THQ", "release_date": "Jun 13 2005", "developers": ["Juice Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "6  Online", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/eb53d515069fdc3e25e3a93f3bd8ff1e-98.jpg", "descriptions": "Juiced, as in life, is all about the car. Style comes in a close second to speed, and Juiced offers thousands of real-time modding combinations that empower players to create their ultimate personality-infused street machines. But it takes more than a fresh coat of pearlescent paint to earnJuiced, as in life, is all about the car. Style comes in a close second to speed, and Juiced offers thousands of real-time modding combinations that empower players to create their ultimate personality-infused street machines. But it takes more than a fresh coat of pearlescent paint to earn respect on the road; it takes the ball bearings to go up against the trash-talking, nitrous- burning faithful who want to strip everyone of their cash, cars and pride. Juiced lets players connect with their community and share the high-octane action by recruiting drivers to become part of their crew and race together as a team to put the brakes on the competition. Features more than 50 licensed vehicles, including Toyota, Honda, Nissan, Dodge, Ford, Mazda Mitsubishi, Pontiac, Holden, Volkswagen, Fiat, Renault, Subaru, Peugeot and Chevrolet; Hundreds of authentic aftermarket parts from leading manufacturers such as A'PEXi, AEM, Bridgestone, Ferodo, Konig, Alpine and HKS that provide players with thousands of personalized vehicle customization combinations; Progressive, non-linear gameplay that enables players to build their characters and cars, and gain respect and notoriety by winning races and cash; Unique blending of simulation and the high-octane appeal of arcade-style racing; Ability to build custom racing crews that work together as a team to win races; Authentic car physics and damage; and Online head-to-head play. [Acclaim]… Expand"}, {"name": "Phantasy Star Universe", "details_link": "https://www.metacritic.com/game/playstation-2/phantasy-star-universe", "publisher": "Sega", "release_date": "Oct 24 2006", "developers": ["Sonic Team"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "6  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/84a0f6f5fa0d934e0e6225b08721c33c-98.jpg", "descriptions": "Phantasy Star Universe offers two complete RPG experiences - a single-player action adventure spanning multiple planets, and a robust online multi-player component. The game offers long-time fans the epic experience they have been clamoring for. The solo adventure features more than 40 hoursPhantasy Star Universe offers two complete RPG experiences - a single-player action adventure spanning multiple planets, and a robust online multi-player component. The game offers long-time fans the epic experience they have been clamoring for. The solo adventure features more than 40 hours of gameplay, an emotionally engaging story, traditional cut scenes, and strong character development. The title's hero is Ethan Waber, a 17-year old cadet intent on saving his sister, who is living on a planet under siege by mysterious life forces called THE SEED. In Online Mode, players are given the opportunity to create their own characters from a range of races, and they get to explore all three planets in the Grarl solar system. Fans can travel with a squad of other adventurers, enter urban sprawls teeming with hundreds of other players, and build their avatars into powerful warriors. [Sega]… Expand"}, {"name": "Middle-earth: Shadow of Mordor - The Bright Lord", "details_link": "https://www.metacritic.com/game/playstation-4/middle-earth-shadow-of-mordor---the-bright-lord", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb 24 2015", "developers": ["Monolith Productions"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/05b0934977bf630ea61ad4a6c4b45e82-98.jpg", "descriptions": "In Middle-earth: Shadow of Mordor, gamers saw Celebrimbor’s memories of being dragged back to Mordor, forging the Rings of Power, stealing the One Ring itself, and organizing an army to battle his greatest Nemesis, the Dark Lord Sauron. Players now have the chance to play these epic events,In Middle-earth: Shadow of Mordor, gamers saw Celebrimbor’s memories of being dragged back to Mordor, forging the Rings of Power, stealing the One Ring itself, and organizing an army to battle his greatest Nemesis, the Dark Lord Sauron. Players now have the chance to play these epic events, wield this power for themselves and learn the fate of Celebrimbor, the greatest Elven king of the Second Age and the Bright Lord of Mordor — thousands of years before he became the Wraith that denied Talion death. [Monolith]… Expand"}, {"name": "MXGP: The Official Motocross Videogame", "details_link": "https://www.metacritic.com/game/xbox-360/mxgp-the-official-motocross-videogame", "publisher": "Bandai Namco Games", "release_date": "Nov 18 2014", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross"], "meta_score": 68, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/c3a561cfd73f9f7b06694f89293eb85b-98.jpg", "descriptions": "60 riders, 60 bikes, 14 tracks and rules from the official MX1 and MX2 2013 FIM Motocross World Championship."}, {"name": "MechWarrior Online", "details_link": "https://www.metacritic.com/game/pc/mechwarrior-online", "publisher": "Infinite Game Publishing", "release_date": "Sep 17 2013", "developers": ["Piranha Games"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 68, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/3c572df2280fd50a739f2266c61adb8a-98.jpg", "descriptions": "MechWarrior Online is the first offiicially licensed free-to-play title in the MechWarrior franchise."}, {"name": "Blueberry Garden", "details_link": "https://www.metacritic.com/game/pc/blueberry-garden", "publisher": "Erik Svedang", "release_date": "Jun 10 2009", "developers": ["Erik Svedang"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General"], "meta_score": 68, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/ae17f6232079fd4eebd1e63fe070d04d-98.jpg", "descriptions": "Blueberry Garden is a short experimental game about curiosity and exploration. You take on the role of a creature investigating a mysterious world to find out what is going on there. It’s probably not very much like anything you’ve played before but I hope you will find it enjoyable! [EricBlueberry Garden is a short experimental game about curiosity and exploration. You take on the role of a creature investigating a mysterious world to find out what is going on there. It’s probably not very much like anything you’ve played before but I hope you will find it enjoyable! [Eric Svedang]… Expand"}, {"name": "Space Invaders Get Even", "details_link": "https://www.metacritic.com/game/wii/space-invaders-get-even", "publisher": "Square Enix", "release_date": "Dec  1 2008", "developers": ["Taito Corporation"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/9ca13f8243607be27d2b9fb3e3dd2a59-98.jpg", "descriptions": "[WiiWare]  The Space Invaders are back, and this time they're out to get even. Take control of a UFO and make those Earthlings pay by unleashing your fleet of heroic invaders against their puny tanks, fighter jets and artillery. Use your invaders' five attack types and the might of the[WiiWare]  The Space Invaders are back, and this time they're out to get even. Take control of a UFO and make those Earthlings pay by unleashing your fleet of heroic invaders against their puny tanks, fighter jets and artillery. Use your invaders' five attack types and the might of the mother ship to rack up high scores, then upload them via Nintendo Wi-Fi Connection and see where you stand in the worldwide rankings. [Nintendo]… Expand"}, {"name": "Championship Manager 2008", "details_link": "https://www.metacritic.com/game/pc/championship-manager-2008", "publisher": "GamersGate", "release_date": "Nov  6 2007", "developers": ["Beautiful Game Studios"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 68, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/e2fe3227ecb225a95e7ef60d44885448-98.jpg", "descriptions": "(Currently available in the UK/EU only) Championship Manager2008 offers a streamlined and constant gameplay experience to the player, free of unnecessary delays. Furthermore following on from its debut appearance in Championship Manager 2007, ProZone is back as a fully integrated Post Match(Currently available in the UK/EU only) Championship Manager2008 offers a streamlined and constant gameplay experience to the player, free of unnecessary delays. Furthermore following on from its debut appearance in Championship Manager 2007, ProZone is back as a fully integrated Post Match Analysis tool which isolates the key factors that decided the result of your game and provides you with the knowledge to act on the match incidents and strengthen your team for the next fixture. Club, Player, Staff and Competition data updated to the end of the August transfer window. Increase of more than 25% of players and staff in the database. 27 playable nations now including the Australian league. Battle it out with other user managers on one PC. ProZone Analyst Feedback. Achieve managerial glory using ProZone, football's favourite analysis tool. Use ProZone Analyst for in-depth analytical feedback on how players and the team performed during a match. Play any match event within ProZone instantly. There's no hiding place for players. Stop, rewind, fast forward and pause; stats you control. Player Tendencies: 32 tendencies that modify how an individual player performs during a match. Ability to mould players in training to learn new tendencies. [Eidos Interactive]… Expand"}, {"name": "Blast Factor", "details_link": "https://www.metacritic.com/game/playstation-3/blast-factor", "publisher": "SCEA", "release_date": "Nov 17 2006", "developers": ["Bluepoint Games"], "platforms": "PlayStation 3", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 68, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/eda34e4925af2be9d1d97094b95d3bb4-98.jpg", "descriptions": "[Downloadable Game]  Dive into a fierce microbial war zone and rid cells of deadly viral swarms. Supporting true High Definition at full 1080p and taking advantage of the PS3 system's advanced processing power, Blast Factor delivers a visually stunning experience as gamers use a combination[Downloadable Game]  Dive into a fierce microbial war zone and rid cells of deadly viral swarms. Supporting true High Definition at full 1080p and taking advantage of the PS3 system's advanced processing power, Blast Factor delivers a visually stunning experience as gamers use a combination of techniques to work their way through each specimen, cell by cell, blasting waves of enemies and exploring new worlds. Self Adjusting Difficulty – As gamers play better, the game move them to the next level with a higher difficulty setting. If it gets too tough, the game will automatically ease the difficulty in the next level. SIXAXIS Wireless Controller - By tilting left and right, gamers can create tidal waves to propel enemies across the screen. Global Online Rankings - Gamers will be able to check their rank versus the world. [SCEA]… Expand"}, {"name": "Untold Legends: Brotherhood of the Blade", "details_link": "https://www.metacritic.com/game/psp/untold-legends-brotherhood-of-the-blade", "publisher": "Sony Online Entertainment", "release_date": "Mar 22 2005", "developers": ["Sony Online Entertainment"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/bdbab75213bf770e9be7c9e4c215ada7-98.jpg", "descriptions": "Journey to a fantasy world beyond the realms of imagination and engage in battles to save Aven, a timeless city of safe haven and the last remaining stronghold for your people.  As a dark threat looms and the gathering of unknown forces grows ever so stronger, heroes have been called and theJourney to a fantasy world beyond the realms of imagination and engage in battles to save Aven, a timeless city of safe haven and the last remaining stronghold for your people.  As a dark threat looms and the gathering of unknown forces grows ever so stronger, heroes have been called and the Brotherhood of the Blade must be formed.  It is up to you and your chosen Brothers to venture out into the wilds and barren regions beyond the walls of Aven to unravel the mysteries of this looming peril. Untold Legends: Brotherhood of the Blade is a hack 'n slash action adventure available exclusively for the PSP.  Experience RPG action, fantasy adventure and wireless multiplayer fun in beautiful 3D environments as you select from four unique character classes to battle powerful creatures and unravel the mysteries of an ancient planet. [Sony Online Entertainment]… Expand"}, {"name": "Hunter: The Reckoning Wayward", "details_link": "https://www.metacritic.com/game/playstation-2/hunter-the-reckoning-wayward", "publisher": "VU Games", "release_date": "Sep  9 2003", "developers": ["High Voltage Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 68, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/9122470733bace06f60df4a0153822c2-98.jpg", "descriptions": "Evil exists everywhere, but it is unseen by most. As a Hunter, you have the special gift (or curse) to recognize and destroy the evil that has come back from the dead to dwell the earth. A cult has formed in Ashcroft and it's up to the team of Hunters to destroy it. Choose from five playableEvil exists everywhere, but it is unseen by most. As a Hunter, you have the special gift (or curse) to recognize and destroy the evil that has come back from the dead to dwell the earth. A cult has formed in Ashcroft and it's up to the team of Hunters to destroy it. Choose from five playable characters; each with unique weapons, edges and supernatural abilities. Storyline, characters and environments based on White Wolf's gothic pen and paper role playing game. Unleash an arsenal of melee and ranged weapons like Flame Throwers and Grenade Launchers. Hunter Headquarters: Choose your path, character and weapons between levels. Go it alone or combine forces with two-player cooperative play. [Vivendi Universal]… Expand"}, {"name": "Fatal Fury: Battle Archives Volume 1", "details_link": "https://www.metacritic.com/game/playstation-2/fatal-fury-battle-archives-volume-1", "publisher": "SNK Playmore", "release_date": "Aug 14 2007", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 68, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/2e70ef58e11f54ebaf0290dd5cda0a98-98.jpg", "descriptions": "SNK’s first fighting franchise now available in one complete collection for the PS2. FATAL FURY, FATAL FURY 2, FATAL FURY SPECIAL & FATAL FURY 3. Create your own player character with the Color Edit function. Switch the Soundtracks of all 4 titles between Original and Arranged Compositions.SNK’s first fighting franchise now available in one complete collection for the PS2. FATAL FURY, FATAL FURY 2, FATAL FURY SPECIAL & FATAL FURY 3. Create your own player character with the Color Edit function. Switch the Soundtracks of all 4 titles between Original and Arranged Compositions.  [SNK Playmore]… Expand"}, {"name": "Terminator 3: The Redemption", "details_link": "https://www.metacritic.com/game/playstation-2/terminator-3-the-redemption", "publisher": "Atari", "release_date": "Sep  2 2004", "developers": ["Paradigm Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 68, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/32d6c7c5f46b481c93556cd342265aac-98.jpg", "descriptions": "Developed by Atari?s own Paradigm Entertainment, Terminator 3: Redemption features vehicle and character based combat and exploration from a third-person perspective and be presented in a larger and more diverse Terminator world. Terminator 3: Redemption allows players to assume the role ofDeveloped by Atari?s own Paradigm Entertainment, Terminator 3: Redemption features vehicle and character based combat and exploration from a third-person perspective and be presented in a larger and more diverse Terminator world. Terminator 3: Redemption allows players to assume the role of the most popular and iconic character featured in the Terminator films, the Terminator. Featuring Arnold Schwarzenegger?s voice and likeness, Terminator 3: Redemption surprises players with innovative and exciting gameplay presented in a number of different styles utilizing the vehicles and enemies that come straight from the Terminator universe, pitting the Terminator against numerous ground-based and air forces. [Atari]… Expand"}, {"name": "JoJo's Bizarre Adventure HD Ver.", "details_link": "https://www.metacritic.com/game/xbox-360/jojos-bizarre-adventure-hd-ver", "publisher": "Capcom", "release_date": "Aug 22 2012", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/7bb44488bc91a91ebfcc1d7f8057466b-98.jpg", "descriptions": "JoJo's Bizarre Adventure is now in HD with network support."}, {"name": "Oninaki", "details_link": "https://www.metacritic.com/game/switch/oninaki", "publisher": "Square Enix", "release_date": "Aug 22 2019", "developers": ["Tokyo RPG Factory"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/18c631d1dabdd4cc027732a45992348a-98.jpg", "descriptions": "Players assume the role of a Watcher named Kagachi, doing battle by “manifesting” the souls of Daemons, which act as the classes found in traditional roleplaying games. Each Daemon has its own unique weapons and skills, and players can shift between them in real time to gain the upper handPlayers assume the role of a Watcher named Kagachi, doing battle by “manifesting” the souls of Daemons, which act as the classes found in traditional roleplaying games. Each Daemon has its own unique weapons and skills, and players can shift between them in real time to gain the upper hand in battle. Moving between the Living World and the realm of the dead known as the Beyond, Kagachi must save the souls of the Lost, as the story of life and reincarnation in this wondrous kingdom unfolds. … Expand"}, {"name": "Super Beat Sports", "details_link": "https://www.metacritic.com/game/switch/super-beat-sports", "publisher": "Harmonix Music Systems", "release_date": "Nov  2 2017", "developers": ["Harmonix Music Systems"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 68, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/fed2437f1a86d2e4a34fec2814245358-98.jpg", "descriptions": "It’s a collection of five sports-themed mini games with a musical twist- coming this Fall exclusively for the Nintendo Switch. Swing, volley, and score to the music to come out on top. Promises to add instant multiplayer excitement to any party."}, {"name": "Virtua Tennis 2009", "details_link": "https://www.metacritic.com/game/pc/virtua-tennis-2009", "publisher": "Sega", "release_date": "Jun  9 2009", "developers": ["Sumo Digital"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 68, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/a2d149b7d8a2d4cc81589cbd9eac5b6a-98.jpg", "descriptions": "Create your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new rollCreate your own player and join the new World Tour where you are trained by a real-life legend of tennis to compete for the #1 ranking against the biggest stars. Then take your character online and prove you're the best with the new online ranking system! With brand new courts, a new roll call of tennis stars to compete against and even more court mini-games, Virtua Tennis 2009 is set to be the #1 tennis title once again! New Players / Courts - Play as or against over 20 of the world’s top players, including seven new to Virtua Tennis and three legends. All-new arenas and the officially licensed Davis Cup provide the most realistic tennis competition to date. New Player Creation System - You now have full control over facial, body and clothing customization, as well as the depth to populate the game world with hundreds of unknown opponents. More Court Games. Playing alone or with up to three friends compete in 12 mini-games, five completely new, and upload your hi-scores on the worldwide rankings in games such as Zoo Feeder and Pirate War. Improved Gameplay - Courtside action is better than ever, with extensive updates to the famous arcade-style Virtua Tennis match engine, as well as 3D crowds and a more realistic courtside experience. [Sega]… Expand"}, {"name": "Gotham Knights", "details_link": "https://www.metacritic.com/game/playstation-5/gotham-knights", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 21 2022", "developers": ["WB Games Montreal", "Warner Bros. Games Montreal"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 68, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/fb70f40a69b8fb9e27ece5b3a83f650e-98.jpg", "descriptions": "Batman is dead. It is now up to the Batman Family - Batgirl, Nightwing, Red Hood and Robin - to protect Gotham City, bring hope to its citizens, discipline to its cops, and fear to its criminals. You must evolve into the new Dark Knight and save Gotham from chaos. Your legacy begins now.Batman is dead. It is now up to the Batman Family - Batgirl, Nightwing, Red Hood and Robin - to protect Gotham City, bring hope to its citizens, discipline to its cops, and fear to its criminals. You must evolve into the new Dark Knight and save Gotham from chaos. Your legacy begins now. Step into the Knight. Gotham Knights is a brand-new open world, third-person action RPG featuring the Batman Family as players step into the roles of Batgirl, Nightwing, Red Hood and Robin, a new guard of trained DC Super Heroes who must rise up as the protectors of Gotham City in the wake of Batman's death. An expansive, criminal underworld has swept through the streets of Gotham, and it is now up to these new heroes to protect the city, bring hope to its citizens, discipline to its cops and fear to its criminals. Players must save Gotham from descent into chaos and reinvent themselves into their own version of the Dark Knight.… Expand"}, {"name": "Marvel Heroes Omega", "details_link": "https://www.metacritic.com/game/xbox-one/marvel-heroes-omega", "publisher": "Gazillion", "release_date": "Jun 30 2017", "developers": ["Gazillion"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 68, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/4f0d508a23165dcbd9758c89fc313369-98.jpg", "descriptions": "The Cosmic Cube is a device of untold power capable of changing the very fabric of reality at the whim of its possessor. The brilliant but malevolent Dr. Doom has the Cube, and with it he aims to reshape the world in his own image. Determined to succeed where the Cube's previous wieldersThe Cosmic Cube is a device of untold power capable of changing the very fabric of reality at the whim of its possessor. The brilliant but malevolent Dr. Doom has the Cube, and with it he aims to reshape the world in his own image. Determined to succeed where the Cube's previous wielders have failed, Doom has lined up villainous allies to prevent the super-heroes from interfering. Can you unravel Doctor Doom's sinister plan and stop him before it's too late?… Expand"}, {"name": "Dillon's Rolling Western: The Last Ranger", "details_link": "https://www.metacritic.com/game/3ds/dillons-rolling-western-the-last-ranger", "publisher": "Nintendo", "release_date": "Apr 11 2013", "developers": ["Vanpool"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/33794542c982ad5822e7094374c2e825-98.jpg", "descriptions": "Dillon's Rolling Western: The Last Ranger is an action tower-defense game which combines the strategy elements of Dillon defeating enemies with weapon emplacements that players can deploy around the map, and the action elements of Dillon directly attacking opponents with flashy action movesDillon's Rolling Western: The Last Ranger is an action tower-defense game which combines the strategy elements of Dillon defeating enemies with weapon emplacements that players can deploy around the map, and the action elements of Dillon directly attacking opponents with flashy action moves like rolling attacks and claw slashes.… Expand"}, {"name": "The Experiment (2007)", "details_link": "https://www.metacritic.com/game/pc/the-experiment-2007", "publisher": "DreamCatcher Interactive", "release_date": "Feb  5 2008", "developers": ["Lexis Numerique"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 68, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/2434c93ef5760f908a6ffe5970c26ccc-98.jpg", "descriptions": "(Also known as \"Experience 112\")  Over sweeping cliffs and across scenic coastlines, this innovative shared adventure be gins in the bowels of an old, dilapidated ship grounded ashore. Mysteriously, you find yourself in the ship’s operations room faced with a highly advanced panel of(Also known as \"Experience 112\")  Over sweeping cliffs and across scenic coastlines, this innovative shared adventure be gins in the bowels of an old, dilapidated ship grounded ashore. Mysteriously, you find yourself in the ship’s operations room faced with a highly advanced panel of controls, surveillance monitors, and a wide array of sophisticated technology. As you watch the monitors for other signs of life, you discover a woman. Unable to find a way to communicate with her directly, you realize that you are her only hope. She needs your help. The problem is, you too are being held prisoner by an unseen captor. Soon you come to realize that the only way to escape is to help one another. But... who are you? Who is she? Why do you control both your fates? Is escape from this floating prison your only goal, or is there a more cryptic scheme? [The Adventure Company]… Expand"}, {"name": "Sigma Star Saga", "details_link": "https://www.metacritic.com/game/game-boy-advance/sigma-star-saga", "publisher": "Namco", "release_date": "Aug 16 2005", "developers": ["WayForward"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 68, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/a586e0c6f22eee220da7175dd64c5f37-98.jpg", "descriptions": "Earth is under attack, and you are humanity's only hope for survival. The only way you can defeat the Krill force is to explore the mysteries behind six planets. On each planet, you can discover new Krill weaponry and gadgets that you can use to equip your character and your spaceship. WithEarth is under attack, and you are humanity's only hope for survival. The only way you can defeat the Krill force is to explore the mysteries behind six planets. On each planet, you can discover new Krill weaponry and gadgets that you can use to equip your character and your spaceship. With 50 kinds of \"gun data,\" you can combine weapon attributes (such as spread shot, heat seek, and explode) to create more powerful guns.… Expand"}, {"name": "Othercide", "details_link": "https://www.metacritic.com/game/xbox-one/othercide", "publisher": "Focus Home Interactive", "release_date": "Jul 28 2020", "developers": ["Lightbulb Crew"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 68, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/677b66f88735162c814919adfdfa0b4d-98.jpg", "descriptions": "Othercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limitedOthercide is a horror-themed turn-based strategy game where the lore and game mechanics are tightly intertwined to deliver a twisted, dark and challenging experience. Enter a brutal world under assault from terrifying creatures from another dimension, hold back the tide with limited resources and endure brutal conditions in visually stunning world.Experience dynamic turn-based combat and a new way to anticipate enemy movements to perform a flawless tactical plan. Using the Initiative Sequence System and unique set of skills, you will be able to interrupt an enemy attack, plan a delayed action that will be triggered later on in the timeline and use reaction skill to respond to any threat.Prepare to suffer and face close calls in our terrifying and ruthless universe. With roguelite features, deadly missions, limited resources and permanent death, there is no room for errors.Level up, unlock new skills and collect memories from the death of your enemies. A limited number of these bonuses can be implemented to your skills to boost their stats. But choose wisely as once implemented, you can't take them back, unless... you decide to sacrifice your Daughter!Make dramatic choices and endure with your Daughters traumatic experiences which will make them stronger or weaker.Othercide invites you in a ethereal monochromatic dimension with only dashes of crimson red where your worst nightmares come to life.… Expand"}, {"name": "Daymare: 1998", "details_link": "https://www.metacritic.com/game/xbox-one/daymare-1998", "publisher": "Invader Studios", "release_date": "Apr 28 2020", "developers": ["Invader Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 68, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/4c63469e0ef54e042a00494d6147b8d4-98.jpg", "descriptions": "Daymare: 1998 is a third person survival horror game with over the shoulder camera, developed in Unreal Engine 4 for Windows PC. The game features high-end graphics, original soundtrack, immersive atmosphere, hardcore survival mechanics and many connections with the beloved old schoolDaymare: 1998 is a third person survival horror game with over the shoulder camera, developed in Unreal Engine 4 for Windows PC. The game features high-end graphics, original soundtrack, immersive atmosphere, hardcore survival mechanics and many connections with the beloved old school survival horror games and '90s landmark brands.… Expand"}, {"name": "Seeking Dawn", "details_link": "https://www.metacritic.com/game/pc/seeking-dawn", "publisher": "Multiverse Games", "release_date": "Jul 12 2018", "developers": ["Multiverse Games", "Multiverse"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 68, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/47301ee7ef39ab1074821d7c23572d01-98.jpg", "descriptions": "Welcome to Seeking Dawn, a multiplayer survival VR adventure that takes you far beyond the solar system. Step into the shoes of a soldier discovering a hostile planet, where predators roam free and enemies are ruthless."}, {"name": "Disney's Chicken Little", "details_link": "https://www.metacritic.com/game/xbox/disneys-chicken-little", "publisher": "Buena Vista Games", "release_date": "Oct 18 2005", "developers": ["Avalanche Software"], "platforms": "Xbox", "genres": ["Action", "Platformer", "3D"], "meta_score": 68, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/4b04cfcc79d7f4986ff67cc305cb5b46-98.jpg", "descriptions": "Chicken Little brings you into the middle of Oakey Oaks, where you'll experience all the action and adventure of Disney's animated film of the same name. Taking on the roles of Chicken Little and his friends, Abby Mallard, Runt-of-the-Litter, and Fish-out-of-Water, you must try to outwitChicken Little brings you into the middle of Oakey Oaks, where you'll experience all the action and adventure of Disney's animated film of the same name. Taking on the roles of Chicken Little and his friends, Abby Mallard, Runt-of-the-Litter, and Fish-out-of-Water, you must try to outwit bully Foxy Loxy and save the town from an alien invasion, all the while attempting to reverse Chicken Little's tarnished reputation from that unfortunate \"acorn incident.\" The game features innovative gadgets, pickups, side quests, and minigames, plus multiplayer gameplay.… Expand"}, {"name": "Advent Rising", "details_link": "https://www.metacritic.com/game/xbox/advent-rising", "publisher": "Majesco Games", "release_date": "May 31 2005", "developers": ["GlyphX Games"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 68, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/a3e7e60368336a3c266e06e65820cced-98.jpg", "descriptions": "In Advent Rising, a common legend pervades the galaxy--that one day humans will deliver the universe. Many view humans as the messiah, a symbol of hope, or fantastical creatures, but the Seekers view them as enemies that must be destroyed. In third- and first-person points of view, you'llIn Advent Rising, a common legend pervades the galaxy--that one day humans will deliver the universe. Many view humans as the messiah, a symbol of hope, or fantastical creatures, but the Seekers view them as enemies that must be destroyed. In third- and first-person points of view, you'll realize what it means to be truly human as you delve into an intergalactic saga. Advent Rising sets you on an action-packed adventure where you'll develop superhuman powers, wield an arsenal of high-tech weapons, and command a vast array of futuristic vehicles.… Expand"}, {"name": "Mount & Blade: With Fire & Sword", "details_link": "https://www.metacritic.com/game/pc/mount-blade-with-fire-sword", "publisher": "Paradox Interactive", "release_date": "May  3 2011", "developers": ["Taleworlds Entertainment"], "platforms": "PC", "num_players": "Up to 64 ", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Western-Style", "Fantasy"], "meta_score": 68, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/553a67c778d5bd1865a85eca0f19cf29-98.jpg", "descriptions": "With Fire & Sword also builds and expands upon the highly regarded combat system from Mount & Blade: Warband. Firearms have been introduced to the battlefield, opening up exciting new play-styles and options. Players can also utilize explosives for taking out groups of foes or toWith Fire & Sword also builds and expands upon the highly regarded combat system from Mount & Blade: Warband. Firearms have been introduced to the battlefield, opening up exciting new play-styles and options. Players can also utilize explosives for taking out groups of foes or to breach castle walls. In addition to the enhanced singleplayer mode, With Fire and Sword also provides a host of original multiplayer content including the new Captain Mode which allows players to control their own forces in online matches. \r… Expand"}]