[{"name": "Mirror's Edge Catalyst", "details_link": "https://www.metacritic.com/game/playstation-4/mirrors-edge-catalyst", "publisher": "Electronic Arts", "release_date": "Jun  7 2016", "developers": ["EA DICE"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Modern", "Modern", "Action Adventure", "General"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/85c9d91265a4971b10e1e318f3b29fa0-98.jpg", "descriptions": "Through Mirror’s Edge Catalyst, experience the emergence of Faith, a brave Runner who uncovers a hidden truth inside the walls of the city of Glass. Through her journey, Faith explores every corner of the city, from the highest, most pristine skyscrapers, to the dark and dingy tunnels thatThrough Mirror’s Edge Catalyst, experience the emergence of Faith, a brave Runner who uncovers a hidden truth inside the walls of the city of Glass. Through her journey, Faith explores every corner of the city, from the highest, most pristine skyscrapers, to the dark and dingy tunnels that underlie the city. Players must master the environment, using their momentum and timing their combat to fight the oppressiveness of the ruling elite, uncovering the dark secrets behind the city’s beautiful façade. Mirror’s Edge Catalyst offers players the freedom to explore the expanse of the city, discovering a variety of new activities, like ‘Dash’, races from point A to B, environmental puzzles and story missions to complete at their leisure. [EA]… Expand"}, {"name": "A Juggler's Tale", "details_link": "https://www.metacritic.com/game/playstation-5/a-jugglers-tale", "publisher": "Mixtvision", "release_date": "Sep 29 2021", "developers": ["Kaleidoscube"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/7e4650c7c94bfee006395d80cb9afb61-98.jpg", "descriptions": "A Juggler’s Tale is a cinematic puzzle-platformer. Play as Abby, the marionette, and make your way through a medieval fairy tale world to find freedom. Use the puppet’s strings in unique puzzles, find your way around obstacles, and evade the relentless cut-throats that are hot on your heelsA Juggler’s Tale is a cinematic puzzle-platformer. Play as Abby, the marionette, and make your way through a medieval fairy tale world to find freedom. Use the puppet’s strings in unique puzzles, find your way around obstacles, and evade the relentless cut-throats that are hot on your heels – while the puppet master holds the strings firmly in his hands.  \"Ladies and Gentlemen! Come in, come in! In the mood for a story, are we?\" Abby is an artiste held captive at a circus: She spends her days entertaining the audience and her nights in a cage, longing for freedom. One day, she escapes the circus and gets to explore a mystical world. Alas, freedom comes at a cost and Abby soon finds herself dragged into the dangers this world has to offer: In a war-torn, medieval fairy tale, surrounded by ravaged, starving citizens and hunted by the relentless cut-throat Tonda, Abby has to cross raging rivers, make it through bandit camps and around traps. Her adventure is always accompanied by the lyrical rhymes of puppet master Jack, who tells her story while holding the strings of his puppets firmly in his ever-helpful hands. Who can Abby trust? Can she find a way to truly break free? Despite dangling from her threads, will Abby learn that she can still influence her destiny? \"Abby, Abby... Don't you see, the threads holding you up – also hold you back.\"… Expand"}, {"name": "Pathway", "details_link": "https://www.metacritic.com/game/switch/pathway", "publisher": "Chucklefish", "release_date": "May 27 2021", "developers": ["Robotality"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/8fe6ee7e4f7a781f574d93f8117a5ffd-98.jpg", "descriptions": "The year is 1936...In a time of global turmoil, Nazi influence spreads inexorably across Europe and the Middle East. Rumors are abound of secret excavations and mysterious artifacts, not to mention the odd whisperings and tales of gruesome occult rituals...\nIt's up to you to assemble aThe year is 1936...In a time of global turmoil, Nazi influence spreads inexorably across Europe and the Middle East. Rumors are abound of secret excavations and mysterious artifacts, not to mention the odd whisperings and tales of gruesome occult rituals...It's up to you to assemble a team of bold adventurers, and journey through the deserts, explore bunkers, and temples of Northern Africa to discover their hidden treasures and secrets before they fall into the hands of Nazi forces. You and your companions must work together to overcome overwhelming odds - the fate of the world depends on it!You haven't heard this one before...Every campaign is generated when it begins, so no two adventures will ever be the same! You never know what's around the next corner - so stay on your toes! Even the most seasoned adventurers can uncover new and exciting discoveries.Adventures full of mysteryJourney into the unknown and uncover hidden secrets, treasures, characters, and events which have been buried away. There's a wealth of discoveries to be found, and surprises to excite you throughout each adventure!Learn from your mistakesIn Pathway, defeat isn't necessarily the end of your adventure. Characters will retain their experience after defeat, so players can invest into building a team which will get progressively stronger! There's even rare equipment and advanced skills and abilities to unlock for every adventurer.Features:* DYNAMIC ADVENTURES - Discover 5 different campaigns of varying difficulty, with each and every attempt generating a new web of encounters and unique storyline.* TOUGH CHOICES - Every explored location presents you with one of over 400 hand-crafted story events. Search the well? Save the villagers? It's up to you!* DECISIVE CONFLICTS - Use cover and positioning in exciting turn-based squad combat. Learn to make the best use of your equipment and your team's abilities, to vanquish a relentless foe, in ruthless and clever ways!* BUILD YOUR TEAM OF ADVENTURERS - Each of Pathway's 16 unlockable characters has their own skills, weaknesses and quirks, from the almighty melee strength of Brunhilda, to rifle expert daredevil Jackson, and knife-wielding huntress Shani.* HIDDEN TREASURES - Unearth riches untold, from common weaponry to rare and unique items with special abilities. Perfect your load-out and cash-in on your high-value treasures for a tidy profit.* THRILLING VISUALS - Classic 16-bit pixel art enhanced with unprecedented depth, lighting and shadows using Pixel/Voxel Hybrid Technology.* RECOVER & REPLAY - Sometimes failure is the best path to winning. Progressively explore the procedurally generated world, and grow stronger and learn more with each defeat, taking your loot with you even after death.With soundtrack by the critically-acclaimed composer, Gavin Harrison of Halfway fame!… Expand"}, {"name": "The Invisible Hand", "details_link": "https://www.metacritic.com/game/pc/the-invisible-hand", "publisher": "Fellow Traveller", "release_date": "May  7 2021", "developers": ["Power Struggle Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/279a0659ae5e1c2ba7613d081655f137-98.jpg", "descriptions": "Want to get rich, quick? Welcome to FERIOS, where you’ll be empowered to pursue wealth and success as a mid-level stockbroker! Your wildest dreams of wealth can come true… at the cost of everything else."}, {"name": "Final Fantasy Type-0 HD", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-type-0-hd", "publisher": "Square Enix", "release_date": "Aug 18 2015", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/1aca115c2ad0a7c9e3f3db9780b86a2a-98.jpg", "descriptions": "Experience the epic saga of the eastern lands of Orience! Switch at will between fourteen characters with unique weapons and abilities! An all new type of FINAL FANTASY!"}, {"name": "Dragon Age: Origins - Return to Ostagar", "details_link": "https://www.metacritic.com/game/pc/dragon-age-origins---return-to-ostagar", "publisher": "Electronic Arts", "release_date": "Jan 13 2010", "developers": ["BioWare"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/deae0165dbac7d8b7daea226c0ead6b6-98.jpg", "descriptions": "(Downloadable Content)  Your memories of the battle of Ostagar will haunt you for years to come. It laid waste to your order and claimed the lives of many great men and women, including the brash young King Cailan and your mentor, Duncan. Now, there are rumors that a fellow survivor of the(Downloadable Content)  Your memories of the battle of Ostagar will haunt you for years to come. It laid waste to your order and claimed the lives of many great men and women, including the brash young King Cailan and your mentor, Duncan. Now, there are rumors that a fellow survivor of the battle has escaped from captivity and is seeking the Grey Wardens' help. The time has come for the Grey Wardens to make their return to Ostagar and exact their revenge upon the darkspawn. [Electronic Arts]… Expand"}, {"name": "Donkey Konga 2", "details_link": "https://www.metacritic.com/game/gamecube/donkey-konga-2", "publisher": "Nintendo", "release_date": "May  9 2005", "developers": ["Namco"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/d8a9c81360858fab0d70b03c5f68daa7-98.jpg", "descriptions": "Get ready for a fresh new set of popular songs in the sequel to Donkey Konga. Donkey Konga 2 features more than 25 new songs, ranging from pop and hip-hop to R&B and rock. You can select from three difficulty levels and five gameplay modes, including freestyle and concert. Connect up to fourGet ready for a fresh new set of popular songs in the sequel to Donkey Konga. Donkey Konga 2 features more than 25 new songs, ranging from pop and hip-hop to R&B and rock. You can select from three difficulty levels and five gameplay modes, including freestyle and concert. Connect up to four sets of DK Bongos controllers for jam sessions, or match your rhythmic prowess against a rival in the two-player battle mode.… Expand"}, {"name": "NASCAR 09", "details_link": "https://www.metacritic.com/game/xbox-360/nascar-09", "publisher": "EA Sports", "release_date": "Jun 10 2008", "developers": ["EA Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 14 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/33337e077f647bcc81d98ba5b90c8868-98.jpg", "descriptions": "The road to victory begins with Jeff Gordon as he guides you through an all-new \"Chase for the NASCAR Sprint Cup\" Career Mode on a completely-revamped 3D menu interface. With Jeff's help you can sign big-time contracts, build your reputation and earn valuable performance points by dominatingThe road to victory begins with Jeff Gordon as he guides you through an all-new \"Chase for the NASCAR Sprint Cup\" Career Mode on a completely-revamped 3D menu interface. With Jeff's help you can sign big-time contracts, build your reputation and earn valuable performance points by dominating in the NASCAR Craftsman Truck Series, the NASCAR Nationwide Series and the NASCAR Sprint Cup Series. Two new and entirely distinct handling models let you play NASCAR 09 at your speed. Forgiving \"Normal\" mode is perfect for getting a handle on the game, while \"Pro\" mode delivers the authentic, white-knuckle NASCAR racing experience. Own the Track lets you compete against your friends and other gamers at all of hte Sprint Cup Series venues. Every racer's stats are compiled and the best driver at each track is named for the ultimate in bragging rights. [Electronic Arts]… Expand"}, {"name": "Fate/Extella: The Umbral Star", "details_link": "https://www.metacritic.com/game/switch/fateextella-the-umbral-star", "publisher": "XSEED Games", "release_date": "Jul 25 2017", "developers": ["Marvelous Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/39b711a4b939ba6b2760e9e982934b8b-98.jpg", "descriptions": "In the digital realm of SE.RA.PH, the Holy Grail War is over, but the land's new ruler faces challenges and threats from all sides. The servants now find themselves drawing up tense and unlikely alliances, preparing for a conflict that may tear SE.RA.PH apart...or destroy it entirely."}, {"name": "Crimsonland", "details_link": "https://www.metacritic.com/game/xbox-one/crimsonland", "publisher": "10tons Ltd", "release_date": "Oct 14 2015", "developers": ["10tons Entertainment", "10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/909903aa7a273a729779f66073cb12ef-98.jpg", "descriptions": "Crimsonland is an intense, addictive and immensely gratifying top-down dual stick shooter where your screen is filled with literally hundreds of aliens, giant spiders, mutant lizards, and more.\r Complete sixty quests to unlock an array of weapons and abilities, then unleash your arsenal inCrimsonland is an intense, addictive and immensely gratifying top-down dual stick shooter where your screen is filled with literally hundreds of aliens, giant spiders, mutant lizards, and more.\r Complete sixty quests to unlock an array of weapons and abilities, then unleash your arsenal in five survival modes with leaderboards.\r All Crimsonland game modes feature local co-op for up to four players. There are also dedicated leaderboards for co-op games, so gather your friends and show everyone who wields the gauss shotgun like a pro!… Expand"}, {"name": "Battle Princess of Arcadias", "details_link": "https://www.metacritic.com/game/playstation-3/battle-princess-of-arcadias", "publisher": "NIS America", "release_date": "Jun 17 2014", "developers": ["ApolloSoft"], "platforms": "PlayStation 3", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/23e4ad3c1e11339d50cee67ce13ae0d6-98.jpg", "descriptions": "The kingdom of Schwert was one peaceful and beautiful. But now it's been overrun by monsters, and as the Battle Princess Plume, it's up to you to set things right in this colorful, high-speed action RPG!\r Collect a group of warriors and engage in skirmishes against small groups of enemiesThe kingdom of Schwert was one peaceful and beautiful. But now it's been overrun by monsters, and as the Battle Princess Plume, it's up to you to set things right in this colorful, high-speed action RPG!\r Collect a group of warriors and engage in skirmishes against small groups of enemies before taking on huge and powerful bosses in epic siege battles! As you fight and level up, you'll gain new skills, gather heaps of treasure, and upgrade your weapons and gear on your way to victory!… Expand"}, {"name": "Thymesia", "details_link": "https://www.metacritic.com/game/pc/thymesia", "publisher": "Team17", "release_date": "Aug 18 2022", "developers": ["OverBorder Studio"], "platforms": ["PlayStation 5", "Switch", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/bd0ba84d0d4011a19d960d4bf7143b72-98.jpg", "descriptions": "Thymesia is a gruelling action-RPG with fast-paced combat and an intricate plague weapon system. In a kingdom where death spreads, play as a mysterious character known by the code name \"Corvus\". Prey upon your enemies, wield the power of disease and find the truth in your own memories."}, {"name": "Roller Champions", "details_link": "https://www.metacritic.com/game/pc/roller-champions", "publisher": "Ubisoft", "release_date": "May 25 2022", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 69, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/3/cb8ff3558eca2b902e788ec35fa646f9-98.jpg", "descriptions": "Roller Champions is a 3v3 sports game where you go head-to-head against the opposing team through speed, wit, crushing tackles, and daring dodges! Be the first team to reach five points by throwing the ball through the hoop!"}, {"name": "AO Tennis 2", "details_link": "https://www.metacritic.com/game/xbox-one/ao-tennis-2", "publisher": "Bigben Interactive", "release_date": "Feb 11 2020", "developers": ["Big Ant Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/fbd28364f3c873fc378506697f222f73-98.jpg", "descriptions": "AO Tennis 2 is the only tennis experience designed for and by its community. Create your own players, stadiums and legendary matches. Enter the competition to reach the top of world tennis in Career Mode."}, {"name": "Nintendo Labo: Toycon 03 Vehicle Kit", "details_link": "https://www.metacritic.com/game/switch/nintendo-labo-toycon-03-vehicle-kit", "publisher": "Nintendo", "release_date": "Sep 14 2018", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/193be39810a077bae33d0d2bc5cf3cd7-98.jpg", "descriptions": "Includes these projects and more: Toy-Con Car, Toy-Con Pedal, T-Con Plane, T-Con Key, and Toy-Con Submarine."}, {"name": "Tony Hawk's Downhill Jam", "details_link": "https://www.metacritic.com/game/wii/tony-hawks-downhill-jam", "publisher": "Activision", "release_date": "Nov 14 2006", "developers": ["Toys for Bob"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/c72ec46ebba440e971430f6b109ed3e6-98.jpg", "descriptions": "Tony Hawk's Downhill Jam delivers an innovative and unique skateboard experience focused on head-to-head racing. The game allows players to feel the breakneck speed of downhill competition as they tear up the world's steepest terrains while performing tricks and outmaneuvering opponents inTony Hawk's Downhill Jam delivers an innovative and unique skateboard experience focused on head-to-head racing. The game allows players to feel the breakneck speed of downhill competition as they tear up the world's steepest terrains while performing tricks and outmaneuvering opponents in such locations as San Francisco, Machu Picchu and Hong Kong. Taking on the role of Tony Hawk or one of nine characters, players compete in time-based challenges in one of three gameplay modes including race, trick and slalom. [Activision]… Expand"}, {"name": "DreamWorks Shrek SuperSlam", "details_link": "https://www.metacritic.com/game/pc/dreamworks-shrek-superslam", "publisher": "Activision", "release_date": "Nov  1 2005", "developers": ["Shaba Games"], "platforms": "PC", "num_players": "24  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "Fighting", "2D", "3D"], "meta_score": 69, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/7/3614049016dc0da5552d857e926ccd05-98.jpg", "descriptions": "Slam, smash, beat and brawl your friends in Shrek SuperSlam - the most twisted fighting game ever. Play as 20 characters from the Shrek universe, including Shrek, Donkey, Puss in Boots, and the villainous Prince Charming. SuperSlam your opponents through windows and walls in 16 fullySlam, smash, beat and brawl your friends in Shrek SuperSlam - the most twisted fighting game ever. Play as 20 characters from the Shrek universe, including Shrek, Donkey, Puss in Boots, and the villainous Prince Charming. SuperSlam your opponents through windows and walls in 16 fully destructible environments. Run for cover when characters unleash their signature fighting moves, like Shrek’s disgusting Green Storm (better plug your nose!) and Puss in Boots’ irresistible Cute Attack. And weapons like the Big Fairy Bazooka and the Hammer of Smiting give you endless ways to blast your opponents into oblivion. Up to four players. [Activision]… Expand"}, {"name": "Octodad: Dadliest Catch", "details_link": "https://www.metacritic.com/game/playstation-4/octodad-dadliest-catch", "publisher": "Young Horses, Inc", "release_date": "Apr 22 2014", "developers": ["Kevin Zuhn"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Adventure", "3D", "Third-Person", "Modern"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/d06c6ada3bbb0e577d90b1b7721e8d98-98.jpg", "descriptions": "Octodad: Dadliest Catch is a game about destruction, deception, and fatherhood. The player controls Octodad, a dapper octopus masquerading as a human, as he goes about his life. Octodad's existence is a constant struggle, as he must master mundane tasks with his unwieldy boneless tentaclesOctodad: Dadliest Catch is a game about destruction, deception, and fatherhood. The player controls Octodad, a dapper octopus masquerading as a human, as he goes about his life. Octodad's existence is a constant struggle, as he must master mundane tasks with his unwieldy boneless tentacles while simultaneously keeping his cephalopodan nature a secret from his human family.… Expand"}, {"name": "Magicka: Wizard Wars", "details_link": "https://www.metacritic.com/game/pc/magicka-wizard-wars", "publisher": "Paradox Interactive", "release_date": "May 27 2014", "developers": ["Paradox North"], "platforms": "PC", "genres": ["Action Adventure", "Fantasy", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/af557122603ad873da93d9001680542a-98.jpg", "descriptions": "Magicka: Wizard Wars is a sandbox action PvP game that utilizes the humor and dynamic spellcasting system of Magicka, tasking players to form teams of four and blaze their way across the battlefield together, combining elements to cast hundreds of different spells to generate a broad varietyMagicka: Wizard Wars is a sandbox action PvP game that utilizes the humor and dynamic spellcasting system of Magicka, tasking players to form teams of four and blaze their way across the battlefield together, combining elements to cast hundreds of different spells to generate a broad variety of offensive and defensive effects. Each player can design a persistent and personalized wizard with hundreds of unique items and guide them to glory.\r Wizard Wars is a Fun-to-Play Team-based PvP experience, filled with tongue-in-cheek references to popular media and current events. With short rounds and unpredictable strategies, Wizard Wars gives both novice players and experienced MOBA veterans a unique tactical depth in every encounter.… Expand"}, {"name": "Prinny 1-2: Exploded and Reloaded", "details_link": "https://www.metacritic.com/game/switch/prinny-1-2-exploded-and-reloaded", "publisher": "NIS America", "release_date": "Oct 13 2020", "developers": ["Nippon Ichi Software"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/7e81285a9aad49e50b55fc061a1f6483-98.jpg", "descriptions": "Master Etna demands the ultimate dessert, and it is up to a legion of lowly Prinnies to make it! Jump, slash, and combo your way through different stages of the Netherworld, devastate enemies and bosses with special attacks, and encounter both new and familiar faces in this explosive actionMaster Etna demands the ultimate dessert, and it is up to a legion of lowly Prinnies to make it! Jump, slash, and combo your way through different stages of the Netherworld, devastate enemies and bosses with special attacks, and encounter both new and familiar faces in this explosive action adventure from the twisted minds behind the DISGAEA series!… Expand"}, {"name": "Ninja Gaiden 3: Razor's Edge", "details_link": "https://www.metacritic.com/game/wii-u/ninja-gaiden-3-razors-edge", "publisher": "Nintendo", "release_date": "Nov 18 2012", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/da8597c111c38f34d6e1ef68b9ebb3b4-98.jpg", "descriptions": "NINJA GAIDEN 3: Razor's Edge promises to be a leaner, tighter experience than the original game. Significantly reduced scripted sequences, streamlined game flow, and improved A.I. complement an array of new features exclusive to the Wii U console."}, {"name": "The Bunker", "details_link": "https://www.metacritic.com/game/playstation-4/the-bunker", "publisher": "Wales Interactive", "release_date": "Sep 20 2016", "developers": ["Splendy Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/1757f5c2ec4b0231312ceb71a240bf2a-98.jpg", "descriptions": "As the last remaining survivor in a nuclear bunker, Johns daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self-destruct. The Bunker is a live-action psychological horror game starring Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful)As the last remaining survivor in a nuclear bunker, Johns daily routine is the one thing that keeps him sane. But when an alarm goes off, his mind starts to self-destruct. The Bunker is a live-action psychological horror game starring Adam Brown (The Hobbit) and Sarah Greene (Penny Dreadful) with writing talent behind The Witcher, Broken Sword and SOMA.… Expand"}, {"name": "The Grim Adventures of Billy & Mandy", "details_link": "https://www.metacritic.com/game/gamecube/the-grim-adventures-of-billy-mandy", "publisher": "Midway", "release_date": "Sep 25 2006", "developers": ["Midway"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/2e7951ce1ca5356f4dbeba2ff527ea8a-98.jpg", "descriptions": "The Grim Adventures of Billy & Mandy videogame pits 15 characters from the popular television show against each other in a fighting/adventure game filled with mayhem and chaos. Whether players use Billy's gas attack or Mandy's deadly smile, all of the characters will feature individualThe Grim Adventures of Billy & Mandy videogame pits 15 characters from the popular television show against each other in a fighting/adventure game filled with mayhem and chaos. Whether players use Billy's gas attack or Mandy's deadly smile, all of the characters will feature individual abilities based on their personalities. Players will be able to smash objects, destroy environments and battle in 20 fully interactive environments from the show. In battle mode, up to four players can use a multitude of weapons in destructible arenas like the \"Desert of Doom\" and the \"Underworld\" to battle it out and be the last one standing. Players also have the option to play on their own or with a friend in mission mode, a series of 45 missions where players can unlock new weapons and characters like Hoss Delgado and Fred Fredburger.… Expand"}, {"name": "Tony Hawk's American Wasteland", "details_link": "https://www.metacritic.com/game/pc/tony-hawks-american-wasteland", "publisher": "Aspyr", "release_date": "Feb  1 2006", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/8c8795c41b4033186026f22818f2cd6b-98.jpg", "descriptions": "Get ready for unlimited skating and BMX biking in the vast wasteland of skate culture - Los Angeles.No levels. No load times. Just never-ending action that doesn't stop until you leave the game! Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedomGet ready for unlimited skating and BMX biking in the vast wasteland of skate culture - Los Angeles.No levels. No load times. Just never-ending action that doesn't stop until you leave the game! Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedom to skate, or bike, throughout a rich, expansive open environment. Once you arrive in Los Angeles, the vast city that gave birth to skate culture, the sky's the limit as you progress through the Wasteland story and choose missions that will have you immersed in the action without ever skating the same line twice! PC gamers will be able to compete against one another in multiplayer action via GameSpy. Freedom to ride forever: no level-based gameplay. In American Wasteland, you travel throughout the vast urban terrain of Los Angeles including Hollywood, East L.A., and other landmark areas without restrictions or repetition. Ultimate player control: more tricks and expanded controls than ever before. Choose board or bike: For the first time, you can choose to ride BMX bikes throughout the entire game, with all-new physics, a BMX specific control system and several BMX-specific goals. Customize like crazy: Enter and explore dozens of shops in game to customize your gear and your look. [Aspyr Media]… Expand"}, {"name": "DreamWorks Monsters vs. Aliens", "details_link": "https://www.metacritic.com/game/wii/dreamworks-monsters-vs-aliens", "publisher": "Activision", "release_date": "Mar 24 2009", "developers": ["Beenox"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/1a95bfe1b7f27286c4efb13a8af5f69b-98.jpg", "descriptions": "Based on the DreamWorks 3D feature film, Monsters vs. Aliens puts the fate of the planet in players' hands, to save the world as only a monster can. Bash, skate, and ooze as the macho half-ape, half-fish The Missing Link, the 49’11\" tall woman, Ginormica, and the gelatinous, indestructible,Based on the DreamWorks 3D feature film, Monsters vs. Aliens puts the fate of the planet in players' hands, to save the world as only a monster can. Bash, skate, and ooze as the macho half-ape, half-fish The Missing Link, the 49’11\" tall woman, Ginormica, and the gelatinous, indestructible, and brainless B.O.B, with the help of the monstrous 350’ tall grub Insectosaurus. Plus, team up with the brilliant but insect-headed Dr. Cockroach, Ph.D. in co-op mode, to save the earth from the megalomaniacal alien Gallaxhar. Unleash unique powers as all your favorite monsters from the film - The Missing Link: Bash, bounce, swing, tail whip, and climb as this prehistoric brawler! B.O.B: Ooze through cracks, stick to ceilings, and absorb and spit out enemies as this gooey blob! Ginormica: Tower over the landscape, test your strength, and use cars as roller-skates as this battling behemoth. Battle through locations from the movie and beyond - Adventure across 20 distinct levels set in locations from the film and beyond, including the streets of San Francisco, Gallaxhar’s gargantuan spaceship, and the government’s super-secret monster containment facility. Play as a team in co-op mode - A second player can pick up a controller and drop in at anytime as Dr. Cockroach Ph.D. As the most brilliant scientist in the world, players can blast apart robots, toss away enemies, plus grab hard-to-reach upgrades and other rewards.… Expand"}, {"name": "Gyrostarr", "details_link": "https://www.metacritic.com/game/wii/gyrostarr", "publisher": "High Voltage Software", "release_date": "Jun 23 2008", "developers": ["High Voltage Software"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/5ba93265d736bfb272e94e00ca66c44d-98.jpg", "descriptions": "[WiiWare]  Gyrostarr challenges you and up to three additional players to pilot your ships through a series of twisting, turning technoplasma tracks while battling a variety of deadly alien foes at ever-increasing speeds. While fighting and maneuvering, you must collect enough energy to[WiiWare]  Gyrostarr challenges you and up to three additional players to pilot your ships through a series of twisting, turning technoplasma tracks while battling a variety of deadly alien foes at ever-increasing speeds. While fighting and maneuvering, you must collect enough energy to activate the ancient warpgate at the end of each track. Succeed, and you can journey to the next, even deadlier track. Fail, and the gate will slam shut, destroying your ship. Enhance your ship with weapon pickups, coordinate attacks with your friends to fire powerful combined blasts and use your grapple to snag energy and pickups in the midst of combat. Control your ship with the Wii Remote controller, Nunchuk controller or Classic Controller, or use the \"paired\" control system that allows two players to use a connected Wii Remote and Nunchuk or Classic Controller at the same time. Offering 50 levels of intense action, powerful pickups, high-speed bonus levels and mayhem for up to four players, Gyrostarr is a killer arcade challenge. [Nintendo]… Expand"}, {"name": "NBA 10 The Inside", "details_link": "https://www.metacritic.com/game/psp/nba-10-the-inside", "publisher": "SCEA", "release_date": "Oct  6 2009", "developers": ["SCEA San Diego Studios"], "platforms": "PSP", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 69, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/2/4e2f763e40bffac324d0ee882efce448-98.jpg", "descriptions": "Franchise and Playoff Modes. Be the All-Star on the court played at a smooth 60 FPS. Be the General Manager making all the right deals. Play ad-hoc against your friends. All New Quest Modes: Dodge, Give & Go and MiniQuest strategy games allow the player to battle across the country forFranchise and Playoff Modes. Be the All-Star on the court played at a smooth 60 FPS. Be the General Manager making all the right deals. Play ad-hoc against your friends. All New Quest Modes: Dodge, Give & Go and MiniQuest strategy games allow the player to battle across the country for ultimate NBA domination. Crazier Mini-Games. Need a little break from your serious hoop time? Welcome to the Block Party with all new arcade-style games like Cherry Pickin’ and Bowling, joining classics like H.O.R.S.E, Alley Oop, Bang the Boards, Shootin’ Bricks, and Own the Court. [SCEA]… Expand"}, {"name": "Star Fox Zero", "details_link": "https://www.metacritic.com/game/wii-u/star-fox-zero", "publisher": "Nintendo", "release_date": "Apr 22 2016", "developers": ["PlatinumGames"], "platforms": "Wii U", "genres": ["Action", "Third-Person", "Shooter", "Modern", "Rail", "Simulation", "Space", "Combat"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/93fe3745e99538b55e2779480eaea487-98.jpg", "descriptions": "Fox, Falco, Peppy and Slippy (accompanied by their original voice actors) return in a new adventure. Gamers use the GamePad to control their Arwing spaceship and see the view from the cockpit, while the TV shows the overall context of the full battlefield. The title includes a new WalkerFox, Falco, Peppy and Slippy (accompanied by their original voice actors) return in a new adventure. Gamers use the GamePad to control their Arwing spaceship and see the view from the cockpit, while the TV shows the overall context of the full battlefield. The title includes a new Walker transformation for the Arwing, a new Gyrowing vehicle and the return of the Landmaster Tank.… Expand"}, {"name": "Duke Nukem 3D: Megaton Edition", "details_link": "https://www.metacritic.com/game/playstation-vita/duke-nukem-3d-megaton-edition", "publisher": "Devolver Digital", "release_date": "Jan  6 2015", "developers": ["Abstraction Games"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita"], "genres": ["Sci-Fi", "Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Arcade"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/ad083e0a71a82e5e21a93d6c1b5deafa-98.jpg", "descriptions": "Duke Nukem 3D: Megaton Edition is a compilation of the landmark first-person shooter that includes enhanced versions of Duke Nukem 3D: Atomic Edition and three unique expansion packs as well as the original version of the classic game. The iconic Duke Nukem battles it out against a slew ofDuke Nukem 3D: Megaton Edition is a compilation of the landmark first-person shooter that includes enhanced versions of Duke Nukem 3D: Atomic Edition and three unique expansion packs as well as the original version of the classic game. The iconic Duke Nukem battles it out against a slew of alien foes in the original four episode \"Atomic Edition\" single-player campaign and three over-the-top expansion packs that take the loudmouthed hero to a tropical paradise, a winter wonderland, and even Washington D.C. Duke Nukem 3D: Megaton Edition features polished OpenGL visuals, native compatibility with modern PC and Mac computers, Steam Achievements, and Steam Cloud support. Duke Nukem 3D: Megaton Edition will continue to receive feature updates including Steamworks-enabled online multiplayer, new achievements and integration of additional Duke Nukem 3D expansion packs.… Expand"}, {"name": "BloodRayne: Betrayal", "details_link": "https://www.metacritic.com/game/playstation-3/bloodrayne-betrayal", "publisher": "Majesco Games", "release_date": "Sep  6 2011", "developers": ["WayForward"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Platformer", "Fantasy", "General", "Platformer", "Fantasy", "2D", "Third-Person", "2D", "Fantasy"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/a7c7528f060a5a9fdc27af392da097ca-98.jpg", "descriptions": "BloodRayne: Betrayal will be a 2D side-scrolling action game, with the titular half-vampire warrior and a new ally working together to thwart the plans of a group of evil vampires."}, {"name": "Dynasty Warriors 8: Xtreme Legends Complete Edition", "details_link": "https://www.metacritic.com/game/playstation-4/dynasty-warriors-8-xtreme-legends-complete-edition", "publisher": "Tecmo Koei Games", "release_date": "Mar 25 2014", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Miscellaneous", "Beat-'Em-Up", "Compilation", "3D"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/227108ba07c8a9772a672c3310486227-98.jpg", "descriptions": "'Dynasty Warriors 8: Xtreme Legends' introduces entirely new levels of fun to the refreshing gameplay vanquishing swarms of enemies with mighty warriors found in 'Dynasty Warrors 8.' In story mode, where you can immerse yourself in the vivid tales of the Romance of the Three Kingdoms, it is'Dynasty Warriors 8: Xtreme Legends' introduces entirely new levels of fun to the refreshing gameplay vanquishing swarms of enemies with mighty warriors found in 'Dynasty Warrors 8.' In story mode, where you can immerse yourself in the vivid tales of the Romance of the Three Kingdoms, it is now possible to play as the mighty warrior 'Lu Bu,' and embark on a journey that depicts his way of life. Additionally, many new hypothetical scenarios to existing Romance of the Three Kingdoms battles have been added, as well as new playable characters, weapons types, growth/speedrun elements, and more! What's more, a revamped Ambition Mode and completely new Challenge Mode offer whole new ways to enjoy the 'Dynasty Warriors 8' universe.… Expand"}, {"name": "Shark Tale", "details_link": "https://www.metacritic.com/game/playstation-2/shark-tale", "publisher": "Activision", "release_date": "Sep 27 2004", "developers": ["Edge of Reality"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/87e5040959a0bca89e0bcec81a866556-98.jpg", "descriptions": "In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish?at least that?s what he wants you think. Dive in to the urban, underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on theIn the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish?at least that?s what he wants you think. Dive in to the urban, underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on the upcoming DreamWorks animated feature, Shark Tale features 25 funky fresh missions ripped straight from the film, the hottest hip-hop tracks from your favorite artists and more exhilarating gameplay variety than any other movie game in the reef. Groove through Reef City with Oscar and explore locations like the Whale Wash, the Sunken Liner and the underwater underworld hideout, Seahorse Race Track. Careen through the coral at break-fin speed on the back of a friendly taxi fish. Beat your opponent while dodging traffic and fending off menacing great white sharks! Bust some serious Fish Fu in challenging fighting sequences. Flex your fins, talk some smack and fillet your opponent with tail slaps, head butts and dazzling combo attacks. Get those fins up and boogie down. Win over Reef City residents and garner the affections of your favorite ladyfish with your stylin? hip-hop dance moves. Don?t just talk big?swim big. Get in the game and prove you got what it takes to out-fin the evil Great Whites and become Reef City?s greatest hero. [Activision]… Expand"}, {"name": "Magna Carta 2", "details_link": "https://www.metacritic.com/game/xbox-360/magna-carta-2", "publisher": "Namco Bandai Games America", "release_date": "Oct 13 2009", "developers": ["Banpresto", "SoftMax"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/88b2740ad96425760d55f51d474e7199-98.jpg", "descriptions": "Magnacarta 2 introduces an original new storyline driven by intense themes of love, hate, politics, betrayal and the ultimate question of choosing one’s own fate. Players are immersed in the world of the Lanzheim Continent, a conflict-ridden land deeply divided by a fierce civil war. PoweredMagnacarta 2 introduces an original new storyline driven by intense themes of love, hate, politics, betrayal and the ultimate question of choosing one’s own fate. Players are immersed in the world of the Lanzheim Continent, a conflict-ridden land deeply divided by a fierce civil war. Powered by the Unreal Engine3 and featuring character designs by famed Korean artist Hyung-Tae Kim, the game bears a striking visual style unlike any other RPG through its blend of photo-realism and Japanese manga influences. The deeply emotional story is driven by beautifully rendered CGI cut-scenes featuring fully voiced dialogue to draw players into the immersive experience. Delivering more than 40 hours of gameplay, Magnacarta 2 features a unique battle system which combines strategic turn-based battles and real-time gameplay, creating a fresh twist on the traditional RPG formula. The game seamlessly blends world navigation and battles as everything happens in the same environment with no load screens or abrupt changes in the action when a fight begins or ends. Players can utilize objects found in the environment to their advantage and likewise, creatures and field objects dynamically react to the player’s actions. A free roaming camera further adds to the unrestricted interaction with the world. Players are also given flexible control over their party with the ability to pre-assign attributes for each AI character and freedom to easily switch control between all the characters at any time. Magnacarta 2 features a variety of adaptable options to keep the action fresh throughout the game. By defeating monsters, players obtain Kamonds which can be used to enhance a variety of weapons as well as create new items. When players change their weapon, they take on a different fighting style that adapts all the related moves and skills to that weapon’s attributes. While normal skills can be performed by any player at any time, special moves require skillfully timed actions to exploit the rhythm of the battle to their advantage. The pinnacle of special moves is the over-drive mode where players can use the most powerful combination of skills at one time to perform devastating attacks to defeat enemies. KAN (magic), representing the four elements of nature (Wind, Water, Lightning and Fire), adds another dimension to gameplay whereby players generate KAN for use in battle and to affect environmental objects in various ways. [Namco Bandai Games]… Expand"}, {"name": "SNK Arcade Classics Vol. 1", "details_link": "https://www.metacritic.com/game/playstation-2/snk-arcade-classics-vol-1", "publisher": "SNK Playmore", "release_date": "May  5 2008", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "genres": ["Miscellaneous", "Compilation"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/9931e15edbaeb4bf568f57ca316bfa2e-98.jpg", "descriptions": "ART OF FIGHTING - The first game in SNK's second fighting-game franchise, set in the same universe as FATAL FURY. BASEBALL STARS 2 - The sequel to SNK's popular baseball arcade game. BURNING FIGHT - New York detectives battle organized crime in this fighter. FATAL FURY - First released inART OF FIGHTING - The first game in SNK's second fighting-game franchise, set in the same universe as FATAL FURY. BASEBALL STARS 2 - The sequel to SNK's popular baseball arcade game. BURNING FIGHT - New York detectives battle organized crime in this fighter. FATAL FURY - First released in 1991, FATAL FURY introduced the two-plane fighting system. KING OF FIGHTERS '94 - The first game in the popular KING OF FIGHTERS series. KING OF THE MONSTERS - In KING OF THE MONSTERS, giant monsters fight for power in epic battles. LAST RESORT - A challenging futuristic shooter. MAGICIAN LORD - Players help the wizard Elta save his homeworld in this platformer. METAL SLUG - Known for its humor and fast- moving gameplay, this run-and-gun side-scroller was the first in the popular series. NEO TURF MASTERS - A golf game which debuted on the Neo Geo Pocket Color in 1999. SAMURAI SHODOWN - Set in the 18th century, SAMURAI SHODOWN features bladed-weapon combat and an international cast of characters. SENGOKU - In SENGOKU, players face off against undead feudal Japanese armies. SHOCK TROOPERS - In this run-and-gun adventure, players save a scientist and his granddaughter from the Bloody Scorpions. SUPER SIDEKICKS 3 - A soccer game featuring teams from all over the world. TOP HUNTER - Bounty hunters protect colonists from space pirates in this futuristic action game. WORLD HEROES - This classic fighter pits players against historical figures in a tournament enabled by time travel. [SNK Playmore USA]… Expand"}, {"name": "Shinobi", "details_link": "https://www.metacritic.com/game/3ds/shinobi", "publisher": "Sega", "release_date": "Nov 15 2011", "developers": ["Griptonite Games"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/d6d29a713aee7a63f3191c15c0fe0d05-98.jpg", "descriptions": "Betrayed by your friend you must battle an ancient and evil clan in this epic reboot of the acclaimed Shinobi series. Shinobi captures the classic side-scrolling action from the original Shinobi games. This coupled with intense combat in exotic locations and over the top boss encounters isBetrayed by your friend you must battle an ancient and evil clan in this epic reboot of the acclaimed Shinobi series. Shinobi captures the classic side-scrolling action from the original Shinobi games. This coupled with intense combat in exotic locations and over the top boss encounters is what players have loved since the early days of the series.… Expand"}, {"name": "The Dark Pictures Anthology: Man of Medan", "details_link": "https://www.metacritic.com/game/xbox-one/the-dark-pictures-anthology-man-of-medan", "publisher": "Bandai Namco Games", "release_date": "Aug 30 2019", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/5039f7b2ae642f8cf2e3f4becfaf80e2-98.jpg", "descriptions": "DON'T PLAY ALONE - From the developers of Until Dawn...Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable charactersDON'T PLAY ALONE - From the developers of Until Dawn...Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable characters can live, any and all can die... Man of Medan is the first game in The Dark Pictures anthology, bringing supernatural horror to the South Pacific. Five friends set sail on a holiday diving trip with a rumored WWII wreck to find. As the day unfolds and a storm rolls in, their trip soon changes into something much more sinister. Who will live? Who will die? It's down to you. Can you save them all?\r Features:\r A NEW TERRIFYING EXPERIENCE\rSupermassive Games delivers a new, horrific narrative journey where you will have to confront your deepest fears.\r CAN YOU SAVE THEM ALL?\rAll payable characters can live and all can die. The choices you make will decide their fate. Death could be just around the corner...\r WHAT WILL YOU DO TO SURVIVE?\rEach choice you make has a consequence which can mean life or death for your character. Will you keep your head whilst struggling to survive? What decisions will you make?… Expand"}, {"name": "Glory of Heracles", "details_link": "https://www.metacritic.com/game/ds/glory-of-heracles", "publisher": "Nintendo", "release_date": "Jan 18 2010", "developers": ["Paon Corporation"], "platforms": "DS", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/dcda0abc50de45d7dd736952fdb0631e-98.jpg", "descriptions": "The game is inspired by Greek mythology and written by Kazushige Nojima of Final Fantasy fame. The traditional role-playing game features an engrossing story and a robust battle system. Players can roam the countryside as they encounter new characters and gain experience, or they can visitThe game is inspired by Greek mythology and written by Kazushige Nojima of Final Fantasy fame. The traditional role-playing game features an engrossing story and a robust battle system. Players can roam the countryside as they encounter new characters and gain experience, or they can visit familiar ancient settings like Athens and Sparta. Although the plot is fictional, many of the people and places in the game are based on familiar Greek mythology. An extensive glossary provides more details about the places and characters that heroic Heracles encounters. Players are be treated to animated cut scenes on the screens of their Nintendo DS or Nintendo DSi systems. Players can opt to use the stylus or control pad and buttons to control movement in the game, while the touch screen is required to complete optional challenges used to power up spells or skills during battle. [Nintendo]… Expand"}, {"name": "NiGHTS: Journey of Dreams", "details_link": "https://www.metacritic.com/game/wii/nights-journey-of-dreams", "publisher": "Sega", "release_date": "Dec 18 2007", "developers": ["Sega", "Sonic Team"], "platforms": "Wii", "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/4cd4660ac2095ce2cd1c39a2d6d1aaca-98.jpg", "descriptions": "As a fantasy jester called NiGHTS, experience a heightened sense of gliding, spiraling, and looping through seven extraordinary worlds of Nightopia where the ocean resides in the sky and glass-formed cliffs overlook a castle of mirrors. When the \"Nightmarens\" from the neighboring dark worldAs a fantasy jester called NiGHTS, experience a heightened sense of gliding, spiraling, and looping through seven extraordinary worlds of Nightopia where the ocean resides in the sky and glass-formed cliffs overlook a castle of mirrors. When the \"Nightmarens\" from the neighboring dark world of Nightmare infiltrate the idyllic Nightopia, NiGHTS must defend the dream world to keep it safe for all dreamers. NiGHTS: Journey of Dreams takes you in a voyage filled with courage, hope and inspiration. [Sega]… Expand"}, {"name": "NBA Ballers: Phenom", "details_link": "https://www.metacritic.com/game/playstation-2/nba-ballers-phenom", "publisher": "Midway", "release_date": "Apr  5 2006", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/f8fa655a84217b5f2d5e14772857b399-98.jpg", "descriptions": "Here it is...The NBA Finals in sunny Los Angeles, California. It's time for all the unknowns from around the world to step on the court and get noticed by the right people. From scouts and coaches to casting directors, everyone is looking for the next \"phenom.\" You have one week to check outHere it is...The NBA Finals in sunny Los Angeles, California. It's time for all the unknowns from around the world to step on the court and get noticed by the right people. From scouts and coaches to casting directors, everyone is looking for the next \"phenom.\" You have one week to check out the city and prove that you're the one everyone is looking for. Take the trophy in unique basketball tournaments, customize your style to get all the eyes on you, and interact with the local scene. By the end of the week, you could be the #1 draft pick of the NBA or on your way to your own entertainment empire. Have you got the skills to prove you belong at the top? [Midway]… Expand"}, {"name": "Jurassic World Evolution", "details_link": "https://www.metacritic.com/game/pc/jurassic-world-evolution", "publisher": "Frontier Developments", "release_date": "Jun 11 2018", "developers": ["Frontier Developments"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/2e907bd8e5902f1d27bcbcee651b4a0e-98.jpg", "descriptions": "Place yourself at the heart of the Jurassic franchise and build your own Jurassic World. Take charge of operations on the legendary islands of the Muertes archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for Science, Entertainment or Security interests in anPlace yourself at the heart of the Jurassic franchise and build your own Jurassic World. Take charge of operations on the legendary islands of the Muertes archipelago and bring the wonder, majesty and danger of dinosaurs to life. Build for Science, Entertainment or Security interests in an uncertain world where life always finds a way.\rBioengineer dinosaurs that think, feel and react intelligently to the world around them. Play with life itself to give your dinosaurs unique behaviours, traits and appearances, then contain and profit from them to fund your global search for lost dinosaur DNA.\rControl the big picture with deep management tools or go hands-on to confront challenges on the ground or in the air. Expand your islands and choose your own journey in an all-new narrative featuring iconic characters from across the franchise and decades of Jurassic lore at your fingertips.… Expand"}, {"name": "Blitz: The League", "details_link": "https://www.metacritic.com/game/xbox-360/blitz-the-league", "publisher": "Midway", "release_date": "Nov 13 2006", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/a9a00a3cfda4d402fa4b4f82c2ce8509-98.jpg", "descriptions": "The game which revolutionized pro football videogames is back and better than ever, starring new bad boy, Bill Romanowski, as Baltimore Bearcats linebacker Bruno Batagglia, and the return of Lawrence Taylor, as Quentin Sands. Step onto the field with more customizable options than everThe game which revolutionized pro football videogames is back and better than ever, starring new bad boy, Bill Romanowski, as Baltimore Bearcats linebacker Bruno Batagglia, and the return of Lawrence Taylor, as Quentin Sands. Step onto the field with more customizable options than ever before, with new cities, logos, and unlockable players which will help you to create what could be the greatest franchise in League history. Take your team online and dominate your opponents using new offensive and defensive evasion moves, or try and defeat the new all-star teams stacked with the best talent on the field. Get ready for another dramatic season of Blitz and experience The League like never before. [Midway]… Expand"}, {"name": "The King of Fighters: Maximum Impact - Maniax", "details_link": "https://www.metacritic.com/game/xbox/the-king-of-fighters-maximum-impact---maniax", "publisher": "SNK Playmore", "release_date": "Jun 28 2005", "developers": ["SNK Playmore"], "platforms": "Xbox", "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/097c4c97eb3a4c592165a16249cb076a-98.jpg", "descriptions": "The first-ever 3D version of King of Fighters has finally arrived, complete with all your favorite SNK characters. In King of Fighters: Maximum Impact, rival gangs are vying for the chance to rule the underworld of Southtown. As one of more than 16 fighters, you must prove that you're theThe first-ever 3D version of King of Fighters has finally arrived, complete with all your favorite SNK characters. In King of Fighters: Maximum Impact, rival gangs are vying for the chance to rule the underworld of Southtown. As one of more than 16 fighters, you must prove that you're the greatest fighter in the world in five gameplay modes, including Story, Versus, Survival, Practice, and Training. The game's enhanced character movement lets you perform four new jumps, powerful combo moves, and the new Knock Back Attack.… Expand"}, {"name": "Q.U.B.E.", "details_link": "https://www.metacritic.com/game/pc/qube", "publisher": "Toxic Games", "release_date": "Dec 17 2011", "developers": ["Toxic Games"], "platforms": "PC", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Logic", "Logic"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/fa675b7e240f10afd2d9891e3afff0da-98.jpg", "descriptions": "Set in a mysterious and abstract sterile environment, Q.U.B.E. (Quick Understanding of Block Extrusion) is a first-person puzzle game that challenges players to navigate each level by manipulating coloured cubes that surround them. There"}, {"name": "Ghost Squad", "details_link": "https://www.metacritic.com/game/wii/ghost-squad", "publisher": "Sega", "release_date": "Nov 20 2007", "developers": ["Artificial Mind and Movement", "Polygon Magic"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/a7019105d9eb17e6fda29539f40a4c8a-98.jpg", "descriptions": "The world in Ghost Squad is overrun with terrorism, affecting all corners of the globe. In an effort to combat the malicious plans of the terrorist groups, the U.N. created the Global Humanitarian-Operation and Special Tactics Squad aka \"Ghost Squad.\" This team of elite soldiers is comprisedThe world in Ghost Squad is overrun with terrorism, affecting all corners of the globe. In an effort to combat the malicious plans of the terrorist groups, the U.N. created the Global Humanitarian-Operation and Special Tactics Squad aka \"Ghost Squad.\" This team of elite soldiers is comprised of the best of the best\" from both domestic and foreign military and special operations forces. Ghost Squad missions involve entering a situation with stealth, executing extreme prejudice upon terrorist subjects, and leaving a target area with no trace of their prior presence. The game features the use of the Wii Remote as a multi-purpose tool that allows players to easily control the targeting of on-screen enemies, defuse bombs, and rescue hostages. With a squad of three others, players traverse three different mission areas each comprised of multiple levels, unlocking 25 high-powered weapons as they progress. Within each level there are a series of selectable alternate routes that provide the gamer with increasing challenges as enemies attack from unexpected places. Weapon selection is varied across a wide array of weapon types ranging from machine guns, submachine guns, pistols, sniper rifles, shotguns, and even crossbows. Ghost Squad features an Arcade mode, a Multiplayer mode for up to four players, and more. [Sega]… Expand"}, {"name": "Monster Energy Supercross - The Official Videogame 6", "details_link": "https://www.metacritic.com/game/playstation-5/monster-energy-supercross---the-official-videogame-6", "publisher": "Milestone S.r.l", "release_date": "Mar  9 2023", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/de8c45e789d999d3d2e259ff8e1cd946-98.jpg", "descriptions": "Mud, sweat, fun and adrenaline: find the rider in you and jump into the action with Monster Energy Supercross 6. Live all the emotions of the Monster Energy Supercross 2022 Championship with the official bikes, riders, and tracks. Take advantage of the wide range of settings to customizeMud, sweat, fun and adrenaline: find the rider in you and jump into the action with Monster Energy Supercross 6. Live all the emotions of the Monster Energy Supercross 2022 Championship with the official bikes, riders, and tracks. Take advantage of the wide range of settings to customize every detail of your game experience, freely choosing the amount of realism and riding ease. This year, Supercross 6 follows an entirely new and unique perspective - yours!… Expand"}, {"name": "Lone Ruin", "details_link": "https://www.metacritic.com/game/switch/lone-ruin", "publisher": "Super Rare Originals", "release_date": "Jan 12 2023", "developers": ["Cuddle Monster Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/3242649eb9d2e16fd4e24c94a18270fa-98.jpg", "descriptions": "LONE RUIN is a spell-based roguelike twin-stick shooter with a focus on replayability. Play as an explorer who seeks a mysterious ancient power and venture in a ruined magical city, built atop a source of magic used by olden mages to power and transform themselves.\r \rDive deeper andLONE RUIN is a spell-based roguelike twin-stick shooter with a focus on replayability. Play as an explorer who seeks a mysterious ancient power and venture in a ruined magical city, built atop a source of magic used by olden mages to power and transform themselves.\r \rDive deeper and deeper, battling your way through twisted creatures, utilising your very own magic abilities to ultimately reach the center of the Lone Ruin.… Expand"}, {"name": "High on Life", "details_link": "https://www.metacritic.com/game/pc/high-on-life", "publisher": "Squanch Games", "release_date": "Dec 13 2022", "developers": ["Squanch Games"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/d09aa789f2d7a0d1684b544823cec2a3-98.jpg", "descriptions": "Fresh out of high school with no job and no ambition, you've really got nothing going for you until an alien cartel that wants to get high off humanity invades Earth. Now, you and a team of charismatic talking guns must answer the hero's call and become the deadliest intergalactic bountyFresh out of high school with no job and no ambition, you've really got nothing going for you until an alien cartel that wants to get high off humanity invades Earth. Now, you and a team of charismatic talking guns must answer the hero's call and become the deadliest intergalactic bounty hunter the cosmos has ever seen.\r Travel to various planets and locations across the cosmos, go up against the nefarious Garmantuous and his gang of goons, collect loot, meet unique characters, and more, in the latest comedy adventure from Justin Roiland!\r Navigate dynamic and changing worlds that range from a jungle paradise, to a city built inside an asteroid, the hub of the cosmos.\r Leverage the distinct skills of each gun to defeat a variety of diabolical alien enemies and track down Garmantuous.\r Complete hunter challenges, meet weird, fun, and hilarious characters, collect an array of alien technology, and more!… Expand"}, {"name": "Ghostbusters: Spirits Unleashed", "details_link": "https://www.metacritic.com/game/pc/ghostbusters-spirits-unleashed", "publisher": "IllFonic", "release_date": "Oct 18 2022", "developers": ["IllFonic"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/2d271a8c7c1a1f0d206ca1b6f986e63b-98.jpg", "descriptions": "Ghostbusters: Spirits Unleashed is coming to a platform near you. As a Ghostbuster, join with other Ghostbusters to chase and trap ghosts in museums, prisons, hotels, and more, and capture the ghosts before they can fully haunt the areas. Or, as the Ghost, hide, sneak, surprise, scare, andGhostbusters: Spirits Unleashed is coming to a platform near you. As a Ghostbuster, join with other Ghostbusters to chase and trap ghosts in museums, prisons, hotels, and more, and capture the ghosts before they can fully haunt the areas. Or, as the Ghost, hide, sneak, surprise, scare, and of course, slime Ghostbusters and civilians until the everything has gone completely spooky. Use trickery, deception, and Ectoplasm to gain the upper hand and drive the Ghostbusters out.… Expand"}, {"name": "Disney Magical World 2: Enchanted Edition", "details_link": "https://www.metacritic.com/game/switch/disney-magical-world-2-enchanted-edition", "publisher": "Nintendo", "release_date": "Dec  3 2021", "developers": ["h.a.n.d. Inc."], "platforms": "Switch", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/b9c3f926712e1ba6af739662e9370482-98.jpg", "descriptions": "Disney Magical World 2: Enchanted Edition is the latest installment in the popular Disney franchise. For the first time on Switch, the game lets players enjoy a variety of new adventures in six Disney-themed worlds, such as exploring the world of Disney Frozen, dancing with Disney princessesDisney Magical World 2: Enchanted Edition is the latest installment in the popular Disney franchise. For the first time on Switch, the game lets players enjoy a variety of new adventures in six Disney-themed worlds, such as exploring the world of Disney Frozen, dancing with Disney princesses or engaging in quests and dungeons. Players will encounter and interact with well-known characters like Mickey Mouse, Donald Duck, Goofy, Elsa, Anna, Olaf, Ariel... and run their own cafe!Features:* 6 DISNEY WORLDS and all your favorite characters that you can discover through portals: Frozen, Snow White* Discover the area where you travel to new worlds, interact with different residents of Castleton and unlock new accessories!* DUNGEONS to defeat: come test your fieriness, help your residents of Castleton and win gems to use at the castle!* Thousands of CUSTOMIZATIONS to make your best avatar in the game you can even customize your clothes!* Gather materials to CRAFT new accessories, furniture, clothes or delicious food!* RUN YOUR OWN CAFE and make sure that you satisfy all Disney habitants! Use your earning to decorate even more your place.* EMBELLISH your own house with furniture made from materials you've collected!… Expand"}, {"name": "The Survivalists", "details_link": "https://www.metacritic.com/game/pc/the-survivalists", "publisher": "Team17", "release_date": "Oct  9 2020", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/5c90ebd387fdf097db7e9dcf353064c5-98.jpg", "descriptions": "A living world full of surprises, secrets and danger awaits in The Survivalists, an adventure-filled survival sandbox set in The Escapists universe. Explore, build, craft and even train monkeys with up to three friends in a desperate bid to survive. Have you got what it takes to be a Survivalist?"}, {"name": "Metamorphosis", "details_link": "https://www.metacritic.com/game/pc/metamorphosis", "publisher": "Ovid Works", "release_date": "Aug 12 2020", "developers": ["Ovid Works"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/c6b1d1ec73c9ca4e9b51c36ec0d34a7a-98.jpg", "descriptions": "Play as Gregor, turned into a tiny bug, and set out on an extraordinary journey to unravel the mystery of your transformation. Metamorphosis is a first person adventure set in a surrealist world where your newfound abilities are your last and only hope for redemption."}, {"name": "Edna & Harvey: The Breakout - 10th Anniversary Edition", "details_link": "https://www.metacritic.com/game/playstation-4/edna-harvey-the-breakout---10th-anniversary-edition", "publisher": "Daedalic Entertainment", "release_date": "Jun 17 2020", "developers": ["Daedalic Entertainment", "The Knights of Unity"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/792b980c23c1adfeb51048474b0238f4-98.jpg", "descriptions": "When Edna wakes up, she has no memories of her past. And though she hasn't the slightest idea how she ended up in a sanatorium cell, one thing is certain: She wants to get out of there!\rAfter all, she feels sane – and her talking plush bunny Harvey absolutely agrees. Together they makeWhen Edna wakes up, she has no memories of her past. And though she hasn't the slightest idea how she ended up in a sanatorium cell, one thing is certain: She wants to get out of there!\rAfter all, she feels sane – and her talking plush bunny Harvey absolutely agrees. Together they make their escape and meet the weirdest inmates – from a man in a bee costume to the pseudo-siamese twins. But Dr. Marcel, the head of the sanatorium does everything in his power to stop Edna. What is his endgame? And why has her memory been wiped? Bit by bit, Edna remembers the time before the sanatorium... … Expand"}, {"name": "The Mage's Tale", "details_link": "https://www.metacritic.com/game/playstation-4/the-mages-tale", "publisher": "InXile Entertainment", "release_date": "Feb  5 2019", "developers": ["InXile Entertainment"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 69, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/4fdb2675881517eae8fae536c899b4eb-98.jpg", "descriptions": "The corrupt wizard Gaufroi has kidnapped your master, and only YOU have any hope of saving him. Explore 10 deadly dungeons, decipher mind-bending puzzles, avoid terrifying traps, and vanquish hordes of vicious monsters… in VR."}, {"name": "Earth Atlantis", "details_link": "https://www.metacritic.com/game/xbox-one/earth-atlantis", "publisher": "Headup Games", "release_date": "Jun  1 2018", "developers": ["Pixel Perfex"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/9668682be42c9605c0480b63283f6675-98.jpg", "descriptions": "A side-scrolling shooter with a monster hunting gameplay, you must search and hunt down dreadful sea monsters and explore the post-apocalyptic underwater world of Earth Atlantis. Unlock multiple ships with special weapons and abilities for your journey and become a legendary hunter."}, {"name": "Uno", "details_link": "https://www.metacritic.com/game/switch/uno", "publisher": "Ubisoft", "release_date": "Nov  7 2017", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/7892493126e15078f0000a02add6dac8-98.jpg", "descriptions": "Uno makes its return to consoles and PC with an assortment of exciting features such as added video chat support and an all new theme system which adds more fun to enjoy your Uno game!Match cards either by matching color or value and play action cards to change things up. Race againstUno makes its return to consoles and PC with an assortment of exciting features such as added video chat support and an all new theme system which adds more fun to enjoy your Uno game!Match cards either by matching color or value and play action cards to change things up. Race against others to empty your hand before everyone else in either Classic Play or customize your experience with a variety of House Rules and match settings to ensure you and your friends never play the same game twice!Also, get ready to shake things up with new branded themes introducing never-before-seen Theme Cards that really change the way you play the game!… Expand"}, {"name": "De Mambo", "details_link": "https://www.metacritic.com/game/switch/de-mambo", "publisher": "Chorus Worldwide", "release_date": "Jul 13 2017", "developers": ["The Dangerous Kitchen"], "platforms": ["PC", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/0fe64cd41f300bd8d0bd613071bbe9d0-98.jpg", "descriptions": "De Mambo lets 1-4 players engage in Mambo Combat. Grab a Joy-Con and charge your measly one button and release at different times to do three different attacks. Knock your opponents off the screen and break the level however you decide (thanks to some flimsy architecture), to make your gameDe Mambo lets 1-4 players engage in Mambo Combat. Grab a Joy-Con and charge your measly one button and release at different times to do three different attacks. Knock your opponents off the screen and break the level however you decide (thanks to some flimsy architecture), to make your game marginally different each time you play. De Mambo is the first game by The Dangerous Kitchen, dedicated to all those who helped us reach this point. [Nintendo]… Expand"}, {"name": "The Signal From Tolva", "details_link": "https://www.metacritic.com/game/pc/the-signal-from-tolva", "publisher": "Big Robot Ltd", "release_date": "Apr 10 2017", "developers": ["Big Robot Ltd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/b64d1b229e82fa3094612defc15b8a4c-98.jpg", "descriptions": "The Signal From Tölva is an open-world first-person shooter set on a distant, haunted, future world. Unlock savage weapons and recruit robots to fight alongside you as rival factions struggle to discover the source of the mysterious signal. What you discover will decide the fate of a world."}, {"name": "ClusterTruck", "details_link": "https://www.metacritic.com/game/xbox-one/clustertruck", "publisher": "tinyBuild", "release_date": "Oct 28 2016", "developers": ["tinyBuild"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/4b026a7b610e2a961d129a8520b9194f-98.jpg", "descriptions": "ClusterTruck is a chaotic physics based truckformer. Jump your way through insane levels in a game of \"the floor is lava\" on top of speeding trucks driven by terrible drivers. The game only gets harder when dangers such as swinging hammers, lasers and flamethrowers are added."}, {"name": "Super Exploding Zoo", "details_link": "https://www.metacritic.com/game/playstation-4/super-exploding-zoo", "publisher": "Honeyslug Ltd", "release_date": "Jun  2 2015", "developers": ["Honeyslug Ltd"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 69, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/0027a741295140cabc79abe28bdc5abb-98.jpg", "descriptions": "Round up herds of exploding animals and rampage around 80 destructible levels - defend your precious egg by slamming your herd into the greedy alien marauders and blowing them up. Use the special skills of different animal types to slow alien progress or access new areas. Super Exploding ZooRound up herds of exploding animals and rampage around 80 destructible levels - defend your precious egg by slamming your herd into the greedy alien marauders and blowing them up. Use the special skills of different animal types to slow alien progress or access new areas. Super Exploding Zoo is part Arcade, Puzzle and Tower Defence all wrapped up in one.… Expand"}, {"name": "Toybox Turbos", "details_link": "https://www.metacritic.com/game/pc/toybox-turbos", "publisher": "Codemasters", "release_date": "Nov 11 2014", "developers": ["Codemasters"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/ca7fcd143f2670b7616cd13a73ea7df8-98.jpg", "descriptions": "Race for the line in Classic Races, establish your best time in Time Trial, pass as many turbocharged toys as you can in Overtake, avoid getting wiped out by the tide in Escape and beat the clock in Countdown. You’ll also take on bosses in multi-round Elimination mode. [Codemasters]"}, {"name": "Minimum", "details_link": "https://www.metacritic.com/game/pc/minimum", "publisher": "Atari", "release_date": "Sep 10 2014", "developers": ["Human Head Studios"], "platforms": "PC", "genres": ["Action", "General"], "meta_score": 69, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/0f5da44409b307a54e81f7728248ad32-98.jpg", "descriptions": "Set in a minimalistic stylized universe, Minimum features fast-paced combat with an elaborate blueprint crafting system that pits two teams against each other with their own gigantic robotic Titan. Collect materials from fallen foes and build damaging weapons to become deadlier as matches progress."}, {"name": "Risen 2: Dark Waters", "details_link": "https://www.metacritic.com/game/pc/risen-2-dark-waters", "publisher": "Deep Silver", "release_date": "Apr 24 2012", "developers": ["Piranha Bytes"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General", "Action RPG"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/ea53a706867454088fc74cf929d7c85f-98.jpg", "descriptions": "Set several years after the end of Risen, raging titans have devastated the world and pushed humanity to the brink of existence. Subsequently, monstrous creatures have risen from the watery depths of the sea and their attacks have brought all seafaring to a grinding halt. The hero, now aSet several years after the end of Risen, raging titans have devastated the world and pushed humanity to the brink of existence. Subsequently, monstrous creatures have risen from the watery depths of the sea and their attacks have brought all seafaring to a grinding halt. The hero, now a member of the Inquisition, is sent out to find out how to stop the chaos caused by these creatures from the deep.  His quest begins with rumors that the pirates who frequent the southern islands are the only ones who know a way to get rid of the creatures once and for all and end their reign of terror.… Expand"}, {"name": "nail'd", "details_link": "https://www.metacritic.com/game/pc/naild", "publisher": "Deep Silver", "release_date": "Nov 30 2010", "developers": ["Techland"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/8c086260dd922bfaf4eb6e84214a316d-98.jpg", "descriptions": "nail’d is all about eschewing boring realism for over the top arcade fun. It’s a racer that challenges everything from player reflexes through to the rules of physics. Riding on ATVs and motocross bikes with powerful boost controls, players will race down near-vertical courses of incrediblenail’d is all about eschewing boring realism for over the top arcade fun. It’s a racer that challenges everything from player reflexes through to the rules of physics. Riding on ATVs and motocross bikes with powerful boost controls, players will race down near-vertical courses of incredible jumps, stunts and obstacles. The brutal challenge of the Yosemite National Park is but one of the places they’ll learn the meaning of verticality.… Expand"}, {"name": "Cryostasis: The Sleep of Reason", "details_link": "https://www.metacritic.com/game/pc/cryostasis-the-sleep-of-reason", "publisher": "Aspyr", "release_date": "Apr 24 2009", "developers": ["Action Forms Ltd."], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/ad86b8415413ae4898a614e4ce88259f-98.jpg", "descriptions": "Cryostasis takes place in 1981 on a nuclear ice breaker called the North Wind, which has become shipwrecked near the North Pole. The main character, Alexander Nesterov is a Russian meteorologist who must investigate what happened onboard the ship. But he’s not alone and the North Wind is nowCryostasis takes place in 1981 on a nuclear ice breaker called the North Wind, which has become shipwrecked near the North Pole. The main character, Alexander Nesterov is a Russian meteorologist who must investigate what happened onboard the ship. But he’s not alone and the North Wind is now plagued by dead crewmen who have undergone a bizarre metamorphosis due to the effects of the incredibly cold climate. Alexander must try to unravel the mystery of the ship captain’s death and discover whether it was the cold or, possibly, something far more sinister. [1C Company]… Expand"}, {"name": "Tom Clancy's EndWar", "details_link": "https://www.metacritic.com/game/ds/tom-clancys-endwar", "publisher": "Ubisoft", "release_date": "Nov  4 2008", "developers": ["Funatics Software", "Funatics"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Strategy", "Real-Time", "Wargame", "Turn-Based", "Military", "Tactics"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/1b7b693ab71646872748076a73cbbf05-98.jpg", "descriptions": "Tom Clancy's EndWar for handhelds allows players to command an elite military force on the ground, in the air and on the seas during World War III. Take control of the elite U.S. Joint Strike Force, European Enforcers Corps or Russian Spetsnaz Guards Brigade and lead your faction to victoryTom Clancy's EndWar for handhelds allows players to command an elite military force on the ground, in the air and on the seas during World War III. Take control of the elite U.S. Joint Strike Force, European Enforcers Corps or Russian Spetsnaz Guards Brigade and lead your faction to victory in three separate yet interwoven single-player campaigns. Each campaign includes over 30 battle scenarios taking place on real-world battlefields including Paris and London, and features increasingly challenging missions and objectives. Fight against a friend in tense two-player battles in any of the 100 ready-to-play scenarios or in your own custom-created missions. Turn-based strategy with a twist: Simultaneous move and attack phases make the experience as intense and authentic as real-time strategy. Three campaigns, one for each faction, with increasingly challenging battle scenarios and objectives. Over 20 units and vehicles per faction including ground, air and naval units. Units gain experience in combat, dramatically improving their combat performance. Two-player versus multiplayer mode, including additional missions specifically designed for multiplayer battles. Easy-to-pick-up mission editor: Create and share your custom battlefields and battle scenarios to play solo or against another player. [Ubisoft]… Expand"}, {"name": "Silent Scope Complete", "details_link": "https://www.metacritic.com/game/xbox/silent-scope-complete", "publisher": "Konami", "release_date": "Feb 10 2004", "developers": ["Konami"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Shooter", "Rail"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/9ec7e956290f0006a227f899f379929c-98.jpg", "descriptions": "The entire arcade precision shooting experience comes to Xbox with Silent Scope Complete.  Bundled in one comprehensive package comes all three Silent Scope games released on arcade and an additional bonus game created exclusively for the console.  This action-packed combination offers moreThe entire arcade precision shooting experience comes to Xbox with Silent Scope Complete.  Bundled in one comprehensive package comes all three Silent Scope games released on arcade and an additional bonus game created exclusively for the console.  This action-packed combination offers more than 50 levels, multiple endings and routes, and hidden stages and modes.  Together with light gun support for the MadCatz Blaster, this complete Silent Scope experience is a welcome addition for Xbox owners.… Expand"}, {"name": "The Haunted Mansion", "details_link": "https://www.metacritic.com/game/gamecube/the-haunted-mansion", "publisher": "TDK Mediactive", "release_date": "Oct 14 2003", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/bcde956d2e7f656736a58237faddf0c8-98.jpg", "descriptions": "The Disneyland attraction is making a video game appearance in The Haunted Mansion.  In the famous house of wall-to-wall creeps and hot-and-cold running chills, you play Zeke, a boy burdened with the unenviable task of putting 999 evil spirits to rest while trying to keep himself fromThe Disneyland attraction is making a video game appearance in The Haunted Mansion.  In the famous house of wall-to-wall creeps and hot-and-cold running chills, you play Zeke, a boy burdened with the unenviable task of putting 999 evil spirits to rest while trying to keep himself from becoming number 1000.  Inspired by the both the movie and the ride, Haunted Mansion's environments feature unique puzzles, secret passageways, and plenty of areas for you to run, jump, fight, and climb your way through the mansion.  There's no turning back now.… Expand"}, {"name": "Haven: Call of the King", "details_link": "https://www.metacritic.com/game/playstation-2/haven-call-of-the-king", "publisher": "Midway", "release_date": "Nov 17 2002", "developers": ["Traveller's Tales"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/9c3742f992f08bc8b807607de81c8d9e-98.jpg", "descriptions": "Played out through an epic tale of a hero who seeks to liberate his people from the tyranny of enslavement, Haven: Call of the King provides total freedom to move anywhere both on foot or vehicle and spans seamless transitions between turret-based shooting, boat racing, bike battles, planePlayed out through an epic tale of a hero who seeks to liberate his people from the tyranny of enslavement, Haven: Call of the King provides total freedom to move anywhere both on foot or vehicle and spans seamless transitions between turret-based shooting, boat racing, bike battles, plane flight, gladiator arena combat and space exploration. [Midway]… Expand"}, {"name": "Defender", "details_link": "https://www.metacritic.com/game/xbox/defender", "publisher": "Midway", "release_date": "Oct 22 2002", "developers": ["7 Studios"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/990f672d4c8d532188ffdffd293cdbef-98.jpg", "descriptions": "Defender undergoes a 3D makeover, featuring fast-paced action, strategy, and an army of aliens. A remake of an arcade classic, Defender sends you on a mission to defend your solar system and save the human race from alien invasion. In addition to space combat action, the game showcasesDefender undergoes a 3D makeover, featuring fast-paced action, strategy, and an army of aliens. A remake of an arcade classic, Defender sends you on a mission to defend your solar system and save the human race from alien invasion. In addition to space combat action, the game showcases elements of strategy, multiple types of humans to protect and use, ground units for players to defend and position, and bases to build and expand. And now, you can upgrade your Defender ships with special weapons, shields, and other technologies.… Expand"}, {"name": "Leadfoot", "details_link": "https://www.metacritic.com/game/pc/leadfoot", "publisher": "WizardWorks", "release_date": "Jun  1 2001", "developers": ["Ratbag"], "platforms": "PC", "num_players": "1-10 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/5333025350dc5f5caeeef2177782bfc8-98.jpg", "descriptions": "Ratbag, the developers of the \"Dirt Track Racing\" series, brings us their latest budget-priced short-track racer (a first for the PC) which features 8 different vehicles, 12 custom tracks, and realistic vehicle damage physics.  Racers compete for prize money and sponsorship cash to throwRatbag, the developers of the \"Dirt Track Racing\" series, brings us their latest budget-priced short-track racer (a first for the PC) which features 8 different vehicles, 12 custom tracks, and realistic vehicle damage physics.  Racers compete for prize money and sponsorship cash to throw back into car improvements in the career mode.… Expand"}, {"name": "Operation Flashpoint: Red River", "details_link": "https://www.metacritic.com/game/xbox-360/operation-flashpoint-red-river", "publisher": "Codemasters", "release_date": "Jun  7 2011", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/860978505e09008b8c4e6bf348a31bbe-98.jpg", "descriptions": "Taking a small step into the future, Red River depicts a fictional conflict with contemporary geopolitical themes, which will unfold over three distinct acts in both single player and drop-in-drop-out co-operative play for up to four players online. Faced with new counter-insurgency combatTaking a small step into the future, Red River depicts a fictional conflict with contemporary geopolitical themes, which will unfold over three distinct acts in both single player and drop-in-drop-out co-operative play for up to four players online. Faced with new counter-insurgency combat and the returning threat of the Chinese PLA, players will feel the tension, brutality and carnage of modern conflict from the perspective of a marine fireteam on deployment in a hostile country, thousands of miles from home.… Expand"}, {"name": "LEGO The Incredibles", "details_link": "https://www.metacritic.com/game/playstation-4/lego-the-incredibles", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 15 2018", "developers": ["TT Games", "TT Fusion"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/4b1722f01c738dc83f372d64ebd7430b-98.jpg", "descriptions": "LEGO The Incredibles, a new video game where players take control of their favourite Incredibles characters in unforgettable scenes and action sequences from both Disney Pixar films, The Incredibles and the upcoming The Incredibles 2. The game encourages players to work together by combiningLEGO The Incredibles, a new video game where players take control of their favourite Incredibles characters in unforgettable scenes and action sequences from both Disney Pixar films, The Incredibles and the upcoming The Incredibles 2. The game encourages players to work together by combining the Parr family's abilities and unique powers to conquer crime and family life in a LEGO world full of fun and humour. With LEGO The Incredibles, fans can experience the non-stop action from both movies while fighting crime together as a super hero family. In LEGO The Incredibles, players explore action-packed story levels and an epic hub world, including Municiberg and New Urbem, as they use their unique super abilities to bring the city's villains to justice.… Expand"}, {"name": "Warhammer: Chaosbane", "details_link": "https://www.metacritic.com/game/pc/warhammer-chaosbane", "publisher": "Bigben Interactive", "release_date": "May 31 2019", "developers": ["Games Workshop"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/f12af86ab9691fdb7660fc055e1acfe7-98.jpg", "descriptions": "In a world ravaged by war and dominated by magic, you must rise up to face the Chaos hordes. Playing solo or with up to four players in local or online co-op, choose a hero from four character classes and prepare for epic battles wielding some of the most powerful artefacts of the Old World."}, {"name": "Battlefield Heroes", "details_link": "https://www.metacritic.com/game/pc/battlefield-heroes", "publisher": "Electronic Arts", "release_date": "Jun 25 2009", "developers": ["EA DICE"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Tactical"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/cbc3a9fe52e1348fac27161076c726ef-98.jpg", "descriptions": "Battlefield Heroes is a brand new Play 4 Free game from the people that brought you the multi-million selling \"Battlefield 1942\" and \"Battlefield 2\"\rIt's a fun cartoon-style shooter which caters to players of all skill levels – easy to pick up and play, but with deep character development.Battlefield Heroes is a brand new Play 4 Free game from the people that brought you the multi-million selling \"Battlefield 1942\" and \"Battlefield 2\"\rIt's a fun cartoon-style shooter which caters to players of all skill levels – easy to pick up and play, but with deep character development. [Electronic Arts]… Expand"}, {"name": "Alone in the Dark: Inferno", "details_link": "https://www.metacritic.com/game/playstation-3/alone-in-the-dark-inferno", "publisher": "Atari", "release_date": "Nov 18 2008", "developers": ["Eden Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 69, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/79dd892542776d8983125d5607955a80-98.jpg", "descriptions": "Taking inspiration from the presentation style and structure of a number of acclaimed and globally popular TV action dramas, Alone in the Dark: Inferno  is split into a number of distinct episodes in a season-style format. With approximately 30-40 minutes of gameplay comprising each episode,Taking inspiration from the presentation style and structure of a number of acclaimed and globally popular TV action dramas, Alone in the Dark: Inferno  is split into a number of distinct episodes in a season-style format. With approximately 30-40 minutes of gameplay comprising each episode, the structure of Alone in the Dark is adapted for an audience familiar with the hard-hitting bite-size delivery of contemporary TV dramas, offering easy accessibility whether the player has hours to devote or only wants a quick TV-style fix. Each time the player launches a saved game, the episode begins with a video summary of the previous episode to quickly re-immerse the player in the story, removing the need to remember where they were or what they were doing. Every episode closes with a nail-biting cliff-hanger ending to rattle players' nerves, and if the player is leaving the game a video teaser of the next episode plays to leave them wanting more. Alone in the Dark returns with a heart-stopping survival experience realized through the use of state-of-the-art real-time physics and unprecedented environmental interaction. Delivering an action-orientated experience within a highly detailed, open environment, Alone in the Dark once again strives innovation and excellence within the genre. [Atari]… Expand"}, {"name": "Sonic and the Secret Rings", "details_link": "https://www.metacritic.com/game/wii/sonic-and-the-secret-rings", "publisher": "Sega", "release_date": "Feb 20 2007", "developers": ["Sonic Team"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 69, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/8a591e9bec929753693fb145267650d2-98.jpg", "descriptions": "The game opens as Sonic is mysteriously transported to the world of The Arabian Nights where he encounters a mystical genie, Shahra. Shahra pleads with Sonic to save her world from the powerful evil genie, Erazor Djinn. As the story unfolds, Erazor confronts Sonic and pulls him into his evilThe game opens as Sonic is mysteriously transported to the world of The Arabian Nights where he encounters a mystical genie, Shahra. Shahra pleads with Sonic to save her world from the powerful evil genie, Erazor Djinn. As the story unfolds, Erazor confronts Sonic and pulls him into his evil plans. Sonic has a limited time to deliver Erazor the seven World Rings and save the storybook world. Navigating a world full of obstacles and enemies, from Erazor’s genie minions to dinosaurs, players use a bevy of core moves to keep up the pace. Holding the Wii Remote horizontally, players tilt the controller left and right to control Sonic's signature speed. They jump, perform sliding stops, pull off wicked homing attacks with a snap of the controller, and even walk backwards with a tilt of the Wii Remote. Players also hop aboard winged pots and fly with a vigorous shake of the controller. They launch themselves from catapults with a whip of the Wii Remote, surf through rapids on tree trunks and even pilot flying carpets in the race to restore this storybook world before all is lost. Players navigate 100 missions within eight wildly varied worlds, gaining new moves and abilities along the way. As players progress through the game, Sonic's abilities can be strategically equipped based on the demands of the mission ahead. From a boost called Speed Break to an ability called Time Break that slows the world around him to a near stop, Sonic needs every trick in the book to make sure Erazor Djinn stays in the storybook world. In addition to the single player adventure, Sonic and the Secret Rings offers 40 mini-games that support up to four players. Showcasing the abilities of the Wii Remote, players will use the controller as a violin bow, an ax, a canoe paddle and dozens of other motions to compete in these easy to pick-up-and-play games. [Sega]… Expand"}, {"name": "NBA Live 07", "details_link": "https://www.metacritic.com/game/xbox/nba-live-07", "publisher": "EA Sports", "release_date": "Sep 25 2006", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/56b8f9990d8b31fe91746a0482a075e5-98.jpg", "descriptions": "NBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a newNBA LIVE 07 plays as good as it looks with gameplay advancements that build upon the depth and authenticity that the NBA LIVE franchise has delivered for more than a decade. NBA LIVE 07 introduces the next generation of basketball gameplay with EA SPORTS Total Freestyle Control, a new feature that gives users more control over athletes than ever. By introducing a next generation AI system that is both intuitive and intelligent, combined with advancements to fan-favorite features like All-Star Weekend and Dynasty Mode, NBA LIVE 07 continues to deliver its award-winning gameplay experience. This year NBA LIVE 07 partners with the worldwide leader in sports to deliver more ESPN content in-game while you play than ever before.… Expand"}, {"name": "RPG Maker 3", "details_link": "https://www.metacritic.com/game/playstation-2/rpg-maker-3", "publisher": "Agetec Inc.", "release_date": "Sep 21 2005", "developers": ["Runtime"], "platforms": "PlayStation 2", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/6b857e74f81a0998e47dd0ac0fb744b8-98.jpg", "descriptions": "From the Designer Series, RPG Maker 3 features an easy to use toolset and transforms 2D instruction into 3D worlds allowing you to produce exciting and enchanting games. It’s storytelling at its best. Choose your characters, worlds, items, landscapes, add a script and more. In no time, youFrom the Designer Series, RPG Maker 3 features an easy to use toolset and transforms 2D instruction into 3D worlds allowing you to produce exciting and enchanting games. It’s storytelling at its best. Choose your characters, worlds, items, landscapes, add a script and more. In no time, you are enjoying a “custom title” created by yours truly. [Agetec Inc]… Expand"}, {"name": "R-Type Command", "details_link": "https://www.metacritic.com/game/psp/r-type-command", "publisher": "Atlus", "release_date": "May  6 2008", "developers": ["Irem"], "platforms": "PSP", "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/04a4b02eecf47ddc2cee0689b47ef036-98.jpg", "descriptions": "(Also known as \"R-Type Tactics\")  In a desperate war against the mysterious alien race known as the Bydo, humanity sends wave after wave of fighters into Bydo space -- none of which are ever heard from again. Mankind's main hope now resides with a lone commander, sent to lead a small armada(Also known as \"R-Type Tactics\")  In a desperate war against the mysterious alien race known as the Bydo, humanity sends wave after wave of fighters into Bydo space -- none of which are ever heard from again. Mankind's main hope now resides with a lone commander, sent to lead a small armada on a perilous mission into the heart of the Bydo Empire. Low on fuel and forced to scavenge resources and equipment from his surroundings, the commander must use all his cunning and wits if he hopes to succeed, let alone make it home alive. R-Type reborn - The highly acclaimed franchise moves into the strategy genre with exciting tactical gameplay. Control the Bydo forces - For the first time in the series, take command of the Bydo forces as they launch their assault on Earth. Intense strategy gameplay - With nearly 100 different units at your disposal, it's up to you to choose the best fleet for battle. Upgrade your existing units or purchase new ones. Head-to-head local multiplayer - With the PSP wireless communication feature, play against a friend in Wireless Ad Hoc mode for a one-on-one strategy battle. [Atlus USA]… Expand"}, {"name": "Lost Sphear", "details_link": "https://www.metacritic.com/game/switch/lost-sphear", "publisher": "Square Enix", "release_date": "Jan 23 2018", "developers": ["Tokyo RPG Factory"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/31fb8ee9cda8a7fbb8f024d653ca9ced-98.jpg", "descriptions": "As an ominous power threatens the fabric of reality, a young man chosen by destiny must arise to face a phenomenon never seen before. Enter Kanata, as he awakens from a devastating dream leading him to find his home, erased from existence. Awaken the power of Memory to restore the Lost andAs an ominous power threatens the fabric of reality, a young man chosen by destiny must arise to face a phenomenon never seen before. Enter Kanata, as he awakens from a devastating dream leading him to find his home, erased from existence. Awaken the power of Memory to restore the Lost and rebuild the world!… Expand"}, {"name": "Blue Dragon Plus", "details_link": "https://www.metacritic.com/game/ds/blue-dragon-plus", "publisher": "Ignition Entertainment", "release_date": "Feb 19 2009", "developers": ["Brownie Brown"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Real-Time", "General", "General", "Tactics"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/5a3830fd777da2eabee93c59328a1988-98.jpg", "descriptions": "This DS sequel is set one year after the original Xbox 360 title and returns players to the story of Shu and his companions, who control powerful phantom shadows. They have to deal with new enemies spawned from the devastation wrought in the first title. At first glance, you might mistakenlyThis DS sequel is set one year after the original Xbox 360 title and returns players to the story of Shu and his companions, who control powerful phantom shadows. They have to deal with new enemies spawned from the devastation wrought in the first title. At first glance, you might mistakenly believe Blue Dragon Plus to be a strategy game in the style of Final Fantasy Tactics, with little hand-drawn heroes and monsters arranged on an isometric 3D stage. But once the fight begins, everything starts happening in real time and you must feverishly put together your plan of attack, because those enemies aren't waiting for your turn. You command your units around the field with quick but simple controls that rely totally on the touch screen. You tell your units where to go, who to fight, when to heal, and when to move to special areas on the map. It seems like your attention is constantly needed everywhere at once, but the game gives you some room for error by providing a high number of healing items. Also, as you progress through each map, the game occasionally pauses to let some part of the story play out. The game features a thirty-hour quest as well as the ability to control up to sixteen humans and Mecha Robos in real-time battles and shadow fights.… Expand"}, {"name": "Sea of Solitude: The Director's Cut", "details_link": "https://www.metacritic.com/game/switch/sea-of-solitude-the-directors-cut", "publisher": "Quantic Dream", "release_date": "Mar  4 2021", "developers": ["Jo-Mei Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/0c953b398edf1602a91bfa6ab67158ae-98.jpg", "descriptions": "Sea of Solitude: The Director’s Cut is an improved version of the original experience offered by Jo-Mei in 2019, with a set of new features and enhancements designed specifically for the Nintendo Switch. The dialogue has been rewritten with the help of award-winning author Stephen Bell and aSea of Solitude: The Director’s Cut is an improved version of the original experience offered by Jo-Mei in 2019, with a set of new features and enhancements designed specifically for the Nintendo Switch. The dialogue has been rewritten with the help of award-winning author Stephen Bell and a new cast of actors have re-recorded all the game’s dialogue to provide a fully dubbed experience in French, English, Spanish, Japanese and German*.… Expand"}, {"name": "Of Orcs and Men", "details_link": "https://www.metacritic.com/game/pc/of-orcs-and-men", "publisher": "Focus Home Interactive", "release_date": "Oct 11 2012", "developers": ["Cyanide", "Spiders"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG", "Western-Style"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/b815be08b6728008d3cb37903f284863-98.jpg", "descriptions": "Of Orcs and Men first puts you into the role of an elite Orc soldier from the legendary legion of Bloodjaws, a league of warriors deeply involved in the war opposing the Orcs and Goblins on one side to their persecutors, Humankind. As a veteran warrior who has seen the most brutal ofOf Orcs and Men first puts you into the role of an elite Orc soldier from the legendary legion of Bloodjaws, a league of warriors deeply involved in the war opposing the Orcs and Goblins on one side to their persecutors, Humankind. As a veteran warrior who has seen the most brutal of battles, you are appointed by the Orc commander to complete a mission that could change the course of the war: kill the one man responsible for all of this bloodshed, the one who has, for years, exhorted the human masses to loath and fight the green-skinned people: the Emperor himself.… Expand"}, {"name": "Forgotten Realms: Demon Stone", "details_link": "https://www.metacritic.com/game/pc/forgotten-realms-demon-stone", "publisher": "Atari", "release_date": "Dec  9 2004", "developers": ["Stormfront Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/2bd3b0b70fb1a094d5117a524e3dd40d-98.jpg", "descriptions": "In Forgotten Realms: Demon Stone, the player directs a party of three characters ? Fighter, Sorcerer and Rogue. The player controls one party member at a time -- switching between them on the fly -- while the other party members are controlled by the engine?s sophisticated artificialIn Forgotten Realms: Demon Stone, the player directs a party of three characters ? Fighter, Sorcerer and Rogue. The player controls one party member at a time -- switching between them on the fly -- while the other party members are controlled by the engine?s sophisticated artificial intelligence. For example, when the player controls the Fighter, the Sorcerer and Rogue will continue to engage in combat, cast spells and assist the player in defeating all challengers. In many situations, the characters will be able to divide and conquer difficult objectives ? while the Fighter holds back a horde of Yuan-Ti snakemen with brute force, the Sorcerer supports him with devastating ranged magic while the rogue sneaks above and behind them for a coup de grace. The player participates seamlessly in each critical moment as they are cinematically switched from one perspective to another. This real-time, on-the-fly character switching design allows Forgotten Realms: Demon Stone to challenge players with innovative and compelling encounters. In true D&D fashion, each of the characters excels at a certain type of gameplay. The Fighter thrives in melee combat, the Sorcerer is excellent at ranged and magical combat and the Rogue excels at jumping, sneaking and disarming traps. Players will be continually tasked with choosing the best character for each challenge as well as using each character?s gameplay specialty to maximum effect. [Atari]… Expand"}, {"name": "Marc Ecko's Getting Up: Contents Under Pressure", "details_link": "https://www.metacritic.com/game/playstation-2/marc-eckos-getting-up-contents-under-pressure", "publisher": "Atari", "release_date": "Feb 14 2006", "developers": ["Double Helix Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/13ed5c49c8c3948976163870c8d8c992-98.jpg", "descriptions": "Dedicated to creating a story and environment that is a true representation of graffiti culture, fashion pioneer Marc Ecko has enlisted 50 of the world's most elite graffiti artists to lend their best artwork and personal experiences to the game and consult with The Collective to giveDedicated to creating a story and environment that is a true representation of graffiti culture, fashion pioneer Marc Ecko has enlisted 50 of the world's most elite graffiti artists to lend their best artwork and personal experiences to the game and consult with The Collective to give Getting Up: Contents Under Pressure the authentic look and feel of a real urban environment. The game creates its own genre of gameplay, combining combat, action, adventure and stealth. It uses a thrilling graffiti-driven framework to tell its story of self-expression and the fight for creative freedom. A thug, an outcast, a rebel...the lead character, Trane, is all of these in Getting Up: Contents Under Pressure. He sets out to earn his street cred by getting his graffiti tag up throughout the politically oppressive city of New Radius but as events unfold, Trane becomes the unlikely leader of an urban revolution. The story's \"Get In, Get Up and Get Out\" gameplay mechanic offers gamers a unique arsenal of swift stealth and street fighting abilities to GET IN restricted areas of New Radius and battle through the city's rough streets; the dexterity and agility to scale any object in order to GET UP and place graffiti tags, spreading the message of rebellion; and the ingenuity to evade, escape and GET OUT. [Atari]… Expand"}, {"name": "Marc Ecko's Getting Up: Contents Under Pressure", "details_link": "https://www.metacritic.com/game/pc/marc-eckos-getting-up-contents-under-pressure", "publisher": "Atari", "release_date": "Feb 14 2006", "developers": ["Double Helix Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/9e0f92d275b3821086a1985962502e59-98.jpg", "descriptions": "Dedicated to creating a story and environment that is a true representation of graffiti culture, fashion pioneer Marc Ecko has enlisted 50 of the world's most elite graffiti artists to lend their best artwork and personal experiences to the game and consult with The Collective to giveDedicated to creating a story and environment that is a true representation of graffiti culture, fashion pioneer Marc Ecko has enlisted 50 of the world's most elite graffiti artists to lend their best artwork and personal experiences to the game and consult with The Collective to give Getting Up: Contents Under Pressure the authentic look and feel of a real urban environment. The game creates its own genre of gameplay, combining combat, action, adventure and stealth. It uses a thrilling graffiti-driven framework to tell its story of self-expression and the fight for creative freedom. A thug, an outcast, a rebel...the lead character, Trane, is all of these in Getting Up: Contents Under Pressure. He sets out to earn his street cred by getting his graffiti tag up throughout the politically oppressive city of New Radius but as events unfold, Trane becomes the unlikely leader of an urban revolution. The story's \"Get In, Get Up and Get Out\" gameplay mechanic offers gamers a unique arsenal of swift stealth and street fighting abilities to GET IN restricted areas of New Radius and battle through the city's rough streets; the dexterity and agility to scale any object in order to GET UP and place graffiti tags, spreading the message of rebellion; and the ingenuity to evade, escape and GET OUT. [Atari]… Expand"}, {"name": "Star Hammer: The Vanguard Prophecy", "details_link": "https://www.metacritic.com/game/pc/star-hammer-the-vanguard-prophecy", "publisher": "Slitherine", "release_date": "Jun  4 2015", "developers": ["Black Lab Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Real-Time", "Tactics"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/2bdb8216228617febcf03df25eed71cc-98.jpg", "descriptions": "Assume charge of Naval Strike Group 7 and lead your fleet to victory in full 3D tactical space combat. Star Hammer: The Vanguard Prophecy is a sci-fi strategy saga that tests your abilities as both capital assault ship Captain and naval fleet Commander."}, {"name": "Bionic Commando", "details_link": "https://www.metacritic.com/game/pc/bionic-commando", "publisher": "Capcom", "release_date": "Jul 28 2009", "developers": ["GRIN"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Action Adventure", "Adventure", "Third-Person", "General", "Platformer", "Sci-Fi", "Sci-Fi", ""], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/c8aa6ab56156a8898e36e1e966d24f4d-98.jpg", "descriptions": "The first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan \"Rad\" Spencer, voiced by Mike Patton, the former lead singer of Faith No More. Time has not been kind to Spencer: 10 years after his heroicThe first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan \"Rad\" Spencer, voiced by Mike Patton, the former lead singer of Faith No More. Time has not been kind to Spencer: 10 years after his heroic defeat of the Imperials in the original game, he has been betrayed by the government he swore to serve, imprisoned for crimes he didn't commit, and sentenced to death. On the very day of Spencer's execution, terrorists detonate a massive experimental weapon in Ascension City, unleashing an intense earthquake that has turned the city into rubble and wiped out its population. With the terrain in ruins and the city's air defense grid now in the control of a massive terrorist force whose goal remains unclear, the FSA have only one option left - a behind-the-lines assault. The perfect job for a Bionic Commando. Bionic Commando transposes the swing-and-shoot gameplay of the 8-bit original to a stunning 3D environment of towering buildings, suspended roadways and monorails, deep canyons and sheer rock faces, where every environment is scalable using swinging, scaling, climbing and wall-walking techniques. [Capcom]… Expand"}, {"name": "1942: Joint Strike", "details_link": "https://www.metacritic.com/game/playstation-3/1942-joint-strike", "publisher": "Capcom", "release_date": "Jul 24 2008", "developers": ["Backbone Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 69, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/89a8026c74bafa1e1421249c8d8eab58-98.jpg", "descriptions": "[Playstation Network]  1942: Joint Strike takes inspiration and influence from the 194X series of World War II-themed vertical shooters. The art, sound, and gameplay of the new game takes cues from the original 194X games, but stands out as its own unique entry. Gameplay resembles the[Playstation Network]  1942: Joint Strike takes inspiration and influence from the 194X series of World War II-themed vertical shooters. The art, sound, and gameplay of the new game takes cues from the original 194X games, but stands out as its own unique entry. Gameplay resembles the classic 2D style that gamers expect, but the game utilizes a full 3D engine. Set in a World War II-themed locale, stages, vehicles, and weapons have the look and feel of WWII with some stylistic differences. The world in which 1942 takes place is not our own and the events that transpire are not historically accurate, nor are they intended to be. This is an alternate world where history and technology developed along their own paths. As a result, players jump into the cockpits of WWII-era aircraft to take on huge waves of incoming enemy fire, dodging explosions and missiles while challenging huge bosses at the end of each stage. New co-op \"Joint Strike attacks\" combine the powers of two aircrafts into a devastating barrage. [Capcom]… Expand"}, {"name": "Cobalt", "details_link": "https://www.metacritic.com/game/pc/cobalt", "publisher": "Mojang AB", "release_date": "Feb  2 2016", "developers": ["Oxeye"], "platforms": ["Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/69023704820f4e2b6f0ad9d1e5b3b2ec-98.jpg", "descriptions": "Colbalt is a wacky action platformer from indie developer Mojang."}, {"name": "Knack 2", "details_link": "https://www.metacritic.com/game/playstation-4/knack-2", "publisher": "Sony Interactive Entertainment", "release_date": "Sep  5 2017", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 4", "genres": ["Action Adventure", "Linear"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/5beec7a443e72f49bd21c5e3469a1d56-98.jpg", "descriptions": "Meet Knack, a little guy with surprising moves and the ability to transform from big to small and back again in this family-friendly adventure from the developers at PlayStation. Surprising Abilities:\r• Over 20 awesome moves including boomerang, whip rush, sword, multi-bomb and body slam\r•Meet Knack, a little guy with surprising moves and the ability to transform from big to small and back again in this family-friendly adventure from the developers at PlayStation. Surprising Abilities:\r• Over 20 awesome moves including boomerang, whip rush, sword, multi-bomb and body slam\r• Grow to the size of a building or shrink down to just two-feet tall\r• Jump in a tank or robot and control it – or just destroy them\r• Collect relics to power up and smash your way through hordes of enemies\rFamily Friendly\r• Seamless co-op mode so you can play together whenever you choose\r• Accessible gameplay for kids and challenging gameplay for adults\r• Pick up and play or sit down for a Knack marathon\rAdventure & Puzzles\r• Save the world from a villain who’s reviving ancient weapons and enormous titans\r• Vibrantly colored world with stunning graphics\r• Puzzles for varying skill levels… Expand"}, {"name": "Golf: Tee It Up!", "details_link": "https://www.metacritic.com/game/xbox-360/golf-tee-it-up!", "publisher": "Activision", "release_date": "Jul  9 2008", "developers": ["Housemarque"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/93665cc009c39b6322851cdff6e312fc-98.jpg", "descriptions": "[Xbox Live Arcade]  Hit the sweet spot with Golf: Tee It Up! Pick up and play a few quick holes on your own or compete with friends in a full 18-hole multiplayer tournament. With zany customizable characters, both beginners and experienced golfers can easily join the fun on beautiful[Xbox Live Arcade]  Hit the sweet spot with Golf: Tee It Up! Pick up and play a few quick holes on your own or compete with friends in a full 18-hole multiplayer tournament. With zany customizable characters, both beginners and experienced golfers can easily join the fun on beautiful panoramic and challenging courses. Need that special touch for your hacked shot? With the unique Focus feature, read the green or control the ball's spin in flight to achieve amazing precision! A huge combination of game modes awaits including stroke, cup, or match play with local or multiplayer modes over Xbox Live. Tee it up on 36 unique holes in stunning locations, such as the Caribbean course set against a beautifully landscaped beach resort, or the Parkland course that twists around the majestic Scottish highlands. Design your own zany character from an eclectic assortment of themed hair styles, clothing, footwear, and accessories. With the unique Focus feature, read the green or control the ball's spin in flight to achieve amazing precision. Future downloadable content: Download additional courses, clothing, and accessories to extend your golfing experience. [Activision]… Expand"}, {"name": "Kao the Kangaroo", "details_link": "https://www.metacritic.com/game/pc/kao-the-kangaroo", "publisher": "Tate Multimedia", "release_date": "May 27 2022", "developers": ["Tate Multimedia"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/26a141d220f8ec5e0da8cc3e20ad10d6-98.jpg", "descriptions": "Join Kao on his biggest adventure yet! This time the brave kangaroo has to find his missing sister and solve the mystery of what happened to his long-gone father. He will need to travel the world and confront the famous fighting masters, who are influenced by the mysterious, dark power. OnJoin Kao on his biggest adventure yet! This time the brave kangaroo has to find his missing sister and solve the mystery of what happened to his long-gone father. He will need to travel the world and confront the famous fighting masters, who are influenced by the mysterious, dark power. On the course of his journey, Kao will learn under the guidance of his master - Walt, how to become not only an awesome fighter but also a clever one who uses his head as much as his fists.… Expand"}, {"name": "Siege Survival: Gloria Victis", "details_link": "https://www.metacritic.com/game/pc/siege-survival-gloria-victis", "publisher": "Black Eye Games", "release_date": "May 18 2021", "developers": ["FishTankStudio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/61d88f5fbddb1160c1d055a0f9515ca1-98.jpg", "descriptions": "A medieval city under siege and a handful of civilians are all that keep the walls from falling. Mixing survival strategy and resource management, build your camp, craft supplies, and scavenge the occupied city to supply the last troops holding back the invaders."}, {"name": "Lost Sphear", "details_link": "https://www.metacritic.com/game/pc/lost-sphear", "publisher": "Square Enix", "release_date": "Jan 23 2018", "developers": ["Tokyo RPG Factory"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/97ef0d3e457fbe533ad27119121ef1bf-98.jpg", "descriptions": "As an ominous power threatens the fabric of reality, a young man chosen by destiny must arise to face a phenomenon never seen before. Enter Kanata, as he awakens from a devastating dream leading him to find his home, erased from existence. Awaken the power of Memory to restore the Lost andAs an ominous power threatens the fabric of reality, a young man chosen by destiny must arise to face a phenomenon never seen before. Enter Kanata, as he awakens from a devastating dream leading him to find his home, erased from existence. Awaken the power of Memory to restore the Lost and rebuild the world!… Expand"}, {"name": "Oninaki", "details_link": "https://www.metacritic.com/game/playstation-4/oninaki", "publisher": "Square Enix", "release_date": "Aug 22 2019", "developers": ["Tokyo RPG Factory"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Japanese-Style", "Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/8c5d7842c990209add577bb4a0a814cf-98.jpg", "descriptions": "Reincarnation is the foundation of our way of life. We celebrate the lives we’ve been given, and offer up prayers for the next. It is grief of death which shackles the living, and causes the dead to stray. Indeed, there is no greater affront to reincarnation. So do we turn our grief to joyReincarnation is the foundation of our way of life. We celebrate the lives we’ve been given, and offer up prayers for the next. It is grief of death which shackles the living, and causes the dead to stray. Indeed, there is no greater affront to reincarnation. So do we turn our grief to joy as we send off the dead. But the souls of those who held back their tears in life still need salvation in death. A duty that falls to the Watchers. Their task is to guide the wandering souls known as the Lost, and serve as keepers of the Living World and the Beyond.… Expand"}, {"name": "FIFA Soccer 13", "details_link": "https://www.metacritic.com/game/wii-u/fifa-soccer-13", "publisher": "EA Sports", "release_date": "Nov 13 2012", "developers": ["Electronic Arts"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Wii U"], "num_players": "1-5 ", "genres": ["Sim", "Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/633e10890e89ef4c3f4233e9cf4003a2-98.jpg", "descriptions": "Innovations that make use of the Wii U GamePad put you on the pitch and immerse you in the game. Lift and look through the GamePad touch screen to aim the ball on set pieces and penalty kicks, then put the perfect curve on your shot and let it fly. Shake the GamePad to activate Touch ScreenInnovations that make use of the Wii U GamePad put you on the pitch and immerse you in the game. Lift and look through the GamePad touch screen to aim the ball on set pieces and penalty kicks, then put the perfect curve on your shot and let it fly. Shake the GamePad to activate Touch Screen Shooting, removing the element of ‘hit and hope’ and allowing for accuracy. Further, connect and interact with friends - see them online and invite them to play, or message them in real time using touch screen typing.… Expand"}, {"name": "MotoGP 09/10", "details_link": "https://www.metacritic.com/game/xbox-360/motogp-0910", "publisher": "Capcom", "release_date": "Mar 23 2010", "developers": ["Monumental Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "12  Online", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 69, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/39c2162388ccefced0fc306924f1d017-98.jpg", "descriptions": "Team Career Mode – Create and manage your team in an in-depth career mode. Hire staff to help research technology and promote your team. Decisions off the track affect performance on track and vice-versa. Reward system is heavily integrated keeping the user entertained, involved, andTeam Career Mode – Create and manage your team in an in-depth career mode. Hire staff to help research technology and promote your team. Decisions off the track affect performance on track and vice-versa. Reward system is heavily integrated keeping the user entertained, involved, and addicted. Rider Reputation – is the new mechanic which will determine the events, teams and manufacturers that will be available to your team. Rack up your reputation utilizing skill and style. Race your way. Classes – Compete and level-up as you work your way through 125cc, 250cc and 800cc true GP classes. Arcade Mode – This is an all new race mode introduced to MotoGP that drops you on the tarmac and pushes you to complete different race challenges before time runs out. Extensive free content – For the first time ever, Race the Season as it unfolds with free extensive downloadable content for the 2010 season, including all new bike classes, new tracks and all the teams and stats from 2010. 20 Person Online Gameplay – Race online with in a fully fleshed out lobby system or compete locally in split-screen. Accessible Handling – Handling mechanics heavily tuned for players of all levels to create an enjoyable racing experience. [Capcom]… Expand"}, {"name": "World War Z", "details_link": "https://www.metacritic.com/game/switch/world-war-z", "publisher": "Saber Interactive", "release_date": "Nov  2 2021", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Third-Person", "Tactical"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/d264b4a2f73b4060cec533ebd981104f-98.jpg", "descriptions": "World War Z is a thrilling four-player cooperative third-person shooter featuring massive swarms of zombies that recklessly rush their living prey. Focused on fast-paced gameplay -- and based on the incredibly popular Paramount Pictures property of the same name -- World War Z explores newWorld War Z is a thrilling four-player cooperative third-person shooter featuring massive swarms of zombies that recklessly rush their living prey. Focused on fast-paced gameplay -- and based on the incredibly popular Paramount Pictures property of the same name -- World War Z explores new storylines and characters from around the world in tense, overwhelming, gruesomely exciting missions crafted specifically for modern consoles and PC.The swarm feels neither fear nor mercy. It rolls forward to spread and consume. Together, make your stand and unload an arsenal of deadly weaponry into these hundreds of swarming zombies. Feel the satisfying rush of life as you cheat death and prevail against such overwhelming odds. Cut the undead down with rocket launchers, machine guns, sentries, turrets, grenade launchers, barbed wire, and more.… Expand"}, {"name": "Pro Evolution Soccer 2017", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2017", "publisher": "Konami", "release_date": "Sep 13 2016", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 69, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/7/00625061dfc49b5417f42528317c0bb5-98.jpg", "descriptions": "In PES 2017, the 1st touch is calculated by player attributes, as well as the further inclusion of real ball physics directly controlled by the input ball touch. See how different players control the ball in unique and different ways based on where and how you control them, dictating theIn PES 2017, the 1st touch is calculated by player attributes, as well as the further inclusion of real ball physics directly controlled by the input ball touch. See how different players control the ball in unique and different ways based on where and how you control them, dictating the flow of the game based on how they react to the unpredictable movement of the ball. In addition, there is more control in how you receive passes, and depending on the pass, players can visually execute the exact play intended, from receiving a pass to sending the ball out again. [Konami]… Expand"}]