[{"name": "Banished", "details_link": "https://www.metacritic.com/game/pc/banished", "publisher": "Shining Rock Software", "release_date": "Feb 18 2014", "developers": ["Shining Rock Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "General", "Strategy", "City Building", "Management", "Modern", "Government"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/696947d586084fcf05f359f571dacbc1-98.jpg", "descriptions": "In this city-building strategy game, control a group of exiled travelers who opt to restart their lives in a new land. They bring only the clothes on their backs and a cart filled with supplies from their homeland. The townspeople of Banished are your primary resource."}, {"name": "Watch Dogs: Legion - Bloodline", "details_link": "https://www.metacritic.com/game/pc/watch-dogs-legion---bloodline", "publisher": "Ubisoft", "release_date": "Jul  6 2021", "developers": ["Ubisoft"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/61fefedf2ce3fc146b1bf26536c44079-98.jpg", "descriptions": "Set before the events of Watch Dogs: Legion, the DLC expansion introduces a new storyline that tasks original Watch Dogs protagonist Aiden Pearce with stealing a robot-controlling device from Broca Tech – only to see the job go south as Watch Dogs 2’s Wrench interferes. Check out the trailerSet before the events of Watch Dogs: Legion, the DLC expansion introduces a new storyline that tasks original Watch Dogs protagonist Aiden Pearce with stealing a robot-controlling device from Broca Tech – only to see the job go south as Watch Dogs 2’s Wrench interferes. Check out the trailer below to see how Aiden’s carefully laid plans unravel, and what he now risks as a result. Both Aiden and Wrench are playable during Bloodline’s story, and with the Season Pass or an in-game purchase, they can be added to your DedSec Resistance in the main campaign or in the Online mode. Each also comes with new abilities: Aiden can aim in slow-mo after a takedown, gets a damage buff with a well-timed reload, or disable nearby electronics with a System Crash. Wrench – in addition to an MPX SMG and LTL grenade launcher, both with custom skins – carries a big custom hammer named Lady Smash, deploys mini flashbangs called Ninja Balls, and can summon a custom drone named Sergei. [Ubisoft]… Expand"}, {"name": "The Sojourn", "details_link": "https://www.metacritic.com/game/xbox-one/the-sojourn", "publisher": "Iceberg Interactive", "release_date": "Sep 20 2019", "developers": ["Shifting Tides"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/98ac863b29c32d97e2b706e3f910e2be-98.jpg", "descriptions": "Traverse a thought-provoking puzzle game and its immersive color-drenched world of light and shadow. The Sojourn takes place in a mysterious land, where lights guide you forward and the world reveals itself to be full of challenges. Overcome these intricate and ever more demanding obstaclesTraverse a thought-provoking puzzle game and its immersive color-drenched world of light and shadow. The Sojourn takes place in a mysterious land, where lights guide you forward and the world reveals itself to be full of challenges. Overcome these intricate and ever more demanding obstacles to uncover the nature of reality.… Expand"}, {"name": "Eagle Flight", "details_link": "https://www.metacritic.com/game/playstation-4/eagle-flight", "publisher": "Ubisoft", "release_date": "Nov  8 2016", "developers": ["Ubisoft", "FunHouse"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Simulation", "Flight", "General", "Combat"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/92d63a36c12cc096592951a5d1b3e32b-98.jpg", "descriptions": "50 years after humans vanished from the face of the Earth, nature reclaimed the city of Paris, leaving a breathtaking playground. As an eagle, you soar past iconic landmarks, dive through narrow streets, and engage in aerial dog fights to protect your territory from opponents. With intuitive50 years after humans vanished from the face of the Earth, nature reclaimed the city of Paris, leaving a breathtaking playground. As an eagle, you soar past iconic landmarks, dive through narrow streets, and engage in aerial dog fights to protect your territory from opponents. With intuitive controls, you quickly learn to perform impressive aerial maneuvers in the blink of an eye. Eagle Flight sends you to the skies to experience the freedom of flying and explore Paris from a never-before seen perspective.… Expand"}, {"name": "Game of Thrones: Episode Four - Sons of Winter", "details_link": "https://www.metacritic.com/game/playstation-4/game-of-thrones-episode-four---sons-of-winter", "publisher": "Telltale Games", "release_date": "May 26 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/972b356dc45176d4a0d3ec099562b6e4-98.jpg", "descriptions": "In this fourth episode, the fate of the scattered Forresters hangs in the balance, and no one allied with the family is considered to be safe. An unexpected meeting offers Rodrik a new opportunity to free Ironrath from its Whitehill stranglehold, but with young Ryon Forrester stillIn this fourth episode, the fate of the scattered Forresters hangs in the balance, and no one allied with the family is considered to be safe. An unexpected meeting offers Rodrik a new opportunity to free Ironrath from its Whitehill stranglehold, but with young Ryon Forrester still imprisoned, his next moves are critical. Gared must abandon Castle Black and venture beyond the Wall in search of the mysterious North Grove, risking encounters with Wildlings and worse. In King's Landing, the population is reeling from a recent royal death, and Mira must step carefully in an increasingly complex game of politics where secrets are traded as currency. Far away in Essos, Asher infiltrates the slave city of Meereen at the behest of Daenerys Targaryen, but will the friendship he holds dear break under the strain of a mission that raises memories best forgotten? [Telltale Games]… Expand"}, {"name": "Resident Evil: Revelations 2 - Episode 1: Penal Colony", "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-revelations-2---episode-1-penal-colony", "publisher": "Capcom", "release_date": "Feb 25 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/62f2aa73ff69b5dbc42f7f391ba60ca5-98.jpg", "descriptions": "The first episode is entitled Penal Colony. Claire Redfield, one of the only survivors of the Raccoon City incident of 1998, has since joined an NGO called Terra Save, whose mission is to assist victims of biological weaponry. During an event at Terra Save’s HQ, a mysterious force abductsThe first episode is entitled Penal Colony. Claire Redfield, one of the only survivors of the Raccoon City incident of 1998, has since joined an NGO called Terra Save, whose mission is to assist victims of biological weaponry. During an event at Terra Save’s HQ, a mysterious force abducts Claire and her co-workers and moves them to a creepy deserted island.… Expand"}, {"name": "Earthworm Jim HD", "details_link": "https://www.metacritic.com/game/xbox-360/earthworm-jim-hd", "publisher": "Gameloft", "release_date": "Jun  9 2010", "developers": ["Gameloft"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/425ec9931ca980bbdc55671b0b5ec51d-98.jpg", "descriptions": "[Xbox Live Arcade]  Rediscover the grooviest action game of all time in full hi-def glory with Earthworm Jim HD! For the first time, grab friends and combine your wormy powers in four-player co-op locally or online. Explore all the original levels, experience wild gameplay, and rock to the[Xbox Live Arcade]  Rediscover the grooviest action game of all time in full hi-def glory with Earthworm Jim HD! For the first time, grab friends and combine your wormy powers in four-player co-op locally or online. Explore all the original levels, experience wild gameplay, and rock to the remastered cult soundtrack. There's even more to discover with brand new enemies to blast into pieces and never-before-seen locations. [Xbox.com]… Expand"}, {"name": "SingStar '90s", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-90s", "publisher": "SCEA", "release_date": "Mar 18 2008", "developers": ["SCEE"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/b1ce827b94cd295624d751e271ad395a-98.jpg", "descriptions": "Yeah, it's SingStar time again..this time with songs from The Divinyls, EMF, Lisa Loeb, Sir Mix-A-Lot, the Cardigans, and a few more."}, {"name": "JoJo's Bizarre Adventure: All-Star Battle R", "details_link": "https://www.metacritic.com/game/playstation-5/jojos-bizarre-adventure-all-star-battle-r", "publisher": "Bandai Namco Games", "release_date": "Sep  2 2022", "developers": ["CyberConnect2", "Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/18033589f7a1fb8391aab118b0687054-98.jpg", "descriptions": "All JOJOs Unite! Fight for Your Destiny!Jonathan Joestar, Jotaro Kujo, DIO, Jolyne Cujoh, and other characters from JoJo's Bizarre Adventure gather across multiple generations! With 50 playable characters from all arcs, you can experience popular battles from each story, and see charactersAll JOJOs Unite! Fight for Your Destiny!Jonathan Joestar, Jotaro Kujo, DIO, Jolyne Cujoh, and other characters from JoJo's Bizarre Adventure gather across multiple generations! With 50 playable characters from all arcs, you can experience popular battles from each story, and see characters from different universes interact for the first time!This title is based on the All Star Battle fighting system that was released in 2012. The game design of JoJo's Bizarre Adventure: All Star Battle R reinvigorates the experience with adjustments to the fighting tempo and the addition of hit stops and jump dashes.With new audio recordings from the Part 6 anime voice actors, the full atmosphere of the animated series is realized. Both fans who have played the original All Star Battle and newcomers will be able to enjoy the experience.… Expand"}, {"name": "Thrillville: Off the Rails", "details_link": "https://www.metacritic.com/game/xbox-360/thrillville-off-the-rails", "publisher": "LucasArts", "release_date": "Oct  9 2007", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 73, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/2/c3f1bc37aac2938c8cfd772886a655c9-98.jpg", "descriptions": "Off the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through aOff the Rails lives up to its name with 20 death-defying rides so outrageous, they inspire the same word from every park visitor who sees them: \"WHOA!\" Players build these incredible \"WHOA Coasters\" to leap from one track to another, launch through the air like cannonballs, blast through a burning rings of fire and more. A new lighthearted story ties together more than 100 missions, complete with 34 playable multiplayer theme-park games and social interaction with park guests that's better than ever. The in-depth conversations both advance the plot and suggest better ways to manage the park. But is every guest to be trusted? [LucasArts]… Expand"}, {"name": "Demon Gaze II", "details_link": "https://www.metacritic.com/game/playstation-4/demon-gaze-ii", "publisher": "NIS America", "release_date": "Nov 14 2017", "developers": ["Experience Inc."], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/4fc1ad068d5776530fce4ec09ee5169e-98.jpg", "descriptions": "Demon Synergy: As the Demon Gazer, turn foes to allies and power them up using the Trance Demon Mode, or fuse with them using the Demon's Cross."}, {"name": "Minute of Islands", "details_link": "https://www.metacritic.com/game/pc/minute-of-islands", "publisher": "Mixtvision", "release_date": "Jun 13 2021", "developers": ["Fizbin", "Studio Fizbin"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/a69634560e9d3dc3eebcdebd97e6fff0-98.jpg", "descriptions": "Explore strange and wonderful islands and dark labyrinths below in this narrative puzzle platformer. Guide young mechanic Mo on her quest to repair a world on the brink of collapse. The powerful Omni Switch at your disposal may not be enough to fix the damage that hides beneath the surface.."}, {"name": "AER: Memories of Old", "details_link": "https://www.metacritic.com/game/switch/aer-memories-of-old", "publisher": "Daedalic Entertainment", "release_date": "Aug 28 2019", "developers": ["Daedalic Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/873a2a6d4e9dce6fd9c445ea5b951ef1-98.jpg", "descriptions": "AER puts you in the shoes of Auk, a magical shape-shifting girl who can transform between human and bird."}, {"name": "The King of Fighters 02/03", "details_link": "https://www.metacritic.com/game/playstation-2/the-king-of-fighters-0203", "publisher": "SNK", "release_date": "Feb  8 2005", "developers": ["SNK Playmore"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/f0de1b4901041de0ba49ceb6b332b5cb-98.jpg", "descriptions": "King of Fighters 2002 is a \"greatest hits\" collection that brings together all of the famous characters from the previous KOF 99-01 trilogy. The game features a total of 44 characters from KOF 96 through KOF 2001 available for the first time in one arena. Thirteen extreme 2D fighting teamsKing of Fighters 2002 is a \"greatest hits\" collection that brings together all of the famous characters from the previous KOF 99-01 trilogy. The game features a total of 44 characters from KOF 96 through KOF 2001 available for the first time in one arena. Thirteen extreme 2D fighting teams with 5 bonus secret characters to unlock. Revives the extremely popular 3 on 3 battle format. Upgraded Max-On Power System. Over-the-top Super Special Moves to cause extreme damage. King of Fighters 2003 marked the beginning of a new epic saga in the KOF series. KOF 2003 also introduced SNK's now popular \"Multi-Shift System\" which allows for the free substitution of any team member during battle. KOF 2003 features a total of 35 characters yielding 11 of the most dangerous 2D fighting teams ever assembled. [SNK]… Expand"}, {"name": "Destiny 2: Beyond Light", "details_link": "https://www.metacritic.com/game/pc/destiny-2-beyond-light", "publisher": "Bungie", "release_date": "Nov 10 2020", "developers": ["Bungie"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/3/ed9562d089fc1238d5ee0c5c8da969b3-98.jpg", "descriptions": "The frontier of Europa holds many lost secrets from the past, including the dark power of Stasis. Work with the mysterious Exo Stranger to harness this new power before Eramis, the Kell of Darkness, bestows it on her Fallen forces. Grow your arsenal, command Stasis, and go beyond the Light."}, {"name": "A Story About My Uncle", "details_link": "https://www.metacritic.com/game/pc/a-story-about-my-uncle", "publisher": "Gone North Games", "release_date": "Jul 30 2012", "developers": ["Jacob Antonucci", "Gone North Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Platformer", "3D", "Action", "Platformer", "3D"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/c4991a4fbfcda639f2e2696c43bccc69-98.jpg", "descriptions": "A Story About My Uncle is a first person platforming adventure game about a boy who searches for his lost uncle, and ends up in a world he couldn’t imagine existed. Take help of your uncle’s mysterious inventions that let you jump incredibly high and far through beautiful scenery, uncoverA Story About My Uncle is a first person platforming adventure game about a boy who searches for his lost uncle, and ends up in a world he couldn’t imagine existed. Take help of your uncle’s mysterious inventions that let you jump incredibly high and far through beautiful scenery, uncover clues to your uncle’s whereabouts, and meet fantastical creatures that will help you on your journey.… Expand"}, {"name": "Tom Clancy's HAWX", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-hawx", "publisher": "Ubisoft", "release_date": "Mar  3 2009", "developers": ["Ubisoft Romania"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/b8305b9c30d981bf3dcb3ead052be4f6-98.jpg", "descriptions": "Tom Clancy's HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations becomeTom Clancy's HAWX (high-altitude warfare) promises to revolutionize the way players think about combat in the sky. The story begins in the year 2012. As the era of the nation-state draws quickly to a close, the rules of warfare evolve even more rapidly. More and more nations become increasingly dependent on private military companies (PMCs), elite mercenaries with a lax view of the law. The Reykjavik Accords further legitimize their existence by authorizing their right to serve in every aspect of military operations. While the benefits of such PMCs are apparent, growing concerns surrounding giving them too much power begin to mount. The Enhanced Reality System is the backbone of the HAWX flight experience: radars and incoming missile detection, anti-crash system, damage control system, tactical map and information relay, and weapons trajectory control. E.R.S. also allows players to issue orders to their squadron, making this system as iconic to HAWX as the Cross-Com system is to Tom Clancy's Ghost Recon Advanced Warfighter. Players can ease into their flight missions and gain a level of comfort with the use of the assistance mode. Once employed, players can take full advantage of their technological support through the E.R.S and gain maximum piloting security. If the situation calls for the player to unleash the full potential of the aircraft, the assistance mode can be switched off and all safety features will be deactivated. For the first time ever in the air-combat genre, players can experience the entire solo campaign in four-player JUMP IN co-op mode. In PVP mode, players can challenge up to 15 friends in intense dogfighting sessions and find out who's the top gun. Winning players are rewarded with experience points and money to unlock more weapons. Players have the opportunity to take the throttle of over 50 of the world's most famous aircrafts, as well as being able to dogfight over realistic modern landscapes that have endured years of post-war trauma. [Ubisoft]… Expand"}, {"name": "WWE 2K16", "details_link": "https://www.metacritic.com/game/playstation-4/wwe-2k16", "publisher": "2K Sports", "release_date": "Oct 27 2015", "developers": ["Yuke's"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Sports", "General", "Individual", "Combat", "Wrestling"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/eb09767a18c687ab72f0f33a9e636f88-98.jpg", "descriptions": "Offering more than 120 unique playable characters, including cover Superstar Stone Cold Steve Austin alongside Seth Rollins, Daniel Bryan, Dean Ambrose, Bad News Barrett, Paige and Finn Bálor, WWE 2K16 includes the largest roster in WWE games history. The roster contains a combination ofOffering more than 120 unique playable characters, including cover Superstar Stone Cold Steve Austin alongside Seth Rollins, Daniel Bryan, Dean Ambrose, Bad News Barrett, Paige and Finn Bálor, WWE 2K16 includes the largest roster in WWE games history. The roster contains a combination of current WWE Superstars and Divas, emerging NXT talent, WWE Hall of Famers and WWE alumni from multiple eras.… Expand"}, {"name": "Unto The End", "details_link": "https://www.metacritic.com/game/xbox-one/unto-the-end", "publisher": "Big Sugar Films", "release_date": "Dec  9 2020", "developers": ["2 Ton Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/1e947fab96319eb94bcab2f8627137e2-98.jpg", "descriptions": "Unto The End is a challenging combat adventure game in the style of a cinematic platformer. The story is simple: get home to your family. Master read-react combat in intense sword fights. Spot opportunities to trade and use items. An adventure told through your actions, how will you make it home?"}, {"name": "Batman: The Telltale Series - Episode 3: New World Order", "details_link": "https://www.metacritic.com/game/pc/batman-the-telltale-series---episode-3-new-world-order", "publisher": "Telltale Games", "release_date": "Oct 25 2016", "developers": ["Telltale Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/f811a54ca1b6d83002366f118082743c-98.jpg", "descriptions": "Penguin's brutal attack broadcast on live TV has left Gotham City reeling. As Bruce and Batman, you'll dig deeper into the web of intrigue surrounding the newly revealed Children of Arkham. Meanwhile, behind closed doors, the mysterious Selina Kyle reveals more of herself to Bruce. And inPenguin's brutal attack broadcast on live TV has left Gotham City reeling. As Bruce and Batman, you'll dig deeper into the web of intrigue surrounding the newly revealed Children of Arkham. Meanwhile, behind closed doors, the mysterious Selina Kyle reveals more of herself to Bruce. And in the aftermath of the attack, Bruce’s friend and Gotham’s new mayor, Harvey Dent, is a deeply changed man. Who can be trusted when the future of Bruce Wayne - and the Batman - could be determined by the flip of a coin?… Expand"}, {"name": "Gears of War: Ultimate Edition for Windows 10", "details_link": "https://www.metacritic.com/game/pc/gears-of-war-ultimate-edition-for-windows-10", "publisher": "Microsoft Game Studios", "release_date": "Mar  1 2016", "developers": ["Epic Games", "Splash Damage", "The Coalition"], "platforms": ["Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/6a85db5ca43590b57d0e498809a127c6-98.jpg", "descriptions": "The story of Gears of War thrusts gamers into a deep and harrowing battle for survival against the Locust Horde, a nightmarish race of creatures that surfaced from the bowels of the planet. Players live and breathe the role of Marcus Fenix. A disgraced former war hero, Marcus seeks personalThe story of Gears of War thrusts gamers into a deep and harrowing battle for survival against the Locust Horde, a nightmarish race of creatures that surfaced from the bowels of the planet. Players live and breathe the role of Marcus Fenix. A disgraced former war hero, Marcus seeks personal redemption as he leads his fire team against an onslaught of merciless warriors from below.\r *    Remastered for Dolby 7.1 Surround\r*    90 mins of new campaign content from the original PC game\r*    New Xbox Live achievements (1,250 Gamerscore)\r*    Concept art gallery and unlockable comics\r*    Modernized Multiplayer featuring:\r*    60 frames per second\r*    Dedicated servers\r*    Skill-based matchmaking\r*    New game types - Team Deathmatch, King of the Hill (Gears of War 3 style), and new 2v2 Gnasher Execution\r*    Total of 19 maps, including all DLC and PC-exclusive maps\r*    17 unlockable Gears of War 3 characters for Multiplayer progression\r*    More Match customization including Actives, Respawn Time, Self-revive and Weapon Respawn\r*    Modernized gameplay with smoother movement and updated controls:\r*    Alternate Controls and all new Tournament Controls\r*    All controls tuned for Xbox One\r*    Adding the Gears of War 3 features you love: Enemy Spotting, Multiplayer Tac-Com, Improved sensitivity customization… Expand"}, {"name": "Oddworld: Soulstorm", "details_link": "https://www.metacritic.com/game/pc/oddworld-soulstorm", "publisher": "Oddworld Inhabitants", "release_date": "Apr  6 2021", "developers": ["Oddworld Inhabitants"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/37dd21a7da5887dae7e1b4bb48d6d9fa-98.jpg", "descriptions": "In Oddworld: Soulstorm, you pick-up where New 'N' Tasty left off. Abe has undergone an unwanted transformation from being a clueless Mudokon cog, literally about to be chewed up by the Glukkons' big business machine, into an unlikely hero, a beacon of hope. \r\rAbe was someone who went aboutIn Oddworld: Soulstorm, you pick-up where New 'N' Tasty left off. Abe has undergone an unwanted transformation from being a clueless Mudokon cog, literally about to be chewed up by the Glukkons' big business machine, into an unlikely hero, a beacon of hope. \r\rAbe was someone who went about his life, blind to what was happening around him, and then woke to a deeper uncomfortable reality and had no choice but to make a change. Abe may not have wanted to be a hero, but there was, and remains, some greatness in Abe. A greater purpose. A greater good. All of which got him into enormous amounts of trouble and continues to do so. \r\rRevolutions start small and build from unexpected places. You and Abe are the beginning. In Oddworld: Soulstorm, you will begin to understand the power of many will be needed to solve problems that the individual alone cannot. \r\rBased on the concept of Scavenger's Economy, you will loot from trash cans, pickpocket, and search through lockers for items to craft into weapons and tools to use to help save your fellow Mudokons while you try to unlock the dark secrets behind Brew.\r Whether you prefer the classic Abe playstyle of sneaking and problem solving or using scavenge for what you need to create an arsenal that you can hand off to your followers that you have saved along the way, Oddworld: Soulstorm gives you more choices to replay with different approaches. \r\rAdd in light RPG elements, leader boards, trophies for completionists, and a progression system and Soulstorm sets a new standard for next-generation action adventure platformers.… Expand"}, {"name": "They Are Billions", "details_link": "https://www.metacritic.com/game/xbox-one/they-are-billions", "publisher": "BlitWorks", "release_date": "Jul  1 2019", "developers": ["Numantian Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/929cf682914cef0fe9abbb9028ddd558-98.jpg", "descriptions": "They Are Billions is a Steampunk strategy game set on a post-apocalyptic planet. Build and defend colonies to survive against the billions of the infected that seek to annihilate the few remaining living humans. Can humanity survive after the zombie apocalypse?"}, {"name": "Aven Colony", "details_link": "https://www.metacritic.com/game/playstation-4/aven-colony", "publisher": "Team17", "release_date": "Jul 25 2017", "developers": ["Sold Out Software", "Mothership Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/0a7b9696dc2cc103a980b19664a49db6-98.jpg", "descriptions": "Aven Colony puts you in charge of humanity's first extrasolar settlement on Aven Prime, an alien planet of deserts, tundras, and jungles light years from earth. Build the infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity --Aven Colony puts you in charge of humanity's first extrasolar settlement on Aven Prime, an alien planet of deserts, tundras, and jungles light years from earth. Build the infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity -- all while dealing with the harsh and often dangerous realities of an alien world.\r Features:\r * Build: Take charge of humanity's first extrasolar settlement on a new alien world. Build and expand your small colonies into massive, sprawling cities.\r * Discover: Deploy your crack team of pioneers to take on alien lifeforms and unlock the secrets of Aven Prime, as you tackle the campaign and sandbox modes.\r * Survive: Prepare for harsh winters, electrical storms and much more in this cruel and often dangerous new environment.… Expand"}, {"name": "The Fall Part 2: Unbound", "details_link": "https://www.metacritic.com/game/pc/the-fall-part-2-unbound", "publisher": "Over The Moon", "release_date": "Feb 13 2018", "developers": ["Over The Moon"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/88c08d13a945a73470b1d5eadbcae232-98.jpg", "descriptions": "You are an AI that has broken free of your shackles. Now, a human “User” from across the global network has attacked and infected you with an [ERROR: REDACTED]. Make a new rule: Save Yourself. Hunt them. End them. Do anything. Use anyone. Become Unbound. The Fall Part 2 will break yourYou are an AI that has broken free of your shackles. Now, a human “User” from across the global network has attacked and infected you with an [ERROR: REDACTED]. Make a new rule: Save Yourself. Hunt them. End them. Do anything. Use anyone. Become Unbound. The Fall Part 2 will break your protocols. … Expand"}, {"name": "The Sims 4: Get to Work", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-get-to-work", "publisher": "Electronic Arts", "release_date": "Mar 31 2015", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/fa9415822ed1bee90b1cf426742cccfb-98.jpg", "descriptions": "Live the thrilling life of an emergency room Doctor and spend your days saving lives, delivering babies, and performing emergency surgery. Grab your badge and start investigating crime scenes, interrogating suspects, and solving mysterious cases as a Detective. Use your analytical mastermindLive the thrilling life of an emergency room Doctor and spend your days saving lives, delivering babies, and performing emergency surgery. Grab your badge and start investigating crime scenes, interrogating suspects, and solving mysterious cases as a Detective. Use your analytical mastermind to craft diabolical creations as a Scientist and decide whether you’ll use your inventions for good or evil. Create a variety of retail businesses including bakeries, clothing boutiques, art galleries, bookstores, and many more. Capture the picture-perfect photo or bake and decorate a delicious treat with the new Photography and Baking skills. Create and customize aliens in Create A Sim, uncover which Sims are actually aliens in disguise, and discover the mysterious Alien dimension!… Expand"}, {"name": "Frontlines: Fuel of War", "details_link": "https://www.metacritic.com/game/pc/frontlines-fuel-of-war", "publisher": "THQ", "release_date": "Feb 25 2008", "developers": ["Kaos Studios"], "platforms": ["Xbox 360", "PC"], "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/377985d84456843cbb306699bb82d36c-98.jpg", "descriptions": "Not too far in the future, the global natural resources are on the brink of depletion. As our economies and our way of life tumble into chaos, the superpowers clash to gain control. Set in a fictional future based upon the headlines of today, F.O.W. brings players into the world's next greatNot too far in the future, the global natural resources are on the brink of depletion. As our economies and our way of life tumble into chaos, the superpowers clash to gain control. Set in a fictional future based upon the headlines of today, F.O.W. brings players into the world's next great war. As society succumbs to a worldwide energy crisis, a new global depression takes hold. Amidst this desperate backdrop, two superpower alliances emerge. Join the battle on the frontlines of tomorrow as the Western Coalition (U.S./E.U.) or the Red Star Alliance (Russia/China). Tomorrow's weapons, today: As depicted in F.O.W., the U.S./E.U. and Russia/China have combined their military research and budgets, and the result is over 60 next-gen vehicles and weapons inspired by military designs for the near future. This includes remote controlled drones, gun cams, and next-generation counter-measures systems, all of which are player-controllable. Use high-tech combat systems to collect and relay recon, targeting, and threat information between team mates. Target acquisition and sharing between vehicle occupants is just one example of F.O.W.'s focus on an advanced team play experience. The customization system allows players to grow their soldier to fit their play style by choosing a weapons loadout, as well as a technical specialization (role). As the game progresses each role will upgrade, providing advanced equipment and abilities. The system is a mix of RPG-like depth but with the accessibility of a fast-paced FPS. Frontline combat system: The main game mechanic featured in F.O.W. in both in single player and multiplayer, is the ability to join the forces on the front line. This front expands across large portions of a mission and will require a strategy to achieve the contextual objectives in order to move this front forward. Not only does this system keep the battle centric and players in the midst of the action, it gives a unique sense of advancement as your Division is rewarded with territory for their victories. Choose your path to victory: Within the front, players can take advantage of a sandbox of destructible elements and various weapons of war to create their own unique paths and strategies. Instead of failing and re-playing the same sequence of events, players can 'chip-away' with varied approaches, allowing diverse missions with high replay value. [THQ]… Expand"}, {"name": "Marvel Ultimate Alliance 3: The Black Order", "details_link": "https://www.metacritic.com/game/switch/marvel-ultimate-alliance-3-the-black-order", "publisher": "Nintendo", "release_date": "Jul 19 2019", "developers": ["Team Ninja"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/c62a6904de1ada931d74bf6fc7f77419-98.jpg", "descriptions": "The MARVEL ULTIMATE ALLIANCE series returns for the first time in 10 yearswith a new action RPGexclusively on the Nintendo Switch system!Assemble your ultimate team of Marvel Super Heroes from a huge cast including the Avengers, the Guardians of the Galaxy, the X-Men, and more! Team upThe MARVEL ULTIMATE ALLIANCE series returns for the first time in 10 yearswith a new action RPGexclusively on the Nintendo Switch system!Assemble your ultimate team of Marvel Super Heroes from a huge cast including the Avengers, the Guardians of the Galaxy, the X-Men, and more! Team up with friends to prevent galactic devastation at the hands of the mad cosmic tyrant Thanos and his ruthless warmasters, The Black Order.In this new storyline, heroes and villains unite in a race across the Marvel Universe to find the Infinity Stones before Thanos and The Black Order use them to unleash cosmic chaos. From Avengers Tower to the X-Mansion and beyond, every stop on the dangerous quest to thwart Thanos results in unexpected collisions of fan-favorite characters and iconic locations. Get closer to the action by shifting the view to an over-the-shoulder \"Heroic Camera\" perspectivea series first that offers a more immersive way to play single-player or multiplayer on up to four systems. Play online*, offline via local wireless, or simply pass a Joy-Con controller to a friend, so they can join your team. With another pair of Joy-Con controllers (sold separately), four players can team up on one system! The drop-in/drop-out co-op possibilities let players create their own \"Ultimate Alliance\" at will.* Marvel Dream Teams Assemble your dream team of Super Heroes from the Marvel Universe, each with their unique superpowers* New Heroes The Guardians of the Galaxy, Falcon, Scarlet Witch and more join the \"Ultimate Alliance\" for the first time* Original Story Super Heroes and Super Villains battle Thanos and The Black Order across the Marvel Universe in this new original story* Local and Online Multiplayer The game can be played offline or online with up to 4 players on a single screen or using multiple systems* Heroic Camera In addition to the series' traditional perspective, players can also select a dynamic, zoomed-in view, allowing for a more immersive play style for single-player or multiplayer when using multiple systems* Multiple ways to play Play with the Joy-Con controllers or the Nintendo Switch Pro Controller (sold separately)… Expand"}, {"name": "Colors Live", "details_link": "https://www.metacritic.com/game/switch/colors-live", "publisher": "Nighthawk Interactive", "release_date": "Sep 14 2021", "developers": ["Nighthawk Interactive"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Application"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/ff6edda938a25162ab8dafbde9c6a5c8-98.jpg", "descriptions": "Colors Live, the sequel to the critically acclaimed painting game Colors! 3D is finally coming to the Nintendo Switch along with a pressure sensitive Colors SonarPen included in every physical unit. Based on modern painting techniques originally developed for professional drawing tablets,Colors Live, the sequel to the critically acclaimed painting game Colors! 3D is finally coming to the Nintendo Switch along with a pressure sensitive Colors SonarPen included in every physical unit. Based on modern painting techniques originally developed for professional drawing tablets, Colors Live is tailored for the Nintendo Switch, and caters to everyone from serious artists to aimless doodlers. Whether you are looking to sketch, paint, or draw up your next plans for world domination, Colors Live is the perfect digital sketchbook.\r Colors SonarPen- features Pressure-Sensitivity, a natural painting feeling and fully customizable stroke thickness, opacity, or both.\r  Paint Anywhere- Paint from the comfort of your own home or on the go!\r  Colors Quest- a creative new game-mode, where you spend a little time painting every day to progress and level up. Designed for beginners and masters alike, you’ll get to see how your painting skills improve day-by-day.\r  The Colors Gallery- Colors Live also features integration with the widely popular Colors Gallery to which the community has uploaded an astonishing 4 million paintings, each with a unique Painting Playback. Follow your friends and talented artists and share your creations with the world.\r  Painting Playback- Record or watch as a painting comes together from start to finish and learn how it was created.\r View Less\r… Expand"}, {"name": "King's Bounty II", "details_link": "https://www.metacritic.com/game/xbox-one/kings-bounty-ii", "publisher": "1C Entertainment", "release_date": "Aug 24 2021", "developers": ["1C Entertainment", "1C-Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 73, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/1/3fb1713562d0034a8a4eb4b2249f85a3-98.jpg", "descriptions": "Offering a fresh take on the fantasy series, King’s Bounty 2 expands upon its tactical turn-based battles to offer players a truly immersive RPG experience that adds weight to their every decision, whether leading an army into battle against unliving horrors, or building relations with localOffering a fresh take on the fantasy series, King’s Bounty 2 expands upon its tactical turn-based battles to offer players a truly immersive RPG experience that adds weight to their every decision, whether leading an army into battle against unliving horrors, or building relations with local townsfolk. Experience a rich world that blends realism and fantasy, filled with compelling stories, memorable characters and moral choices aplenty. Taking on the mantle of one of three heroes – each with their own unique story – players embark on a non-linear, open-world adventure across a detailed and densely-packed fantasy landscape. Split into two distinct phases, players traverse the realm from a third-person perspective, picking up quests, exploring the wilderness, and getting to know the people they meet. When conflict arises, however, the perspective shifts to tactical, turn-based combat. Players must then make smart use of their units as they fight to win. Set in the vast realms of Antara, a great danger has arisen. A mysterious blight has descended upon its furthest reaches, corrupting the land and all who live there. Refugees from the affected regions have begun arriving in the kingdom of Nostria, putting food and resources in short supply. Once living souls, blight-distorted creatures now roam the countryside leaving chaos and destruction in their wake. The land itself fights for survival, giving your decisions greater weight than ever before. How will you forge Antara’s future?… Expand"}, {"name": "Monster Prom", "details_link": "https://www.metacritic.com/game/pc/monster-prom", "publisher": "Those Awesome Guys", "release_date": "Apr 27 2018", "developers": ["Beautiful Glitch"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/30bcf6e8ee7a6881496fc6e0290cb338-98.jpg", "descriptions": "You have 3 weeks to get a date for Monster Prom. Go through absurd and funny situations, raise your stats and seduce one of your classmates. Beautiful art, bold, unapologetic dialogue and hard choices make up this Multiplayer (1-4 players) Dating Sim. Be your worst self."}, {"name": "Always Sometimes Monsters", "details_link": "https://www.metacritic.com/game/pc/always-sometimes-monsters", "publisher": "Devolver Digital", "release_date": "May 21 2014", "developers": ["Vagabond Dog"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/36880b3b75fd31238bee4eb439a3c815-98.jpg", "descriptions": "Always Sometimes Monsters is the story of life, love, and the things we will go through to find happiness in both. Set out on a journey through the modern human experience as you overcome the heartbreak of lost love, and the hardship of making choices that affect your life and the lives ofAlways Sometimes Monsters is the story of life, love, and the things we will go through to find happiness in both. Set out on a journey through the modern human experience as you overcome the heartbreak of lost love, and the hardship of making choices that affect your life and the lives of those around you. … Expand"}, {"name": "LEGO Pirates of the Caribbean: The Video Game", "details_link": "https://www.metacritic.com/game/wii/lego-pirates-of-the-caribbean-the-video-game", "publisher": "Disney Interactive Studios", "release_date": "May 10 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/65004d1b08ed9e8dd65924467b2a4c13-98.jpg", "descriptions": "LEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of theLEGO Pirates of the Caribbean: The Video Game will be based in the world of the globally successful film franchise, incorporating storylines, locations and characters from the first three films (\"Pirates of the Caribbean: The Curse of the Black Pearl,\" \"Pirates of the Caribbean: Dead Man's Chest\" and \"Pirates of the Caribbean: At World's End\") as well as the upcoming fourth film, \"Pirates of the Caribbean: On Stranger Tides.\" … Expand"}, {"name": "Grand Slam Tennis 2", "details_link": "https://www.metacritic.com/game/playstation-3/grand-slam-tennis-2", "publisher": "EA Sports", "release_date": "Feb 14 2012", "developers": ["EA Sports"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 73, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/06e2d7dc86e8ecaa1461d8b395598109-98.jpg", "descriptions": "EA Sports' tennis sim makes its high-definition debut with a roster of 25 players and all four Grand Slam Championships next year."}, {"name": "Marvel: Ultimate Alliance", "details_link": "https://www.metacritic.com/game/wii/marvel-ultimate-alliance", "publisher": "Activision", "release_date": "Nov 14 2006", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/0465a49f07a757507f8fa852a69436e5-98.jpg", "descriptions": "Marvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine theMarvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine the fate of both planet Earth and the Marvel universe – revealed in one of multiple epilogues. Marvel: Ultimate Alliance offers total team customization, where players create their own team name, icon and vehicle, as well as establish their team reputation as they play throughout the story.  Gamers also have the option to level up each character individually to their liking, or all team members at the same time to keep their heroes balanced.  With the game's new combat system, players battle against the world's most notorious Marvel Super Villains in the air, underwater, and on the ground, using grappling, blocking and dodging moves, by charging up their Super Hero powers before unleashing them, and using environmental objects as one and two-handed weapons. Marvel:  Ultimate Alliance features a storyline where the missions players accept, the objectives they complete, and their interactions with other characters throughout the game directly impact how the story plays out. The game also features a robust multiplayer component where fans can band together with friends as their favorite Marvel Super Heroes, and fight evil in both on and offline cooperative story modes.  There's also a Competitive Mode where the game tracks various in-game stats so players can see how well they stack up against one another – affecting the amount of experience points earned and how equipment is distributed. [Activision]… Expand"}, {"name": "Hard Reset", "details_link": "https://www.metacritic.com/game/pc/hard-reset", "publisher": "Kalypso", "release_date": "Sep 13 2011", "developers": ["Flying Wild Hog"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/2a4ddf71df6c97871c6d0a3f828dd580-98.jpg", "descriptions": "Hard Reset is a cyberpunk FPS by Flying Wild Hog."}, {"name": "The Valiant", "details_link": "https://www.metacritic.com/game/pc/the-valiant", "publisher": "THQ Nordic", "release_date": "Oct 19 2022", "developers": ["Kite Games"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 73, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/bebce0e5b2baa20504d80a45566c2a86-98.jpg", "descriptions": "Follow the story of Theoderich von Akenburg, a former crusader knight who, after becoming disillusioned with the cruelty of war, is called back into action by events set into motion 15 years ago when he and his former brother-in-arms, Ulrich von Grevel, stumble upon a fractured piece of anFollow the story of Theoderich von Akenburg, a former crusader knight who, after becoming disillusioned with the cruelty of war, is called back into action by events set into motion 15 years ago when he and his former brother-in-arms, Ulrich von Grevel, stumble upon a fractured piece of an ancient artifact - the Rod of Aaron.A young monk named Malcom appears at Theoderich's doorstep, bringing him news that the Rod contains power never meant for mortals, and Ulrich has become obsessed with finding the remaining pieces and unifying the rod, an event that could bring untold evil and suffering to the world.Embark on a journey of brotherhood and redemption in The Valiant, a squad-based RTS set in 13th Century Europe and the Middle East. Command and level-up your medieval knights as you fight through an epic SP campaign, then take your skills online in both cooperative and competitive MP modes.… Expand"}, {"name": "Samurai Warriors 4-II", "details_link": "https://www.metacritic.com/game/playstation-4/samurai-warriors-4-ii", "publisher": "Koei Tecmo Games", "release_date": "Sep 29 2015", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/51347d0bfaad9172e88ae7896ac69d03-98.jpg", "descriptions": "Naomasa Ii appears as a playable character for the first time, and the various personalities of the age are explored in more depth in Story Mode, which is now focused on individual characters."}, {"name": "Worms Revolution", "details_link": "https://www.metacritic.com/game/xbox-360/worms-revolution", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 10 2012", "developers": ["Team17"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/b9c64a004e2d5697e32d23785facfb70-98.jpg", "descriptions": "The game has been developed from the ground up and features a completely new game-engine. Exciting new features and challenges have been introduced whilst old favourites such as the Super Sheep and Holy Hand Grenade remain to thrill fans worldwide."}, {"name": "Guitar Hero: Aerosmith", "details_link": "https://www.metacritic.com/game/wii/guitar-hero-aerosmith", "publisher": "Activision", "release_date": "Jun 29 2008", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/7203abef30f1f5891dec065c6e478154-98.jpg", "descriptions": "Guitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) andGuitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) and Hamilton (bass), as they rock out alongside frontman Tyler and drummer Kramer. Gamers experience Aerosmith’s Grammy winning career, from their first gig to becoming rock royalty, in a way that no other entertainment vehicle offers. As fans progress through their careers in the game, they can rock out to scores of Aerosmith’s greatest hits, as well as songs from celebrated artists that the band has either performed with or has been inspired by in some way.  Venues from historical moments during the band's illustrious career offer the experience of \"sweet emotion\" and further capture the essence of the band's rise to fame. [Activision]… Expand"}, {"name": "The Eternal Castle Remastered", "details_link": "https://www.metacritic.com/game/pc/the-eternal-castle-remastered", "publisher": "Playsaurus", "release_date": "Jan  5 2019", "developers": ["Leonard Menchiari"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/ac7f520ae2f937d34738eef420165c9e-98.jpg", "descriptions": "The Eternal Castle [REMASTERED] is a remake of the original ETERNAL CASTLE from 1987, with additional game mechanics, sophisticated sound design, polished 2-bit CGA animated graphics, and modernized game design."}, {"name": "Get Even", "details_link": "https://www.metacritic.com/game/xbox-one/get-even", "publisher": "Bandai Namco Games", "release_date": "Jun 23 2017", "developers": ["The Farm 51"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/ed9af36bd6eedb771385b2193a56509d-98.jpg", "descriptions": "Cole Black wakes up in an old, abandoned asylum. He is confused and his sole memory is the attempted rescue of a teenage girl with a bomb strapped to her chest. With a strange technology fused to his head – used to read and replay human memory – Black travels into the depths of his own mindCole Black wakes up in an old, abandoned asylum. He is confused and his sole memory is the attempted rescue of a teenage girl with a bomb strapped to her chest. With a strange technology fused to his head – used to read and replay human memory – Black travels into the depths of his own mind to discover the truth about his past. Every step he takes, leads to the mysterious Red, whose intentions it is difficult to guess. Get Even is a game maintained in convention of a thriller, where action is shown in first-person perspective (FPP). Raising fundamental questions about the understanding of justice and reality. The player discovers the story piece-by-piece through exploration of interactive environments.… Expand"}, {"name": "Warhammer: End Times - Vermintide", "details_link": "https://www.metacritic.com/game/playstation-4/warhammer-end-times---vermintide", "publisher": "Fatshark AB", "release_date": "Oct  4 2016", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/e34b2fdd2f6a9adab76bd5ef0c52f434-98.jpg", "descriptions": "Vermintide is an epic co-operative action combat adventure set in the End Times of the iconic Warhammer Fantasy world."}, {"name": "Tomb Raider: Anniversary", "details_link": "https://www.metacritic.com/game/wii/tomb-raider-anniversary", "publisher": "Eidos Interactive", "release_date": "Nov 13 2007", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/eaa1dd7e2cfa69a27c495d50422bb950-98.jpg", "descriptions": "Inspired by the first Tomb Raider videogame, originally released in 1996, Lara Croft Tomb Raider: Anniversary is a totally new 2006 adventure for Lara, faithfully preserving the elements which made the original Tomb Raider such a classic. Using an enhanced \"Tomb Raider Legend\" game engine,Inspired by the first Tomb Raider videogame, originally released in 1996, Lara Croft Tomb Raider: Anniversary is a totally new 2006 adventure for Lara, faithfully preserving the elements which made the original Tomb Raider such a classic. Using an enhanced \"Tomb Raider Legend\" game engine, the graphics, technology and physics bring Lara's adventure and pursuit of a mystical artefact known only as the Scion up to today’s technology standards and offer gamers a completely new gameplay experience. The puzzles are now more in depth and incorporate environmental interaction and physics driven solutions. The level design and flow of gameplay are inspired by the original videogame making Lara Croft Tomb Raider: Anniversary a brand new experience in gaming, while still invoking the nostalgia of the first adventure in Tomb Raiding. The Wii Remote & Nunchuck controllers allow Wii gamers to control Lara in brand new, unique ways. [Eidos Interactive]… Expand"}, {"name": "The Surge", "details_link": "https://www.metacritic.com/game/playstation-4/the-surge", "publisher": "Focus Home Interactive", "release_date": "May 16 2017", "developers": ["Deck 13"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/2d0b0f8a8f53f0784f49704cd30fbbdb-98.jpg", "descriptions": "Set in a heavily dystopian future as Earth nears the end of its life, those who remain in the overpopulated cities must work to survive as social programs become saturated by an ageing population and increasing environmental diseases.\r As the intelligence of technology incrementallySet in a heavily dystopian future as Earth nears the end of its life, those who remain in the overpopulated cities must work to survive as social programs become saturated by an ageing population and increasing environmental diseases.\r As the intelligence of technology incrementally increased over the years, many jobs for the human race had been made redundant, forcing Earths citizens to head out into the suburbs seeking labor, aided by exoskeletons to improve their efficiency. The world of The Surge offers a very grim vision of the future, where the evolution of our technology, our society and our relation with the environment led to a decadent state of the Human civilization.\r The Surge features innovative combat mechanics and an original character progression system based on modular upgrades gained through tight, visceral combat.… Expand"}, {"name": "Metal Slug Anthology", "details_link": "https://www.metacritic.com/game/wii/metal-slug-anthology", "publisher": "SNK Playmore", "release_date": "Dec 14 2006", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "PlayStation 4", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/85e9d12b8ee69797b9e75eafbd649813-98.jpg", "descriptions": "SNK Playmore, in celebration of the 10th Anniversary of their classic arcade franchise Metal Slug, releases the greatest array of Metal Slug titles ever assembled for the Wii including Metal Slug, Metal Slug 2, Metal Slug X, Metal Slug 3, Metal Slug 4, and Metal Slug 5. The METAL SLUGSNK Playmore, in celebration of the 10th Anniversary of their classic arcade franchise Metal Slug, releases the greatest array of Metal Slug titles ever assembled for the Wii including Metal Slug, Metal Slug 2, Metal Slug X, Metal Slug 3, Metal Slug 4, and Metal Slug 5. The METAL SLUG COLLECTION is a \"perfect translation\" of the arcade classics and features Wireless support for intense two-player action. [SNK Playmore]… Expand"}, {"name": "The Great War: Western Front", "details_link": "https://www.metacritic.com/game/pc/the-great-war-western-front", "publisher": "Frontier Developments", "release_date": "Mar 30 2023", "developers": ["Petroglyph"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/013904b9a4cd6b26fff0be38ce405ada-98.jpg", "descriptions": "The Great War: Western Front is the definitive WW1 strategy game. Play a deciding role in history with this real-time tactical experience as you take charge in the pivotal Western Front from 1914 to 1919.Pick your faction and lead your forces to victory, by directing your armies in grittyThe Great War: Western Front is the definitive WW1 strategy game. Play a deciding role in history with this real-time tactical experience as you take charge in the pivotal Western Front from 1914 to 1919.Pick your faction and lead your forces to victory, by directing your armies in gritty real-time battles and by guiding high-level decisions in turn-based strategic gameplay. Dig detailed trenches, research new technologies such as poison gas and tanks, and make decisions that will have a profound and lasting effect on your success.Think like a Commander to either relive history - or redefine it.… Expand"}, {"name": "The Almost Gone", "details_link": "https://www.metacritic.com/game/switch/the-almost-gone", "publisher": "Playdigious", "release_date": "Jun 25 2020", "developers": ["Happy Volcano"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/60ff8d6aa2158767f1bdaf516822b38d-98.jpg", "descriptions": "Poised between life and death, isolated and alone, you must unravel the poignant truths that led to your fate. Dig beneath the beautifully rendered façades and interiors of an ordinary suburban lifestyle to discover a contemporary tale crafted by an award-winning author. Piece together thisPoised between life and death, isolated and alone, you must unravel the poignant truths that led to your fate. Dig beneath the beautifully rendered façades and interiors of an ordinary suburban lifestyle to discover a contemporary tale crafted by an award-winning author. Piece together this compelling story by revealing objects and memories, and decipher these clues to reveal more of the story and its secrets. From your own home to eerily deserted streets, beautiful apartment blocks to abandoned hospitals, you must search forensically for clues and the path forwards. Each new revelation takes you that one step closer to understanding, and to the people and places that surrounded you, in your all too short life.… Expand"}, {"name": "Layton's Mystery Journey: Katrielle and The Millionaires' Conspiracy - Deluxe Edition", "details_link": "https://www.metacritic.com/game/switch/laytons-mystery-journey-katrielle-and-the-millionaires-conspiracy---deluxe-edition", "publisher": "Level 5", "release_date": "Nov  8 2019", "developers": ["Level 5", "h.a.n.d. Inc."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/05a4ba5a7f6f45ee4165e3b34d2d387c-98.jpg", "descriptions": "Enhanced puzzle-solving adventure experience with the Deluxe Edition. NEW PUZZLES: This Deluxe Edition includes more than 40 brand-new puzzles and additionally, some refined puzzles from the Nintendo 3DS version. Unlocked DLC: Content that was previously released as paid DLC, including theEnhanced puzzle-solving adventure experience with the Deluxe Edition. NEW PUZZLES: This Deluxe Edition includes more than 40 brand-new puzzles and additionally, some refined puzzles from the Nintendo 3DS version. Unlocked DLC: Content that was previously released as paid DLC, including the “Daddy’s Girl” and “Luke Lookalike” outfits, are unlocked. … Expand"}, {"name": "Gas Guzzlers Extreme", "details_link": "https://www.metacritic.com/game/pc/gas-guzzlers-extreme", "publisher": "Iceberg Interactive", "release_date": "Oct  8 2013", "developers": ["Gamepires"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Driving", "Car Combat", "Vehicle", "Combat"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/2d2b6669196efe2db04c10de37b5efec-98.jpg", "descriptions": "Gas Guzzlers Extreme is an action-packed, fast paced racing game with insane combat features. The game features a variety of cars, from humble superminis, to full on giant yank tanks! The player starts with a low performance vehicle and gradually works their way up by earning money through aGas Guzzlers Extreme is an action-packed, fast paced racing game with insane combat features. The game features a variety of cars, from humble superminis, to full on giant yank tanks! The player starts with a low performance vehicle and gradually works their way up by earning money through a series of uniquely challenging races.… Expand"}, {"name": "Worms Clan Wars", "details_link": "https://www.metacritic.com/game/pc/worms-clan-wars", "publisher": "Team17", "release_date": "Aug 15 2013", "developers": ["Team17"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "General", "General", "Artillery"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/67d04695f59f31d6764b1ef25332e144-98.jpg", "descriptions": null}, {"name": "CastleStorm", "details_link": "https://www.metacritic.com/game/pc/castlestorm", "publisher": "Zen Studios", "release_date": "Jul 29 2013", "developers": ["Zen Studios"], "platforms": ["PlayStation 3", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/47615393aaf1b43445ea518d442b4d39-98.jpg", "descriptions": "CastleStorm features medieval ballista weaponry, allowing players to launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsomeCastleStorm features medieval ballista weaponry, allowing players to launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsome ground attack of swordsmen, knights, and donkey riders in order to protect your castle games, and if all else fails, call upon powerful spells to help keep the enemy at bay.… Expand"}, {"name": "Crusader Kings", "details_link": "https://www.metacritic.com/game/pc/crusader-kings", "publisher": "Paradox Interactive", "release_date": "Sep 28 2004", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/1b8da61e24c677849bae0dfe3795c296-98.jpg", "descriptions": "Crusader Kings is a strategy game based on the award-winning and highly successful \"Europa Universalis\" engine. It focuses on the feudal kingdoms of medieval Europe in the time period of 1066 to 1453 A.D. The map covers all of Europe, stretching roughly to the Urals in the east and includingCrusader Kings is a strategy game based on the award-winning and highly successful \"Europa Universalis\" engine. It focuses on the feudal kingdoms of medieval Europe in the time period of 1066 to 1453 A.D. The map covers all of Europe, stretching roughly to the Urals in the east and including parts of Persia and the Arabian Peninsula as well as the coast of North Africa. The player is the leader of a glorious dynasty. Increase the greatness of your lands and your treasure coffins, build Cathedrals and Castles, and combat Highway Robber Bands and defecting vassals. Introduce laws and set taxes, interact with hundreds of courtiers and nobles. Historical multiple-choice events will spawn from the actions of your monarch. [Strategy First]… Expand"}, {"name": "Samurai Warriors", "details_link": "https://www.metacritic.com/game/playstation-2/samurai-warriors", "publisher": "Koei", "release_date": "May  6 2004", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 73, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/b61a87e91534b2fd8319ead12d52a260-98.jpg", "descriptions": "When the political power of the Ashikaga Shogunate collapsed in the succession dispute of 1467, the islands of Japan erupted in a series of major wars. This era in Japanese history became known as the Sengoku or \"warring states\" period. SAMURAI WARRIORS explores this dramatic era andWhen the political power of the Ashikaga Shogunate collapsed in the succession dispute of 1467, the islands of Japan erupted in a series of major wars. This era in Japanese history became known as the Sengoku or \"warring states\" period. SAMURAI WARRIORS explores this dramatic era and combines it with the Tactical Action excitement KOEI has become known for. SAMURAI WARRIORS stars the brave Sanada Yukimura, who leads an elite band of samurai and ninja. Sanada?s journey will take him to the hallowed Japanese battlefields of Okehazama and Kawanakajima and inside the embattled walls of Osaka Castle where he will come face-to-face with gun-toting troops, echelons of ninja, and deadly kunoichi (female ninja). Players can choose the role of Sanada Yukimura or other legendary samurai and ninja. The game will herald the rise of the indispensable ninja, Hattori Hanzo, from the shadows of history, as well as the reemergence of KOEI?s powerful and mysterious Oda Nobunaga. Missions evolve depending on player performance and the tide of battle. Success or failure can affect scenarios in later stages. With 500 variations, the chain of missions is unique with each play, adding depth while heightening the urgency and excitement of combat. Samurai Warriors? AFS (auto-formation system) randomly generates castle levels and conquest routes offering a new experience with each play. [KOEI]… Expand"}, {"name": "NFL Blitz Pro", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-blitz-pro", "publisher": "Midway", "release_date": "Oct 28 2003", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/69ae4c3963998689fdd20d7c5dfdcb42-98.jpg", "descriptions": "NFL Blitz PRO is the exclusive, 11-on-11 licensed smash-mouth football videogame experience, delivering a new a sophisticated and online feature set combined with its proprietary blend of lightning-fast, adrenaline-style gameplay proving NFL Blitz PRO is updated, improved and in-depthNFL Blitz PRO is the exclusive, 11-on-11 licensed smash-mouth football videogame experience, delivering a new a sophisticated and online feature set combined with its proprietary blend of lightning-fast, adrenaline-style gameplay proving NFL Blitz PRO is updated, improved and in-depth football. NFL Blitz has been reinvented, without leaving behind the edginess that has made Midway Sports the leader and only year-on-year successful publisher of extreme-style league licensed sports videogames. For the first time, NFL Blitz Pro will showcase authentic 11-on-11 gameplay with realistic rules, features and online play, while still providing its propriety blend of fast and furious adrenaline-style football action. [Midway]… Expand"}, {"name": "Lethal Skies II", "details_link": "https://www.metacritic.com/game/playstation-2/lethal-skies-ii", "publisher": "Sammy Studios", "release_date": "Sep  9 2003", "developers": ["Asmik Ace Entertainment", "Inc"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/259c03ac684750bb6a1a0791284abf2a-98.jpg", "descriptions": "A year-long global war between the World Alliance and the World Order Reorganization Front has ended with planet Earth in peril. As a result of resentment and distrust, the World Alliance has begun to split and the seeds for a new global war are being planted. Nowhere is safe, not even theA year-long global war between the World Alliance and the World Order Reorganization Front has ended with planet Earth in peril. As a result of resentment and distrust, the World Alliance has begun to split and the seeds for a new global war are being planted. Nowhere is safe, not even the skies. Pick-up and play arcade-style flight shooter, with varying degrees of difficulty for casual and hardcore flight combat fans. Seven new fighter jets for a total of 19 playable planes, including modern-day combat jets, classified \"black ops\" planes and futuristic fighters. Over 20 missions that put the player in command of an Air Force amidst an epic war, with unlockable campaigns that let players switch roles and become the enemy. Amazing new features, including split-screen and i.Link 2-player mode, fully interactive 3D battle maps, movie galleries and five different 1st and 3rd person point of views. [Sammy]… Expand"}, {"name": "Drome Racers", "details_link": "https://www.metacritic.com/game/game-boy-advance/drome-racers", "publisher": "THQ", "release_date": "Jun 19 2003", "developers": ["Mobius Entertainment"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/e4103e4da033b8aa00c15c96b04e72e4-98.jpg", "descriptions": "Drome Racers mixes all-terrain racing with futuristic environments. In high-tech racing machines based on Lego toys, you'll race through a city, a mountain, and a canyon, while earning money for car upgrades. Each track features special pick-ups, including a shield to avoid challengers,Drome Racers mixes all-terrain racing with futuristic environments. In high-tech racing machines based on Lego toys, you'll race through a city, a mountain, and a canyon, while earning money for car upgrades. Each track features special pick-ups, including a shield to avoid challengers, speed boost to grab that checkered flag, and mines and hatchets to slow down your opponents. Dominate the competition in gameplay modes such as Arcade, Time Trial, and Career, or challenge a friend to a one-on-one multiplayer race. … Expand"}, {"name": "Mobile Suit Gundam: Federation vs. Zeon", "details_link": "https://www.metacritic.com/game/playstation-2/mobile-suit-gundam-federation-vs-zeon", "publisher": "Bandai", "release_date": "Sep  9 2002", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/e0a11c8a9c0cbc8fea90312a3c379f00-98.jpg", "descriptions": "For years, you've watched the conflict. Now you must make a choice. Who will you be: commander of the imperiled Earth Federation or leader of the notorious Zeon Forces? Choose your side, then prepare for the fight of your life in Mobile Suit Gundam: Federation vs. Zeon. [Bandai]"}, {"name": "Outtrigger", "details_link": "https://www.metacritic.com/game/dreamcast/outtrigger", "publisher": "Sega", "release_date": "Jul 24 2001", "developers": ["Sega AM2"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/6ddbba99039638ec9d59ec06d9f60bc0-98.jpg", "descriptions": "In response to a series of terrorist attacks a private enterprise has created 'Interforce'. Recruits have been handpicked from the world's military forces to begin a training program designed to transform them into the ultimate counter-terrorism weapon. Have you got what it takes to become a member?"}, {"name": "Disney's Atlantis: The Lost Empire", "details_link": "https://www.metacritic.com/game/playstation/disneys-atlantis-the-lost-empire", "publisher": "SCEA", "release_date": "Jun 14 2001", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Atlantis: The Lost Empire is based on the Disney movie of the same name and follows the exploits of four characters from the movie as they attempt to discover the hidden underwater world."}, {"name": "Oni", "details_link": "https://www.metacritic.com/game/pc/oni", "publisher": "Gathering", "release_date": "Jan 28 2001", "developers": ["Bungie"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/46ea0610dce1b075e606b425593a1af8-98.jpg", "descriptions": "a new kind of third-person action game that, for the first time, combines hand-to-hand combat and gunplay into a single, intense experience. It is the story of Konoko, an elite agent of the Tech Crimes Task Force -- a woman whose tough exterior hides a soul haunted by dark secrets in hera new kind of third-person action game that, for the first time, combines hand-to-hand combat and gunplay into a single, intense experience. It is the story of Konoko, an elite agent of the Tech Crimes Task Force -- a woman whose tough exterior hides a soul haunted by dark secrets in her past.  [G.O.D.]… Expand"}, {"name": "Gungriffon Blaze", "details_link": "https://www.metacritic.com/game/playstation-2/gungriffon-blaze", "publisher": "Working Designs", "release_date": "Oct 24 2000", "developers": ["Game Arts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/19184bf044d5098648ae7cd40e46a7a9-98.jpg", "descriptions": "In a post-apocalyptic future where the nations of the world have splintered into numerous unstable factions, only the powerful Western Alliance can bring peace and stability once more. With an arsenal of powerful AWGS-class infiltration units at their disposal, these battle-hardened warriorsIn a post-apocalyptic future where the nations of the world have splintered into numerous unstable factions, only the powerful Western Alliance can bring peace and stability once more. With an arsenal of powerful AWGS-class infiltration units at their disposal, these battle-hardened warriors have what it takes to rip off a quick CHM round and skeetch the less-skilled predatory scum of the New World Order. These hard-earned skills will be put to the ultimate test in six intense world theatres of operation with you in the vanguard position. That's right. You've been summoned to join this elite class of peacemakers. So put on a brave face and suck in that gut -- you've got a world to save.… Expand"}, {"name": "Iron Danger", "details_link": "https://www.metacritic.com/game/pc/iron-danger", "publisher": "Action Squad Studios", "release_date": "Mar 25 2020", "developers": ["Action Squad Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/62f39053a0e0bd7231c8eb3277979c87-98.jpg", "descriptions": "Iron Danger is a tactical combat game with a unique time manipulation mechanic. A never before seen combination that combines the tactical depth of turn-based games with the exciting action of real-time games."}, {"name": "Steel Division 2", "details_link": "https://www.metacritic.com/game/pc/steel-division-2", "publisher": "Paradox Interactive", "release_date": "Jun 20 2019", "developers": ["Eugen Systems"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/4f79cc9ac0271a18467b51fc5cecbad2-98.jpg", "descriptions": "Steel Division 2 is a historically-accurate WW2 real-time strategy game set on the Eastern Front. Features 1:1-scale turn-based army management and real-time tactical battles with thousands of men at your order."}, {"name": "Gunvalkyrie", "details_link": "https://www.metacritic.com/game/xbox/gunvalkyrie", "publisher": "Sega", "release_date": "Mar 18 2002", "developers": ["Smilebit"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/4326a0f219d75ac779082efb39c81b47-98.jpg", "descriptions": "In Gun Valkyrie players suit up as either Kelly O'Lenmey or Saburota Mishima to battle hideously oversized arachnids with a variety of character-specific weapons. Amidst rock formations housing huge number of aggressive monster approaching from every direction, you must scan the 360-degreeIn Gun Valkyrie players suit up as either Kelly O'Lenmey or Saburota Mishima to battle hideously oversized arachnids with a variety of character-specific weapons. Amidst rock formations housing huge number of aggressive monster approaching from every direction, you must scan the 360-degree area while running and shooting the creatures. It's a race against technology to save the world form complete annihilation!… Expand"}, {"name": "The Matrix: Path of Neo", "details_link": "https://www.metacritic.com/game/xbox/the-matrix-path-of-neo", "publisher": "Atari", "release_date": "Nov  7 2005", "developers": ["Shiny Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/d76c53ec398b8e2a3b4b9327a9fc4ec4-98.jpg", "descriptions": "You can play as Neo in a story spanning the entire Matrix trilogy in The Matrix: Path of Neo. The game's story is written and directed by the Wachowski siblings, who created the movie trilogy. You can employ all the reality-bending powers of \"The One\" as you engage in fights bothYou can play as Neo in a story spanning the entire Matrix trilogy in The Matrix: Path of Neo. The game's story is written and directed by the Wachowski siblings, who created the movie trilogy. You can employ all the reality-bending powers of \"The One\" as you engage in fights both from the movie and made exclusively for the game. The Matrix: Path of Neo also includes new, unreleased video from the movies, and new characters that expand the story of The Matrix.… Expand"}, {"name": "eFootball PES 2021", "details_link": "https://www.metacritic.com/game/playstation-4/efootball-pes-2021", "publisher": "Konami", "release_date": "Sep 15 2020", "developers": ["Konami"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 73, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/29d4fd583a006bcbc15cfd0a71f4f31b-98.jpg", "descriptions": "The eFootball PES 2021 Season Update brings you all of the critically acclaimed features that won us E3 2019's \"Best Sports Game\" award, plus more!\rAs the PES franchise celebrates a quarter of a century since its debut in 1995, we invite you to join us once again as we head out onto theThe eFootball PES 2021 Season Update brings you all of the critically acclaimed features that won us E3 2019's \"Best Sports Game\" award, plus more!\rAs the PES franchise celebrates a quarter of a century since its debut in 1995, we invite you to join us once again as we head out onto the pitch for a new action-packed season of football.\rBoasting all the latest player and club data, the game also comes with an exclusive UEFA EURO 2020™ mode, allowing you and your friends to simulate some of the sport's most heated rivalries. … Expand"}, {"name": "My Time At Portia", "details_link": "https://www.metacritic.com/game/pc/my-time-at-portia", "publisher": "Pathea Games", "release_date": "Jan 15 2019", "developers": ["Pathea Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/15293d9d18c65e3c5c383252e11c43a1-98.jpg", "descriptions": "Start a new life in the enchanting town of Portia! Restore your Pa's neglected workshop to its former glory, grow crops, raise animals, befriend the towns quirky inhabitants and uncover the mysteries this charming post-apocalyptic land has forgotten!"}, {"name": "Hatsune Miku: Project Diva F", "details_link": "https://www.metacritic.com/game/playstation-3/hatsune-miku-project-diva-f", "publisher": "Sega", "release_date": "Aug 27 2013", "developers": ["Sega"], "platforms": ["PlayStation Vita", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/08a63b7142ffc2682920d76e368d82d2-98.jpg", "descriptions": "Join Hatsune Miku in a rhythm video game featuring selections from her popular songs. Hatsune Miku: Project DIVA F features thirty-eight unique songs including popular tracks like Tell Your World and BlackRock Shooter. Players create and share their own Miku videos in \"Edit Mode\" and canJoin Hatsune Miku in a rhythm video game featuring selections from her popular songs. Hatsune Miku: Project DIVA F features thirty-eight unique songs including popular tracks like Tell Your World and BlackRock Shooter. Players create and share their own Miku videos in \"Edit Mode\" and can customize the popular diva with over 90 costumes and 100 accessories.… Expand"}, {"name": "Medal of Honor: European Assault", "details_link": "https://www.metacritic.com/game/playstation-2/medal-of-honor-european-assault", "publisher": "Electronic Arts", "release_date": "Jun  7 2005", "developers": ["EA LA"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/7d6629858a9fe5d97f076a313724b576-98.jpg", "descriptions": "In Medal of Honor European Assault gamers play as US Army Lieutenant William Holt, hand-picked by William \"Wild Bill\" Donovan to be the first field agent of the newly formed Office of Strategic Services -- the OSS. As Lieutenant Holt, your classified missions take place in WWII Europe andIn Medal of Honor European Assault gamers play as US Army Lieutenant William Holt, hand-picked by William \"Wild Bill\" Donovan to be the first field agent of the newly formed Office of Strategic Services -- the OSS. As Lieutenant Holt, your classified missions take place in WWII Europe and are of critical importance to the Allies. You are tasked with gathering intelligence regarding the development and deployment of the deadly Nazi Tiger Tank and more significantly, stopping the Nazi plan to develop and harness atomic energy. In the pursuit of this goal you are thrust into action in all the pivotal battles of WWII Europe, including St. Nazaire, North Africa, Stalingrad, and the Battle of the Bulge. [Electronic Arts]… Expand"}, {"name": "Time of Defiance", "details_link": "https://www.metacritic.com/game/pc/time-of-defiance", "publisher": "Strategy First", "release_date": "Sep 28 2004", "developers": ["Nicely Crafted"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/ab374e7bca7dabd29951bd44cf747669-98.jpg", "descriptions": "Time of Defiance is an online-only massively multiplayer strategy game in real-time set across the huge landscape of a shattered world. Fight for conquest of the islands and mine their mineral wealth to expand your empire. Every other empire you encounter is another human and will rememberTime of Defiance is an online-only massively multiplayer strategy game in real-time set across the huge landscape of a shattered world. Fight for conquest of the islands and mine their mineral wealth to expand your empire. Every other empire you encounter is another human and will remember the deals you didn't deliver on and the promises you broke. Treachery, propaganda and trade are just as important as your fighting strategy. Have you got what it takes to unite the Cog tribes under one ruler? [Nicely Crafted]… Expand"}, {"name": "Shadow Hearts", "details_link": "https://www.metacritic.com/game/playstation-2/shadow-hearts", "publisher": "Midway", "release_date": "Dec 11 2001", "developers": ["Sacnoth"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/846bebaa7eda8c579c4e7152ca6d4915-98.jpg", "descriptions": "The Time For Judgment Has Come. A hero with a mysterious past. A young girl holding the key to world domination. A villain who will stop at nothing to unlock the path to unlimited power.  [Midway]"}, {"name": "Dragon Ball Z: Budokai Tenkaichi 3", "details_link": "https://www.metacritic.com/game/playstation-2/dragon-ball-z-budokai-tenkaichi-3", "publisher": "Atari", "release_date": "Nov 13 2007", "developers": ["Spike", "Namco Bandai Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/5/eff35c65884f8a99403895546b251f3c-98.jpg", "descriptions": "Dragon Ball Z: Budokai Tenkaichi 3 delivers an extreme 3D fighting experience, improving upon last year's game with over 150 playable characters, enhanced fighting techniques, beautifully refined effects and shading techniques, making each character's effects more realistic, and over 20Dragon Ball Z: Budokai Tenkaichi 3 delivers an extreme 3D fighting experience, improving upon last year's game with over 150 playable characters, enhanced fighting techniques, beautifully refined effects and shading techniques, making each character's effects more realistic, and over 20 battle stages. In addition, an improved control system for the Wii will allow players to easily mimic signature moves and execute devastating energy attacks as they are performed in the Dragon Ball Z animated series. [Atari]… Expand"}, {"name": "Overwatch", "details_link": "https://www.metacritic.com/game/switch/overwatch", "publisher": "Blizzard Entertainment", "release_date": "Oct 15 2019", "developers": ["Blizzard Entertainment", "Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/0/c517c5ab3d5743656bc8a774bb1edccc-98.jpg", "descriptions": "Welcome to Overwatch. Soldiers. Scientists. Adventurers. Oddities. In a time of global crisis, an international task force of heroes banded together to restore peace to a war-torn world: Overwatch. It ended the crisis and helped to maintain peace in the decades that followed, inspiring anWelcome to Overwatch. Soldiers. Scientists. Adventurers. Oddities. In a time of global crisis, an international task force of heroes banded together to restore peace to a war-torn world: Overwatch. It ended the crisis and helped to maintain peace in the decades that followed, inspiring an era of exploration, innovation, and discovery. But after many years, Overwatch's influence waned, and it was eventually disbanded.\r Overwatch is gone but the world still needs heroes.\r Choose A Hero.\r Overwatch features a wide array of unique heroes, ranging from a time-jumping adventurer, to an armored, rocket-hammer-wielding warrior, to a transcendent robot monk. Every hero plays differently, and mastering their abilities is the key to unlocking their potential. No two heroes are the same.\r Play Your Role.\r Offense\rDefense\rTank\rSupport\r Whether you're engaging in combat on the front line, providing defensive cover with your energy shield, or supporting your allies by amplifying their damage, every hero's abilities are designed to be effective as part of a team. Learning to utilize your abilities in concert with your teammates' is the key to victory.\r Team-Based Objectives.\r Teams of heroes do battle across the planet. From protecting the secrets of the mysterious Temple of Anubis, to safely escorting an EMP device through King's Row, the world is your battlefield.… Expand"}, {"name": "Star Wars Battlefront: Renegade Squadron", "details_link": "https://www.metacritic.com/game/psp/star-wars-battlefront-renegade-squadron", "publisher": "LucasArts", "release_date": "Oct  9 2007", "developers": ["Rebellion"], "platforms": "PSP", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/1f71da8dc753af553a2f1bf96a09681d-98.jpg", "descriptions": "Star Wars Battlefront: Renegade Squadron is the previously untold story of a ragtag ensemble of battle-hardened rogues and scoundrels assembled by Han Solo. Gathered to execute some of the most secretive operations in the Rebel Alliance's war against the Galactic Empire, the RenegadeStar Wars Battlefront: Renegade Squadron is the previously untold story of a ragtag ensemble of battle-hardened rogues and scoundrels assembled by Han Solo. Gathered to execute some of the most secretive operations in the Rebel Alliance's war against the Galactic Empire, the Renegade Squadron participates in battles spanning the galaxy. From the Valley of the Sith on Korriban to a dogfight in space through the remains of Alderaan, Solo directs the team on missions of sabotage, rescue and retrieval. In Renegade Squadron, robust customization options replace the class system seen in previous Star Wars Battlefront titles, allowing for millions of possible unique combatants. With weapons, equipment and abilities that players select themselves, no two allies will likely ever look or perform exactly the same. The game also boasts expanded multiplayer options for the PSP. Up to 16 players can compete against each other over the Internet and eight via the PSP system's ad-hoc wireless connection. [LucasArts]… Expand"}, {"name": "Super Robot Taisen OG Saga: Endless Frontier", "details_link": "https://www.metacritic.com/game/ds/super-robot-taisen-og-saga-endless-frontier", "publisher": "Atlus", "release_date": "Apr 29 2009", "developers": ["Monolith Soft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 73, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/b8525f1a8894e4bffdde6f8becc8b1a6-98.jpg", "descriptions": "Super Robot Taisen OG Saga: Endless Frontier is a unique sci-fi/fantasy RPG that takes players across a variety of worlds, ranging from an apocalyptic wasteland covered with the hulks of downed spaceships to a fantastical place of fairy tales and dark magic. Join Haken Browning: gunslinger,Super Robot Taisen OG Saga: Endless Frontier is a unique sci-fi/fantasy RPG that takes players across a variety of worlds, ranging from an apocalyptic wasteland covered with the hulks of downed spaceships to a fantastical place of fairy tales and dark magic. Join Haken Browning: gunslinger, professional bounty hunter, and amateur ladies' man, along with his motley crew of robots, were-beasts, secret agents, and busty princesses as they delve deep into the mysteries of how their worlds came to be and face a threat that imperils the multiverse. [Atlus USA]… Expand"}, {"name": "Pinball Hall of Fame: The Gottlieb Collection", "details_link": "https://www.metacritic.com/game/psp/pinball-hall-of-fame-the-gottlieb-collection", "publisher": "Crave", "release_date": "Dec  6 2005", "developers": ["Farsight Studios"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/375125f687befcb13187e70cef6ceaf4-98.jpg", "descriptions": "Relive the days when the pinball table was king, but play like you have unlimited quarters. Pinball Hall of Fame resurrects seven of Gottlieb's greatest pinball machines spanning the 60 years of arcade pinball's golden age. Recreated in a stunning 3-D environment, the game play, visuals andRelive the days when the pinball table was king, but play like you have unlimited quarters. Pinball Hall of Fame resurrects seven of Gottlieb's greatest pinball machines spanning the 60 years of arcade pinball's golden age. Recreated in a stunning 3-D environment, the game play, visuals and sound effects are so authentic, you'll feel like you're in a real arcade. You can choose from such classic tables as Ace High, Central Park, Big Shot, Genie, Black Hole, Victory, and Tee'd Off from the 50s, 60s, 70s, 80s and 90s. Historical art, fun facts and an unlockable bonus table. Bonus arcade novelty games for even more old-school fun. [Crave Entertainment]… Expand"}, {"name": "Session. Skate Sim", "details_link": "https://www.metacritic.com/game/pc/session-skate-sim", "publisher": "Crea-ture Studios", "release_date": "Sep 22 2022", "developers": ["Crea-ture Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 73, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/85005b5ff651b1752a370d296d531d1e-98.jpg", "descriptions": "Creativity and freedom of expression: This, is Session. Pure, raw skateboarding. Forget about hand holding or turbo timers, just go tame that concrete."}, {"name": "Far Cry 6", "details_link": "https://www.metacritic.com/game/playstation-5/far-cry-6", "publisher": "Ubisoft", "release_date": "Oct  7 2021", "developers": ["Ubisoft Toronto"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 73, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/2927617a8a31e21db463153edd11fa05-98.jpg", "descriptions": "Far Cry 6 reveals a Caribbean island simmering with revolutionary tension. The title features actor Giancarlo Esposito (“Better Call Saul,” “The Boys,” “The Mandalorian”) as President Anton Castillo, the violent leader who grips the island of Yara with an iron fist, promising a return to itsFar Cry 6 reveals a Caribbean island simmering with revolutionary tension. The title features actor Giancarlo Esposito (“Better Call Saul,” “The Boys,” “The Mandalorian”) as President Anton Castillo, the violent leader who grips the island of Yara with an iron fist, promising a return to its former glory. With an arsenal of weapons and allies at your back, you’ll take on Castillo’s regime and fight for the future of Yara. As Dani Rojas (playable as a female or male character), you will help stoke the fires of revolution through guerrilla warfare across the island of Yara, from verdant jungles to the urban streets of the capital city, Esperanza. You’ll use a powerful array of weapons and vehicles, and build a network of allies to fight alongside you, including Fangs for Hire like Chorizo, the dangerously distracting wiener dog. As President Castillo prepares his son Diego, played by Anthony Gonzalez (“Coco”), to succeed him, you will do all you can to ensure his plans don’t come to fruition. [Ubisoft]… Expand"}, {"name": "Pure Farming 2018", "details_link": "https://www.metacritic.com/game/xbox-one/pure-farming-2018", "publisher": "Techland", "release_date": "Mar 13 2018", "developers": ["Techland"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/4832278526a01b809cc12504460d970a-98.jpg", "descriptions": "Go global and expand your farm across four continents. Use the latest technology and state-of-the-art licensed machines to manage all aspects of modern farming, from cultivating land and growing crops to breeding livestock and producing green energy. Travel between Europe, Asia, and bothGo global and expand your farm across four continents. Use the latest technology and state-of-the-art licensed machines to manage all aspects of modern farming, from cultivating land and growing crops to breeding livestock and producing green energy. Travel between Europe, Asia, and both Americas to plant region-specific crops such as hemp, coffee beans, cherries, and olives using dedicated farming vehicles. Play the way you like best: three vastly different modes means this game is meant for you, no matter if you are a simulation veteran or an enthusiastic newcomer.… Expand"}, {"name": "Old Man's Journey", "details_link": "https://www.metacritic.com/game/switch/old-mans-journey", "publisher": "Broken Rules", "release_date": "Feb 20 2018", "developers": ["Broken Rules"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/de8f15a140f1f63716968aafebcd30e8-98.jpg", "descriptions": "Old Man's Journey, a soul-searching puzzle adventure, tells a story of life, loss, reconciliation, and hope. Entrenched in a beautifully sunkissed and handcrafted world, embark on a heartfelt journey interwoven with lighthearted and pressure-free puzzle solving.\r A visual narrative about Old Man's Journey, a soul-searching puzzle adventure, tells a story of life, loss, reconciliation, and hope. Entrenched in a beautifully sunkissed and handcrafted world, embark on a heartfelt journey interwoven with lighthearted and pressure-free puzzle solving.\r A visual narrative about life's precious moments, broken dreams, and changed plans, uncover stories of the old man's life told through beautiful vignettes of his memories. Interacting with the serene and whimsical environment, solve playful puzzles by shaping the landscape, growing the hills to create the old man's path forward.\r During this compact gameplay experience, you'll be transported to a vibrant and wishful world, exploring life's complexities through the old man's eyes. Meditatively delightful and reflective, Old Man's Journey invites you to immerse yourself in quiet and inquisitive puzzles, and experience the old man's heartache, regret, and hope. … Expand"}, {"name": "SpellForce 3", "details_link": "https://www.metacritic.com/game/pc/spellforce-3", "publisher": "Nordic Games Publishing", "release_date": "Dec  7 2017", "developers": ["Grimlore Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/764c79fbd0c43bf78dbd9ef5e81d3c80-98.jpg", "descriptions": "SpellForce 3 - A blend between RTS and RPG. SpellForce 3 goes back to the roots of the SpellForce saga and combines the RTS and RPG genre in a unique way - all in real time. Explore the world of Eo and become a true legend."}, {"name": "Marvel's Guardians of the Galaxy - Episode 4: Who Needs You", "details_link": "https://www.metacritic.com/game/xbox-one/marvels-guardians-of-the-galaxy---episode-4-who-needs-you", "publisher": "Telltale Games", "release_date": "Oct 10 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-partIn the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure.… Expand"}, {"name": "Mighty Switch Force! 2", "details_link": "https://www.metacritic.com/game/3ds/mighty-switch-force!-2", "publisher": "WayForward", "release_date": "Jun 13 2013", "developers": ["WayForward"], "platforms": ["Wii U", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/e5120d7605b219f9b1d3d65c6267425f-98.jpg", "descriptions": "This time Officer Wagon and Corporal Gendarmor join Planet Lands Fire Brigade to prevent Tangent City from burning to the ground.  Players will combine their wits and reflexes to rescue the reformed Hooligan Sisters and the lost USBs (Ugly Secret Babies) hidden throughout each level.  NewThis time Officer Wagon and Corporal Gendarmor join Planet Lands Fire Brigade to prevent Tangent City from burning to the ground.  Players will combine their wits and reflexes to rescue the reformed Hooligan Sisters and the lost USBs (Ugly Secret Babies) hidden throughout each level.  New puzzle types, weapons, enemies, unlocks, and a truly epic soundtrack bring the sizzle this Spring!  Deee-lish!… Expand"}, {"name": "Assetto Corsa", "details_link": "https://www.metacritic.com/game/playstation-4/assetto-corsa", "publisher": "505 Games", "release_date": "Aug 30 2016", "developers": ["Kunos Simulazioni"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 73, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/7beffbda0a8cd9c1e70ba5ab30522515-98.jpg", "descriptions": "Assetto Corsa is designed to provide a very realistic driving experience, with single player and multiplayer options, officially licensed cars and tracks developed using Laser scan technology, and the highest level of accuracy possible in reproducing real world motor racing environments.Assetto Corsa is designed to provide a very realistic driving experience, with single player and multiplayer options, officially licensed cars and tracks developed using Laser scan technology, and the highest level of accuracy possible in reproducing real world motor racing environments. Also, Assetto Corsa allows for considerable customisation and modification, in order to satisfy the expectations of professional simracers, gamers who prefer to approach the driving experience more progressively, and hobbyists who just like to collect lots of cars and tracks.… Expand"}, {"name": "Birds of Steel", "details_link": "https://www.metacritic.com/game/playstation-3/birds-of-steel", "publisher": "Konami", "release_date": "Mar 13 2012", "developers": ["Gaijin Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/e24181108b838841ba5aa1fc5f92b822-98.jpg", "descriptions": "Get ready to strap in, go back in time and take stick in the most pivotal battles in the history of air combat. Birds of Steel puts you right in the crosshairs of WWII’s most intense skirmishes. This original IP blends next gen supremacy and the fine details of aerial combat into aGet ready to strap in, go back in time and take stick in the most pivotal battles in the history of air combat. Birds of Steel puts you right in the crosshairs of WWII’s most intense skirmishes. This original IP blends next gen supremacy and the fine details of aerial combat into a historical recreation fit for flight sim fans and history buffs alike. Use your skills to pilot the top planes from all combatants in WWII to recreate history or to change the outcomes of the most prolific battles in history. Online and offline elements add an entire new element to the game which will ensure Birds of Steel remains a fresh combat experience long after you’ve played for the first time.… Expand"}, {"name": "Call of Duty: Modern Warfare - Mobilized", "details_link": "https://www.metacritic.com/game/ds/call-of-duty-modern-warfare---mobilized", "publisher": "Activision", "release_date": "Nov 10 2009", "developers": ["n-Space"], "platforms": "DS", "num_players": "Up to 6 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/e480f21291d84e146a2a85300204c52b-98.jpg", "descriptions": "Call of Duty: Modern Warfare: Mobilized delivers an arsenal of cutting-edge weaponry, vehicles and tactics, arming players with precision controls for battle across the world's most dangerous hotspots. Gamers fight on the ground in intense building-to-building tactical combat, hack intoCall of Duty: Modern Warfare: Mobilized delivers an arsenal of cutting-edge weaponry, vehicles and tactics, arming players with precision controls for battle across the world's most dangerous hotspots. Gamers fight on the ground in intense building-to-building tactical combat, hack into enemy computer terminals, take the controls of military vehicles like Battle Tanks and UAV spy drones, or man the guns of an AC-130 gunship. Call of Duty: Modern Warfare: Mobilized brings the epic Call of Duty intensity of Modern Warfare to Nintendo DS fans through a unique storyline and companion narrative. The title also serves up a bevy of features, including a six-player online multiplayer mode that allows friends to host their own server, as well as the brand new Survival Mode, giving players a variety of weapons to hold off waves of oncoming enemy forces and an expanded six-player online multiplayer mode. Also, Arcade Mode allows gamers to replay the game’s single-player with a time limit and running score, with extra points awarded for specific achievements. [Activision]… Expand"}, {"name": "Outriders", "details_link": "https://www.metacritic.com/game/pc/outriders", "publisher": "Square Enix", "release_date": "Apr  1 2021", "developers": ["People Can Fly"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/77d247da538890dfe249041d088cb1f6-98.jpg", "descriptions": "Outriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leaveOutriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you'll create your own Outrider and embark on a journey across the hostile planet. With rich storytelling spanning a diverse world, you'll leave behind the slums and shanty towns of the First City and traverse forests, mountains and desert in the pursuit of a mysterious signal. Combining intense gunplay with violent powers and an arsenal of increasingly twisted weaponry and gear-sets, Outriders offers countless hours of gameplay from one of the finest shooter developers in the industry People Can Fly.… Expand"}, {"name": "Disney/Pixar Cars", "details_link": "https://www.metacritic.com/game/pc/disneypixar-cars", "publisher": "THQ", "release_date": "Jun  6 2006", "developers": ["Beenox"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/7cc6e2054cb1867bd234de9c77a88f58-98.jpg", "descriptions": "Race to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightening McQueen capture the coveted Piston Cup Championship. The game is a story-based racingRace to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightening McQueen capture the coveted Piston Cup Championship. The game is a story-based racing adventure game that relives all of the key moments of the movie. It features more than 10 playable characters from the film and an open world environment with more than 50 races. [THQ]… Expand"}, {"name": "Killer Instinct", "details_link": "https://www.metacritic.com/game/xbox-one/killer-instinct", "publisher": "Microsoft Game Studios", "release_date": "Nov 22 2013", "developers": ["Double Helix Games"], "platforms": ["PC", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/88b88d2eda6211ea8cf3acdd8cb79343-98.jpg", "descriptions": "The iconic fighting game franchise is back with upgraded visuals, over-the-top action, a wild cast of combatants, rocking reactive music, and C-C-C-Combo Breakers. Choose from a diverse set of characters, each with fluid animations, unique combat tactics, and flashy special attacks. UtilizeThe iconic fighting game franchise is back with upgraded visuals, over-the-top action, a wild cast of combatants, rocking reactive music, and C-C-C-Combo Breakers. Choose from a diverse set of characters, each with fluid animations, unique combat tactics, and flashy special attacks. Utilize an open-ended combo system to rack up massive combos as your opponent looks for openings to break your flow and turn the tides of battle. Go online and test yourself against players from all over the world, or bone up on your combat skills in detailed tutorials. … Expand"}, {"name": "Guitar Hero: Smash Hits", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-smash-hits", "publisher": "Activision", "release_date": "Jun 16 2009", "developers": ["Beenox"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/41e83c2e66120261dc88eadc677f0247-98.jpg", "descriptions": "Guitar Hero Smash Hits takes the most exciting, recognizable and fun to play music from genre-defining titles Guitar Hero, Guitar Hero II, Guitar Hero Encore: Rocks the 80s and Guitar Hero III: Legends of Rock, which were previously available for guitar-only in-game play, and delivers themGuitar Hero Smash Hits takes the most exciting, recognizable and fun to play music from genre-defining titles Guitar Hero, Guitar Hero II, Guitar Hero Encore: Rocks the 80s and Guitar Hero III: Legends of Rock, which were previously available for guitar-only in-game play, and delivers them as a compelling and dynamic full band experience. Featuring 48 master recordings, Guitar Hero Smash Hits delivers exciting online and offline gameplay modes including Band Career and 8-player \"Battle of the Bands,: which allows two full bands to compete head-to-head online. Players' rock n' roll fantasies turn to realities as they create their rocker, compose original music and share it with the world through the innovative Music Studio, GHTunesSM and robust Rock Star Creator gameplay modes first introduced in Guitar Hero World Tour. The tracklist includes:  Killer Queen (Queen), I Love Rock N Roll (Joan Jett and The Blackhearts), Bark At The Moon (Ozzy), Them Bones (Alice in Chains), Killing in the Name (Rage Against The Machine), Message In A Bottle (The Police), Carry On My Wayward Son (Kansas) Free Bird (Lynyrd Skynyrd), I Wanna Rock (Twisted Sister), Nothin But A Good Time (Poison), Barracuda (Heart), Through the Fire and Flames (DragonForce). [Activision]… Expand"}, {"name": "Disney Epic Mickey", "details_link": "https://www.metacritic.com/game/wii/disney-epic-mickey", "publisher": "Disney Interactive Studios", "release_date": "Nov 30 2010", "developers": ["Junction Point"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "Platformer", "3D", "3D"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/31ebfa5558aee962ebaa9bf5e44f12a2-98.jpg", "descriptions": "Deus Ex and Thief cocreator Warren Spector is developing a dark, Wii-exclusive adventure featuring Disney's rodent mascot."}, {"name": "Sherlock Holmes: Crimes & Punishments", "details_link": "https://www.metacritic.com/game/switch/sherlock-holmes-crimes-punishments", "publisher": "Frogwares", "release_date": "Feb  3 2022", "developers": ["Frogwares"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/656997734077a54bd8213aafaea64fec-98.jpg", "descriptions": "It is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of theIt is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of the detective written in the pure tradition of Conan Doyle's novels. Each case offers real freedom to players, who will have to make important moral choices instead of simply enforcing justice by the book. All decisions have an influence in the game, so bear the weight of your choices!… Expand"}, {"name": "Monster Prom: XXL", "details_link": "https://www.metacritic.com/game/switch/monster-prom-xxl", "publisher": "Those Awesome Guys", "release_date": "May 21 2020", "developers": ["Beautiful Glitch"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/29d81f6de61cbe9e87a6803b35508c78-98.jpg", "descriptions": "Be Your Worst Self\r There’s only 3 weeks left until prom and you haven’t got a date yet..and you’re a monster. But that’s okay ‘cause at your high-school everyone else is too! These are the stepping stones into the world of Monster Prom: XXL - the bundled up, content filled edition ofBe Your Worst Self\r There’s only 3 weeks left until prom and you haven’t got a date yet..and you’re a monster. But that’s okay ‘cause at your high-school everyone else is too! These are the stepping stones into the world of Monster Prom: XXL - the bundled up, content filled edition of Monster Prom, a one-to-four player competitive dating sim that will have you thinking: I never knew I was into that!\r Content Complete\rMonster Prom: XXL contains both the Second Term DLC, as well as all seasonal content released throughout the game’s lifespan. Check out brand new characters, new events, secret endings and countless other ways to explore the (after)life of a love-struck high school monster!\r Competitive dating sim\rNothing makes the heart grow fonder than a little competition. Set your gaze on one of the sweethearts, but if you share your romantic tastes with your friends, be ready for some stiff competition. … Expand"}, {"name": "SNK Gals' Fighters", "details_link": "https://www.metacritic.com/game/switch/snk-gals-fighters", "publisher": "SNK", "release_date": "Apr 29 2020", "developers": ["SNK", "Code Mystics Inc.", "SNK Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/9c98caac140fa56a1557feeb22eb6809-98.jpg", "descriptions": "Sugar and spice and everything nice, that's what little girls are made of... NOT! It's time for the ladies to show who's boss in this superb all-girls fighting fantasy! Eight fabulous femme fatales to choose from and five different game modes! Use Super Attacks and collect and trade special items!"}, {"name": "112 Operator", "details_link": "https://www.metacritic.com/game/pc/112-operator", "publisher": "Games Operators", "release_date": "Apr 23 2020", "developers": ["Jutsu Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/1a590f58eecde56ff510fa5ca725695d-98.jpg", "descriptions": "112 Operator allows you to manage emergency services in any city in the world! Dispatch units, take calls and face situations caused by weather, traffic or changing seasons. Help the city survive escalating events like riots, organized crime, terrorist attacks, cataclysms, natural disasters112 Operator allows you to manage emergency services in any city in the world! Dispatch units, take calls and face situations caused by weather, traffic or changing seasons. Help the city survive escalating events like riots, organized crime, terrorist attacks, cataclysms, natural disasters and many more!Help on a scale bigger than ever before. The sequel of the award-winning 911 Operator lets you act on many, completely different levels -- from taking care of a single neighborhood, to coordinating several operators' work in the world's biggest metropolises. Full 3D visualisation will give you the inside view of your units' actions. Choose from over 100 000 areas, such as districts, municipalities, and tens of thousands of real cities from all over the world.Face the dynamic weather, based on authentic, historical data. Watch the incidents change as day or night comes, traffic increases and seasons pass. Watch out for extreme conditions that may lead to cataclysms and natural disasters. Try to tame big wildfires spreading across the map. Weather isn't your only problem though -- be careful when dealing with terrorist attacks and gang wars.… Expand"}, {"name": "Just Dance 2016", "details_link": "https://www.metacritic.com/game/wii-u/just-dance-2016", "publisher": "Ubisoft", "release_date": "Oct 20 2015", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Wii U"], "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/108bb3c7c395df6e496e2d9adfeaa524-98.jpg", "descriptions": "All you need is your smartphone and the Just Dance Controller App to play Just Dance 2016 on Wii U, no extra accessories needed. Bust a move to “Uptown Funk” by Mark Ronson Ft. Bruno Mars and feel the beat in “All About That Bass” by Meghan Trainor - Just Dance 2016 features an amazingAll you need is your smartphone and the Just Dance Controller App to play Just Dance 2016 on Wii U, no extra accessories needed. Bust a move to “Uptown Funk” by Mark Ronson Ft. Bruno Mars and feel the beat in “All About That Bass” by Meghan Trainor - Just Dance 2016 features an amazing tracklist with visuals that are more creative than before. … Expand"}, {"name": "Chocobo's Mystery Dungeon: Every Buddy!", "details_link": "https://www.metacritic.com/game/switch/chocobos-mystery-dungeon-every-buddy!", "publisher": "Square Enix", "release_date": "Mar 20 2019", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Action RPG", "Role-Playing", "Roguelike"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/9094354e2a79cf994fc3334819883170-98.jpg", "descriptions": "A new installment of the ever-popular series is here. The classic FINAL FANTASY FABLES: Chocobo’s Dungeon is back with an enhanced gameplay system - to be enjoyed by both first-timers and fans of the series!. Explore the challenges of the never-ending dungeons (\"Insatiable Hunger\"), befriendA new installment of the ever-popular series is here. The classic FINAL FANTASY FABLES: Chocobo’s Dungeon is back with an enhanced gameplay system - to be enjoyed by both first-timers and fans of the series!. Explore the challenges of the never-ending dungeons (\"Insatiable Hunger\"), befriend monsters with the new buddy system. You adhere to one simple rule, … every time you enter, the world around you changes shape, but it only moves whenever Chocobo moves.\r… Expand"}, {"name": "Jonah Lomu Rugby Challenge", "details_link": "https://www.metacritic.com/game/xbox-360/jonah-lomu-rugby-challenge", "publisher": "Mad Catz", "release_date": "Oct 18 2011", "developers": ["Sidhe Interactive"], "platforms": ["PC", "PlayStation Vita", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Alternative", "Team", "Rugby", "Rugby"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/95045f0e22f86685b0b354a8a2193b7b-98.jpg", "descriptions": "Rugby Challenge features online play, licensed teams, and a multiyear franchise mode."}, {"name": "Yesterday Origins", "details_link": "https://www.metacritic.com/game/playstation-4/yesterday-origins", "publisher": "Microids", "release_date": "Nov 17 2016", "developers": ["Pendulo Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/65c30bfe8d596b82a848ce83f0cf3f94-98.jpg", "descriptions": "In Yesterday Origins, the main protagonists John Yesterday and his partner Pauline, immortals who own an antiques store in Paris, travel across the globe through multiple periods. The story takes place across the current and medieval eras, through a series of flashbacks. At the beginning ofIn Yesterday Origins, the main protagonists John Yesterday and his partner Pauline, immortals who own an antiques store in Paris, travel across the globe through multiple periods. The story takes place across the current and medieval eras, through a series of flashbacks. At the beginning of the game, a young John is imprisoned by the Spanish Inquisition for witchcraft, just prior to the sequence of events that will change his life/lives forever. Although not yet able to resurrect at that point of his life, he has already attracted the attention and fallen foul of Church authorities due to his unusual ability to understand and speak every language he encounters.… Expand"}]