[{"name": "BlackSite: Area 51", "details_link": "https://www.metacritic.com/game/playstation-3/blacksite-area-51", "publisher": "Midway", "release_date": "Dec 10 2007", "developers": ["Midway Studios - Austin"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 56, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/0cd652e2739ee8813b356990a0afa3fd-98.jpg", "descriptions": "Featuring a powerful single-player campaign, along with multiple online multiplayer modes,\rBlackSite: Area 51 delivers vicious combat action, next generation graphics and A.I., and a plethora of powerful weapons and vehicles.  Set in present day, players take the role of a decoratedFeaturing a powerful single-player campaign, along with multiple online multiplayer modes,\rBlackSite: Area 51 delivers vicious combat action, next generation graphics and A.I., and a plethora of powerful weapons and vehicles.  Set in present day, players take the role of a decorated military veteran charged by the government to lead a squadron of \"secret soldiers,\" each with his/her own specialty skill set, into the Rachel, Nevada area to fight off the invasion of unidentified enemy races. The player’s modern-day emotions and fears are driven into a world charged with grave responsibility affecting lives hanging in the balance and eventually finding himself torn between his professional orders and his own ethical standards.  In the end, only the actions of the player and his squad can shape the outcome of BlackSite: Area 51 during this potentially pivotal moment in history. [Midway]… Expand"}, {"name": "Deadliest Catch: Alaskan Storm", "details_link": "https://www.metacritic.com/game/xbox-360/deadliest-catch-alaskan-storm", "publisher": "Navarre Corp", "release_date": "Jun 17 2008", "developers": ["Liquid Dragon Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "8  Online", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 56, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/e9bf7e1fa6bd77f686c312823eb24b9b-98.jpg", "descriptions": "Battle 40-foot waves, storms, ice and a nearly 100-percent crewmember injury rate in the dangerous hunt for undersea riches on the Bering Sea with Deadliest Catch Alaskan Storm. The game was inspired by Sig, Edgar and Norman Hansen -- three brothers who have made their living crab fishing onBattle 40-foot waves, storms, ice and a nearly 100-percent crewmember injury rate in the dangerous hunt for undersea riches on the Bering Sea with Deadliest Catch Alaskan Storm. The game was inspired by Sig, Edgar and Norman Hansen -- three brothers who have made their living crab fishing on the Bering Sea aboard their family's fishing vessel, the Northwestern. Deadliest Catch Alaskan Storm lets gamers captain their own boat in the frenzied search for an undersea jackpot. Gamers select one of five real crab boats, including the Northwestern, Cornelia Marie and Sea Star -- all featured on the series, or create and customize their own boat. Gamers then recruit and lead their own crew from a roster of twenty real crab fishermen. Selecting the wrong boat or recruiting the wrong crew member can mean the difference between landing a Bering Sea jackpot or disaster. Lead your fatigued, hungry and hardworking crew in the strategic search for King Crab and Opilio Crab, while battling to secure your catch and livelihood before other captains and crews get to the crab first. [Greenwave Games]… Expand"}, {"name": "Warplanes: WW2 Dogfight", "details_link": "https://www.metacritic.com/game/switch/warplanes-ww2-dogfight", "publisher": "Home Net Games", "release_date": "Feb 21 2019", "developers": ["Home Net Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Civilian"], "meta_score": 56, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/ccd55060eb817d024bf71e6cd1c2f535-98.jpg", "descriptions": "In Warplanes: WW2 Dogfight players get the chance to take a seat at the controls of a historical airplane and feel the power of its engines and experience the rush of adrenaline flowing through their veins while facing an enemy plane up in the air. In each of the campaigns for Great Britain,In Warplanes: WW2 Dogfight players get the chance to take a seat at the controls of a historical airplane and feel the power of its engines and experience the rush of adrenaline flowing through their veins while facing an enemy plane up in the air. In each of the campaigns for Great Britain, USSR, and Germany, gamers will be able to test their flying skills during deadly encounters with enemy fighters: protecting ground structures from bombers, fighting over the sea to weaken enemy navy, or piloting bombers to destroy strategic targets. Players with a tactical approach will also be able to build a base – by constructing additional hangars and supporting structures and then ensuring their safety by building anti-aircraft artillery and barrage balloons. … Expand"}, {"name": "Raiders of the Broken Planet", "details_link": "https://www.metacritic.com/game/playstation-4/raiders-of-the-broken-planet", "publisher": "Mercury Steam", "release_date": "Sep 22 2017", "developers": ["Mercury Steam"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 5 ", "genres": ["Strategy", "Real-Time", "MOBA"], "meta_score": 56, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/d6dc528002efe00f167709563ff685ef-98.jpg", "descriptions": "This new game is a multiplayer 4 vs 1 asymmetrical third person shooter that features a distinctive blend of shooting, brawling and thinking man’s strategy. We think this game is a mouth-watering proposition to gamers looking for an immersive, cinematic story coupled with intense and epicThis new game is a multiplayer 4 vs 1 asymmetrical third person shooter that features a distinctive blend of shooting, brawling and thinking man’s strategy. We think this game is a mouth-watering proposition to gamers looking for an immersive, cinematic story coupled with intense and epic online action.… Expand"}, {"name": "MySims SkyHeroes", "details_link": "https://www.metacritic.com/game/xbox-360/mysims-skyheroes", "publisher": "Electronic Arts", "release_date": "Sep 28 2010", "developers": ["Behaviour Interactive"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 56, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/bae1ba5809d18a4b1f0a9b33283ba7da-98.jpg", "descriptions": "In MySims SkyHeroes, players take to the sky to lead the resistance against Morcubus and his drone army and to stop his plans to take over the skyways. Starting as an unknown pilot, players fight to become a celebrated hero as they defeat dangerous enemies in aerial combat, test theirIn MySims SkyHeroes, players take to the sky to lead the resistance against Morcubus and his drone army and to stop his plans to take over the skyways. Starting as an unknown pilot, players fight to become a celebrated hero as they defeat dangerous enemies in aerial combat, test their reflexes in fast-paced speed challenges, and take on massive enemy bosses that demand all their skills as a pilot to survive. As they progress, players build, customize and tune their aircraft to give them an edge in combat – upgrade wings for swifter maneuvers, switch out the engine for a speed boost, or change the paint job to camouflage the plane and avoid enemy fire.… Expand"}, {"name": "Theseus", "details_link": "https://www.metacritic.com/game/playstation-4/theseus", "publisher": "Forge Reply", "release_date": "Jul 26 2017", "developers": ["Forge Reply"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 56, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/f3e9ef432ac54e082bfdb360ffa70839-98.jpg", "descriptions": "Theseus is an immersive VR experience that offers a new take on the myth of the Minotaur. Enjoy a mix of exploration, story, and combat, with a strong cinematic feel. Do you have what it takes to unveil the truth that lies at the heart of the Labyrinth?"}, {"name": "Shrek the Third", "details_link": "https://www.metacritic.com/game/playstation-2/shrek-the-third", "publisher": "Activision", "release_date": "May 15 2007", "developers": ["Amaze Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 56, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/0c16be7620d9c9ef4e56ebf8de2653d7-98.jpg", "descriptions": "Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies,Save Far Far Away in this twisted fairy tale adventure. When the King falls ill, it's up to Shrek to find the true heir and save Far Far Away. Journey with Shrek, Donkey, and Puss-in-Boots on this all new twisted fairy tale adventure. Along the way, meet new friends, conquer bold enemies, and visit never before seen lands from the movie and beyond. [Activision]… Expand"}, {"name": "MeiQ: Labyrinth of Death", "details_link": "https://www.metacritic.com/game/playstation-vita/meiq-labyrinth-of-death", "publisher": "Idea Factory", "release_date": "Sep 13 2016", "developers": ["Compile Heart"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Japanese-Style"], "meta_score": 56, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/aea4e0a0790c25e280c40b65bfcafcbc-98.jpg", "descriptions": "First, the winds stopped. Then, birds vanished from the skies. Finally, the sun set...And an eternal night fell upon the world. The reason was quickly identified. It was a story told of in legends. The world had ceased hundreds of years ago as well. But there was a legendary mage who hadFirst, the winds stopped. Then, birds vanished from the skies. Finally, the sun set...And an eternal night fell upon the world. The reason was quickly identified. It was a story told of in legends. The world had ceased hundreds of years ago as well. But there was a legendary mage who had managed to restart it.… Expand"}, {"name": "Diabolical Pitch", "details_link": "https://www.metacritic.com/game/xbox-360/diabolical-pitch", "publisher": "Microsoft Game Studios", "release_date": "Apr  4 2012", "developers": ["Grasshopper Manufacture"], "platforms": "Xbox 360", "genres": ["Action", "General", "General"], "meta_score": 56, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/63a46baf1b7571a4c60d1051285a4da9-98.jpg", "descriptions": "A former pitcher now outfitted with an incredibly powerful bionic arm finds himself in a run-down, dark, and twisted amusement park. The night gets strange and intense quickly as you must use your pitching skills to survive the game of your life. Charge up your diabolical pitch to wipe outA former pitcher now outfitted with an incredibly powerful bionic arm finds himself in a run-down, dark, and twisted amusement park. The night gets strange and intense quickly as you must use your pitching skills to survive the game of your life. Charge up your diabolical pitch to wipe out all the enemies crowding towards you. Power-ups give your throwing arm insane abilities that will give you the edge against huge mobs of enemies or even the mostfearsome boss. Kinect turns your room into a playing field and your Diabolical Pitch is the main attraction. [Microsoft]… Expand"}, {"name": "Earthfall", "details_link": "https://www.metacritic.com/game/xbox-one/earthfall", "publisher": "Holospark", "release_date": "Jul 13 2018", "developers": ["Holospark"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 56, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/e193fdd3d3cb8f3bcbc40d817eaa6ccd-98.jpg", "descriptions": "Earthfall is a 4-player cooperative shooter that challenges players to survive waves of killer alien drones and their inscrutable masters. Traverse the Pacific Northwest with friends or AI teammates in a desperate guerrilla war against an invading extraterrestrial force. Pit yourself againstEarthfall is a 4-player cooperative shooter that challenges players to survive waves of killer alien drones and their inscrutable masters. Traverse the Pacific Northwest with friends or AI teammates in a desperate guerrilla war against an invading extraterrestrial force. Pit yourself against the ever-changing horde and save what’s left of humanity, utilize futuristic weaponry, upgrade deployable barricades with fire or electricity, control mounted turrets, and battle through ten levels of story-driven co-operative play. … Expand"}, {"name": "Sacred 3", "details_link": "https://www.metacritic.com/game/playstation-3/sacred-3", "publisher": "Deep Silver", "release_date": "Aug  5 2014", "developers": ["Deep Silver", "Keen Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 56, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/2/7a79aa3b26c64a94d61e5f6252c7a3ea-98.jpg", "descriptions": "Sacred 3 is an action role-playing game experience with accessible yet sophisticated gameplay."}, {"name": "Monopoly", "details_link": "https://www.metacritic.com/game/xbox-360/monopoly", "publisher": "Electronic Arts", "release_date": "Oct 20 2008", "developers": ["EA Bright Light"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 56, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/19409d374fc0f935e70c003e393c52ac-98.jpg", "descriptions": "The Monopoly video games promise a fresh take on the timeless classic with accessible gameplay for players of all ages and skill levels. The all-new digital gaming edition brings a party twist and features 4-player simultaneous play, ensuring that everyone is engaged and allowing the wholeThe Monopoly video games promise a fresh take on the timeless classic with accessible gameplay for players of all ages and skill levels. The all-new digital gaming edition brings a party twist and features 4-player simultaneous play, ensuring that everyone is engaged and allowing the whole family to get involved in the fun and play together. Faster gameplay eliminates downtime freeing up players to wheel and deal their way through some of the most recognizable cities and landmarks from around the world. Families can fill up their passports as they try to unlock new and never-before-seen game boards or challenge each other to fun interactive mini-games like breaking out of the jail cell and running away with all the loot. Play in offline single or multi-player mode and compete to own it all and win! [Electronic Arts]… Expand"}, {"name": "Sonic Riders: Zero Gravity", "details_link": "https://www.metacritic.com/game/playstation-2/sonic-riders-zero-gravity", "publisher": "Sega", "release_date": "Jan  8 2008", "developers": ["Sonic Team"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 56, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/08c523cf15c9cd0887bb245439b19e88-98.jpg", "descriptions": "The Sonic Riders series returns with a whole new form of chaotic racing by manipulating gravity itself! These gravity-altering powers can transform walls into tracks, or create a \"black hole\" that sucks you through for the ultimate speed boost, and allows for an entirely new way to gain aThe Sonic Riders series returns with a whole new form of chaotic racing by manipulating gravity itself! These gravity-altering powers can transform walls into tracks, or create a \"black hole\" that sucks you through for the ultimate speed boost, and allows for an entirely new way to gain a leg up on your competitors. From illuminated highways in a bustling metropolis to the outer reaches of space, you will race at the speed of light on 16 dynamic courses. Sixty different vehicles allow you to grind rails and pull off daring tricks on futuristic tracks, including solar loop-de-loops, height-defying vertical drops and tons of other edge-of-your-seat moves. As Sonic or one of 18 colorful characters, you will compete with up to three friends at heart-stopping speeds in three exciting multiplayer modes. With all the action, speed, and addictive gameplay that only Sonic can deliver, Sonic Riders: Zero Gravity is set for hyper-drive. [Sega]… Expand"}, {"name": "Disney/Pixar Ratatouille", "details_link": "https://www.metacritic.com/game/xbox-360/disneypixar-ratatouille", "publisher": "THQ", "release_date": "Jun 26 2007", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 56, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/a7ab89b79d0f8b13f44c9b84416ac153-98.jpg", "descriptions": "Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6 action-packed worlds filled with dangerous enemies, heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down. [THQ]… Expand"}, {"name": "World Tour Soccer 2006", "details_link": "https://www.metacritic.com/game/playstation-2/world-tour-soccer-2006", "publisher": "SCEA", "release_date": "Mar 22 2005", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 56, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/164db2a1027fac4414a002ade98e2107-98.jpg", "descriptions": "World Tour Soccer 2006 provides gamers with a familiar yet enhanced gameplay experience, complete with even more features, players, teams and stadiums. Highlighted by more than 935 international and club teams from around the globe, along with an astounding 19,000 FIFPro licensed playersWorld Tour Soccer 2006 provides gamers with a familiar yet enhanced gameplay experience, complete with even more features, players, teams and stadiums. Highlighted by more than 935 international and club teams from around the globe, along with an astounding 19,000 FIFPro licensed players from 32 different leagues, eight international tournaments and 28 unique stadiums, the global game of soccer has been recreated with exceptional detail in order to capture its enormous scope and popularity. Choose from multiple modes of play including Exhibition Match, Season, Career and Challenge Mode. The game features EyeToy functionality and the all-new Digimask technology. Utilizing the EyeToy USB camera, gamers can take snapshots of themselves and literally get into the game. Once the player has taken their self-portraits, Digimask technology converts the high-resolution images of a gamer's head into a full 3D model so that they can personally battle against the world's best. [SCEA]… Expand"}, {"name": "Carnival Games: Monkey See, Monkey Do!", "details_link": "https://www.metacritic.com/game/xbox-360/carnival-games-monkey-see-monkey-do!", "publisher": "Take-Two Interactive", "release_date": "Apr  5 2011", "developers": ["Take-Two Interactive"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 56, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/7b1f456f557cd0dd985a44c98b24a0f5-98.jpg", "descriptions": "Carnival Games: Monkey See, Monkey Do! contains 20 games and attractions designed with the Kinect in mind."}, {"name": "Jump Force", "details_link": "https://www.metacritic.com/game/playstation-4/jump-force", "publisher": "Bandai Namco Games", "release_date": "Feb 15 2019", "developers": ["Spike Chunsoft Co. Ltd.", "Spike Chunsoft"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Action", "Fighting", "3D"], "meta_score": 56, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/5684d66d507088fcdbc72073e44c1aaf-98.jpg", "descriptions": "For the first time ever, the most famous Manga heroes are thrown into a whole new battleground: our world. Uniting to fight the most dangerous threat, the Jump Force will bear the fate of the entire human kind. Celebrating the 50th Anniversary of the famous Weekly Jump Magazine, Jump ForceFor the first time ever, the most famous Manga heroes are thrown into a whole new battleground: our world. Uniting to fight the most dangerous threat, the Jump Force will bear the fate of the entire human kind. Celebrating the 50th Anniversary of the famous Weekly Jump Magazine, Jump Force is also making the most of latest technologies to bring characters to life in a never-seen-before realistic design. A unique setting, merging the Jump World and the Real World.  The Jump Force, an alliance of the most powerful Manga heroes from Dragon Ball, One Piece, Naruto and much more. Realistic graphics bring Manga characters to life like never before. [Bandai Namco]… Expand"}, {"name": "Disciples III: Renaissance", "details_link": "https://www.metacritic.com/game/pc/disciples-iii-renaissance", "publisher": "Kalypso", "release_date": "Jul 13 2010", "developers": ["Akella"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 56, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/51ea9af5534a89ed0b2de31d675b3965-98.jpg", "descriptions": "Disciples III: Renaissance is the sequel to Disciples II: Dark Prophecy, the fantasy strategy/role playing game. The player takes on the role of a Lord of one of the fantastic races of Nevendaar in their enduring struggle to establish the reign of their respective god over the world. RipeDisciples III: Renaissance is the sequel to Disciples II: Dark Prophecy, the fantasy strategy/role playing game. The player takes on the role of a Lord of one of the fantastic races of Nevendaar in their enduring struggle to establish the reign of their respective god over the world. Ripe with surprises and turn-arounds, the story of the world of Nevendaar is played against a somber backdrop and shows a unique and style that has players asking for more. The visual design follows the ominous style of the Disciples world, and now all of the game environments and individual units are in real-time 3D. Disciples III: Renaissance uses .dat's in-house Virtual Dream engine, which supports all modern 3D technologies, and initially features 3 playable races: The Empire, The Legions of the Damned, and the Noble Elves, each with unique Unit styles and city representations that allow city sieges, and end with a battle for the main fortress. [Strategy First Inc.]… Expand"}, {"name": "Spartan (2004)", "details_link": "https://www.metacritic.com/game/pc/spartan-2004", "publisher": "Graphsim Entertainment", "release_date": "May 28 2004", "developers": ["Slitherine"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 56, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/94f673121429e30d5dffe8518b726228-98.jpg", "descriptions": "Spartan is the third in a series of turn-based  empire-building strategy games that includes the best-selling Legion and Chariots of War.   Spartan focuses on one of the most influential civilisations in the history of mankind ? the ancient Greeks, and allows players to choose from 100Spartan is the third in a series of turn-based  empire-building strategy games that includes the best-selling Legion and Chariots of War.   Spartan focuses on one of the most influential civilisations in the history of mankind ? the ancient Greeks, and allows players to choose from 100 nations to lead to victory, including Sparta, renowned for its total dedication to the art of war and that produced the ultimate fighting machine of the ancient world ? the Spartan Hoplite; probably most famous for the courageous last stand of 300 Spartans at the Battle of Thermopylae in 480BC. [Just Play]… Expand"}, {"name": "Savage Skies", "details_link": "https://www.metacritic.com/game/playstation-2/savage-skies", "publisher": "Bam Entertainment", "release_date": "Mar 31 2002", "developers": ["iRock Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 56, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/f5bcecf50e0d7bc811bc92ee8be7dab6-98.jpg", "descriptions": "A wicked creature based action game set in a fantasy world where a war is being waged between three factions vying for total power. The key to gameplay is high-intensity creature combat featuring action-oriented flight and combat systems that make the player feel like they are controllingA wicked creature based action game set in a fantasy world where a war is being waged between three factions vying for total power. The key to gameplay is high-intensity creature combat featuring action-oriented flight and combat systems that make the player feel like they are controlling powerful beasts of war. Dragons, demons, unicorns, and dozens of other mythical denizens inhabit Savage Skies. The game features more than 27 unique missions, 9 in each faction's campaign, and the ability to unlock up to 24 creatures, 7 multiplayer levels, and tons of hidden gameplay modes. [BAM! Entertainment]… Expand"}, {"name": "Deadliest Warrior: Legends", "details_link": "https://www.metacritic.com/game/xbox-360/deadliest-warrior-legends", "publisher": "Spike Games", "release_date": "Jul  6 2011", "developers": ["Pipeworks Software", "Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 56, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/dd2523c796080603ceba6aae5ff51a3d-98.jpg", "descriptions": "Take control of history’s greatest warriors and face the likes of Alexander the Great, Attila the Hun, Genghis Khan, Hannibal, Hernan Cortes, Shaka Zulu, Sun Tzu, Vlad the Impaler and William Wallace. With enhanced graphics and 9 arenas, new fighting options like grapples, pushes, ring outs,Take control of history’s greatest warriors and face the likes of Alexander the Great, Attila the Hun, Genghis Khan, Hannibal, Hernan Cortes, Shaka Zulu, Sun Tzu, Vlad the Impaler and William Wallace. With enhanced graphics and 9 arenas, new fighting options like grapples, pushes, ring outs, feints, projectile targeting, and new final strikes will expand your tactical options! Also included, a new strategy game called Generals! Players take control of the Battlefield Simulator from the TV show and play 1 of the 9 legendary warrior campaigns and unlock abilities that the actual warriors used to get an edge in battle.… Expand"}, {"name": "Manchester United Soccer 2005", "details_link": "https://www.metacritic.com/game/pc/manchester-united-soccer-2005", "publisher": "Codemasters", "release_date": "Oct 28 2004", "developers": ["Codemasters"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim", "Sim"], "meta_score": 56, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/0/8556d7880f30010008c726b8ac6dba8f-98.jpg", "descriptions": "Manchester United - Soccer 2005 brings you even closer to the heart of the action and the heart of your favourite team. Play a real game of football, with fast and fluid gameplay. The Precision Trigger feature - gives you all new on pitch control and a more responsive match engine with newManchester United - Soccer 2005 brings you even closer to the heart of the action and the heart of your favourite team. Play a real game of football, with fast and fluid gameplay. The Precision Trigger feature - gives you all new on pitch control and a more responsive match engine with new match features, which means you will get an immediate response from your team-mates as you play in Domestic, European and Custom matches and tournaments. Play as over 250 Clubs in 2-8 player Multiplayer and with the most powerful player editor ever, you can re-create yourself in perfect visual detail - making this is the ultimate game for Manchester United fans. [Codemasters]… Expand"}, {"name": "MLB SlugFest 2006", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-slugfest-2006", "publisher": "Midway", "release_date": "Jun  5 2006", "developers": ["Blue Shift"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 56, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/6429176fa6418ec838dfdfda6d79f05d-98.jpg", "descriptions": "Midway's newest offering of its over-the-top baseball game, MLB SlugFest 2006 features a new create-a-player mode, updated team rosters and stadiums, along with a new library of signature animations and extreme collisions that have distinguished the franchise since its debut in 2002. [Midway]"}, {"name": "Naruto Shippuden: Shinobi Rumble", "details_link": "https://www.metacritic.com/game/ds/naruto-shippuden-shinobi-rumble", "publisher": "Takara Tomy", "release_date": "Feb  8 2011", "developers": ["Eighting", "Takara Tomy"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Fighting", "2D"], "meta_score": 0, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/236c660e1c612b50ae6ab94597c05251-98.jpg", "descriptions": "Naruto Shippuden: Shinobi Rumble has the Naruto superstars clash in this handheld fighting game."}, {"name": "Velvet Assassin", "details_link": "https://www.metacritic.com/game/xbox-360/velvet-assassin", "publisher": "SouthPeak Games", "release_date": "Apr 30 2009", "developers": ["Replay Studios", "ML Enterprises"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 56, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/9210df163da7b562b38abd97e1b89d0e-98.jpg", "descriptions": "Velvet Assassin is a stealth-action game set in World War II and is inspired by real-life British secret agent Violette Szabo. Players assume the role of Violette Summer and head deep behind enemy lines with no support or official backing from the British Government. Violette risks her lifeVelvet Assassin is a stealth-action game set in World War II and is inspired by real-life British secret agent Violette Szabo. Players assume the role of Violette Summer and head deep behind enemy lines with no support or official backing from the British Government. Violette risks her life fighting to defeat the German war machine one stealth mission at a time. Velvet Assassin combines lush, surreal visuals and a ground-breaking stealth combat system to deliver a gaming experience which is truly the first of its kind. [Gamecock Media]… Expand"}, {"name": "WWE Crush Hour", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-crush-hour", "publisher": "THQ", "release_date": "Mar 17 2003", "developers": ["Pacific Coast Power & Light"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Demolition Derby"], "meta_score": 56, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/80799c210efd689a5425893699846f4f-98.jpg", "descriptions": "WWE Crush Hour takes the intensity, competitiveness and brute strength from the squared circle and drops it into the world of car combat. More than twenty WWE Superstars jump into their Super Cars bringing the pain to the streets. Layeth the rubber down in the Rock's speedster, cruise andWWE Crush Hour takes the intensity, competitiveness and brute strength from the squared circle and drops it into the world of car combat. More than twenty WWE Superstars jump into their Super Cars bringing the pain to the streets. Layeth the rubber down in the Rock's speedster, cruise and bruise in the Hardy Boys' souped up Woody or pummel the competition in the Big Show's diesel. Experience brutal vehicular carnage with top WWE Superstars in their first ever car combat experience. More than 20 personalized WWE Superstar vehicles including exotic sports cars, 4x4's and semis. Compete in multiple match types, including ladder and hardcore matches modified for insane car combat. Engage in battle across 12 destructible levels littered with deadly traps and hazards. Annihilate opponents with multiple weapon types customized for each vehicle or grab weapon power pick ups to really put the hurtin' on your opponent. On-the-fly commentary from the WWE's own Jim Ross. [THQ]… Expand"}, {"name": "NASCAR 08", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-08", "publisher": "EA Sports", "release_date": "Jul 23 2007", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 56, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/1922dffc448ad6401ca1400ff134b5b0-98.jpg", "descriptions": "Take the wheel and drive your way to the NASCAR Nextel Cup Series championship. As the new rookie driver on the circuit, develop your racing skills to gain licenses and contracts from hungry owners and unlock legendary top performing cars from NASCAR's biggest stars. Gain new experiencesTake the wheel and drive your way to the NASCAR Nextel Cup Series championship. As the new rookie driver on the circuit, develop your racing skills to gain licenses and contracts from hungry owners and unlock legendary top performing cars from NASCAR's biggest stars. Gain new experiences during every race then modify your car's handling with over 40 tuning options to truly master every track. Share your setups with NASCAR's gaming community, then challenge the field in live races with up to 16 players online. Experience tomorrow's racing today in NASCAR 08. [Electronic Arts]… Expand"}, {"name": "Fullmetal Alchemist and the Broken Angel", "details_link": "https://www.metacritic.com/game/playstation-2/fullmetal-alchemist-and-the-broken-angel", "publisher": "Square Enix", "release_date": "Jan 18 2005", "developers": ["Racjin"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 56, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/5e9c29b872bb4f2dc760c77948af3b87-98.jpg", "descriptions": "Fullmetal Alchemist is the story of two brothers, trained in the ways of alchemy, who find themselves on the adventure of their lives as they seek the mysterious Philosopher?s Stone. The story begins as Edward and Alphonse Elric hop a train to the capital city of Central. But an impromptuFullmetal Alchemist is the story of two brothers, trained in the ways of alchemy, who find themselves on the adventure of their lives as they seek the mysterious Philosopher?s Stone. The story begins as Edward and Alphonse Elric hop a train to the capital city of Central. But an impromptu hijacking forces them into an all-out brawl against a rebel military faction. Fortunately, Edward has more than a few tricks up his sleeve with a variety of alchemy skills; he can transmute everyday objects into powerful weapons. After the hijackers are defeated, a shocking new twist is revealed, sending the brothers? path askew and leading them to their wildest quest yet. [Square Enix]… Expand"}, {"name": "We Cheer", "details_link": "https://www.metacritic.com/game/wii/we-cheer", "publisher": "Namco Bandai Games America", "release_date": "Sep 30 2008", "developers": ["Machatin", "Inc."], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 56, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/16a79cd03066453a18a1d073c504f7de-98.jpg", "descriptions": "Delivering the fun, excitement and teamwork of championship cheerleading, We Cheer utilizes full-motion based controls to let players dance to the music of 30 licensed songs. Putting players at the center of a nationwide cheerleading competition, We Cheer utilizes two Wii Remotes as virtualDelivering the fun, excitement and teamwork of championship cheerleading, We Cheer utilizes full-motion based controls to let players dance to the music of 30 licensed songs. Putting players at the center of a nationwide cheerleading competition, We Cheer utilizes two Wii Remotes as virtual pom-poms to create an authentic cheerleading experience. Players must move the wireless Wii Remotes as directed by the on-screen indicators to choreographed routines, utilizing a full range of arm and body movements such as spins and twists. As each routine is successfully performed, the player recruits new team members to their squad, adding new cheerleading abilities and choreographed routines. The first cheerleading video game to offer licensed music, We Cheer features 30 smash-hit master recordings for players to perform to, including tracks from Hilary Duff, Aly & AJ, The Plain White T’s and Natasha Bedingfield. Letting friends and family participate in the cheerleading fun, We Cheer features cooperative and competitive multiplayer modes for up to four players to determine who deserves to stand at the top of the pyramid. The game also features a workout mode that lets players keep track of approximately how many calories they have burned while cheering. Each character in the game is fully customizable, with a variety of uniforms, shoes and accessories to choose from for added personalization. [Namco Bandai Games]… Expand"}, {"name": "Surgeon Simulator: Anniversary Edition", "details_link": "https://www.metacritic.com/game/playstation-4/surgeon-simulator-anniversary-edition", "publisher": "Bossa Studios", "release_date": "Aug 12 2014", "developers": ["Bossa Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4"], "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 56, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/0ab42f475ccca166eb2e91ca65ba79b6-98.jpg", "descriptions": "Surgeon Simulator 2013 is a darkly humorous over-the-top operation sim game where players become Nigel Burke, a would-be surgeon taking life into his own shaky hands, performing life-saving surgical maneuvers on passive patients."}, {"name": "Rayman Raving Rabbids", "details_link": "https://www.metacritic.com/game/ds/rayman-raving-rabbids", "publisher": "Ubisoft", "release_date": "Mar  6 2007", "developers": ["Ubisoft Bulgaria"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Platformer", "Platformer", "Party / Minigame", "3D", "2D", "3D"], "meta_score": 56, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/0295c5865a32e1d0ac9cc5d8241ad181-98.jpg", "descriptions": "Rayman Raving Rabbids marks the return of the iconic video-game hero Rayman in his funniest and zaniest adventure ever. Gamers take control of Rayman as he fights the Rabbid invasion to restore peace to the world in two brand new action adventures for GBA and DS. Each handheld consoleRayman Raving Rabbids marks the return of the iconic video-game hero Rayman in his funniest and zaniest adventure ever. Gamers take control of Rayman as he fights the Rabbid invasion to restore peace to the world in two brand new action adventures for GBA and DS. Each handheld console version boasts an original story exclusive to the platform. In the GBA game the player must help Rayman search for magical costumes that will grant him the powers to fight the Rabbids. In the DS game the player controls Rayman and his powerful otherworld avatars, the Guardians, and together they will battle the mischievous Rabbids. [Ubisoft]… Expand"}, {"name": "The Technomancer", "details_link": "https://www.metacritic.com/game/pc/the-technomancer", "publisher": "Focus Home Interactive", "release_date": "Jun 28 2016", "developers": ["Spidersoft", "Spiders"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 56, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/825360ddbff4bf5a5f3d5f86b68ece6a-98.jpg", "descriptions": "Spiders are back with The Technomancer, a new post-apocalyptic RPG set in a cyberpunk world for PlayStation 4, Xbox One and PC set on Mars during the War of Water, where an aspiring Technomancer faces a myriad of questions as his future grows threatened by the secrets of his past."}, {"name": "Werewolf: The Apocalypse - Earthblood", "details_link": "https://www.metacritic.com/game/pc/werewolf-the-apocalypse---earthblood", "publisher": "Bigben Interactive", "release_date": "Feb  4 2021", "developers": ["Cyanide"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 56, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/4b8319dfa7cbc0c714f21ee1b2f47422-98.jpg", "descriptions": "You are Cahal, a powerful Garou who chose to go into exile after losing control of his destructive rage. He can transform into a wolf and a Crinos, a huge ferocious beast. Master your three forms and their powers to punish those who defile Gaia."}, {"name": "House Flipper", "details_link": "https://www.metacritic.com/game/switch/house-flipper", "publisher": "Merge Games", "release_date": "Jun 12 2020", "developers": ["Empyrean"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 56, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/825b3fd14397c7e10d6caff4b994ebd5-98.jpg", "descriptions": "House Flipper is a unique chance to become a one-man renovation crew. Buy, repair and remodel devastated houses. Give them a second life and sell them at a profit!\r What you’ve got at your disposal is a set of tools and parts. Use them to hammer, drill, nail and screw things together, andHouse Flipper is a unique chance to become a one-man renovation crew. Buy, repair and remodel devastated houses. Give them a second life and sell them at a profit!\r What you’ve got at your disposal is a set of tools and parts. Use them to hammer, drill, nail and screw things together, and do whatever is necessary to fit, fix or clean up stuff.\r Experiment with interior designs and decorating styles you like. Decorate and furnish interiors with hundreds of unique items that you’re free to choose from. Express yourself!\r Do you love interior design and want to fill up empty rooms using your favorite style? You can buy an empty apartment and furnish it. Do you prefer things only engineers would understand? You can focus on repair and installations. Are you an expert on the \"small move, big change\" approach? You can buy a decent house and make it perfect by adding some style and fixing stuff.… Expand"}, {"name": "Earthlock: Festival of Magic", "details_link": "https://www.metacritic.com/game/playstation-4/earthlock-festival-of-magic", "publisher": "Snow Castle Games", "release_date": "Jan 27 2017", "developers": ["Snow Castle Games"], "platforms": ["PC", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 56, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/73d6cfc993efa7e853aac1b2d60a8afd-98.jpg", "descriptions": "Desert scavenger Amon soon finds himself in his life's adventure when he crosses paths with a most peculiar creature back home in Zaber. Join Amon and other heroes in this turn-based fantasy RPG, on a journey across the world of Umbra; a mysterious, beautiful but harsh planet that stoppedDesert scavenger Amon soon finds himself in his life's adventure when he crosses paths with a most peculiar creature back home in Zaber. Join Amon and other heroes in this turn-based fantasy RPG, on a journey across the world of Umbra; a mysterious, beautiful but harsh planet that stopped spinning thousands of cycles ago. With a unique set of customizable characters, all with their own personalities and journeys of self-discovery, you will scavenge, explore and fight your way from the everlasting day-side and into the darkness of perpetual night. To save Umbra you must unlock its secrets, expose the shadows, and defeat a growing evil. [Snowcastle]… Expand"}, {"name": "Q*bert: Rebooted: The XBOX One @!#?@! Edition", "details_link": "https://www.metacritic.com/game/xbox-one/qbert-rebooted-the-xbox-one-!!-edition", "publisher": "LOOT Entertainment", "release_date": "Feb 12 2016", "developers": ["GPC Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Action", "Arcade"], "meta_score": 56, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/d59468253d56051ec0de9d4760fab1e3-98.jpg", "descriptions": "Q*bert Rebooted takes the arcade classic and catapults it into the 21st century 3D game play that takes full advantage of today's technologies yet remains faithful to the original Q*bert. Featuring hexagonal blocks instead of squares, Q*bert Rebooted introduces new enemies, playableQ*bert Rebooted takes the arcade classic and catapults it into the 21st century 3D game play that takes full advantage of today's technologies yet remains faithful to the original Q*bert. Featuring hexagonal blocks instead of squares, Q*bert Rebooted introduces new enemies, playable characters, power-ups, traps, gem collecting, multiple characters, downloadable content and new ways to play. Features:\r-Level Select  replay all previously unlocked levels and track progress against friends\r-New Playable Characters  introducing Q*zard, Q*bertha, Q*bot, Q*zilla, Q*tee, Q*knight and Q*nicorn, all based on the original Q*bert form\r-3 New Enemies  the classic cast of adversaries are joined by new enemies Homer, Uppercut and Treasure Chest.… Expand"}, {"name": "Table Mini Golf", "details_link": "https://www.metacritic.com/game/playstation-vita/table-mini-golf", "publisher": "SCEA", "release_date": "Apr  9 2013", "developers": ["Four Door Lemon"], "platforms": "PlayStation Vita", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 56, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/cf08849a28b004806f1e3ae9ad1bf28a-98.jpg", "descriptions": null}, {"name": "Da New Guys: Day of the Jackass", "details_link": "https://www.metacritic.com/game/pc/da-new-guys-day-of-the-jackass", "publisher": "Wadjet Eye Games", "release_date": "Feb 29 2012", "developers": ["Wadjet Eye Games", "ICEBOX Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 56, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/555fe37790b059ef7d1b61a1fc1f93c3-98.jpg", "descriptions": "A nostalgic throwback to comedy games like The Secret of Monkey Island with the feel and pacing of a Saturday morning cartoon, Da New Guys: Day of the Jackass is a point-and-click adventure with humorous dialogue, clever puzzles, and a quirky art style. Under somewhat sketchy circumstances,A nostalgic throwback to comedy games like The Secret of Monkey Island with the feel and pacing of a Saturday morning cartoon, Da New Guys: Day of the Jackass is a point-and-click adventure with humorous dialogue, clever puzzles, and a quirky art style. Under somewhat sketchy circumstances, Brain -- a member of Da New Guys wrestling trio and the worst brawler in Wrestle Zone history -- has won the title belt. (Not even his teammates Simon and Defender can believe it!) When an angry mob shows up to protest, Brain and the precious belt end up kidnapped. Now it's up to wrestling's most eclectic team to get their buddy back and defend his unlikely title -- not to mention Da New Guys' Wrestle Zone reputation.… Expand"}, {"name": "3D Classics: Xevious", "details_link": "https://www.metacritic.com/game/3ds/3d-classics-xevious", "publisher": "Nintendo", "release_date": "Jul 21 2011", "developers": ["Arika"], "platforms": ["PlayStation 4", "Switch", "Xbox 360", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 56, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/e57308c97f42acccda392a1dd07857a5-98.jpg", "descriptions": "Xevious is an NES game remastered for the Nintendo 3DS."}, {"name": "Jewel Master: Egypt", "details_link": "https://www.metacritic.com/game/ds/jewel-master-egypt", "publisher": "Storm City Games", "release_date": "Nov  3 2009", "developers": ["Cerasus Media", "Storm City Games"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/46f34bcfedfa8a38d9788c8eff8bc99c-98.jpg", "descriptions": "Welcome to the country of the Pyramids and the Sphinx, the cradle of civilization! Match three sources of wood, gold, and more to create Egypt."}, {"name": "Iron Warriors: T-72 Tank Command", "details_link": "https://www.metacritic.com/game/pc/iron-warriors-t-72-tank-command", "publisher": "Black Bean Games", "release_date": "May 24 2006", "platforms": "PC", "genres": ["Simulation", "Tank", "Vehicle", "Combat"], "meta_score": 56, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/2cb74944a058bbdfddbff3cabcc7f3ca-98.jpg", "descriptions": "This epic combat simulator allows the player to command an entire platoon of tanks and ALL associated support units, or assume the role of ANY member in a complete tank crew. The realism of both the physics and 3D engine creates game environments where real life armored tactics become theThis epic combat simulator allows the player to command an entire platoon of tanks and ALL associated support units, or assume the role of ANY member in a complete tank crew. The realism of both the physics and 3D engine creates game environments where real life armored tactics become the only way to survive on the today's modern battlefield. Three of Russia's most devastating and powerful tanks ever produced are yours to control; the T-34-85, T-55A and T-72B. Roll these mechanized monsters through 18 campaigns, 2 training missions, 5 single player missions, and 3 multiplayer (LAN) missions. Master your tank and crew and you will soon take command of other units that round out your mechanized platoon. Cooperative multi-player support allows gamers to team up as a tank crew and play different positions within the same tank. Roll into battle on some of the most realistic terrain maps ever modeled; real weather; destructable terrain and detailed models. [Strategy First]… Expand"}, {"name": "Combat Elite: WWII Paratroopers", "details_link": "https://www.metacritic.com/game/xbox/combat-elite-wwii-paratroopers", "publisher": "SouthPeak Games", "release_date": "Nov 21 2005", "developers": ["BattleBorne"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Historic"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/02a87727c32d592c15644fb5e323853a-98.jpg", "descriptions": "Supported by an army of more than 17,000 US and British paratroopers, you must stop the Nazis from occupying Europe during WWII. Fight with authentic weapons and vehicles alongside brave Allied troops through rolling hills, small farms, and war-torn cities throughout France, Holland, andSupported by an army of more than 17,000 US and British paratroopers, you must stop the Nazis from occupying Europe during WWII. Fight with authentic weapons and vehicles alongside brave Allied troops through rolling hills, small farms, and war-torn cities throughout France, Holland, and Belgium. More than 40 varied missions re-create the toughest battles of WWII, including D-Day, Operation Market Garden, and the Battle of the Bulge. If you can survive the brutal battlefield of WWII, you'll earn promotions that allow you to customize your soldier with new skills and abilities.… Expand"}, {"name": "TV Superstars", "details_link": "https://www.metacritic.com/game/playstation-3/tv-superstars", "publisher": "SCEA", "release_date": "Oct 12 2010", "developers": ["SCE Studio Cambridge"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 56, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/c433a13eeeebd26b9ff52cf7bec38762-98.jpg", "descriptions": "Cook, Model, and boogie your way past 15 minutes of fame and into celebrity stardom! Use the PlayStation Eye camera’s unique face-capture technology to place you, friends and family into the starring roles of five action-packed TV shows. Then use your PlayStation Move motion controller toCook, Model, and boogie your way past 15 minutes of fame and into celebrity stardom! Use the PlayStation Eye camera’s unique face-capture technology to place you, friends and family into the starring roles of five action-packed TV shows. Then use your PlayStation Move motion controller to physically compete and rise to the top of the “A list” to become a household name. Battle it out on the red carpet, pose for paparazzi photographs, and sign autographs to become the Star you’ve always wanted to be!… Expand"}, {"name": "Port Royale 3: Pirates and Merchants", "details_link": "https://www.metacritic.com/game/xbox-360/port-royale-3-pirates-and-merchants", "publisher": "Kalypso", "release_date": "Oct  9 2012", "developers": ["Kalypso", "Gaming Minds Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 56, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/f1d9ef154a7621f21521dc76b716e72d-98.jpg", "descriptions": "In Port Royale 3, players will embark upon an epic adventure through the Caribbean during the turbulent 17th century where the naval powers of Spain, England, France and the Netherlands all fight for supremacy in the colonies. Players take on the role of a young captain trying to build hisIn Port Royale 3, players will embark upon an epic adventure through the Caribbean during the turbulent 17th century where the naval powers of Spain, England, France and the Netherlands all fight for supremacy in the colonies. Players take on the role of a young captain trying to build his fortune and reputation in the new world colonies. The campaign consists of two different paths for the young protagonist to follow: adventurer and trader.\r Following the path of the adventurer will lead the player on a naval conquest where they must gain notoriety through raids, piracy, bounty hunting, plundering and conquering cities as they strive to build their new Caribbean empire.… Expand"}, {"name": "Unbound Saga", "details_link": "https://www.metacritic.com/game/psp/unbound-saga", "publisher": "SCEA", "release_date": "Jul 16 2009", "developers": ["Vogster"], "platforms": ["Xbox 360", "PSP"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 56, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/774b2d01bca14d2e9394bf6268478c5c-98.jpg", "descriptions": "[Playstation Network]  Unbound Saga is a 3D side-scrolling brawler set in a satirical comic book universe, where enemies are drawn onto the screen and madcap battles travel from panel to panel through a twisted, post-apocalyptic landscape – break off a weapon and RAGE OFF THE PAGE! [SCEA]"}, {"name": "Teenage Mutant Ninja Turtles 3: Mutant Nightmare", "details_link": "https://www.metacritic.com/game/xbox/teenage-mutant-ninja-turtles-3-mutant-nightmare", "publisher": "Konami", "release_date": "Nov  1 2005", "developers": ["Konami"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/7eaa0b4256958baec81bdbfe5206d5a9-98.jpg", "descriptions": "TMNT3 puts more of a focus on teamwork, character development and control than any other console Turtles game to date. Gamers can play as their favorite Turtle alone or with up to three friends, earning experience points along the way as they slash and bash Foot Ninjas and powerful,TMNT3 puts more of a focus on teamwork, character development and control than any other console Turtles game to date. Gamers can play as their favorite Turtle alone or with up to three friends, earning experience points along the way as they slash and bash Foot Ninjas and powerful, well-known bosses from the TMNT universe. These experience points allow players to improve and evolve their Turtles' traits and abilities for more varied, powerful attacks and moves. The Ninja Scroll System is another new feature on TMMT3. Being able to select which ninja scrolls to use allows the Turtles to use various special abilities strategically. Cooperative play lies at the heart of TMNT3 and gamers who team up with friends for multiplayer action are rewarded with exclusive features such as Cooperative Attack for even more shell shocking damage to enemies. The effect of this attack changes depending on the number of players working together (between 2-4 players). For even greater control, TMNT3 features a new combat system called the Target Attack system that lets gamers play more instinctively and strategically. With the Target Attack system, players will be able to lock onto specific enemies and block, dodge or counter attack accordingly for smoother and more maneuverable combat. Story Mode can be played with 1-4 players. Even when you have less than 4 players to play, the other Turtles will be at your side, controlled through AI. All the Turtles can participate in Cooperative Attack to beat enemies and players can give commands to the AI.… Expand"}, {"name": "Coded Arms: Contagion", "details_link": "https://www.metacritic.com/game/psp/coded-arms-contagion", "publisher": "Konami", "release_date": "Sep 18 2007", "developers": ["Creat Studios"], "platforms": "PSP", "num_players": "8  Online", "genres": ["Action", "Adventure", "Shooter", "3D", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 56, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/bbfff1956bcea8e0759ab74a7a9db297-98.jpg", "descriptions": "Coded Arms: Contagion thrusts players into a new cybernetic crisis where they must use their hacking abilities and an arsenal of high-powered weaponry to survive. As a lone security agent players will return to A.I.D.A., a virtual reality military training program, to preventCoded Arms: Contagion thrusts players into a new cybernetic crisis where they must use their hacking abilities and an arsenal of high-powered weaponry to survive. As a lone security agent players will return to A.I.D.A., a virtual reality military training program, to prevent cyber-terrorists from taking control of the program and gaining access to classified military information. The hackers believe that AIDA shouldn't be restricted for only government use. The agent must use his abilities and combat skills to disinfect AIDA from the hacker-introduced virus so he can escape the system. Across a variety of enclosed and open-air levels, players will take on original enemies with an all-new selection of firearms and explosives that lets them counter the terrorist menace with more firepower than ever before. Up to eight players can go head-to-head in the game's new online multiplayer modes. [Konami]… Expand"}, {"name": "Neverwinter Nights: Enhanced Edition", "details_link": "https://www.metacritic.com/game/switch/neverwinter-nights-enhanced-edition", "publisher": "Skybound Games", "release_date": "Dec  3 2019", "developers": ["Beamdog"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 56, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/2/7930c1c0e28e10516831a6975e7d587f-98.jpg", "descriptions": "Neverwinter Nights: Enhanced Edition adds all-new enhanced features to the playable content of Neverwinter Nights Diamond Edition.Slink through the shadows as a deadly half-elven rogue, wield fearsome magics as a powerful gnomish sorcerer, vanquish your foes as an armor-clad dwarvenNeverwinter Nights: Enhanced Edition adds all-new enhanced features to the playable content of Neverwinter Nights Diamond Edition.Slink through the shadows as a deadly half-elven rogue, wield fearsome magics as a powerful gnomish sorcerer, vanquish your foes as an armor-clad dwarven paladin... whatever hero you create, incredible adventures await.Discover magic, wonder, and danger at every turn on your own or with friends in these classic Dungeons & Dragons adventures.Enhanced Features:- Mobile Play: A new virtual joystick and context sensitive button makes gameplay easy- Improved Display: Featuring a new re-engineered UI for tablet and phone play. Portrait, combat bar, inventory, and other UI elements adjust in size based on device resolution, and can be scaled to your liking.- Advanced Graphics Options: Pixel shaders and post-processing effects make for crisper, cleaner visuals. Enable contrast, vibrance, and depth of field options as preferred.- Community Endorsed: Original developers have teamed with key members of the Neverwinter Nights community to curate important fan-requested improvements to support players, storytellers, and modders. - Backwards Compatibility: Works with save games, modules, and mods from the original Neverwinter Nights. A galaxy of community created content awaits.- Cross-Platform Multiplayer: Experience vast persistent worlds and game online with friends playing on mobile or desktop.All the playable content of Neverwinter Nights Diamond Edition:- The original Neverwinter Nights campaign: Find yourself at the center of intrigue, betrayal, and dark magic in Neverwinter Nights. Journey through dangerous cities, monster filled dungeons and deep into uncharted wilderness in search of the cure for a cursed plague ravaging the city of Neverwinter. Two expansion packs: - Shadows of Undrentide: Another adventure begins in Shadows of Undrentide! Charged by your master to recover four ancient artifacts, travel from the Silver Marches to unravel mysteries of a long-dead magical civilization. - Hordes of the Underdark: Continue the adventure started in Shadows of Undrentide and journey into the ever-more bizarre and hostile depths of Undermountain to challenge a gathering evil.… Expand"}, {"name": "The Adventures of Tintin: The Game", "details_link": "https://www.metacritic.com/game/3ds/the-adventures-of-tintin-the-game", "publisher": "Ubisoft", "release_date": "Dec  6 2011", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "3DS"], "genres": ["Adventure", "General", "General"], "meta_score": 56, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/d571bdf909ece809b84ff8a81b8233b4-98.jpg", "descriptions": "Players will experience non-stop action and adventure as they investigate the mystery of a lifetime that may lead them to one of the greatest sunken treasures. But the quest won’t be easy and players will need to join forces with the quick-witted dog Snowy and the grumpy Captain Haddock toPlayers will experience non-stop action and adventure as they investigate the mystery of a lifetime that may lead them to one of the greatest sunken treasures. But the quest won’t be easy and players will need to join forces with the quick-witted dog Snowy and the grumpy Captain Haddock to beat greedy art collectors, kooky arms dealers, and other crooks to reveal the truth behind the Secret of the Unicorn ship.… Expand"}, {"name": "Safecracker: The Ultimate Puzzle Adventure", "details_link": "https://www.metacritic.com/game/wii/safecracker-the-ultimate-puzzle-adventure", "publisher": "The Adventure Company", "release_date": "Dec  3 2008", "developers": ["Kheops Studio"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Puzzle", "Puzzle", "General", "Puzzle", "Point-and-Click", "General"], "meta_score": 56, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/f08176320749cb349f99a745e4dd37d4-98.jpg", "descriptions": "As an expert safecracker, you are hired by the wealthy family of a recently deceased billionaire to search for the last will and testament of their late relative, Duncan W. Adams. An avid safe collector and an \"eccentric\" to say the least, Adams has hidden the deed to his riches in one ofAs an expert safecracker, you are hired by the wealthy family of a recently deceased billionaire to search for the last will and testament of their late relative, Duncan W. Adams. An avid safe collector and an \"eccentric\" to say the least, Adams has hidden the deed to his riches in one of the 35 safes scattered in his extravagant mansion. Players need to use expert puzzle-solving skills to crack all 35 safes, which become increasingly difficult, to reach the final master safe and locate the hidden will. [The Adventure Company]… Expand"}, {"name": "Besieger", "details_link": "https://www.metacritic.com/game/pc/besieger", "publisher": "DreamCatcher Interactive", "release_date": "Jun  2 2004", "developers": ["Primal Software"], "platforms": "PC", "num_players": "1-10 ", "genres": ["Strategy", "Real-Time", "Fantasy", "Fantasy"], "meta_score": 56, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/763b61c4f1a47f0b2f67d50b8c4bea9f-98.jpg", "descriptions": "Besieger introduces a world filled with feudal rivalry in which players can wage war as either Viking or Cimmerian warriors. Build flying vehicles for combat or siege towns on horseback in an effort to conquer factions such as Ogres, Werewolves, Centaurs, and other non-human races. TheBesieger introduces a world filled with feudal rivalry in which players can wage war as either Viking or Cimmerian warriors. Build flying vehicles for combat or siege towns on horseback in an effort to conquer factions such as Ogres, Werewolves, Centaurs, and other non-human races. The armored walls of a citadel can be shattered using a battering ram and competitors can pocket enemy buildings and equipment. Players can also retreat and accumulate forces behind their own armored citadel for a counterattack. Progressive economics allow players to spend resources constructing 40 types of buildings and honing over 50 different units for battle. Workers are created without cost to the player but must be trained for fighting and other special skills. This experience and fighting efficiency carry over as levels are defeated. [DreamCatcher Interactive]… Expand"}, {"name": "Scooby-Doo! Mystery Mayhem", "details_link": "https://www.metacritic.com/game/xbox/scooby-doo!-mystery-mayhem", "publisher": "THQ", "release_date": "Mar  2 2004", "developers": ["Artificial Mind and Movement"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 56, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/a6ebd94c7da61c1f9532f12d1ff03ce6-98.jpg", "descriptions": "Scooby and the Gang are back in an all-new adventure.  Join your favorite slackers as they try to solve a mystery of supernatural proportions.  The gang starts out on a routine case in the search of ghosts.  During their search, a scheming business tycoon, who will stop at nothing to growScooby and the Gang are back in an all-new adventure.  Join your favorite slackers as they try to solve a mystery of supernatural proportions.  The gang starts out on a routine case in the search of ghosts.  During their search, a scheming business tycoon, who will stop at nothing to grow his empire, uses the Tome of Doom to unlock some of the creepiest monsters our gang has every seen.  Help Scooby and Shaggy find the Tome of Doom, capture monsters, and solve the mystery.  Would you help Scooby and Shaggy solve this mystery for a Scooby Snack?… Expand"}, {"name": "Spawn: Armageddon", "details_link": "https://www.metacritic.com/game/playstation-2/spawn-armageddon", "publisher": "Namco", "release_date": "Nov 21 2003", "developers": ["Point of View"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 56, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/c5170268a675a3fd99c57188061bfc9d-98.jpg", "descriptions": "Spawn: Armageddon, based on Todd McFarlane's creation, is a 3-D action/adventure that will give players access to all of his distinctive abilities - his superhuman strength, hand-to-hand combat techniques, his arsenal of weaponry, his Hell Powers and, of course, his living symbiotic costume.Spawn: Armageddon, based on Todd McFarlane's creation, is a 3-D action/adventure that will give players access to all of his distinctive abilities - his superhuman strength, hand-to-hand combat techniques, his arsenal of weaponry, his Hell Powers and, of course, his living symbiotic costume. Caught between the battle of Good vs. Evil, he struggles to break free from the controlling influences of Heaven and Hell. [Namco]… Expand"}, {"name": "Deadly Dozen", "details_link": "https://www.metacritic.com/game/pc/deadly-dozen", "publisher": "Atari", "release_date": "Oct 31 2001", "developers": ["Nfusion"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 56, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/0b56438f84e852b2502d8f851508d21f-98.jpg", "descriptions": "Infiltrate German occupied territory with your squad of military misfits. Destroy, steal and kidnap your way out. Sweaty palms and sniper rifles span six war torn countries.  [Infogrames]"}, {"name": "Blair Witch Volume II: The Legend of Coffin Rock", "details_link": "https://www.metacritic.com/game/pc/blair-witch-volume-ii-the-legend-of-coffin-rock", "publisher": "Gathering", "release_date": "Oct 30 2000", "developers": ["Human Head Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 56, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/ad6c2774f9c783bb07e4a0803e5e8d9f-98.jpg", "descriptions": "The game beautifully blends eerie adventure and exploration with action-based survival horror and puzzle-solving elements. In 1886, a mysterious character with an unknown past awakens in Burkittsville, MD, just as several baffling events begin to befall the town's inhabitants. [Gathering ofThe game beautifully blends eerie adventure and exploration with action-based survival horror and puzzle-solving elements. In 1886, a mysterious character with an unknown past awakens in Burkittsville, MD, just as several baffling events begin to befall the town's inhabitants. [Gathering of Developers]… Expand"}, {"name": "Deadliest Warrior: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/deadliest-warrior-the-game", "publisher": "Pipeworks Software, Inc.", "release_date": "Jul 14 2010", "developers": ["Pipeworks Software", "Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 56, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/a0bdcd939dd24c59cf5dca65c3fdac61-98.jpg", "descriptions": "[Xbox Live Arcade]  Deadliest Warrior The Game allows you to choose from history's greatest warriors, equip them with signature weaponry, and go head to head against the greatest fighters that ever lived. Deadliest Warrior features five play modes, customizable warriors, and true-to-life[Xbox Live Arcade]  Deadliest Warrior The Game allows you to choose from history's greatest warriors, equip them with signature weaponry, and go head to head against the greatest fighters that ever lived. Deadliest Warrior features five play modes, customizable warriors, and true-to-life action with interactive environments. This is a unique fighting game that is easy to play and hard to master. Sever limbs, decapitate heads, and taunt your enemy's lifeless corpse to build up ranking points and compete on a global scale to become The Deadliest Warrior.… Expand"}, {"name": "MySims Party", "details_link": "https://www.metacritic.com/game/wii/mysims-party", "publisher": "EA Games", "release_date": "Mar 10 2009", "developers": ["EA Games"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/07f0c1e4b296f15556a0e3797064d353-98.jpg", "descriptions": "MySims Party turns any gathering into an instant party with 50 mini games to choose from, each hosted by a different MySim. You and your friends have the chance to Stick the Trick in the extreme snowboarding mini game, outrun a robot in Robo Assault or shake your groove thing with DJ CandyMySims Party turns any gathering into an instant party with 50 mini games to choose from, each hosted by a different MySim. You and your friends have the chance to Stick the Trick in the extreme snowboarding mini game, outrun a robot in Robo Assault or shake your groove thing with DJ Candy during the Go Go Dancing challenge. Each MySim character brings a unique combination of skill to the mission, with differing levels of endurance, speed and luck giving you the option to choose the best MySim for the task. You can play mini games one right after the other, or you and your friends can compete in a themed festival such as food, music or sports that offers multiple mini games. [Electronic Arts]… Expand"}, {"name": "Dynasty Warriors DS: Fighter's Battle", "details_link": "https://www.metacritic.com/game/ds/dynasty-warriors-ds-fighters-battle", "publisher": "Koei", "release_date": "Jul 25 2007", "developers": ["Koei", "Studio Fake"], "platforms": "DS", "num_players": "1-3 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 56, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/3e08c55f5b2b131612f97087bca50cc0-98.jpg", "descriptions": "It's time to team up with the legendary Dynasty Warriors and save Ancient China. With your awesome Musou attack you have the power to stop the hordes of enemy soldiers ready to strike. Unite all of China and victory will be yours. Play as one of 3 new fighters, and team up with some of yourIt's time to team up with the legendary Dynasty Warriors and save Ancient China. With your awesome Musou attack you have the power to stop the hordes of enemy soldiers ready to strike. Unite all of China and victory will be yours. Play as one of 3 new fighters, and team up with some of your favorite Dynasty Warriors to conquer China. Collect cards, build your Battle Deck, and find the most powerful combination. 120 cards in all. Build your deck in single player mode and use it in wireless multiplayer battles. Distract your opponents with the new Obstacle Roulette system. 12 unique stages set in Ancient China! Watch out for traps- even fight on the deck of a rocking ship. Wireless Vs. mode for up to 3 players. Game controls and visual design created expressly for Nintendo DS. [Koei]… Expand"}, {"name": "Scooby-Doo!  Who's Watching Who?", "details_link": "https://www.metacritic.com/game/ds/scooby-doo!-whos-watching-who", "publisher": "THQ", "release_date": "Oct 16 2006", "developers": ["Human Soft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "3D", "Third-Person"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/329792306becfc5d7e414cd4723f690a-98.jpg", "descriptions": "Yet another of Scooby's handheld misadventures from THQ."}, {"name": "Warriors Orochi 2", "details_link": "https://www.metacritic.com/game/psp/warriors-orochi-2", "publisher": "Koei", "release_date": "Aug 28 2009", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 56, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/df1adf0929945e45c3d376085aa8bc91-98.jpg", "descriptions": "Shattering time and space, the venomous Serpent King Orochi kidnapped the Dynasty Warriors and Samurai Warriors in scheme to test his might. The heroes eventually defeated Orochi and his menacing army. While the slain Orochi lies in the netherworld, a mysterious alliance is hatching anShattering time and space, the venomous Serpent King Orochi kidnapped the Dynasty Warriors and Samurai Warriors in scheme to test his might. The heroes eventually defeated Orochi and his menacing army. While the slain Orochi lies in the netherworld, a mysterious alliance is hatching an otherworldly plan so that the Serpent King may rise again. Now a new group of warriors must join forces with history's finest in an effort to stop this evil resurrection. Warriors Orochi 2 takes place after the events of the original game. The game's main \"Story\" mode features storylines for the kingdoms of Wu, Wei, and Shu, and the Samurai Warriors, while a new Orochi storyline looks back to the first series of wars to expose some of the Serpent King's secrets. The game's newly added \"Dream\" mode features an original storyline different from that of Story Mode. A new two-player \"Versus\" mode comes action-packed with four different games including \"Tag Team\" matches that pit individual fighters in lethal head-to-head combat. The popular \"Team Battle System\" which lets players create their own three-person fighting unit returns for this sequel. At any given time, one warrior will be engaged in battle, while the other two are recuperating; restoring their Life Meters and Musou Gauges. Warriors Orochi 2 features an overwhelming lineup of over 90 playable characters from both franchises including Samurai Warriors 2 Extreme Legends, plus new characters from Chinese and Japanese history. [Koei]… Expand"}, {"name": "SpongeBob SquarePants: Creature from the Krusty Krab", "details_link": "https://www.metacritic.com/game/ds/spongebob-squarepants-creature-from-the-krusty-krab", "publisher": "THQ", "release_date": "Oct 18 2006", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 56, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/b327a3c151d9d060257a3cf76152e41c-98.jpg", "descriptions": "Bikini Bottom will never be the same. SpongeBob SquarePants: Creature from the Krusty Krab brings the #1 kids gaming franchise and TV property into the bizarre and unusual, introducing never-before-seen art styles and brand new gameplay mechanics that will change your perception of BikiniBikini Bottom will never be the same. SpongeBob SquarePants: Creature from the Krusty Krab brings the #1 kids gaming franchise and TV property into the bizarre and unusual, introducing never-before-seen art styles and brand new gameplay mechanics that will change your perception of Bikini Bottom forever. Embark on a series of fantastic tales through nine visually unique levels. Experience five brand new gameplay mechanics including rampaging, flying, skydiving, chase and hot rod racing. Rampage through Bikini Bottom as gigantic Plankton. Fly through the savage jaw of the enormous bull worm as SpongeBob. Blast off into outer space and survive a hi-speed asteroid field as Patrick. Plunge into the pages of a comic book as Starfishman and become the hero of the seven seas. Speed through the metallic flames, chrome and smoke-filled world of Hot Rod racing. [THQ]… Expand"}, {"name": "Rooms: The Main Building", "details_link": "https://www.metacritic.com/game/ds/rooms-the-main-building", "publisher": "Hudson Entertainment", "release_date": "Mar 23 2010", "developers": ["HandMade Game"], "platforms": ["iPhone/iPad", "PC", "DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7dc19bfda3cf49cb4ac5123c5117b666-98.jpg", "descriptions": "Your adventure begins when an invitation abruptly arrives at your doorstep and diverts you to an entrance of a world filled with mystic beauty. Getting there is the easy part, coming home will be the adventure. In this new world, you’ll need to reach the exit of each of the 100+ rooms byYour adventure begins when an invitation abruptly arrives at your doorstep and diverts you to an entrance of a world filled with mystic beauty. Getting there is the easy part, coming home will be the adventure. In this new world, you’ll need to reach the exit of each of the 100+ rooms by sliding pieces of the rooms along a 2-D plane, forcing you to use all of your ingenuity to escape. Your character can move from room to room as long as there’s a path that isn’t blocked by a wall or obstacle. As you continue the adventure, you’ll encounter several tools that will introduce new elements. Use teleporters, wardrobes, hydrants, and other objects to navigate your way through. Blending the simple gameplay elements of classic brain-teasers with a mystical adventure and an art style all its own, Rooms: The Main Building delivers a mystery filled adventure that will leave you stunned. [Hudson Entertainment]… Expand"}, {"name": "Medal of Honor: Vanguard", "details_link": "https://www.metacritic.com/game/wii/medal-of-honor-vanguard", "publisher": "Electronic Arts", "release_date": "Mar 26 2007", "developers": ["BudCat"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 56, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/519a959cb712258e2e9b6d5297d4d677-98.jpg", "descriptions": "Step into the boots of Frank Keegan, Corporal of the 82nd Airborne Division and engage in battles throughout Europe. From Operation Husky on the shores of Sicily to Operation Varsity inside Nazi Germany, you'll fight behind enemy lines in the epic WWII battles that turned America's firstStep into the boots of Frank Keegan, Corporal of the 82nd Airborne Division and engage in battles throughout Europe. From Operation Husky on the shores of Sicily to Operation Varsity inside Nazi Germany, you'll fight behind enemy lines in the epic WWII battles that turned America's first paratroopers into heroes of WWII. Featuring spectacular graphics adding to epic combat intensity, Medal of Honor Vanguard makes you the driving force in the struggle to liberate Europe.  As the first game in the Medal of Honor series to be released on the Nintendo Wii platform, players can expect Medal of Honor Vanguard to take full advantage of Wii’s one-of-a-kind controllers. [Electronic Arts]… Expand"}, {"name": "The Chronicles of Narnia: Prince Caspian", "details_link": "https://www.metacritic.com/game/playstation-3/the-chronicles-of-narnia-prince-caspian", "publisher": "Disney Interactive Studios", "release_date": "May 15 2008", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "General"], "meta_score": 56, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/698ed3fd08ab86671ffd2fbcfed31c64-98.jpg", "descriptions": "The Chronicles of Narnia: Prince Caspian takes players throughout Narnia and includes a level, which is unique from both the novel and the film. The level, which is set between the events of \"The Lion, The Witch and The Wardrobe\" and Prince Caspian, takes place at the castle of Cair ParavelThe Chronicles of Narnia: Prince Caspian takes players throughout Narnia and includes a level, which is unique from both the novel and the film. The level, which is set between the events of \"The Lion, The Witch and The Wardrobe\" and Prince Caspian, takes place at the castle of Cair Paravel and tells the story of how Narnia fell to the Telmarine hordes. In Prince Caspian, Cair Paravel is seen only as abandoned ruins the Pevensies discover hundreds of years later. The action/adventure game offers gameplay for one or two players on the same system and drop-in/drop-out features, allowing either player to join the game and leave. With combat, exploration and puzzle solving that extends beyond the film, The Chronicles of Narnia: Prince Caspian is the ideal complement to the movie-going experience. The game features more than 20 playable characters including the ability to play as Prince Caspian. [Disney Interactive]… Expand"}, {"name": "New Tales from the Borderlands", "details_link": "https://www.metacritic.com/game/playstation-5/new-tales-from-the-borderlands", "publisher": "2K Games", "release_date": "Oct 21 2022", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 56, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/079a2e6b0ba33fab501969934c6395fe-98.jpg", "descriptions": "Take a stand against ruthless corporate overlords in this narrative-driven adventure! Within the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives. Help these three lovable losers as they endeavor to change the world (andTake a stand against ruthless corporate overlords in this narrative-driven adventure! Within the perpetually war-torn metropolis of Promethea, you'll control Anu, Octavio, and Fran on the worst day of their lives. Help these three lovable losers as they endeavor to change the world (and maybe even save it)! Face down a planetary invasion, vicious vault monster, and cold-hearted capitalist in this cinematic thrill ride where what happens next is up to you! Meet a motley cast full of misfits, assassin bots, and talking guns in this race to the top! It's time to fight back against exploitation and corporate greed. It's time to make Mayhem your business. … Expand"}, {"name": "Roving Rogue", "details_link": "https://www.metacritic.com/game/wii-u/roving-rogue", "publisher": "Padaone Games", "release_date": "Jul  2 2015", "developers": ["Padaone Games"], "platforms": "Wii U", "genres": ["Action", "Platformer", "2D"], "meta_score": 56, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/2641cff32a16f7733f45c257a9dd3632-98.jpg", "descriptions": "Jumping against the clock, you must fight tank knights, Goblin archers, obsessed ghosts, demented wizards and other evil forces to get out of the crumbling castle and find your way back to… err… to wherever you came from."}, {"name": "Dragon Age: Origins - Witch Hunt", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-age-origins---witch-hunt", "publisher": "Electronic Arts", "release_date": "Sep  7 2010", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 56, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/d68e0ebb019e0b4f392435d3746b3581-98.jpg", "descriptions": "The dreaded Archdemon has been slain and the advance of the darkspawn halted by a lone, heroic Grey Warden. The kingdom rejoices, but at least one question remains: what happened to Morrigan? The sorceress joined the Wardens cause, but it is said her true purpose was not revealed until theThe dreaded Archdemon has been slain and the advance of the darkspawn halted by a lone, heroic Grey Warden. The kingdom rejoices, but at least one question remains: what happened to Morrigan? The sorceress joined the Wardens cause, but it is said her true purpose was not revealed until the eve of the last battle. She vanished into the shadows, and while rumors claimed she crossed over the mountains into Orlais no trace of her path could be found. She was never heard from again... until now. Nearly a year has passed since the Archdemon's death, and word has reached the Wardens that Morrigan has returned to Ferelden. She has been sighted in the southern wilderness where she was first encountered. Is it truly her? If it is, then why has is she here and what secret does she carry with her? The Warden heads into the forest to find out and tie up this last loose end once and for all.… Expand"}, {"name": "Gotcha Force", "details_link": "https://www.metacritic.com/game/gamecube/gotcha-force", "publisher": "Capcom", "release_date": "Dec  3 2003", "developers": ["Capcom"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 56, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/4d6cdd2da9d677a12042096140e4e07c-98.jpg", "descriptions": "The lid to the toy box has blown off its hinges and the toys are ready to rumble. It's toy versus toy in this over-the-top 3D action shooter. You can create your own fighting force with over 100 unique characters. Up to four players can battle for control in four-player battle mode or twoThe lid to the toy box has blown off its hinges and the toys are ready to rumble. It's toy versus toy in this over-the-top 3D action shooter. You can create your own fighting force with over 100 unique characters. Up to four players can battle for control in four-player battle mode or two against two. Play against your friends or work together to defeat your evil foes. For more characters, you can trade with your teammate to assemble a powerful unit and roll on to victory.… Expand"}, {"name": "DreamWorks Shrek SuperSlam", "details_link": "https://www.metacritic.com/game/ds/dreamworks-shrek-superslam", "publisher": "Activision", "release_date": "Oct 25 2005", "developers": ["Amaze Entertainment"], "platforms": ["PC", "DS"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "Fighting", "2D", "3D"], "meta_score": 56, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/be8b770734eefd07d91bb901ab7ee7ef-98.jpg", "descriptions": "Slam, smash, beat and brawl your friends in Shrek SuperSlam - the most twisted fighting game ever. Play as 20 characters from the Shrek universe, including Shrek, Donkey, Puss in Boots, and the villainous Prince Charming. SuperSlam your opponents through windows and walls in 16 fullySlam, smash, beat and brawl your friends in Shrek SuperSlam - the most twisted fighting game ever. Play as 20 characters from the Shrek universe, including Shrek, Donkey, Puss in Boots, and the villainous Prince Charming. SuperSlam your opponents through windows and walls in 16 fully destructible environments. Run for cover when characters unleash their signature fighting moves, like Shrek’s disgusting Green Storm (better plug your nose!) and Puss in Boots’ irresistible Cute Attack. And weapons like the Big Fairy Bazooka and the Hammer of Smiting give you endless ways to blast your opponents into oblivion. Up to four players. [Activision]… Expand"}, {"name": "LOL: Never Party Alone!", "details_link": "https://www.metacritic.com/game/ds/lol-never-party-alone!", "publisher": "Agetec", "release_date": "May 30 2008", "developers": ["Route24"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 56, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/2/67c5aca4ab920716ff94c3538b5dbf36-98.jpg", "descriptions": "(Also known as \"Bakushow\" in the UK/EU)  A unique, free-form gaming experience, LOL’s motto says it best: “If the game is boring, then you are boring.” LOL is played by one of the players making a challenge in writing to the others. The crazier the challenge, the more fun everyone will have.(Also known as \"Bakushow\" in the UK/EU)  A unique, free-form gaming experience, LOL’s motto says it best: “If the game is boring, then you are boring.” LOL is played by one of the players making a challenge in writing to the others. The crazier the challenge, the more fun everyone will have. The person who delivered the challenge chooses an appropriate time limit, and everyone has to answer the challenge on their touch screen however they see fit – with words, pictures, or whatever comes to mind. The host reveals the answers, and everyone votes on a winner who will then decide on the challenge for the next round. Always different and a blast to play every time, LOL will, as its name implies, make everyone laugh out loud. [Agetec]… Expand"}, {"name": "Lethal VR", "details_link": "https://www.metacritic.com/game/playstation-4/lethal-vr", "publisher": "Team17", "release_date": "Dec 20 2016", "developers": ["Team17", "Three Fields Entertainment"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 56, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/3460ab14c0c1ab0deb0ad67cac382c60-98.jpg", "descriptions": "Lethal VR is an immersive Virtual Reality weapons experience for the PlayStation VR brought to you from Three Fields Entertainment, creators of Burnout, BLACK and Dangerous Golf. Step into the shoes of an FBI Recruit and be tested in a series of weapons simulation exercises, featuring aLethal VR is an immersive Virtual Reality weapons experience for the PlayStation VR brought to you from Three Fields Entertainment, creators of Burnout, BLACK and Dangerous Golf. Step into the shoes of an FBI Recruit and be tested in a series of weapons simulation exercises, featuring a variety of small weapons. After each challenge you will be graded on your performance. Do you have what it takes to earn a Lethal rating? Your abilities will be tested in 30 different challenges spread across 5 tiers of weapons simulation. You will need to demonstrate speed, precision, deadly accuracy and the ability to remain calm under pressure.… Expand"}, {"name": "Thor: God of Thunder", "details_link": "https://www.metacritic.com/game/wii/thor-god-of-thunder", "publisher": "Sega", "release_date": "May  3 2011", "developers": ["Red Fly Studio"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 56, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/43511ec730205bcc10408250a8c8b47e-98.jpg", "descriptions": "Thor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of NorseThor: The Video Game will take players through a spectacular, epic-scale original third-person adventure for which Matt Fraction, the Eisner Award-winning writer and lead Thor comic book author served as story consultant. In the game, Thor battles through the numerous worlds of Norse mythology that span realms ranging from primal worlds of fire and ice to extraordinary planets inhabited by Frost Giants and Trolls to save Asgard, the capital city of the Norse Gods. Thor must overcome monstrous foes lifted from the pages of the comics including Ulik, Ymir, and Surtur, as well as other monstrous denizens. Players will wield the iconic Mjolnir, Thor’s legendary hammer, to fight enemies on an immense scale while controlling the elemental storm powers of lightning, thunder, and wind to vanquish enemies. As Thor earns Valor points through his exploits, players can acquire new abilities, powers, and weapon upgrades.… Expand"}, {"name": "High School Musical: Sing It!", "details_link": "https://www.metacritic.com/game/playstation-2/high-school-musical-sing-it!", "publisher": "Disney Interactive Studios", "release_date": "Oct 30 2007", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/57d00f7b4ae86512503f4849027e4e4e-98.jpg", "descriptions": "Allowing fans to interact with the movie's characters for the first time on any gaming console, High School Musical: Sing It! extends the \"High School Musical\" experience by offering players the chance to immerse themselves in the world of the hit movie. Fans show off their creativity andAllowing fans to interact with the movie's characters for the first time on any gaming console, High School Musical: Sing It! extends the \"High School Musical\" experience by offering players the chance to immerse themselves in the world of the hit movie. Fans show off their creativity and skills by mixing together their favorite characters, songs and scenes as they sing their way to stardom. Featuring motion-captured-choreography from the original movie's dance routines, the games provide hours of fun for the entire family as they get to interact with some of their favorite movie stars. Featuring three play modes, Story, Party and Quickplay, fans choose their character with either their favorite cast member (Troy, Gabriella, Sharpay, Ryan, Chad or Taylor). In Story Mode, players live the movie through song and dance, performing \"High School Musical\" and \"High School Musical 2\" songs, from \"Start of Something New\" to \"We're All in this Together,\" solo or as a duet. In Party Mode, friends compete against each other. Players can also choose their favorite backdrop and belt out hit songs from other popular tunes sung by familiar Disney Channel stars. In Quickplay mode, players can jump into any song and pick from any characters, outfits, and environments they've unlocked. For the fans a little shy about singing, or waiting their turn, pick up the Wii remote and the Nunchuk, and move them to the beat to accompany the singers with percussion instruments like a snare drum, tambourine, cowbell and more. [Disney Interactive]… Expand"}, {"name": "Dance Factory", "details_link": "https://www.metacritic.com/game/playstation-2/dance-factory", "publisher": "Codemasters", "release_date": "Aug 29 2006", "developers": ["Broadsword Interactive"], "platforms": "PlayStation 2", "num_players": "1-16 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 56, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/7a74692a885a45e13e17fd1bfe63b478-98.jpg", "descriptions": "Get ready to groove it to any tune you want because the global dance video game phenomena is about to undergo a revolution. Any music CD, any track – the ultimate dance game that generates dance movies from your own music CDs. Dance Factory's unique feature: the game can take any track fromGet ready to groove it to any tune you want because the global dance video game phenomena is about to undergo a revolution. Any music CD, any track – the ultimate dance game that generates dance movies from your own music CDs. Dance Factory's unique feature: the game can take any track from any music CD in your entire collection, play it and automatically generate incredible dance routines, played out on-screen for you to groove to on the mat. Superseding previous dance mat games that have had pre-set play lists limited to the licensed tracks on the game disc, Dance Factory offers infinite variety. With Dance Factory, there is no limit to the tunes you can dance to, since any and every CD in your personal collection can be used with the game to create a series of dance steps. You choose the tunes, Dance Factory creates the moves and the party is what you make it – be it Hip Hop, Rock, Disco, whatever. [Codemasters]… Expand"}, {"name": "Gyruss", "details_link": "https://www.metacritic.com/game/xbox-360/gyruss", "publisher": "Konami", "release_date": "Apr 18 2007", "developers": ["Digital Eclipse"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/93fc1d5f9ba9e3da652ad6801fc183e5-98.jpg", "descriptions": "[Xbox Live Arcade]  Pilot a lone starship and fight through an armada of alien ships to save Earth in Gyruss, the classic 3D space shooter. Battle your way from Neptune past Uranus, Saturn, Jupiter, and Mars earning power-ups and score bonuses along the way. Experience all 23 levels of this[Xbox Live Arcade]  Pilot a lone starship and fight through an armada of alien ships to save Earth in Gyruss, the classic 3D space shooter. Battle your way from Neptune past Uranus, Saturn, Jupiter, and Mars earning power-ups and score bonuses along the way. Experience all 23 levels of this arcade classics as you battle your way to Planet Earth. Play the classic arcade two player mode, taking turns on your Xbox 360, or take your game online with Xbox Live with both versus and co-op game modes. Play Gyruss in all its classic arcade glory, or play the enhanced Xbox 360 version, with digitally enhanced sounds effects, fully rendered 3D models, a new cosmic starfield background, and special explosion effects. You can even earn 12 new achievements for your successful defense of Earth. [Microsoft]… Expand"}, {"name": "The Council - Episode 5: Checkmate", "details_link": "https://www.metacritic.com/game/pc/the-council---episode-5-checkmate", "publisher": "Focus Home Interactive", "release_date": "Dec  4 2018", "developers": ["Big Bad Wolf"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 56, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/60f95dfc9658e36b642785c1757939b9-98.jpg", "descriptions": "Checkmate is the fifth and final episode of The Council’s inaugural season. The Complete Season of The Council grants access to all 5 episodes.\r As his assumptions about reality come crashing down around him, Louis de Richet must take the final steps on deciding his path – and the fate ofCheckmate is the fifth and final episode of The Council’s inaugural season. The Complete Season of The Council grants access to all 5 episodes.\r As his assumptions about reality come crashing down around him, Louis de Richet must take the final steps on deciding his path – and the fate of the world. Democracies, monarchies, and the future of nations hang in the balance.\r This finale brings all your decisions, mistakes, and victories to the fore as Louis’ alliances, enemies, and family all come together for a climatic confrontation. Who will win, and can the De Richets survive the island in the end? \r\rFinish the adventure in The Council Episode 5: Checkmate as kings fall, pawns rise, and the choice, as always, is yours.… Expand"}, {"name": "Pokemon Shuffle", "details_link": "https://www.metacritic.com/game/3ds/pokemon-shuffle", "publisher": "Nintendo", "release_date": "Feb 18 2015", "developers": ["Genius Sonority Inc."], "platforms": ["iPhone/iPad", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 56, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/4947138281dbb9ad51b2c912d2bbdb3c-98.jpg", "descriptions": "In Pokémon Shuffle, your goal is to clear a series of stages by lining up the same Pokémon and clearing these matches from the puzzle area. Within each puzzle stage, you can deal damage to the wild Pokémon you face by lining up three of the same Pokémon to clear them. Battle and try to catchIn Pokémon Shuffle, your goal is to clear a series of stages by lining up the same Pokémon and clearing these matches from the puzzle area. Within each puzzle stage, you can deal damage to the wild Pokémon you face by lining up three of the same Pokémon to clear them. Battle and try to catch the Pokémon before you run out of moves. [Nintendo.com]… Expand"}, {"name": "Jambo! Safari: Animal Rescue", "details_link": "https://www.metacritic.com/game/wii/jambo!-safari-animal-rescue", "publisher": "Sega", "release_date": "Nov 17 2009", "developers": ["Full Fat"], "platforms": "Wii", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 56, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/9b10c165a43fbc466bb92858dce23395-98.jpg", "descriptions": "(Also known as \"Jambo! Safari: Ranger Adventure\" in the UK/EU)  Become a Safari Park Ranger in a wild action packed African adventure. Embark on an exotic, action packed journey across your African Safari Park and complete missions to become a fully qualified ranger. Take on challenges in a(Also known as \"Jambo! Safari: Ranger Adventure\" in the UK/EU)  Become a Safari Park Ranger in a wild action packed African adventure. Embark on an exotic, action packed journey across your African Safari Park and complete missions to become a fully qualified ranger. Take on challenges in a variety of Land Rover vehicles to rescue wild animals with your lasso and bring them back to The Ranch.  Nurse your animals back to full health in the enclosure before releasing them back to the wild. Packed with realistic environments to explore, exciting challenges, customisation, photography and collectables, Jambo! Safari is a wild new adventure on Nintendo DS and Wii. [Sega]… Expand"}, {"name": "Perception", "details_link": "https://www.metacritic.com/game/playstation-4/perception", "publisher": "The Deep End Games", "release_date": "Jun  6 2017", "developers": ["The Deep End Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 56, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/4ac01b3e225971bd9c120a53171897c2-98.jpg", "descriptions": "A first person narrative horror adventure that puts players in the shoes of a young blind woman who must use her extraordinary hearing and razor-sharp wits to solve mysteries and escape a deadly presence."}, {"name": "Dangerous Golf", "details_link": "https://www.metacritic.com/game/playstation-4/dangerous-golf", "publisher": "Three Fields Entertainment", "release_date": "Jun  3 2016", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 56, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/bdb8844f3a89c7bb0582786d65a97533-98.jpg", "descriptions": "In Dangerous Golf, you’re not striving for Par or aiming for a Birdie — you’re playing for points awarded for causing damage. It’s about smashing the place up and then banging the ball into the hole by pulling off an outrageous trick shot. Break enough stuff and you can power up the ball,In Dangerous Golf, you’re not striving for Par or aiming for a Birdie — you’re playing for points awarded for causing damage. It’s about smashing the place up and then banging the ball into the hole by pulling off an outrageous trick shot. Break enough stuff and you can power up the ball, turn it into a fireball, and steer it around for a limited time to try and smash more stuff. [Playstation.com]… Expand"}, {"name": "Far Cry 4: Escape from Durgesh Prison", "details_link": "https://www.metacritic.com/game/playstation-4/far-cry-4-escape-from-durgesh-prison", "publisher": "Ubisoft", "release_date": "Jan 13 2015", "developers": ["Ubisoft Montreal"], "platforms": ["Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 56, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/0a011496f426618ed4ac59641ac87124-98.jpg", "descriptions": "With terrain spanning from lush forests to the snow-capped Himalayas, the entire world is alive…and deadly. Hidden in the towering Himalayas lies Kyrat, a country steeped in tradition and violence. You and a fellow captive have been rounded up and tortured in Yuma’s prison. Escape from theWith terrain spanning from lush forests to the snow-capped Himalayas, the entire world is alive…and deadly. Hidden in the towering Himalayas lies Kyrat, a country steeped in tradition and violence. You and a fellow captive have been rounded up and tortured in Yuma’s prison. Escape from the prison and survive the hostile lands of Pagan Min’s Kyrat.… Expand"}, {"name": "Infinity Runner", "details_link": "https://www.metacritic.com/game/pc/infinity-runner", "publisher": "Wales Interactive", "release_date": "Jul 14 2014", "developers": ["Wales Interactive"], "platforms": ["PlayStation 4", "Wii U", "Xbox One", "PC"], "genres": ["Action", "General", "Platformer", "Arcade", "3D"], "meta_score": 56, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/b5d59a1e326ab07cf8d8b633e1bbaaac-98.jpg", "descriptions": "The Infinity is the grandest spaceship ever built by mankind; launched into the void of space to secure humanity a new home amongst the stars. However, instead of discovering paradise, the inhabitants of The Infinity unlocked the door to a long forgotten nightmare."}, {"name": "Army Men: Sarge's War", "details_link": "https://www.metacritic.com/game/gamecube/army-men-sarges-war", "publisher": "Global Star Software", "release_date": "Aug 21 2004", "developers": ["3DO"], "platforms": ["PC", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 56, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/a55f5e7797090f44728809803fc8021e-98.jpg", "descriptions": "A new enemy, Colonel Malice, threatens the very existence of the Green nation. Now, with his squad destroyed, Sarge becomes a one-man army out to stop Colonel Malice and the Tan army at all costs. Guide Sarge through 12 dangerous levels, which span both the real world and the world of toys.A new enemy, Colonel Malice, threatens the very existence of the Green nation. Now, with his squad destroyed, Sarge becomes a one-man army out to stop Colonel Malice and the Tan army at all costs. Guide Sarge through 12 dangerous levels, which span both the real world and the world of toys. Sarge can wield authentic weapons such as assault rifles, shotguns, bazookas, time bombs, and more. Be careful--enemies can now duck, cover, flank your positions, and generally try to kill you as intensely as you try to kill them.… Expand"}, {"name": "Disney Sports: Motocross", "details_link": "https://www.metacritic.com/game/game-boy-advance/disney-sports-motocross", "publisher": "Konami", "release_date": "Mar 31 2003", "developers": ["Konami"], "platforms": "Game Boy Advance", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/f3119f74faaa4de62a6f1753853c005b-98.jpg", "descriptions": null}, {"name": "Street Hoops", "details_link": "https://www.metacritic.com/game/gamecube/street-hoops", "publisher": "Activision", "release_date": "Nov 28 2002", "developers": ["Black Ops Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 56, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/59e4861d52024eac607ce23caac43c4c-98.jpg", "descriptions": "Street Hoops brings the aggressive energy and stylish attitude of street basketball into your living room. Set up your own team, and then compete in nationwide street court tournaments. As your team runs through the ranks, you unlock players such as AO, Main Event, 1/2 Man 1/2 Amazing,Street Hoops brings the aggressive energy and stylish attitude of street basketball into your living room. Set up your own team, and then compete in nationwide street court tournaments. As your team runs through the ranks, you unlock players such as AO, Main Event, 1/2 Man 1/2 Amazing, Headache, and Hot Sauce from the most recent And 1 Mix Tapes; plus Speedy Williams, Booger Smith, and The Future from the Nike freestyle commercial. You can spend your hard-earned winnings on new shoes, warm-ups, tattoos, jewelry, and other gear.… Expand"}, {"name": "Tang Tang", "details_link": "https://www.metacritic.com/game/game-boy-advance/tang-tang", "publisher": "Take-Two Interactive", "release_date": "Aug 28 2001", "developers": ["GameVision"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/8f24d2406e0280621a82bbb397ccb366-98.jpg", "descriptions": "The Associated Nexus of Galaxies (TANG) has been threatened by hordes of invaders bent on pillaging the natural resource of Energy Crystals. As a last hope, the TANG calls upon four super dimensional cyborg heroes, the Tangibles, who have the ability to conjure up solid blocks out of thinThe Associated Nexus of Galaxies (TANG) has been threatened by hordes of invaders bent on pillaging the natural resource of Energy Crystals. As a last hope, the TANG calls upon four super dimensional cyborg heroes, the Tangibles, who have the ability to conjure up solid blocks out of thin air. These brave soldiers will use their cunning, quick reflexes and Power Bolts to retrieve the Energy Crystals and push back the advancing armada.… Expand"}, {"name": "Fair Strike", "details_link": "https://www.metacritic.com/game/pc/fair-strike", "publisher": "Buka Entertainment", "release_date": "Feb 10 2004", "developers": ["G5 Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Helicopter", "Helicopter", "Combat", "Civilian"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/8c31664227601c269bb004fb990f1788-98.jpg", "descriptions": "Command an elite squadron of the best military helicopter pilots in the world and battle a nefarious syndicate of international terrorists. Pilot six of the deadliest military helicopters on the planet in 30 levels of intense air-to-air, air-to-ground and air-to-sea combat! Fly 6 playableCommand an elite squadron of the best military helicopter pilots in the world and battle a nefarious syndicate of international terrorists. Pilot six of the deadliest military helicopters on the planet in 30 levels of intense air-to-air, air-to-ground and air-to-sea combat! Fly 6 playable helicopters: AH-64A Apache, RAH-66 Comanche, PAH-2 Tiger, Ka-50 Black Shark, Ka-52 Alligator, and the Ka-58 Black Ghost. Battle heavily-armed narco-terrorists in the Caribbean, violent separatists in Eastern Europe, and Muslim fundamentalists in South East Asia and the Middle East. Lay waste to enemy tanks, tankers, bunkers, ships, helicopters, troops. Everything on screen is destructible! Awesome multiplayer modes ? via Internet or LAN defeat terrorists in 2-player cooperative missions or compete in 16-player death matches! [Encore Software]… Expand"}, {"name": "ADR1FT", "details_link": "https://www.metacritic.com/game/playstation-4/adr1ft", "publisher": "505 Games", "release_date": "Jul 15 2016", "developers": ["Three One Zero"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 56, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/68654e9444661498dca9269c7a89ba50-98.jpg", "descriptions": "ADR1FT is an immersive First Person Experience (FPX) that recounts the story of an astronaut in danger. Floating quietly within the wreckage of a destroyed space station with no memories and a critically damaged EVA suit, the lone survivor struggles to understand the cause of theADR1FT is an immersive First Person Experience (FPX) that recounts the story of an astronaut in danger. Floating quietly within the wreckage of a destroyed space station with no memories and a critically damaged EVA suit, the lone survivor struggles to understand the cause of the catastrophic event that killed everyone on board. The player must fight to stay alive by exploring the wreckage for precious resources and overcome the challenges of the unforgiving environment to repair the damaged emergency escape vehicle and safely return home. [505 Games]… Expand"}, {"name": "Toren", "details_link": "https://www.metacritic.com/game/playstation-4/toren", "publisher": "Versus Evil", "release_date": "May 12 2015", "developers": ["Swordtales"], "platforms": ["PC", "PlayStation 4"], "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 56, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/f8b7948ca6a24b0714f162d3c72ec43d-98.jpg", "descriptions": "Experience the mysterious world of Toren, the first adventure game from Brazilian indie developer Swordtales. You are Moonchild, destined to climb the tower (known as Toren) on a hauntingly solitary journey to find your purpose."}, {"name": "Sonic Riders: Zero Gravity", "details_link": "https://www.metacritic.com/game/wii/sonic-riders-zero-gravity", "publisher": "Sega", "release_date": "Jan  8 2008", "developers": ["Sonic Team"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Other", "Automobile"], "meta_score": 56, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/cf727cc4a1338929d31aa863d426fda2-98.jpg", "descriptions": "The Sonic Riders series returns with a whole new form of chaotic racing by manipulating gravity itself! These gravity-altering powers can transform walls into tracks, or create a \"black hole\" that sucks you through for the ultimate speed boost, and allows for an entirely new way to gain aThe Sonic Riders series returns with a whole new form of chaotic racing by manipulating gravity itself! These gravity-altering powers can transform walls into tracks, or create a \"black hole\" that sucks you through for the ultimate speed boost, and allows for an entirely new way to gain a leg up on your competitors. From illuminated highways in a bustling metropolis to the outer reaches of space, you will race at the speed of light on 16 dynamic courses. Sixty different vehicles allow you to grind rails and pull off daring tricks on futuristic tracks, including solar loop-de-loops, height-defying vertical drops and tons of other edge-of-your-seat moves. As Sonic or one of 18 colorful characters, you will compete with up to three friends at heart-stopping speeds in three exciting multiplayer modes. With all the action, speed, and addictive gameplay that only Sonic can deliver, Sonic Riders: Zero Gravity is set for hyper-drive. [Sega]… Expand"}, {"name": "Achtung! Cthulhu Tactics", "details_link": "https://www.metacritic.com/game/pc/achtung!-cthulhu-tactics", "publisher": "Ripstone", "release_date": "Oct  4 2018", "developers": ["Auroch Digital"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 56, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/4b4f08a4912236b46faaea63236e49dd-98.jpg", "descriptions": "Challenge the horrifying reign of Nazi terror and battle an immortal evil in Achtung! Cthulhu Tactics; a turn-based tactical strategy game set in the award-winning Achtung! Cthulhu universe."}, {"name": "Gal*Gun 2", "details_link": "https://www.metacritic.com/game/playstation-4/galgun-2", "publisher": "PQube", "release_date": "Apr 24 2018", "developers": ["Inti Creates"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 56, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/d2dbdaf1de755ca02643b680c3d95ce7-98.jpg", "descriptions": "Gal Gun is back for an adventure more outrageous than ever! A new army of girls has been overpowered by lust in THE FULL-FRONTAL SEQUEL to Japan's infamous shooter. Fend them off with your Pheromone Shot and use new gadgets to expel demons from their bodies in the most audacious first-personGal Gun is back for an adventure more outrageous than ever! A new army of girls has been overpowered by lust in THE FULL-FRONTAL SEQUEL to Japan's infamous shooter. Fend them off with your Pheromone Shot and use new gadgets to expel demons from their bodies in the most audacious first-person shooter you'll ever play!FEATURES:* The craziest shooter yet! -- Help swarms of girls exorcise their demon possessions by hitting their pleasure spots with your love gun until they explode in euphoria!* A gorgeous new cast! -- Woo a fresh set of girls in a brand-new Gal Gun story. With the aid of alluring angel Risu, become romantically entangled with girl-next-door Chiru and childhood sweetheart Nanako.* Fulfil each girl's desires! -- Manage your schedule to receive jobs from the academy's love-struck girls, and satisfy their requests to unlock new missions and story scenes.* Suck your way to Pantsu Paradise! -- Equip the Demon Sweeper, capable of vacuuming up Gal*Gun 2's pesky demon menaces... and sucking the dresses right off the girls' bodies!* Get up-close and very personal! -- Enter Doki Doki Mode, which returns in its biggest, boldest and bounciest guise ever, to rub, caress and poke your way to happiness!… Expand"}, {"name": "Hardware: Rivals", "details_link": "https://www.metacritic.com/game/playstation-4/hardware-rivals", "publisher": "SCEA", "release_date": "Jan  5 2016", "developers": ["SCEA"], "platforms": "PlayStation 4", "num_players": "Up to 10 ", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 56, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/b6aa7e1994901d6ba89ab99a7f39f21a-98.jpg", "descriptions": "It’s tracks vs tires, armored tanks vs Fast Attack Vehicles (FAVs), in an all-terrain battle-fest of online multiplayer vehicular action. Plow through a range of unique combat arenas, claiming bounties, completing Challenges and wreaking terrible vengeance upon old adversaries. With multipleIt’s tracks vs tires, armored tanks vs Fast Attack Vehicles (FAVs), in an all-terrain battle-fest of online multiplayer vehicular action. Plow through a range of unique combat arenas, claiming bounties, completing Challenges and wreaking terrible vengeance upon old adversaries. With multiple battle modes, regular community events and a range of perks to unlock as you progress, there’ll always be a chance to settle the score. [Playstation.com]\r… Expand"}, {"name": "Barnyard", "details_link": "https://www.metacritic.com/game/game-boy-advance/barnyard", "publisher": "THQ", "release_date": "Aug  1 2006", "developers": ["Halfbrick Studios"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b6560f7ffd496ac1a6d924221cc11473-98.jpg", "descriptions": "Bring the Barnyard movie to life! Battle the coyote invaders, tee up for a game of golf, target the bulls eye with your flying chicken and race downhill on your speedy bike. Explore a fully interactive, 3D world and prove they have what it takes to be the biggest party animal of them all."}, {"name": "Active Life: Extreme Challenge", "details_link": "https://www.metacritic.com/game/wii/active-life-extreme-challenge", "publisher": "Namco Bandai Games", "release_date": "Aug 11 2009", "developers": ["TOSE"], "platforms": "Wii", "genres": ["Sports", "General", "General"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/6ac4bb5f301c71323abc4ea1e8382841-98.jpg", "descriptions": "(Also known as \"FamilyTrainer: Extreme Challenge\")  Following up on its predecessor, Active Life: Extreme Challenge reintroduces the Active Life mat, a durable eight button peripheral that lets players control the on-screen action with their hands and feet when used in conjunction with a Wii(Also known as \"FamilyTrainer: Extreme Challenge\")  Following up on its predecessor, Active Life: Extreme Challenge reintroduces the Active Life mat, a durable eight button peripheral that lets players control the on-screen action with their hands and feet when used in conjunction with a Wii Remote. Now with even more intense pick-up and play activities, gaming exercise aficionados can enjoy a full-body workout that truly immerses them in extreme sporting events without the broken bones. Showcasing more than a dozen unique activities, from wakeboarding to rock climbing and base jumping, Active Life: Extreme Challenge promises to keep players' pulses pounding and hearts pumping with each new event. Combining the exclusive mat controller with a Wii Remote not only provides active and fun gameplay but also an experience that burns calories. With competitive and multiplayer challenges for up to two players and the ability to play as your personalized Miis, Active Life: Extreme Challenge ensures that everyone gets to share in the fun. [Namco Bandai Games]… Expand"}, {"name": "Judge Dredd: Dredd VS Death", "details_link": "https://www.metacritic.com/game/gamecube/judge-dredd-dredd-vs-death", "publisher": "Evolved Games", "release_date": "Mar  1 2005", "developers": ["Rebellion"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 56, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/6534f2410545306617dc3ac75c9078bd-98.jpg", "descriptions": "Judge Dredd: Dredd Versus Death combines weapon management, fast-paced combat, and intense multiplayer action. Based on the comic book, the game puts you in the shoes of Judge Dredd, a no-holds-barred judge who is determined to clean up the streets of the futuristic Mega-City One. Armed withJudge Dredd: Dredd Versus Death combines weapon management, fast-paced combat, and intense multiplayer action. Based on the comic book, the game puts you in the shoes of Judge Dredd, a no-holds-barred judge who is determined to clean up the streets of the futuristic Mega-City One. Armed with an all-purpose LawGiver that features six types of ammo, you can shoot to wound, shoot to kill, or make an arrest--all while keeping an eye on your Lawmeter. Shoot an unarmed citizen, and your Lawmeter will drop; apprehend numerous criminals, and it will rise.… Expand"}, {"name": "Deadly Premonition 2: A Blessing in Disguise", "details_link": "https://www.metacritic.com/game/switch/deadly-premonition-2-a-blessing-in-disguise", "publisher": "Rising Star Games", "release_date": "Jul 10 2020", "developers": ["Toybox Games", "TOYBOX"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 56, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/ae67f8b05243c1dcd281659dd83f44a1-98.jpg", "descriptions": "In the year 2005, FBI agent York visits Le Carré, a small town in New Orleans where he encounters a mysterious serial murder case alongside his \"friend\" Zach. Produced by the original creator team. The story takes place in a small town in New Orleans which was created based on research andIn the year 2005, FBI agent York visits Le Carré, a small town in New Orleans where he encounters a mysterious serial murder case alongside his \"friend\" Zach. Produced by the original creator team. The story takes place in a small town in New Orleans which was created based on research and interviews.… Expand"}, {"name": "Neptunia Virtual Stars", "details_link": "https://www.metacritic.com/game/playstation-4/neptunia-virtual-stars", "publisher": "Idea Factory", "release_date": "Mar  2 2021", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 56, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/5/dd236fa6c29d2f9b4626096bb0907f8f-98.jpg", "descriptions": "The Goddesses and virtual stars team up to take down the Anti in the music-based hack 'n' slash game, Neptunia Virtual Stars! In a dimension called Virtualand, the virtual planets that exist within it contain an extraordinary ability to produce a commodity known as content. Of theseThe Goddesses and virtual stars team up to take down the Anti in the music-based hack 'n' slash game, Neptunia Virtual Stars! In a dimension called Virtualand, the virtual planets that exist within it contain an extraordinary ability to produce a commodity known as content. Of these celestial bodies is a tranquil planet known as EMO. This was the largest target of a nefarious group whose sole purpose is to destroy content created by virtual planets... Anti. Their decimation of EMO has left its citizens hopeless. Just then, VTubers, popular live-streamers from Earth, were suddenly transported to Virtualand. Because VTubers possess an affinity for creating good content, they were obvious targets for Anti, who quickly captured them and turned them into data pockets known as V Cubes. Fair, the Virtual Goddess and leader of Planet EMO, sent out a distress signal to multiple dimensions in the hopes of a miracle. Two groups received the signal - the rising VTuber stars, Mi and Yu, members of MEWTRAL, as well as the Goddesses of Gamindustri: Neptune, Noire, Blanc, and Vert. Both parties, now entering unfamiliar terrain, decide to team up to duke it out against Anti! Can they band together and save planet EMO from complete destruction? … Expand"}, {"name": "WWI: Verdun - Western Front", "details_link": "https://www.metacritic.com/game/playstation-4/wwi-verdun---western-front", "publisher": "M2H", "release_date": "Aug 30 2016", "developers": ["Abstraction Games", "M2H", "Blackmill Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 56, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/0d9aac0442e35bdacca7b7dc73773de2-98.jpg", "descriptions": "Verdun is a squad based multiplayer first person shooter set in the first world war. Inspired by the infamous battle of Verdun in 1916 players are able to take part in never seen before WWI action. Made by 3 indie developers from BlackMill and M2H."}, {"name": "Spelunker HD", "details_link": "https://www.metacritic.com/game/playstation-3/spelunker-hd", "publisher": "Tozai Games", "release_date": "Nov 23 2010", "developers": ["Irem"], "platforms": "PlayStation 3", "num_players": "Up to 6 ", "genres": ["Action", "General", "General", "Platformer", "2D"], "meta_score": 56, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/23cc44aae0488b20c772cbc7ef8d9d85-98.jpg", "descriptions": "Go on an underground adventure exploring the center of the earth in Minna de SPELUNKER."}]