[{"name": "Insurgency: Sandstorm", "details_link": "https://www.metacritic.com/game/xbox-one/insurgency-sandstorm", "publisher": "Focus Home Interactive", "release_date": "Sep 29 2021", "developers": ["New World Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Strategy", "General", "Shooter", "First-Person", "Tactical"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/9c53afacb2a26a5de337f03b421bbbd7-98.jpg", "descriptions": "Insurgency: Sandstorm is a team-based, tactical FPS based on lethal close quarters combat and objective-oriented multiplayer gameplay. Experience the intensity of modern combat where skill is rewarded, and teamwork wins the fight."}, {"name": "Hearts of Iron II", "details_link": "https://www.metacritic.com/game/pc/hearts-of-iron-ii", "publisher": "Paradox Interactive", "release_date": "Jan  4 2005", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "32  Online", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/c1b8c2dd0dccfe9106dfa9708b73f44e-98.jpg", "descriptions": "Hearts of Iron II is the sequel to the most appreciated World War II PC game of true Grand Strategic scope! As in its forbear, the map spans the entire world and allows you to play one of over 130 countries during the years of World War II. Hearts of Iron II is a dream come true for everyHearts of Iron II is the sequel to the most appreciated World War II PC game of true Grand Strategic scope! As in its forbear, the map spans the entire world and allows you to play one of over 130 countries during the years of World War II. Hearts of Iron II is a dream come true for every armchair general and forces the player to choose sides when democracy, communism and fascism clash in the battles that changed history. [Paradox]… Expand"}, {"name": "Ring Fit Adventure", "details_link": "https://www.metacritic.com/game/switch/ring-fit-adventure", "publisher": "Nintendo", "release_date": "Oct 18 2019", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Exercise / Fitness"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/13fd6c94efae9d14b7de4279b761fa7c-98.jpg", "descriptions": "Traverse grass-swept plains by jogging in place, attack enemies with overhead shoulder presses, and refill your health meter by striking some yoga poses. Two new accessories, the Ring-Con™ and Leg Strap, measure your real-world actions and help turn them into in-game movements. WithTraverse grass-swept plains by jogging in place, attack enemies with overhead shoulder presses, and refill your health meter by striking some yoga poses. Two new accessories, the Ring-Con™ and Leg Strap, measure your real-world actions and help turn them into in-game movements. With additional minigames and customizable workout routines, Ring Fit Adventure is great escape for players of all skill levels and schedules. In Adventure mode, defeat enemies with attacks based on real-world exercises as you traverse more than 100 levels in over 20 worlds. As you work through each level (and possibly work up a sweat), you’ll earn experience points. Between fights, you may encounter some unusual methods of transportation such as squat-powered launch pads. Then, pass around the Ring-Con and leg strap accessories and select from a few minigames: break boxes with gusts of air, craft pottery using squats, and more.… Expand"}, {"name": "NieR Replicant ver.1.22474487139...", "details_link": "https://www.metacritic.com/game/playstation-4/nier-replicant-ver122474487139", "publisher": "Square Enix", "release_date": "Apr 22 2021", "developers": ["Toylogic Inc.", "Toylogic"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/37f93c58e9f68e21c8b8eb348897c711-98.jpg", "descriptions": "Get ready to experience where the NieR series all began - NieR Replicant ver.1.22474487139...Set in a post-apocalyptic world, NieR Replicant ver.1.22474487139 is puts you in the role of the titular Nier, a young man on a quest to cure his sister Yonah of a deadly disease. What they discoverGet ready to experience where the NieR series all began - NieR Replicant ver.1.22474487139...Set in a post-apocalyptic world, NieR Replicant ver.1.22474487139 is puts you in the role of the titular Nier, a young man on a quest to cure his sister Yonah of a deadly disease. What they discover will make them question everything they thought they knew The original NieR release has an interesting history. In Japan, there were two versions of the game: NieR Replicant and NieR Gestalt. NieR Replicant focused on Brother Nier and his sister Yonah. In NieR Gestalt, the main character was Father Nier, and Yonah his daughter. Only NieR Gestalt released in the West (under the name NIER) - so excitingly, this will be the first time many people will have played the Replicant version of the game.… Expand"}, {"name": "Pinball Hall of Fame: The Williams Collection", "details_link": "https://www.metacritic.com/game/xbox-360/pinball-hall-of-fame-the-williams-collection", "publisher": "System 3", "release_date": "Sep 22 2009", "developers": ["Farsight Studios"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/83935f94e2aaa875df537a5ecedec9d3-98.jpg", "descriptions": "Pinball Hall of Fame: The Williams Collection faithfully recreates eight of the most memorable tables from the golden age of pinball in photorealistic 3D. Working closely with Williams to ensure authenticity of each of the games, the collection is highlighted by some of the most popular andPinball Hall of Fame: The Williams Collection faithfully recreates eight of the most memorable tables from the golden age of pinball in photorealistic 3D. Working closely with Williams to ensure authenticity of each of the games, the collection is highlighted by some of the most popular and innovative Williams pinball tables, including Gorgar, the first-ever talking pinball machine, Black Knight, which introduced \"Magna-Save\" and Bonus Ball, and Space Shuttle, which took the pinball industry by storm in 1984. Every table has been meticulously recreated to bring players the visuals, sound effects and gameplay that made these games legendary successes. Pinball Hall of Fame: The Williams Collection harkens back to the arcades of the 1980s. Players begin Pinball Hall of Fame: The Williams Collection with access to four pinball tables, and the remaining four tables are unlocked as the game progresses. Players can spend as little as two minutes on a quick pinball challenge, or delve deeper into the game, gaining rewards in a token-based system as they unlock each of the pinball tables. Single-player Arcade and Challenge modes provide hours of solo entertainment, and a Multiplayer mode lets players face each other head-on. [Crave Entertainment]… Expand"}, {"name": "Final Fantasy XIII", "details_link": "https://www.metacritic.com/game/playstation-3/final-fantasy-xiii", "publisher": "Square Enix", "release_date": "Mar  9 2010", "developers": ["Square Enix"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/436eaa030e0c103b14ce881199e586b6-98.jpg", "descriptions": "In Final Fantasy XIII, you will embark on a journey through the cityworld of Cocoon and the outerworld of Pulse. Along the way, you will encounter diverse allies who will fight alongside you. Execute powerful attacks with weapons and magic, and summon the enigmatic Eidolons with an evolvedIn Final Fantasy XIII, you will embark on a journey through the cityworld of Cocoon and the outerworld of Pulse. Along the way, you will encounter diverse allies who will fight alongside you. Execute powerful attacks with weapons and magic, and summon the enigmatic Eidolons with an evolved Active Time Battle system. Experience seamless transitions between real time gameplay and in-game cinematics. Do you have the courage to face your destiny?… Expand"}, {"name": "NCAA Football 10", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-football-10", "publisher": "Electronic Arts", "release_date": "Jul 14 2009", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 83, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/4c5e258f24e4016f5f50b8368d215737-98.jpg", "descriptions": "NCAA Football 10 brings the excitement of college football to fans across the nation like never before with its newest feature, Season Showdown. In this new mode, every game counts as fans declare their loyalty to a favorite school and give the ultimate show of support in a nationwideNCAA Football 10 brings the excitement of college football to fans across the nation like never before with its newest feature, Season Showdown. In this new mode, every game counts as fans declare their loyalty to a favorite school and give the ultimate show of support in a nationwide competition.  All college football fans have an opportunity to participate in Season Showdown, as credits not only accumulate in-game but players can also earn credits for their school via new web-based games.  Millions of college football fans around the country will be on a mission to prove their school is number one with NCAA Football 10’s Season Showdown. NCAA Football 10 envelopes the excitement and pageantry of college football at its best.  Enhanced stadiums filled with school colors, cheerleaders and mascots bring the college atmosphere to life.  Enjoy the sights of game day with new field goal nets, flags waving in the wind and camera flashes exploding during pivotal moments. With all 120 Football Bowl Subdivision schools represented in the game, NCAA Football 10 offers fans an exciting way to experience the thrill of authentic college football year-round. [Electronic Arts]… Expand"}, {"name": "Mario Kart 8 Deluxe: Booster Course Pass - Wave 3", "details_link": "https://www.metacritic.com/game/switch/mario-kart-8-deluxe-booster-course-pass---wave-3", "publisher": "Nintendo", "release_date": "Dec  7 2022", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/59bd18a3dad350f9f8b958cc3086f77f-98.jpg", "descriptions": "Rev up those engines, because more courses are cruising over to the Mario Kart 8 Deluxe - Booster Course Pass DLC on Nintendo Switch this holiday! Wave 3 features eight tracks, including Merry Mountain from Mario Kart Tour and Peach Gardens from Mario Kart DS!"}, {"name": "Wayward Strand", "details_link": "https://www.metacritic.com/game/switch/wayward-strand", "publisher": "Ghost Pattern", "release_date": "Sep 15 2022", "developers": ["Ghost Pattern"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/f1b35d7a8d6d92529507a3df0aadc008-98.jpg", "descriptions": "Welcome to the Hospital - It’s the summer of 1978, and Casey Beaumaris is trying to make the most of her holidays, when her mum asks her to spend a long weekend helping out at the airborne hospital where she works. Casey prefers the company of books to people, but she agrees, secretlyWelcome to the Hospital - It’s the summer of 1978, and Casey Beaumaris is trying to make the most of her holidays, when her mum asks her to spend a long weekend helping out at the airborne hospital where she works. Casey prefers the company of books to people, but she agrees, secretly planning to write an article about her visit for the school newspaper. With her trusty notebook at the ready, Casey arrives on board the airship. The staff are overworked as they prepare for the visit of an important official, while the patients react to grief, or deal with active trauma. In the midst of these and many other interlocking and overlapping stories, Casey spends time with the patients, learning about their lives, and, as the stories unfold, discovering what she can do to help.… Expand"}, {"name": "Sackboy: A Big Adventure", "details_link": "https://www.metacritic.com/game/playstation-4/sackboy-a-big-adventure", "publisher": "Sony Interactive Entertainment", "release_date": "Nov 12 2020", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/af41f138cc870308733768af7e534c05-98.jpg", "descriptions": "Perilous platforming experience - Explore here, there and everywhere as you utilize sackboy's cool, diverse move-set to face a huge variety of thrilling challenges, fierce enemies and startling surprises. Re-stuffed. Re-stitched. Re-zipped - sack boy returns to the big time stuffed withPerilous platforming experience - Explore here, there and everywhere as you utilize sackboy's cool, diverse move-set to face a huge variety of thrilling challenges, fierce enemies and startling surprises. Re-stuffed. Re-stitched. Re-zipped - sack boy returns to the big time stuffed with fresh moves and game-changing gadgets in an awe-inspiring and downright fun 3D adventure in this new, but familiar world. … Expand"}, {"name": "ZEN Pinball 2: Portal Pinball", "details_link": "https://www.metacritic.com/game/playstation-4/zen-pinball-2-portal-pinball", "publisher": "Zen Studios", "release_date": "May 26 2015", "developers": ["Zen Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Pinball"], "meta_score": 83, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/f6ce35cc79f9c37e84d1e3e9b6931c40-98.jpg", "descriptions": "Zen Studios, in collaboration with Aperture Laboratories and Valve, is proud to present the Aperture Science Heuristic Portal  Pinball Device, proving that persistent experimentation is not only the hallmark of good science for the benefit of mankind, but also incalculably fun!\r TableZen Studios, in collaboration with Aperture Laboratories and Valve, is proud to present the Aperture Science Heuristic Portal  Pinball Device, proving that persistent experimentation is not only the hallmark of good science for the benefit of mankind, but also incalculably fun!\r Table features:\r- Guide Chell and Wheatley through test chambers by navigating portals, using aerial faith plates, defeating turrets and facing other obstacles.\r- Battle against GLaDOS as you attempt to escape the facility and reach the surface.\r- Team up with ATLAS and P-Body for their Cooperative Testing Initiative Multiball.\r- Discover Ratman's hidden mini playfield and wreak havok on the Turret Factory.… Expand"}, {"name": "Star Wars Pinball", "details_link": "https://www.metacritic.com/game/wii-u/star-wars-pinball", "publisher": "Zen Studios", "release_date": "Jul 11 2013", "developers": ["Zen Studios"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/d1c9d64150234ed83e132736ebef48b5-98.jpg", "descriptions": "Feel the power of the Force in Star Wars Pinball! Set in a galaxy far, far away, each of the tables in this brand new pack lets you interact with the most iconic characters, and relive the greatest moments of the Star Wars universe: Star Wars: Episode V The Empire Strikes Back, Star Wars:Feel the power of the Force in Star Wars Pinball! Set in a galaxy far, far away, each of the tables in this brand new pack lets you interact with the most iconic characters, and relive the greatest moments of the Star Wars universe: Star Wars: Episode V The Empire Strikes Back, Star Wars: The Clone Wars, and Boba Fett. May the Force be with you!\r Influence the Balance of the Force! Join either the Light Side or Dark Side and take part in the epic struggle by simply posting scores for your chosen side!\r Full list of features:\r-Three brand new tables: Star Wars: Episode V The Empire Strikes Back, Boba Fett, and The Clone Wars\r-Compete against other players to achieve the highest ForceScore, and team up with your friends to increase your TeamScore\r-Exciting multiplayer modes, including local split-screen and hotseat multiplayer\r-Worldwide Tournaments\r-New tables released regularly through the Nintendo eShop for Wii U\r-GamePad support!… Expand"}, {"name": "TimeSplitters: Future Perfect", "details_link": "https://www.metacritic.com/game/xbox/timesplitters-future-perfect", "publisher": "EA Games", "release_date": "Mar 21 2005", "developers": ["Free Radical Design"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/a1a8adf86252fe7c858a29d9b5e54954-98.jpg", "descriptions": "In TimeSplitters: Future Perfect, humanity is on the brink of destruction by the evil TimeSplitters. With the help of some familiar faces, Cortez--the tough hero from previous installments--must chase a mystery foe across different time periods to trace the origins of the TimeSplitters. AsIn TimeSplitters: Future Perfect, humanity is on the brink of destruction by the evil TimeSplitters. With the help of some familiar faces, Cortez--the tough hero from previous installments--must chase a mystery foe across different time periods to trace the origins of the TimeSplitters. As Cortez, you'll have access to weapons, gadgets, characters, and environments that are unique to each time period. You can also correct the mistakes made in the past or team up with past and future versions of yourself in battles.… Expand"}, {"name": "FIFA Soccer 11", "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-11", "publisher": "EA Sports", "release_date": "Sep 28 2010", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/dc164322982aa7ea7542204a3dc2f848-98.jpg", "descriptions": "EA returns to the field with another installment in its long-running soccer series."}, {"name": "Project CARS", "details_link": "https://www.metacritic.com/game/pc/project-cars", "publisher": "Bandai Namco Games", "release_date": "May  6 2015", "developers": ["Slightly Mad Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Driving", "General", "Racing", "Simulation", "General", "Automobile"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/313bfd6a21f0ebd04fde32b6fe0f17d2-98.jpg", "descriptions": "Create a driver, pick from a variety of motorsports, and shift into high gear to chase a number of Historic Goals and ultimate recognition in the Hall Of Fame. Then test your skills online either in competitive fully-loaded race weekends, leaderboard-based time challenges, orCreate a driver, pick from a variety of motorsports, and shift into high gear to chase a number of Historic Goals and ultimate recognition in the Hall Of Fame. Then test your skills online either in competitive fully-loaded race weekends, leaderboard-based time challenges, or continually-updated community events.… Expand"}, {"name": "Hogwarts Legacy", "details_link": "https://www.metacritic.com/game/pc/hogwarts-legacy", "publisher": "Warner Bros. Games Montreal", "release_date": "Feb  7 2023", "developers": ["Avalanche Software", "Portkey Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Role-Playing", "Western-Style"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/fc2e376f50d347fb671091a272cd8cf8-98.jpg", "descriptions": "LIVE THE UNWRITTEN = Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Now you can take control of the action and be at the center of your own adventure in the wizarding world. Embark on a journey through familiar and newLIVE THE UNWRITTEN = Hogwarts Legacy is an immersive, open-world action RPG set in the world first introduced in the Harry Potter books. Now you can take control of the action and be at the center of your own adventure in the wizarding world. Embark on a journey through familiar and new locations as you explore and discover fantastic beasts, customize your character and craft potions, master spell casting, upgrade talents, and become the wizard you want to be.\r Experience Hogwarts in the 1800s. Your character is a student who holds the key to an ancient secret that threatens to tear the wizarding world apart. You have received a late acceptance to the Hogwarts School of Witchcraft and Wizardry and soon discover that you are no ordinary student: you possess an unusual ability to perceive and master Ancient Magic. Only you can decide if you will protect this secret for the good of all, or yield to the temptation of more sinister magic.\r Discover the feeling of living at Hogwarts as you make allies, battle Dark wizards, and ultimately decide the fate of the wizarding world. Your legacy is what you make of it.… Expand"}, {"name": "Crush", "details_link": "https://www.metacritic.com/game/psp/crush", "publisher": "Sega", "release_date": "May 29 2007", "developers": ["Zoe Mode"], "platforms": ["3DS", "PSP"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/838744c6326c204deb0e12916a934c16-98.jpg", "descriptions": "Unique to its genre, Crush introduces a valuable new puzzle gaming experience that is wholly suited to the PSP system. Set within a complex, hypnotic 3D world, players use the game's unique crush mechanic to \"crush\" the environment and transform it into a more simplified 2D platformer. OnceUnique to its genre, Crush introduces a valuable new puzzle gaming experience that is wholly suited to the PSP system. Set within a complex, hypnotic 3D world, players use the game's unique crush mechanic to \"crush\" the environment and transform it into a more simplified 2D platformer. Once flattened, players utilize the 2D space to move to new areas to solve otherwise impossible challenges, and unlock secret items that were previously unobtainable in the 3D environment. Players then \"uncrush\" the 2D environment and return to the 3D world. Designed for a wide and varied audience, Crush tells the story of Dan, a man with a lifetime of unresolved issues and bottled up emotions that has turned him into a nervous insomniac who is too tired to turn his life around. Desperate for a cure, he turns to hypnosis. It is during this state that he is given one last chance to sort through the wreckage of his past, before he loses the last thing he has – his sanity. [Sega]… Expand"}, {"name": "Atelier Ryza 3: Alchemist of the End & the Secret Key", "details_link": "https://www.metacritic.com/game/playstation-5/atelier-ryza-3-alchemist-of-the-end-the-secret-key", "publisher": "Koei Tecmo Games", "release_date": "Mar 24 2023", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/3c708c0ef3d4f3063826269beb466b04-98.jpg", "descriptions": "Ryza and her friends are living their lives on Kurken Island when news of a sudden appearance of a mysterious group of islands in nearby waters arrives.\rTo find a way to save her island, Ryza and her friends will set off on final adventure surrounding the \"roots of alchemy.\"\r\r\nThe stageRyza and her friends are living their lives on Kurken Island when news of a sudden appearance of a mysterious group of islands in nearby waters arrives.\rTo find a way to save her island, Ryza and her friends will set off on final adventure surrounding the \"roots of alchemy.\"\r The stage for this adventure is a vast open field!\rThe field is made up of multiple maps that are connected seamlessly. Enjoy this adventure in a vast and ‘living’ field that is one of the largest in the Atelier series.\r You can do many things with the key!\rObtain various types of keys which can be used in different instances of exploration, synthesis, and battle. Each key has a different effect, so use it to enjoy the adventure conveniently!… Expand"}, {"name": "Total War: WARHAMMER II - Curse of the Vampire Coast", "details_link": "https://www.metacritic.com/game/pc/total-war-warhammer-ii---curse-of-the-vampire-coast", "publisher": "Sega", "release_date": "Nov  8 2018", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Night falls on Lustria. As you stand on the dock and peer seawards through the gathering mists, strain your ears. The jungle sounds behind you fade, and in their place comes a wet thudding, as of rotten rigging against a mouldy mast. The sound multiplies, and with it, the groan of a thousandNight falls on Lustria. As you stand on the dock and peer seawards through the gathering mists, strain your ears. The jungle sounds behind you fade, and in their place comes a wet thudding, as of rotten rigging against a mouldy mast. The sound multiplies, and with it, the groan of a thousand breathless voices, joined in something part-shanty, part-dirge. Dread prows pierce the gloom ahead, and the ghastly truth is laid bare: upon the ghoul-winds come the swollen hulks and decaying vessels of the Vampire Coast! Run now – run hard and fast. For it is all you can do.\r… Expand"}, {"name": "Riven: The Sequel to Myst", "details_link": "https://www.metacritic.com/game/pc/riven-the-sequel-to-myst", "publisher": "Red Orb Entertainment", "release_date": "Oct 31 1997", "developers": ["Cyan Worlds"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/7f66833ad5f27ccb9345d9e710886646-98.jpg", "descriptions": "Enter a deceptively beautiful world torn apart by age-old conflicts...where secrets lie hidden at every turn...and nothing is as it seems. You must search. You must explore. You must summon every spark of intellect and intuition. Only then will you learn the truth and this troubled land andEnter a deceptively beautiful world torn apart by age-old conflicts...where secrets lie hidden at every turn...and nothing is as it seems. You must search. You must explore. You must summon every spark of intellect and intuition. Only then will you learn the truth and this troubled land and its inhabitants. You must let Riven become your world - before an entire world is lost. [Red Orb]… Expand"}, {"name": "Guardian Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/guardian-heroes", "publisher": "Sega", "release_date": "Oct 12 2011", "developers": ["Treasure"], "platforms": "Xbox 360", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/920ad5f244e81efd038b7093b497d067-98.jpg", "descriptions": "Much more than just a beat 'em up, Guardian Heroes is the perfect blend of action and adventure. Hack, slash and burn through hordes of androids, zombie warriors and goblins as you select your route through over 30 gripping levels, or battle it out in frantic 6-player mode with over 45Much more than just a beat 'em up, Guardian Heroes is the perfect blend of action and adventure. Hack, slash and burn through hordes of androids, zombie warriors and goblins as you select your route through over 30 gripping levels, or battle it out in frantic 6-player mode with over 45 characters to choose from!… Expand"}, {"name": "DIRT 5", "details_link": "https://www.metacritic.com/game/xbox-one/dirt-5", "publisher": "Codemasters", "release_date": "Nov  3 2020", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 83, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/2e1bfa520b9307c2c35f45203c9c55c2-98.jpg", "descriptions": "Take a trip around the world to and race on over 70+ unique routes across 10 different global locations in stunning environments complete with dynamic weather and time of day. Get behind the wheel of an eclectic and exciting roster of cars. World-renowned voice talents troy baker and nolanTake a trip around the world to and race on over 70+ unique routes across 10 different global locations in stunning environments complete with dynamic weather and time of day. Get behind the wheel of an eclectic and exciting roster of cars. World-renowned voice talents troy baker and nolan north head up the cast of dirt 5's story-driven Career mode. Local split-screen of up to four players on offline modes, including Career, makes dirt 5 the perfect couch multiplayer racing game as you battle for position with your friends. Capture your biggest jumps and best moves with a detailed photo mode, and show your creative flair with dirt's deepest ever livery editor for all cars.\r… Expand"}, {"name": "Borderlands", "details_link": "https://www.metacritic.com/game/playstation-3/borderlands", "publisher": "2K Games", "release_date": "Oct 20 2009", "developers": ["Gearbox Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/ed568745db4da4efb2154e3dc5d550d2-98.jpg", "descriptions": "As the first title in an all-new sci-fi action franchise, Borderlands combines the best elements of Gearbox Software's first-person action titles with player customization and vehicular combat. Borderlands features a unique content generation system allowing for near-endless variety inAs the first title in an all-new sci-fi action franchise, Borderlands combines the best elements of Gearbox Software's first-person action titles with player customization and vehicular combat. Borderlands features a unique content generation system allowing for near-endless variety in missions, environments, enemies, weapons, item drops and character customization. Borderlands is a cooperative experience, allowing for multiple players to share the same game experience simultaneously online. Players can freely join or leave each other’s games at anytime, or choose to play in the full single-player mode. Borderlands features life-like character animations, impressive real-time physics, and customizable vehicles. More details to follow. [2K Games/Gearbox Software]… Expand"}, {"name": "Danganronpa Decadence", "details_link": "https://www.metacritic.com/game/switch/danganronpa-decadence", "publisher": "Spike Chunsoft", "release_date": "Dec  3 2021", "developers": ["Spike Chunsoft"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/94de520107ecfdef72cf62e33364dda2-98.jpg", "descriptions": "Danganronpa Decadence contains the three main titles in the legendary Danganronpa franchise, Danganronpa: Trigger Happy Havoc Anniversary Edition, Danganronpa 2: Goodbye Despair Anniversary Edition, and Danganronpa V3: Killing Harmony Anniversary Edition, and also features the brand-newDanganronpa Decadence contains the three main titles in the legendary Danganronpa franchise, Danganronpa: Trigger Happy Havoc Anniversary Edition, Danganronpa 2: Goodbye Despair Anniversary Edition, and Danganronpa V3: Killing Harmony Anniversary Edition, and also features the brand-new title Danganronpa S: Ultimate Summer Camp, a boardgame-style bonus game with all-new scenes and interactions between your favorite characters!… Expand"}, {"name": "Duck Game", "details_link": "https://www.metacritic.com/game/switch/duck-game", "publisher": "Adult Swim", "release_date": "May  1 2019", "developers": ["Landon Podbielski"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/f2427905d8b32936dfc559a4b64976e9-98.jpg", "descriptions": "It's DUCK GAME! Enter the futuristic year of 1984 and challenge your friends to a frantic battle for glory. Win over\rthe crowd and gain a following while you battle using Shotguns, Net Guns, Mind Control Rays, Saxaphones, Magnet Guns, and pretty much\ranything else a Duck could use as aIt's DUCK GAME! Enter the futuristic year of 1984 and challenge your friends to a frantic battle for glory. Win over\rthe crowd and gain a following while you battle using Shotguns, Net Guns, Mind Control Rays, Saxaphones, Magnet Guns, and pretty much\ranything else a Duck could use as a weapon. One hit, and your duck is feathers. So Don't blink.\r - 2 to 4 PLAYERS in Local Multiplayer Couch Combat\r- New Single Player challenge mode\r- Easy to pick up, emphasizing strategy over twitch reaction\r- 50+ Levels, 50+ Weapons\r- Level Editor\r Enter the universe of DUCK GAME. The year is 1984 - and ducks have covered the known world with brutalist office spaces, factories, and construction projects. Fueled by a colossal military- and defense-weapons industry, the ruling government of Duck World recently installed instant-access weapon portals within every office space and simulated forest environment in the spirit of convenient self defense.\r Four ducks are sick of working. Now it's time to play!… Expand"}, {"name": "Need for Speed Underground", "details_link": "https://www.metacritic.com/game/xbox/need-for-speed-underground", "publisher": "Electronic Arts", "release_date": "Nov 17 2003", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/b41be8368ff4fcab991f832bb20580e4-98.jpg", "descriptions": "Enter the world of urban street racing with the latest title in the hit Need for Speed series: Need for Speed Underground.  Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, earning cash for car mods.  Test your skills against the computer orEnter the world of urban street racing with the latest title in the hit Need for Speed series: Need for Speed Underground.  Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, earning cash for car mods.  Test your skills against the computer or online against up to 4 players.  But creating a custom street racing machine will not get you to the top; it takes a certain amount of attitude and razor sharp driving skills to compete in the tough world of urban racing.  … Expand"}, {"name": "Freedom Fighters", "details_link": "https://www.metacritic.com/game/gamecube/freedom-fighters", "publisher": "EA Games", "release_date": "Oct  1 2003", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/d9074912960546faa151f78ddc5ad12f-98.jpg", "descriptions": "With fierce conflict unfolding in the streets of America, it's your patriotic duty to fight back. Take on the role of Christopher Stone, and evolve from an average New Yorker into a fearless patriot who recruits and leads an army of freedom fighters in the streets of New York City. FreedomWith fierce conflict unfolding in the streets of America, it's your patriotic duty to fight back. Take on the role of Christopher Stone, and evolve from an average New Yorker into a fearless patriot who recruits and leads an army of freedom fighters in the streets of New York City. Freedom Fighters combines the depth of a squad-based game with the intensity of an action-packed war game, all of which unfolds in the streets, subways, and buildings of a modern-day urban battleground.… Expand"}, {"name": "High Heat Major League Baseball 2004", "details_link": "https://www.metacritic.com/game/xbox/high-heat-major-league-baseball-2004", "publisher": "3DO", "release_date": "Mar  5 2003", "developers": ["3DO"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e2280bb6aa8fd3bb2175aac5dda4a2c8-98.jpg", "descriptions": "High Heat™ Major League Baseball® 2004 combines new graphics and animations with a deep Franchise mode, a highly acclaimed A.I., and unsurpassed baseball realism. In Two On Two Showdown™, one of the game's eleven modes, pick a pitcher and a batter, and square off in aHigh Heat™ Major League Baseball® 2004 combines new graphics and animations with a deep Franchise mode, a highly acclaimed A.I., and unsurpassed baseball realism. In Two On Two Showdown™, one of the game's eleven modes, pick a pitcher and a batter, and square off in a single-inning battle!… Expand"}, {"name": "FIFA Soccer 2003", "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-2003", "publisher": "EA Sports", "release_date": "Nov  2 2002", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-16 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/df90aa866bdbbc526c702ed4f08e3d82-98.jpg", "descriptions": "The World of Soccer: Play with all the best clubs, players and national teams. Powerhouse Detail: The Club Championship highlights the top 18 club teams with intense detail, including team-specific stadiums and chants. Total Ball Control: Use your feet and head to control the ball like neverThe World of Soccer: Play with all the best clubs, players and national teams. Powerhouse Detail: The Club Championship highlights the top 18 club teams with intense detail, including team-specific stadiums and chants. Total Ball Control: Use your feet and head to control the ball like never before. New Set Pieces: Use free kicks and corner kicks to set up a shot or even score directly. Game-changing AI: Computer opponents will adopt tactics based on the real game situations. [EA Games]… Expand"}, {"name": "Icewind Dale II", "details_link": "https://www.metacritic.com/game/pc/icewind-dale-ii", "publisher": "Interplay", "release_date": "Aug 26 2002", "developers": ["Black Isle Studios"], "platforms": "PC", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/79cf2f9e50625771748d1b91c147e769-98.jpg", "descriptions": "The worst fear of the civilized realms has come true. The Goblinoids have united into an army of outcasts and misfits and they want to call the Ten Towns their own. Massive swarms of Orcs and Worg-mounted Goblins are attempting to overrun the town of Targos, and that's just the beginning! AThe worst fear of the civilized realms has come true. The Goblinoids have united into an army of outcasts and misfits and they want to call the Ten Towns their own. Massive swarms of Orcs and Worg-mounted Goblins are attempting to overrun the town of Targos, and that's just the beginning! A call has gone out to all those willing to face insurmountable odds in defense of the Ten Towns. Will you heed the call to arms and face the greatest threat to the Spine of the World? [Interplay]… Expand"}, {"name": "Age of Empires", "details_link": "https://www.metacritic.com/game/pc/age-of-empires", "publisher": "Microsoft Game Studios", "release_date": "Sep 30 1997", "developers": ["Ensemble Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/9dba4f6f800033576ced61a954ff4073-98.jpg", "descriptions": "Age of Empires is an epic real-time strategy game spanning 10,000 years, in which players are the guiding spirit in the evolution of small stone age tribes. Starting with minimal resources, players are challenged to build their tribes into great civilizations. Gamers can choose from one ofAge of Empires is an epic real-time strategy game spanning 10,000 years, in which players are the guiding spirit in the evolution of small stone age tribes. Starting with minimal resources, players are challenged to build their tribes into great civilizations. Gamers can choose from one of several ways to win the game, including: world domination by conquering enemy civilizations, exploration of the known world and economic victory through the accumulation of wealth. Age of Empires was developed by Ensemble Studios and features the expertise of Bruce Shelley, co-designer of the hit strategy game \"Civilization.\" [Microsoft]… Expand"}, {"name": "EverQuest II: Echoes of Faydwer", "details_link": "https://www.metacritic.com/game/pc/everquest-ii-echoes-of-faydwer", "publisher": "Sony Online Entertainment", "release_date": "Nov 13 2006", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/8d2ef1f10cf549bec0def9e9c25bd941-98.jpg", "descriptions": "Echoes of Faydwer is the fourth expansion pack for EverQuest II and the first EQII expansion pack with content for beginners to high-level players (Levels 1 – 70). This expansion introduces a new playable race, The Fae, an enchanted race of winged creatures. The Fae dwell on the continent ofEchoes of Faydwer is the fourth expansion pack for EverQuest II and the first EQII expansion pack with content for beginners to high-level players (Levels 1 – 70). This expansion introduces a new playable race, The Fae, an enchanted race of winged creatures. The Fae dwell on the continent of Faydwer, in the arboreal city of Kelethin, the new starting city being added to new chapter in the EQII saga. Echoes of Faydwer includes over 350 new quests, a new selection of profession hats, cloaks, armor, and new horse mounts available to players of all levels. EQII players will encounter over 40 new types of creatures to face, more than 20 new zones and adventure areas, and will be able to compete against other players for new PvP (Player vs. Player) rewards, plus all-new items, equipment, spells and tradeskill recipes. The Achievement system introduced in the Kingdom of Sky expansion has been enhanced to include additional sub-class abilities, allowing players to further customize their characters' abilities. [SOE]… Expand"}, {"name": "Pocket Card Jockey", "details_link": "https://www.metacritic.com/game/3ds/pocket-card-jockey", "publisher": "Nintendo", "release_date": "May  5 2016", "developers": ["Game Freak"], "platforms": "3DS", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/14d6470554e6dfffeac03fee096b6176-98.jpg", "descriptions": "Stack cards like it's a race to the finish. And it is. In this fast-paced mash-up of solitaire and horse racing, you'll jockey your way to victory by clearing cards to energize your horse. You can even level up your noble steed through strategic positioning on the track. Can you masterStack cards like it's a race to the finish. And it is. In this fast-paced mash-up of solitaire and horse racing, you'll jockey your way to victory by clearing cards to energize your horse. You can even level up your noble steed through strategic positioning on the track. Can you master solitaire and horseback racing…at the same time?! After you get a dozen races under your belt, you can retire your horse—a sad moment for any jockey. However! You can relocate your horse to your very own farm and pair them with other retired horses to breed new ponies...that are completely adorable! Eventually these babies will pony up by maturing into horses that you can ride in competitions for prizes. You can then get items at Chirp's shop, such as puzzle pieces or temporary bonuses. After completing certain puzzles, your horse will gain even more stats when leveling up. That’s some next-level jockeying! … Expand"}, {"name": "Dragon Quest Builders", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-quest-builders", "publisher": "Square Enix", "release_date": "Oct 11 2016", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/bd74a722923859b7c41d833c79964a56-98.jpg", "descriptions": "Dragon Quest Builders returns to Alefgard—a land laid low by the evil Dragonlord. It is your mission to rebuild, restore and revive the ruined realm. Rebuild the world in your own image using the blocks that make up the vast land of Alefgard in this block-building RPG."}, {"name": "Transistor", "details_link": "https://www.metacritic.com/game/playstation-4/transistor", "publisher": "Supergiant Games", "release_date": "May 20 2014", "developers": ["Supergiant Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/660249a9a22d2dbd16ed2025aff5c170-98.jpg", "descriptions": "Transistor is a science-fiction-themed action role-playing game set in a futuristic city where you will take on the role of a young woman who gains control of an extraordinary weapon of unknown origin after a mysterious group of assailants nearly kills her with it."}, {"name": "Bleach: The Blade of Fate", "details_link": "https://www.metacritic.com/game/ds/bleach-the-blade-of-fate", "publisher": "Sega", "release_date": "Oct  9 2007", "developers": ["Treasure"], "platforms": "DS", "num_players": "4  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/e568af86f18d7a1c99afeeeae224615c-98.jpg", "descriptions": "(Also known as \"Bleach DS\")  Players face a variety of opponents as one of 28 highly-stylized characters in intense action-packed battles based on the animated series. Bleach: The Blade of Fate on the Nintendo DS brings a twist to the traditional 2D fighting game with a new kind of battle(Also known as \"Bleach DS\")  Players face a variety of opponents as one of 28 highly-stylized characters in intense action-packed battles based on the animated series. Bleach: The Blade of Fate on the Nintendo DS brings a twist to the traditional 2D fighting game with a new kind of battle system that enables players to move between upper and lower split-plane battle arenas to chase after or escape from opponents. The game also allows gamers to build Spirit Card Decks to strategically access power-ups and power-downs to perform special attacks, cast healing spells on themselves, displace opponents, or prohibit them from using their own Spirit Cards. Additionally, gamers can take to the streets battling against enemies with up to four players in fast-paced combat via the Nintendo DS' Wi-Fi capabilities. [Sega]… Expand"}, {"name": "Lumines: Electronic Symphony", "details_link": "https://www.metacritic.com/game/playstation-vita/lumines-electronic-symphony", "publisher": "Ubisoft", "release_date": "Feb 15 2012", "developers": ["Q Entertainment"], "platforms": "PlayStation Vita", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/43c682aa1c5bbd0488c822c22bafbea4-98.jpg", "descriptions": "New block mechanics: For the first time in the series, special new block mechanics give players additional strategic options. Clear huge block combos using the powerful Chain Block, and learn to master the randomizing powers of the Shuffle Block. Star-studded musical line-up: Featuring someNew block mechanics: For the first time in the series, special new block mechanics give players additional strategic options. Clear huge block combos using the powerful Chain Block, and learn to master the randomizing powers of the Shuffle Block. Star-studded musical line-up: Featuring some of the best and brightest names in electronic music, the soundtrack for Lumines Electronic Symphony is a diverse selection of known artists as well as original tracks composed by Q Entertainment's sound team, providing the ultimate aural experience. Look for tracks from The Chemical Brothers, Mark Ronson, Underworld, LCD Soundsystem, and more. All-new EXP system: Lumines Electronic Symphony rewards player effort and investment by providing an in-depth player profile, deep stat tracking, and a new Experience Points system that rewards every player's play style with a level-based reward system. The more you play –whether in solo or versus play— the richer your Lumines experience will be. Social experience: Compare your progress against your friends. Every time you play Lumines Electronic Symphony --whether in single- or multi-player modes-- you earn experience points. Another level, another rank, or another reward is always within reach. Whether you're a new Lumines player or a veteran of the series, Lumines Electronic Symphony's new social features will encourage you to play just \"one more game.\" [Sony]… Expand"}, {"name": "Prince of Persia: Warrior Within", "details_link": "https://www.metacritic.com/game/xbox/prince-of-persia-warrior-within", "publisher": "Ubisoft", "release_date": "Nov 30 2004", "developers": ["Ubisoft Montreal"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/164a369ad8f488ee95fdc0f8089028f4-98.jpg", "descriptions": "Hunted by Dahaka, an immortal incarnation of Fate seeking divine retribution, the Prince embarks on a new journey on a cursed island. Only with courage and the mastery of new combat arts can the Prince emerge victoriously. As the Prince, you can develop your own fighting style byHunted by Dahaka, an immortal incarnation of Fate seeking divine retribution, the Prince embarks on a new journey on a cursed island. Only with courage and the mastery of new combat arts can the Prince emerge victoriously. As the Prince, you can develop your own fighting style by manipulating the environment and the enemies. You can even use new projectile attacks and Sands of Time powers to rid the lands of deadly monsters.… Expand"}, {"name": "Splatoon 2", "details_link": "https://www.metacritic.com/game/switch/splatoon-2", "publisher": "Nintendo", "release_date": "Jul 21 2017", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/cba5114b0cbed365e448e2d5d14eeb9e-98.jpg", "descriptions": "Ink-splatting action is back and fresher than ever. Get hyped for the sequel to the game about splatting ink and claiming turf, as the squid-like Inklings return in a colorful and chaotic 4 vs. 4 action shooter. For the first time, take Turf War battles on-the-go via local multiplayer inInk-splatting action is back and fresher than ever. Get hyped for the sequel to the game about splatting ink and claiming turf, as the squid-like Inklings return in a colorful and chaotic 4 vs. 4 action shooter. For the first time, take Turf War battles on-the-go via local multiplayer in portable play styles. You can also compete in frenetic online matches like before. Two years have passed since the release of Splatoon, and two years have also passed in the game world, leading to an evolution in fashion trends and new styles of weapons and gear. Staying fresh never looked so good. Features: New weapons  New dual-wielding Splat Dualies join the action, complete with a new Dodge Roll move. Mainstays like the Splat Roller and Splat Charger have also been remixed to include new gameplay mechanics and brand-new special weapons. Local and Online Multiplayer  In a first for the series, compete in local multiplayer Turf War battles, whether in TV mode or on-the-go in handheld or tabletop modes. Online battles also make a return. New ways to play  Play using the Joy-Con controllers or the Nintendo Switch Pro Controller, both of which allow for gyro controls for better aiming and control. New Trends  Two years have passed since the release of Splatoon in real life, and two years have also passed in the game world. Some familiar characters return under different circumstances, and new characters are introduced as well. Fresh Updates - Similar to Splatoon for Wii U, updates will roll out post-launch, adding new content. Smart Device Support  An upcoming smart-phone application for the Nintendo Switch system will enhance matchmaking and allow for voice chat options. Turf War  Iconic 4 vs. 4 Turf War battles return. The goal is to splat ink on as much territory as possible, while strategically submerging yourself in your team's colors and blasting your enemies.… Expand"}, {"name": "Shovel Knight Pocket Dungeon", "details_link": "https://www.metacritic.com/game/switch/shovel-knight-pocket-dungeon", "publisher": "Yacht Club Games", "release_date": "Dec 13 2021", "developers": ["Vine"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["General", "Puzzle", "Action"], "meta_score": 83, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/70282dfd38be6b5949efbf3176071623-98.jpg", "descriptions": "Delve with Shovel Knight into the depths of the Pocket Dungeon in an action-packed puzzle adventure mashup like no other. Delve with Shovel Knight into the depths of the Pocket Dungeon in an action-packed puzzle adventure mashup like none other! Join your mysterious guide Puzzle Knight asDelve with Shovel Knight into the depths of the Pocket Dungeon in an action-packed puzzle adventure mashup like no other. Delve with Shovel Knight into the depths of the Pocket Dungeon in an action-packed puzzle adventure mashup like none other! Join your mysterious guide Puzzle Knight as you shovel through scads of foes, procure new equipment, and battle bosses both familiar and new. Explore a tale with endless twists and turns, quest as your favorite heroes, and even challenge a friend for fast-paced head-to-head competition in Shovel Knight Pocket Dungeon!\r Enter a world of falling block puzzle games, with a dungeon-crawling twist! Bump into enemies to battle them and trade damage in a unique combat system. An all-new hybrid that’s never been seen before. Group foes together for massive chain attacks while grabbing keys, power-ups, and potions to refill your health!\r  Take control of more than 10 of your favorite heroes from the Shovel Knight universe, each with a unique power and play style.\r  Take control of more than 10 of your favorite heroes from the Shovel Knight universe, each with a unique power and play style.\r  Equip yourself on the fly with a treasure trove of items and equipment. Mix and match your loadout to prepare for any encounter.\r  Play in a variety of ways with Story Mode, 2 player competitive Versus Mode, a Daily Challenge, and much more!\r  A bold new visual style complements a new story. Learn the ropes from your pal Puzzle Knight as you attempt to escape the mysterious Pocket Dungeon. Shovel Knight’s signature storytelling and humor are on full display!\r  Using your Shovel Knight series Amiibo allows you to call upon a familiar fairy friend to keep you company on your perplexing puzzle adventure!\r … Expand"}, {"name": "Dark Souls II: Crown of the Ivory King", "details_link": "https://www.metacritic.com/game/xbox-360/dark-souls-ii-crown-of-the-ivory-king", "publisher": "Bandai Namco Games", "release_date": "Sep 29 2014", "developers": ["Namco Bandai Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/6ec656c040ab4c4e01b6002fabd485db-98.jpg", "descriptions": "'DARK SOULS II Crown of the Ivory King' is the third of 3 large-scale DLC additions to DARK SOULS II, and includes all-new stages, maps, boss characters, weapons & armor! In this third DLC, players will find themselves in a world shining bright with the glow of treacherous ice. Can you'DARK SOULS II Crown of the Ivory King' is the third of 3 large-scale DLC additions to DARK SOULS II, and includes all-new stages, maps, boss characters, weapons & armor! In this third DLC, players will find themselves in a world shining bright with the glow of treacherous ice. Can you find and recover the lost crown?… Expand"}, {"name": "Yoku's Island Express", "details_link": "https://www.metacritic.com/game/playstation-4/yokus-island-express", "publisher": "Villa Gorilla", "release_date": "May 29 2018", "developers": ["Villa Gorilla"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/35b12d4f1f0499234cc060dee28a1987-98.jpg", "descriptions": "Yoku’s Island Express is an open world/metroidvania-style pinball adventure, Seamlessly blending platform navigation with pinball mechanics across a large open world."}, {"name": "Everyday Shooter", "details_link": "https://www.metacritic.com/game/playstation-3/everyday-shooter", "publisher": "SCEA", "release_date": "Oct 11 2007", "developers": ["Backbone Entertainment"], "platforms": ["PC", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/2533066d4b8c6621abbbe49a9273efc0-98.jpg", "descriptions": "[Downloadable Game]  Developed solely by Jonathan Mak, Everyday Shooter won three awards at the Independent Gaming Festival at the 2007 Game Developers Conference. Unlike traditional arcade shooters, the sound effects in Everyday Shooter play in musical harmony with the game’s background[Downloadable Game]  Developed solely by Jonathan Mak, Everyday Shooter won three awards at the Independent Gaming Festival at the 2007 Game Developers Conference. Unlike traditional arcade shooters, the sound effects in Everyday Shooter play in musical harmony with the game’s background music. Throughout Everyday Shooter’s album of games, typical arcade sounds of destruction are replaced with guitar riffs harmonizing over an all-guitar soundtrack. Album of Shooter Games – Each of the 8 ‘songs’ or levels has a completely different visual vibe and chain system. Vector-Based Graphics – Graphics are created from mathematical equations celebrating the beauty of geometry. Stunning, Evolving Synaethesia - Every shot, hit, or explosion creates a visual and musical inspiration that produces a note, chord or riff that harmonizes into the song for each level. Full HD at 1080p – In addition to the fluid music, enjoy the brilliant colors and stylized visuals. [SCEA]… Expand"}, {"name": "Stray", "details_link": "https://www.metacritic.com/game/playstation-5/stray", "publisher": "Annapurna Interactive", "release_date": "Jul 19 2022", "developers": ["Bluetwelve", "BlueTwelve Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/e35364d9a4b1e4154eee57ea6506ab21-98.jpg", "descriptions": "Lost, alone and separated from family, a stray cat must untangle an ancient mystery to escape a long-forgotten cybercity and find the way home. Stray is a third-person cat adventure game set amidst the detailed neon-lit alleys of a decaying cybercity and the murky environments of its seedyLost, alone and separated from family, a stray cat must untangle an ancient mystery to escape a long-forgotten cybercity and find the way home. Stray is a third-person cat adventure game set amidst the detailed neon-lit alleys of a decaying cybercity and the murky environments of its seedy underbelly.  See the world through the eyes of a stray and interact with the environment in playful ways. Stray is developed by BlueTwelve Studio, a small team from south of France mostly made of cats and a handful of humans.\r… Expand"}, {"name": "Crackdown", "details_link": "https://www.metacritic.com/game/xbox-360/crackdown", "publisher": "Microsoft Game Studios", "release_date": "Feb 20 2007", "developers": ["Realtime Worlds"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Action Adventure", "Shooter", "Shooter", "Open-World", "Third-Person", "Sci-Fi", "Sci-Fi"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a347d5d51835e1dfa87cecadd82b19cd-98.jpg", "descriptions": "Enforce justice by any means necessary in a crime-ridden urban center built to encourage the exploration of the full width, depth, and height of the city. Coupled with co-op gameplay, a first for the genre, and an interactive world where nearly anything can be used as a weapon, create aEnforce justice by any means necessary in a crime-ridden urban center built to encourage the exploration of the full width, depth, and height of the city. Coupled with co-op gameplay, a first for the genre, and an interactive world where nearly anything can be used as a weapon, create a volatile cocktail of action as you clean up the streets. All strategies and tactics are acceptable provided you reclaim the streets by unleashing the awesome potential inside each Agent. As you develop and hone your gameplay skills, your Agent's genetic tendencies will increase. Run at dazzling speeds, take death-defying leaps, perform impossible vehicular maneuvers, move massive objects, and deliver bone-crushing blows. Low on ammo? No problem. Thanks to an amazing amount of props and a deep physics system, use whatever you can get your hands on as weapons—trashcans, vehicles, even people—to clean the streets of crime. From its initial concept to its final design, Real Time Worlds focused on delivering dynamic, engaging, cooperative gameplay for double the carnage, action, and intensity. Wage war on the syndicates by taking part in high-octane chases on foot and on wheels while using any appropriate route along, around, across, over, under, or through the environment. [Microsoft]… Expand"}, {"name": "Observer: System Redux", "details_link": "https://www.metacritic.com/game/pc/observer-system-redux", "publisher": "Bloober Team", "release_date": "Nov 10 2020", "developers": ["Bloober Team"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/0f459ca379d484a90940f470bc1a827e-98.jpg", "descriptions": "The year is 2084. In a dark cyberpunk world shattered by plagues and wars, become a neural police detective and hack into the jagged minds of others. Make use of anything they felt, thought, or remembered to solve the case and catch the elusive killer."}, {"name": "EverQuest II", "details_link": "https://www.metacritic.com/game/pc/everquest-ii", "publisher": "Sony Online Entertainment", "release_date": "Nov  8 2004", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/effcf51dc441812fa560a7a20a7c451e-98.jpg", "descriptions": "EverQuest II is a parallel online universe to the hugely successful gaming phenomenon EverQuest. Featuring breathtaking graphics and a vast, beautiful game world to explore, EverQuest II sets new standards in graphical realism as players are immersed in the game's epic storyline withEverQuest II is a parallel online universe to the hugely successful gaming phenomenon EverQuest. Featuring breathtaking graphics and a vast, beautiful game world to explore, EverQuest II sets new standards in graphical realism as players are immersed in the game's epic storyline with thousands of other players online. Massive World of Norrath -- Regions, cities, countless dungeons and dynamically created zones. Easy to Play -- New user friendly game mechanics with reduced learning curve for both new and seasoned players. 16 Races, 100 Levels and 48 Classes -- Branching systems allow you to choose your class as you advance. Existing EverQuest Player Incentives -- Exclusive crossover quest zones, chat system and more! [Sony Online Entertainment]… Expand"}, {"name": "Yakuza 6: The Song of Life", "details_link": "https://www.metacritic.com/game/playstation-4/yakuza-6-the-song-of-life", "publisher": "Sega", "release_date": "Apr 17 2018", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/b120e14e6630f16003349752f23b2bc5-98.jpg", "descriptions": "In Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family -- be those ties through blood or bond -- when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, anIn Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family -- be those ties through blood or bond -- when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, an older and weathered Kiryu comes to find out that his surrogate daughter, Haruka, has gone missing from the orphanage he looks after. The trail leads him to his old stomping grounds in Kamurocho, where he discovers that she has been struck by a car and now lies in a coma. To make matters worse, Kiryu learns that Haruka now has a son that he must look after. With baby in hand, Kiryu journeys to the seaside town of Onomichi, Hiroshima to unravel the truth about Haruka, her son, and a sinister secret that the Hiroshima yakuza are harbouring. From the unparalleled realism of the new setting of Onomichi, a beautiful, sleepy port town in Hiroshima Prefecture, to the latest evolution of Kamurocho, the biggest red-light district in Tokyo, Yakuza 6 is the ultimate iteration the game's blend of gritty crime story, hyper-explosive combat, and all the vices and distractions those locales have to offer.… Expand"}, {"name": "Call of Duty 3", "details_link": "https://www.metacritic.com/game/xbox/call-of-duty-3", "publisher": "Activision", "release_date": "Nov  7 2006", "developers": ["Treyarch"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/7a7059e6312ab6d80894bf7bb8644bad-98.jpg", "descriptions": "Call of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout. Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle andCall of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout. Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle and breathtaking action of the Allied offensive that changed the fate of the world.… Expand"}, {"name": "UFC Undisputed 2009", "details_link": "https://www.metacritic.com/game/xbox-360/ufc-undisputed-2009", "publisher": "THQ", "release_date": "May 19 2009", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/10e955d5d5a198bbad782b6d88dce74b-98.jpg", "descriptions": "UFC 2009 Undisputed is an explosive fighting game that details the action, intensity and attitude of a UFC live event. Players explore a deep roster of more than 80 top fighters in UFC competition across all five weight classes. In addition, they enter the Octagon surrounded by the sport’sUFC 2009 Undisputed is an explosive fighting game that details the action, intensity and attitude of a UFC live event. Players explore a deep roster of more than 80 top fighters in UFC competition across all five weight classes. In addition, they enter the Octagon surrounded by the sport’s popular commentators, announcers, referees, trainers, Octagon girls and more. Photorealistic models are at the forefront, as players view amazing ripple effects across the faces and bodies of their fighters from the impact of devastating punches and kicks. A brand new fighting game engine designed specifically for next generation systems delivers innovative, responsive and easy-to-play controls that give unparalleled command of fighters, as players take down opponents with a variety of mixed martial arts disciplines like Muay Thai, Kickboxing and Brazilian Jiu-Jitsu. In addition, the game’s Create-A-Fighter system jumpstarts the careers of future champions through character customization and training management, while a robust Career Mode develops a fighter's attributes and skill sets while fighting to enter the UFC Hall of Fame through a series of dynamic storylines. Furthermore, players can enhance their UFC 2009 Undisputed gameplay experience through online support, including downloadable content. [THQ]… Expand"}, {"name": "Fable: The Lost Chapters", "details_link": "https://www.metacritic.com/game/xbox/fable-the-lost-chapters", "publisher": "Microsoft Game Studios", "release_date": "Oct 18 2005", "developers": ["Lionhead Studios"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/c0c6f1c5336b3e67b0940d5fa755af28-98.jpg", "descriptions": "In this role-playing adventure game from Lionhead Studios, every action determines a character's skills, appearance and morality. A character's life story is created from childhood through adulthood and on to old age. One can grow from an inexperienced child into the most powerful being inIn this role-playing adventure game from Lionhead Studios, every action determines a character's skills, appearance and morality. A character's life story is created from childhood through adulthood and on to old age. One can grow from an inexperienced child into the most powerful being in the world, spoken of by all and immortalized in legend. As additional story and side quests await, so too does the path of righteousness, as well as the life of evil. With every choice, a character transforms into a reflection of his actions and decisions. Age leaves characters wizened and battle leaves characters scarred in the world of Fable: The Lost Chapters.… Expand"}, {"name": "NBA 2K19", "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k19", "publisher": "2K Games", "release_date": "Sep  7 2018", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Arcade", "Sim"], "meta_score": 83, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/9/5cda27cfe1415d4e9fae1290a02cf8ad-98.jpg", "descriptions": "NBA 2K celebrates 20 years of redefining what sports gaming can be, from best in class graphics & gameplay to groundbreaking game modes and an immersive open-world \"Neighborhood.\" NBA 2K19 promises to push limits as it brings gaming one step closer to real-life basketball excitement and culture."}, {"name": "Terraria", "details_link": "https://www.metacritic.com/game/pc/terraria", "publisher": "Re-Logic", "release_date": "May 16 2011", "developers": ["Re-Logic"], "platforms": ["3DS", "iPhone/iPad", "iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Sandbox", "2D", "2D"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/e282af69f94513f4c7f62b8f040731d5-98.jpg", "descriptions": "Terraria offers players a chance to be an action gamer, master builder, a collector, and even an explorer."}, {"name": "Little Nightmares II", "details_link": "https://www.metacritic.com/game/pc/little-nightmares-ii", "publisher": "Bandai Namco Games", "release_date": "Feb 11 2021", "developers": ["Tarsier Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/3a27fd656a6e11d817fe51423d65d66f-98.jpg", "descriptions": "Little Nightmares II is a suspense-adventure game in which you play as Mono, a young boy trapped in a world that has been distorted by a mysterious transmission from a distant signal tower. With Six, the girl in a yellow raincoat, Mono sets out to discover the dark secrets of The SignalLittle Nightmares II is a suspense-adventure game in which you play as Mono, a young boy trapped in a world that has been distorted by a mysterious transmission from a distant signal tower. With Six, the girl in a yellow raincoat, Mono sets out to discover the dark secrets of The Signal Tower and save Six from her terrible fate; but their journey will not be easy as Mono and Six will face an array of new threats from the terrible residents of this world. Will you dare face this collection of new, little nightmares? PLAY A DARK, THRILLING, SUSPENSE ADVENTURE: A host of brand-new residents lie in wait to haunt your steps and disturb your sleep. Outsmart the sadistic teacher, survive the bloodthirsty hunter and flee from many more terrifying characters, as Mono and Six journey through this world together. DISCOVER A FANTASTICAL WORLD CORRUPTED BY THE SIGNAL TOWER: Escape a world that’s rotten from the inside. Your journey will take you from creepy woodlands to sinister schools on your way to the dreadful Signal Tower. Find the source of the evil that spreads through the TV screens of the world. AWAKEN YOUR INNER CHILD TO SAVE SIX FROM THE DARKNESS: Six is fading from this world, and her only hope is to journey with Mono to find what has afflicted her from the Signal Tower. In this world of unknown terrors, you are her only beacon of hope. Can you gather up the courage to fend off your tormenters, and work with Six to make sense of The Signal Tower? … Expand"}, {"name": "Madden NFL 09", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-09", "publisher": "Electronic Arts", "release_date": "Aug 12 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 83, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/56525cdbb83e7bddeb04aa388186e39e-98.jpg", "descriptions": "For passionate Madden NFL fans, this year's iteration promises to take authenticity and depth of gameplay to an entirely new level with more than 85 new features and enhancements, including the all-new Virtual Trainer tutorial mode. Utilizing a holographic environment, this mode teachesFor passionate Madden NFL fans, this year's iteration promises to take authenticity and depth of gameplay to an entirely new level with more than 85 new features and enhancements, including the all-new Virtual Trainer tutorial mode. Utilizing a holographic environment, this mode teaches gamers simple concepts about playing football and how to use the controls in quick, fun and stylized drills. In Madden NFL 09, the game engine is continually assessing the player's performance and adapst a custom experience to every type of gamer, from newcomer to the veteran Madden NFL player. Madden NFL 09 also features a network-inspired broadcast presentation. Players benefit from the authentic football knowledge of an in-booth play-by-play and color commentary team featuring Cris Collinsworth and Tom Hammond. In addition, numerous graphical enhancements have been made, including realistic weather and grass, sleeker player models and exterior stadium views. Madden NFL 09 gives gamers the ability to create online leagues. Avid Madden NFL fans can now take their rivalries online and compete in leagues with up to 32 teams. Online league play features in-depth stat tracking, player trades and a flexible scheduling option. [Electronic Arts]… Expand"}, {"name": "Destiny 2", "details_link": "https://www.metacritic.com/game/pc/destiny-2", "publisher": "Activision", "release_date": "Oct 24 2017", "developers": ["Bungie Software", "Bungie"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 83, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/a66ffa712c756bfbd7ec9d3891728f58-98.jpg", "descriptions": "In Destiny 2, the last safe city on Earth has fallen and lays in ruins, occupied by a powerful new enemy and his elite army, the Red Legion. Every player creates his own character called a “Guardian,” humanity’s chosen protectors.  As a Guardian in Destiny 2, players must master newIn Destiny 2, the last safe city on Earth has fallen and lays in ruins, occupied by a powerful new enemy and his elite army, the Red Legion. Every player creates his own character called a “Guardian,” humanity’s chosen protectors.  As a Guardian in Destiny 2, players must master new abilities and weapons to reunite the city’s forces, stand together and fight back to reclaim their home. In Destiny 2 players embark on a fresh story filled with new destinations around our solar system to explore, and an expansive amount of activities to discover.  There is something for almost every type of gamer in Destiny 2, including gameplay for solo, cooperative and competitive players set within a vast, evolving and exciting universe. [Bungie]… Expand"}, {"name": "Final Fantasy XIV Online: A Realm Reborn", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xiv-online-a-realm-reborn", "publisher": "Square Enix", "release_date": "Aug 27 2013", "developers": ["Square Enix"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation 5", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/c840a3dd51d7c0c3bbf0dce360f09766-98.jpg", "descriptions": "Previously referenced as \"version 2.0,\" this title has been rebuilt from the ground up, and centers on the core concept of rebirth, featuring a new world to explore and storyline to experience."}, {"name": "MLB 06: The Show", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-06-the-show", "publisher": "SCEA", "release_date": "Feb 28 2006", "developers": ["SCEA San Diego Studios"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/881b0bc2fac8aaebcdb87f1abcc40f16-98.jpg", "descriptions": "MLB' 06: The Show reports to camp with the new Game Time Decisions feature, bringing more depth to Franchise and Season Modes by providing scenarios in which users will need to take full control of their team and decide which players to place in the line up at critical times. Additionally,MLB' 06: The Show reports to camp with the new Game Time Decisions feature, bringing more depth to Franchise and Season Modes by providing scenarios in which users will need to take full control of their team and decide which players to place in the line up at critical times. Additionally, the new 40-Man Roster feature offers the ability to take full control of a team's roster and manage all 40 players for each and every game. For a complete package of online options, MLB'06: The Show now offers head-to-head gameplay for both King of the Diamond and Rivalry Mode to go along with 32-team tournaments, live sports tickers, downloadable rosters, instant messaging and more. Additionally, the implementation of a new online news service provides users with MLB updates on news and events from around the league or their favorite team. Returning gameplay favorites include, Release Point Pitching, the Pitching Confidence Meter, Guess Pitch, EyeToy functionality, and Career Mode with the all-new Career Spotlight feature that underscores accomplishments and showcases them in the limelight. [SCEA]… Expand"}, {"name": "Magic: Duels of the Planeswalkers 2014", "details_link": "https://www.metacritic.com/game/xbox-360/magic-duels-of-the-planeswalkers-2014", "publisher": "Microsoft Game Studios", "release_date": "Jun 26 2013", "developers": ["Stainless Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 83, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/3a3333d61d2c874f9c02a734b0895d2a-98.jpg", "descriptions": "Available on the Android platform for the first time ever in addition to iPad, Xbox LIVE Arcade, Steam and PlayStation Network, Magic 2014 - Duels of the Planeswalkers will offer players exciting new features as they partner with Planeswalker Chandra Nalaar to track down a manipulative andAvailable on the Android platform for the first time ever in addition to iPad, Xbox LIVE Arcade, Steam and PlayStation Network, Magic 2014 - Duels of the Planeswalkers will offer players exciting new features as they partner with Planeswalker Chandra Nalaar to track down a manipulative and dangerous Planeswalker foe. An immersive storyline and strong integration with the Magic 2014 - Core Set ties the experience together for players, culminating in an end-of-summer Magic Celebration that brings all Magic fans together in stores across the world.… Expand"}, {"name": "Card Hunter (2013)", "details_link": "https://www.metacritic.com/game/pc/card-hunter-2013", "publisher": "Blue Manchu", "release_date": "Sep 12 2013", "developers": ["Blue Manchu"], "platforms": "PC", "genres": ["Strategy", "General"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/05a199bb7f78bdfc9a3f46dd45aef1f9-98.jpg", "descriptions": "Card Hunter is is an innovative new take on strategy gaming that lets its developers flex their turn-based gaming muscles in a way that they never could have as part of a bigger outfit."}, {"name": "Sam & Max: The Devil's Playhouse - Episode 2: The Tomb of Sammun-Mak", "details_link": "https://www.metacritic.com/game/pc/sam-max-the-devils-playhouse---episode-2-the-tomb-of-sammun-mak", "publisher": "Telltale Games", "release_date": "May 18 2010", "developers": ["Telltale Games"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "3D", "Compilation", "Third-Person"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/fc591830a7ec8cc0f24a4a1c04bcb480-98.jpg", "descriptions": "The new season Sam & Max: The Devil's Playhouse is the biggest, strangest and most epic to date. As the saga begins, an otherworldy power for controlling matter and space calls to the strongest and strangest who might wield it - intergalactic warlords and eldritch gods, under-dwellers andThe new season Sam & Max: The Devil's Playhouse is the biggest, strangest and most epic to date. As the saga begins, an otherworldy power for controlling matter and space calls to the strongest and strangest who might wield it - intergalactic warlords and eldritch gods, under-dwellers and scholars of the arcane. Gaming's greatest dog and rabbit sleuths Sam & Max seek the power's ancient secrets, as Max gains shape shifting, teleportation, mind reading and future vision abilities for battling these foes. The saga plays out in a surreal 5 month-long symphony of mayhem that gets deeper and more twisted with each episode. [Telltale Games]… Expand"}, {"name": "Madden NFL 17", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-17", "publisher": "EA Sports", "release_date": "Aug 23 2016", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 83, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/a5fd7115e08e8174e06dcef867e29d22-98.jpg", "descriptions": "Madden NFL 17 Franchise = Take your team all the way and put yourself at the center of your team’s Championship run in Franchise mode, delivering new ways to play and more decisions to make. Added features include the practice squad, full-player editing, and the in-game ticker that keeps youMadden NFL 17 Franchise = Take your team all the way and put yourself at the center of your team’s Championship run in Franchise mode, delivering new ways to play and more decisions to make. Added features include the practice squad, full-player editing, and the in-game ticker that keeps you updated with scores from around the league. Know your opponents’ tendencies every week, then pick the right drills to attack and counter those tendencies in game. This new level of strategy promises to deliver more variety and more fun when preparing for your next opponent, whether it’s a user or a computer simulated player. [Electronic Arts]… Expand"}, {"name": "Just Cause 2", "details_link": "https://www.metacritic.com/game/playstation-3/just-cause-2", "publisher": "Square Enix", "release_date": "Mar 23 2010", "developers": ["Avalanche Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/d9addcb6ffad77b8e98089b57221b6c8-98.jpg", "descriptions": "Developed by Avalanche Studios, Just Cause 2 finds Rico Rodriguez returning in an epic open-world adventure set in the diverse tropical playground of Panau in South East Asia, where the aim is to cause chaos and destruction in a way that only Rico knows how! His mission is to destabilize theDeveloped by Avalanche Studios, Just Cause 2 finds Rico Rodriguez returning in an epic open-world adventure set in the diverse tropical playground of Panau in South East Asia, where the aim is to cause chaos and destruction in a way that only Rico knows how! His mission is to destabilize the island and free it from the tyranny of the evil dictator, Baby Panay. Players tackle missions and objectives in any way they want while exploring the highly-detailed and beautiful island by land, sea or air, performing an insane range of new daredevil stunts and mastering the use of the all new grappling hook and Rico's trademark parachute. [Eidos Interactive]… Expand"}, {"name": "Picross DS", "details_link": "https://www.metacritic.com/game/ds/picross-ds", "publisher": "Nintendo", "release_date": "Jul 30 2007", "developers": ["Jupiter Corporation"], "platforms": "DS", "num_players": "5  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/8289a8286c16d40a4da646dd79da56a1-98.jpg", "descriptions": "Like finding the underlining 'picture' in a 'crossword puzzle', the goal in Picross DS is to fill a grid with squares and crosses in order to 'paint' a picture. Numbers at the head of the puzzles' columns and rows signify how the grids need to be filled out, but it will take a sharp mind toLike finding the underlining 'picture' in a 'crossword puzzle', the goal in Picross DS is to fill a grid with squares and crosses in order to 'paint' a picture. Numbers at the head of the puzzles' columns and rows signify how the grids need to be filled out, but it will take a sharp mind to figure out the solution - and some speedy fingers to defeat the competition. The game's main Picross Mode offers a staggering 300 puzzles available to play at your leisure. Ranging from the elementary five by five grids to highly complicated twenty by twenty grids, this mode can keep even the most hardened gamers happy. Those less certain of their skills can opt to receive clues to help finish puzzles, or get a head start with a roulette-style hint function that reveals one line of the puzzle. Bring your individual talents to the table with My Picross Mode, in which you can create your very own puzzles to share with your friends (locally, or via Nintendo Wi-Fi Connection). Designing your own puzzles is simplicity itself thanks to the easy-to-use stylus and Touch Screen. For that extra personal flair, you can even design the image beneath the puzzle which is revealed upon completion. A variety of unlockable skins - with themes ranging from nature to sports or video game heroes – give you all the customisation tools you’ll need to make Picross DS fit your style. [Nintendo Europe]… Expand"}, {"name": "Fight Night Round 3", "details_link": "https://www.metacritic.com/game/playstation-3/fight-night-round-3", "publisher": "EA Sports", "release_date": "Dec  5 2006", "developers": ["EA Chicago"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/c636e1015194978ea7a2378205a58d6a-98.jpg", "descriptions": "Go toe-to-toe with greats such as Ali, De La Hoya, Joe Frazier, Bernard Hopkins and Roy Jones. Outside of the ring, gamers can establish intense rivalries through pre-fight events putting purpose and passion behind every hit. Three new Impact Punches a la the EA Sports Haymaker keep gamersGo toe-to-toe with greats such as Ali, De La Hoya, Joe Frazier, Bernard Hopkins and Roy Jones. Outside of the ring, gamers can establish intense rivalries through pre-fight events putting purpose and passion behind every hit. Three new Impact Punches a la the EA Sports Haymaker keep gamers at the edge of their seat as players are only one punch away from the entire dynamic of the fight changing. Land a perfectly timed Flash KO or jump into a quick mid-fight mini-game to land a humiliating knockdown punch. Thrown using EA Sports Fight Night's innovative analog punch system, Impact Punches are high risk and high reward - put down your opponent or get knocked on the canvas. Boxing's Greatest Rivalries - Watch ESPN Classic footage of real-life bouts or re-create the greatest fights from past and present including Arturo Gatti vs. Mickey Ward, Marco Antonio Barrera vs. Eric Morales, and Ali vs. Frasier. Establish intense rivalries of your own by intimidating opponents before the big fight with heated press conferences full of hype, trash talkin', and fights at weigh-ins. Relive the best rivalries of your career in ESPN's Instant Classics! Create a style of your own, then see how you match up against the authentic signature styles from the world's best fighters. Licensed boxers use tactics and strategies that match their real life counterparts. Self Determinant AI adapts its style to match user strengths and to exploit weaknesses. The PlayStation 3 version showcases a unique gameplay feature set including an exclusive new mode called \"Get in the Ring\" that continues to cement this title as the king of the virtual ring. [Electronic Arts]… Expand"}, {"name": "Spider-Man 2", "details_link": "https://www.metacritic.com/game/xbox/spider-man-2", "publisher": "Activision", "release_date": "Jun 28 2004", "developers": ["Treyarch"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/c4818dc83ba2dae325cc977b48cbcbb7-98.jpg", "descriptions": "The city is at risk, and only you can save it from the evil clutches of an old enemy--the powerful Electro. He has a mysterious new device that makes his million volts of destruction even deadlier. But now Spider-Man has Insulated Armor, which makes him impervious to electricity, in additionThe city is at risk, and only you can save it from the evil clutches of an old enemy--the powerful Electro. He has a mysterious new device that makes his million volts of destruction even deadlier. But now Spider-Man has Insulated Armor, which makes him impervious to electricity, in addition to new powers such as Ice and Taser-Webbing. With your new bag of tricks, you can stop Electro, Sandman, and other villains' nefarious schemes to bring the city to its knees. … Expand"}, {"name": "Anno 1800 Console Edition", "details_link": "https://www.metacritic.com/game/playstation-5/anno-1800-console-edition", "publisher": "Ubisoft", "release_date": "Mar 16 2023", "developers": ["Ubisoft Blue Byte"], "platforms": ["Xbox Series X", "PlayStation 5"], "num_players": "Up to 16 ", "genres": ["Strategy", "Management", "Government"], "meta_score": 83, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/3a35c7e5de7394d3151d2d585bfa7631-98.jpg", "descriptions": "Welcome to the 19th century, a time of industrialization, diplomacy, and discovery.Rich with technological innovations, conspiracies, and changing allegiances, this era presents the perfect setting for classic Anno gameplay. Anno 1800 provides players ample opportunity to prove theirWelcome to the 19th century, a time of industrialization, diplomacy, and discovery.Rich with technological innovations, conspiracies, and changing allegiances, this era presents the perfect setting for classic Anno gameplay. Anno 1800 provides players ample opportunity to prove their skills as a ruler as they create huge metropolises, plan efficient logistic networks, settle an exotic new continent, send out expeditions around the globe, and dominate their opponents by diplomacy, trade, or warfare.… Expand"}, {"name": "Labyrinth of Galleria: The Moon Society", "details_link": "https://www.metacritic.com/game/switch/labyrinth-of-galleria-the-moon-society", "publisher": "NIS America", "release_date": "Feb 14 2023", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/3ab1e9a3367da2e2494f6550b5ae6f37-98.jpg", "descriptions": "From the creators of Labyrinth of Refrain: Coven of Dusk comes a new tale in the dungeon-exploring adventure filled with charm and mystery!Aided by the master witch Madame Marta, her assistant Eureka, and an army of soul-infused puppets, you are tasked with delving into the depths of aFrom the creators of Labyrinth of Refrain: Coven of Dusk comes a new tale in the dungeon-exploring adventure filled with charm and mystery!Aided by the master witch Madame Marta, her assistant Eureka, and an army of soul-infused puppets, you are tasked with delving into the depths of a mysterious underground labyrinth teeming with enchanted monsters to unearth the treasures and secrets within.… Expand"}, {"name": "Knockout City", "details_link": "https://www.metacritic.com/game/switch/knockout-city", "publisher": "Electronic Arts", "release_date": "May 21 2021", "developers": ["Velan Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Sports", "General", "Team", "Other"], "meta_score": 83, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/18b0f986db668e9d8ba27c8074519ce4-98.jpg", "descriptions": "Rule the city through lightning-fast multiplayer matches featuring mind-blowing dodgeball mechanics. Increase your attack by passing to power up dodgeballs, targeting your opponents with a variety of specialized balls, or “balling up” at any time to get thrown by teammates. Assemble anRule the city through lightning-fast multiplayer matches featuring mind-blowing dodgeball mechanics. Increase your attack by passing to power up dodgeballs, targeting your opponents with a variety of specialized balls, or “balling up” at any time to get thrown by teammates. Assemble an All-Star dodgeball Crew with your friends for multiplayer matches in a seamless cross-play experience! Together, knock out opponents in 3v3, 4v4, or free-for-all matches. Pass, throw, and strategize to dominate as a team and unlock distinctive, Crew-only rewards. [Electronic Arts]… Expand"}, {"name": "Knights and Bikes", "details_link": "https://www.metacritic.com/game/switch/knights-and-bikes", "publisher": "Double Fine Productions", "release_date": "Feb  6 2020", "developers": ["Foam Sword Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/1dd8fab7067e49fe7d63cd5e49496e84-98.jpg", "descriptions": "Knights And Bikes is a hand-painted action-adventure for 1 or 2 players, set on a British island in the 1980s. It's a coming-of-age story starring Nessa & Demelza, exploring the coasts of Penfurzy on their trusty bikes, looking for a legendary lost treasure in a Goonies-inspired tale ofKnights And Bikes is a hand-painted action-adventure for 1 or 2 players, set on a British island in the 1980s. It's a coming-of-age story starring Nessa & Demelza, exploring the coasts of Penfurzy on their trusty bikes, looking for a legendary lost treasure in a Goonies-inspired tale of excitement, danger, fun and friendship.The two new friends, along with their pet-goose and the pickled-head of an undead knight, form the Penfurzy Rebel Bicycle Club, and are ready for anything this adventure throws at them. They pedal into danger to face threats head-on with frisbees, water-balloons, video game controllers and the powerful beats of an amplified boom-box.Along the way they'll stuff their pockets with trinkets and barter for bike upgrades, spurring them onward down the island's country lanes, windswept beaches, deep forests, modern attractions and ancient ruins. Together their friendship will create an adventure as big as their imaginations.… Expand"}, {"name": "Shovel Knight: King of Cards", "details_link": "https://www.metacritic.com/game/switch/shovel-knight-king-of-cards", "publisher": "Yacht Club Games", "release_date": "Dec 10 2019", "developers": ["Yacht Club Games"], "platforms": ["3DS", "PC", "PlayStation Vita", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/54b55d602b8925c1cb063aa7216046ef-98.jpg", "descriptions": "Play as King Knight, the gilded goon himself, as he travels through 4 new worlds and more than 30 all new courses, on a journey to best the Three Kings who rule over the land. With a high flying spin and a boisterous bash, he can crash through all who would dare stand in his way."}, {"name": "Battle Chef Brigade", "details_link": "https://www.metacritic.com/game/playstation-4/battle-chef-brigade", "publisher": "Adult Swim", "release_date": "Aug 28 2018", "developers": ["Trinket Studios"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b711c15981b162c328e4d23c35046157-98.jpg", "descriptions": "Vive la Brigade!Welcome to Victusia, where the members of the elite Battle Chef Brigade are revered for their ability to skillfully take down monsters and transform their kills into delicious cuisine! But getting in isn't easy; chefs from across Victusia must vie for their spot in a highVive la Brigade!Welcome to Victusia, where the members of the elite Battle Chef Brigade are revered for their ability to skillfully take down monsters and transform their kills into delicious cuisine! But getting in isn't easy; chefs from across Victusia must vie for their spot in a high stakes competition. Follow two contestants, Mina and Thrash, as their journeys through the tournament unfold. In order to become a Brigadier you'll need to hunt monsters with combo-based attacks and prepare your freshly-caught ingredients in puzzle-based cooking challenges to serve up winning dishes to the judges all while the round clock ticks down.An \"Extra Helping\" of FeaturesPlay as two chefs, brought to life with colorful illustrations and VO, in a charming campaign that's equal parts old school brawler and combo puzzling, with a light sprinkling of RPG progression on top. Welcome Ziggy, the Undead Necromancer Chef, now playable in Local Multiplayer, Break the Dishes, Survival, and Free Play. If that's not enough for you, test your might against fellow Brigadiers with the addition of Local Multiplayer! Play as Mina, Thrash, and even Ziggy in an epic battle where YOU make all the rules. Who will come out on top?Extra Modes that test your cooking prowess including: Daily Cook-Off, Restaurant Rush, Break the Dishes, and the BRAND NEW Survival Mode leaderboards where you can show off your culinary creations.Hone your skills in a BRAND NEW Free Play Mode and find the ultimate cooking combination.Collect and enjoy the brilliant illustrations of Battle Chef Brigade in the BRAND NEW Art Gallery.… Expand"}, {"name": "The Banner Saga 3", "details_link": "https://www.metacritic.com/game/switch/the-banner-saga-3", "publisher": "Versus Evil", "release_date": "Jul 26 2018", "developers": ["Stoic"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/b0e0ccd9a80bf81fbafa31a555293e7c-98.jpg", "descriptions": "Banner Saga 3 is the final dramatic chapter in the mature, story driven Viking RPG series which has won over 20 awards and has been nominated for 4 BAFTA awards. As the world continues to crumble around you, who can you trust, how will you protect your allies and what choices will you makeBanner Saga 3 is the final dramatic chapter in the mature, story driven Viking RPG series which has won over 20 awards and has been nominated for 4 BAFTA awards. As the world continues to crumble around you, who can you trust, how will you protect your allies and what choices will you make as the Darkness draws near? Witness the Banner Saga as you've never seen it before as a dark force takes over and effects everything you've come to know in the beautifully hand-painted finale of the trilogy. Choose new playable characters to join your party, including dredge heroes! Take advantage of new upgrade options as they progress in battle. … Expand"}, {"name": "Steins;Gate", "details_link": "https://www.metacritic.com/game/playstation-3/steinsgate", "publisher": "5pb", "release_date": "Jun  5 2015", "developers": ["Nitro+"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/45a407b1849771d38e05c04bfaeb0c71-98.jpg", "descriptions": "Okabe Rintaro -- aka Okarin -- is an eccentric college student who dreams of conspiracy and chaos. Adopting the persona of a mad scientist, he spends his time developing oddball gadgets with his friends in their makeshift laboratory.\r One day, they accidentally discover that one of theirOkabe Rintaro -- aka Okarin -- is an eccentric college student who dreams of conspiracy and chaos. Adopting the persona of a mad scientist, he spends his time developing oddball gadgets with his friends in their makeshift laboratory.\r One day, they accidentally discover that one of their inventions can send emails into the past. In other words, they have created a time machine.\r SERN, John Titor, the IBN 5100, the Butterfly Effect, and the 11 theories of time travel -- when chance brings these elements together in Akihabara, Japan, the fate of the world hangs in the balance.\r What will Okarin choose when he holds the future in his hands?… Expand"}, {"name": "SteamWorld Dig", "details_link": "https://www.metacritic.com/game/xbox-one/steamworld-dig", "publisher": "Image & Form", "release_date": "Jun  5 2015", "developers": ["Image & Form"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox One"], "genres": ["Action", "Action Adventure", "General", "Platformer", "2D", ""], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/c13bc8d804b318e40599f72e2881628a-98.jpg", "descriptions": "The clock has stopped around the turn of the 19th century, and humankind has prematurely blown itself to bits. The remaining scraps are huddling in caves beneath the surface, and steam-powered robots have taken over the Wild West."}, {"name": "Oddworld: Stranger's Wrath HD", "details_link": "https://www.metacritic.com/game/playstation-vita/oddworld-strangers-wrath-hd", "publisher": "Oddworld Inhabitants", "release_date": "Dec 18 2012", "developers": ["Just Add Water"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "PlayStation Vita"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/d1bd36d6d4981cce50288001e0377971-98.jpg", "descriptions": "The Fabled Oddworld Series Makes its Return in High Definition in Oddworld: Stranger's Wrath HD."}, {"name": "NHL 13", "details_link": "https://www.metacritic.com/game/xbox-360/nhl-13", "publisher": "Electronic Arts", "release_date": "Sep 11 2012", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 83, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/4d8a46807723962482c543c2e2f05a55-98.jpg", "descriptions": "NHL 13 promises to deliver a revamped gameplay experience that accurately captures the speed, creativity and strategy of today’s NHL headlined by all-new True Performance Skating, and supported by EA SPORTS Hockey I.Q. NHL 13 also promises to deliver new experiences that connect hockey fansNHL 13 promises to deliver a revamped gameplay experience that accurately captures the speed, creativity and strategy of today’s NHL headlined by all-new True Performance Skating, and supported by EA SPORTS Hockey I.Q. NHL 13 also promises to deliver new experiences that connect hockey fans to their friends and the real world of hockey with the all-new GM Connected and NHL Moments Live game modes.… Expand"}, {"name": "Madden NFL 13", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-13", "publisher": "EA Sports", "release_date": "Aug 28 2012", "developers": ["EA Tiburon"], "platforms": ["PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 83, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/04006a36d1826633cae6e8cad862dbbb-98.jpg", "descriptions": "Powered by the all-new Infinity Engine, true player impact and authentic momentum transfer ensure that no two plays ever look or feel the same. Connected Careers is a new and fully connected universe defined by deep gameplay, unique storylines and social integration."}, {"name": "Fallout: New Vegas - Old World Blues", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-new-vegas---old-world-blues", "publisher": "Bethesda Softworks", "release_date": "Jul 19 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/d26b6717bb03a53de7476fa93e1709e6-98.jpg", "descriptions": "In Old World Blues, releasing in June, you will discover how some of the Mojave’s mutated monsters came to be when you unwittingly become a lab rat in a science experiment gone awry. You’ll need to scour the Pre-War research centers of the Big Empty in search of technology to turn the tablesIn Old World Blues, releasing in June, you will discover how some of the Mojave’s mutated monsters came to be when you unwittingly become a lab rat in a science experiment gone awry. You’ll need to scour the Pre-War research centers of the Big Empty in search of technology to turn the tables on your kidnappers or join forces with them against an even greater threat.… Expand"}, {"name": "Darksiders", "details_link": "https://www.metacritic.com/game/pc/darksiders", "publisher": "THQ", "release_date": "Sep 23 2010", "developers": ["Vigil Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Fantasy", "Modern", "Open-World"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/2f12183dbb957949152d6199c12d1de7-98.jpg", "descriptions": "The time for the great Apocalypse of legend has come in Darksiders as you take on the role of War, one of the four Horsemen of the Apocalypse, and rain judgment and destruction down upon the Earth. However, not all is as it seems when you discover that you and your fellow Horsemen have beenThe time for the great Apocalypse of legend has come in Darksiders as you take on the role of War, one of the four Horsemen of the Apocalypse, and rain judgment and destruction down upon the Earth. However, not all is as it seems when you discover that you and your fellow Horsemen have been implicated for the premature destruction of Earth and are swept up in a conspiracy between the forces of Heaven and Hell. Banished and stripped of your powers, embark on an epic quest of revenge and redemption as you battle angels and demons to restore your awesome abilities and seek out who betrayed you.… Expand"}, {"name": "Clubhouse Games", "details_link": "https://www.metacritic.com/game/ds/clubhouse-games", "publisher": "Nintendo", "release_date": "Oct  9 2006", "developers": ["Agenda"], "platforms": "DS", "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game", "Party / Minigame"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/0d1ea3a3fd4a402a6481612a344ea528-98.jpg", "descriptions": "(Known in the UK/EU as \"42 All-Time Classics\") It's game night and everyone’s invited. Play more than 20 classic board, card and party games alone, with friends or via Nintendo Wi-Fi Connection. With familiar favorites like checkers, darts and poker, Clubhouse Games is for everyone and part(Known in the UK/EU as \"42 All-Time Classics\") It's game night and everyone’s invited. Play more than 20 classic board, card and party games alone, with friends or via Nintendo Wi-Fi Connection. With familiar favorites like checkers, darts and poker, Clubhouse Games is for everyone and part of the Touch Generations library. Video game newcomers will appreciate the easy-to-use interface. Players can challenge up to seven friends with one game card via Multi-Card Play or DS Download Play. Can't play checkers without shouting \"KING ME!\" across the table? The in-game (PictoChat-like) feature takes table talk to a new level. There's no need to lug around cards or boards when you want to play a quick game. Clubhouse Games is one-stop gaming that will appeal to everyone's tastes, whether they’re in the mood for bowling, backgammon, bridge or billiards. [Nintendo]… Expand"}, {"name": "Super Puzzle Fighter II", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-puzzle-fighter-ii", "publisher": "Capcom", "release_date": "Mar 31 2003", "developers": ["Atomic Planet Entertainment"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/f7dafb44bc510c32aaa509f913a527b5-98.jpg", "descriptions": "Hailed as the best puzzle game of all time, Super Puzzle Fighter is chock full of ferocious competition, pint-sized characters and non-stop high-energy insanity. Carefully stack the falling colored gems in strategic combinations.\rWhen the moment is right, use a crash gem to shatter yourHailed as the best puzzle game of all time, Super Puzzle Fighter is chock full of ferocious competition, pint-sized characters and non-stop high-energy insanity. Carefully stack the falling colored gems in strategic combinations.\rWhen the moment is right, use a crash gem to shatter your blocks. Watch your character execute a combo move and rain a volley of counter gems down on your opponent! Be the first to fill the other's screen with gems and K.O.!... you win!… Expand"}, {"name": "Tom Clancy's Rainbow Six 3: Raven Shield", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-3-raven-shield", "publisher": "Ubisoft", "release_date": "Mar 19 2003", "developers": ["Ubisoft Montreal"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/556612fb8c11acced6bed84efd4593e7-98.jpg", "descriptions": "Command an elite, multinational squad of special operatives against a hidden terrorist foe. In Raven Shield, the third installment to the wildly popular Rainbow Six series, RAINBOW races against time to stop terror and unravel a mystery. In locations around the world, from London to theCommand an elite, multinational squad of special operatives against a hidden terrorist foe. In Raven Shield, the third installment to the wildly popular Rainbow Six series, RAINBOW races against time to stop terror and unravel a mystery. In locations around the world, from London to the Caribbean to Rio de Janeiro, lead team RAINBOW in a desperate effort to battle a madman and foil his doomsday plot. Features 15 all-new single-player missions, 6 dedicated multiplayer maps. Built on next-generation Unreal technology for unequaled visual effects. 57 weapons with real-world accessories for endless customization. Real-world tactics and methods from Mike Grasso, Senior Instructor for LAPD SWAT and LAPD Medal of Valor winner. [Ubi Soft]… Expand"}, {"name": "Xenosaga Episode I: Der Wille zur Macht", "details_link": "https://www.metacritic.com/game/playstation-2/xenosaga-episode-i-der-wille-zur-macht", "publisher": "Namco", "release_date": "Feb 26 2003", "developers": ["Monolith Soft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/3ffbfb09a33460174bbf1e823c44f4bd-98.jpg", "descriptions": "Thousands of years into the future, man exists only in deep space. Brutally opposed by a merciless alien race, humanity faces an uncertain destiny as it unlocks the secrets of the Universe in search of the ultimate truth. Features four exhilarating mini-games, innovative battle and controlThousands of years into the future, man exists only in deep space. Brutally opposed by a merciless alien race, humanity faces an uncertain destiny as it unlocks the secrets of the Universe in search of the ultimate truth. Features four exhilarating mini-games, innovative battle and control systems, and over 80 hours of gameplay. [Namco]… Expand"}, {"name": "World of Outlaws: Sprint Cars", "details_link": "https://www.metacritic.com/game/pc/world-of-outlaws-sprint-cars", "publisher": "Atari", "release_date": "Feb 12 2003", "developers": ["Ratbag"], "platforms": "PC", "num_players": "1-10 ", "genres": ["Driving", "Racing", "Simulation", "Arcade", "Stock Car", "Other", "Automobile"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/a1201dd75b5ee2c6509248595d699012-98.jpg", "descriptions": "Hit speeds in excess of 170 mph. Powerslide around tight ovals. Compete in single races, a championship season, or an entire career. Featuring 24 official World of Outlaws drivers, 12 real tracks, jaw-dropping graphics, screaming 3D directional sound and car physics so real it will turn yourHit speeds in excess of 170 mph. Powerslide around tight ovals. Compete in single races, a championship season, or an entire career. Featuring 24 official World of Outlaws drivers, 12 real tracks, jaw-dropping graphics, screaming 3D directional sound and car physics so real it will turn your world upside down. Do you have what it takes to master the meanest machines on wheels? [Infogrames]… Expand"}, {"name": "Street Fighter Alpha 3", "details_link": "https://www.metacritic.com/game/game-boy-advance/street-fighter-alpha-3", "publisher": "Capcom", "release_date": "Dec  1 2002", "developers": ["Crawfish Interactive"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/91355378bbbaac648be185bc29b72e8e-98.jpg", "descriptions": "Capcom unleashes the biggest and brightest star in the Street Fighter® universe on the Game Boy® Advance system. Street Fighter Alpha 3 stars over 31 characters and is loaded with multiple modes of play, seamless animation and 3 different fighting styles for every character. StreetCapcom unleashes the biggest and brightest star in the Street Fighter® universe on the Game Boy® Advance system. Street Fighter Alpha 3 stars over 31 characters and is loaded with multiple modes of play, seamless animation and 3 different fighting styles for every character. Street Fighter Alpha 3 puts arcade fighting in the palm of your hand!… Expand"}, {"name": "Colin McRae Rally 2.0", "details_link": "https://www.metacritic.com/game/pc/colin-mcrae-rally-20", "publisher": "Codemasters", "release_date": "Feb 13 2001", "developers": ["Codemasters"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/cd9677a83c432ee72dc693bca3165027-98.jpg", "descriptions": "If you can work your way around its shortcomings, you'll find that Colin McRae Rally 2.0 is one of the most engrossing racing sims available."}, {"name": "Combat Flight Simulator 2: WWII Pacific Theater", "details_link": "https://www.metacritic.com/game/pc/combat-flight-simulator-2-wwii-pacific-theater", "publisher": "Microsoft Game Studios", "release_date": "Oct 13 2000", "developers": ["Microsoft Game Studios"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/865310de1814286c28fe3ee8bb32ddf0-98.jpg", "descriptions": "Takes you back in time with authentic aircraft, detailed cockpits, and spectacular scenery. Moving canopies, folding wings, battle-scarred paint, realistic aircraft damage, and last-second bailouts immerse you in a new level of combat flight simulation.  [Microsoft]"}, {"name": "Resistance 3", "details_link": "https://www.metacritic.com/game/playstation-3/resistance-3", "publisher": "SCEA", "release_date": "Sep  6 2011", "developers": ["Insomniac Games"], "platforms": "PlayStation 3", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Modern", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/587f2a060eb507f4ff32efde09810b20-98.jpg", "descriptions": "Set in a brutal, alternate 1950s universe, America has been successfully conquered and destroyed by the deadly Chimeran race, forcing the last remaining human survivors to seek refuge in hiding. Players must take on the role of Joseph Capelli, the last surviving Sentinel from a clandestineSet in a brutal, alternate 1950s universe, America has been successfully conquered and destroyed by the deadly Chimeran race, forcing the last remaining human survivors to seek refuge in hiding. Players must take on the role of Joseph Capelli, the last surviving Sentinel from a clandestine military program, as he comes out of hiding to journey across a land of ruin in a heroic fight for survival against the merciless Chimera. In addition to an epic single-player campaign, Resistance 3 will offer two-player online or split-screen co-op through the single-player campaign, and a new, focused progression-based multiplayer experience.… Expand"}, {"name": "Orcs Must Die! 2", "details_link": "https://www.metacritic.com/game/pc/orcs-must-die!-2", "publisher": "Robot Entertainment", "release_date": "Jul 30 2012", "developers": ["Robot Entertainment"], "platforms": "PC", "genres": ["Action", "Strategy", "General", "Real-Time", "General", "Defense"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/683b0831c737402fa9f407df9d2c7904-98.jpg", "descriptions": "Orcs Must Die! 2 begins days after the ending of the original game. With the rifts closed and the magical Order dead, the War Mage finds himself suddenly thrust into a new battle against the mindless orc mob. He has a powerful, if questionable, new companion in the Sorceress, an ex-War MageOrcs Must Die! 2 begins days after the ending of the original game. With the rifts closed and the magical Order dead, the War Mage finds himself suddenly thrust into a new battle against the mindless orc mob. He has a powerful, if questionable, new companion in the Sorceress, an ex-War Mage responsible for the destruction of the Order.… Expand"}, {"name": "Metro Redux", "details_link": "https://www.metacritic.com/game/playstation-4/metro-redux", "publisher": "Deep Silver", "release_date": "Aug 26 2014", "developers": ["4A Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Sci-Fi"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/79575f67985df17bb0d4cd25d56a5dc5-98.jpg", "descriptions": "Survive the horrors of the Russian apocalypse - equip your gasmask and an arsenal of hand-made weaponry as you face up to the threat of deadly mutants, human foes, and the terrifying environment itself. Immerse yourself in the Moscow Metro - and witness one of the most atmospheric worlds inSurvive the horrors of the Russian apocalypse - equip your gasmask and an arsenal of hand-made weaponry as you face up to the threat of deadly mutants, human foes, and the terrifying environment itself. Immerse yourself in the Moscow Metro - and witness one of the most atmospheric worlds in gaming brought to life with next-gen visuals at 60FPS.… Expand"}, {"name": "Octopath Traveler", "details_link": "https://www.metacritic.com/game/switch/octopath-traveler", "publisher": "Square Enix", "release_date": "Jul 12 2018", "developers": ["Square Enix", "Acquire"], "platforms": ["PC", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/c286b3ed64e4b4f12f7549993a0ed77c-98.jpg", "descriptions": "Embark on a vast new role-playing adventure as one of eight travelers, all with their own origins, paths, and goals. The producers of the Bravely series at Square Enix have brought a new world to life through a mix of CG, pixel art, and \"HD-2D\" visuals. Embark on a vast new role-playingEmbark on a vast new role-playing adventure as one of eight travelers, all with their own origins, paths, and goals. The producers of the Bravely series at Square Enix have brought a new world to life through a mix of CG, pixel art, and \"HD-2D\" visuals. Embark on a vast new role-playing adventure as one of eight travelers, all with their own origins, paths, and goals. Where to begin? Who to team up with? Where to go next? Only you can decide. Each traveler can use a distinct Path Action, a specialized way of achieving objectives and interacting with people you encounter. The warrior can \"challenge\" people to a duel, whereas the dancer can \"allure\" others to follow her, even into battle! Enjoy the freedom to choose your own path while experiencing the story through the role you play. Combat revolves around the Boost system, a fusion of traditional turn-based battling and modern enhancements. Each turn, build up BP that can be spent to dramatically increase your strength or provide aid. Identifying when to Boost may just be the key to victory.\r *    A new RPG adventure from the minds at Square Enix who brought you the Bravely series\r*    Choose from eight distinct characters, each with their own path, and see where the story takes you\r*    Music and visuals inspired by RPGs of yore, brought to life with modern touches\r  Deep, strategic turn-based combat with an innovative battle system\r*    Enjoy the free demo in Nintendo eShop and help make this an RPG for the ages by sharing your feedback with Square Enix… Expand"}, {"name": "BYE-BYE BOXBOY!", "details_link": "https://www.metacritic.com/game/3ds/bye-bye-boxboy!", "publisher": "Nintendo", "release_date": "Apr 12 2017", "developers": ["HAL Labs"], "platforms": "3DS", "genres": ["Puzzle", "Action"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/dbdc4b33f085bfa8bf5b0e0f6b4d01af-98.jpg", "descriptions": "Square off against the odds in BYE-BYE BOXBOY!, a 2D puzzle-platformer available exclusively from Nintendo eShop on Nintendo 3DS family systems. Join Qbby, a conundrum-solving cube, on an all-new adventure where you’ll need to box clever and ingeniously navigate your way through more thanSquare off against the odds in BYE-BYE BOXBOY!, a 2D puzzle-platformer available exclusively from Nintendo eShop on Nintendo 3DS family systems. Join Qbby, a conundrum-solving cube, on an all-new adventure where you’ll need to box clever and ingeniously navigate your way through more than 180 brainteasing levels. [Nintendo UK]… Expand"}, {"name": "Ratchet & Clank Collection", "details_link": "https://www.metacritic.com/game/playstation-3/ratchet-clank-collection", "publisher": "SCEA", "release_date": "Aug 28 2012", "developers": ["Idol Minds", "Insomniac Games"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Action", "Platformer", "3D", "Miscellaneous", "Compilation", "Compilation"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/c0d632dbaf08c539a8e6102f547ef0fd-98.jpg", "descriptions": "Also known as \"The Ratchet & Clank Trilogy\" - Ratchet & Clank Collection includes Ratchet & Clank, Ratchet & Clank: Going Commando, and Ratchet & Clank: Up Your Arsenal all remastered."}, {"name": "Hitman", "details_link": "https://www.metacritic.com/game/pc/hitman", "publisher": "Square Enix", "release_date": "Oct 31 2016", "developers": ["Io Interactive"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action Adventure", "General"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/8576b2a3391e3e1512b052cb6179fe7a-98.jpg", "descriptions": "HITMAN empowers players to perform contract hits on powerful, high-profile targets in exotic locations around the globe, from Paris and sunny coast of Italy to the dust and hustle of the markets in Marrakesh in this stealth action title. Gameplay centers on taking out targets in vast sandboxHITMAN empowers players to perform contract hits on powerful, high-profile targets in exotic locations around the globe, from Paris and sunny coast of Italy to the dust and hustle of the markets in Marrakesh in this stealth action title. Gameplay centers on taking out targets in vast sandbox levels with complete freedom of approach. Where to go, when to attack and who to kill is at your discretion.… Expand"}, {"name": "Picross 3D", "details_link": "https://www.metacritic.com/game/ds/picross-3d", "publisher": "Nintendo", "release_date": "May  3 2010", "developers": ["HAL Labs"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/ed475f9dec9a37231589136b7c1b6045-98.jpg", "descriptions": "Picross 3D is the sequel to the popular Picross DS puzzle game. The original game was a number-based grid puzzle that challenged players to reveal a hidden picture. Picross 3D moves the action into three dimensions. Picross 3D blends the logical challenge of a sudoku puzzle with thePicross 3D is the sequel to the popular Picross DS puzzle game. The original game was a number-based grid puzzle that challenged players to reveal a hidden picture. Picross 3D moves the action into three dimensions. Picross 3D blends the logical challenge of a sudoku puzzle with the excitement of discovering the hidden images within. [Nintendo]… Expand"}, {"name": "Gunstar Super Heroes", "details_link": "https://www.metacritic.com/game/game-boy-advance/gunstar-super-heroes", "publisher": "Sega", "release_date": "Oct 25 2005", "developers": ["Treasure"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/eea35caae283d6bd8aa14b8d6979c698-98.jpg", "descriptions": "Gunstar Super Heroes is the sequel to the classic Genesis game Gunstar Heroes. You can play as Red or Blue as you battle through six levels, employing one of three different weapon types. Each character has a slightly different story and balance, adding variety to the 2D platformer gameplay.Gunstar Super Heroes is the sequel to the classic Genesis game Gunstar Heroes. You can play as Red or Blue as you battle through six levels, employing one of three different weapon types. Each character has a slightly different story and balance, adding variety to the 2D platformer gameplay. Gunstar Super Heroes features large bosses and pseudo-3D effects that maximize the graphics capabilities of the Game Boy Advance.… Expand"}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/xbox/madden-nfl-07", "publisher": "EA Sports", "release_date": "Aug 22 2006", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/1fe59f4ebd6914f0965df1f4a72fdd24-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs.… Expand"}, {"name": "Teenage Mutant Ninja Turtles: The Cowabunga Collection", "details_link": "https://www.metacritic.com/game/switch/teenage-mutant-ninja-turtles-the-cowabunga-collection", "publisher": "Konami", "release_date": "Aug 30 2022", "developers": ["Konami", "Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/b583fa55d587d5616945e0e47f8ffd8f-98.jpg", "descriptions": "Teenage Mutant Ninja Turtles: The Cowabunga Collection assembles thirteen classic TMNT games by KONAMI in one incredible package. This collection provides a unique opportunity for gamers to experience these immensely popular and very influential games on modern consoles and includes aTeenage Mutant Ninja Turtles: The Cowabunga Collection assembles thirteen classic TMNT games by KONAMI in one incredible package. This collection provides a unique opportunity for gamers to experience these immensely popular and very influential games on modern consoles and includes a fantastic set of new quality of life features:* Added Online Play for certain games and Local Couch Play* Save Anytime and Rewind* Eleven Japanese Regional Versions* Button Mapping* Unique Development Art & Sketches* Historic TMNT Media ContentThe games are based on the characters and themes based on the 80's children's cartoon and comic book series, The Teenage Mutant Ninja Turtles. The game often takes place in a fictionalized New York City, in the sewers, inside futuristic enemy bases and even across time itself!… Expand"}, {"name": "Stretchmo", "details_link": "https://www.metacritic.com/game/3ds/stretchmo", "publisher": "Nintendo", "release_date": "May 14 2015", "developers": ["Intelligent Systems"], "platforms": "3DS", "genres": ["Puzzle", "Action"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/3f719950279283c23d031417c10051a4-98.jpg", "descriptions": "Also known as \"FullBlox\". Stretch and pull blocks to guide Mallo to the goal in seven free starter puzzles. Then expand this entry in the acclaimed Pushmo series by purchasing up to four puzzle-filled download packs on Nintendo eShop. You can even create and share your own puzzles!Also known as \"FullBlox\". Stretch and pull blocks to guide Mallo to the goal in seven free starter puzzles. Then expand this entry in the acclaimed Pushmo series by purchasing up to four puzzle-filled download packs on Nintendo eShop. You can even create and share your own puzzles!\r Purchase and download any of the four main attractions to unlock the Stretchmo Studio level creator, which also lets you share puzzles via QR Code patterns. Mallos Playtime Plaza has 100 great puzzles for players of all skill levels! Looking for a challenge? Then come on over to Pollys Sculpture Square, where 50 animal and object puzzles await. Keep the fun going in Corins Fortress of Fun, which packs in 50 action-packed puzzles filled with special objects, like manholes and even enemiesa series first! Or head on down to Papa Bloxs NES Expo to play 50 puzzles based on characters from Nintendo classics.… Expand"}]