[{"name": "Fable III: Traitor's Keep Quest Pack", "details_link": "https://www.metacritic.com/game/xbox-360/fable-iii-traitors-keep-quest-pack", "publisher": "Microsoft Game Studios", "release_date": "Mar  1 2011", "developers": ["Lionhead Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/5c142059fa14e8c9f11c97f47de489a6-98.jpg", "descriptions": "Traitor's Keep is an add-on for Fable III."}, {"name": "Section 8: Prejudice", "details_link": "https://www.metacritic.com/game/pc/section-8-prejudice", "publisher": "TimeGate Studios", "release_date": "May  4 2011", "developers": ["TimeGate Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/648d5b88e0981be22a83c6fbe120537c-98.jpg", "descriptions": "Section 8: Prejudice is a sci-fi shooter featuring online team-based multiplayer."}, {"name": "Lego Indiana Jones: The Original Adventures", "details_link": "https://www.metacritic.com/game/playstation-2/lego-indiana-jones-the-original-adventures", "publisher": "LucasArts", "release_date": "Jun  3 2008", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/5e6ee53d630864e553797ae05037e06d-98.jpg", "descriptions": "LEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones andLEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade). With a unique tongue-in-cheek take on the original adventures, LEGO Indiana Jones follows Dr. Jones escapades through the jungles of South America to the mountaintops of India. Fans can build, battle and brawl their way through their favorite cinematic moments, from Indy's entanglements with snakes to his dashing boulder run. Pop culture's most iconic archeologist whips through all the classic moments with the help of a host of supporting characters including Marion Ravenwood and Short Round. Players can also mix and match the body parts of more than 60 playable characters to create new heroes just as they could in the LEGO Star Wars games. [LucasArts]… Expand"}, {"name": "Transformers: Devastation", "details_link": "https://www.metacritic.com/game/playstation-4/transformers-devastation", "publisher": "Activision", "release_date": "Oct  6 2015", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/7d502572c9ace38cab4a69f669b8ea08-98.jpg", "descriptions": "PlatinumGames' fast-paced action allows instant robot to vehicle attacks, slam downs, counterattacks, and infinite combos for a unique and customizable combat system."}, {"name": "LEGO City Undercover", "details_link": "https://www.metacritic.com/game/playstation-4/lego-city-undercover", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  4 2017", "developers": ["TT Games"], "platforms": ["PC", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/22ad3aab7de4d1bd44d6e0dd95c52884-98.jpg", "descriptions": "In LEGO City: Undercover developed by TT Games and published by Nintendo, players assume the identity of Chase McCain, an undercover detective armed with clever disguises. As players run, drive and even fly through the city, they'll use the Wii U GamePad as a map, communicator andIn LEGO City: Undercover developed by TT Games and published by Nintendo, players assume the identity of Chase McCain, an undercover detective armed with clever disguises. As players run, drive and even fly through the city, they'll use the Wii U GamePad as a map, communicator and indispensable crime scanner. This is the first time that the LEGO City play sets have come to life on a gaming platform and it's exclusively on the Wii U console.… Expand"}, {"name": "Ace Combat Assault Horizon: Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/ace-combat-assault-horizon-enhanced-edition", "publisher": "Namco Bandai Games", "release_date": "Jan 24 2013", "developers": ["Project Aces ", "QLOC"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 77, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/492359bc8950ad74acb5c3d9b44f6c2f-98.jpg", "descriptions": "Making its debut on PC Q1 of 2013; ACE COMBAT ASSAULT HORIZON - ENHANCED EDITION features controls and graphics that have been optimized specifically for PC users. The PC version will include many of the DLC items released on the console versions of the game. Players will have immediateMaking its debut on PC Q1 of 2013; ACE COMBAT ASSAULT HORIZON - ENHANCED EDITION features controls and graphics that have been optimized specifically for PC users. The PC version will include many of the DLC items released on the console versions of the game. Players will have immediate access to additional aircrafts and numerous aircraft skins as well as skills and maps. The multiplayer portion of the game will feature support through Games for Windows Live from Microsoft. The game will be available at retailers and for download via Steam and the Games for Windows Marketplace.… Expand"}, {"name": "Yggdra Union", "details_link": "https://www.metacritic.com/game/game-boy-advance/yggdra-union", "publisher": "Atlus Co.", "release_date": "Nov 21 2006", "developers": ["Sting"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/590742aad9321d810990a1e69c8458ae-98.jpg", "descriptions": "Ruled by a royal family said to be descendants of the gods themselves, Fantasinia is a prosperous and peaceful land -- until the peace is shattered by the invading forces of the Empire of Bronkia. Led by the young emperor Gulcasa, who seized control of the Empire in a brutal coup d?etat,Ruled by a royal family said to be descendants of the gods themselves, Fantasinia is a prosperous and peaceful land -- until the peace is shattered by the invading forces of the Empire of Bronkia. Led by the young emperor Gulcasa, who seized control of the Empire in a brutal coup d?etat, Bronchia's Imperial Army cuts a bloody swath through the people of Fantasinia and the Royal Armies of King Ordeene. Amidst the chaos, a young woman escapes from the besieged capital of Partina -- a woman with innocence in her face, and a sword in her hand. The girl?s name is Princess Yggdra, the last surviving member of the royal family; the sword is the Gran Centurio, a legendary blade once wielded by the founder of Fantasinia, and passed down through generations of royalty. Fleeing to to a remote valley at the southern tip of the continent, Yggdra meets up with Milanor, the charismatic leader of a band of thieves, and readies herself for a war of liberation.… Expand"}, {"name": "Resident Evil: Revelations", "details_link": "https://www.metacritic.com/game/pc/resident-evil-revelations", "publisher": "Capcom", "release_date": "May 20 2013", "developers": ["Capcom"], "platforms": ["3DS", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/5d1c0828c7e67a6ce5bc9160e94624b5-98.jpg", "descriptions": "Resident Evil: Revelations tells the story of what happens between Resident Evil 4 and Resident Evil 5."}, {"name": "Bejeweled Twist", "details_link": "https://www.metacritic.com/game/ds/bejeweled-twist", "publisher": "PopCap", "release_date": "Jan 18 2010", "developers": ["Griptonite Games"], "platforms": ["PC", "DS"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching", "Action"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/970c028224d3c9fb28906c3f6853af2e-98.jpg", "descriptions": "Spin and match explosive gems for shockwaves of fun in this all-new version of the awardwinning PopCap game, exclusively on Nintendo DS. Rotate jewels to set up electrifying combos, outwit obstacles like Locks and Bombs, and create high-voltage Lightning and Flame gems. Rev up with aSpin and match explosive gems for shockwaves of fun in this all-new version of the awardwinning PopCap game, exclusively on Nintendo DS. Rotate jewels to set up electrifying combos, outwit obstacles like Locks and Bombs, and create high-voltage Lightning and Flame gems. Rev up with a strategic challenge, relax in the gem-spinning zone, or take on a friend in the DS-exclusive new Battle mode! No matter the mode, you’ll find endless ways to win.… Expand"}, {"name": "Quantum Conundrum", "details_link": "https://www.metacritic.com/game/pc/quantum-conundrum", "publisher": "Square Enix", "release_date": "Jun 21 2012", "developers": ["Airtight Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/831ae58294511eaa77dfd1cfe38e7961-98.jpg", "descriptions": "In Quantum Conundrum, players take on the role of a 12-year old nephew to the eccentric Professor Fitz Quadwrangle (Professor Q). Upon entering the Professorï¿½s vast, highly customized mansion, players quickly realize their uncle has gone missing. In order to find him,In Quantum Conundrum, players take on the role of a 12-year old nephew to the eccentric Professor Fitz Quadwrangle (Professor Q). Upon entering the Professorï¿½s vast, highly customized mansion, players quickly realize their uncle has gone missing. In order to find him, players will need to use an Interdimensional Shift Device, allowing them to manipulate space and objects. While on the journey, becoming adept at switching between dimensions will help them trek from one bizarre room to the next. It might sound easy enough, but itï¿½s a tall order for a 12-year old in a vast, kooky mansion! Once players start shifting between dimensions, theyï¿½ll soon discover physics is on their side!… Expand"}, {"name": "Xeodrifter", "details_link": "https://www.metacritic.com/game/playstation-4/xeodrifter", "publisher": "Renegade Kid", "release_date": "Sep  1 2015", "developers": ["Renegade Kid"], "platforms": ["3DS", "PC", "PlayStation Vita", "Switch", "Wii U", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/3ac108e38d4f5a64f32ad906d5d21e68-98.jpg", "descriptions": "Drifting through the stars. Xeodrifter is the story of an interstellar drifter traveling the stars on a simple mission of exploration. We join our nomad as he embarks on the investigation of a small cluster of four planets in the omega sector, after a collision with a rogue asteroid damagedDrifting through the stars. Xeodrifter is the story of an interstellar drifter traveling the stars on a simple mission of exploration. We join our nomad as he embarks on the investigation of a small cluster of four planets in the omega sector, after a collision with a rogue asteroid damaged his warp core. Blast your way through alien landscapes, seek out valuable secrets, and defeat ancient guardians to unlock powers from a legendary supreme culture in this exciting journey of mystery and adventure.… Expand"}, {"name": "Lost Horizon", "details_link": "https://www.metacritic.com/game/pc/lost-horizon", "publisher": "Deep Silver", "release_date": "Sep 24 2010", "developers": ["Animation Arts"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Third-Person", "General", "Point-and-Click", "Modern"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/b12bfdce52a9baa727fbe267c8d73fb5-98.jpg", "descriptions": "1936: Soldiers of the Third Reich roam the world seeking occult weapons for their insane plans of conquest. When Fenton Paddock, a former British soldier and hapless smuggler, is asked to look for his friend Richard, who went missing in Tibet, he has no idea that this search will lead him1936: Soldiers of the Third Reich roam the world seeking occult weapons for their insane plans of conquest. When Fenton Paddock, a former British soldier and hapless smuggler, is asked to look for his friend Richard, who went missing in Tibet, he has no idea that this search will lead him across three continents to a secret that could turn the whole world upside down. Enough mystery? Not in the mood for another crime story? \"Lost Horizon\" brings the classic adventure back to its roots: the 1930s, exotic settings all over the world, and the dangerous quest for one of the greatest secrets of mankind makes adventurers' hearts beat faster. The Makers of the award-winning Secret Files series invite you to experience a technically outstanding, carefully designed game featuring an absolutely thrilling story at the side of Kim and Fenton.… Expand"}, {"name": "Rocksmith", "details_link": "https://www.metacritic.com/game/xbox-360/rocksmith", "publisher": "Ubisoft", "release_date": "Oct 18 2011", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/64f81cd3ab764adf2d221138794884b5-98.jpg", "descriptions": "Featuring gameplay that automatically adjusts to the player's skill level and innovative game design that makes reading music visually fun and intuitive, Rocksmith engages experienced musicians and those who are picking up a guitar for the first time. The game includes a sizeable library ofFeaturing gameplay that automatically adjusts to the player's skill level and innovative game design that makes reading music visually fun and intuitive, Rocksmith engages experienced musicians and those who are picking up a guitar for the first time. The game includes a sizeable library of music from classic rock bands to current artists, such as The Animals, The Black Keys, David Bowie, Interpol, Nirvana and The Rolling Stones.… Expand"}, {"name": "The Centennial Case: A Shijima Story", "details_link": "https://www.metacritic.com/game/switch/the-centennial-case-a-shijima-story", "publisher": "Square Enix", "release_date": "May 12 2022", "developers": ["h.a.n.d. Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/d1c9b112dd604513c9dc7a6fc91f066b-98.jpg", "descriptions": "The complex and interwoven mysteries you’ll unravel in this investigative adventure are centered around the ill-fated Shijima family, which has suffered a series of inexplicable deaths over the last century. As Haruka Kagami, it’s up to you to use your powers of deduction to uncover theThe complex and interwoven mysteries you’ll unravel in this investigative adventure are centered around the ill-fated Shijima family, which has suffered a series of inexplicable deaths over the last century. As Haruka Kagami, it’s up to you to use your powers of deduction to uncover the truth behind these mysterious events and the ‘Fruit of Youth’ that allegedly lies somewhere in the Shijima Mansion. You’ll explore both the past and the present in four murder cases, set across different eras of Japan. Of course, unravelling this intricate web of secrets won’t be straightforward. You’ll have to have your wits about you as you uncover clues, speak to suspects, and put all the pieces of the puzzle together to form a hypothesis. Not everyone you speak to will be cooperative, so be ready to counter their arguments when you present your case. And don’t worry if your detective skills are a little rusty - the game is designed in such a way that you’ll be able to reach the correct answer if you don’t give up. [Square Enix]… Expand"}, {"name": "moon", "details_link": "https://www.metacritic.com/game/switch/moon", "publisher": "Onion Games", "release_date": "Aug 27 2020", "developers": ["Onion Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/b49539827308cae6d541e11bbfeadc72-98.jpg", "descriptions": "Moon is full of so many subtleties in the characters, their strange personalities, and idiosyncratic ways of communicating. We wanted to do even more testing than usual to make sure all of that came through clearly, felt special, and guided you properly through its world."}, {"name": "Zuma Deluxe", "details_link": "https://www.metacritic.com/game/xbox-360/zuma-deluxe", "publisher": "Oberon Media", "release_date": "Nov 22 2005", "developers": ["Oberon Media"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/3acce0d032617188f6bbb7fc7e458da5-98.jpg", "descriptions": "[Xbox Live Arcade]  Discover the ancient secrets of Zuma Deluxe! Deep in the jungle lie hidden temples bursting with traps and trickery. It will take a quick hand and a sharp eye to unlock their treasures. Explore more than 20 realms in Adventure mode and put your skills to the test in the[Xbox Live Arcade]  Discover the ancient secrets of Zuma Deluxe! Deep in the jungle lie hidden temples bursting with traps and trickery. It will take a quick hand and a sharp eye to unlock their treasures. Explore more than 20 realms in Adventure mode and put your skills to the test in the Gauntlet. Fire magical balls from the stone frog idol to make color matches, then collect coins and powerups to clear the path. But watch out! If the stream of spheres reaches the golden skull, it'll be the end for you! [Xbox.com]… Expand"}, {"name": "Melatonin", "details_link": "https://www.metacritic.com/game/pc/melatonin", "publisher": "Half Asleep", "release_date": "Dec 15 2022", "developers": ["Half Asleep"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action", "Rhythm", "Music"], "meta_score": 77, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/9e6ae9bc3f1a328daee091f9f9b3e20a-98.jpg", "descriptions": "Melatonin is a rhythm game about dreams and reality merging together. It uses animations and sound cues to keep you on beat without any intimidating overlays or interfaces. Harmonize through a variety of dreamy levels containing surprising challenges, hand-drawn art, and vibrant music."}, {"name": "Need for Speed Unbound", "details_link": "https://www.metacritic.com/game/xbox-series-x/need-for-speed-unbound", "publisher": "Electronic Arts", "release_date": "Dec  2 2022", "developers": ["Criterion Games"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 77, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/179d1f419cb3fb594221c062a0bf1630-98.jpg", "descriptions": "START AT THE BOTTOM, RACE TO THE TOP. The world is your canvas in Need for Speed™ Unbound. Prove you have what it takes to win The Grand, Lakeshore’s ultimate street racing challenge. Across four intense weeks of racing, earn enough cash to enter weekly qualifiers, beat the competition, andSTART AT THE BOTTOM, RACE TO THE TOP. The world is your canvas in Need for Speed™ Unbound. Prove you have what it takes to win The Grand, Lakeshore’s ultimate street racing challenge. Across four intense weeks of racing, earn enough cash to enter weekly qualifiers, beat the competition, and make your mark on the street racing scene while outdriving and outsmarting the cops. Pack your garage with precision-tuned, custom rides and light up the streets with your unique style, exclusive fits, and a vibrant global soundtrack led by A$AP Rocky and AWGE that bumps in every corner of the world. Express yourself to the fullest with the freshest new art styles and signature tags that represent what you're all about. With separate single and multiplayer campaigns, this latest edition in the Need for Speed™ franchise from Criterion Games™ delivers hours of electric, adrenaline-pumping action.\r • Graffiti comes to life in Need for Speed™ Unbound with an all-new, unique visual style that blends elements of the freshest street art with the most realistic looking cars in Need for Speed™ history. Access a brand-new toolkit of high-energy visual and sound effects to express your driving skills, including Burst Nitrous, a new boost tactic that delivers a dizzying rush of speed.\r • To get to the top, you gotta take risks. Choose how and when to put it all on the line, pulling huge drifts on the street, outdriving the cops, or placing side bets with your own earnings against rival racers. Time is money, so find the fastest way to earn enough cash to enter the weekly qualifiers and make it to Lakeshore’s ultimate race, The Grand.\r • The more you race, the more you build heat. While the cops pile on the pressure, you gotta make tactical decisions using new escape mechanics to take control of the chase. Do you outrun the cops, battle them head on, or hide out in Lakeshore's underground? Run these streets and you’ll reap the rewards.\r • Pull up to a Meetup and show off your unique style with hundreds of cosmetic items to choose from, including exclusive gear from some of the world’s most pioneering fashion innovators. Extend that look to your ride, transforming your cars with unique wraps and cutaways for the ultimate legendary custom. And when you take first, don't forget to stunt on the competition with your own personal win poses.… Expand"}, {"name": "L.A. Noire", "details_link": "https://www.metacritic.com/game/xbox-one/la-noire", "publisher": "Rockstar Games", "release_date": "Nov 14 2017", "developers": ["Team Bondi"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Third-Person"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/4bacb97e7d4a7dca20e47f87ff2b073a-98.jpg", "descriptions": "Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right,Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right, Phelps must unravel the truth behind a string of arson attacks, racketeering conspiracies and brutal murders, battling the L.A. underworld and even members of his own department to uncover a secret that could shake the city to its rotten core. Using groundbreaking new animation technology that captures every nuance of an actor's facial performance in astonishing detail, L.A. Noire is a violent crime thriller that blends breathtaking action with true detective work to deliver an unprecedented interactive experience. Search for clues, chase down suspects and interrogate witnesses as you struggle to find the truth in a city where everyone has something to hide.… Expand"}, {"name": "Game of Thrones: Episode Five - A Nest of Vipers", "details_link": "https://www.metacritic.com/game/playstation-4/game-of-thrones-episode-five---a-nest-of-vipers", "publisher": "Telltale Games", "release_date": "Jul 21 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/f0853d4cf7970a9703b7336c6ee07251-98.jpg", "descriptions": "In this penultimate episode, the actions of every Forrester are vital to the survival of the house. Rodrik's alliance with House Glenmore, and his defiance of the Whitehills, has drawn the ire of an even greater threat: Ramsay Snow. Far across the Narrow Sea in Essos, with Meereen now a freeIn this penultimate episode, the actions of every Forrester are vital to the survival of the house. Rodrik's alliance with House Glenmore, and his defiance of the Whitehills, has drawn the ire of an even greater threat: Ramsay Snow. Far across the Narrow Sea in Essos, with Meereen now a free city, Asher is close to securing the army he desperately needs to return home, and save his family. In King's Landing, Mira's activities at Tommen's coronation have not escaped the attention of Margaery Tyrell, and Cersei has realized that the handmaiden may prove useful in her political games. Finally, beyond the Wall, Gared's unlikely allies are reluctant to help in the search for the North Grove... but this far into the frozen wilds, Crows and Free Folk have a common enemy; and winter is coming.… Expand"}, {"name": "Just Dance 2023 Edition", "details_link": "https://www.metacritic.com/game/switch/just-dance-2023-edition", "publisher": "Ubisoft", "release_date": "Nov 22 2022", "developers": ["Ubisoft"], "platforms": ["PlayStation 5", "Xbox Series X", "Switch"], "num_players": "Up to 6 ", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 77, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/87ecbadb55c0b4ddb1d73b915e63ed0b-98.jpg", "descriptions": "Welcome to a new era of dance with Just Dance® 2023 Edition! Now with online multiplayer, personalization, 3D immersive worlds, and new songs and modes year-round, you can experience a never-ending dance party all year long!\r • Online Multiplayer: Play Just Dance with whoever you want,Welcome to a new era of dance with Just Dance® 2023 Edition! Now with online multiplayer, personalization, 3D immersive worlds, and new songs and modes year-round, you can experience a never-ending dance party all year long!\r • Online Multiplayer: Play Just Dance with whoever you want, wherever they are, with this brand-new feature! Invite up to five players to dance with and find out who has the best moves.\r• New User Interface: Spend more time dancing and less time searching thanks to a new, more modern, and intuitive user interface. Everything is one click away: playlists, game modes and songs!\r• Personalized Experiences: Unlock custom-made sessions and songs tailored to your preferences and playing habits. Plus, Just Dance will keep track of your progress and scores, so you can show off your dancing skills!\r Just Dance 2023 is your on-demand dancing platform!… Expand"}, {"name": "Pure Pool", "details_link": "https://www.metacritic.com/game/switch/pure-pool", "publisher": "Ripstone", "release_date": "Nov 17 2020", "developers": ["VooFoo Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Billiards"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/9fcd6b6ff2fc8ce6a45d06e9a1005368-98.jpg", "descriptions": "Cue sports have never looked so good on Nintendo Switch, whether you’re playing docked or on the go!\r ULTIMATE IMMERSION\r\nImmerse yourself in the stunningly realistic and endlessly enjoyable world of Pure Pool and rack up your favourite games of pool and snooker anywhere, with absolutelyCue sports have never looked so good on Nintendo Switch, whether you’re playing docked or on the go!\r ULTIMATE IMMERSION\rImmerse yourself in the stunningly realistic and endlessly enjoyable world of Pure Pool and rack up your favourite games of pool and snooker anywhere, with absolutely no load times getting in your way.\r MORE WAYS TO PLAY\rPlay hundreds of pool and snooker events across a wide range of competitive modes including American 8-Ball, 9-Ball, Blackball and Killer. Then challenge yourself in fast-paced modes like Speed Pot, Checkpoint and Royal Rumble to rise up the global leaderboards and unlock new rewards!\r PLAY TOGETHER\rHave fun with friends in multiplayer games locally, or join the online Pure Pool community and match up against players around the world in cross-network multiplayer matches. And even after your friends have left, you can play against a copy of their DNA offline!… Expand"}, {"name": "The Lion's Song", "details_link": "https://www.metacritic.com/game/pc/the-lions-song", "publisher": "Mi'pu'mi Games", "release_date": "Jul  7 2016", "developers": ["Mi'pu'mi Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/5136c00cc9bc8ae5b5b1310c55114dec-98.jpg", "descriptions": "The Lion’s Song is a narrative adventure game. It is set against the backdrop of early 20th century Austria with every episode following a different character. The Lion's Song is a series of four self-contained point & click stories connected into an overarching narrative, where playerThe Lion’s Song is a narrative adventure game. It is set against the backdrop of early 20th century Austria with every episode following a different character. The Lion's Song is a series of four self-contained point & click stories connected into an overarching narrative, where player choices will affect the way in which the story unfolds. Set against the backdrop of early 20th century Austria, every episode follows a different character, each blessed with an exceptional creative mind. The game pulls players into a story of personal struggle for creativity, human connections and inspiration.… Expand"}, {"name": "Chronos", "details_link": "https://www.metacritic.com/game/pc/chronos", "publisher": "Gunfire Games", "release_date": "Mar 28 2016", "developers": ["Gunfire Games"], "platforms": "PC", "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/1bd593d7650506016a75671c4e540f86-98.jpg", "descriptions": "Chronos is an atmospheric RPG that chronicles a hero's lifelong quest to save their homeland from a great evil."}, {"name": "Battlefleet Gothic: Armada", "details_link": "https://www.metacritic.com/game/pc/battlefleet-gothic-armada", "publisher": "Focus Home Interactive", "release_date": "Apr 21 2016", "developers": ["Tindalos Interactive"], "platforms": "PC", "genres": ["Sci-Fi", "Strategy", "Real-Time", "General"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/92a68fa03d1bba36f38645717788012d-98.jpg", "descriptions": "Developed on Unreal Engine 4, Battlefleet Gothic: Armada is an RTS in which the player takes command of one of these battlefleets composed of the most powerful spaceships from the Imperial, Chaos, Eldar and Ork forces, in a no-quarter-given struggle for the control of the Gothic sector of space."}, {"name": "Samurai Shodown: Special Edition", "details_link": "https://www.metacritic.com/game/xbox-series-x/samurai-shodown-special-edition", "publisher": "Deep Silver", "release_date": "Mar 16 2021", "developers": ["SNK Corporation"], "platforms": "Xbox Series X", "num_players": "Up to 10 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/f71a6d0d758ebba592b54ba1ed653977-98.jpg", "descriptions": "SAMURAI SHODOWN has enjoyed worldwide success as a blade-wielding fighting game series since its first release in 1993. 11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay!SAMURAI SHODOWN has enjoyed worldwide success as a blade-wielding fighting game series since its first release in 1993. 11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay! Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN includes a revolutionary feature that learns from players game actions and patterns in order to create CPU-controlled \"ghost\" characters. With a story set one year before the very first installment, a diverse cast of returning and new characters cross paths in order to fulfill their destinies!* SAMURAI SHODOWN is faithful to the series' roots by delivering the same tense and exhilarating battles that it has always been known for. * Using the power of UNREAL® ENGINE 4 the series is able to achieve a level of detail and graphical quality like never before. * Using revolutionary Deep Learning AI, the game will learn from player tactics and create Ghost characters which players around the globe can share and fight against.… Expand"}, {"name": "The Sims 4: Get Famous", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-get-famous", "publisher": "Electronic Arts", "release_date": "Nov 16 2018", "developers": ["Electronic Arts"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 77, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/3ea2ea4973bde41ddcd1bbf8f774d218-98.jpg", "descriptions": "Now your Sims can live out their wildest dreams of fame and Fortune.\rBe your own muse and direct your Sim toward a brilliant acting Career\rJoin the glitz and glamour of Del sol Valley, a new world where your Sims are the Talk of the town. Get noticed around town in chic Street wear orNow your Sims can live out their wildest dreams of fame and Fortune.\rBe your own muse and direct your Sim toward a brilliant acting Career\rJoin the glitz and glamour of Del sol Valley, a new world where your Sims are the Talk of the town. Get noticed around town in chic Street wear or dress the part with glamorous outfits on set.… Expand"}, {"name": "The Elder Scrolls V: Skyrim VR", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-v-skyrim-vr", "publisher": "Bethesda Softworks", "release_date": "Nov 17 2017", "developers": ["Bethesda Softworks"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/a3906a637a0c7ddf2fc25f28ebbf3488-98.jpg", "descriptions": "A true, full-length open-world game for VR has arrived from award-winning developers, Bethesda Game Studios. Skyrim VR reimagines the complete epic fantasy masterpiece with an unparalleled sense of scale, depth, and immersion. From battling ancient dragons to exploring rugged mountains andA true, full-length open-world game for VR has arrived from award-winning developers, Bethesda Game Studios. Skyrim VR reimagines the complete epic fantasy masterpiece with an unparalleled sense of scale, depth, and immersion. From battling ancient dragons to exploring rugged mountains and more, Skyrim VR brings to life a complete open world for you to experience any way you choose. Skyrim VR includes the critically-acclaimed core game and official add-ons -- Dawnguard, Hearthfire, and Dragonborn.\r Dragons, long lost to the passages of the Elder Scrolls, have returned to Tamriel and the future of the Empire hangs in the balance. As Dragonborn, the prophesied hero born with the power of The Voice, you are the only one who can stand amongst them.… Expand"}, {"name": "Angry Video Game Nerd Adventures", "details_link": "https://www.metacritic.com/game/pc/angry-video-game-nerd-adventures", "publisher": "ScrewAttack LLC", "release_date": "Sep 20 2013", "developers": ["FreakZone"], "platforms": ["3DS", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/024c6fae6294e7e82f9e003bdfb45044-98.jpg", "descriptions": "Angry Video Game Nerd Adventures makes it way on to Nintendo consoles."}, {"name": "Etrian Odyssey III: The Drowned City", "details_link": "https://www.metacritic.com/game/ds/etrian-odyssey-iii-the-drowned-city", "publisher": "Atlus", "release_date": "Sep 21 2010", "developers": ["Atlus"], "platforms": "DS", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/48a0bbc8331c6c7f8ef055b189a9d800-98.jpg", "descriptions": "The embodiment of adventure and discovery in the purest sense, Etrian Odyssey III transports gamers to a sparkling oceanic paradise filled with atmospheric dungeons to chart and survey, vast watery expanses to sail across, and rumors of a sunken city to investigate.  Aspiring explorers areThe embodiment of adventure and discovery in the purest sense, Etrian Odyssey III transports gamers to a sparkling oceanic paradise filled with atmospheric dungeons to chart and survey, vast watery expanses to sail across, and rumors of a sunken city to investigate.  Aspiring explorers are responsible for charting their travels utilizing the intuitive touchscreen map editor, meaning that careless cartography could easily spell doom for a fatigued party trying to escape danger.  Powerful challenges demand cunning and strategy: players will assemble and fully customize their party of adventurers from a variety of highly specialized classes and sub-classes.  For the patient and prepared, fame and fortune await.\r… Expand"}, {"name": "NHL 06", "details_link": "https://www.metacritic.com/game/pc/nhl-06", "publisher": "EA Sports", "release_date": "Sep  6 2005", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PC"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/448b89b37324d89ff5bec5fbf5fb6617-98.jpg", "descriptions": "With NHL 06 players can score like a superstar, express themselves through their shooting style with the new EA SPORTS Skill Stick and light the lamp with highlight reel moves such as spinoramas, toe drags, bat-ins, and between-the-legs shots. Classic deke control adds to the arsenal ofWith NHL 06 players can score like a superstar, express themselves through their shooting style with the new EA SPORTS Skill Stick and light the lamp with highlight reel moves such as spinoramas, toe drags, bat-ins, and between-the-legs shots. Classic deke control adds to the arsenal of moves allowing maneuvers around defensemen before snapping off dangerous shots that can ripple the twine and knock the water bottle off the net. [Electronic Arts]… Expand"}, {"name": "Knights of Honor", "details_link": "https://www.metacritic.com/game/pc/knights-of-honor", "publisher": "Paradox Interactive", "release_date": "Jun  6 2005", "developers": ["Black Sea Studios"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 77, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/5d982ef4d63997564dc97cb9772087ca-98.jpg", "descriptions": "For the first time Knights of Honor will bring you the excitement of a true Empire Conquering Simulation in Real-Time. A unique Knights-management system will offer you brand new possibilities to enhance your personal strategy. Never lose sight of your goal - to rule all of Europe."}, {"name": "FIFA 21", "details_link": "https://www.metacritic.com/game/xbox-one/fifa-21", "publisher": "Electronic Arts", "release_date": "Oct  6 2020", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 77, "users_score": 1.6, "image": "https://static.metacritic.com/images/products/games/0/cac4bd35a111acd4749683cd19e0d3be-98.jpg", "descriptions": "On the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new AgileOn the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new Agile Dribbling system gives you the means to unleash your creativity in 1-on-1 situations. Use fast footwork, more responsive close control, and new skill moves like the ball roll fake to explode past defenders. In FIFA 21, increased positional awareness elevates footballers’ in-game intelligence to put them in the right place at the right time. See world-class forwards hold their runs in line with the last defender, creative playmakers find space to play through balls, and midfielders shut off passing lanes as players better live up to their real-world understanding of space and time on the pitch. [Electronic Arts]… Expand"}, {"name": "Dragon Age: Inquisition - Trespasser", "details_link": "https://www.metacritic.com/game/pc/dragon-age-inquisition---trespasser", "publisher": "BioWare", "release_date": "Sep  9 2015", "developers": ["BioWare"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG", "Western-Style"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/64037737271b6f4660850e3c8952af52-98.jpg", "descriptions": "Trespasser tells an entirely new story, set 2 years after the main game. The story explores what it's like to be a world-saving organization when the world no longer needs saving."}, {"name": "Fantasia: Music Evolved", "details_link": "https://www.metacritic.com/game/xbox-one/fantasia-music-evolved", "publisher": "Disney Interactive Studios", "release_date": "Oct 21 2014", "developers": ["Harmonix Music Systems"], "platforms": ["Xbox 360", "Xbox One"], "genres": ["Music", "Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/33602398491f366b21c41faa29042ba8-98.jpg", "descriptions": "In this game, players enter the magical realms of Fantasia, selected by the legendary sorcerer Yen Sid to hone their musical and magical prowess as his new apprentice. \"Fantasia: Music Evolved\" takes players on an interactive motion-controlled journey through worlds of music andIn this game, players enter the magical realms of Fantasia, selected by the legendary sorcerer Yen Sid to hone their musical and magical prowess as his new apprentice. \"Fantasia: Music Evolved\" takes players on an interactive motion-controlled journey through worlds of music and magic, unleashing their creativity along the way.\r \rUsing Kinect motion control technology and natural, controller-free gameplay, players control the music flow from some of the industry's biggest acts, including electronic DJ and producer AVICII, chart-topper Bruno Mars, and rock royalty Queen. \"Fantasia: Music Evolved\" gives players the power to change the mix of their chosen songs in real-time, choosing between the original recording and new remixed versions, or adding new layers of music via magical manipulators that allow them to change music in new ways.… Expand"}, {"name": "Outpost Kaloki X", "details_link": "https://www.metacritic.com/game/xbox-360/outpost-kaloki-x", "publisher": "NinjaBee", "release_date": "Nov 22 2005", "developers": ["NinjaBee"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/496908a2676d8c3452166755d454c517-98.jpg", "descriptions": "[Xbox Live Arcade]  Everyone loves galactic lemonade ... which means big space bucks for you! How are you going to supply power to your lemonade stand? Better build a solar windmill. How will you pay for the windmill with no space dollars? Outpost Kaloki X is the light-hearted space-station[Xbox Live Arcade]  Everyone loves galactic lemonade ... which means big space bucks for you! How are you going to supply power to your lemonade stand? Better build a solar windmill. How will you pay for the windmill with no space dollars? Outpost Kaloki X is the light-hearted space-station tycoon game filled with clever characters and wacky storylines, where it's your job to keep the visiting aliens happy and rake in the cash. Play the Adventure Story, the War Story, or one of 11 different Scenarios. Chat with your patrons to find out what they really want ... and get hot tips on cool expansions. Complete lower-level expansions to unlock more advanced ones. Can you juggle the needs of your station, the desires of your clients, and your own hopes for cash and glory? [Xbox.com]… Expand"}, {"name": "EverQuest Online Adventures: Frontiers", "details_link": "https://www.metacritic.com/game/playstation-2/everquest-online-adventures-frontiers", "publisher": "Sony Online Entertainment", "release_date": "Nov 17 2003", "developers": ["Sony Online Entertainment"], "platforms": "PlayStation 2", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Fantasy"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/e5e1340fec46869d1215de87d95e0097-98.jpg", "descriptions": "After centuries of solitude, the ogres of Oggok have finally opened their gates to the outside world. The long lost Mountains of Rathe, the volcanic Lavastorm Mountains and Veeshan's realm, The Plane of Sky, are now open to all explorers and adventurers. To the West, the Erudites have begunAfter centuries of solitude, the ogres of Oggok have finally opened their gates to the outside world. The long lost Mountains of Rathe, the volcanic Lavastorm Mountains and Veeshan's realm, The Plane of Sky, are now open to all explorers and adventurers. To the West, the Erudites have begun their massive exodus to the unknown islands of the Western Sea to escape the hypocrisy and corruption of their human neighbors. A true frontier, Odus will prove more than just a challenge to the Erudites, for their very existence is at stake. Adventure into Veeshan's home, the altered Plane of Sky. Find your way through massive hanging islands among the clouds. Untold treasures and power await any adventurer daring enough to tackle this perilous landscape. The gnomes of Klick`Anon have finally broken through the northeastern mountains and stumbled upon the tumultuous lands of Lavastorm. Reputed to be ruled by a mysterious tyrant of flame and lava, it's up to Norrath's adventurers to discover the new frontiers. [Sony Online Entertainment]… Expand"}, {"name": "Monster Rancher 4", "details_link": "https://www.metacritic.com/game/playstation-2/monster-rancher-4", "publisher": "Tecmo", "release_date": "Nov 13 2003", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/36921e1385c4f25ad4b8ea70325d41d3-98.jpg", "descriptions": "Mocchi, Suezo and Golem are back in Monster Rancher 4. The latest entry in the Monster Rancher series is comprised of a mass of new features including a multi-breeding and training program, full customization of training facilities, and a brand new interactive action/adventure element,Mocchi, Suezo and Golem are back in Monster Rancher 4. The latest entry in the Monster Rancher series is comprised of a mass of new features including a multi-breeding and training program, full customization of training facilities, and a brand new interactive action/adventure element, creating a new game that goes years beyond its predecessors. Along with a host of new features Monster Rancher 4 will bring back some of its fan's favorite elements including everyone's favorite characters, Mocchi, Suezo, and Golem! Monster Rancher 4 includes a multi-breeding and training program where you can breed and train multiple monsters simultaneously. Fully customize your training facilities with a variety of training equipment to select from. The more efficiently you plan out your training facilities the better you will be able to train your new monsters. [Tecmo]… Expand"}, {"name": "True Crime: Streets of LA", "details_link": "https://www.metacritic.com/game/playstation-2/true-crime-streets-of-la", "publisher": "Activision", "release_date": "Nov  3 2003", "developers": ["Luxoflux", "Inc."], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/7b5b64a02ad18ee534ef96a643eabb6e-98.jpg", "descriptions": "True Crime: Streets of LA is the deepest combination of driving, fighting and shooting ever burned into one game. Take the role of rogue E.O.D. operative Nick Kang, assigned to the task of taking out the merciless Russian and Chinese crime syndicates plaguing the City of Angels. The actionTrue Crime: Streets of LA is the deepest combination of driving, fighting and shooting ever burned into one game. Take the role of rogue E.O.D. operative Nick Kang, assigned to the task of taking out the merciless Russian and Chinese crime syndicates plaguing the City of Angels. The action is non-stop and you can never repeat the same mission twice as you play through a branching storyline that takes place across 250 square miles of accurately recreated Los Angeles. [Activision]… Expand"}, {"name": "MoonBase Commander", "details_link": "https://www.metacritic.com/game/pc/moonbase-commander", "publisher": "Atari", "release_date": "Aug 13 2002", "developers": ["Humongous Entertainment"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/b420197244d7fe45693138ba3f3bf8af-98.jpg", "descriptions": "MoonBase Commander puts players in charge of their own lunar territory in a quest to build the most powerful empire on the moon. The key to winning is to find, exploit and use valuable energy pools to eliminate rival factions who are also on the same quest. Along the way players must chooseMoonBase Commander puts players in charge of their own lunar territory in a quest to build the most powerful empire on the moon. The key to winning is to find, exploit and use valuable energy pools to eliminate rival factions who are also on the same quest. Along the way players must choose the best way to accomplish their goals by using weapons, surveillance or shields to fortify their defenses. MoonBase Commander features multiple and unique opposing factions, bright graphics, a light storyline and various types of terrain that can be easily customized with the terrain editor. [Infogrames]… Expand"}, {"name": "GT Advance 2: Rally Racing", "details_link": "https://www.metacritic.com/game/game-boy-advance/gt-advance-2-rally-racing", "publisher": "THQ", "release_date": "Jun 30 2002", "developers": ["MTO"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 77, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/598526eb30f34a7f487e165ee20b429a-98.jpg", "descriptions": "Get behind the wheel of the world's top rally cars as you span the globe in quest of a championship. Listen to your navigator as you fly over jumps and skid around obstacles on your way to the top of the rally racing circuit!"}, {"name": "Monster Rancher 3", "details_link": "https://www.metacritic.com/game/playstation-2/monster-rancher-3", "publisher": "Tecmo", "release_date": "Sep 24 2001", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Strategy", "Breeding/Constructing"], "meta_score": 77, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/0dd4045b1d804b421e459dad50d4b208-98.jpg", "descriptions": "The latest installment in the series lets players breed, train and fight with the monsters they control. New monsters are bred by pairing two existing ones or spawned from music CDs, movie DVDs or game discs. Players train and care for their monsters, much like a virtual pet. Later, theyThe latest installment in the series lets players breed, train and fight with the monsters they control. New monsters are bred by pairing two existing ones or spawned from music CDs, movie DVDs or game discs. Players train and care for their monsters, much like a virtual pet. Later, they enroll their monsters into tournaments, where they battle for prizes and fame. [Tecmo]… Expand"}, {"name": "The Last Blade 2: Heart of the Samurai", "details_link": "https://www.metacritic.com/game/dreamcast/the-last-blade-2-heart-of-the-samurai", "publisher": "Agetec Inc.", "release_date": "Aug  6 2001", "developers": ["SNK"], "platforms": "Dreamcast", "genres": ["Action", "Fighting", "2D"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/2336d722a4b8acb8aaa3e16e30d9bd29-98.jpg", "descriptions": "More than a dozen Samurai blade masters are summoned to compete in a challenge that has only one victor - and no other survivors. The Last Blade 2 Heart of the Samurai recreates 1864 Japan in all its feudal glory . Players are swept into 1-on-1 death matches against the living and the deadMore than a dozen Samurai blade masters are summoned to compete in a challenge that has only one victor - and no other survivors. The Last Blade 2 Heart of the Samurai recreates 1864 Japan in all its feudal glory . Players are swept into 1-on-1 death matches against the living and the dead in a quest to bring honor to their master's clan. Each character wields their favorite weapon with a deadly accuracy that is sure to leave the players breathless - all in a split second! Practice each of the lightning-quick moves to perfection, or else prepare to be counted amongst those slain in battle.… Expand"}, {"name": "Anachronox", "details_link": "https://www.metacritic.com/game/pc/anachronox", "publisher": "Eidos Interactive", "release_date": "Jun 27 2001", "developers": ["Ion Storm"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General", "Japanese-Style"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/e60f8ad89d968743592c688a6431d01c-98.jpg", "descriptions": "Theory has it Anachronox was once home to millions of quarantined aliens who died of some horrible plague (Anachronox literally means \"poison from a previous time\"), leaving this city to fall to ruins, to be taken over by the refuse of the galaxy as the center of their nefarious dealings.Theory has it Anachronox was once home to millions of quarantined aliens who died of some horrible plague (Anachronox literally means \"poison from a previous time\"), leaving this city to fall to ruins, to be taken over by the refuse of the galaxy as the center of their nefarious dealings. Here our story begins. [Eidos Interactive]… Expand"}, {"name": "Sherlock Holmes: Chapter One", "details_link": "https://www.metacritic.com/game/pc/sherlock-holmes-chapter-one", "publisher": "Frogwares", "release_date": "Nov 16 2021", "developers": ["Frogwares"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Open-World", "First-Person"], "meta_score": 77, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/3d8ed9df5b49313d42181f2978574bf5-98.jpg", "descriptions": "In this story-driven detective thriller, a young Sherlock Holmes struggles to prove himself as he navigates an exotic, dangerous island in the Mediterranean to investigate the mystery of his mother’s death."}, {"name": "Voice of Cards: The Beasts of Burden", "details_link": "https://www.metacritic.com/game/playstation-4/voice-of-cards-the-beasts-of-burden", "publisher": "Square Enix", "release_date": "Sep 13 2022", "developers": ["A-lim"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 77, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/d92108b59ba6e3137676d4607d9f8313-98.jpg", "descriptions": "This is the tale of a girl who swears revenge on monsters.\rAfter losing her home, she joins hands with a mysterious boy and sets out into the unknown. But will it be the light of hope, or the darkness of despair that awaits them at journey's end...? The Voice of Cards series are RPGs, toldThis is the tale of a girl who swears revenge on monsters.\rAfter losing her home, she joins hands with a mysterious boy and sets out into the unknown. But will it be the light of hope, or the darkness of despair that awaits them at journey's end...? The Voice of Cards series are RPGs, told entirely through the medium of cards.\rIn \"The Beasts of Burden\", you can trap the monsters you defeat in cards and use them as skills in battle.\r Enjoy a truly unique gaming experience from the minds of YOKO TARO, Keiichi Okabe and Kimihiko Fujisaka.\r *This game is not a direct sequel to Voice of Cards: The Isle Dragon Roars or Voice of Cards: The Forsaken Maiden and can be enjoyed as a standalone adventure.\r*Product bundles that include this game are also available. Please take care to avoid making duplicate purchases.\r*Please be aware that services which require an internet connection to use may be discontinued after a time has passed from the game’s release.… Expand"}, {"name": "Command & Conquer: Red Alert 3", "details_link": "https://www.metacritic.com/game/xbox-360/command-conquer-red-alert-3", "publisher": "Electronic Arts", "release_date": "Nov 11 2008", "developers": ["EA LA"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/730cbf2ad1d5b12ae6a5ea6015a374f2-98.jpg", "descriptions": "Red Alert 3 breaks new ground in the RTS genre, featuring a fully co-operative campaign while bringing back the series’ light-hearted style and classic, action-oriented gameplay. In Red Alert 3, the desperate leadership of a doomed Soviet Union travels back in time to change history andRed Alert 3 breaks new ground in the RTS genre, featuring a fully co-operative campaign while bringing back the series’ light-hearted style and classic, action-oriented gameplay. In Red Alert 3, the desperate leadership of a doomed Soviet Union travels back in time to change history and restore the glory of Mother Russia. The time travel mission goes awry, creating an alternate timeline where technology has followed an entirely different evolution, a new superpower has been thrust on to the world stage, and World War III is raging. The Empire of the Rising Sun has risen in the East, making World War III a three-way struggle between the Soviets, the Allies, and the Empire with armies fielding wacky and wonderful weapons and technologies like Tesla coils, heavily armed War Blimps, teleportation, armored bears, intelligent dolphins, floating island fortresses, and transforming tanks. Red Alert 3 asks the question \"What If?\" What if every bizarre research project and technology experiment for the last 70 years had actually borne fruit? What if the Philadelphia Experiment, time travel theory, teleportation, invisibility, Tesla technology, and a hundred other intriguing research projects had all paid off and gone mainstream? What if the Soviet Union survived and thrived; what would it look like 10 years in the future? What if the Japanese Empire had never fallen and instead became the ultimate high-tech military superpower?  The end result is an imaginative and playful vision of an alternate future filled with possibility. [Electronic Arts]… Expand"}, {"name": "New Play Control! Pikmin", "details_link": "https://www.metacritic.com/game/wii/new-play-control!-pikmin", "publisher": "Nintendo", "release_date": "Mar  9 2009", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/dad983c280e2caa370c24bcb1e092ce1-98.jpg", "descriptions": "Players control a Spaceman who has crash-landed on a strange world inhabited by Pikmin -- plant-like creatures who selflessly follow the spaceman's orders. Controlling these Pikmin, it's up to you to help the Spaceman defeat the Pikmin-munching predators, solve puzzles and ultimately find aPlayers control a Spaceman who has crash-landed on a strange world inhabited by Pikmin -- plant-like creatures who selflessly follow the spaceman's orders. Controlling these Pikmin, it's up to you to help the Spaceman defeat the Pikmin-munching predators, solve puzzles and ultimately find a way to escape the planet. [Nintendo]… Expand"}, {"name": "LEGO Harry Potter: Years 5-7", "details_link": "https://www.metacritic.com/game/xbox-360/lego-harry-potter-years-5-7", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 11 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/9ee64bf63bcb752771e4b1d70f086a80-98.jpg", "descriptions": "Based on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations includingBased on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations including Grimmauld Place, the Ministry of Magic, and Godric’s Hollow – players will encounter new faces, new challenges and new magic, preparing them for the ultimate face-off against Lord Voldemort.… Expand"}, {"name": "Mutant Storm Empire", "details_link": "https://www.metacritic.com/game/xbox-360/mutant-storm-empire", "publisher": "PomPom Games", "release_date": "Oct 31 2007", "developers": ["PomPom Games"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/5df3813c1c497d816b50a6f85b055aea-98.jpg", "descriptions": "[Xbox Live Arcade]  There's this evil emperor, see, and... well, he's evil. Now someone has decided to put a stop to the whole evilness thing, and that someone is you. It's the right thing to do! Besides, in Mutant Storm Empire, it'll be fun. Battle through line after line of the emperor's[Xbox Live Arcade]  There's this evil emperor, see, and... well, he's evil. Now someone has decided to put a stop to the whole evilness thing, and that someone is you. It's the right thing to do! Besides, in Mutant Storm Empire, it'll be fun. Battle through line after line of the emperor's minion horde, destroying absolutely everything you can. Blast through bunches of robots, crush colonies of aquatic monsters, smash swarms of UFOs, and demolish devastating bosses. It's a continuous adventure through four immense, strikingly vibrant worlds, and you can fight alone or join forces with a friend in two-player cooperative mode. Enjoy the frenzy! Practice the way of \"Blastikkidoo\" or the art of blasting, as you plow through the different worlds in Mutant Storm Empire. This all-new sequel to Mutant Storm Reloaded ratchets up the competitive challenge. The four different worlds feature sixteen challenging levels, all in gorgeous high-def 3-D graphics. Play co-op offline with a friend, or head into Xbox LIVE territory and go multiplayer for up to 2 people. Twelve new achievements to master ranging from easy, such as getting a single combo of beasties, to difficult, such as completing the game on the Black Belt level. [Microsoft]… Expand"}, {"name": "Solo", "details_link": "https://www.metacritic.com/game/pc/solo", "publisher": "Team Gotham", "release_date": "Apr 26 2018", "developers": ["Team Gotham"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/99bd4358b18e9cb146886e0f3ff55413-98.jpg", "descriptions": "Solo is an introspective puzzler set on a gorgeous and surreal archipelago. Reflect on your loving relationships by exploring contemplative, dream-like islands."}, {"name": "Downstream Panic!", "details_link": "https://www.metacritic.com/game/psp/downstream-panic!", "publisher": "Atari", "release_date": "Feb  5 2008", "developers": ["EKO Software"], "platforms": ["PC", "PlayStation 3", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/c5ffe9c6f701372ca7bd78341840822b-98.jpg", "descriptions": "The game offers unpredictable, fast-paced, tactical puzzle-action that places players in the position of a sea-creature preservationist out to save the world from a fantastic cyclone that has blasted the world's fish into the Earth's atmosphere. It is up to the player to protect fish fromThe game offers unpredictable, fast-paced, tactical puzzle-action that places players in the position of a sea-creature preservationist out to save the world from a fantastic cyclone that has blasted the world's fish into the Earth's atmosphere. It is up to the player to protect fish from land, predators and other obstacles through the use of a variety of innovative tools as they guide fish on their descent back into the ocean. In Downstream Panic! players save their scaly sea-friends in more than 80 different levels with five different customizable environments. Three different game modes (adventure, free play and survival) bring more of a challenge to the aquatic mix. [Atari]… Expand"}, {"name": "Everyday Shooter", "details_link": "https://www.metacritic.com/game/pc/everyday-shooter", "release_date": "Mar 29 2006", "developers": ["Queasy Games"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/a5bada075f894979250d6a4c40db7280-98.jpg", "descriptions": "Everyday Shooter is an album of games exploring the expressive power of abstract shooters. Dissolute sounds of destruction are replaced with guitar riffs harmonizing over an all-guitar soundtrack, while modulating shapes celebrate the flowing beauty of geometry. [Queasy Games]"}, {"name": "DOOM II", "details_link": "https://www.metacritic.com/game/xbox-360/doom-ii", "publisher": "Bethesda Softworks", "release_date": "May 26 2010", "developers": ["id Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/2ccd56413feae294107aa24e699a0b3f-98.jpg", "descriptions": "[Xbox Live Arcade]   To save Earth, you must descend into the stygian depths of hell in DOOM II. Battle nastier, deadlier demons and monsters with your trusty Super Shotgun. Survive more mind-blowing explosions and take part in the bloodiest, fiercest, most awesome blastfest ever. Recruit[Xbox Live Arcade]   To save Earth, you must descend into the stygian depths of hell in DOOM II. Battle nastier, deadlier demons and monsters with your trusty Super Shotgun. Survive more mind-blowing explosions and take part in the bloodiest, fiercest, most awesome blastfest ever. Recruit your friends and plow through nine all-new levels in the new episode, No Rest for the Living! Play solo or multiplayer over Xbox LIVE with up to four players. DOOM II includes split-screen co-op over Xbox LIVE, game clips, 5.1 Surround Sound, enhanced graphics, and HD display support.… Expand"}, {"name": "Mega Man Zero 4", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-zero-4", "publisher": "Capcom", "release_date": "Oct  4 2005", "developers": ["Inti"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/7782a02085244d5293f9be9e50d9fa3a-98.jpg", "descriptions": "After falling under the evil rule of Dr. Weil, Neo Arcadia has collapsed into a state of chaos and confusion. Zero discovers this disastrous turn of events when he and his friends come to the rescue of a band of humans fleeing Neo Arcadia. Now it's up to our hero Zero to resolve thisAfter falling under the evil rule of Dr. Weil, Neo Arcadia has collapsed into a state of chaos and confusion. Zero discovers this disastrous turn of events when he and his friends come to the rescue of a band of humans fleeing Neo Arcadia. Now it's up to our hero Zero to resolve this terrible conflict between humans and reploids to restore peace and security to the land. With new systems to seize enemy weapons and create strengthening chips and new Cyber elf programs to introduce new abilities.… Expand"}, {"name": "Might & Magic: Heroes VI", "details_link": "https://www.metacritic.com/game/pc/might-magic-heroes-vi", "publisher": "Ubisoft", "release_date": "Oct 13 2011", "developers": ["Black Hole Games"], "platforms": "PC", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Fantasy", "General", "Fantasy"], "meta_score": 77, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/62e56bf9dc83c0c3a232d38d6f5e76e9-98.jpg", "descriptions": "The Might & Magic Heroes VI adventure starts 400 years before the events in Heroes of Might & Magic® V, showcasing a family of heroes in a thrilling, epic story where Angels plot to revive an unfinished war."}, {"name": "Enigma: Rising Tide", "details_link": "https://www.metacritic.com/game/pc/enigma-rising-tide", "publisher": "DreamCatcher Interactive", "release_date": "Aug 26 2003", "developers": ["Tesseraction Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Ship", "Ship", "Marine", "Civilian"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/b0351982ef91f186c6d0435fda3c0c0e-98.jpg", "descriptions": "Enigma: Rising Tide melds cinematic pacing with immersive graphics to produce the world's first alternate history, naval warfare, vehicular shooter game in an online, persistent, action-packed, 3-D setting. Command a variety of surface ships and submarines. Sail with and against thousands ofEnigma: Rising Tide melds cinematic pacing with immersive graphics to produce the world's first alternate history, naval warfare, vehicular shooter game in an online, persistent, action-packed, 3-D setting. Command a variety of surface ships and submarines. Sail with and against thousands of other players, deploying deck guns, torpedoes, hedgehogs, and depth charges. Communicate with your teammates in encrypted chat channels, evade deadly torpedo aircraft, and pluck salvage from the wreckage of enemy vessels. Pit your destroyer against enemy wolfpacks, or stalk fat merchantmen from the murky depths. Every three months following release, you get free expansions to the game, including new vehicles, additional features, and dramatically enhanced gameplay. [Tesseraction Games]… Expand"}, {"name": "Call of Duty: Infinite Warfare", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-infinite-warfare", "publisher": "Activision", "release_date": "Nov  4 2016", "developers": ["Infinity Ward"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 77, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/84fc9424dcf2654baeb209c86ebef5ad-98.jpg", "descriptions": "Infinite Warfare is the first game in the franchise to venture beyond the reaches of Earth, framing a plausible future war in our solar system.  Infinite Warfare also introduces an original cooperative Zombies mode that takes players on a wild ride through a new storyline with uniqueInfinite Warfare is the first game in the franchise to venture beyond the reaches of Earth, framing a plausible future war in our solar system.  Infinite Warfare also introduces an original cooperative Zombies mode that takes players on a wild ride through a new storyline with unique gameplay features and mechanics. [Infinity Ward]… Expand"}, {"name": "Soul Sacrifice", "details_link": "https://www.metacritic.com/game/playstation-vita/soul-sacrifice", "publisher": "SCEA", "release_date": "Apr 30 2013", "developers": ["SCE Japan Studio", "comcept"], "platforms": "PlayStation Vita", "genres": ["Action", "General", "Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/c3fc5dec7baf8444ff1af82461d004f9-98.jpg", "descriptions": "Soul Sacrifice is a brutal combat experience where every decision made will have consequential results."}, {"name": "Sniper Elite 5", "details_link": "https://www.metacritic.com/game/xbox-series-x/sniper-elite-5", "publisher": "Rebellion", "release_date": "May 26 2022", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/fde7c18bf56be5ac4bf88eb6f0e4cec7-98.jpg", "descriptions": "As part of a covert US Rangers operation to weaken the Atlantikwall fortifications along the coast of Brittany, Karl makes contact with the French Resistance. Soon they uncover a secret Nazi project that threatens to end the war before the Allies can even invade Europe: Operation Kraken.As part of a covert US Rangers operation to weaken the Atlantikwall fortifications along the coast of Brittany, Karl makes contact with the French Resistance. Soon they uncover a secret Nazi project that threatens to end the war before the Allies can even invade Europe: Operation Kraken. It's Karl's mission to take out the high-ranking Nazi officers and end Operation Kraken once and for all. Based upon real world locations from France in 1944, the new game maps are the largest and most immersive in the franchise's history with the new traversal system offering players an even greater sandbox of options when it comes to taking out their targets. You can even invite a friend to help you on your mission with enhanced cooperative gameplay options.… Expand"}, {"name": "Freud's Bones-the game", "details_link": "https://www.metacritic.com/game/pc/freuds-bones-the-game", "publisher": "Axel Fox", "release_date": "May 25 2022", "developers": ["Axel Fox"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/0d37a8754582970002471bb4a6b693a8-98.jpg", "descriptions": "Freud's Bones is an adventure that wants to pay homage to the birth of psychoanalysis and its founder Sigmund Freud. Dig deep into Freud's bones to solve the mystery behind disturbing Egyptian artifacts, philosophical puzzles, and perverse sexual disorders in this unprecedented indie adventure game."}, {"name": "Strangeland", "details_link": "https://www.metacritic.com/game/pc/strangeland", "publisher": "Wormwood Studios", "release_date": "May 25 2021", "developers": ["Wormwood Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/f60d224f0d821ee2eb51c3c5d84b1571-98.jpg", "descriptions": "You awake in a nightmarish carnival and watch a golden-haired woman hurl herself down a bottomless well for your sake. You seek clues and help from jeering ravens, an eyeless scribe, a living furnace, a mismade mermaid, and many more who dwell within the park. All the while, a shadow shrieksYou awake in a nightmarish carnival and watch a golden-haired woman hurl herself down a bottomless well for your sake. You seek clues and help from jeering ravens, an eyeless scribe, a living furnace, a mismade mermaid, and many more who dwell within the park. All the while, a shadow shrieks from atop a towering roller-coaster, and you know that until you destroy this Dark Thing, the woman will keep jumping, falling, and dying, over and over again....Strangeland is a classic point-and-click adventure that integrates a compelling narrative with engaging puzzles. For almost a decade, we've been working on a worthy successor to the fan-acclaimed Primordia, and we are proud, at long last, to share our second game.… Expand"}, {"name": "Super Mega Baseball 2", "details_link": "https://www.metacritic.com/game/playstation-4/super-mega-baseball-2", "publisher": "Metalhead Software", "release_date": "May  1 2018", "developers": ["Metalhead Software"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Baseball", "Arcade"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/8a596678d2a2db32c4b4b7e6aa760384-98.jpg", "descriptions": "The  makers  of Super  Mega  Baseball have  returned  with  a brand new, streamlined baseball simulator that’ll keep you coming  back for  more.  Build  your  dream  team  and  challenge your  opponents  to  a  good  old-fashioned  game  of  hardball, online and off."}, {"name": "Portal Knights", "details_link": "https://www.metacritic.com/game/xbox-one/portal-knights", "publisher": "505 Games", "release_date": "May 23 2017", "developers": ["505 Games", "Keen Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 77, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/4a18c347f683a1296678af143505f72e-98.jpg", "descriptions": "Leave the familiar world behind and step into the fantastic unknown with Portal Knights, a cooperative 3D sandbox action-RPG! Level up your character and craft powerful gear to defeat your enemies in real-time tactical combat. Explore dozens of randomly-generated islands and restore peace toLeave the familiar world behind and step into the fantastic unknown with Portal Knights, a cooperative 3D sandbox action-RPG! Level up your character and craft powerful gear to defeat your enemies in real-time tactical combat. Explore dozens of randomly-generated islands and restore peace to a world torn apart by The Fracture.\r Begin your journey as a Warrior, Mage, or Ranger. Defeat formidable monsters and epic bosses while gathering resources to craft powerful weapons, armor and spells to help you on your adventure.\r Travel between worlds by collecting portal shards and rebuilding the ancient gateways. Meet 100+ memorable NPCs, recruit a pet, and experience dynamic events that happen in real-time! Build your perfect home and choose from dozens of materials and furnishings to make it your own!\r Craft your adventure. Forge your hero. Defeat the Portal Guardians. Become the ultimate Portal Knight!… Expand"}, {"name": "Need for Speed Carbon", "details_link": "https://www.metacritic.com/game/xbox-360/need-for-speed-carbon", "publisher": "EA Games", "release_date": "Oct 31 2006", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Arcade", "GT / Street", "GT / Street", "Automobile"], "meta_score": 77, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/3d46dc94d13693f188b7fbbc01ea45ed-98.jpg", "descriptions": "What starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods oneWhat starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Need for Speed Carbon delivers the next generation of customization giving you the power to design and tweak your crew's cars in every way using the ground-breaking new Autosculpt technology. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games. [Electronic Arts]… Expand"}, {"name": "Champions: Return to Arms", "details_link": "https://www.metacritic.com/game/playstation-2/champions-return-to-arms", "publisher": "Sony Online Entertainment", "release_date": "Feb  7 2005", "developers": ["Snowblind Studios"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/ec694e1b4e137509ad3ddf7332855b01-98.jpg", "descriptions": "The Champions of Norrath have destroyed the god Innoruuk, shattering his body into shards of hate. Innoruuk's followers and allies have taken it upon themselves to gather these shards in order to resurrect their fallen prince. Firiona Vie has called upon the champions to take up the crusadeThe Champions of Norrath have destroyed the god Innoruuk, shattering his body into shards of hate. Innoruuk's followers and allies have taken it upon themselves to gather these shards in order to resurrect their fallen prince. Firiona Vie has called upon the champions to take up the crusade against evil to rid Norrath of this evil threat once and for all. The game is designed to offer more than 100 hours of gameplay per character, unlimited battles, deadly missions and the ability to import characters from the original game. The game also features: Two new playable races; Earn medals based on gameplay performance, which can then be used to unlock secret levels; Thousands of new items, weapons, armor and magical artifacts to acquire; All-new and beautifully detailed environments; New spells and abilities for all classes; A host of new monsters to battle and non-player characters to encounter; Innovative medal system which unlocks secret gameplay modes; Secret Epic items of incredible power found through unlockable side quests; The ability to import characters from the original game and start at a higher difficulty level; Increased level limits?take characters to level 80; More than 50 gameplay areas along with a mission system containing non-linear side quests; All new multiplayer and online gameplay options. [Sony Online Entertainment]… Expand"}, {"name": "XCOM: Chimera Squad", "details_link": "https://www.metacritic.com/game/pc/xcom-chimera-squad", "publisher": "2K Games", "release_date": "Apr 23 2020", "developers": ["Firaxis Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 77, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/1fc578fd9d55be8cae4cd524aabe3795-98.jpg", "descriptions": "XCOM: Chimera Squad delivers an all-new story and turn-based tactical combat experience in the XCOM universe. After years of alien rule, humanity won the war for Earth. But when the Overlords fled the planet, they left their former soldiers behind. Now, five years after the events of XCOM 2,XCOM: Chimera Squad delivers an all-new story and turn-based tactical combat experience in the XCOM universe. After years of alien rule, humanity won the war for Earth. But when the Overlords fled the planet, they left their former soldiers behind. Now, five years after the events of XCOM 2, humans and aliens are working together to forge a civilization of cooperation and coexistence. Welcome to City 31, a model of peace in a post-invasion world. However, not all of Earth's inhabitants support interspecies alliance. Chimera Squad, an elite force of human and alien agents, must work together to destroy the underground threats driving the city toward chaos. Your agents are unique: each of them equipped with special tactical abilities and driven by a different motivation for joining Chimera Squad. Deploy targeted team members to investigate and combat the dangers that pervade the districts of City 31. Lead Chimera Squad through a new experience that innovates on XCOM's turn-based legacy, utilizing strategy, teamwork, and new breach-and-clear gameplay to complete your mission objectives. The future of City 31 depends on you.… Expand"}, {"name": "Buzz! The Hollywood Quiz", "details_link": "https://www.metacritic.com/game/playstation-2/buzz!-the-hollywood-quiz", "publisher": "SCEA", "release_date": "Mar 11 2008", "developers": ["Relentless Software"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/a58e7bd1da9c37d35cdb8b800302ff98-98.jpg", "descriptions": "It's been a fun game to make too. When drawing on inspiration for a Hollywood game you don't have to look very far. If you imagined Buzz at the Oscars then you have some idea of the direction we've taken it: out goes the TV studio and in come the dancing girls, the red velvet curtains, theIt's been a fun game to make too. When drawing on inspiration for a Hollywood game you don't have to look very far. If you imagined Buzz at the Oscars then you have some idea of the direction we've taken it: out goes the TV studio and in come the dancing girls, the red velvet curtains, the search lights and the statuettes. Of course (lawyers take note), Buzz isn't at the Oscars themselves, but at a similarly auspicious ceremony nearby. [Relentless Software]… Expand"}, {"name": "Panzer Paladin", "details_link": "https://www.metacritic.com/game/switch/panzer-paladin", "publisher": "Tribute Games", "release_date": "Jul 21 2020", "developers": ["Tribute Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/c2392cf0ccd67333e4a267f23968be0b-98.jpg", "descriptions": "The sight of giant swords blazing through the night sky might be hair-raising, but stand your ground! The sinister Ravenous and his legions of brutal demons are poised for battle. Even all the armies of the world can’t stop them, but humanity has one final ace in the hole: a cutting edgeThe sight of giant swords blazing through the night sky might be hair-raising, but stand your ground! The sinister Ravenous and his legions of brutal demons are poised for battle. Even all the armies of the world can’t stop them, but humanity has one final ace in the hole: a cutting edge power armor called Paladin.\r It’s now up to the strong-willed android named Flame to become a Squire, take control of the Paladin and track down all Weapon Keepers and their diabolical leader. The showdown between mankind’s highest technological prowesses and the powerful forces of the occult has begun!\r Seize weapons from the denizens of the Netherworld and dish out a taste of their own medicine! Show them the power of cutting edge technology combined with swordsmanship. Slash, bash and thrust your way through a series of mind-blowing levels located around the world, all of it rendered in glorious 8-bit graphics! Hop in your Panzer Paladin and take up arms!… Expand"}, {"name": "Second Sight", "details_link": "https://www.metacritic.com/game/gamecube/second-sight", "publisher": "Codemasters", "release_date": "Sep 21 2004", "developers": ["Free Radical Design"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/0c1a278b820c82b494c501894bb37ae8-98.jpg", "descriptions": "Join John Vattic, a man endowed with psychic abilities, as he attempts to escape a US medical facility. As you discover more and more of John's psychic powers, you'll slowly uncover the events that landed him in the hands of the researchers. You'll gain access to a variety of psionicJoin John Vattic, a man endowed with psychic abilities, as he attempts to escape a US medical facility. As you discover more and more of John's psychic powers, you'll slowly uncover the events that landed him in the hands of the researchers. You'll gain access to a variety of psionic abilities (such as Psi-Blast, Telekinesis, Projection, and Charm) and powerful weapons (including handguns, tranquilizers, and machine guns). Complete your objectives using a combination of shooting action and stealth tactics. … Expand"}, {"name": "Endless Space", "details_link": "https://www.metacritic.com/game/pc/endless-space", "publisher": "Amplitude Studios", "release_date": "Jul  4 2012", "developers": ["Amplitude Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "4X"], "meta_score": 77, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/47f5c05ffbe38d4e371cad62be1b6f47-98.jpg", "descriptions": "This galaxy is ancient, and its first intelligent life was the civilization we call the Endless. Long before our eyes gazed upon the stars they flew between them, though all that remains of this people is what we call Dust. A substance found scattered or in forgotten temples, it once gaveThis galaxy is ancient, and its first intelligent life was the civilization we call the Endless. Long before our eyes gazed upon the stars they flew between them, though all that remains of this people is what we call Dust. A substance found scattered or in forgotten temples, it once gave powers to admirals and galactic governors.… Expand"}, {"name": "Costume Quest", "details_link": "https://www.metacritic.com/game/playstation-3/costume-quest", "publisher": "THQ", "release_date": "Oct 19 2010", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/f48f00cfdf00897fea5116e2683fb335-98.jpg", "descriptions": "Costume Quest is a rollicking Adventure/Role-Playing game that unfolds on Halloween night across seemingly peaceful suburban neighborhoods, a mysterious village carnival, and a monster-infested shopping mall.  Created by Double Fine's lead animator, Tasha Harris, the game follows theCostume Quest is a rollicking Adventure/Role-Playing game that unfolds on Halloween night across seemingly peaceful suburban neighborhoods, a mysterious village carnival, and a monster-infested shopping mall.  Created by Double Fine's lead animator, Tasha Harris, the game follows the adventure of a group of young friends who must rid their neighborhood of monsters using only their wits, their bravery, and their home-made costumes. Players go door-to-door collecting candy, points, cards, battle stamps and quest assignments as they prepare themselves for Combat Mode-where they transform into larger-than-life versions of their costumes. Each costume that comes-to-life provides its own unique set of superpowers that players will need to battle Halloweenâ€™s worst monsters.… Expand"}, {"name": "A Case of Distrust", "details_link": "https://www.metacritic.com/game/pc/a-case-of-distrust", "publisher": "Serenity Forge", "release_date": "Feb  8 2018", "developers": ["The Wandering Ben"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/9a7366e9d46ef2a3ad0cb2b9a0eda62c-98.jpg", "descriptions": "A Case of Distrust is a narrative mystery from 1924 San Francisco. Play as private investigator Phyllis Cadence Malone in this historical 2D adventure game."}, {"name": "Batman: The Enemy Within - Episode 4: What Ails You", "details_link": "https://www.metacritic.com/game/pc/batman-the-enemy-within---episode-4-what-ails-you", "publisher": "Telltale Games", "release_date": "Jan 22 2018", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/8a85c26e997e5599f1a71c1b7a1c280d-98.jpg", "descriptions": "The star of this installment in Telltale's Batman series is John, the would be Joker, who finally unravels, going from the well-meaning if a bit unhinged friend to something much closer to the Clown Prince of Crime we're used to seeing terrorize Gotham City and Batman. [GameSpot]"}, {"name": "The Wolf Among Us: Episode 3 - A Crooked Mile", "details_link": "https://www.metacritic.com/game/xbox-360/the-wolf-among-us-episode-3---a-crooked-mile", "publisher": "Telltale Games", "release_date": "Apr  9 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "Point-and-Click"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/f46297a662a97bab1b68fd254a8cc708-98.jpg", "descriptions": "After discovering damning evidence at a bloody crime scene, Bigby is situated just steps behind the prime suspect of a horrific murder, but he’s not the only one; other forces in Fabletown will stop at nothing to protect their interests. Every decision matters and time is ticking in thisAfter discovering damning evidence at a bloody crime scene, Bigby is situated just steps behind the prime suspect of a horrific murder, but he’s not the only one; other forces in Fabletown will stop at nothing to protect their interests. Every decision matters and time is ticking in this third episode of The Wolf Among Us.… Expand"}, {"name": "Zombie Army 4: Dead War", "details_link": "https://www.metacritic.com/game/xbox-one/zombie-army-4-dead-war", "publisher": "Rebellion", "release_date": "Feb  4 2020", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Third-Person", "Arcade"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/c5fc229a05b102cdd559e3abf5271e8a-98.jpg", "descriptions": "Hitler’s hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon!"}, {"name": "Tom Clancy's EndWar", "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-endwar", "publisher": "Ubisoft", "release_date": "Nov  4 2008", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Military", "Military", "Tactics"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/23a5ce7dc330b0317510448aa3f2fc8e-98.jpg", "descriptions": "2011 - 2014. The world enjoys an unprecedented era of peace as enhanced defense technology eliminates the threat of nuclear war. But can it last? 2020. Constant depletion of resources has international tensions at a breaking point. One spark will ignite what no one thought could happen...a2011 - 2014. The world enjoys an unprecedented era of peace as enhanced defense technology eliminates the threat of nuclear war. But can it last? 2020. Constant depletion of resources has international tensions at a breaking point. One spark will ignite what no one thought could happen...a third and final world war. Strategy for the next generation: Led by creative director Michael de Plater (Rome Total War), EndWar promises to redefine strategy gaming. Designed for next-gen consoles EndWar creates a theatre of war, immersing you in the drama of World War III in a way you never thought possible. Fight For Your Nation: Pick a side US, Europe, Russia - the fate of the world is in your hands. If you don't step in to save your homeland, who will? Command Your Army: Grow your army into the most powerful force on the planet. Your army is completely customizable, and experience breeds strength - your units grow more powerful with every campaign you fight. Light Up The City of Lights: Tom Clancy's World War III won't be won by capturing remote deserts or grasslands but by striking countries in the heart. Paris, Moscow, Washington D.C. will all erupt in flames as you battle your way through the fully destructive playground. A Whole New Kind of Massive: EndWar is an online multiplayer experience unlike anything you've ever encountered. 16 player matchups? Try hundreds. 30 minute battles? Try persistent matchups lasting for months at a time. This isn't a skirmish, it's World War III. Talk Your Way to Victory: Put the controller aside and start shouting commands. EndWar can be played almost entirely via voice command. [Ubisoft]… Expand"}, {"name": "Timelie", "details_link": "https://www.metacritic.com/game/pc/timelie", "publisher": "Urnique Studio", "release_date": "May 20 2020", "developers": ["Urnique Studio"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/b066c405bfc782100878621accf238e6-98.jpg", "descriptions": "Control time like a media player and work with a mysterious cat as you solve puzzles and uncover the secrets of a strange, surreal world. Sneak, solve, and escape…together."}, {"name": "MLB 11: The Show", "details_link": "https://www.metacritic.com/game/psp/mlb-11-the-show", "publisher": "SCEA", "release_date": "Mar  7 2011", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 2", "PlayStation 3", "PSP"], "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/cde79f668dc7ccaa34016b5768121c7f-98.jpg", "descriptions": "The #1 selling, highest rated baseball franchise is back in MLB® The Show '11. Experience new ways to play The Show with the NEW PURE Analog controls. Team up in ALL NEW CO-OP play, get called up to the Big Leagues with new and improved Road to the Show features and compete for realThe #1 selling, highest rated baseball franchise is back in MLB® The Show '11. Experience new ways to play The Show with the NEW PURE Analog controls. Team up in ALL NEW CO-OP play, get called up to the Big Leagues with new and improved Road to the Show features and compete for real world prizes in MLB® The Show's ALL NEW Challenge of the Week.… Expand"}, {"name": "Kathy Rain", "details_link": "https://www.metacritic.com/game/pc/kathy-rain", "publisher": "Raw Fury", "release_date": "May  5 2016", "developers": ["Clifftop Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/3eb10e1ba38b511e8fc27518068e1e6e-98.jpg", "descriptions": "Set in the 90's, Kathy Rain tells the story of a strong-willed journalism major who has to come to terms with her own troubled past as she investigates the mysterious death of her recently deceased grandfather."}, {"name": "Lost Orbit", "details_link": "https://www.metacritic.com/game/playstation-4/lost-orbit", "publisher": "PixelNAUTS", "release_date": "May 12 2015", "developers": ["PixelNAUTS"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 77, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/d3fbf747fd960d91a5eed3f4741d4d9a-98.jpg", "descriptions": "LOST ORBIT tells the story of Harrison, an astronaut and his struggle to return home. Despite his lack of resources, Harrison will relentlessly strive to survive hopeless conditions. Along his mission he encounters evidence that his accident was not an isolated incident and confronts aLOST ORBIT tells the story of Harrison, an astronaut and his struggle to return home. Despite his lack of resources, Harrison will relentlessly strive to survive hopeless conditions. Along his mission he encounters evidence that his accident was not an isolated incident and confronts a strange and dangerous alien race.… Expand"}, {"name": "Dragon's Crown", "details_link": "https://www.metacritic.com/game/playstation-vita/dragons-crown", "publisher": "Atlus", "release_date": "Aug  6 2013", "developers": ["Vanillaware"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "num_players": "Up to 4 ", "genres": ["Action", "Role-Playing", "Action RPG", "Beat-'Em-Up", "Action RPG", "Beat-'Em-Up", "2D"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/4a68b5c93fe0faaf6c94b72ad1137d6e-98.jpg", "descriptions": "Dragon's Crown thrusts you into a fantastical medieval world packed with labyrinthine dungeons to explore, vile monstrosities to smite, and nearly endless online adventure. Your mission is to dive into the dank underworld, uncovering treasure and strengthening your mettle as you unlock theDragon's Crown thrusts you into a fantastical medieval world packed with labyrinthine dungeons to explore, vile monstrosities to smite, and nearly endless online adventure. Your mission is to dive into the dank underworld, uncovering treasure and strengthening your mettle as you unlock the secret behind the ancient dragon threatening the world. Simple, easy-to-learn controls allow anyone to dive into the fray and enjoy the breathtaking sword-and-sorcery action. In addition to long-lasting gameplay, the game also features a vast array of character customization features - with six wildly different classes to play as, raiding the catacombs for epic loot remains fresh and engaging.… Expand"}, {"name": "Observer", "details_link": "https://www.metacritic.com/game/playstation-4/observer", "publisher": "Aspyr", "release_date": "Aug 15 2017", "developers": ["Bloober Team"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/603c755fd7def96e0db5878d55b632c6-98.jpg", "descriptions": "What would you do if your fears were hacked? The year is 2084. You are Daniel Lazarski, an elite neural detective known as an Observer, whose purpose is to hack and invade suspects’ minds. To gather evidence, you must relive their darkest fears, and, finally, face your own. From BlooberWhat would you do if your fears were hacked? The year is 2084. You are Daniel Lazarski, an elite neural detective known as an Observer, whose purpose is to hack and invade suspects’ minds. To gather evidence, you must relive their darkest fears, and, finally, face your own. From Bloober Team, the creators of Layers of Fear, >observer_ is a cyberpunk horror game designed to disturb you.… Expand"}, {"name": "Pro Evolution Soccer 2009", "details_link": "https://www.metacritic.com/game/playstation-3/pro-evolution-soccer-2009", "publisher": "Konami", "release_date": "Mar 17 2009", "developers": ["KCET"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/6b31f6f85b975c7812787e2a7bc0cccb-98.jpg", "descriptions": "Known by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor theKnown by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor the game to their own tastes, while new stylish moves, innovative control schemes and key online elements further the realism. [Konami]… Expand"}, {"name": "Metro 2033", "details_link": "https://www.metacritic.com/game/xbox-360/metro-2033", "publisher": "THQ", "release_date": "Mar 16 2010", "developers": ["4A Games"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/443e1477b9ef14a24b9949c6b4a7f970-98.jpg", "descriptions": "Set in the shattered subway of a post apocalyptic Moscow, Metro 2033 is a story of intensive underground survival where the fate of mankind rests in your hands. In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the earth’s surface into aSet in the shattered subway of a post apocalyptic Moscow, Metro 2033 is a story of intensive underground survival where the fate of mankind rests in your hands. In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the earth’s surface into a poisonous wasteland. A handful of survivors took refuge in the depths of the Moscow underground, and human civilization entered a new Dark Age. The year is 2033. An entire generation has been born and raised underground, and their besieged Metro Station-Cities struggle for survival, with each other, and the mutant horrors that await outside. You are Artyom, born in the last days before the fire, but raised Underground. Having never ventured beyond your Metro Station-City limits, one fateful event sparks a desperate mission to the heart of the Metro system, to warn the remnants of mankind of a terrible impending threat. Your journey takes you from the forgotten catacombs beneath the subway to the desolate wastelands above, where your actions will determine the fate of mankind. [THQ]… Expand"}, {"name": "Resident Evil 3", "details_link": "https://www.metacritic.com/game/pc/resident-evil-3", "publisher": "Capcom", "release_date": "Apr  3 2020", "developers": ["M-Two"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/ffbf013dd8ddf6c1b6643cb78c4f8a5a-98.jpg", "descriptions": "Fight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that theFight your way to freedom from the brink of despair. A series of strange disappearances have been occurring in the American Midwest within a place called Racoon City. A specialist squad of the police force known as S.T.A.R.S. has been investigating the case, and have determined that the pharmaceutical company Umbrella and their biological weapon, the T-Virus, are behind the incidentsthough they've lost several members in the process. Jill Valentine and the other surviving S.T.A.R.S. members try to make this truth known, but find that the police department itself is under Umbrella's sway and their reports are rejected out of hand.\r However, soon reports of a grisly \"cannibal virus\" begin to surface, and vicious dogs begin roaming the streets. With the viral plague spreading through the town and to her very doorstep, Jill is determined to survive.\rHowever, unbeknownst to Jill, an extremely powerful pursuer has already been dispatched to eliminate her.… Expand"}, {"name": "Exit", "details_link": "https://www.metacritic.com/game/psp/exit", "publisher": "Ubisoft", "release_date": "Feb 14 2006", "developers": ["Taito Corporation"], "platforms": ["Xbox 360", "PSP"], "num_players": "24  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/aa4ecd84ab8f0c8c5eba8724d23bc106-98.jpg", "descriptions": "As \"Mr. ESC\", a professional escapologist who can rescue people from just about any situation, Exit players must guide themselves through numerous obstacles while rescuing victims from life-threatening situations. Situations include braving fires, earthquakes and other disasters in variousAs \"Mr. ESC\", a professional escapologist who can rescue people from just about any situation, Exit players must guide themselves through numerous obstacles while rescuing victims from life-threatening situations. Situations include braving fires, earthquakes and other disasters in various environments such as buildings, hospitals and subways. Players will undertake myriad actions, including running, jumping, climbing onto ledges and climbing down ropes on their way to becoming the ultimate escape artist. Players use decision-making skills and wits to escape various obstacles while rescuing people from more than 100 different emergencies. Additional levels are also available for download. Do whatever it takes to get everyone out in time: Rescue people and find the fastest way out while braving exploding factories, burning buildings and flooding subways. Players will climb ladders, move objects, slide down ropes and collect numerous rescue devices to assist them in their missions. Turn victims into allies: Saved characters can be enlisted to help move heavy objects, master tricky obstacles and help each other. Smooth, stylish character design and movement: Accompanying the intense action are some of the most stylish graphics to be seen on the PSP system, allowing for a viscerally and aesthetically satisfying experience. [Ubisoft]… Expand"}, {"name": "Pocky & Rocky Reshrined", "details_link": "https://www.metacritic.com/game/playstation-4/pocky-rocky-reshrined", "publisher": "Natsume", "release_date": "Jun 24 2022", "developers": ["NATSUME ATARI Inc."], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/a649ce8b319c68e9e2f53c8f1dff93aa-98.jpg", "descriptions": "Pocky the shrine maiden and Rocky the raccoon are back together in the latest game in the long-running classic shooter series! As the evil Black Mantle attacks, Pocky and Rocky need to team up once again, this time with some new friends to take on the upcoming challenges! With 8 stages ofPocky the shrine maiden and Rocky the raccoon are back together in the latest game in the long-running classic shooter series! As the evil Black Mantle attacks, Pocky and Rocky need to team up once again, this time with some new friends to take on the upcoming challenges! With 8 stages of high-paced shooting action, you'll have your hands full with creepy enemies, big bosses, and lots of twists and turns! … Expand"}, {"name": "The Sexy Brutale", "details_link": "https://www.metacritic.com/game/playstation-4/the-sexy-brutale", "publisher": "Badland Games", "release_date": "Apr 11 2017", "developers": ["Abstraction Games", "Tequila Works", "Cavalier Game Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/d5bf9df2bffd1ee76b9ff634243ae323-98.jpg", "descriptions": "The Sexy Brutale, a never-ending ball featuring intrigue, murder, and quite possibly the occult. Players have to unveil the secrets of The Sexy Brutale casino mansion and its inhabitants, as they relive the same mysterious and murderous masked ball."}, {"name": "Sniper Elite 4", "details_link": "https://www.metacritic.com/game/playstation-4/sniper-elite-4", "publisher": "Rebellion", "release_date": "Feb 14 2017", "developers": ["Rebellion"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/5e89ad4d84933f5984100f05a4bb4e77-98.jpg", "descriptions": "Welcome to Italy, 1943.\r Set in the aftermath of its award-winning predecessor, Sniper Elite 4 continues the series World War Two heritage by transporting players across the beautiful Italian peninsula, from sun-drenched Mediterranean coastal towns, to colossal Nazi mega structures,Welcome to Italy, 1943.\r Set in the aftermath of its award-winning predecessor, Sniper Elite 4 continues the series World War Two heritage by transporting players across the beautiful Italian peninsula, from sun-drenched Mediterranean coastal towns, to colossal Nazi mega structures, daunting forests and giddying mountain monasteries inspired by Monte Cassino.\r Covert agent and elite marksman Karl Fairburne must fight alongside the brave men and women of the Italian Resistance to help free their country from the yoke of Fascism, and defeat a terrifying new threat with the potential to halt the Allied fightback in Europe before its even begun.\r If his mission fails, there will be no Operation Overlord, no D-Day landings, and no Victory in Europe.… Expand"}, {"name": "Guilty Gear XX Accent Core", "details_link": "https://www.metacritic.com/game/playstation-2/guilty-gear-xx-accent-core", "publisher": "Aksys Games", "release_date": "Sep 11 2007", "developers": ["Arc System Works"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/7cff7dbb8cf79eeaec8649ec6eaeaefa-98.jpg", "descriptions": "This latest iteration in the Guilty Gear series returns with its trademark high-resolution graphics along with an entirely retuned fighting system, new stages, new characters, graphics, voices and the ability to create matches between old and new characters in the Generations Mode. Over 20This latest iteration in the Guilty Gear series returns with its trademark high-resolution graphics along with an entirely retuned fighting system, new stages, new characters, graphics, voices and the ability to create matches between old and new characters in the Generations Mode. Over 20 deadly combatants to choose from, including 2 new characters. All of your favorite characters have returned with new moves and an alternate EX version of each. Accent Core also introduces 2 reinvented fighters, A.B.A and Order-Sol that have never been seen outside of Japan. Refined fighting game system with 3 new gameplay systems. Accent Core’s Force Break, Throw Escape and Slash Back systems give all the fighters’ new defensive and offensive capabilities. New backgrounds, character voices and an introductory animation have been added for a fresh Guilty Gear experience. Multiple modes of mayhem. Hone your fighting skills in 5 different modes: Arcade, Medal of Millionaire, Versus, Survival and Training. [Aksys Games]… Expand"}, {"name": "NHL Eastside Hockey Manager", "details_link": "https://www.metacritic.com/game/pc/nhl-eastside-hockey-manager", "publisher": "Sega", "release_date": "Oct 19 2004", "developers": ["Sports Interactive"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Management", "Sim"], "meta_score": 77, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/45e4d644aec58fd384d3cd224d5a3131-98.jpg", "descriptions": "(Currently available in the UK/EU only) Take control your favourite hockey team or one of hundreds of other teams from all over the hockey world. Build and shape your roster by trading players, signing free-agents and drafting promising youngsters while managing your team towards glory.(Currently available in the UK/EU only) Take control your favourite hockey team or one of hundreds of other teams from all over the hockey world. Build and shape your roster by trading players, signing free-agents and drafting promising youngsters while managing your team towards glory. Select your team, set up practice schedules, select tactics, re-negotiate contracts and scout players from all over the world while interacting with your current stars and the media in order to appease the fans and the owners. The detailed in-game engine will let you see the game events unfold in the form of play-by-play commentary while also providing a wide range of statistics to analyze your team's performance. Build a dynasty; manage your local team to success and build your reputation in pursuit of developing your career at the bigger leagues; or you can remain faithful with the smaller teams and nurture generations. [Sega Europe]… Expand"}, {"name": "Final Fantasy XI: Chains of Promathia", "details_link": "https://www.metacritic.com/game/playstation-2/final-fantasy-xi-chains-of-promathia", "publisher": "Square Enix", "release_date": "Sep 21 2004", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 2"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Fantasy"], "meta_score": 77, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/eb4939474196649e9230ac4531aedbb9-98.jpg", "descriptions": "Chains of Promathia is an expansion pack to Final Fantasy XI, which brings more exciting adventures, features, and locations for all levels of gamers. The first cross-platform, cross-continent MMORPG, Final Fantasy XI, allows gamers to connect to the same exact world regardless of whetherChains of Promathia is an expansion pack to Final Fantasy XI, which brings more exciting adventures, features, and locations for all levels of gamers. The first cross-platform, cross-continent MMORPG, Final Fantasy XI, allows gamers to connect to the same exact world regardless of whether they are playing on a personal computer or a PS2 and whether they are playing in North America or Japan. [Square Enix]… Expand"}, {"name": "F-Zero GP Legend", "details_link": "https://www.metacritic.com/game/game-boy-advance/f-zero-gp-legend", "publisher": "Nintendo", "release_date": "Sep 20 2004", "developers": ["Suzak"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 77, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/9c4a332a13ba4d3be35819941969b912-98.jpg", "descriptions": "The F-Zero series grows with new racing circuits, an intense storyline, and multiplayer modes. F-Zero GP Legend lets you take control of one of eight characters, including Captain Falcon, racing star Rick Wheeler, the evil lord Black Shadow, and more. Guide your character through variousThe F-Zero series grows with new racing circuits, an intense storyline, and multiplayer modes. F-Zero GP Legend lets you take control of one of eight characters, including Captain Falcon, racing star Rick Wheeler, the evil lord Black Shadow, and more. Guide your character through various Grand Prix cups, time trials, and challenges that span multiple planets. In addition to conquering single-player challenges, you can challenge up to three of your friends in multiplayer competitions. … Expand"}, {"name": "MLB SlugFest: Loaded", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-slugfest-loaded", "publisher": "Midway", "release_date": "Jun 23 2004", "developers": ["Point of View"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/d072307b6cf1c26bfb1e0b93701f1a15-98.jpg", "descriptions": "MLB SlugFest: Loaded is on-fire, in-depth and online baseball. \"On-fire\" means that gamers will get more over-the-top moves, more control on the mound, more options at the plate, more outrageous commentary from Tim Kitzrow and Jim Shorts than ever before. \"In-depth\" means that we've addedMLB SlugFest: Loaded is on-fire, in-depth and online baseball. \"On-fire\" means that gamers will get more over-the-top moves, more control on the mound, more options at the plate, more outrageous commentary from Tim Kitzrow and Jim Shorts than ever before. \"In-depth\" means that we've added arguably the deepest Franchis Mode ever in a baseball videogame. And \"Online\" means that the best multiplayer baseball game is ready for the largest multiplayer audience there is, world-wide. MLB SlugFest: Loaded is here... Get out of my way! [Midway]… Expand"}, {"name": "The Suffering", "details_link": "https://www.metacritic.com/game/playstation-2/the-suffering", "publisher": "Midway", "release_date": "Mar  9 2004", "developers": ["Surreal Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 77, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/898b57473a519a2edbae56770c4ba00f-98.jpg", "descriptions": "The Suffering captures the disturbing and terrifying nature of the horror genre in a compelling third-person action/adventure game set in the mature and gritty world of a maximum-security prison. By alternating periods of tense and terror-filled exploration with frenetic combat sequences,The Suffering captures the disturbing and terrifying nature of the horror genre in a compelling third-person action/adventure game set in the mature and gritty world of a maximum-security prison. By alternating periods of tense and terror-filled exploration with frenetic combat sequences, The Suffering creates the ultimate experience of terror. In the dark world of The Suffering, creatures jump out of shadows, fall out of trees, and erupt out of the ground, attacking the player in the most frightening ways possible. Along with a cast of uniquely hardened criminals and guards, you?ll battle not only the ghoulish apparitions besieging the prison but also the demons of your own forgotten past. The player controls the prisoner Torque, a hardened inmate in his late 20s, sentenced to die for a murder he may or may not have actually committed. Underneath Torque?s tough exterior hides a man who is not quite psychologically balanced, who fears far more than he would ever admit to. As a side effect of his mental instability, Torque has flashbacks to the events from his past, throbbing images that depict the events that lead up to the crime for which he was imprisoned. Torque is also subject to black outs where he becomes extremely violent and transforms into a massive monster hell-bent on destruction. [Midway]… Expand"}, {"name": "FIFA Soccer 2004", "details_link": "https://www.metacritic.com/game/pc/fifa-soccer-2004", "publisher": "EA Sports", "release_date": "Nov  4 2003", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/2d60c62ec8964e691f8101cdba1ebc69-98.jpg", "descriptions": "A new Career Mode gives you the chance to take a team from the lower divisions, battle through ranks, sign new players, and turn them into champions. Take control of players away from the ball, and run them into space for attacking passes or gain valuable position during dead ball kicks. AA new Career Mode gives you the chance to take a team from the lower divisions, battle through ranks, sign new players, and turn them into champions. Take control of players away from the ball, and run them into space for attacking passes or gain valuable position during dead ball kicks. A fine-tuned game engine, and new animations dramatically enhance the smoothness in player movement. Deeper team AI, attributes, tactics, playing styles, control, and individual player personalities. Build your franchise and guide your club to the Championship by making calculated front-office decisions with Career Mode. When one season ends and another begins new challenges will present themselves. More than 300 new crowd chants at an ever growing list of officially licensed stadiums help put you in the best seat in the house. Plus, an all-new dynamic weather feature even affects gameplay, so choose your home wisely. More than 500 official licenses, including 16 leagues, 350 teams and 10,000 players. From Europe?s super leagues to the Americas Club Championship, FIFA Soccer 2004 has the most authentic selection of the world?s best. A Game With No Boundaries: Go online and take on opponents from anywhere in the country. An online lobby area where gamers can meet, greet, chat and play head-to-head provides the ultimate interactive experience. [EA Sports]… Expand"}, {"name": "The Thing", "details_link": "https://www.metacritic.com/game/pc/the-thing", "publisher": "VU Games", "release_date": "Aug 20 2002", "developers": ["Computer Artworks"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/3dacec18a2a41d5b048273ef94576452-98.jpg", "descriptions": "Dropped into the frozen wastelands of Antarctica, you're the leader of a military rescue team sent to investigate the mysterious deaths of an American scientific expedition. In the punishing wind and cold, your team encounters a strange, shape-shifting alien life form that assumes theDropped into the frozen wastelands of Antarctica, you're the leader of a military rescue team sent to investigate the mysterious deaths of an American scientific expedition. In the punishing wind and cold, your team encounters a strange, shape-shifting alien life form that assumes the appearances of the people it kills. This monster is difficult to see, hard to kill, and seemingly impossible to evade. And when you see it, it's often too late. [Universal Interactive]… Expand"}, {"name": "All-Star Baseball 2002", "details_link": "https://www.metacritic.com/game/playstation-2/all-star-baseball-2002", "publisher": "Acclaim", "release_date": "Mar 12 2001", "developers": ["Acclaim Studios Austin"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/a5a75dc2e39978bf717d2c2b3fdd7c96-98.jpg", "descriptions": "This latest rendition sticks to the basic things that have made the series great, making it worthwhile even for those who aren't fans of the older games."}, {"name": "Starfleet Command Volume II: Empires at War", "details_link": "https://www.metacritic.com/game/pc/starfleet-command-volume-ii-empires-at-war", "publisher": "Interplay", "release_date": "Dec 13 2000", "developers": ["Taldren"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Strategy", "Real-Time", "General", "Tactics"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/f344fc2bb1cf7d0c2ae6394478052063-98.jpg", "descriptions": "Serve the Empire well and it will shower rank, medals, prestige, and new ships on you. Serve the Empire ill and ... well, space is full of tiny Police Frigates, each manned by crews that never distinguished themselves in battle. [Interplay]"}]