[{"name": "Harry Potter and the Deathly Hallows, Part 1", "details_link": "https://www.metacritic.com/game/xbox-360/harry-potter-and-the-deathly-hallows-part-1", "publisher": "Electronic Arts", "release_date": "Nov 16 2010", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 38, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/037f69d99c17151d82b4552040c174f9-98.jpg", "descriptions": "Harry Potter takes a dark turn in this third-person shooter as he battles death eaters and dementors while fleeing for his life across the wilds of England."}, {"name": "Far Cry Vengeance", "details_link": "https://www.metacritic.com/game/wii/far-cry-vengeance", "publisher": "Ubisoft", "release_date": "Dec 12 2006", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 38, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/f3b08361343ee6c9e100dd769b09adc8-98.jpg", "descriptions": "The incident at Jacutan Archipelago changed Jack Carver's life forever. Jack has had little choice but to embrace the disturbing talents unleashed by Krieger's unique brand of folk medicine. Back at his home port in Micronesia, Jack thought he had finally found paradise. But when a gorgeousThe incident at Jacutan Archipelago changed Jack Carver's life forever. Jack has had little choice but to embrace the disturbing talents unleashed by Krieger's unique brand of folk medicine. Back at his home port in Micronesia, Jack thought he had finally found paradise. But when a gorgeous woman draws him in on a dangerous heist, their sun-drenched days take a chilling turn. Hunted for a murder he didn't commit, Jack must draw on his most savage instincts to make his predators his prey. Dig deeper into the power of the Wii Remote and Nunchuck through survival tactics that include driving, shooting, jumping, balancing, climbing, grenading, and Far Cry’s ever-popular Feral attacking. Choose from a variety of weapons in a struggle to endure the rebel-infested jungle. Take down an unsuspecting victim from behind with a machete or meet the fight head-on with your machine gun. From ATVs to hovercrafts, pickup trucks to Jet Skis, drive over, around, and through vicious combat situations. Utilize the lush, tropical surroundings to your advantage, using stealth to sneak through the foliage past unsuspecting rebels. Feel what its like to be the predator, not the prey, as you unleash the beast within. Jump higher, run faster, and slash with more fury than all of your enemies combined through the animalistic feral abilities unique to the Far Cry series. Challenge your friends in Far Cry: Vengeance's frenetic Chaos mode as you battle to be the last person standing. [Ubisoft]… Expand"}, {"name": "Touhou Kobuto V: Burst Battle", "details_link": "https://www.metacritic.com/game/switch/touhou-kobuto-v-burst-battle", "publisher": "NIS America", "release_date": "Oct 10 2017", "developers": ["CUBETYPE"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 38, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/aeec7f4c29d70d1aea4ad9491649ff09-98.jpg", "descriptions": "Touhou Kobuto V: Burst Battle is a bullet-hell battle game that takes place in the Touhou universe. Take control of one of nine Touhou characters and eliminate your opponent using bullet-hell patterns, melee attacks, or spell cards. Featuring ear-tingling beats for each character, you mightTouhou Kobuto V: Burst Battle is a bullet-hell battle game that takes place in the Touhou universe. Take control of one of nine Touhou characters and eliminate your opponent using bullet-hell patterns, melee attacks, or spell cards. Featuring ear-tingling beats for each character, you might just find yourself dancing while you play.… Expand"}, {"name": "Randall", "details_link": "https://www.metacritic.com/game/playstation-4/randall", "publisher": "We The Force", "release_date": "Jun  6 2017", "developers": ["We The Force"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 38, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/4/db3db13c8c36d5311f990f6bb5d78a45-98.jpg", "descriptions": "Randall wakes up in a dystopian world in which people are content living under constant surveillance and absolute control. Players take on the part of Randall, a powerful telepath with a touch of schizophrenia. His abilities allow him to control and play as every single character on screen,Randall wakes up in a dystopian world in which people are content living under constant surveillance and absolute control. Players take on the part of Randall, a powerful telepath with a touch of schizophrenia. His abilities allow him to control and play as every single character on screen, seamlessly swapping between them, exploiting the power that they have. [Playstation.com]… Expand"}, {"name": "Tenchu: Dark Secret", "details_link": "https://www.metacritic.com/game/ds/tenchu-dark-secret", "publisher": "Nintendo", "release_date": "Aug 21 2006", "developers": ["From Software", "Polygon Magic"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 37, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/caf745a9c4a144525cb88dc5eb36c4fe-98.jpg", "descriptions": "(Also known as \"Tenchu: Dark Shadow\"  Tenchu: Dark Secret places you in the shoes of ninja assassins charged with protecting the life of a princess. Stalk your enemies with sword in hand, plant explosive traps in the underbrush, or strike with an assortment of realistic ninja weaponry - the(Also known as \"Tenchu: Dark Shadow\"  Tenchu: Dark Secret places you in the shoes of ninja assassins charged with protecting the life of a princess. Stalk your enemies with sword in hand, plant explosive traps in the underbrush, or strike with an assortment of realistic ninja weaponry - the choice is yours. Features over 40 single-player missions and the ability to construct your own weapons and items. Prove your mettle with the metal by challenging friends to a local wireless multiplayer match. Tenchu: Dark Secret boasts three unique modes and a whole host of options to keep each match fresh and fun. Whether you're creeping through a bamboo forest to plunge a dagger into your friend's back or setting a trap to steal his precious dumplings, you're going to need a towel to wipe the sweat from your hands. Need a new bamboo trap? Short on shurikins? Just hop online. Tenchu: Dark Secret allows players to buy, sell, and trade items via Nintendo Wi-Fi Connection. You can choose to transact with either friends or strangers. [Nintendo]… Expand"}, {"name": "Napoleon Dynamite: The Game", "details_link": "https://www.metacritic.com/game/psp/napoleon-dynamite-the-game", "publisher": "Crave", "release_date": "Oct 23 2007", "developers": ["7 Studios"], "platforms": "PSP", "num_players": "2 ", "genres": ["Action", "Miscellaneous", "Puzzle", "General", "General", "Puzzle", "Party / Minigame", "General"], "meta_score": 37, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/fb1c6bfa670b7876e9a2fd3eb95ae9eb-98.jpg", "descriptions": "Step into the moon boots of Napoleon Dynamite and relive some flippin sweet movie moments like dancing to Z-Kwon, throwing the pigskin a quarter mile with Uncle Rico, smashing piñatas with Pedro and many more! Napoleon Dynamite brings 20 mini games for the DS and 30 for the PSP that reallyStep into the moon boots of Napoleon Dynamite and relive some flippin sweet movie moments like dancing to Z-Kwon, throwing the pigskin a quarter mile with Uncle Rico, smashing piñatas with Pedro and many more! Napoleon Dynamite brings 20 mini games for the DS and 30 for the PSP that really need you to use all your good skills to pass…even your bow-hunting skills for when you're hunting Wolverines with your uncle in Alaska! So hurry up and play already and all your wildest dreams will come true. Gosh! [Crave]… Expand"}, {"name": "Torino 2006 - The Official Video Game of the XX Olympic Winter Games", "details_link": "https://www.metacritic.com/game/pc/torino-2006---the-official-video-game-of-the-xx-olympic-winter-games", "publisher": "2K Sports", "release_date": "Jan 24 2006", "developers": ["49Games"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 37, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/5e8dfd012a4068d3b2844cce69f840cf-98.jpg", "descriptions": "Featuring eight winter disciplines, 15 events, extraordinary wintry landscapes and authentic commentator analysis, Torino 2006 gives gamers the chance to participate in one of the most exciting sporting events of 2006. With a multiplayer mode for up to four players, gamers can competeFeaturing eight winter disciplines, 15 events, extraordinary wintry landscapes and authentic commentator analysis, Torino 2006 gives gamers the chance to participate in one of the most exciting sporting events of 2006. With a multiplayer mode for up to four players, gamers can compete head-to-head or in turnbased play that simulates the global stage of one of the most exciting sporting events in 2006. Features 8 disciplines with 15 different events including; Skiing, Biathlon, Bobsleigh, Luge, Speed Skating, Ski Jumping, Cross-Country Skiing, and Nordic Combined. Challenge your skills with 3 difficulty levels in each sport. [2K Sports]… Expand"}, {"name": "Pocket Pool", "details_link": "https://www.metacritic.com/game/psp/pocket-pool", "publisher": "Eidos Interactive", "release_date": "Apr 18 2007", "developers": ["Conspiracy Entertainment"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 37, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/d8a48326bbf9df96a3cb4c4ff313021d-98.jpg", "descriptions": "Grab your stick and get ready to shoot pool with some Honeys! Shoot 13 different types of pool with some of the hottest honeys in the bar. Pocket Pool features a dynamic 3D engine that simulates realistic pool play from almost every angle. Start off in a honky-tonk and work your way up toGrab your stick and get ready to shoot pool with some Honeys! Shoot 13 different types of pool with some of the hottest honeys in the bar. Pocket Pool features a dynamic 3D engine that simulates realistic pool play from almost every angle. Start off in a honky-tonk and work your way up to the mansion or yacht – and when you win, boy will you be rewarded. Wins unlock sexy videos and pictures of the glamorous Dream models – plus more surprises! What are you waiting for? Rack 'em up! [from Eidos Interactive]… Expand"}, {"name": "Speed Zone", "details_link": "https://www.metacritic.com/game/wii/speed-zone", "publisher": "Detn8", "release_date": "Aug 18 2009", "developers": ["Awesome Play Ltd."], "platforms": "Wii", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 37, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/7/d720a9adaf18b43da7dea3d0704f9b36-98.jpg", "descriptions": "(Known as \"Wheelspin\" in the UK/EU)  SOLO mode -  with phantom cars and racing lines to guide you. RACE mode - go head-to-head against 7 friends or computer AI drivers. BATTLE mode -  blast your opponents with massive weapons. 30 levels of dramatic racing action. Roller coaster race tracks(Known as \"Wheelspin\" in the UK/EU)  SOLO mode -  with phantom cars and racing lines to guide you. RACE mode - go head-to-head against 7 friends or computer AI drivers. BATTLE mode -  blast your opponents with massive weapons. 30 levels of dramatic racing action. Roller coaster race tracks with loops, twists, and hairpin turns. Stunning terrains set on colorful planets, floating asteroids, and space stations. Progressive level-unlock structure - play your way to the top of the innovative 3D pyramid menu. Engine upgrades and other car mods - over 160 variations to 6 basic cars. Off-track secret bonuses and hidden shortcuts. Use boost pads to make incredible jumps and accelerate into the SPEED ZONE! Revisit unlocked tracks with enhanced cars to set an overall Apex Score Rating. Unlock all levels, find all the secrets, earn all the bonuses and medals. [Detn8]… Expand"}, {"name": "TMNT", "details_link": "https://www.metacritic.com/game/psp/tmnt", "publisher": "Ubisoft", "release_date": "Mar 20 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 37, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/ed5a1dde0eb8cce0d37ab7796d3f017d-98.jpg", "descriptions": "Based on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they faceBased on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they face their most trying time both as heroes and as brothers. With the fate of the City and their family at stake, it's up to Leonardo with Zen Master Splinter to restore unity and ninja discipline to the Turtles. In this highly immersive experience, join the Ninja Turtles team and experience intense acrobatic navigation, collaborative combat and powerful fighting moves. Engage in over-the-top Ninja action to reunite the Turtles and save New York City. Leonardo, Raphael, Donatello and Michelangelo are playable, each with unique acrobatic moves, weapons and combat skills, such as Michelangelo’s fast nunchuk face slap and Raphael’s powerful Sai throw. [Ubisoft]… Expand"}, {"name": "Aqua Teen Hunger Force Zombie Ninja Pro-Am", "details_link": "https://www.metacritic.com/game/playstation-2/aqua-teen-hunger-force-zombie-ninja-pro-am", "publisher": "Midway", "release_date": "Nov  5 2007", "developers": ["Creat Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 37, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/4225187824865de8ac339545bdd69f50-98.jpg", "descriptions": "Aqua Teen Hunger Force Zombie Ninja Pro-Am is an epic, action-adventure combat golf, cart racing game that gives fans an opportunity to experience the Aqua Teen universe in a whole new way. When Frylock is admitted to the prestigious Jersey Pines Golf Club, Master Shake decides to show theAqua Teen Hunger Force Zombie Ninja Pro-Am is an epic, action-adventure combat golf, cart racing game that gives fans an opportunity to experience the Aqua Teen universe in a whole new way. When Frylock is admitted to the prestigious Jersey Pines Golf Club, Master Shake decides to show the uppity members that he is also just as good (and uppity) and deserves a place in their exclusive club. Meatwad is, of course, persuaded to join in, and the three crime-fighting food products use golf clubs and a variety of other weapons in ways not intended as they battle numerous villains, fan favorites and other show characters. [Midway]… Expand"}, {"name": "Shifters", "details_link": "https://www.metacritic.com/game/playstation-2/shifters", "publisher": "3DO", "release_date": "Jun 17 2002", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 37, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/c6096a4f7378fd64b73db794e3ed2bec-98.jpg", "descriptions": "Your world has begun to change. Bizarre deadly creatures of metal and flesh roam the lands, their origin a complete mystery to those who can survive their attacks. Odd contraptions and structures of steel and steam have begun to replace once quaint medieval villages. The order of the veryYour world has begun to change. Bizarre deadly creatures of metal and flesh roam the lands, their origin a complete mystery to those who can survive their attacks. Odd contraptions and structures of steel and steam have begun to replace once quaint medieval villages. The order of the very universe is shifting, and somehow, you know there is a connection between these bizarre changes and your own newfound power to shapeshift. Chaos has begun to ravage the kingdom, and the very magic which preserved the order of existence has is fading. It's up to you to find the artifact and face the madman before the magic that holds the universe together is lost forever. Battle all-new enemies, travel to new worlds, and develop your strengths. Use your power to shapeshift into numerous powerful forms in your quest. Only you can reverse the paradox and prevent the total destruction both worlds! [3DO]… Expand"}, {"name": "Legend of the Dragon", "details_link": "https://www.metacritic.com/game/wii/legend-of-the-dragon", "publisher": "The Game Factory", "release_date": "May  1 2007", "developers": ["Neko Entertainment"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 37, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/83af19c5e94d2cccf8c2255b4aeb6d87-98.jpg", "descriptions": "Join the battle to maintain the universal balance between darkness and light with all the popular characters from the animated TV series: Ang Lueng never dreamed that he would be the next Golden Dragon. He always assumed his twin sister, Ling, the best fighter of the Dragon Dojo run by theirJoin the battle to maintain the universal balance between darkness and light with all the popular characters from the animated TV series: Ang Lueng never dreamed that he would be the next Golden Dragon. He always assumed his twin sister, Ling, the best fighter of the Dragon Dojo run by their mentor Master Chin, was next in line. Ling is deeply humiliated. She swears to take vengeance upon those who betrayed her, starting with her brother and Master Chin. The lure of power from the Zodiac Master proves too much for Ling. Her hatred leads her into darkness and she becomes the Shadow Dragon. Enjoy the magic tale of the Legend of the Dragon in this combat action/adventure game that combines the fighting sequences and compelling story line of the TV series - all wrapped up in game play and animation. All the important places from the cartoon series are present in the game as combat arenas: The 12 sacred temples, The Dragon Dojo, The Zodiac Master's hideout, The Temple of Shadow Dragon, The Great Wall of China, Hong Kong Bay. 8 different game modes ensure hours of challenging game-play: Play Quest mode, Arcade mode, Training mode, Survival mode, Time Attack mode, versus mode, Team Battle mode, Tag mode. The Nunchunck is used for character directional moves, The Wii Remote is used for all movements related to fighting and the spell sytem uses the gyroscopic system of the Wii Remote. [Game Factory]… Expand"}, {"name": "Quantum Theory", "details_link": "https://www.metacritic.com/game/xbox-360/quantum-theory", "publisher": "Tecmo", "release_date": "Sep 28 2010", "developers": ["Tecmo"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "10  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 37, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/3/5b8edf23968c2a9dbe504b5e9a89c738-98.jpg", "descriptions": "Many years have passed since the world war inflicted catastrophic damage on the human race, leaving only a few survivors. In their new community \"Cocoon,\" life has been threatened by a black material called Erosion, creating a post-apocalyptic environment. Surviving humans recruitMany years have passed since the world war inflicted catastrophic damage on the human race, leaving only a few survivors. In their new community \"Cocoon,\" life has been threatened by a black material called Erosion, creating a post-apocalyptic environment. Surviving humans recruit a militia to conquer the Erosion and set out to take down the evil, \"Living Tower\".  Arriving at the scene is the stalwart warrior Syd, whose only intentions are to destroy the Tower.  He meets the beautiful and mysterious Filena as they both ascend to the top in their search for answers. The erosion of the Tower intensifies as the players climb up through the moving landform.… Expand"}, {"name": "Duke Nukem: Land of the Babes", "details_link": "https://www.metacritic.com/game/playstation/duke-nukem-land-of-the-babes", "publisher": "GT Interactive", "release_date": "Sep 19 2000", "developers": ["n-Space"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 37, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/d598f25bc7b62cec2be2f2018d1287f1-98.jpg", "descriptions": "In the distant Future, vicious aliens rule the Earth. Only bodacious babes survive, enslaved by the hostile alien overlords. The women and the world need a hero. And there is only one man big enough for the job! Duke Nukem is back! And he's ready to score!"}, {"name": "Fight Club", "details_link": "https://www.metacritic.com/game/xbox/fight-club", "publisher": "VU Games", "release_date": "Nov 16 2004", "developers": ["Genuine Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 37, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/9/6d1979af3dc336490927210c90215307-98.jpg", "descriptions": "Broken bones, blood-stained and ripped clothes, and facial deformations are common in Fight Club. Based on the movie of the same name, Fight Club lets you play as one of the many characters from the movie as they fight until someone goes limp, taps out, or is beaten to a pulp. With threeBroken bones, blood-stained and ripped clothes, and facial deformations are common in Fight Club. Based on the movie of the same name, Fight Club lets you play as one of the many characters from the movie as they fight until someone goes limp, taps out, or is beaten to a pulp. With three different fighting styles and intuitive controls, the game creates a challenging experience for fighting fans of all levels.… Expand"}, {"name": "Agony", "details_link": "https://www.metacritic.com/game/playstation-4/agony", "publisher": "PlayWay", "release_date": "May 29 2018", "developers": ["Madmind Studio"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 37, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/791cda274ac58355560236ae2da79d31-98.jpg", "descriptions": "Agony is a first-person, survival horror set in hell. You will begin your journey as a tormented soul within the depths of hell without any memories about your past. The special ability to control people on your path, and possess demons, gives you the measures to survive."}, {"name": "Crash Boom Bang!", "details_link": "https://www.metacritic.com/game/ds/crash-boom-bang!", "publisher": "Sierra Entertainment", "release_date": "Oct 10 2006", "developers": ["Dimps Corporation"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 37, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/9/8822829770128ef42aad45318af397f7-98.jpg", "descriptions": "In Crash Boom Bang!, Crash and his friends embark on a worldwide race in a quest for its multi-million dollar prize.  With hidden intentions of finding an ancient lost city and the famed magical \"Super Big Power Stone\" that grants its user one wish, the race’s sponsor Viscount Devil plans onIn Crash Boom Bang!, Crash and his friends embark on a worldwide race in a quest for its multi-million dollar prize.  With hidden intentions of finding an ancient lost city and the famed magical \"Super Big Power Stone\" that grants its user one wish, the race’s sponsor Viscount Devil plans on using the contestants to solve the mystery.  The map of the race checkpoints is based on the Viscount’s ancient map, and the evil Dr. Neo Cortex, also an invitee to the race, has figured out the Viscount’s master plan and in his own relentless pursuit for world domination, sets out to steal the map and retrieve the legendary stone.  It’s up to Crash and his friends to win the big race ... and save the world! [Vivendi]… Expand"}, {"name": "Gauntlet: Dark Legacy", "details_link": "https://www.metacritic.com/game/game-boy-advance/gauntlet-dark-legacy", "publisher": "Midway", "release_date": "Nov 25 2002", "developers": ["Pocket Studios"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 37, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/328c238b8d64eeac81a02fb366345da3-98.jpg", "descriptions": "Gauntlet's hack-and-slash gameplay continues in Gauntlet: Dark Legacy. You and up to three of your friends must work as a team through eight dangerous worlds. As one of eight different characters, you'll vanquish creatures, evade traps, and search for treasure. Character-based power attacks,Gauntlet's hack-and-slash gameplay continues in Gauntlet: Dark Legacy. You and up to three of your friends must work as a team through eight dangerous worlds. As one of eight different characters, you'll vanquish creatures, evade traps, and search for treasure. Character-based power attacks, magic potions, new power-ups, and combination moves add to the mayhem. The game save system allows players to transfer evolving characters from their own machine to a friend's to take on the dungeon together.… Expand"}, {"name": "Hour of Victory", "details_link": "https://www.metacritic.com/game/xbox-360/hour-of-victory", "publisher": "Midway", "release_date": "Jun 25 2007", "developers": ["Nfusion"], "platforms": "Xbox 360", "num_players": "12  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 37, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/0/d156fcf2e00955f6ab22de291156de97-98.jpg", "descriptions": "Hour of Victory allows you to play a key role in the pivotal and cinematic battles from the European and North African theaters of World War II, using the skills and gameplay style you choose. Sneak into enemy territory as a covert operative, storm the gates as a British Commando, or snipeHour of Victory allows you to play a key role in the pivotal and cinematic battles from the European and North African theaters of World War II, using the skills and gameplay style you choose. Sneak into enemy territory as a covert operative, storm the gates as a British Commando, or snipe from afar as an Army Ranger – each character's unique attributes will be needed for the fulfillment of the overall objective. Only with all these skills working closely together will you be able to say that you helped define the Hour of Victory. Three Unique POVs - Players can pick from a Covert Operative, specializing in stealth and sabotage; a British Commando specializing in the guns-blazing frontal assault; or an Army Ranger who specializes in sniping and demolitions. Full Use of Any Vehicle on the Battlefield - Use any of the vehicles you find on the battlefield to accomplish your mission. From Sherman Tanks to the Axis Tiger Tanks to the Kubelwagons, if you can see it, you can drive it in Hour of Victory. Cinematic Gameplay - Hour of Victory blends authentic details and realism of World War II with frenetic gameplay. From the JU-88 Bombers in the sky to the Panzers in the streets, Hour of Victory bombards you from all angles. [Midway]… Expand"}, {"name": "Blackwater", "details_link": "https://www.metacritic.com/game/xbox-360/blackwater", "publisher": "505 Games", "release_date": "Oct 25 2011", "developers": ["Zombie Studios"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 37, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/ea1a71dfa96b21d593817863dd0f2ce4-98.jpg", "descriptions": "A first of its kind shooter, Blackwater reinvents the modern combat shooter genre by giving players the ability to completely control the gameplay experience using either a traditional controller or Kinect for Xbox 360’s controller-free abilities which introduces an unprecedented level ofA first of its kind shooter, Blackwater reinvents the modern combat shooter genre by giving players the ability to completely control the gameplay experience using either a traditional controller or Kinect for Xbox 360’s controller-free abilities which introduces an unprecedented level of immersion to the FPS genre. Blackwater takes its namesake from the private security company founded in 1997 by Erik Prince, a former Navy SEAL, to provide training support to military and law enforcement agencies.… Expand"}, {"name": "NFL Blitz 20-02", "details_link": "https://www.metacritic.com/game/game-boy-advance/nfl-blitz-20-02", "publisher": "Midway", "release_date": "Sep 17 2001", "developers": ["OutLook Entertainment"], "platforms": ["PlayStation 2", "Game Boy Advance"], "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 37, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/c16810dd39b207fb2e282ca4f3cbd331-98.jpg", "descriptions": "NFL Blitz 2002 for the Game Boy Advance isn't just a mere distortion of football, but a botched imitation of NFL Blitz itself."}, {"name": "Left Alive", "details_link": "https://www.metacritic.com/game/playstation-4/left-alive", "publisher": "Square Enix", "release_date": "Mar  5 2019", "developers": ["Square Enix", "ilinx inc."], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 37, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/395ef6f28f3a6c319f65a61b6cdfce89-98.jpg", "descriptions": "Left Alive tells a human story of survival from the perspective of three different protagonists during the devastating invasion set in war-torn Novo Slava in 2127."}, {"name": "Defender", "details_link": "https://www.metacritic.com/game/game-boy-advance/defender", "publisher": "Midway", "release_date": "Nov  3 2002", "developers": ["OutLook Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 37, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7288e10f4e532b5f55b001dea37b1252-98.jpg", "descriptions": "Defender undergoes a 3D makeover, featuring fast-paced action, strategy, and an army of aliens. A remake of an arcade classic, Defender sends you on a mission to defend your solar system and save the human race from alien invasion. In addition to space combat action, the game showcasesDefender undergoes a 3D makeover, featuring fast-paced action, strategy, and an army of aliens. A remake of an arcade classic, Defender sends you on a mission to defend your solar system and save the human race from alien invasion. In addition to space combat action, the game showcases elements of strategy, multiple types of humans to protect and use, ground units for players to defend and position, and bases to build and expand. And now, you can upgrade your Defender ships with special weapons, shields, and other technologies.… Expand"}, {"name": "Rocky and Bullwinkle", "details_link": "https://www.metacritic.com/game/xbox-360/rocky-and-bullwinkle", "publisher": "Microsoft Game Studios", "release_date": "Apr 16 2008", "developers": ["Zen Studios"], "platforms": "Xbox 360", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 37, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/5affde3fb69e7539ad8bc309eb2ffc49-98.jpg", "descriptions": "[Xbox Live Arcade]  Rocky & Bullwinkle offers a fast, fun collection of over 100 micro-games, starring your favorite characters from the classic cartoon series: Rocky and Bullwinkle, Boris and Natasha, Dudley Do-Right, and many more. Xbox LIVE Vision owners can control 25 of the games using[Xbox Live Arcade]  Rocky & Bullwinkle offers a fast, fun collection of over 100 micro-games, starring your favorite characters from the classic cartoon series: Rocky and Bullwinkle, Boris and Natasha, Dudley Do-Right, and many more. Xbox LIVE Vision owners can control 25 of the games using gestures. The fast action and quick games create an easy pick-up-and-play experience for gamers of all ages. Hotseat multiplayer: Up to twelve players can compete locally in hotseat mode. [ZEN Studios]… Expand"}, {"name": "Underworld Ascendant", "details_link": "https://www.metacritic.com/game/pc/underworld-ascendant", "publisher": "OtherSide Entertainment", "release_date": "Nov 15 2018", "developers": ["OtherSide Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 37, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/0/76c60c6bce846eff089cd895297fc04d-98.jpg", "descriptions": "In 1992, Ultima Underworld changed the rules of what a fantasy RPG could be.  It introduced the concept immersion, a player-authored experience, and an open-world to explore.  The games is considered one of the most innovative and renowned RPG’s of its generation."}, {"name": "Wonder World Amusement Park", "details_link": "https://www.metacritic.com/game/wii/wonder-world-amusement-park", "publisher": "Majesco Games", "release_date": "Jul  8 2008", "developers": ["Coyote Console"], "platforms": ["3DS", "Wii"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 37, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/2a5970feed51cac44f26ad79527f307d-98.jpg", "descriptions": "All of the fun and thrills of your favorite amusement parks and carnivals are now available in your living room. In Wonder World Amusement Park, you can take your customized character through a fully 3D park with five themed zones and hop on five heart-pounding interactive rides. PlayAll of the fun and thrills of your favorite amusement parks and carnivals are now available in your living room. In Wonder World Amusement Park, you can take your customized character through a fully 3D park with five themed zones and hop on five heart-pounding interactive rides. Play through a huge variety of mini-games as you win outfits and prizes for your unique character. Step right up and test your skills in a fun filled experience for the whole family. [Majesco]… Expand"}, {"name": "Ready 2 Rumble Revolution", "details_link": "https://www.metacritic.com/game/wii/ready-2-rumble-revolution", "publisher": "Atari", "release_date": "Mar 17 2009", "developers": ["10tacle Studios"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 37, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/158a3c0a6eed14dd44b10c610020bc2f-98.jpg", "descriptions": "The hilarious Ready 2 Rumble franchise is flexing its muscles and planning a major, star-studded return to the ring with the launch of Ready 2 Rumble Revolution, the newest game in the much-loved series.  Bringing the franchise to Wii for the first time, the game retains all the knockoutThe hilarious Ready 2 Rumble franchise is flexing its muscles and planning a major, star-studded return to the ring with the launch of Ready 2 Rumble Revolution, the newest game in the much-loved series.  Bringing the franchise to Wii for the first time, the game retains all the knockout features of best-sellers Ready 2 Rumble Boxing Round 1 and Round 2, while delivering a knockout punch of style and attitude.  Tailored to take advantage of the motion-controlled realism of Wii, Ready 2 Rumble Revolution makes landing a punch more fun than ever. Ready 2 Rumble Revolution features a roster of 18 wildly caricatured cartoony boxers, all parodies of celebrities from the worlds of sports, music and movies who enter the ring as larger-than-life \"Rumble-ized\" versions of themselves. Players will step right up and see if they can knock these super-sized egos down a peg or two! The game is hosted by The Voice of the Champions Michael Buffer, famous for his \"Let’s Get Ready to Rumble\" trademark call.  Characters are brought to life with hilarious moves, detailed facial animations, damage textures and fighting techniques including special moves, combos, extreme knockdowns and special Rumble combos.  An all new Championship Mode lets gamers create their own unique boxer and nurture his skills through mini-games, developing him as a fighter and creating a completely personalized Ready 2 Rumble Revolution experience. Developed by AKI who bring their formidable fight game know-how to the franchise, Ready 2 Rumble Revolution brings a virtual boxing arena to the living room and delivers a fun and intuitive experience in either single player or multiplayer mode.  The Wii controllers provide would-be pugilists with an intuitive and realistic feel.  Using the Nunchuk controller as one glove and the Wii Remote controller as the other, players dodge, weave and throw the big punches to KO their opponents. Virtual heavyweights can fight from the backstreet gym all the way to the big Las Vegas showdown with vivid new visuals bringing the five spectacular ring environments to life.  The arcade experience is made even better thanks to advanced Artificial Intelligence allowing more strategic fights. [Atari]… Expand"}, {"name": "Mike Tyson Heavyweight Boxing", "details_link": "https://www.metacritic.com/game/xbox/mike-tyson-heavyweight-boxing", "publisher": "Codemasters", "release_date": "Jul 17 2002", "developers": ["Atomic Planet Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 37, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/b0945220829751a157e963456399cf45-98.jpg", "descriptions": "Mike Tyson Boxing proves that one of history's oldest sports is also one of its bloodiest. The game allows boxers to deliver intense pain to their opponents with 600 brutal power punches, illegal moves, signature blows, and combos. As one of the game's professional pugilists, or your ownMike Tyson Boxing proves that one of history's oldest sports is also one of its bloodiest. The game allows boxers to deliver intense pain to their opponents with 600 brutal power punches, illegal moves, signature blows, and combos. As one of the game's professional pugilists, or your own customized fighter, you'll work your way through the bronze and silver ranks for a one-on-one meeting with Mike Tyson. Bring the big fight home in such venues as Carnival City, Ceasars Palace, and Wembley Arena.… Expand"}, {"name": "Crystal Rift", "details_link": "https://www.metacritic.com/game/playstation-4/crystal-rift", "publisher": "Psytec Games Ltd", "release_date": "Nov 29 2016", "developers": ["Psytec Games Ltd"], "platforms": ["PC", "PlayStation 4"], "genres": ["Role-Playing", "Action Adventure", "General", "Western-Style"], "meta_score": 37, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/8714902fa3cc96a0cd9d9d3626124dc6-98.jpg", "descriptions": "A grid-based dungeon-crawler in classic first person perspective. Crystal Rift is inspired by classic dungeon games such as Dungeon Master and Eye of the Beholder with grid-based movement. It has been developed primarily for VR, but is also an experience for those without headsets."}, {"name": "Traitors Gate 2", "details_link": "https://www.metacritic.com/game/pc/traitors-gate-2", "publisher": "The Adventure Company", "release_date": "Nov  2 2003", "developers": ["258 Productions AB"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Modern", "Third-Person"], "meta_score": 37, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/1/4e1d96d4084d74b231499129085959d1-98.jpg", "descriptions": "The world has seen all kinds of weapons of mass destruction: nuclear, chemical and biological. Now the threat is digital. A virus, simple in concept yet catastrophic in effect, has been developed. Its target is the communication systems of the world. It will shut down all digitalThe world has seen all kinds of weapons of mass destruction: nuclear, chemical and biological. Now the threat is digital. A virus, simple in concept yet catastrophic in effect, has been developed. Its target is the communication systems of the world. It will shut down all digital entertainment, economic trade and cripple the military, causing breaches in all security systems and global mass chaos. There is only enough time to send one operative. His codename: Raven. His mission: to find the virus, copy it and then destroy the research lab where it is located. [DreamCatcher Interactive]… Expand"}, {"name": "Frogger 2", "details_link": "https://www.metacritic.com/game/xbox-360/frogger-2", "publisher": "Konami", "release_date": "Jun 11 2008", "developers": ["Voltex", "Inc."], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "General", "General"], "meta_score": 37, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/58097e0a38370587465a500e9d45a08e-98.jpg", "descriptions": "[Xbox Live Arcade]  Hop along with Frogger 2 as you travel through more than fifteen challenging levels filled with new enemies and obstacles. Each of the five exotic environments provides a new set of challenges, but beware of the bosses that try to thwart your progress. Compete with up to[Xbox Live Arcade]  Hop along with Frogger 2 as you travel through more than fifteen challenging levels filled with new enemies and obstacles. Each of the five exotic environments provides a new set of challenges, but beware of the bosses that try to thwart your progress. Compete with up to four friends in two different online multiplayer modes, and hop your way to victory. Dodge new enemies, obstacles, and engage in thrilling boss battles. Challenge your friends as you compete in two new online multiplayer modes. Try Race Mode to see who can finish an enhanced version of the original Frogger level first. Or hang on to the jewel in Jewel Duel, and prevent your friends from taking the jewel. [Konami]… Expand"}, {"name": "Escape from Bug Island", "details_link": "https://www.metacritic.com/game/wii/escape-from-bug-island", "publisher": "Eidos Interactive", "release_date": "Jul 25 2007", "developers": ["Spike"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 37, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/2416691dae37a6008e7445d18f4a4f1a-98.jpg", "descriptions": "(Also known as \"Necro-Nesia\")  Escape from Bug Island is a 3rd person survival-horror game that takes a quirky, creepy and over-the-top journey onto an island filled with giant evil insects and mutant creatures. Play as Ray and get physical – use the Wii Remote and Nunchuk to shake off and(Also known as \"Necro-Nesia\")  Escape from Bug Island is a 3rd person survival-horror game that takes a quirky, creepy and over-the-top journey onto an island filled with giant evil insects and mutant creatures. Play as Ray and get physical – use the Wii Remote and Nunchuk to shake off and blast massive bugs as well as evade nasty attacks and clingy creatures – in an attempt to rescue your best friend Mike and secret love Michelle.  Armed only with a flashlight and a few simple weapons, players start the game alone in a dark fog-covered forest trying desperately to figure out where everyone has disappeared to. When there is nowhere else to turn, take advantage of the \"Cave of Time\" and travel back to save loved ones. Make sure to explore every dark nook and cranny and uncover the mystery that is Beelzebub Island – called by those who know and fear it – BUG ISLAND. Escape from Bug Island's control system takes advantage of everything the Wii has to offer and brings a spine-chilling workout from start to finish. Offering hundreds of enemies to stomp on, squash, smash, and blow up and a vast array of weapons to keep you safe, Escape from Bug Island is an adventure that is a tribute to the classic campy B-horror movie. [Eidos Interactive]… Expand"}, {"name": "Tamagotchi Party On!", "details_link": "https://www.metacritic.com/game/wii/tamagotchi-party-on!", "publisher": "Namco Bandai Games America", "release_date": "May 29 2007", "developers": ["h.a.n.d. Inc."], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 37, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/0/36f10e6861b69d931788b6e5e2973600-98.jpg", "descriptions": "This 3D party game based on the Tamagotchi franchise promises tons of fun as up-to-four players can go head-to-head in the most comical and cute campaign race to become the most popular Tamagotchi on Tamagotchi Planet. Tamagotchi Party On! is a seamless blend of both party game and boardThis 3D party game based on the Tamagotchi franchise promises tons of fun as up-to-four players can go head-to-head in the most comical and cute campaign race to become the most popular Tamagotchi on Tamagotchi Planet. Tamagotchi Party On! is a seamless blend of both party game and board game as players swing, shake, and turn their Wii controllers in order to control their favorite Tamagotchi. Swing your Wii controllers and turn the whole planet into your playing board. Tamagotchi Party On! allows players to choose their favorite virtual pet and engage in a hilarious campaign to become the next president of Tamagotchi Planet. Earn your popularity by going up against three friends or solo in over 15 unique and totally addictive mini-games including shaking hands, finding lost children, and testing your public speaking skills. In order to succeed at each of these mini games, players have to swing, shake, point, turn and twist their Wii controllers in order to increase their popularity. Gamers can also use Gotchi points that they earn along the way to level up their characters and customize their very own campaign headquarters. With over six different towns to win over and tons of popularity points to be earned in a number of fun and quirky mini-games, Tamagotchi Party On! brings out the fun in politics without all the mudslinging! Be happy! Be popular! Be president! [Namco Bandai Games]… Expand"}, {"name": "3D Classics: Urban Champion", "details_link": "https://www.metacritic.com/game/3ds/3d-classics-urban-champion", "publisher": "Nintendo", "release_date": "Aug 18 2011", "developers": ["Arika"], "platforms": ["Switch", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 37, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/11aef2adf43498b3e42d1be254d8ab2a-98.jpg", "descriptions": "The first fighting game released for the Nintendo Entertainment System returns for a knockout in amazing 3D. The first fighting game released for the Nintendo Entertainment System is back for another round. Use a combination of punches to knock your opponent backward into an open manholeThe first fighting game released for the Nintendo Entertainment System returns for a knockout in amazing 3D. The first fighting game released for the Nintendo Entertainment System is back for another round. Use a combination of punches to knock your opponent backward into an open manhole before time expires. Watch out for angry neighbors who will attempt to drop flowerpots on your head. The police will also make an occasional appearance to temporarily break up the fight – or to make an arrest if time runs out. Find out if you have what it takes to make it on the rough city streets against the toughest brawlers around. Prove yourself worthy and be crowned Urban Champion.… Expand"}, {"name": "Lucha Fury", "details_link": "https://www.metacritic.com/game/xbox-360/lucha-fury", "publisher": "Mindscape Inc.", "release_date": "Jun 22 2011", "developers": ["Punchers Impact"], "platforms": "Xbox 360", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 37, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/89a64398bc233103ef3a4dfbf2c0ffc7-98.jpg", "descriptions": "Lucha Fury follows the adventure of four young and talented wrestlers who spend their lives loafing around until a mysterious shortage of the energy drink, on which they are all hooked, bring them into a fight against the most incredible worldwide conspiracy ever!"}, {"name": "Fluster Cluck", "details_link": "https://www.metacritic.com/game/playstation-4/fluster-cluck", "publisher": "LOOT Entertainment", "release_date": "Oct 21 2014", "developers": ["LOOT Entertainment"], "platforms": "PlayStation 4", "genres": ["Action", "General"], "meta_score": 37, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/4/69108949d22f5304da85dcce10659cd3-98.jpg", "descriptions": "Fluster Cluck is a cartoony, pick-up-and-play twin-stick shooter with resource gathering elements. It has no blood, no gore, no grizzled mercenaries, no princesses who need to be saved, no softcore anime cutscenes, no dialogue trees, and no moral dilemmas. It just has chikkin. Lots and lotsFluster Cluck is a cartoony, pick-up-and-play twin-stick shooter with resource gathering elements. It has no blood, no gore, no grizzled mercenaries, no princesses who need to be saved, no softcore anime cutscenes, no dialogue trees, and no moral dilemmas. It just has chikkin. Lots and lots of chikkin. [Playstation.com]… Expand"}, {"name": "Combat Medic: Special Ops", "details_link": "https://www.metacritic.com/game/pc/combat-medic-special-ops", "publisher": "Legacy Interactive", "release_date": "Apr 30 2002", "developers": ["Legacy Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 37, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/5/8e5083f6d988cee63f18774d66e47535-98.jpg", "descriptions": "You are a new Special Forces Combat Medic and assigned to a Delta Forces unit. It is your job to save the lives of your fellow unit members during secret military operations in the Middle East. [Legacy Interactive]"}, {"name": "Past Cure", "details_link": "https://www.metacritic.com/game/playstation-4/past-cure", "publisher": "Phantom 8", "release_date": "Feb 23 2018", "developers": ["Phantom 8"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 37, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/2/0fd449917bbf38bc7bc76bc5b42861eb-98.jpg", "descriptions": "Past Cure is a dark psychological thriller that blurs the lines between dreams and reality. An intense, cinematic, story driven experience, blending stealth and combat gameplay. Players are challenged to use an array of skills varying from powerful time bending mental abilities to brutalPast Cure is a dark psychological thriller that blurs the lines between dreams and reality. An intense, cinematic, story driven experience, blending stealth and combat gameplay. Players are challenged to use an array of skills varying from powerful time bending mental abilities to brutal melee combat and stealth kills.After his years of torture, ex elite soldier Ian lives in the safehouse of his brother, struggling with the consequences of the military experiments he was put through. They twisted his mind, imbuedhim with preternatural mental abilities such as time control and telekinesis. Driven by hallucinations and his thirst for revenge, Ian enlists his brother's help as he sets out on a thrilling hunt for the perpetrators of the conspiracy against him, and for the truth underlying his torment. On his missions Ian experiments with his new powers, quickly coming to realize their inherent danger: with each use, his sanity frays a little more, inviting the nightmarish attention of something beyond reality.… Expand"}, {"name": "Dead Space Ignition", "details_link": "https://www.metacritic.com/game/playstation-3/dead-space-ignition", "publisher": "Electronic Arts", "release_date": "Oct 12 2010", "developers": ["Sumo Digital"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Puzzle", "Action", "Shooter", "Puzzle", "Puzzle", "Third-Person", "General", "Action", "Sci-Fi"], "meta_score": 36, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/5/cf0ff212a2e8210f71c908ec32b91ddb-98.jpg", "descriptions": "Dead Space Ignition combines an interactive comic-style story with three unique hacking mini games; Hardware Crack, Trace Route and System Override. Each game offers a fun and satisfying arcade experience that will challenge players with puzzles and twitch gameplay. Dead Space IgnitionDead Space Ignition combines an interactive comic-style story with three unique hacking mini games; Hardware Crack, Trace Route and System Override. Each game offers a fun and satisfying arcade experience that will challenge players with puzzles and twitch gameplay. Dead Space Ignition features a unique. Choose Your Own Adventure type narrative, allowing players to survive the horrific Necromorph outbreak in multiple ways. The game offers four unique endings and upon completion of each one, players will be rewarded with unlocks including an exclusive suit, all of which can be used by Isaac Clarke in Dead Space 2.… Expand"}, {"name": "Pimp My Ride", "details_link": "https://www.metacritic.com/game/playstation-2/pimp-my-ride", "publisher": "Activision", "release_date": "Nov 21 2006", "developers": ["Eutechnyx"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "General"], "meta_score": 36, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/ff30f7515654944936a412eee37ee0c1-98.jpg", "descriptions": "Enter Pimp City, where bling is king, and style is everything. On these streets, if your car isn't fully pimped out, you'd be better off walking. You and Xzibit will take on the challenge of hooking up your homies, and transforming their hoopties, buckets and beaters into the hottest whipsEnter Pimp City, where bling is king, and style is everything. On these streets, if your car isn't fully pimped out, you'd be better off walking. You and Xzibit will take on the challenge of hooking up your homies, and transforming their hoopties, buckets and beaters into the hottest whips on the street, while redlining through the highways and alleyways of Pimp City. You choose the mods, you choose the route, but pimpin' ain't easy. It will take speed and style to hook them up. Do you have what it takes to Pimp Their Ride? Xzibit will guide you through every stage of the pimping process - true Xzibit hilarity with lines and voice recording from Xzibit himself. Authentic people, broken rides - each mission will feature a person who truly needs their ride (and their life) pimped. Outrageous car modifications not for your typical car. Intense redline street racing through the city's 'hoods to create the most pimped out ride. New School meets Old School - an MTV generation focus in delivery of art, music and sound, featuring Zxibit's latest hip-hop tracks, and retro whips in need of modern bling. 5 unique boroughs , all free roam envorinments for the ultimate combination of racing and pimping. 16 vehicles in all - one for each of the 15 \"customers\" plus Xzibit's own high-rolling feature ride. Over 15 suppliers per borough and 100s of parts, from tires and rims to bumpin' subwofer systems and high-def display panels. So many parts, so many combinations, so much replayability. [Activision]… Expand"}, {"name": "The History Channel: Battle for the Pacific", "details_link": "https://www.metacritic.com/game/playstation-3/the-history-channel-battle-for-the-pacific", "publisher": "Activision", "release_date": "Feb 19 2008", "developers": ["Activision"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 36, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/3/4b9cdb893323fdb2a289ded8cb85c678-98.jpg", "descriptions": "The History Channel takes you to the Battle for the Pacific where you will experience history brought to life in one of the defining campaigns of World War II. Relive epic land battles fought on some of the most brutal and unforgiving battlefields in recorded history. Retake strategicallyThe History Channel takes you to the Battle for the Pacific where you will experience history brought to life in one of the defining campaigns of World War II. Relive epic land battles fought on some of the most brutal and unforgiving battlefields in recorded history. Retake strategically important locations throughout the Pacific Theatre that are vital to the allies on the Road to Tokyo.  Play through the eyes of an American GI as you experience intense, no holds barred action against an opponent for which surrender isn't an option! Fire authentic allied and axis weaponry including sub-machine guns, sniper rifles, anti-aircraft guns, pistols, and grenades Relive History - each level begins with a documentary video featuring actual battle footage, key facts and statistics, and the importance that the battle ultimately played in the allied victory. Fight from Henderson Field in Guadalcanal through the Philippines to Mount Suribachi on Iwo Jima. Experience some of the most exotic and forbidden battlefields including dense jungles and barren volcanic islands. Face the harsh realities of war as you engage the enemy on the frontlines. Fight alongside squadron members reacting to the events of the battlefield, where fighting is often hand to hand and your objective is simple - defeat the enemy at all costs. Based on actual battles including storming the beaches in an amphibious assault, recapturing a strategic airfield, defending against an enemy assault, going on a search and destroy mission, fighting through fortified caves and scaling Mount Suribachi to plant the American flag. Play online as an American or Japanese soldier in your favorite individual and team based modes including elimination, team elimination, death match, team death match and capture the flag on battlefields painstakingly recreated from topographical maps and historical records. Battles come to life amidst exploding artillery, whistling bullets, falling comrades, unrelenting enemies and much more. [Activision]… Expand"}, {"name": "Sniper: Art of Victory", "details_link": "https://www.metacritic.com/game/pc/sniper-art-of-victory", "publisher": "City Interactive", "release_date": "Oct 16 2008", "developers": ["City Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Historic", "Historic"], "meta_score": 36, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/2/0e1974e4fff5010f5da621a0414af65d-98.jpg", "descriptions": "WW II was a theatre of war for many specialized combat units, working together to ensure an army’s victory. Among them a unique role was played by hidden and deadly marksmen. Their ability to lay motionless waiting for the perfect shot together with their professional equipment allowed themWW II was a theatre of war for many specialized combat units, working together to ensure an army’s victory. Among them a unique role was played by hidden and deadly marksmen. Their ability to lay motionless waiting for the perfect shot together with their professional equipment allowed them to change the course of the history with one pull of a trigger. Become a sharpshooter and take part in the turning points of the WW II. Eliminate the Nazi general, who came to support the Germans lying siege to Stalingrad. Make your way through areas occupied by the Third Reich to your unit. Aid the Alliance forces during their offensive on the Italian Peninsula to break the resistance of the retreating Wehrmacht forces. [City Interactive]… Expand"}, {"name": "Torino 2006 - the Official Video Game of the XX Olympic Winter Games", "details_link": "https://www.metacritic.com/game/xbox/torino-2006---the-official-video-game-of-the-xx-olympic-winter-games", "publisher": "2K Sports", "release_date": "Jan 24 2006", "developers": ["49Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 36, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/ebf97c98af7648e4edef16af16101f41-98.jpg", "descriptions": "In the spirit of the winter Olympics, Torino '06 Olympic Games lets you compete in 15 different events. The game includes such disciplines as bobsledding, figure skating, cross-country skiing, hockey, and biathlon. Up to four players can compete for Olympic glory through head-to-head orIn the spirit of the winter Olympics, Torino '06 Olympic Games lets you compete in 15 different events. The game includes such disciplines as bobsledding, figure skating, cross-country skiing, hockey, and biathlon. Up to four players can compete for Olympic glory through head-to-head or sequential gameplay.… Expand"}, {"name": "Darkstar: The Interactive Movie", "details_link": "https://www.metacritic.com/game/pc/darkstar-the-interactive-movie", "publisher": "Parallax Software", "release_date": "Nov  8 2010", "developers": ["Parallax Software"], "platforms": "PC", "genres": ["Action", "Adventure", "Interactive Movie", "General", "Interactive Movie"], "meta_score": 36, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/48bf89e746cb1e7d53c7d38bcf75c07f-98.jpg", "descriptions": "DARKSTAR provides hours of entertainment in both interactive adventure and cinema, and features the entire original cast of Mystery Science Theater 3000 and music by Progressive Sound and MetalWorx. This is also the final performance of the late, great Peter Graves. With more footage thanDARKSTAR provides hours of entertainment in both interactive adventure and cinema, and features the entire original cast of Mystery Science Theater 3000 and music by Progressive Sound and MetalWorx. This is also the final performance of the late, great Peter Graves. With more footage than any \"game\" ever produced (over 13 hours), DARKSTAR is a true interactive animated world with live-action actors.… Expand"}, {"name": "Shaq Fu: A Legend Reborn", "details_link": "https://www.metacritic.com/game/playstation-4/shaq-fu-a-legend-reborn", "publisher": "Saber Interactive", "release_date": "Jun  5 2018", "developers": ["Big Deez Productions"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 36, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/2659e939bb9c1f409a4916906a330893-98.jpg", "descriptions": "Shaq Fu: A Legend Reborn is what the original game should have been an instant classic. We're talking Streets of Rage meets Street Fighter meets Devil May Cry. It's a modern day take on the classic beat 'em up. Play as Shaquille O'Neal learn hundreds of moves and battle techniques, take onShaq Fu: A Legend Reborn is what the original game should have been an instant classic. We're talking Streets of Rage meets Street Fighter meets Devil May Cry. It's a modern day take on the classic beat 'em up. Play as Shaquille O'Neal learn hundreds of moves and battle techniques, take on thousands of enemies with dozens of cool melee weapons, battle bosses in dynamic arenas, master cool finishing moves and play with your buddies in COOP mode or against each other in player vs player combat.In Shaq Fu, dozens of unique and varied enemies await which require careful use of tactics. The game also features destructive environments, awesome power ups and a series of well-designed, beautiful levels with interesting progression. This is all tied together by what very well might be the story of the century, a performance worthy of an Oscar, by the Big Diesel, in his battle against a villain for the ages the mysterious Black Star Ninja.… Expand"}, {"name": "The Sum of All Fears", "details_link": "https://www.metacritic.com/game/gamecube/the-sum-of-all-fears", "publisher": "Ubisoft", "release_date": "Jan  9 2003", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 36, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/9/dbefd8170b6cfc22540eb8d33575f6ad-98.jpg", "descriptions": "Based on the novel by Tom Clancy, The Sum of All Fears lets you play as a member of the FBI's Hostage Rescue Team. Everything you have ever trained for will be put to the test as you command your counterterrorist group through 11 dangerous missions. Equipped with 15 authentic gun types,Based on the novel by Tom Clancy, The Sum of All Fears lets you play as a member of the FBI's Hostage Rescue Team. Everything you have ever trained for will be put to the test as you command your counterterrorist group through 11 dangerous missions. Equipped with 15 authentic gun types, flashbangs, and frag grenades, you can square off against combatants worldwide in six multiplayer zones. If you fail, the most destructive weapon known to humankind will be unleashed on American soil.… Expand"}, {"name": "Kung Fu Rider", "details_link": "https://www.metacritic.com/game/playstation-3/kung-fu-rider", "publisher": "SCEA", "release_date": "Sep  7 2010", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "genres": ["Action", "General", "General"], "meta_score": 36, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/0/bec403f86c1ddb4d89484229cb382373-98.jpg", "descriptions": "Kung Fu Rider sends players on a wild ride through the busy streets of Hong Kong. Taking on the role of private detective Toby or his assistant Karin, players find themselves on the outs with the mob. When Toby and Karin are confronted by mobsters at their detective agency, players have noKung Fu Rider sends players on a wild ride through the busy streets of Hong Kong. Taking on the role of private detective Toby or his assistant Karin, players find themselves on the outs with the mob. When Toby and Karin are confronted by mobsters at their detective agency, players have no choice but to grab their office chairs, hold on tight and slide through the streets in order to make a daring escape. Utilizing the PlayStation Move motion controller, players must steer, jump, dash and power dash through the city while avoiding obstacles and evading attacks in this comical and fast-paced action arcade game.  … Expand"}, {"name": "NBA Live 14", "details_link": "https://www.metacritic.com/game/xbox-one/nba-live-14", "publisher": "Electronic Arts", "release_date": "Nov 19 2013", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Arcade", "Sports", "Traditional", "Team", "Basketball", "Arcade"], "meta_score": 36, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/1/b5336a4b6f0193192a7170f14023f12d-98.jpg", "descriptions": "BounceTek -- Revolutionary physics-based dribbling allows for complete, organic control and authentic responsiveness. Utilize a full suite of dribble moves to unleash ankle-breaking crossovers, hesitations and more. CourtQ Delivers Real Time NBA -- Leveraging live synergy Sports TechnologyBounceTek -- Revolutionary physics-based dribbling allows for complete, organic control and authentic responsiveness. Utilize a full suite of dribble moves to unleash ankle-breaking crossovers, hesitations and more. CourtQ Delivers Real Time NBA -- Leveraging live synergy Sports Technology data, NBA LIVE 14 is driven by over 70 player ratings, tendencies, and team stats updated every NBA game, ensuring that your game is always in-sync with the real NBA. With fresh content and challenges updated on a daily basis, NBA LIVE 14 delivers a new experience each and every time you pick up the controller, delivering the pulse of the NBA 24/7/365.… Expand"}, {"name": "Coffin Dodgers", "details_link": "https://www.metacritic.com/game/playstation-4/coffin-dodgers", "publisher": "Wales Interactive", "release_date": "May  3 2016", "developers": ["Milky Tea Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 36, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/de685f8b0469907c7a0cacd961306e8a-98.jpg", "descriptions": "Welcome to a suburban retirement village where all is not as it seems…\rAfter settling down to recover from the responsibilities of working life, the residents of Sunny Pines have been idling away the days, life could not be more tranquil. However, a creepy new resident, Mr Grim Reaper,Welcome to a suburban retirement village where all is not as it seems…\rAfter settling down to recover from the responsibilities of working life, the residents of Sunny Pines have been idling away the days, life could not be more tranquil. However, a creepy new resident, Mr Grim Reaper, looks set to turn retirement on its head… After years trawling the earth for souls to harvest, Mr Grim Reaper concludes Sunny Pines is where he’ll lay his hat; here he can harvest souls from the comfort of his rocking chair. However, seven of the sprightliest OAPs (old age pensioners) have other ideas and set out to prove that life for Grim at Sunny Pines definitely won’t be like shooting fish in a barrel.… Expand"}, {"name": "X-Men: Destiny", "details_link": "https://www.metacritic.com/game/wii/x-men-destiny", "publisher": "Activision", "release_date": "Sep 27 2011", "developers": ["Silicon Knights"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 36, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/7/a99ce54fce56fdc2b999d0a3702aa2da-98.jpg", "descriptions": "X-Men: Destiny has you playing a new recruit amongst comic's motley mutant band, and promises a branching storyline that features a deep element of choice."}, {"name": "Fantastic Four: Rise of the Silver Surfer", "details_link": "https://www.metacritic.com/game/playstation-2/fantastic-four-rise-of-the-silver-surfer", "publisher": "Take-Two Interactive", "release_date": "Jun 15 2007", "developers": ["7 Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "General"], "meta_score": 36, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/9a154ea97086d30cd1490b999c75de82-98.jpg", "descriptions": "Marvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including SilverMarvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including Silver Surfer, Super Skrull and more. Battle in 4-player co-op with easy pick up and play ability. Combine super powers for devastating team attacks with the new Fusion Attack System. Truly destructible environments: smash, wreck, wreak havoc. Loads of unlockables including alternate Fantastic Four costumes, historical comic covers, and more. [2K Games]… Expand"}, {"name": "Damnation", "details_link": "https://www.metacritic.com/game/xbox-360/damnation", "publisher": "Codemasters", "release_date": "May 26 2009", "developers": ["Blue Omega"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 36, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/0a137bc3ccf27f7c8e91cac33a247c7a-98.jpg", "descriptions": "Evolving the shooter genre with its unique combination of fluid action and combat, Damnation features huge, open environments, frenetic combat, daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes, quick thinking and rapid-fireEvolving the shooter genre with its unique combination of fluid action and combat, Damnation features huge, open environments, frenetic combat, daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes, quick thinking and rapid-fire conflict, Damnation features vast, breathtaking landscapes, each covering miles of distance and thousands of vertical feet. Billed as a \"shooter gone vertical\" and visually inspired by iconic elements of American history, these massive streaming landscapes form the battlegrounds for a post-industrial conflict between humanity and an unstoppable arms dealer hell-bent on total world domination. Players choose their own paths and navigate the world by performing daredevil feats on the edge of human ability. Intelligent enemies give chase and engage players in frantic gun fights and attacks that can come from any direction. With up to three hours of actual gameplay stretching out in front of them per level, players need more than just muscle power to get across each level safely. Damnation offers players a selection of vehicles, from motorbikes capable of launching across seemingly infinite chasms, to huge, armour-piercing marvels that induce mayhem with every huge shell. The high action is supported by an epic and in-depth story which, while focusing on the exploits of the hero character Rourke, is truly an ensemble piece. Players meet and become involved in intricate story plots that reveal much more than the obvious. In addition to the single player experience, Damnation comes complete with a unique set of multiplayer options that take full advantage of the game’s expansive levels. [Codemasters]… Expand"}, {"name": "The Shield: The Game", "details_link": "https://www.metacritic.com/game/playstation-2/the-shield-the-game", "publisher": "Aspyr", "release_date": "Jan  9 2007", "developers": ["Point of View"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 36, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/a1f21dd0936ce12c483bb750b2d203de-98.jpg", "descriptions": "Sammy Studios and Point Of View capture the look, feel, and authenticity of \"The Shield\" television series in a 3rd-person action game. Never-before-seen gameplay elements create the first true-to-life police action game, and moments taken directly from the series immerse players in theSammy Studios and Point Of View capture the look, feel, and authenticity of \"The Shield\" television series in a 3rd-person action game. Never-before-seen gameplay elements create the first true-to-life police action game, and moments taken directly from the series immerse players in the disturbing Farmington underworld now recognized by millions as Vic Mackey's universe. Players control Vic in a living, breathing Farmington, engaging in perilous assignments ranging from busting crack dens to thwarting bank robberies. Much like the series, Vic and the Strike Team delve into the grayest areas of the law, fighting a war on crime where the ends justify the means. In addition to the raw action that undergirds the gameplay, players employ tactics used by Vic on the show, including intimidating suspects, employing brute force, accepting and offering bribes and planting incriminating evidence. The game also lets players choose between the right and wrong side of the law, with Vic walking a thin line while trying to accomplish missions, maintain the respect of his men, keep his politically ambitious police captain happy, pad his retirement fund and, above all, avoid Internal Affairs. [Sammy Studios]… Expand"}, {"name": "Orion: Dino Horde", "details_link": "https://www.metacritic.com/game/pc/orion-dino-horde", "publisher": "Spiral Game Studios", "release_date": "May  4 2012", "developers": ["Spiral Game Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 36, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/bd15981b0d127e2a48cc06348de40832-98.jpg", "descriptions": "(Also released as \"ORION: Dino Beatdown\") ORION: Dino Beatdown is an Open World, Class-Based Cooperative Survival Sci-Fi FPS. The game puts five players together in huge, endless environments in which they must work together to accomplish objectives and survive the devastating Dinosaur(Also released as \"ORION: Dino Beatdown\") ORION: Dino Beatdown is an Open World, Class-Based Cooperative Survival Sci-Fi FPS. The game puts five players together in huge, endless environments in which they must work together to accomplish objectives and survive the devastating Dinosaur horde.\r Players earn in-game credits which can be used to upgrade their abilities, purchase new weapons, unlock weapon upgrades and call in vehicles in order to ensure survival.\r Experience the future as never before. Make use of Jetpacks, Medic Guns, Cloaking Devices and equip yourself with state-of-the-art weapons ranging from Shotguns, Machine Guns, Rocket Launchers, Laser Rifles. If that isnt enough then simply tear up the environments in a number of vehicles ranging from Hover Bikes, Buggies, Mechs, Tanks and VTOLs.… Expand"}, {"name": "Dream Chronicles", "details_link": "https://www.metacritic.com/game/xbox-360/dream-chronicles", "publisher": "Hudson Entertainment", "release_date": "Oct 20 2010", "developers": ["PlayFirst"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Hidden Object", "General", "Puzzle", "General"], "meta_score": 36, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/027a7e45c7db81043980a92645098da1-98.jpg", "descriptions": "Unlock the secrets of the beautiful and mysterious fairy realm in the third installment of the award-winning Dream Chronicles series. Discover hidden clues and solve challenging puzzles as you join Faye on her quest to save her daughter from the clutches of the Fairy Queen Lilith with theUnlock the secrets of the beautiful and mysterious fairy realm in the third installment of the award-winning Dream Chronicles series. Discover hidden clues and solve challenging puzzles as you join Faye on her quest to save her daughter from the clutches of the Fairy Queen Lilith with the assistance of her husband Fidget. Reveal the secret prophecy of The Chosen Child as you unlock the Nexus to solve puzzles that span across multiple areas and immerse yourself in this all-new hunt-and-seek adventure with unexpected twists that will keep you searching for answers throughout the game.… Expand"}, {"name": "Power Gig: Rise of the SixString", "details_link": "https://www.metacritic.com/game/playstation-3/power-gig-rise-of-the-sixstring", "publisher": "Seven45 Studios", "release_date": "Oct 19 2010", "developers": ["Seven45 Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music Maker", "Music"], "meta_score": 36, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/7/d2f38d47475ae758e8b8f458b3d7b7e3-98.jpg", "descriptions": "Power Gig: Rise of the SixString will transport players to an entirely new universe, with its own mythology, politics, settings, heroes and villains, where music rules all.  On the gameplay front, Power Gig uses new technology that represents the next evolution of music performance games toPower Gig: Rise of the SixString will transport players to an entirely new universe, with its own mythology, politics, settings, heroes and villains, where music rules all.  On the gameplay front, Power Gig uses new technology that represents the next evolution of music performance games to provide all players - from casual gamers to the hardcore, from those who have never before picked up a guitar to those who play guitar on a regular basis - with a more authentic and fun experience.  The game offers two overarching modes of play.  In addition to traditional beat-matching that will be familiar to fans of the band game genre, Power Gig also introduces the option to switch on chording, or chord play.  Chording presents the added challenge of playing the game using chords that require specific finger placement on the strings.  As players progress through the game, becoming more comfortable with a genuine guitar and potentially choosing to play real power chords, they will find that the byproduct of playing the game is coming away from it with an understanding of some real-life guitar fundamentals.… Expand"}, {"name": "Air Conflicts: Aces of World War II", "details_link": "https://www.metacritic.com/game/psp/air-conflicts-aces-of-world-war-ii", "publisher": "Graffiti Entertainment", "release_date": "Apr 14 2009", "developers": ["Cowboy Rodeo"], "platforms": "PSP", "num_players": "1-8 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 36, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/d4c73a3ec832a17b6757e9bbde64de08-98.jpg", "descriptions": "Air Conflicts is an arcade flight simulator game set in World War II, featuring the aircraft of this period and historically inspired missions. The emphasis is on intense dogfights, daring bombing raids and exciting aerial missions. 13 non-linear campaigns with more than 240 action-packedAir Conflicts is an arcade flight simulator game set in World War II, featuring the aircraft of this period and historically inspired missions. The emphasis is on intense dogfights, daring bombing raids and exciting aerial missions. 13 non-linear campaigns with more than 240 action-packed missions (patrols, manoeuvres, strategic bombing, air support, air superiority, interdiction, paratroops and supply deployment, prevent bombing missions). Authentic historical timeline and missions with focus on the gameplay. Easy control over aircraft and fun air battles. Fly for the US Air Force, Royal Air Force, Luftwaffe or Red Army Air Force. Fly with 17 authentic planes (Spitfire, Mosquito, Avro Lancaster, He-111, Ju-87 Stuka, Bf-109, Gloster Meteor, Gotha 229, DB3, IL2, Lavochkin 5, Bisnovat 5, P-38, P-51, P-47 Thunderbolt, and B-17 Flying Fortress). Advanced ranking system, with authentic medals and ranks. [Graffiti Entertainment]… Expand"}, {"name": "MTV's Celebrity Deathmatch", "details_link": "https://www.metacritic.com/game/xbox/mtvs-celebrity-deathmatch", "publisher": "Gotham Games", "release_date": "Oct 14 2003", "developers": ["Big Ape Productions"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 36, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/3/f93d63385ad0843a3d5c43eac0b77b49-98.jpg", "descriptions": "Based on the TV show, MTV's Celebrity Deathmatch pits famous personalities against each other in bloody bouts. Each of the 15 characters has their own special moves and reflects the damage taken during fights with bruises, blood, dents, and deformities. You can also create your own celebrityBased on the TV show, MTV's Celebrity Deathmatch pits famous personalities against each other in bloody bouts. Each of the 15 characters has their own special moves and reflects the damage taken during fights with bruises, blood, dents, and deformities. You can also create your own celebrity and test his or her skills in the arena spotlight. Original show hosts Nick Diamond and Johnny Gomez provide color commentary while referee Mills Lane calls the shots.… Expand"}, {"name": "Disney Sports Skateboarding", "details_link": "https://www.metacritic.com/game/gamecube/disney-sports-skateboarding", "publisher": "Konami", "release_date": "Nov 17 2002", "developers": ["KCEO"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 36, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/598023f084e168aabe72c929f4b4d5c2-98.jpg", "descriptions": "Grind and ollie with Mickey and his pals in Disney Sports Skateboarding. As Mickey Mouse, Donald Duck, Goofy, or other Disney characters, you'll skateboard through eight expansive levels and five game modes. In each level, you can perform character-specific special moves and more than 40Grind and ollie with Mickey and his pals in Disney Sports Skateboarding. As Mickey Mouse, Donald Duck, Goofy, or other Disney characters, you'll skateboard through eight expansive levels and five game modes. In each level, you can perform character-specific special moves and more than 40 different tricks. As you complete goals, such as scoring a certain number of points or reaching checkpoints, you'll unlock skateboards, outfits, and stickers. You can also skate the streets by yourself or with a friend in Multiplayer mode.… Expand"}, {"name": "Teenage Mutant Ninja Turtles: Arcade Attack", "details_link": "https://www.metacritic.com/game/ds/teenage-mutant-ninja-turtles-arcade-attack", "publisher": "Ubisoft", "release_date": "Nov 10 2009", "developers": ["Ubisoft"], "platforms": "DS", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up"], "meta_score": 36, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/466511c52ec1b5e60db09d77f3b90afa-98.jpg", "descriptions": "A tribute to the original coin-op classics that made the Turtles into video game legends. The game pits the four Ninja Turtle brothers against their old nemesis, Shredder, and his many villainous henchmen. Teenage Mutant Ninja Turtles: Arcade Attack features an all-new combination system,A tribute to the original coin-op classics that made the Turtles into video game legends. The game pits the four Ninja Turtle brothers against their old nemesis, Shredder, and his many villainous henchmen. Teenage Mutant Ninja Turtles: Arcade Attack features an all-new combination system, enabling players to string together uppercuts and roundhouse kicks to unlock a series of moves powerful enough to take out even the strongest enemy. In addition, the game will include a cooperative mode, allowing for arcade action with either a friend via local wireless, or a system-controlled Turtle brother. [Ubisoft]… Expand"}, {"name": "Hollow", "details_link": "https://www.metacritic.com/game/switch/hollow", "publisher": "Forever Entertainment", "release_date": "Feb 22 2018", "developers": ["MMEU"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 36, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/1/06191984615cdff3cf6252a190f55bb3-98.jpg", "descriptions": "In Hollow, you are one of the pilots that transports precious resource cargo from the mining ship Shakhter-One down to Earth. One day you wake up in an emergency capsule drifting near the facility. You don't remember who you are, or how you got out there… All you can remember is an autopilotIn Hollow, you are one of the pilots that transports precious resource cargo from the mining ship Shakhter-One down to Earth. One day you wake up in an emergency capsule drifting near the facility. You don't remember who you are, or how you got out there… All you can remember is an autopilot docking code for capsule dock NR 6. When you dock with Shakhter-One, it is clear that something has gone horribly wrong. The crew is missing and the entire facility is dealing with catastrophic power issues. As you start to uncover the ship's terrifying secrets, Shakhter-One threatens to take your identity, your sanity, and – ultimately – your life. … Expand"}, {"name": "Legends of Pegasus", "details_link": "https://www.metacritic.com/game/pc/legends-of-pegasus", "publisher": "Kalypso", "release_date": "Aug 10 2012", "developers": ["Kalypso", "Novacore Studios"], "platforms": "PC", "genres": ["Simulation", "Strategy", "Turn-Based", "General", "General", "4X"], "meta_score": 36, "users_score": 1.3, "image": "https://static.metacritic.com/images/products/games/7/24d318196e24b4d247288eb42cc18ab0-98.jpg", "descriptions": "The 4X space simulation will put players in control of the last surviving humans, as they explore space in a quest to expand their galactic empire. Players will conquer and explore an incredibly detailed 3D universe as they use economic, diplomatic and scientific means to expand theirThe 4X space simulation will put players in control of the last surviving humans, as they explore space in a quest to expand their galactic empire. Players will conquer and explore an incredibly detailed 3D universe as they use economic, diplomatic and scientific means to expand their empires. Through a deep technology tree, players will unlock new technologies to customize their ships and prepare their fleets for the next alien encounter; be it hostile or friendly. … Expand"}, {"name": "Power Gig: Rise of the SixString", "details_link": "https://www.metacritic.com/game/xbox-360/power-gig-rise-of-the-sixstring", "publisher": "Seven45 Studios", "release_date": "Oct 19 2010", "developers": ["Seven45 Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music Maker", "Music"], "meta_score": 36, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/8/668f1944d0030714ab344a376ad77ae2-98.jpg", "descriptions": "Power Gig: Rise of the SixString will transport players to an entirely new universe, with its own mythology, politics, settings, heroes and villains, where music rules all.  On the gameplay front, Power Gig uses new technology that represents the next evolution of music performance games toPower Gig: Rise of the SixString will transport players to an entirely new universe, with its own mythology, politics, settings, heroes and villains, where music rules all.  On the gameplay front, Power Gig uses new technology that represents the next evolution of music performance games to provide all players - from casual gamers to the hardcore, from those who have never before picked up a guitar to those who play guitar on a regular basis - with a more authentic and fun experience.  The game offers two overarching modes of play.  In addition to traditional beat-matching that will be familiar to fans of the band game genre, Power Gig also introduces the option to switch on chording, or chord play.  Chording presents the added challenge of playing the game using chords that require specific finger placement on the strings.  As players progress through the game, becoming more comfortable with a genuine guitar and potentially choosing to play real power chords, they will find that the byproduct of playing the game is coming away from it with an understanding of some real-life guitar fundamentals.… Expand"}, {"name": "Damnation", "details_link": "https://www.metacritic.com/game/playstation-3/damnation", "publisher": "Codemasters", "release_date": "May 26 2009", "developers": ["Blue Omega"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 36, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/4/ade2362498f7131cfc0d79db1ed039b5-98.jpg", "descriptions": "Evolving the shooter genre with its unique combination of fluid action and combat, Damnation features huge, open environments, frenetic combat, daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes, quick thinking and rapid-fireEvolving the shooter genre with its unique combination of fluid action and combat, Damnation features huge, open environments, frenetic combat, daredevil acrobatics and high-octane vehicle-based stunts. Presenting players with an intense test of reflexes, quick thinking and rapid-fire conflict, Damnation features vast, breathtaking landscapes, each covering miles of distance and thousands of vertical feet. Billed as a \"shooter gone vertical\" and visually inspired by iconic elements of American history, these massive streaming landscapes form the battlegrounds for a post-industrial conflict between humanity and an unstoppable arms dealer hell-bent on total world domination. Players choose their own paths and navigate the world by performing daredevil feats on the edge of human ability. Intelligent enemies give chase and engage players in frantic gun fights and attacks that can come from any direction. With up to three hours of actual gameplay stretching out in front of them per level, players need more than just muscle power to get across each level safely. Damnation offers players a selection of vehicles, from motorbikes capable of launching across seemingly infinite chasms, to huge, armour-piercing marvels that induce mayhem with every huge shell. The high action is supported by an epic and in-depth story which, while focusing on the exploits of the hero character Rourke, is truly an ensemble piece. Players meet and become involved in intricate story plots that reveal much more than the obvious. In addition to the single player experience, Damnation comes complete with a unique set of multiplayer options that take full advantage of the game’s expansive levels. [Codemasters]… Expand"}, {"name": "Balan Wonderworld", "details_link": "https://www.metacritic.com/game/switch/balan-wonderworld", "publisher": "Square Enix", "release_date": "Mar 26 2021", "developers": ["Arzest", "Balan Company"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 36, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/3/08b9bce8e3193b417778bf9771b2d1b8-98.jpg", "descriptions": "Balan Wonderworld is a wondrous action-platformer game themed around a mysterious musical theatre. The stars of the show will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from theBalan Wonderworld is a wondrous action-platformer game themed around a mysterious musical theatre. The stars of the show will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from the real world mix with the things that people hold dear. Twelve different tales await our stars in Wonderworld, each with their own unique quirks. They will explore all corners of these labyrinthine stages, using all the tricks and gimmicks hidden along the way, to get to the heart of each touching story.… Expand"}, {"name": "Alekhine's Gun", "details_link": "https://www.metacritic.com/game/playstation-4/alekhines-gun", "publisher": "Maximum Games", "release_date": "Mar  1 2016", "developers": ["Maximum Games", "Bigmoon Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 36, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/2/3fe7c0978f035c524ffc2e671d5ed9f9-98.jpg", "descriptions": "It is the height of the Cold War, a time of global uncertainty and civil unrest. In this stealth shooter you play Agent Alekhine, a highly skilled Russian assassin driven by a moral compass that leads you headfirst into a covert operation unsanctioned by the country you serve. WorkingIt is the height of the Cold War, a time of global uncertainty and civil unrest. In this stealth shooter you play Agent Alekhine, a highly skilled Russian assassin driven by a moral compass that leads you headfirst into a covert operation unsanctioned by the country you serve. Working alongside American CIA agents, your mission is clear - though how you accomplish it is anything but - as the tension of a nuclear standoff grows with each passing minute. In a world where one wrong move could be the end of you, navigating a new direction comes at a price.… Expand"}, {"name": "Jeremy McGrath Supercross World", "details_link": "https://www.metacritic.com/game/gamecube/jeremy-mcgrath-supercross-world", "publisher": "Acclaim", "release_date": "Feb 27 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 36, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/0f1a9cb85a337f17f0b3720a237ce653-98.jpg", "descriptions": "10-Time World Supercross Champion Jeremy McGrath, Freestyle MX and Supercross champ Travis Pastrana and other leading pros have returned to give you the best racing experience. Feel the power of your engines as you tackle 25 unique tracks, complete challenges and master the skills necessary10-Time World Supercross Champion Jeremy McGrath, Freestyle MX and Supercross champ Travis Pastrana and other leading pros have returned to give you the best racing experience. Feel the power of your engines as you tackle 25 unique tracks, complete challenges and master the skills necessary to become the king of Supercross - like Jeremy himself.… Expand"}, {"name": "Torrente", "details_link": "https://www.metacritic.com/game/pc/torrente", "publisher": "O3 Entertainment", "release_date": "Dec  6 2004", "developers": ["Cinemaware"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 36, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/1afcc094e3600a227a140d7ae37af0b1-98.jpg", "descriptions": "Torrente is a fascist, sexist, racist, drunk, and dirty former cop who soon finds himself caught in the crossfire between drug cartels and the Mafia. Now he must blast his way through street thugs and hit men battling for control over Madrid's seedy underworld. Torrente was dismissed fromTorrente is a fascist, sexist, racist, drunk, and dirty former cop who soon finds himself caught in the crossfire between drug cartels and the Mafia. Now he must blast his way through street thugs and hit men battling for control over Madrid's seedy underworld. Torrente was dismissed from the force due to his questionable involvement in a sordid case. Now he scrapes out a living as a private dick with the objective of some day being reinstated in the glorious police force from which he believes he was wrongly dismissed. In missions ranging from Madrid to Marbella, Torrente must complete a variety of tasks such as escorting an important client, deactivating bombs, and protecting beauty queens, generally with chaotic and bloody results. [O~3 Entertainment]… Expand"}, {"name": "Umbrella Corps", "details_link": "https://www.metacritic.com/game/pc/umbrella-corps", "publisher": "Capcom", "release_date": "Jun 21 2016", "developers": ["Capcom"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 36, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/0/092b77a1d740ed316a49d667a3520faa-98.jpg", "descriptions": "Umbrella Corps brings a competitive experience featuring new types of strategy and technique blended with elements from the world of Resident Evil, to create a \"unique\" kind of shooter."}, {"name": "Risen 3: Titan Lords", "details_link": "https://www.metacritic.com/game/playstation-3/risen-3-titan-lords", "publisher": "Deep Silver", "release_date": "Aug 12 2014", "developers": ["Piranha Bytes"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 36, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/2/2729bd841261dfab120799ff63211277-98.jpg", "descriptions": "The world has been abandoned by its deities and is scarred from the attack of the Titans. Humanity struggles to regain strength and marshal its forces. You have more immediate concerns: your own life has been shattered and you must set off to reclaim what is lost in the darkness that isThe world has been abandoned by its deities and is scarred from the attack of the Titans. Humanity struggles to regain strength and marshal its forces. You have more immediate concerns: your own life has been shattered and you must set off to reclaim what is lost in the darkness that is spreading throughout the world. … Expand"}, {"name": "Double D Dodgeball", "details_link": "https://www.metacritic.com/game/xbox-360/double-d-dodgeball", "publisher": "Yuke's", "release_date": "Jul 16 2008", "developers": ["Yuke's"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Action", "Sports", "General", "General", "Team", "Other"], "meta_score": 36, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/0752ea70649c479351fd5643828a2403-98.jpg", "descriptions": "[Xbox Live Arcade]  Relive the good old days of playgrounds and recess. Double D Dodgeball recreates the classic childhood sport in a new, futuristic setting with a retro arcade feel. With frenetic eight person multiplayer action, grab seven of your friends and go four-on-four via Xbox Live[Xbox Live Arcade]  Relive the good old days of playgrounds and recess. Double D Dodgeball recreates the classic childhood sport in a new, futuristic setting with a retro arcade feel. With frenetic eight person multiplayer action, grab seven of your friends and go four-on-four via Xbox Live to see which team has the ultimate bragging rights. Choose between a host of retro arcade-themed characters each with their own unique abilities, select either East or West rule sets, switch up the playing surfaces, and more. No need to risk injury, just blast your friends from the comfort of your couch. [Yuke's]… Expand"}, {"name": "Arc of Alchemist", "details_link": "https://www.metacritic.com/game/switch/arc-of-alchemist", "publisher": "Idea Factory", "release_date": "Jan 30 2020", "developers": ["Compile Heart"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 36, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/1/22c782d3f650319dfbf42aed41368597-98.jpg", "descriptions": "Quinn Bravesford and her squad are sent on a quest to find the Great Power — the key to save humanity. Is there hope within the desert or is it merely a mirage?"}, {"name": "Fight Club", "details_link": "https://www.metacritic.com/game/playstation-2/fight-club", "publisher": "VU Games", "release_date": "Nov 16 2004", "developers": ["Genuine Games"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 36, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/3/68d9e70a5b78fc6bed69dba1bd3a63f7-98.jpg", "descriptions": "Learn the 8 Rules of Fight Club. In the underground world of Fight Club, the fight isn't over until someone goes limp, taps out, or is beaten. Immerse yourself in this gritty, visceral world of bare-knuckle fighting, with action, story elements and environments true to the Fight Club movie.Learn the 8 Rules of Fight Club. In the underground world of Fight Club, the fight isn't over until someone goes limp, taps out, or is beaten. Immerse yourself in this gritty, visceral world of bare-knuckle fighting, with action, story elements and environments true to the Fight Club movie. The extreme realism of the game will make you feel every punch and kick by delivering shocking visuals, untraditional moves, and special effects in fully interactive environments. [Vivendi Universal]… Expand"}, {"name": "Eternity: The Last Unicorn", "details_link": "https://www.metacritic.com/game/playstation-4/eternity-the-last-unicorn", "publisher": "1C Entertainment", "release_date": "Mar  5 2019", "developers": ["Void Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 36, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/1/f9cda8d2776d37ae4d35413c160ab5d7-98.jpg", "descriptions": "Eternity: The Last Unicorn is a full-featured action RPG inspired by tales from Norse Mythology with classic game mechanics. Travel through mesmerizing locations, meet fantasy characters and fight to protect Elven immortality."}, {"name": "Tokyo Tattoo Girls", "details_link": "https://www.metacritic.com/game/playstation-vita/tokyo-tattoo-girls", "publisher": "NIS America", "release_date": "Nov 14 2017", "developers": ["SUSHI TYPHOON GAMES"], "platforms": ["PC", "PlayStation Vita"], "genres": ["Action", "Strategy", "Turn-Based", "General"], "meta_score": 36, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/9/463c5a09b9c127bc76db3d817f0ef76d-98.jpg", "descriptions": "Enter the world of Tokyo Tattoo Girls, where you will select a companion girl and battle the Syndicate by conquering the 23 Wards of Tokyo. Power up your companion with gorgeous Japanese tattoos and unleash her true power."}, {"name": "One Piece: Grand Cruise", "details_link": "https://www.metacritic.com/game/playstation-4/one-piece-grand-cruise", "publisher": "Bandai Namco Games", "release_date": "May 22 2018", "developers": ["Bandai Namco Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 35, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/7/0fb709d25f67973c5c822b73b9731ca7-98.jpg", "descriptions": "Come aboard and experience the pirate’s life in One Piece Grand Cruise for PS VR. Be prepared to be swept away in the first One Piece VR experience."}, {"name": "Infernal: Hell's Vengeance", "details_link": "https://www.metacritic.com/game/xbox-360/infernal-hells-vengeance", "publisher": "Playlogic", "release_date": "Jun 30 2009", "developers": ["Metropolis Software"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 35, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/f67a22bc44e724fdd091b0874f8c3fa4-98.jpg", "descriptions": "Infernal tells the story of Ryan Lennox, a fallen angel now recruited by hell to fight 'Etherlight', heaven's own secret agency. Etherlight has eliminated most of hell’s earthly agents and is planning its final blow against its arch rival. Ryan, hunted by his opponents, is left to take themInfernal tells the story of Ryan Lennox, a fallen angel now recruited by hell to fight 'Etherlight', heaven's own secret agency. Etherlight has eliminated most of hell’s earthly agents and is planning its final blow against its arch rival. Ryan, hunted by his opponents, is left to take them on single-handed, armed with a vast arsenal of weapons and supernatural powers. The captivating plot sends him from ancient monastery catacombs and secret mountain hideouts to sprawling harbour docks and oil refineries, before finally facing the ultimate showdown...Ryan Lennox will need all his powers to find out what's really behind Etherlight’s plans, while he unleashes hell with every single weapon in his hand! Unique atmosphere, unbelievable graphics, great amount of possibilities combined with simple intuitive steering, and a hero never seen before - these constitute the essence of Infernal. [Playlogic]… Expand"}, {"name": "Tsunami 2265", "details_link": "https://www.metacritic.com/game/pc/tsunami-2265", "publisher": "Got Game Entertainment", "release_date": "Aug  4 2002", "developers": ["Prograph"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 35, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/fcfa3ea87425ed6859e71fa1e0e71f21-98.jpg", "descriptions": "Featuring vibrant anime-style 3D graphics, Tsunami 2265 hurls you into an intriguing tale, rich with dramatic twists and turns. The story is structured to create a perfect mix between hectic and destructive shoot'em up sections, and intriguing arcade phases. During the adventure phases, youFeaturing vibrant anime-style 3D graphics, Tsunami 2265 hurls you into an intriguing tale, rich with dramatic twists and turns. The story is structured to create a perfect mix between hectic and destructive shoot'em up sections, and intriguing arcade phases. During the adventure phases, you control either of two main characters, Naoko Hikari and Neon Shima, leading them inside secret military bases held under tight surveillance. With the aid of their most powerful Mech, you must reveal the secret that hides behind E.L.EN.A., a mysterious source of energy and untamed power. [Got Game]… Expand"}, {"name": "Jackass the Game", "details_link": "https://www.metacritic.com/game/ds/jackass-the-game", "publisher": "Red Mile Entertainment", "release_date": "Jan  8 2008", "developers": ["Sensory Sweep"], "platforms": ["PlayStation 2", "DS"], "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 35, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/e2683158e17d4987c98b3237e41159d0-98.jpg", "descriptions": "Jackass the game DS brings the zany stunts and irrreverant humor of of MTV’s jackass to the Nintendo DS platform. Explore an open ended interactive environment as you meet the jackass gang and prove yourself through dozens of insane challenges and stunts. [Red Mile Entertainment]"}, {"name": "Bad Boys: Miami Takedown", "details_link": "https://www.metacritic.com/game/gamecube/bad-boys-miami-takedown", "publisher": "Empire Interactive", "release_date": "Sep 14 2004", "developers": ["Blitz Games"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 35, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/1/5a256cf64890fb0dd343de3abf398cc6-98.jpg", "descriptions": "Mike Lowrey and Marcus Burnett of the Tactical Narcotics Team are back to fight crime in Bad Boys II. Based on the movie, Bad Boys II follows this unlikely duo as they try to stop illegal drug trade in Miami. Through 15 action-packed stages, you'll play as either Mike or Marcus in first- orMike Lowrey and Marcus Burnett of the Tactical Narcotics Team are back to fight crime in Bad Boys II. Based on the movie, Bad Boys II follows this unlikely duo as they try to stop illegal drug trade in Miami. Through 15 action-packed stages, you'll play as either Mike or Marcus in first- or third-person viewpoints. Search for clues, wield a variety of weapons, and tear through fully destructible environments to complete a variety of mission objectives.… Expand"}, {"name": "Terminator 3: Rise of the Machines", "details_link": "https://www.metacritic.com/game/xbox/terminator-3-rise-of-the-machines", "publisher": "Atari", "release_date": "Nov 11 2003", "developers": ["Black Ops Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 35, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/4/1ae02cc94743f46fb594eb15b3f40f81-98.jpg", "descriptions": "You are the ultimate weapon in Terminator 3: Rise of the Machines.  Ten years after John Connor helped save mankind from annihilation, the inevitable has occurred: The mechanized Tech-Com forces have risen, and war between man and machine has begun.  As the Terminator, you must useYou are the ultimate weapon in Terminator 3: Rise of the Machines.  Ten years after John Connor helped save mankind from annihilation, the inevitable has occurred: The mechanized Tech-Com forces have risen, and war between man and machine has begun.  As the Terminator, you must use hand-to-hand combat or your massive weaponry to protect Connor, the would-be hero of the future.  Rise of the Machines immerses you in the Terminator 3 world, weaving in and out of the movie's storyline.… Expand"}, {"name": "Charlie and the Chocolate Factory", "details_link": "https://www.metacritic.com/game/playstation-2/charlie-and-the-chocolate-factory", "publisher": "Global Star Software", "release_date": "Jul 11 2005", "developers": ["High Voltage Software", "Backbone Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 35, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/eba5b90da4c8c90c97e00522d2e52cf5-98.jpg", "descriptions": "Step inside the magical world of Willy Wonka's famous chocolate factory. Based on the feature film directed by Tim Burton and the classic Roald Dahl book, the game allows players to explore deep inside the factory and play the beloved story as Charlie Bucket. Find a Golden Ticket and, alongStep inside the magical world of Willy Wonka's famous chocolate factory. Based on the feature film directed by Tim Burton and the classic Roald Dahl book, the game allows players to explore deep inside the factory and play the beloved story as Charlie Bucket. Find a Golden Ticket and, along with four other children, win a personal tour of Willy Wonka's factory guided by the notorious and reclusive candy-maker himself. Embark on a fantastic adventure exploring the many extraordinary environments of the factory, including some from the book that do not appear in the film. Discover what happens after the other children, greed-driven and unrestrained, wreak havoc throughout the factory. Then save the chocolate factory from their destruction by solving mystifying puzzles and using inventive candy powers. By helping the Oompa-Loompas and restoring order to the factory, Charlie can earn the respect of Willy Wonka and win an unexpected prize. Acquire incredible abilities by using fantastic new candies in order to save the factory. Stop the \"rotten\" children from causing chaos and destruction throughout the candy factory. Repair huge, bizarre candy-making machines by solving puzzles and enlisting the help of the Oompa-Loompas. Explore numerous rooms and environments inside Willy Wonka's chocolate factory. [Global Star]… Expand"}, {"name": "Fantastic Four: Rise of the Silver Surfer", "details_link": "https://www.metacritic.com/game/ds/fantastic-four-rise-of-the-silver-surfer", "publisher": "Take-Two Interactive", "release_date": "Jun 15 2007", "developers": ["7 Studios"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 35, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/8e8e3fae5df48462ce7ec145441082c8-98.jpg", "descriptions": "Marvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including SilverMarvel's first family of Super Heroes face its greatest challenge yet as the enigmatic, intergalactic herald, The Silver Surfer, comes to Earth to prepare it for destruction. Transform into any member of the Fantastic Four to fight enemies from the Fantastic Four Universe including Silver Surfer, Super Skrull and more. Battle in 4-player co-op with easy pick up and play ability. Combine super powers for devastating team attacks with the new Fusion Attack System. Truly destructible environments: smash, wreck, wreak havoc. Loads of unlockables including alternate Fantastic Four costumes, historical comic covers, and more. Play as the Silver Surfer and ride in the Fantasticar – only on the DS! [2K Games]… Expand"}, {"name": "Dead Space Ignition", "details_link": "https://www.metacritic.com/game/xbox-360/dead-space-ignition", "publisher": "Electronic Arts", "release_date": "Oct 13 2010", "developers": ["Sumo Digital"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Action", "Shooter", "Puzzle", "Puzzle", "Third-Person", "Action", "Sci-Fi"], "meta_score": 35, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/9ec5ec84b613e84a4815bb2a6f302f51-98.jpg", "descriptions": "Dead Space Ignition combines an interactive comic-style story with three unique hacking mini games; Hardware Crack, Trace Route and System Override. Each game offers a fun and satisfying arcade experience that will challenge players with puzzles and twitch gameplay. Dead Space IgnitionDead Space Ignition combines an interactive comic-style story with three unique hacking mini games; Hardware Crack, Trace Route and System Override. Each game offers a fun and satisfying arcade experience that will challenge players with puzzles and twitch gameplay. Dead Space Ignition features a unique. Choose Your Own Adventure type narrative, allowing players to survive the horrific Necromorph outbreak in multiple ways. The game offers four unique endings and upon completion of each one, players will be rewarded with unlocks including an exclusive suit, all of which can be used by Isaac Clarke in Dead Space 2.… Expand"}, {"name": "7 Days to Die", "details_link": "https://www.metacritic.com/game/xbox-one/7-days-to-die", "publisher": "Telltale Games", "release_date": "Jun 28 2016", "developers": ["Iron Galaxy Studios", "The Fun Pimps"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "Sandbox", "First-Person", "Arcade"], "meta_score": 35, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/742fca8dea47cf824f9f8f8e055bfe5d-98.jpg", "descriptions": "It’s an open-world sandbox game to play alone, via splitscreen, or online, that gives you an enormous amount of freedom to choose how to survive in a post-apocalyptic world. You’re dropped into a harsh environment with almost nothing – not even clothes on your back. Through scavenging,It’s an open-world sandbox game to play alone, via splitscreen, or online, that gives you an enormous amount of freedom to choose how to survive in a post-apocalyptic world. You’re dropped into a harsh environment with almost nothing – not even clothes on your back. Through scavenging, crafting, and hunting, you’ll eventually put together the basic items you’ll need to live. You’ll have to deal with cold, heat, hunger and thirst, and there are wild animals that see you as prey. But that’s not the worst, because you’re not alone — the undead wander all around you. Slow and relatively easy to avoid by day, at night they become merciless, fast-moving killers, hungry for your flesh.… Expand"}, {"name": "Jeremy McGrath Supercross World", "details_link": "https://www.metacritic.com/game/playstation-2/jeremy-mcgrath-supercross-world", "publisher": "Acclaim", "release_date": "Nov 15 2001", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 35, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/2/038a8c34ad8a1c15c823b59865d055a5-98.jpg", "descriptions": "Exclusively features 10-time Supercross champion Jeremy McGrath and 3-time X Games Freestyle MX gold medallist Travis Pastrana. Race on 25 super-sized tracks - baja, indoor supercross, freestyle and outdoor motocross. Play as one of 7 pro riders in a quick freestyle tournament or through theExclusively features 10-time Supercross champion Jeremy McGrath and 3-time X Games Freestyle MX gold medallist Travis Pastrana. Race on 25 super-sized tracks - baja, indoor supercross, freestyle and outdoor motocross. Play as one of 7 pro riders in a quick freestyle tournament or through the championship mode. Attempt over 24 different stunts, including nac-nacs, supermans, fender grabs, 360s and barrel rolls. [Acclaim]… Expand"}, {"name": "George of the Jungle and the Search for the Secret", "details_link": "https://www.metacritic.com/game/wii/george-of-the-jungle-and-the-search-for-the-secret", "publisher": "Crave", "release_date": "Mar 18 2008", "developers": ["Crave"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 35, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/8/5c6f087cd9e2f8122950344740dddc87-98.jpg", "descriptions": "Grab a vine and swing into a grand adventure with your friend, George of the Jungle! George is swinging and soaring through the dangerous terrain in search of the papers that hold the cure to a devastating disease – and he needs your help. A big, mean bird has snatched these precious papersGrab a vine and swing into a grand adventure with your friend, George of the Jungle! George is swinging and soaring through the dangerous terrain in search of the papers that hold the cure to a devastating disease – and he needs your help. A big, mean bird has snatched these precious papers and scattered them throughout the jungle. Join forces with George of the Jungle and help him find the missing pages. Without them, Doctor Scott and the Witch Doctor might never finish their research! [Crave Entertainment]… Expand"}, {"name": "The Golden Compass", "details_link": "https://www.metacritic.com/game/wii/the-golden-compass", "publisher": "Sega", "release_date": "Dec  4 2007", "developers": ["Shiny Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 35, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/abe6dd0cf0a3248613da93168e901a94-98.jpg", "descriptions": "The Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest asThe Golden Compass follows the screenplay adaptation of the first book in the acclaimed trilogy, capturing the fantasy adventure set in a parallel world where giant armored bears rule a kingdom, beautiful witches fly through the frozen skies, and human beings' deepest essence is manifest as talking animals that remain their faithful companion for life – their daemon. Players can assume the role of Lyra, a young girl, along with her daemon Pantalaimon (Pan), as she journeys through the frozen wastes of the North to rescue a friend kidnapped by a mysterious organization known as The Gobblers and winds up on an epic quest to save not only her world, but ours as well. Gamers can also take on the character of Iorek Byrnison, a great armoured polar bear who joins the quest. As Lyra, players use their daemon and collaborate with in-game characters, collecting special items in order to explore, evade, and deceive their way through confrontations with the Gobblers, the Magisterium, and the horribly dangerous spy fly to find her friend. They can also do battle as Iorek with special attacks and a riding mechanic as he protects Lyra during the journey. Gamers can unlock secrets and mini-games using a mysterious, truth-telling golden compass device called an alethiometer. Players can explore 13 vast locations, including all-new breath-taking environments not seen in the film, on this massive journey of collaboration, exploration and the eternal struggle between good and evil. [Sega]… Expand"}, {"name": "Enemy Front", "details_link": "https://www.metacritic.com/game/xbox-360/enemy-front", "publisher": "CI Games", "release_date": "Jun 10 2014", "developers": ["CI Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Historic", "Historic"], "meta_score": 35, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/96be8561c47efeef5d31253dbf5dd5fc-98.jpg", "descriptions": "Enemy Front is the realistic tale of a hardened soldier dropped behind Nazi lines to engage in dynamic, diversified missions ranging from quick skirmishes, espionage assignments, and sabotage activities. The epic scope of Enemy Front spans several years and key battles as it progresses fromEnemy Front is the realistic tale of a hardened soldier dropped behind Nazi lines to engage in dynamic, diversified missions ranging from quick skirmishes, espionage assignments, and sabotage activities. The epic scope of Enemy Front spans several years and key battles as it progresses from the trenches of a desolate France right on through to Berlin and a secret weapons base. Once there, the player must thwart the plans for a terrifying weapon that will all but assure a global Nazis victory.… Expand"}, {"name": "Showtime Championship Boxing", "details_link": "https://www.metacritic.com/game/wii/showtime-championship-boxing", "publisher": "DSI Games", "release_date": "Dec 13 2007", "developers": ["Nikitova Games"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Individual", "Boxing", "Boxing", "Combat", "Boxing / Martial Arts"], "meta_score": 35, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/15f8186e259918c4fd1d675a0eb880eb-98.jpg", "descriptions": "Lace up the gloves and get in the ring for Showtime Championship Boxing. Train and fight your way through the ranks. Blood, sweat, and tears is the only way you will conquer the top contender and be the ultimate champion. An interactive boxing experience that takes gamers to new levels.Lace up the gloves and get in the ring for Showtime Championship Boxing. Train and fight your way through the ranks. Blood, sweat, and tears is the only way you will conquer the top contender and be the ultimate champion. An interactive boxing experience that takes gamers to new levels. \"Knockout\" cutting edge technology takes \"the sweet science\" off the canvas and raises the Championship Belt on video game pugilism. 14 boxers-7 heavyweights, 7 welterweights. 4 different ring environments-Chicago, New York, Las Vegas, Los Angeles. Player can unlock other boxers as Title Belt Series progresses. 3rd person camera view. 6 modes - Single Fight, Amateur Belt, Contender Belt, Showtime Belt, King of the Ring, and Multiplayer. Fights can be between four and twelve rounds. Decisions are made based on TKOs, KOs, or points. Takes full advantage of the Wii Remote and Nunchuk Style interactive capabilities. [DSI Games]… Expand"}, {"name": "Street Jam Basketball", "details_link": "https://www.metacritic.com/game/game-boy-advance/street-jam-basketball", "publisher": "Destination Software", "release_date": "Apr 25 2004", "developers": ["Prograph"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 35, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/08128b7d931779e3251f7d3b9f21e5d0-98.jpg", "descriptions": "Street Jam Basketball features intense three-on-three street ball. You'll select your team from a roster of more than 40 different characters--each with a different style, speed, and special dunks. Take your players throughout more than 20 tournaments while climbing from beginner to violenceStreet Jam Basketball features intense three-on-three street ball. You'll select your team from a roster of more than 40 different characters--each with a different style, speed, and special dunks. Take your players throughout more than 20 tournaments while climbing from beginner to violence mode. Playground locations include the streets, abandoned buildings, the docks, the park, the sea, the roof, and a skyscraper. Street Jam Basketball also features stamina bars, team managing statistics, and a multiplayer mode.… Expand"}, {"name": "Bad Boys: Miami Takedown", "details_link": "https://www.metacritic.com/game/xbox/bad-boys-miami-takedown", "publisher": "Crave", "release_date": "Sep 14 2004", "developers": ["Blitz Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 35, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Mike Lowrey and Marcus Burnett of the Tactical Narcotics Team are back to fight crime in Bad Boys II. Based on the movie, Bad Boys II follows this unlikely duo as they try to stop illegal drug trade in Miami. Through 15 action-packed stages, you'll play as either Mike or Marcus in first- orMike Lowrey and Marcus Burnett of the Tactical Narcotics Team are back to fight crime in Bad Boys II. Based on the movie, Bad Boys II follows this unlikely duo as they try to stop illegal drug trade in Miami. Through 15 action-packed stages, you'll play as either Mike or Marcus in first- or third-person viewpoints. Search for clues, wield a variety of weapons, and tear through fully destructible environments to complete a variety of mission objectives.… Expand"}, {"name": "Sanity of Morris", "details_link": "https://www.metacritic.com/game/xbox-one/sanity-of-morris", "publisher": "StickyLock Studios", "release_date": "Mar 23 2021", "developers": ["Alterego Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 35, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/e286d4c9716fb36d62e852fe01266777-98.jpg", "descriptions": "Sanity of Morris: a psychological horror adventure game. Your flashlight reveals the clues you need to stay sane in the search for your father. Discover the truth. Could aliens be real?"}, {"name": "NCIS", "details_link": "https://www.metacritic.com/game/xbox-360/ncis", "publisher": "Ubisoft", "release_date": "Nov  1 2011", "developers": ["Ubisoft"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 35, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/10736d14b456fe5251e12edabc8f3eb7-98.jpg", "descriptions": "NCIS is now available for the first time ever on your home consoles and PC."}, {"name": "Drug Wars (2009)", "details_link": "https://www.metacritic.com/game/pc/drug-wars-2009", "publisher": "Paleo Entertainment", "release_date": "Mar 17 2009", "developers": ["Paleo Entertainment"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 35, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/f08b7bd4f3a85dee9f99d78fa3f8b43b-98.jpg", "descriptions": "In 3100 A.D., global warming has caused the sea level to rise and engulf the streets of Brooklyn. The land is gone, but society rebuilds the city on top of existing structures, connecting buildings through a network of sky bridges. As the upper class literally moves higher, law enforcementIn 3100 A.D., global warming has caused the sea level to rise and engulf the streets of Brooklyn. The land is gone, but society rebuilds the city on top of existing structures, connecting buildings through a network of sky bridges. As the upper class literally moves higher, law enforcement abandons the lower parts of the city, and its less-affluent inhabitants. To meet the upper city's demand for laborers, city leaders contract the Brooklyn Institute of Technology (B.I.T.) to clone a new working class. At the time, the B.I.T. Labs had made incredible advances in cloning; Neanderthals were chosen as the main focus of the research based on their physical resilience. The city's contract called for far more Neanderthal clones than were required, causing the excess and sub-standard Neo-Neanderthals to be discarded to the dregs of the city. The well established mob entity known as the Merchants of Brooklyn saw a lucrative opportunity here - use the bottom dwellers for high stakes fights to the death. It became the new sport of under-city kings. In MERCHANTS OF BROOKLYN, You take the role of an elite Neanderthal fighter with a taste for blood. Having had your arm unwillingly detached from your body courtesy of a chainsaw, your new prototype biomechanical arm transforms into different twisted and brutal weaponry to aid you in the slaughter. Your goal: escape from the under city and free your brethren to take over the upper utopian empire to do with as you please. [Paleo Entertainment]… Expand"}, {"name": "The History Channel: Battle for the Pacific", "details_link": "https://www.metacritic.com/game/xbox-360/the-history-channel-battle-for-the-pacific", "publisher": "Activision", "release_date": "Dec  4 2007", "developers": ["Cauldron Ltd."], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "12  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 35, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/cdbc7e5b4f599c00373e19af8659514e-98.jpg", "descriptions": "The History Channel takes you to the Battle for the Pacific where you will experience history brought to life in one of the defining campaigns of World War II. Relive epic land battles fought on some of the most brutal and unforgiving battlefields in recorded history. Retake strategicallyThe History Channel takes you to the Battle for the Pacific where you will experience history brought to life in one of the defining campaigns of World War II. Relive epic land battles fought on some of the most brutal and unforgiving battlefields in recorded history. Retake strategically important locations throughout the Pacific Theatre that are vital to the allies on the Road to Tokyo.  Play through the eyes of an American GI as you experience intense, no holds barred action against an opponent for which surrender isn't an option! Fire authentic allied and axis weaponry including sub-machine guns, sniper rifles, anti-aircraft guns, pistols, and grenades Relive History - each level begins with a documentary video featuring actual battle footage, key facts and statistics, and the importance that the battle ultimately played in the allied victory. Fight from Henderson Field in Guadalcanal through the Philippines to Mount Suribachi on Iwo Jima. Experience some of the most exotic and forbidden battlefields including dense jungles and barren volcanic islands. Face the harsh realities of war as you engage the enemy on the frontlines. Fight alongside squadron members reacting to the events of the battlefield, where fighting is often hand to hand and your objective is simple - defeat the enemy at all costs. Based on actual battles including storming the beaches in an amphibious assault, recapturing a strategic airfield, defending against an enemy assault, going on a search and destroy mission, fighting through fortified caves and scaling Mount Suribachi to plant the American flag. Play online as an American or Japanese soldier in your favorite individual and team based modes including elimination, team elimination, death match, team death match and capture the flag on battlefields painstakingly recreated from topographical maps and historical records. Battles come to life amidst exploding artillery, whistling bullets, falling comrades, unrelenting enemies and much more. [Activision]… Expand"}, {"name": "Fast & Furious Crossroads", "details_link": "https://www.metacritic.com/game/playstation-4/fast-furious-crossroads", "publisher": "Bandai Namco Games", "release_date": "Aug  7 2020", "developers": ["Slightly Mad Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 9 ", "genres": ["Action Adventure", "Linear", "Racing", "Simulation", "Arcade", "Automobile"], "meta_score": 35, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/0/73ec162b9df08968abf0dcc5ec9b4bb3-98.jpg", "descriptions": "Gear up for an epic new chapter in the Fast & Furious saga with high-speed heists, cinematic nonstop action, and adrenaline-fueled stunts in exotic locations."}, {"name": "Girl Fight", "details_link": "https://www.metacritic.com/game/playstation-3/girl-fight", "publisher": "Majesco Games", "release_date": "Sep 24 2013", "developers": ["MicroProse", "Kung Fu Factory"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 35, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/6a850c83352872719b4f82d0e70a4486-98.jpg", "descriptions": "Published by Majesco Entertainment, Girl Fight allows players to choose from an array of sexy fighters to battle their way out of THE FOUNDATION, a shadowy, scientific organization looking to weaponize the psionic fighting abilities of the cast of gorgeous, all-female fighters. WithPublished by Majesco Entertainment, Girl Fight allows players to choose from an array of sexy fighters to battle their way out of THE FOUNDATION, a shadowy, scientific organization looking to weaponize the psionic fighting abilities of the cast of gorgeous, all-female fighters. With unlimited funding and no moral or ethical compass, THE FOUNDATION collects its test subjects from all around the world, often abducting and plugging women into their virtual construct known as The Mainframe. To make it back to reality, the women must utilize their fighting and psionic abilities in an all-out battle for survival.… Expand"}, {"name": "Valhalla Knights: Eldar Saga", "details_link": "https://www.metacritic.com/game/wii/valhalla-knights-eldar-saga", "publisher": "XSEED Games", "release_date": "Sep 30 2009", "developers": ["K2", "Kurogane"], "platforms": "Wii", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 35, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/4ee8504411cffc927805b922593891d7-98.jpg", "descriptions": "Valhalla Knights: Eldar Saga is the third installment of the popular action RPG and marks the first time the title is available on a home console. Enter into an epic tale that has endured for generations and generations. For centuries the land of Eldar has been synonymous with chaos andValhalla Knights: Eldar Saga is the third installment of the popular action RPG and marks the first time the title is available on a home console. Enter into an epic tale that has endured for generations and generations. For centuries the land of Eldar has been synonymous with chaos and destruction; a place where monsters prey freely and demons wreak havoc, indiscriminate in their attacks. Legend tells of how, ages past, a being known as the Spirit King gained control of the creatures and waged an unrelenting war upon civilization. Order and life were brought to the brink of destruction, but an alliance of the four races was able to drive them back and seal the evil.  Centuries have passed since that time, but once again the lands are slowly being overrun by the reemerging monsters. With the continent giving way to madness, a hero must come forth to reunite the races and confront the relentless enemy. And so the saga continues. [XSEED]… Expand"}]