[{"name": "NFL Fever 2003", "details_link": "https://www.metacritic.com/game/xbox/nfl-fever-2003", "publisher": "Microsoft Game Studios", "release_date": "Aug  5 2002", "developers": ["Microsoft Game Studios"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/b63c8d697955de6a8bd21e6c4d0ff398-98.jpg", "descriptions": "The NFL Fever franchise heats up with a uniform and stadium editor, new levels and modes of customization, and online play through Xbox Live. You can play multiple seasons and unlock past Super Bowl championship teams that become on-field opponents in your future schedules. This year'sThe NFL Fever franchise heats up with a uniform and stadium editor, new levels and modes of customization, and online play through Xbox Live. You can play multiple seasons and unlock past Super Bowl championship teams that become on-field opponents in your future schedules. This year's player models now reflect the size, shape, and attitude of real NFL players; and all the tackles, throws, and catches are based on real player moves. Now with Xbox Live, you can challenge players around the world--in games that reflect the home team's weather conditions.… Expand"}, {"name": "Microsoft Golf 2001 Edition", "details_link": "https://www.metacritic.com/game/pc/microsoft-golf-2001-edition", "publisher": "Microsoft Game Studios", "release_date": "Aug 24 2000", "developers": ["Microsoft Game Studios"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/1fe1108b72140316073fc93c77ac37b7-98.jpg", "descriptions": "Designed for the new PC golfer, Golf 2001 combines easy-to-use features with the added realism of great golf anytime you want it. Learn the basics with in-game lessons and a one-click swing -- then shoot for birdie on every hole. [Microsoft]"}, {"name": "Amnesia: A Machine for Pigs", "details_link": "https://www.metacritic.com/game/pc/amnesia-a-machine-for-pigs", "publisher": "Frictional Games", "release_date": "Sep 10 2013", "developers": ["Frictional Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Horror", "Horror", "Action Adventure", "Survival"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/460a827ae5f726ebe2688fc8556ebc49-98.jpg", "descriptions": "Amnesia: A Machine for Pigs  is an upcoming survival horror video game developed by thechineseroom and produced by Frictional Games. The game is an indirect sequel to Amnesia: The Dark Descent, which was developed and produced by Frictional Games."}, {"name": "South Park Let's Go Tower Defense Play!", "details_link": "https://www.metacritic.com/game/xbox-360/south-park-lets-go-tower-defense-play!", "publisher": "Microsoft Game Studios", "release_date": "Oct  7 2009", "developers": ["Microsoft Game Studios", "Doublesix"], "platforms": "Xbox 360", "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Fantasy", "Fantasy", "Defense"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/d4a98d52a7fa88a11fd178da63e2ecbd-98.jpg", "descriptions": "[Xbox Live Arcade]  Play as Stan, Kyle, Kenny, Cartman, or any number of your favorite South Park characters in South Park Let's Go Tower Defense Play! It's the fast-paced action/strategy game, where you play to save the town of South Park. Combining snowball-throwing action with tower[Xbox Live Arcade]  Play as Stan, Kyle, Kenny, Cartman, or any number of your favorite South Park characters in South Park Let's Go Tower Defense Play! It's the fast-paced action/strategy game, where you play to save the town of South Park. Combining snowball-throwing action with tower defense strategy, the game is designed for players of all skill levels. Unlock special content and new characters throughout the game for your in-game scrapbook. Play locally with up to four players or team up on Xbox LIVE in the story-based campaign or the extra-demanding Challenge levels. [Microsoft]… Expand"}, {"name": "Gamedec", "details_link": "https://www.metacritic.com/game/pc/gamedec", "publisher": "Anshar Studios", "release_date": "Sep 16 2021", "developers": ["Anshar Studios"], "platforms": ["PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Role-Playing", "General", "Western-Style"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/9da628521347a492a9cd6502d5245196-98.jpg", "descriptions": "Gamedec is an adaptive cyberpunk RPG. As a private detective, it's your job to solve crimes inside virtual worlds. What decisions will you make in a world where child slavery is a F2P game, where murder over a game-clan dispute is an every-day reality? Who will you become in the XXII century?"}, {"name": "Black The Fall", "details_link": "https://www.metacritic.com/game/pc/black-the-fall", "publisher": "Square Enix", "release_date": "Jul  4 2014", "developers": ["Sand Sailor Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/d5e38ca58d07d3b26cc7d8371c62322a-98.jpg", "descriptions": "Black The Fall is an atmospheric side-scrolling shooter with puzzle solving elements. An odd and unexpected black and white dream inspired by a childhood passed behind the Iron Curtain."}, {"name": "Apex Construct", "details_link": "https://www.metacritic.com/game/playstation-4/apex-construct", "publisher": "Fast Travel Games", "release_date": "Feb 20 2018", "developers": ["Fast Travel Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/905a9e94b74847c40088ac42479ba677-98.jpg", "descriptions": "In this atmospheric first-person action game built for VR, the fate of mankind rests on you — the last human alive."}, {"name": "Yurukill: The Calumniation Games", "details_link": "https://www.metacritic.com/game/switch/yurukill-the-calumniation-games", "publisher": "NIS America", "release_date": "Jul  5 2022", "developers": ["G.Rev"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/cb904cf99abfbe4af34cb9f809d4760a-98.jpg", "descriptions": "Renowned author Homura Kawamoto delivers a twisted, multifaceted story in Yurukill. Accused of arson and the murders of 21 people, protagonist Sengoku Shunju is forced to fight for his freedom and prove his innocence. As one of six Prisoners, he must pair up with one of five victims,Renowned author Homura Kawamoto delivers a twisted, multifaceted story in Yurukill. Accused of arson and the murders of 21 people, protagonist Sengoku Shunju is forced to fight for his freedom and prove his innocence. As one of six Prisoners, he must pair up with one of five victims, referred to as Executioners, within the confines of the strange and secluded amusement park known as Yurukill Land. Together each of the five teams—Mass Murderers, Death Dealing Duo, Crafty Killers, Sly Stalkers, and Peeping Toms—must face and overcome the entertainment venue's so-called \"attractions\" in order to attain what they desire. Should the Prisoners succeed, their crimes shall be pardoned. But if the Executioners win, they will be granted revenge for their loved ones. The in-depth story offers unique gameplay experiences including collating evidence, gathering testimonies, and solving puzzles.Yurukill’s shoot-‘em-up gameplay developed by veteran developer G.rev features action packed and fast-paced combat. In addition, online leaderboards give players the opportunity to see how they stack up against the competition.\r… Expand"}, {"name": "Assassin's Creed Unity", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-unity", "publisher": "Ubisoft", "release_date": "Nov 11 2014", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Historic", "Open-World"], "meta_score": 72, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/f5d286d04dbe94469541ab116a938b4d-98.jpg", "descriptions": "1789. Paris - France. The French Revolution turns a once-magnificent city into a house of terror and chaos. Its cobblestone streets run rouge with the blood of commoners who dared to challenge the oppressive aristocracy. As the country comes apart at the bloody seams, a young man named Arno1789. Paris - France. The French Revolution turns a once-magnificent city into a house of terror and chaos. Its cobblestone streets run rouge with the blood of commoners who dared to challenge the oppressive aristocracy. As the country comes apart at the bloody seams, a young man named Arno heads out on an unprecedented journey to expose the real powers underpinning the Revolution. His quest injects him into the heart of a ruthless struggle for the fate of a nation, and transforms him into a legitimate Master Assassin. From the siege on the Bastille to the killing of King Louis XVI, feel the reality of the French Revolution as never before, and assist the people of France carve a new destiny.… Expand"}, {"name": "Mercenaries 2: World in Flames", "details_link": "https://www.metacritic.com/game/playstation-3/mercenaries-2-world-in-flames", "publisher": "Electronic Arts", "release_date": "Aug 31 2008", "developers": ["Pandemic Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/bc3dd238240b6453ae09d7e2597229ec-98.jpg", "descriptions": "Mercenaries 2: World in Flames is an explosive open-world action game set in a massive, highly reactive, war-torn world. A power-hungry tyrant messes with Venezuela's oil supply, sparking an invasion that turns the country into a warzone. But for you, international crisis is all upside: YouMercenaries 2: World in Flames is an explosive open-world action game set in a massive, highly reactive, war-torn world. A power-hungry tyrant messes with Venezuela's oil supply, sparking an invasion that turns the country into a warzone. But for you, international crisis is all upside: You are a mercenary, and you profit from chaos. Mercenaries 2 features a slew of potential clients, all willing to pay you to do their dirty work. Dirty deeds, done for exorbitant fees. These are world powers with deep pockets, deep grudges, and enough arms and ammo to start World War III. This is your kind of environment. Mercenaries 2 features the latest and most dangerous in civilian and military tech, everything from shiny new sports cars, to the future-tech satellite-guided bunker-busting mini-nuke. Tanks, APCs, boats, luxury automobiles – you name it, you can have it delivered to you in real time. And if you run out of cash you can always 'acquire' the gear you need in the field. If you see it, you can buy it, steal it, or blow the living crap out of it. Play your own way, or play with the help of a friend in the new cooperative multiplayer mode. You are not a soldier. You don't have to play by anyone's rules. You have your own code: you will fulfill the terms of the contract, no matter what. Not everyone in the world of Mercenaries is as honorable. Everyone will try and screw you, given the chance. They think they can get away with it, because they don't know rule #1: EVERYBODY PAYS. [Pandemic Studios]… Expand"}, {"name": "The Dungeon of Naheulbeuk: The Amulet of Chaos", "details_link": "https://www.metacritic.com/game/pc/the-dungeon-of-naheulbeuk-the-amulet-of-chaos", "publisher": "Dear Villagers", "release_date": "Sep 17 2020", "developers": ["Artefacts Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/2f14e222d4182822dd5a2ee614746b37-98.jpg", "descriptions": "Step into the wacky heroic fantasy universe of the Dungeon of Naheulbeuk. Lead a team of unlikely and clumsy heroes in an epic and challenging tactical RPG. Live an adventure filled with humor, surprises and silly encounters."}, {"name": "Valley", "details_link": "https://www.metacritic.com/game/playstation-4/valley", "publisher": "Blue Isle Studios", "release_date": "Aug 23 2016", "developers": ["Blue Isle Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/3de1c30e44dd8c21fa3dd12473610f73-98.jpg", "descriptions": "Explore the vast and beautiful game world of Valley using the power of the L.E.A.F. SUIT: a fierce exoskeleton that grants exceptional speed and agility along with the phenomenal ability to manipulate the life and death of all living things."}, {"name": "Warhammer 40,000: Regicide", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-regicide", "publisher": "Hammerfall Publishing", "release_date": "Sep  8 2015", "developers": ["Hammerfall Publishing"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Strategy", "Real-Time", "General"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/e6442e5e314be6f25e96d6a2f347c693-98.jpg", "descriptions": "Regicide is a novel take on the Warhammer universe, featuring an intense mix of strategy and cinematic gameplay. An original and brutal take on turn-based strategy, Regicide fuses characters, abilities and environments derived from the Warhammer 40,000 universe from Games Workshop, withRegicide is a novel take on the Warhammer universe, featuring an intense mix of strategy and cinematic gameplay. An original and brutal take on turn-based strategy, Regicide fuses characters, abilities and environments derived from the Warhammer 40,000 universe from Games Workshop, with traditional strategy and new action-heavy gameplay elements.… Expand"}, {"name": "Gateways", "details_link": "https://www.metacritic.com/game/pc/gateways", "publisher": "Smudged Cat Games", "release_date": "Sep 12 2012", "developers": ["Smudged Cat Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/0590ecd7bb58fd4ad48e6646d522ef34-98.jpg", "descriptions": "Gateways is a 2D platform game set in the lab of an inventor called Ed following an outbreak of a number of his more \"creative\" experiments.  Can you help him escape the lab?"}, {"name": "Final Fantasy Type-0 HD", "details_link": "https://www.metacritic.com/game/xbox-one/final-fantasy-type-0-hd", "publisher": "Square Enix", "release_date": "Mar 17 2015", "developers": ["HexaDrive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/ffae40907abd85347a7d96f23277bcdb-98.jpg", "descriptions": "Experience the epic saga of the eastern lands of Orience. Alternate at will between fourteen characters with unique weapons and abilities."}, {"name": "Dark Messiah of Might and Magic", "details_link": "https://www.metacritic.com/game/pc/dark-messiah-of-might-and-magic", "publisher": "Ubisoft", "release_date": "Oct 24 2006", "developers": ["Arkane Studios"], "platforms": ["Xbox 360", "PC"], "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 72, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/8382fae0ec8e17ff1acbf94a33447507-98.jpg", "descriptions": "Dark Messiah of Might & Magic puts players in a first-person perspective, allowing them to immerse themselves in the legendary Might and Magic universe as never before. It is also the world's first fantasy action game to feature a complete first-person combat system. It takes full advantageDark Messiah of Might & Magic puts players in a first-person perspective, allowing them to immerse themselves in the legendary Might and Magic universe as never before. It is also the world's first fantasy action game to feature a complete first-person combat system. It takes full advantage of the Source Engine's exceptional technological enhancements in areas such as character animation, advanced AI, real-world physics and shader-based rendering. [Ubisoft]… Expand"}, {"name": "Action Henk", "details_link": "https://www.metacritic.com/game/xbox-one/action-henk", "publisher": "RageSquid", "release_date": "Mar  4 2016", "developers": ["RageSquid"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "3D"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/291f8be84057d100f27e50d1c2d9e646-98.jpg", "descriptions": "Action Henk is a platform-racing game set in a beautifully crafted 3D toy box world, where a cast of classic action figure inspired characters compete to once and for all prove that Action Henk is the fastest of them all. The game challenges players to shave milliseconds off their times byAction Henk is a platform-racing game set in a beautifully crafted 3D toy box world, where a cast of classic action figure inspired characters compete to once and for all prove that Action Henk is the fastest of them all. The game challenges players to shave milliseconds off their times by running, jumping and butt-sliding with 5 playable characters across over 70 challenging levels in a game which revels in almost sonic speeds.… Expand"}, {"name": "Styx: Shards of Darkness", "details_link": "https://www.metacritic.com/game/xbox-one/styx-shards-of-darkness", "publisher": "Focus Home Interactive", "release_date": "Mar 14 2017", "developers": ["Cyanide"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/e0b37599ff1fefa1ed552195cafbc7b7-98.jpg", "descriptions": "Following the fall of Akenash tower, an extraordinary matter has forced Styx out of hiding and into Korrangar, city of the Dark Elves. Supposedly impregnable, a diplomatic summit offers Styx a chance at slipping in unnoticed. His infiltration complete, Styx will stop at nothing to accomplishFollowing the fall of Akenash tower, an extraordinary matter has forced Styx out of hiding and into Korrangar, city of the Dark Elves. Supposedly impregnable, a diplomatic summit offers Styx a chance at slipping in unnoticed. His infiltration complete, Styx will stop at nothing to accomplish the robbery of a lifetime: stealing a scepter of immense and indomitable power.\r Embark upon a stealthy adventure with new enemies, new environments, and a plethora of new mechanics refining the abilities of Styx - grappling around corners, climbing ropes, and using his trusty knife to zip line!… Expand"}, {"name": "Tormentum - Dark Sorrow", "details_link": "https://www.metacritic.com/game/pc/tormentum---dark-sorrow", "publisher": "OhNoo", "release_date": "Mar  4 2015", "developers": ["OhNoo"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Adventure", "Point-and-Click"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/e2f18b83a0f08d573f59a231ab8cf1d1-98.jpg", "descriptions": "Tormentum is a dark Point and Click adventure game. A nameless hero finds himself in a space between fantasy and nightmare. He does not recall his name or from whence he comes. Traversing strange lands, he struggles to discover the truth about the places around him, as well as about himself."}, {"name": "Justice League Heroes: The Flash", "details_link": "https://www.metacritic.com/game/game-boy-advance/justice-league-heroes-the-flash", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 17 2006", "developers": ["WayForward"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/19c511ed7a08ce3c5b04b5c18e1d0c03-98.jpg", "descriptions": "Justice League Heroes: The Flash, developed by WayForward Technologies for the Game Boy Advance system, lets gamers play as DC Comics' The Flash, wielding his Speed Force to strike enemies before they can strike back, unlock powerful combination attacks and slow-down time to defeatJustice League Heroes: The Flash, developed by WayForward Technologies for the Game Boy Advance system, lets gamers play as DC Comics' The Flash, wielding his Speed Force to strike enemies before they can strike back, unlock powerful combination attacks and slow-down time to defeat adversaries in slow motion. As the Fastest Man Alive, gamers also enlist the support of fellow Justice League members by calling in special attacks from Superman, Batman, Wonder Woman and other DC Comics super heroes.… Expand"}, {"name": "Mail Mole", "details_link": "https://www.metacritic.com/game/switch/mail-mole", "publisher": "Undergames", "release_date": "Mar  4 2021", "developers": ["Talpa Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/a5909aefaa88362046d426183c183035-98.jpg", "descriptions": "Mail Mole is a charming 3D platformer featuring Molty, the fastest delivery mole, in his quest to save Carrotland from disaster!Explore magical worlds, from the calm beaches of Coconut Islands to the freezing heights of Yeti Ridge, make new friends, race against unusual mech-rivals, solveMail Mole is a charming 3D platformer featuring Molty, the fastest delivery mole, in his quest to save Carrotland from disaster!Explore magical worlds, from the calm beaches of Coconut Islands to the freezing heights of Yeti Ridge, make new friends, race against unusual mech-rivals, solve puzzles and find all of the delicious collectibles scattered around Carrotland, as Molty (the mail mole!) embarks on an adventure to make his most important delivery yet... before it's too late!Running through the underground, climbing walls and soaring the skies, there's no place our hero can't reach! Traveling with Cannon Lines, Molty will take on the most demanding and varied platforming challenges to reach Carrotland's furthest and oldest Mailboxes: endless pits, giant boulders, steep slopes, bouncing platforms, sharp spikes..... tough roads! But when the power is out, you can't send an e-mail!… Expand"}, {"name": "Heavy Bullets", "details_link": "https://www.metacritic.com/game/pc/heavy-bullets", "publisher": "Devolver Digital", "release_date": "May 15 2014", "developers": ["Terri Vellimann"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/9abcf0bb9d00221d8566a0af44928ff7-98.jpg", "descriptions": "Heavy Bullets is a randomized FPS dungeon crawler where players make their way through a colorful maze, while protecting themselves from aggressive creatures and malfunctioning security devices. The goal lies at the end of the 8th level, where they must reset the security mainframe toHeavy Bullets is a randomized FPS dungeon crawler where players make their way through a colorful maze, while protecting themselves from aggressive creatures and malfunctioning security devices. The goal lies at the end of the 8th level, where they must reset the security mainframe to restore order and reap the rewards.… Expand"}, {"name": "Go! Go! Kokopolo", "details_link": "https://www.metacritic.com/game/ds/go!-go!-kokopolo", "publisher": "Room 4 Games Limited", "release_date": "Aug 11 2011", "developers": ["Tanukii Studios"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/9fa4e91f67bbcdf96616a05503f0220b-98.jpg", "descriptions": "Get ready for a brand new experience in arcade action - the worlds first Chase ‘em up! Take control of Kokopolo, the hyperactive wildcat, in a crazy, fast and frantic, action-packed caper set across 80 stages of pure arcade mayhem. Hunt down those responsible for disturbing your afternoonGet ready for a brand new experience in arcade action - the worlds first Chase ‘em up! Take control of Kokopolo, the hyperactive wildcat, in a crazy, fast and frantic, action-packed caper set across 80 stages of pure arcade mayhem. Hunt down those responsible for disturbing your afternoon slumber, with a quick slash from your sharp claws, and lure them into an epic chase, through mind-twisting mazes, and across hazard filled highways…finally leading them to their doom, in the bellies of the ever-hungry, carnivorous Snap Snap plants! But the fun doesn’t end there, once the unsuspecting enemies have been devoured, focus shifts to the low screen, where perfect touch-timing must be utilised in order to digest the enemies once and for all.… Expand"}, {"name": "Gray Matter", "details_link": "https://www.metacritic.com/game/pc/gray-matter", "publisher": "Viva Media", "release_date": "Feb 22 2011", "developers": ["Wizarbox"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/66e45e2a200b878eb07215f41736779c-98.jpg", "descriptions": "Gray Matter is the first adventure game by renowned author Jane Jensen since the release of Gabriel Knight 3: the story mixes eerie goings-on with supernatural events in best Jensen-style. Neurobiologist Dr. David Styles is one of the game's central characters: since losing his wife in aGray Matter is the first adventure game by renowned author Jane Jensen since the release of Gabriel Knight 3: the story mixes eerie goings-on with supernatural events in best Jensen-style. Neurobiologist Dr. David Styles is one of the game's central characters: since losing his wife in a horrible accident some several years ago, he has become a recluse, seldom leaving Dread Hill House, his English country estate.… Expand"}, {"name": "SILT", "details_link": "https://www.metacritic.com/game/switch/silt", "publisher": "Sold Out Software", "release_date": "Jun  1 2022", "developers": ["Spiral Circus"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/ed20dcf625f86ad87630a2dccadb78e3-98.jpg", "descriptions": "Silt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roamSilt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roam the ocean void, discovering new creatures and using their unique abilities to solve puzzles, traverse the environment, and make your way deeper into the darkness.… Expand"}, {"name": "Flood of Light", "details_link": "https://www.metacritic.com/game/switch/flood-of-light", "publisher": "Irisloft", "release_date": "Aug 23 2018", "developers": ["Irisloft"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/e59116866698ebc2d3d4e049bda45e39-98.jpg", "descriptions": "You control a mysterious girl who arrives at a city that is completely flooded with water. Only she possesses the ability to control light.By using the girl's supernatural power, you can solve various puzzles to gradually make the water recede and ultimately save the city.\nHowever, byYou control a mysterious girl who arrives at a city that is completely flooded with water. Only she possesses the ability to control light.By using the girl's supernatural power, you can solve various puzzles to gradually make the water recede and ultimately save the city.However, by doing so, the true purpose of this mysterious girl will also be slowly revealed to you.… Expand"}, {"name": "Marvel's Guardians of the Galaxy - Episode 1: Tangled Up in Blue", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-guardians-of-the-galaxy---episode-1-tangled-up-in-blue", "publisher": "Telltale Games", "release_date": "Apr 18 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 72, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/fc6f68f0f3b117abe5f1a4713f31718a-98.jpg", "descriptions": "Marvel’s Guardians of the Galaxy: The Telltale Series delivers a wholly new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakableMarvel’s Guardians of the Galaxy: The Telltale Series delivers a wholly new story of the universe’s unlikeliest heroes, the rag-tag band of outlaws who go by the names Star-Lord, Gamora, Drax, Rocket, and Groot. In the wake of an epic battle, the Guardians discover an artifact of unspeakable power.… Expand"}, {"name": "Unepic", "details_link": "https://www.metacritic.com/game/wii-u/unepic", "publisher": "EnjoyUp Games", "release_date": "Jan 16 2014", "developers": ["EnjoyUp Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Wii U"], "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "2D"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/31a3da2770838934192015eef78246f8-98.jpg", "descriptions": "Unepic is a combination of platforming and role playing games. There are many hilarious references throughout the game. The game takes place in Harnakon, a huge medieval castle.\r It is set in the hardcore NES Style, yet refined with the latest features. This makes Unepic a very unique game."}, {"name": "Disney Castle of Illusion starring Mickey Mouse", "details_link": "https://www.metacritic.com/game/playstation-3/disney-castle-of-illusion-starring-mickey-mouse", "publisher": "Sega", "release_date": "Sep  3 2013", "developers": ["Sega"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/019efae6fe0e88972580f4264b2129b2-98.jpg", "descriptions": "A Castle of Illusion remake may be in the works based on the latest teaser trailer from Sega."}, {"name": "GWENT: Rogue Mage", "details_link": "https://www.metacritic.com/game/pc/gwent-rogue-mage", "publisher": "CD Projekt Red Studio", "release_date": "Jul  7 2022", "developers": ["CD Projekt Red Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 72, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/00feb7211f79705fa1ec565153fec869-98.jpg", "descriptions": "GWENT: Rogue Mage is a first single-player expansion to GWENT: The Witcher Card Game. It combines elements of roguelike, deckbuilding, and strategy games with GWENT card battles."}, {"name": "Operation: Tango", "details_link": "https://www.metacritic.com/game/playstation-5/operation-tango", "publisher": "Clever Plays", "release_date": "Jun  1 2021", "developers": ["Clever Plays"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["Action Adventure", "Linear"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/5a0a03f6bdb89a9302618eed0ae0ca12-98.jpg", "descriptions": "It takes two to save the world in this Asymmetrical Spy Thriller. Pair up with a friend as a special agent or elite hacker, and work together to bring a high-tech global menace to its knees."}, {"name": "Spellbreak", "details_link": "https://www.metacritic.com/game/playstation-4/spellbreak", "publisher": "Proletariat, Inc.", "release_date": "Sep  3 2020", "developers": ["Proletariat", "Inc."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/ac96adb68dfa5f7f9bd1b966134e78a6-98.jpg", "descriptions": "Spellbreak is an epic fantasy action spellcasting game where players choose a class, weave spectacular spell combinations and fight other players to become an all-powerful battlemage."}, {"name": "Borderlands 3: Guns, Love, and Tentacles", "details_link": "https://www.metacritic.com/game/pc/borderlands-3-guns-love-and-tentacles", "publisher": "2K Games", "release_date": "Mar 26 2020", "developers": ["Gearbox Software"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/afc94c9ee9e0735d318fadfecc17c095-98.jpg", "descriptions": "A couple of familiar faces will be among the guests at the betrothed partners' engagement celebration: former Vault Hunter Gaige is moonlighting as a wedding planner, joined as always by her badass robot BFF Deathtrap. Pay no attention to the gargantuan monster's corpse nearby; this party'sA couple of familiar faces will be among the guests at the betrothed partners' engagement celebration: former Vault Hunter Gaige is moonlighting as a wedding planner, joined as always by her badass robot BFF Deathtrap. Pay no attention to the gargantuan monster's corpse nearby; this party's going to be legendary.… Expand"}, {"name": "Wallace & Gromit's Grand Adventures, Episode 3: Muzzled!", "details_link": "https://www.metacritic.com/game/xbox-360/wallace-gromits-grand-adventures-episode-3-muzzled!", "publisher": "Telltale Games", "release_date": "Nov  4 2009", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Miscellaneous", "General", "Compilation"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/12b96f3baade1907521a95fae3d67c25-98.jpg", "descriptions": "[Xbox Live Arcade]  Join Wallace & Gromit once again in Wallace & Gromit Episode 3: Muzzled!™, the third tale in their newest adventure series by Telltale! When the storm from The Last Resort destroys the local dog shelter, the swindling Monty Muzzle comes to town. Muzzle preys on the[Xbox Live Arcade]  Join Wallace & Gromit once again in Wallace & Gromit Episode 3: Muzzled!™, the third tale in their newest adventure series by Telltale! When the storm from The Last Resort destroys the local dog shelter, the swindling Monty Muzzle comes to town. Muzzle preys on the townspeople by offering to hold a grand fundraising fair to rebuild a shelter, with the main draw being his mechanized \"Muzzler\" carousel ride. But when Gromit realizes that Muzzle’s intentions aren’t exactly charitable, he must foil the huckster’s plot in order to save both the town’s investment and rescue his canine friends. [Telltale Games]… Expand"}, {"name": "In the Groove", "details_link": "https://www.metacritic.com/game/playstation-2/in-the-groove", "publisher": "RedOctane", "release_date": "Jun  8 2005", "developers": ["Roxor Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/5894196560448e30dd081805230636c5-98.jpg", "descriptions": "Get your groove on with the home version of the next generation arcade dance game. In The Groove was designed from the ground up by hardcore dance game fans and represents an incredible leap forward in the genre. While maintaining the same addictive game play of popular dance titles, In TheGet your groove on with the home version of the next generation arcade dance game. In The Groove was designed from the ground up by hardcore dance game fans and represents an incredible leap forward in the genre. While maintaining the same addictive game play of popular dance titles, In The Groove features exclusive, never before seen features like modifiers that make the game arrows spin, change speeds, and boomerang, and move in 3D along with over 60 other amazing effects that create additional challenges and endless customization for dance game fans. Over 70 brand new songs from proven talent and new independent artists, covering a wide variety of genres. Over 550 new step patterns from step artists in the dance community. Unlockable songs and courses. 3 Styles of play: One Player, Two Player, or Double Pad. Up to 5 difficulty levels per song to accommodate all players from beginners to experts. Fast menu navigation and 2 minute songs- spend more time playing. Innovations in step choreography- mines, hands, and quads will have you making new kinds of moves. [RedOctane]… Expand"}, {"name": "Zoo Tycoon 2", "details_link": "https://www.metacritic.com/game/pc/zoo-tycoon-2", "publisher": "Microsoft Game Studios", "release_date": "Nov 11 2004", "developers": ["Blue Fang Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/aef53abd3285fb79bca2b70d9f959e81-98.jpg", "descriptions": "Featuring 30 incredibly detailed animals, a dazzling array of building tools and objects, a new zoom feature, and 3D graphics that allow players to keep a closer eye on the action and craft more creative zoos, Zoo Tycoon 2 is set to crank up the excitement, challenge, and fun of building theFeaturing 30 incredibly detailed animals, a dazzling array of building tools and objects, a new zoom feature, and 3D graphics that allow players to keep a closer eye on the action and craft more creative zoos, Zoo Tycoon 2 is set to crank up the excitement, challenge, and fun of building the ultimate zoo. Easy to start and easy to play, Zoo Tycoon 2 gets you up close and interacting with the animals and zoo, offering intuitive controls and fun tutorials that allow players of all ages to enjoy the game right out of the box. From the start, you'll be immersed in the zoo experience with new features including the Zoo Guest mode, in which you can walk around and enjoy the game like visitors on a day at the zoo; Zookeeper mode, which allows you to interact with your animals as never before; and a new Photo mode, which lets you snap pictures of your favorite animals and guests and share them online with friends. Zoopedia, detailing all types of entertaining and interesting facts about animals, rounds out the new and improved features of the upcoming game. Unlike the original Zoo Tycoon, the new version allows players to participate in up to three challenging gameplay types: Campaign, Freeform, and Sandbox. [Microsoft]… Expand"}, {"name": "Patapon", "details_link": "https://www.metacritic.com/game/playstation-4/patapon", "publisher": "Sony Interactive Entertainment", "release_date": "Aug  1 2017", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 72, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/858f6d7d1333c5ab13f9b95933e9fe9c-98.jpg", "descriptions": "Set among a variety of colorful 2D backgrounds, Patapon unfolds through more than 30 missions with more than 20 different environments, where players are tasked with outfitting the Patapon army, collecting resources, and using strategy to grow the tribe into a devastating fighting force.Set among a variety of colorful 2D backgrounds, Patapon unfolds through more than 30 missions with more than 20 different environments, where players are tasked with outfitting the Patapon army, collecting resources, and using strategy to grow the tribe into a devastating fighting force. Incorporating various button-timed drumbeats in real-time to control the Patapons, players will strategically traverse through each environment, battling enemies each step of the way. The game presents a variety of warrior types such as archers, infantry, cavalry, and more that players can unlock, along with a wide selection of more than 100 weapon and shield upgrades, allowing players to customize their forces throughout the funky adventure.… Expand"}, {"name": "SIMULACRA", "details_link": "https://www.metacritic.com/game/xbox-one/simulacra", "publisher": "Wales Interactive", "release_date": "Dec  3 2019", "developers": ["Kaigan Games OU"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/b456270bc91f1c2d83aa03fd8d7ec0ce-98.jpg", "descriptions": "An interactive FMV horror experience of exploring a missing woman’s phone. You found the lost phone of a woman named Anna. In it, you see a desperate cry for help in the form of a video message. You talk to her friends and they have no idea where she is. Her texts, emails and photo galleryAn interactive FMV horror experience of exploring a missing woman’s phone. You found the lost phone of a woman named Anna. In it, you see a desperate cry for help in the form of a video message. You talk to her friends and they have no idea where she is. Her texts, emails and photo gallery provides fragments of information and it’s up to you to piece it together.… Expand"}, {"name": "Stranger Things 3: The Game", "details_link": "https://www.metacritic.com/game/xbox-one/stranger-things-3-the-game", "publisher": "Netflix", "release_date": "Jul  4 2019", "developers": ["BonusXP"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/71641561a6766507e37f112fefcbe8c0-98.jpg", "descriptions": "Developed and published by BonusXP in collaboration with Netflix, Stranger Things 3: The Game is the official companion game to Season 3 of the hit original series. This adventure game blends a distinctively retro 16-bit art style with modern gameplay mechanics to deliver nostalgic fun withDeveloped and published by BonusXP in collaboration with Netflix, Stranger Things 3: The Game is the official companion game to Season 3 of the hit original series. This adventure game blends a distinctively retro 16-bit art style with modern gameplay mechanics to deliver nostalgic fun with a fresh new twist. Fans will be able to experience their favorite show through a mix of exploration, puzzles, and combat.Just like in the show, teamwork is at the heart Stranger Things 3: The Game. Fans can team up in two player local co-op or in single player mode alongside an AI partner, in the role of one of twelve characters from the show, each with unique abilities and attributes. Together, they'll play through familiar events from the series while also uncovering never-before-seen Stranger Things secrets, ensuring a fun experience for those new to the world of Stranger Things and series super fans alike!Key Features:* Experience the show in a new way, exploring the eerie world of Hawkins to uncover new mysteries beyond what's seen in Season 3.* Jump right into the action of this pick-up-and-play adventure: simple gameplay mechanics allow fans of all skill levels to get in on the fun.* Take your game to the next level by trying out different character combinations and collecting all the secrets the expansive world of Hawkins has to offer.* Team up with a friend, leveraging drop-in/drop-out local co-op to take on the mysterious monsters of Hawkins together. While playing solo, use a collection of \"buddy commands\" to control both characters and still experience all the fun.* Choose from 12 playable characters, each with their own unique talents and stats.… Expand"}, {"name": "Dungeon Siege III", "details_link": "https://www.metacritic.com/game/pc/dungeon-siege-iii", "publisher": "Square Enix", "release_date": "Jun 20 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG", "General", "Action RPG"], "meta_score": 72, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/300597db605b886c382abe2f79c5428d-98.jpg", "descriptions": "DUNGEON SIEGE 3 seamlessly blends intuitive action gameplay, a robust RPG system featuring a large selection of abilities, an extensive multiplayer component and the depth of story Square Enix and Obsidian Entertainment are known for creating."}, {"name": "Rocket Knight", "details_link": "https://www.metacritic.com/game/xbox-360/rocket-knight", "publisher": "Konami", "release_date": "May 12 2010", "developers": ["Climax Group", "Climax Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/1386bdffa75522601334775a41d80c6d-98.jpg", "descriptions": "[Xbox Live Arcade]  Sparkster makes his triumphant arrival on next-gen consoles with Rocket Knight, the newest entry in the beloved 2-D side-scrolling rocket action series. Our favorite opossum hero returns home after 15 years to find the kingdom of Zephyrus in shambles. Use your wits and[Xbox Live Arcade]  Sparkster makes his triumphant arrival on next-gen consoles with Rocket Knight, the newest entry in the beloved 2-D side-scrolling rocket action series. Our favorite opossum hero returns home after 15 years to find the kingdom of Zephyrus in shambles. Use your wits and Sparkster's trusty rocket pack to dodge and defeat a menacing wolf army threatening the lives of the people.… Expand"}, {"name": "FORCED", "details_link": "https://www.metacritic.com/game/pc/forced", "publisher": "BetaDwarf", "release_date": "Oct 24 2013", "developers": ["BetaDwarf"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/b053c9ac1f6fc366fe44ed8ead43390c-98.jpg", "descriptions": "Forced is a 1-4-player co-op arcade action RPG with puzzle and tactical elements. You are cast as slaves in the toughest fantasy gladiator school of them all, condemned to fight as a gladiator and eventually win your freedom."}, {"name": "Test Drive Unlimited 2", "details_link": "https://www.metacritic.com/game/pc/test-drive-unlimited-2", "publisher": "Atari", "release_date": "Feb  8 2011", "developers": ["Eden Studios", "Eden"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "General", "General", "Automobile"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/c1ff840b98a65561bdc3b510c82c272d-98.jpg", "descriptions": "Test Drive Unlimited 2 expands on the traditional racing experience providing gamers with M.O.O.R.: Massively Open Online Racing; immersing drivers in a persistent online environment and revolutionizing multiplayer racing communities as players compete, team up, and share their achievementsTest Drive Unlimited 2 expands on the traditional racing experience providing gamers with M.O.O.R.: Massively Open Online Racing; immersing drivers in a persistent online environment and revolutionizing multiplayer racing communities as players compete, team up, and share their achievements and creations online.  Unlike any other driving game, TDU2 blends the open world experience with realistic vehicles and performance dynamics and for the first time, TDU2 features vehicle damage, weather effects, day and night cycles, and a brand new island to explore.… Expand"}, {"name": "Hamtaro: Ham Ham Heartbreak", "details_link": "https://www.metacritic.com/game/game-boy-advance/hamtaro-ham-ham-heartbreak", "publisher": "Nintendo", "release_date": "Apr  8 2003", "developers": ["Pax Softonica"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 72, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "All the hamsters are bickering, and there's little wonder why! Spat, a meddling troublemaker, is telling fibs and causing heartache everywhere. It's up to Hamtaro and best-girl Bijou to follow Spat, stop the squabbling, and get everyone back on talking terms again."}, {"name": "Dynasty Warriors 3: Xtreme Legends", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-3-xtreme-legends", "publisher": "Koei", "release_date": "Jan 11 2003", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/c5bbb293ca2e0ee284b647dc5eb1f22f-98.jpg", "descriptions": "Play as 7 fierce generals in Musou mode- Lu Bu, Diao Chan, Meng Huo, Zhu Rong, Zhang Jiao, Dong Zhuo and Yuan Shao. Completely revamped stages with new scenarios and events."}, {"name": "Robotech: Battlecry", "details_link": "https://www.metacritic.com/game/playstation-2/robotech-battlecry", "publisher": "TDK Mediactive", "release_date": "Sep 25 2002", "developers": ["Vicious Cycle"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/055aa5778814580038589ec4410fa19b-98.jpg", "descriptions": "Control a Veritech fighter, switching from ground to hover to flight mode instantly, as you battle in the ultimate combat experience! It's a desperate struggle to save the earth in over 40+ missions with 40 Veritech fighters on land, air and outer space. Take the role of intrepid fighterControl a Veritech fighter, switching from ground to hover to flight mode instantly, as you battle in the ultimate combat experience! It's a desperate struggle to save the earth in over 40+ missions with 40 Veritech fighters on land, air and outer space. Take the role of intrepid fighter pilot Jack Archer, who must put his skills to the test in the ultimate battle against the forces of the alien Zentraedi. Sit at the controls of a Veritech fighter, a unique mecha capable of ground-based fighting in robot form. Or have the option to instantaneously change into a fast attack fighter for aerial dog fighting plus the hybrid Guardian mode that blends some of the strengths and weaknesses of the other two modes. The fast-paced gameplay and freedom of movement, combined with the well known space opera, makes Robotech: BattleCry impossible to put down! [TDK Mediactive]… Expand"}, {"name": "Ballistic: Ecks vs. Sever II", "details_link": "https://www.metacritic.com/game/game-boy-advance/ballistic-ecks-vs-sever-ii", "publisher": "Bam Entertainment", "release_date": "Sep 14 2002", "developers": ["Crawfish Interactive"], "platforms": "Game Boy Advance", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/1dcf97b8d14a0bb3f9da275792fa268a-98.jpg", "descriptions": "Ex-FBI agent Ecks and Ex-NSA operative Sever are back in another actio nfilled game. Freedom has been compromised and Ecks and Sever are pitted against each other as pawns in the underground trade of nuclear weapons. With little time to save the world from nuclear holocaust, every mission isEx-FBI agent Ecks and Ex-NSA operative Sever are back in another actio nfilled game. Freedom has been compromised and Ecks and Sever are pitted against each other as pawns in the underground trade of nuclear weapons. With little time to save the world from nuclear holocaust, every mission is the most important. Have you got what it takes?… Expand"}, {"name": "Outlaw Golf", "details_link": "https://www.metacritic.com/game/xbox/outlaw-golf", "publisher": "Simon & Schuster", "release_date": "Jun 10 2002", "developers": ["Simon & Schuster"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/1d5f89117bd2b3699247793ee484b2c1-98.jpg", "descriptions": "Golf meets strippers, ex-cons, and wannabe rappers. In Outlaw Golf, you can step into the shoes of all kinds of criminals and compete in 30 tour events. With each event, you'll unlock new characters and better equipment and improve your character's skills. Challenge three of your friends inGolf meets strippers, ex-cons, and wannabe rappers. In Outlaw Golf, you can step into the shoes of all kinds of criminals and compete in 30 tour events. With each event, you'll unlock new characters and better equipment and improve your character's skills. Challenge three of your friends in eight different games, including stroke, match, skins, best ball, casino, and more. Play like a pro and the game gets easier; play poorly and the game becomes tougher. … Expand"}, {"name": "Space Hulk Ascension", "details_link": "https://www.metacritic.com/game/pc/space-hulk-ascension", "publisher": "Full Control ApS", "release_date": "Nov 12 2014", "developers": ["Full Control ApS", "Full Control"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Sci-Fi", "General", "Tactics"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/70dba81408d20efc62500e047d31aad2-98.jpg", "descriptions": "Space Hulk: Ascension Edition is a 3D, digital, turn based, strategy game, which builds upon the classic board game experience, and adds new RPG style mechanics, additional weapons, enemy types, an all-new chapter and loads of other new features. Set in the isolated corridors and tomb-likeSpace Hulk: Ascension Edition is a 3D, digital, turn based, strategy game, which builds upon the classic board game experience, and adds new RPG style mechanics, additional weapons, enemy types, an all-new chapter and loads of other new features. Set in the isolated corridors and tomb-like chambers of ancient vessels lost in the graveyard of space, players lead a small force of fearless Space Marine Terminators in a ferocious fight for survival against hordes of predatory, alien Genestealers.… Expand"}, {"name": "Crazy Machines 2", "details_link": "https://www.metacritic.com/game/pc/crazy-machines-2", "publisher": "Viva Media", "release_date": "Jun 20 2008", "developers": ["FAKT Software"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Logic", "General"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/0bd83c8ca212c34131d966ae69247d0b-98.jpg", "descriptions": "Create your own daring experiments with Crazy Machines II! How will a toaster handle two whoopie cushions? How to watch TV with a steam engine? Build up insane chain reactions and pray that everything works or explodes with a big bang. Extreme detailed and living 3D graphics with new effectsCreate your own daring experiments with Crazy Machines II! How will a toaster handle two whoopie cushions? How to watch TV with a steam engine? Build up insane chain reactions and pray that everything works or explodes with a big bang. Extreme detailed and living 3D graphics with new effects like heat haze, motion blur and much more. Completely new game elements, e.g. laser and lightning generators. Revised common game elements with a lot more possibilities. A new game physics model with destroyable and deformable objects. Ageia PhysX hardware support. Online option for exchanging labs and downloading new game content.… Expand"}, {"name": "Hot Wheels Unleashed", "details_link": "https://www.metacritic.com/game/xbox-series-x/hot-wheels-unleashed", "publisher": "Milestone S.r.l", "release_date": "Sep 27 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/f6fb1246510007c8251a25e551b6202d-98.jpg", "descriptions": "Drive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe isDrive the cars of your dreams! The coolest, the fastest, the most unique badass vans and jaw-dropping muscle cars are waiting for you. Take the wheel of tons of vehicles with their own personality and style, different traits, and levels of rarity. The very best of the hot wheels universe is here! Prove you're the best and unlock Premium cars and extraordinary items and with the livery editor make your ride a one-of-a-kind masterpiece of speed. Race like everyone's watching! Get ready for pure fun and show off your driving skills! Drift like a pro, charge your boost and blast through the loops to beat time, rivals and gravity itself! Are you up for a challenge? Boom, jackpot: race side by side a friend in the 2-player local split-screen mode or face up to 12 players online in a worldwide event. The harder the challenge, the more glorious the triumph! Unleash your creativity! Massive, themed playgrounds are ready to host the most immersive races. Have fun on and off the track with these beautifully detailed and interactive environments, where any object can play a role and be an actual part of your circuit! You can even build a racetrack inside your very own room, a space to customize with furniture and the items you will collect during your journey. And thanks to the incredibly powerful editor, building the craziest tracks has never been easier! Bend and stretch the iconic Orange track piece to create your unique design and then add special Boosters, loops, obstacles, and exclusive interactive elements to build your own racing paradise. Share your creations with the world Or enjoy tracks made by other crazy players like you. Now it's time to unleash the fun! … Expand"}, {"name": "Greak: Memories of Azur", "details_link": "https://www.metacritic.com/game/pc/greak-memories-of-azur", "publisher": "Team17", "release_date": "Aug 17 2021", "developers": ["Bromio", "Navegante Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/d68b6a72a2599d316739b01c94765ee8-98.jpg", "descriptions": "Greak: Memories of Azur is a side scrolling single-player game with hand-drawn animations. You will take the role of three siblings: Greak, Adara and Raydel to guide them through the lands of Azur. Alternate control between them and use their unique abilities to escape from the Urlag invasion."}, {"name": "Homesick", "details_link": "https://www.metacritic.com/game/pc/homesick", "publisher": "Lucky Pause", "release_date": "May 28 2015", "developers": ["Lucky Pause"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/e5e66edc2bd66f4ee628713178da94c6-98.jpg", "descriptions": "Explore an abandoned building, encountering puzzles and clues to discover what happened, as you try to escape in both your nightmares and the waking world. Be immersed in the 3D atmosphere in this puzzle exploration mystery game."}, {"name": "Tetris Party Deluxe", "details_link": "https://www.metacritic.com/game/wii/tetris-party-deluxe", "publisher": "Majesco Games", "release_date": "May 25 2010", "developers": ["Tetris Online", "Inc"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 72, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/32ce41af3ee5595429f879036a6b767b-98.jpg", "descriptions": "Six new game modes: Bombliss - Clear lines using bombs for explosive line clearing chain reactions; Sprint  - Clear 40 lines in the shortest amount of time; VS Sprint - Compete against 3 other players (locally) in Sprint. The first player to clear 40 lines wins; Master - Set to maximumSix new game modes: Bombliss - Clear lines using bombs for explosive line clearing chain reactions; Sprint  - Clear 40 lines in the shortest amount of time; VS Sprint - Compete against 3 other players (locally) in Sprint. The first player to clear 40 lines wins; Master - Set to maximum difficulty/speed for extreme Tetris players; Co-op VS Co-op - You and another person play cooperatively against a second team in an extra-wide Matrix; Clear Sprint - Clear 20 Perfect Clears in the shortest amount of time. [Majesco]… Expand"}, {"name": "Banjo-Kazooie: Grunty's Revenge", "details_link": "https://www.metacritic.com/game/game-boy-advance/banjo-kazooie-gruntys-revenge", "publisher": "THQ", "release_date": "Sep 10 2003", "developers": ["Rare Ltd."], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/a6402dee7154d30f873411d7ec3e2578-98.jpg", "descriptions": "Gruntilda is back, and it's up to Banjo and Kazooie to stop her master plan. In Banjo-Kazooie: Grunty's Revenge, you'll play as Banjo and follow him through six worlds rife with trials and contests. Some of the challenges you must overcome include solving puzzles, avoiding obstacles, andGruntilda is back, and it's up to Banjo and Kazooie to stop her master plan. In Banjo-Kazooie: Grunty's Revenge, you'll play as Banjo and follow him through six worlds rife with trials and contests. Some of the challenges you must overcome include solving puzzles, avoiding obstacles, and battling different enemies. Defeat your foes by using Banjo's array of combat moves. You can also seek help from witch doctors, who can transform Banjo into a mouse, a tank, and other creatures. … Expand"}, {"name": "Mario & Sonic at the Olympic Winter Games", "details_link": "https://www.metacritic.com/game/wii/mario-sonic-at-the-olympic-winter-games", "publisher": "Sega", "release_date": "Oct 13 2009", "developers": ["Sega", "Sega Sports R&D"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/fbbfa9208e649f1f89eec02d966251a8-98.jpg", "descriptions": "Mario & Sonic at the Olympic Winter Games takes players to Vancouver, Canada, host city of the official 2010 Olympic Winter Games. This gaming experience invites players of all ages and skill sets to face-off in some of the most intense winter competitions available for the NintendoMario & Sonic at the Olympic Winter Games takes players to Vancouver, Canada, host city of the official 2010 Olympic Winter Games. This gaming experience invites players of all ages and skill sets to face-off in some of the most intense winter competitions available for the Nintendo platforms. Developed by SEGA of Japan, under the guidance of Shigeru Miyamoto, Mario & Sonic at the Olympic Winter Games takes players to lifelike Olympic venues where they can choose from a legendary cast of playable characters, including new faces to the series. This fresh gaming experience features completely new Olympic Winter Games events from the official competition schedule including Alpine Skiing and Speed Skating. Tailored to the specific system controls, Nintendo DS and Wii gamers enjoy completely unique experiences thanks to each platform having its own specific gameplay features and modes. Players of all skill levels enjoy the intuitive controls of both the Wii and Nintendo DS systems, in both single and multiplayer gaming modes. The Wii game offers an even richer multiplayer experience offering co-op and competitive gameplay where the Nintendo DS brings an intense competitive element using the Nintendo DS wireless capabilities. Additionally, one of the new features to be found in Mario & Sonic at the Olympic Winter Games is the inclusion of the Wii Balance Board which can be used in some events featured in the Wii version, allowing for a more interactive and realistic gaming experience. [Sega]… Expand"}, {"name": "Dream Daddy: A Dad Dating Simulator", "details_link": "https://www.metacritic.com/game/pc/dream-daddy-a-dad-dating-simulator", "publisher": "Game Grumps", "release_date": "Jul 20 2017", "developers": ["Game Grumps"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/80d88f4abf9f3c4d8b425c475e83fb68-98.jpg", "descriptions": "Dream Daddy: A Dad Dating Simulator is a game where you play as a Dad and your goal is to meet and romance other hot Dads. Are you ready? Hi ready, I'm Dad."}, {"name": "Sky Racket", "details_link": "https://www.metacritic.com/game/switch/sky-racket", "publisher": "Double Dash Studios", "release_date": "Mar 17 2020", "developers": ["Double Dash Studios"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/4a9d12155fd425a0b1d6f8cd7070716d-98.jpg", "descriptions": "Sky Racket is the world’s first Shmup Breaker, mixing the classic genres of shoot ’em ups and block breakers. Blast bullets back at baddies while flying over whimsical worlds filled with vivid, kooky colors! Grab your laser tennis racket, a stylish scarf and your best buddies to battle aSky Racket is the world’s first Shmup Breaker, mixing the classic genres of shoot ’em ups and block breakers. Blast bullets back at baddies while flying over whimsical worlds filled with vivid, kooky colors! Grab your laser tennis racket, a stylish scarf and your best buddies to battle a horde of fluffy enemies trying to blow you up back to the ground.\r Play as RacketBoy or RacketGirl, guardians chosen by the Capybara Goddess to save your galaxy from the paws of a destructive tyrant genius, Korrg! Unable to attack by yourself, you must strike enemies’ attacks back at them, turning the battlefield into an explosive space tennis battle. Rain tennis-devastation down on hordes of ducks, cat-sandwiches, fluffy bunnies, space-tennis-robots and actual BANANAS in this unique and totally realistic adventure to save the galaxy!… Expand"}, {"name": "Shiftlings: Enhanced Edition", "details_link": "https://www.metacritic.com/game/switch/shiftlings-enhanced-edition", "publisher": "Rock Pocket Games", "release_date": "Feb  1 2018", "developers": ["Rock Pocket Games"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/8b251a5159b905fa9d1278122259253a-98.jpg", "descriptions": "Rock Pocket Games' Shiftlings, a platform puzzler, which can be played both alone or with a friend, revolves around two Alien Twins who are attached to each other through a cable. In single player mode the player can switch the controls between the two aliens on top of switching the size ofRock Pocket Games' Shiftlings, a platform puzzler, which can be played both alone or with a friend, revolves around two Alien Twins who are attached to each other through a cable. In single player mode the player can switch the controls between the two aliens on top of switching the size of the two, while in co-op mode, each player controls one of the two twins. Switching size between the two characters is an important part of getting through the tricky puzzles. The smaller size enables higher jumps while the bigger Twin can't jump but instead is able to push boxes and can be used as a trampoline by the smaller counterpart. The Cable, that connects to two Twins, provides both challenges but also solutions to get the two through the puzzles and to the end goal of each level.… Expand"}, {"name": "Batman: The Telltale Series", "details_link": "https://www.metacritic.com/game/switch/batman-the-telltale-series", "publisher": "Telltale Games", "release_date": "Nov 14 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/2d899a3efb42e0153ebe0fd427ebd4c7-98.jpg", "descriptions": "Enter the fractured pysche of Bruce Wayne in this dark and violent new story from the award-winning creators of The Walking Dead - A Telltale Games Series. Batman - The Telltale Series comes to retail as a Season Pass Disc, which includes Episode One, and grants access to the remaining fourEnter the fractured pysche of Bruce Wayne in this dark and violent new story from the award-winning creators of The Walking Dead - A Telltale Games Series. Batman - The Telltale Series comes to retail as a Season Pass Disc, which includes Episode One, and grants access to the remaining four episodes in the season as they become available to download. The Season Pass Disc will give you access to a total of 5 episodes as they become available.… Expand"}, {"name": "Anima: Gate of Memories", "details_link": "https://www.metacritic.com/game/xbox-one/anima-gate-of-memories", "publisher": "Badland Games", "release_date": "Jun  3 2016", "developers": ["Anima Project"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/e9ca1e4b1e2112e3dc2d008d07454edd-98.jpg", "descriptions": "Anima Gate of Memories is a third person action RPG in which the player will explore a vast world filled with dangers and wonders. In it you take control of two characters who are trap in a war in the shadows, a secret conflict that will engulf the world into chaos."}, {"name": "The Sims 4: Get Together", "details_link": "https://www.metacritic.com/game/pc/the-sims-4-get-together", "publisher": "Electronic Arts", "release_date": "Dec  8 2015", "developers": ["Maxis"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/aadef9a510517883865d136b110c8c55-98.jpg", "descriptions": "The Sims 4 Get Together introduces Windenburg, a European-inspired World with a mix of vibrant, modern architecture and classic buildings and styles. From the charming countryside, to the bustling town square and luxurious island, Windenburg is filled with new things for your Sims to see andThe Sims 4 Get Together introduces Windenburg, a European-inspired World with a mix of vibrant, modern architecture and classic buildings and styles. From the charming countryside, to the bustling town square and luxurious island, Windenburg is filled with new things for your Sims to see and do. But you’re not going to be exploring these new sights alone. As the name suggests, Get Together is all about your Sim having fun with their friends, whether they’re leading their own exclusive Clubs or exploring Windenburg. Your Sims will be able to join different Clubs, each with their own interests, personalities, and styles. They have defined behaviors that dictate how they tend to act, including how they treat other Sims, and what they do or don't like to do. There will be a variety of Clubs waiting for your Sims when you first load up the expansion pack, but you’re also able to create and customize your own. You can set their requirements, decide what behaviors they have, choose their preferred hang outs, and even give them distinct rewards. [TheSims.com]… Expand"}, {"name": "Human Resource Machine", "details_link": "https://www.metacritic.com/game/wii-u/human-resource-machine", "publisher": "Tomorrow Corporation", "release_date": "Oct 29 2015", "developers": ["Tomorrow Corporation"], "platforms": ["iPhone/iPad", "PC", "Switch", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/c22c52efea365867b172b1d988cc2477-98.jpg", "descriptions": "The machines are coming... for your job.\r Program little office workers to solve puzzles. Be a good employee! The machines are coming... for your job.\r\n\r\nHuman Resource Machine is a puzzle game for nerds. In each level, your boss gives you a job. Automate it by programming your littleThe machines are coming... for your job.\r Program little office workers to solve puzzles. Be a good employee! The machines are coming... for your job.\r Human Resource Machine is a puzzle game for nerds. In each level, your boss gives you a job. Automate it by programming your little office worker. If you succeed, you'll be promoted up to the next level for another year of work in the vast office building. Congratulations!\r Don't worry if you've never programmed before - programming is just puzzle solving. If you strip away all the 1's and 0's and scary squiggly brackets, programming is simple, logical, beautiful, and something that anyone can understand and have fun with! Are you already an expert? There will be extra challenges for you.\r From the designer of World of Goo and the team behind Little Inferno. Have fun! Management is watching.… Expand"}, {"name": "Fate/Unlimited Codes", "details_link": "https://www.metacritic.com/game/psp/fateunlimited-codes", "publisher": "Capcom", "release_date": "Sep  3 2009", "developers": ["Eighting"], "platforms": "PSP", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/380f0df9cd6cd87270002ad055963caf-98.jpg", "descriptions": "[Playstation Network]  Fate/Unlimited Codes is a 3D fighting game based on the visual novel Fate/stay night."}, {"name": "Destiny: Rise of Iron", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-rise-of-iron", "publisher": "Activision", "release_date": "Sep 20 2016", "developers": ["Bungie"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 72, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/1/958b83a88ff4c612c4e2065586865a1e-98.jpg", "descriptions": "Destiny: Rise of Iron is the next expansion to the Destiny universe. It features an all new cinematic story campaign set within The Plaguelands, a brand new location on Earth. Under the command of Lord Saladin you will face a new faction of Fallen Devils, the Splicers, while unravelling theDestiny: Rise of Iron is the next expansion to the Destiny universe. It features an all new cinematic story campaign set within The Plaguelands, a brand new location on Earth. Under the command of Lord Saladin you will face a new faction of Fallen Devils, the Splicers, while unravelling the mystery of the Iron Lords. Rise of Iron features new weapons, armor, and gear, as well as a new cooperative three-player Strike, a new mode and maps for the Crucible competitive multiplayer, and an all new six-player cooperative Raid. [Activision]… Expand"}, {"name": "Blood Bowl 2", "details_link": "https://www.metacritic.com/game/playstation-4/blood-bowl-2", "publisher": "Focus Home Interactive", "release_date": "Sep 22 2015", "developers": ["Cyanide"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "General", "Team", "Football", "Arcade"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/d2cb244134524370cb016bff8124ac01-98.jpg", "descriptions": "Blood Bowl II mashes Warhammer and football together, in an explosive cocktail of turn-based strategy, humor and brutality, adapted from Games Workshop’s board game."}, {"name": "Guitar Hero: Warriors of Rock", "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-warriors-of-rock", "publisher": "Activision", "release_date": "Sep 28 2010", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music", "Music"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/32db07208b9e3f49fa74010aeb1ebd09-98.jpg", "descriptions": "KISS frontman Gene Simmons provides the voice for the next installment in Activision's long-running rhythm-game series."}, {"name": "Hextech Mayhem: A League of Legends Story", "details_link": "https://www.metacritic.com/game/pc/hextech-mayhem-a-league-of-legends-story", "publisher": "Riot Games", "release_date": "Nov 16 2021", "developers": ["Choice Provisions"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/e499df993f50def4beed0cf7c87af4d7-98.jpg", "descriptions": "In this fast-paced rhythm runner, every action has an explosive reaction and no amount of mayhem is too much. Take on the role of yordle and Hexplosives expert Ziggs as you rampage through the neighborhoods of Piltover.Bomb, bounce, and bop to the beat of the music to avoid obstacles,In this fast-paced rhythm runner, every action has an explosive reaction and no amount of mayhem is too much. Take on the role of yordle and Hexplosives expert Ziggs as you rampage through the neighborhoods of Piltover.Bomb, bounce, and bop to the beat of the music to avoid obstacles, disarm enemies, and light fuses to achieve maximum chaos. Cause musical mayhem while outrunning no-fun-allowed Heimerdinger in your quest to build the greatest bomb the world has ever seen!Use the Freestyle Mayhem System to create spontaneous blasts and grab bonus points... all while dodging the fun police and showing them what they're really missing.Leave no fuse unlit in Hextech Mayhem: A League of Legends Story.… Expand"}, {"name": "Immortals Fenyx Rising: The Lost Gods", "details_link": "https://www.metacritic.com/game/pc/immortals-fenyx-rising-the-lost-gods", "publisher": "Ubisoft", "release_date": "Apr 22 2021", "developers": ["Ubisoft Quebec"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/5/465d354e60337fcf1935282520f46d05-98.jpg", "descriptions": "Unfolding entirely from an overhead, god’s-eye perspective, the adventure centers on Ash, a new mortal champion following a series of catastrophic disasters. Ash’s mission is to travel to a new land, the Pyrite Island, to find and reunite the gods who left Olympos in a huff after aUnfolding entirely from an overhead, god’s-eye perspective, the adventure centers on Ash, a new mortal champion following a series of catastrophic disasters. Ash’s mission is to travel to a new land, the Pyrite Island, to find and reunite the gods who left Olympos in a huff after a falling-out with Zeus. These “lost gods,” including Poseidon and Hades, will all need to be convinced to return to the Pantheon and restore balance to the world. Naturally, there are plenty of monsters standing between them and Ash, which players can dispatch using a new, brawler-inspired combat system.… Expand"}, {"name": "Double Kick Heroes", "details_link": "https://www.metacritic.com/game/xbox-one/double-kick-heroes", "publisher": "Plug In Digital", "release_date": "Aug 28 2020", "developers": ["Headbang Club"], "platforms": ["PC", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Shooter", "Shoot-'Em-Up", "Horizontal", "Action", "Rhythm", "Music"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/67198c0c599d1345a4640695de9cb73e-98.jpg", "descriptions": "Butcher loads of zombies in Rhythm with METAL! Survive the wasteland fighting an epic freakshow!\r Double Kick Heroes mixes a shoot'em up with a rhythm game!\r\n\r\nMerging face-melting heavy metal rhythm riffs, with a high-octane zombie crushing shoot 'em up, Double Kick Heroes is like no gameButcher loads of zombies in Rhythm with METAL! Survive the wasteland fighting an epic freakshow!\r Double Kick Heroes mixes a shoot'em up with a rhythm game!\r Merging face-melting heavy metal rhythm riffs, with a high-octane zombie crushing shoot 'em up, Double Kick Heroes is like no game you've ever seen before!\r You must survive on the highway to hell by killing monsters with your gundillac! Struggle through the 30 levels of total madness and escape from this nightmare! Only the power of Metal can save your band!… Expand"}, {"name": "Drawn to Life: The Next Chapter", "details_link": "https://www.metacritic.com/game/ds/drawn-to-life-the-next-chapter", "publisher": "THQ", "release_date": "Oct 27 2009", "developers": ["5TH Cell"], "platforms": "DS", "genres": ["Miscellaneous", "Action Adventure", "Puzzle", "Puzzle", "General", "Puzzle", "Sandbox", "General"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/346c34ee33193edfa33e39ced8bef5ae-98.jpg", "descriptions": "In Drawn to Life: The Next Chapter for Nintendo DS, players draw their own heroes, be it humans, animals or multi-limbed creatures, and embark on a brand new adventure aboard a Turtle Ship to defeat the evil Wilfre and restore color to the Raposa civilization. Players have the ability toIn Drawn to Life: The Next Chapter for Nintendo DS, players draw their own heroes, be it humans, animals or multi-limbed creatures, and embark on a brand new adventure aboard a Turtle Ship to defeat the evil Wilfre and restore color to the Raposa civilization. Players have the ability to morph their hero into a blob or a spider, adding more gameplay and allowing for players to play each level a variety of different ways. The game’s Action Drawing Tool gives each color special properties when drawing objects into the game to help solve puzzles and progression through the game. Along the way, they collect coins and color drops to unlock a variety of content, including challenges and quests, customization options and hero abilities. In addition, the game’s multi-player aspect allows players to trade heroes, weapons, items and accessories with friends. [THQ]… Expand"}, {"name": "Binary Domain", "details_link": "https://www.metacritic.com/game/playstation-3/binary-domain", "publisher": "Sega", "release_date": "Feb 28 2012", "developers": ["Sega", "Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Action Adventure", "Shooter", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Tactical", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/e188f905b1b8d5e388440c99c85454d7-98.jpg", "descriptions": "Binary Domain puts players in the middle of a fast-paced and intense battle for humanity in robot-invaded 2080 Tokyo. Fighting through the derelict lower levels of the city, players control an international peace-keeping squad that soon starts to question their surroundings and the choicesBinary Domain puts players in the middle of a fast-paced and intense battle for humanity in robot-invaded 2080 Tokyo. Fighting through the derelict lower levels of the city, players control an international peace-keeping squad that soon starts to question their surroundings and the choices they are making. Are the robots becoming more human, or are humans becoming more like machines?… Expand"}, {"name": "ECHO (2017)", "details_link": "https://www.metacritic.com/game/pc/echo-2017", "publisher": "Ultra Ultra", "release_date": "Sep 19 2017", "developers": ["Ultra Ultra"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/81f0f51806b8bdedb8e0913e4016043c-98.jpg", "descriptions": "After a century in stasis the girl En arrives at her destination: A Palace out of legend. Out here, using forgotten technologies, she hopes to bring back a life that shouldn’t have been lost. But nothing could prepare her for what she’ll face in the ancient halls below."}, {"name": "Halo 2", "details_link": "https://www.metacritic.com/game/pc/halo-2", "publisher": "Microsoft Game Studios", "release_date": "May 31 2007", "developers": ["Microsoft Game Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/1d646978a5fdb4b7c0c6441d6a2c2366-98.jpg", "descriptions": "The saga continues with Halo 2 the international award-winning sequel to the highly successful and critically acclaimed Halo: Combat Evolved. In this sequel, the battle comes to Earth, and Master Chief, a genetically enhanced super soldier, is the only thing standing between the relentlessThe saga continues with Halo 2 the international award-winning sequel to the highly successful and critically acclaimed Halo: Combat Evolved. In this sequel, the battle comes to Earth, and Master Chief, a genetically enhanced super soldier, is the only thing standing between the relentless alien Covenant and the destruction of all humankind. Exciting Single-Player Gameplay: Experience first hand the epic struggle between Master Chief and the Covenant armada. Brandish dual-wield weapons Covenant arms and pilot human and non-human vehicles and aircraft to battle intelligent AI alien enemies. Halo 2 for Windows Vista taps into the power of Live Anywhere, a service similar to Xbox Live, to deliver online matchmaking for PC gamers. The service enables Windows Vista gamers all over the globe to connect via their PCs and play on an innovative and competitive online forum. New Multiplayer Map Editor: The game also features the all-new new Map Editor, guaranteeing additional new, fan-generated content in the future. The Halo 2 community can now tap their endless creative potential to develop an unlimited number of user-created multiplayer levels. Complete Community Freedom: Halo 2 for Windows Vista offers gamers the freedom to host their own dedicated servers for maximum multiplayer action. [Microsoft]… Expand"}, {"name": "Deadly Creatures", "details_link": "https://www.metacritic.com/game/wii/deadly-creatures", "publisher": "THQ", "release_date": "Feb  9 2009", "developers": ["Rainbow Studios"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Linear", "3D", "3D"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/8c229c6eb65eb6464abb688158c4ab51-98.jpg", "descriptions": "Deadly Creatures is a 3rd person action thriller set amidst a desert world of venomous terror, built exclusively for the Nintendo Wii. Players control an armored Scorpion and a deadly Tarantula as they fight for survival against Gila monsters, lizards, black widows and many more terrifyingDeadly Creatures is a 3rd person action thriller set amidst a desert world of venomous terror, built exclusively for the Nintendo Wii. Players control an armored Scorpion and a deadly Tarantula as they fight for survival against Gila monsters, lizards, black widows and many more terrifying creatures. Featuring intuitive motion controls and a deep combo-based combat system, Deadly Creatures is a thrilling mix of brutal creature-crushing action and suspenseful exploration of vast 360 degree desert and man-made environments. Gamers explore this darkly compelling story through the eyes of two of the world’s most deadly creatures. [THQ]… Expand"}, {"name": "Jak and Daxter: The Lost Frontier", "details_link": "https://www.metacritic.com/game/playstation-2/jak-and-daxter-the-lost-frontier", "publisher": "SCEA", "release_date": "Nov  3 2009", "developers": ["High Impact Games"], "platforms": "PlayStation 2", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 72, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/9ac7186e803e3fbde923b822325a7b3b-98.jpg", "descriptions": "Hero Jak and his mischievous sidekick Daxter are back together and for the first time-ever they've joined forces on PSP. Get set for the latest addition to the smash-hit Jak and Daxter series, Jak and Daxter: The Lost Frontier from Sony Computer Entertainment Europe. Prepare for non-stopHero Jak and his mischievous sidekick Daxter are back together and for the first time-ever they've joined forces on PSP. Get set for the latest addition to the smash-hit Jak and Daxter series, Jak and Daxter: The Lost Frontier from Sony Computer Entertainment Europe. Prepare for non-stop action and adventure as the duo travel across mysterious lands and take to the sky on a mission to save their planet from destruction. Take this incredible adventure with you anywhere on your PSP, or play it at home with PlayStation 2. Picking up from where the original Jak and Daxter trilogy left off, Jak and furry friend Daxter team up with their friend Kiera on her quest to become a Sage and save their world from the threat of darkness. As the environment of their planet slowly dies, our two worldly heroes embark on a mission to protect their world from the threat of \"dark eco\". Beginning on foot, you'll run and jump across undiscovered lands, before taking flight in one of five different aircrafts. With cheeky Daxter and our serious Hero Jak together on the adventure, fun and laughter is never far away. Blast airborne enemies and battle sky pirates with your powerful Gunstaff - a brand-new weapon that can transform into other new weapons. [Sony]… Expand"}, {"name": "Blood Bowl", "details_link": "https://www.metacritic.com/game/pc/blood-bowl", "publisher": "SouthPeak Games", "release_date": "Jun 25 2009", "developers": ["Cyanide"], "platforms": ["iPhone/iPad", "Xbox 360", "PC"], "genres": ["Sports", "Alternative", "Team", "Individual", "Football", "Other", "Other", "Arcade"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/77359ffdbd34ccf39811048eb165dc6f-98.jpg", "descriptions": "A brutal team sport unfolding in a parallel fantasy world based on Warhammer and American football, Blood Bowl invites gamers to form a team of players from races including: Orcs, Elves, Humans, Dwarfs and many other fantasy creatures, and launch themselves into battle in the bloodiest ofA brutal team sport unfolding in a parallel fantasy world based on Warhammer and American football, Blood Bowl invites gamers to form a team of players from races including: Orcs, Elves, Humans, Dwarfs and many other fantasy creatures, and launch themselves into battle in the bloodiest of arenas. This strategy sports game combines a fine balance of tactics and bone crunching action! The game offers two game modes. The first, which is fully real time, offers spectacular gameplay with intense battles between blocking linemen and daring displays of agility of players leaping and dodging through opponents tackle zones, while powerful spells and dirty trick special plays are unleashed across the field. All this creates a highly charged atmosphere. Of course, since it is sometimes difficult to keep an eye on the entire field at once, the game's interface offers different tactical and strategic setups, while the AI is responsible for managing the players on the field. The second game mode, an actual turn-based game, is a treat for players of the original board game because it is an exact replica of Games Workshop's tabletop masterpiece. The original rules have been faithfully reproduced, and it contains all of the devices, strategies, play and rhythm of the original game. [Focus Home Interactive]… Expand"}, {"name": "Perimeter: Emperor's Testament", "details_link": "https://www.metacritic.com/game/pc/perimeter-emperors-testament", "publisher": "Paradox Interactive", "release_date": "Sep  4 2006", "developers": ["K-D Lab"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/6426aa76425a059386d54fb3da26e6cc-98.jpg", "descriptions": "Perimeter: Emperor's Testament is the first expansion for the terraforming real-time strategy game. The expansion features 25 new single-player missions, updated graphics, a new soundtrack, and three additional multiplayer maps."}, {"name": "DOFUS", "details_link": "https://www.metacritic.com/game/pc/dofus", "publisher": "Ankama Games", "release_date": "Sep  1 2005", "developers": ["Ankama Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/473f84a06c3444d4a9ccf682e6260d0b-98.jpg", "descriptions": "This unique online game, midway between heroic fantasy and cartoon, lead the players to take part to a fabulous adventure in the colorful, 2D designed Universe of Amakna. DOFUS is a Tactical MMORPG which means that players progress in a real time universe, but when they fight againstThis unique online game, midway between heroic fantasy and cartoon, lead the players to take part to a fabulous adventure in the colorful, 2D designed Universe of Amakna. DOFUS is a Tactical MMORPG which means that players progress in a real time universe, but when they fight against monsters or against other players, action is turn-based (with specific number of actions each turn). Thus, fights are breathtaking and each move is strategic. [Ankama Studio]… Expand"}, {"name": "Dark Devotion", "details_link": "https://www.metacritic.com/game/pc/dark-devotion", "publisher": "Hibernian Workshop", "release_date": "Apr 25 2019", "developers": ["Hibernian Workshop"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/c05fccfcf83ef9e0f075a6bf83153687-98.jpg", "descriptions": "Explore the secrets of a mysterious fallen temple and put your Templar faith to the test in Dark Devotion, where no sacrifice is too great in praise of your God."}, {"name": "FIFA World Cup: Germany 2006", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-world-cup-germany-2006", "publisher": "Electronic Arts", "release_date": "Apr 24 2006", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/047996a5fa097ba1e6dceb8477ef3f9f-98.jpg", "descriptions": "2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA2006 FIFA World Cup features 12 official stadiums used at 2006 FIFA World Cup Germany and stadiums from each qualifying region. Gamers can play as their favorite team from qualification right through to a virtual reproduction of the tournament in Germany. With enhanced player animations, EA SPORTS has emulated close to 100 of the world's superstars, capturing their playing styles and individual likenesses. In addition to enabling gamers to participate in the 2006 FIFA World Cup Germany by taking control of one of 127 national teams, the game features new compelling modes of play, including the groundbreaking Global Challenge that tests even the most hardcore soccer fan by recreating classic moments in FIFA World Cup history. Furthermore, the game supports up to eight-way multiplayer matches and features a plethora of in-game unlockable content such as legendary players and exclusive apparel. [Electronic Arts]… Expand"}, {"name": "LEGO Indiana Jones 2: The Adventure Continues", "details_link": "https://www.metacritic.com/game/wii/lego-indiana-jones-2-the-adventure-continues", "publisher": "LucasArts", "release_date": "Nov 17 2009", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 72, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/02c3d1123bee7191b1eec291bf563cb1-98.jpg", "descriptions": "LEGO Indiana Jones 2 presents a tongue-in-cheek take on all four cinematic adventures of pop culture’s most iconic archaeologist, including for the first time ever Indiana Jones and the Kingdom of the Crystal Skull and will give players the ability to create levels of their own! [LucasArts]"}, {"name": "Marvel's Guardians of the Galaxy - Episode 5: Don't Stop Believin'", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-guardians-of-the-galaxy---episode-5-dont-stop-believin", "publisher": "Telltale Games", "release_date": "Nov  7 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/7cb628ba7410d69a8fe606a028a51714-98.jpg", "descriptions": "In the aftermath of an unbearable sacrifice, the Guardians finally fracture. With her opposition in shambles, Hala renews her campaign of death and devastation, carving a path of indiscriminate destruction en route to Knowhere."}, {"name": "Semispheres", "details_link": "https://www.metacritic.com/game/playstation-4/semispheres", "publisher": "Vivid Helix", "release_date": "Feb 14 2017", "developers": ["Vivid Helix"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/98e37da5042616618e4db73f705913c8-98.jpg", "descriptions": "Semispheres is a meditative parallel puzzle game that places dual realities at the heart of its challenge. Its unique single-player split-screen mechanic challenges your brain by putting you in control of two characters at the same time."}, {"name": "Steep", "details_link": "https://www.metacritic.com/game/xbox-one/steep", "publisher": "Ubisoft", "release_date": "Dec  2 2016", "developers": ["Ubisoft Annecy"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Ski / Snowboard"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/923eb43fb816cc9b0af4a94a4aef811a-98.jpg", "descriptions": "In Steep, players can use the innovative trail feature to relive their most inspiring rides and trailblazing achievements, and share them on social networks with friends. Along with sharing ride replays, players can also use this feature to challenge friends to outrace them on a shared path,In Steep, players can use the innovative trail feature to relive their most inspiring rides and trailblazing achievements, and share them on social networks with friends. Along with sharing ride replays, players can also use this feature to challenge friends to outrace them on a shared path, create epic stunts or set out to discover the massive mountain playground.… Expand"}, {"name": "Disney Art Academy", "details_link": "https://www.metacritic.com/game/3ds/disney-art-academy", "publisher": "Nintendo", "release_date": "May 13 2016", "developers": ["Headstrong Games"], "platforms": "3DS", "genres": ["Miscellaneous", "Edutainment", "Application"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/5b11caa3cfaad646387619632a14796f-98.jpg", "descriptions": "Master the art of drawing beloved Disney and Pixar characters!\r Step-by-step lessons can teach anyone how to draw.\r\n\r\nAdd some magic to your art! The Magic Brush makes it easy to add patterns, such as sparkles or stars, to any work of art.\r\n\r\nGo from amateur to expert with over 80Master the art of drawing beloved Disney and Pixar characters!\r Step-by-step lessons can teach anyone how to draw.\r Add some magic to your art! The Magic Brush makes it easy to add patterns, such as sparkles or stars, to any work of art.\r Go from amateur to expert with over 80 characters to draw!… Expand"}, {"name": "50 Cent: Blood on the Sand", "details_link": "https://www.metacritic.com/game/playstation-3/50-cent-blood-on-the-sand", "publisher": "THQ", "release_date": "Feb 24 2009", "developers": ["Swordfish Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/d9a2ac0aee54291df977121ff4542b0f-98.jpg", "descriptions": "After performing a sold-out concert in a fictional war-torn country, 50 Cent and the G-Unit are robbed of their cash and paid in kind with a priceless diamond encrusted skull, which is subsequently stolen by the local crime-lord’s gang. Determined to collect his payment and enact revenge onAfter performing a sold-out concert in a fictional war-torn country, 50 Cent and the G-Unit are robbed of their cash and paid in kind with a priceless diamond encrusted skull, which is subsequently stolen by the local crime-lord’s gang. Determined to collect his payment and enact revenge on the gangsters foolish enough to disrespect him, 50 Cent sets out to get rich or die trying. 50 Cent: Blood on the Sand features intense third-person action/shooter gameplay, an intuitive cover system, drop in and drop out online multiplayer co-op, merciless melee counter-kills and a soundtrack that combines 50 Cent’s greatest hits with 18 exclusive new tracks. 50 Cent: Blood on the Sand puts players in control of their own virtual action film by blending visuals from the Unreal 3 game engine technology with an over-the-top story and voiceover work by 50 Cent and the G-Unit’s Tony Yayo, Lloyd Banks, and DJ Whoo Kid. [THQ]… Expand"}, {"name": "The Political Machine", "details_link": "https://www.metacritic.com/game/pc/the-political-machine", "publisher": "Ubisoft", "release_date": "Aug 12 2004", "developers": ["Stardock"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "General", "General"], "meta_score": 72, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/aae2e54f440d117e708fb85321757145-98.jpg", "descriptions": "The Political Machine is a new strategy game in which you are the campaign manager for a candidate for President of the United States. Choose a political party, put together the dream presidential ticket and go for it.  Based on the real world, The Political Machine gives would-be candidatesThe Political Machine is a new strategy game in which you are the campaign manager for a candidate for President of the United States. Choose a political party, put together the dream presidential ticket and go for it.  Based on the real world, The Political Machine gives would-be candidates the taste of the challenge real candidates face.  Fund raising, campaigning, building support, going on \"The O'Maley Factor\" and other cable news shows to answer the tough questions, and more. The Political Machine is both a single player game against the computer and multiplayer against other players on the Internet. Scores can be optionally recorded to the Metaverse here on PoliticalMachine.com.  The game is currently in internal alpha and will be released in May of 2004. The beta should be available in mid March. On the other hand, PoliticalMachine.com has been designed not just as place to download and use the game but as neutral ground for political junkies to discuss the issues of the day with other players from around the world. Create your own articles, hang out in the forum, and become part of this new political discussion community. [Stardock]… Expand"}, {"name": "Warriors Orochi 4", "details_link": "https://www.metacritic.com/game/playstation-4/warriors-orochi-4", "publisher": "Koei Tecmo Games", "release_date": "Oct 16 2018", "developers": ["Omega Force"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/7130f2c458d145472900941c03ea828a-98.jpg", "descriptions": "Pick from 170 characters: Heroes gather from the Samurai Warriors and Dynasty Warriors Universes. Assume the Power of the Gods: Enjoy brand new Musou action. Sacred treasures empowered by a miraculous power enable characters to evoke magic attacks. The infamous one versus thousands battlePick from 170 characters: Heroes gather from the Samurai Warriors and Dynasty Warriors Universes. Assume the Power of the Gods: Enjoy brand new Musou action. Sacred treasures empowered by a miraculous power enable characters to evoke magic attacks. The infamous one versus thousands battle action sees new additions.… Expand"}, {"name": "They Are Billions", "details_link": "https://www.metacritic.com/game/playstation-4/they-are-billions", "publisher": "BlitWorks", "release_date": "Jul  1 2019", "developers": ["Numantian Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 72, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/a2e084ed50f8a753d7499fad01f92f15-98.jpg", "descriptions": "They Are Billions is a Steampunk strategy game set on a post-apocalyptic planet. Build and defend colonies to survive against the billions of the infected that seek to annihilate the few remaining living humans. Can humanity survive after the zombie apocalypse?"}, {"name": "Major League Baseball 2K11", "details_link": "https://www.metacritic.com/game/playstation-3/major-league-baseball-2k11", "publisher": "2K Sports", "release_date": "Mar  8 2011", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 72, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/280b49d7b236dfa8b46e9e4f1eaa0d33-98.jpg", "descriptions": "Major League Baseball 2K11 is the next iteration in the 2K baseball series."}, {"name": "Oddworld: Stranger's Wrath HD", "details_link": "https://www.metacritic.com/game/switch/oddworld-strangers-wrath-hd", "publisher": "Oddworld Inhabitants", "release_date": "Jan 23 2020", "developers": ["Just Add Water", "Square One Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/c1b785c550c3c6dd1faa7c2506448b30-98.jpg", "descriptions": "Stranger vs. OutlawsStranger's Wrath follows the story of Stranger, a fearsome bounty hunter that captures outlaws to raise \"moolah\" for a mysterious surgical procedure. After encountering the backwater town of the Grubbs, Stranger discovers that there are a few too many secretsStranger vs. OutlawsStranger's Wrath follows the story of Stranger, a fearsome bounty hunter that captures outlaws to raise \"moolah\" for a mysterious surgical procedure. After encountering the backwater town of the Grubbs, Stranger discovers that there are a few too many secrets about the past and his future as a bounty hunter.… Expand"}, {"name": "Saints Row 2", "details_link": "https://www.metacritic.com/game/pc/saints-row-2", "publisher": "THQ", "release_date": "Jan  5 2009", "developers": ["Volition Inc."], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 12 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 72, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/4b9204139cf34a88e56c01b60b80c6fd-98.jpg", "descriptions": "Saints Row 2 is set years after the original Saints Row in a Stilwater both familiar and strange. The explosive conclusion to Saints Row has left the player wounded, betrayed and thirsty for revenge, and now it's time to take back the city that has forgotten him. A sequel to the firstSaints Row 2 is set years after the original Saints Row in a Stilwater both familiar and strange. The explosive conclusion to Saints Row has left the player wounded, betrayed and thirsty for revenge, and now it's time to take back the city that has forgotten him. A sequel to the first open-world title on next-generation consoles, Saints Row 2 features all new customization options, including gender, age, voice, crib and gang customization. The sandbox just got larger with a totally transformed and expanded city of Stilwater, offering all new locations to explore with new vehicles, including motorcycles, boats, helicopters and planes. Saints Row 2 is playable online in 2-player co-op through the entire single-player campaign or in the all new open-world competitive multiplayer mode never before seen in the genre. [THQ]… Expand"}, {"name": "Tiger Woods PGA Tour 08", "details_link": "https://www.metacritic.com/game/wii/tiger-woods-pga-tour-08", "publisher": "EA Sports", "release_date": "Aug 28 2007", "developers": ["EA Salt Lake"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/e22cd2131aaf796fb2900f64e8a76c42-98.jpg", "descriptions": "All-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. The Most Golf CoursesAll-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. The Most Golf Courses EverExperience the all-new FedExCup championship format by playing a dream round of golf at Westchester Country Club, TPC Boston, Cog Hill, and East Lake. Take On PGA And LPGA Tour ProsChallenge the greatest PGA Tour pros, including Tiger Woods, John Daly, and Vijay Singh, plus LPGA Tour pros such as Annika Sorenstam, Natalie Gulbis, Christie Kerr, and Morgan Pressel. [Electronic Arts]… Expand"}, {"name": "The Godfather", "details_link": "https://www.metacritic.com/game/pc/the-godfather", "publisher": "Electronic Arts", "release_date": "Mar 21 2006", "developers": ["Headgate"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/67cc240831aaf5a94fe6370eddab5976-98.jpg", "descriptions": "The book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mobThe book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mob character in the game, putting themselves into the action while reliving classic moments from the fiction and experiencing original missions alongside memorable characters from the film.  After a life of small-time jobs and petty thefts the player is accepted into the Corleone family, America's most famous criminal organization. It is up to the player to carry out orders, earn respect and make New York City their own. Featuring non-linear action-adventure gameplay, The Godfather offers gamers countless choices for solving the family’s problems with brutal violence, skillful diplomacy, or a cunning mixture of both. From mob hits and bank heists to drive-bys and extortion, step deep inside the world of The Godfather where intimidation and negotiation are your tickets to the top.  Players use their powers of loyalty and fear to earn respect through interactions with characters in the world.  Decisions made by the player in the game have lasting consequences, just as it was in the mob underworld featured in The Godfather fiction. James Caan, Robert Duvall, and the late Marlon Brando provided voice acting and likenesses for the game. [Electronic Arts]… Expand"}, {"name": "Endzone: A World Apart", "details_link": "https://www.metacritic.com/game/pc/endzone-a-world-apart", "publisher": "Assemble Entertainment", "release_date": "Mar 18 2021", "developers": ["Gentlymad"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/938849d89bf1037d6ca0820109e141cf-98.jpg", "descriptions": "In 2021, a group of terrorists blew up nuclear power plants around the world and plunged the world into chaos. Only few were able to escape into underground facilities called \"Endzones\". 150 years later, mankind returns to the surface - under your command! In an extremely hostile environmentIn 2021, a group of terrorists blew up nuclear power plants around the world and plunged the world into chaos. Only few were able to escape into underground facilities called \"Endzones\". 150 years later, mankind returns to the surface - under your command! In an extremely hostile environment full of radioactivity, contaminated rain and extreme climate change, you'll have to prove your worth as a leader.Endzone is a post-apocalyptic survival city builder, where you start a new civilization with a group of people after a global nuclear disaster. Build them a new home and ensure their survival in a shattered world, threatened by constant radiation, toxic rain, sandstorms and droughts.… Expand"}, {"name": "Candle: The Power of the Flame", "details_link": "https://www.metacritic.com/game/switch/candle-the-power-of-the-flame", "publisher": "Merge Games", "release_date": "Jul 26 2018", "developers": ["Teku Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/5aa47d2a8ccf401fc9f386700c24c11a-98.jpg", "descriptions": "Candle is a 2D sidescrolling adventure game that uses the powerful and indie-lover engine Unity 4. Its creators describe it as a \"dynamic graphic adventure\", since its gameplay combines both Platformer and Graphic Adventure genres. The player takes control of Teku, a young andCandle is a 2D sidescrolling adventure game that uses the powerful and indie-lover engine Unity 4. Its creators describe it as a \"dynamic graphic adventure\", since its gameplay combines both Platformer and Graphic Adventure genres. The player takes control of Teku, a young and inexperienced character in his journey to save his friends and unravel the mysteries of his world.… Expand"}, {"name": "The Count Lucanor", "details_link": "https://www.metacritic.com/game/switch/the-count-lucanor", "publisher": "Merge Games", "release_date": "Oct 19 2017", "developers": ["Baroque Decay"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/4c32db20e91697d182a5d0678b4f9954-98.jpg", "descriptions": "Join Hans in a fantasy world and experience a unique adventure, full of surprises and challenges. Get hooked on an immersive tale, where every decision counts and every clue is a piece to solve the puzzle and get the treasure. Unravel the sordid secrets of the castle, meet colorfulJoin Hans in a fantasy world and experience a unique adventure, full of surprises and challenges. Get hooked on an immersive tale, where every decision counts and every clue is a piece to solve the puzzle and get the treasure. Unravel the sordid secrets of the castle, meet colorful characters, and remember: horror always lurks beneath the surface.… Expand"}, {"name": "Disc Jam", "details_link": "https://www.metacritic.com/game/playstation-4/disc-jam", "publisher": "High Horse Entertainment", "release_date": "Mar  7 2017", "developers": ["High Horse Entertainment"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 72, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/287db32022d1a296457411b1d2290352-98.jpg", "descriptions": "Disc Jam is a multiplayer arcade sports title that pits 2-4 players against each other in a unique combination of air hockey and tennis. Players scramble to retrieve and throw a glowing disc while unleashing devastating abilities and defending variable-point end zones. [High Horse Entertainment]"}, {"name": "Serious Sam HD: The Second Encounter", "details_link": "https://www.metacritic.com/game/xbox-360/serious-sam-hd-the-second-encounter", "publisher": "Majesco Games", "release_date": "Sep 22 2010", "developers": ["Croteam"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/d7475008938af22ec4d955e92de53731-98.jpg", "descriptions": "The classic arcade FPS Serious Sam: The First Encounter is reborn in glorious high-definition for legions of long-time fans and a whole new generation of gamers around the world. Featuring dazzling visuals and revamped design, gamers take control of the legendary Sam ‘Serious’ Stone as he isThe classic arcade FPS Serious Sam: The First Encounter is reborn in glorious high-definition for legions of long-time fans and a whole new generation of gamers around the world. Featuring dazzling visuals and revamped design, gamers take control of the legendary Sam ‘Serious’ Stone as he is sent back through time to ancient Egypt to battle the overwhelming forces of Notorious Mental and the Sirian army.… Expand"}]