[{"name": "Kingdoms of Amalur: Reckoning", "details_link": "https://www.metacritic.com/game/playstation-3/kingdoms-of-amalur-reckoning", "publisher": "Electronic Arts", "release_date": "Feb  7 2012", "developers": ["Big Huge Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "Action RPG"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/c3ea9202718ee03c04b4f80bc5a8fa49-98.jpg", "descriptions": "Immerse yourself in an all-new massive universe from the minds of bestselling author R.A. Salvatore, Spawn creator Todd McFarlane, and Elder Scrolls IV: Oblivion lead designer Ken Rolston. Choose your path and battle through a sprawling world featuring intense, responsive, and customizableImmerse yourself in an all-new massive universe from the minds of bestselling author R.A. Salvatore, Spawn creator Todd McFarlane, and Elder Scrolls IV: Oblivion lead designer Ken Rolston. Choose your path and battle through a sprawling world featuring intense, responsive, and customizable RPG combat.… Expand"}, {"name": "Minit", "details_link": "https://www.metacritic.com/game/playstation-4/minit", "publisher": "Devolver Digital", "release_date": "Apr  3 2018", "developers": ["JW", "Kitty", "Jukio", "and Dom"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/2873e4ecde2e5cfefd51dc62e47c9c4b-98.jpg", "descriptions": "In Minit, you journey outside the comfort of your home to help unusual folk, uncover countless secrets, and overcome dangerous foes, all in hopes of lifting a rather unfortunate curse that ends each day after just one minute."}, {"name": "Madden NFL 13", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-13", "publisher": "EA Sports", "release_date": "Aug 28 2012", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 81, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/7ebd9b984e789966b14d8bb5f9594547-98.jpg", "descriptions": "Control the line of scrimmage using just your voice. Both on defense and offense, Kinect on Xbox 360 gives you full control over all your pre-snap adjustments, audibles, and personnel, immersing you into the NFL. Powered by the all-new Infinity Engine, true player impact and authenticControl the line of scrimmage using just your voice. Both on defense and offense, Kinect on Xbox 360 gives you full control over all your pre-snap adjustments, audibles, and personnel, immersing you into the NFL. Powered by the all-new Infinity Engine, true player impact and authentic momentum transfer ensure that no two plays ever look or feel the same. Connected Careers is a new and fully connected universe defined by deep gameplay, unique storylines and social integration.… Expand"}, {"name": "Jamestown: Legend of the Lost Colony", "details_link": "https://www.metacritic.com/game/pc/jamestown-legend-of-the-lost-colony", "publisher": "Final Form Games, LLC", "release_date": "Jun  8 2011", "developers": ["Final Form Games", "LLC"], "platforms": ["PlayStation 4", "Switch", "PC"], "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/f1a1f7e0bc555fabdca342593f4a1bbd-98.jpg", "descriptions": "Jamestown is a neo-classical top-down shooter for up to four players set on 17th-century British Colonial Mars."}, {"name": "Poker Smash", "details_link": "https://www.metacritic.com/game/xbox-360/poker-smash", "publisher": "Void Star Creations", "release_date": "Feb  6 2008", "developers": ["Void Star Creations"], "platforms": "Xbox 360", "num_players": "5  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/113dc62c49b59132c41d87f64649bba4-98.jpg", "descriptions": "[Xbox Live Arcade]  Poker Smash is an action-packed puzzle game with a poker twist. Poker Smash expands on the traditional match-three puzzle mechanic with elements of one of the world's most popular card games: poker. Make vertical and horizontal matches by forming poker hands, and play in[Xbox Live Arcade]  Poker Smash is an action-packed puzzle game with a poker twist. Poker Smash expands on the traditional match-three puzzle mechanic with elements of one of the world's most popular card games: poker. Make vertical and horizontal matches by forming poker hands, and play in seven different game modes, including multiplayer. Fast and fluid controls paired with radical features such as super-slow motion and card-blasting bombs make this game a whole new puzzle experience! Match-three gameplay with a twist. Create poker hands and form chains to rack up the big score. Seven game modes: Intense game modes include action, timed, puzzle levels (55 of them), practice, custom playlist, split screen head-to-head, and multiplayer tournaments. In addition to the traditional leaderboards, Poker Smash features never-before-seen rivalry tracking and even movie recording with shared playback. The next-gen 3-D graphics feature eleven different highly detailed environments and background themes, coupled with thirteen new original soundtracks for play. [Microsoft]… Expand"}, {"name": "Tales From The Borderlands: Episode 2 - Atlas Mugged", "details_link": "https://www.metacritic.com/game/playstation-4/tales-from-the-borderlands-episode-2---atlas-mugged", "publisher": "Telltale Games", "release_date": "Mar 17 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/9b2ded39ab3b984cd15892f10213218b-98.jpg", "descriptions": "Discovering the Gortys Project fuels a madcap race to definitively figure out what the Atlas Corporation was up to prior to Hyperion's take over of Pandora. Our heroes are not the only ones on the trail. Vault Hunters, Bounty Hunters, Vasquez, and a giant monster thing with a mouth thatDiscovering the Gortys Project fuels a madcap race to definitively figure out what the Atlas Corporation was up to prior to Hyperion's take over of Pandora. Our heroes are not the only ones on the trail. Vault Hunters, Bounty Hunters, Vasquez, and a giant monster thing with a mouth that looks like a...well, you'll see...are all in pursuit. And to further complicate matters, Rhys is being haunted by dreams of a dead despot AND what Vaughn looks like without his shirt on. Can Fiona and Sasha hold everything together? That's up to you. [Telltale]… Expand"}, {"name": "Call of Duty: Black Ops", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-black-ops", "publisher": "Activision", "release_date": "Nov  9 2010", "developers": ["Treyarch"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 81, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/49a90d2e9f90df8d9e0ea57a0ac96a9d-98.jpg", "descriptions": "Treyarch is developing the next installment in the Call of Duty franchise, rumored to be set during the Cold War."}, {"name": "Call of Duty: Modern Warfare", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-modern-warfare", "publisher": "Activision", "release_date": "Oct 25 2019", "developers": ["Infinity Ward"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 20 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/3/6732e16b4cb45b52629abac8730d3f78-98.jpg", "descriptions": "Prepare to go dark, Modern Warfare® is back! The stakes have never been higher as players take on the role of lethal Tier One operators in a heart-racing saga that will affect the global balance of power. Call of Duty®: Modern Warfare® engulfs fans in an incredibly raw, gritty, provocativePrepare to go dark, Modern Warfare® is back! The stakes have never been higher as players take on the role of lethal Tier One operators in a heart-racing saga that will affect the global balance of power. Call of Duty®: Modern Warfare® engulfs fans in an incredibly raw, gritty, provocative narrative that brings unrivaled intensity and shines a light on the changing nature of modern war. Developed by the studio that started it all, Infinity Ward delivers an epic reimagining of the iconic Modern Warfare® series from the ground up. In the visceral and dramatic single-player story campaign, Call of Duty®: Modern Warfare® pushes boundaries and breaks rules the way only Modern Warfare® can. Players will engage in breathtaking covert operations alongside a diverse cast of international special forces throughout iconic European cities and volatile expanses of the Middle East. And the story doesn't end there. In Call of Duty®: Modern Warfare®, players will be thrust into an immersive narrative spanning the entire game. Experience the ultimate online playground with classic multiplayer, or squad-up and play cooperatively in a collection of elite operations accessible to all skill levels.… Expand"}, {"name": "Like a Dragon: Ishin!", "details_link": "https://www.metacritic.com/game/playstation-5/like-a-dragon-ishin!", "publisher": "Sega", "release_date": "Feb 21 2023", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/8c6fc30c39200de38c2778b06f68ff20-98.jpg", "descriptions": "1860s Kyo is plagued by widespread inequality, and one samurai will change the course of history in his search for justice. Take up the sword of Sakamoto Ryoma and venture to Kyoto to find your father’s killer, clear yourself of a framed murder, and restore your honor. In doing so, you will1860s Kyo is plagued by widespread inequality, and one samurai will change the course of history in his search for justice. Take up the sword of Sakamoto Ryoma and venture to Kyoto to find your father’s killer, clear yourself of a framed murder, and restore your honor. In doing so, you will bring an end to the samurai era and forever change the future of Japan. Draw your blade, load your revolver, and join the revolution in this heated historical adventure that only the creators of Yakuza: Like a Dragon could produce. … Expand"}, {"name": "Castlevania Anniversary Collection", "details_link": "https://www.metacritic.com/game/switch/castlevania-anniversary-collection", "publisher": "Konami", "release_date": "May 16 2019", "developers": ["Konami", "M2"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/88e1a74c2cb462ed837027f71f11c7e5-98.jpg", "descriptions": "Classics that defined the Castlevania series.This KONAMI Castlevania Collection is designed to be a collection around the origins of the historic franchise.\nIncluded is a unique eBook that has details provided by developers, artists and other inspired by the Castlevania legacy.\nReleased asClassics that defined the Castlevania series.This KONAMI Castlevania Collection is designed to be a collection around the origins of the historic franchise.Included is a unique eBook that has details provided by developers, artists and other inspired by the Castlevania legacy.Released as part of the KONAMI 50th Anniversary celebration, now the best time to relive these timeless classics that helped define the platformer genre. Game List:Castlevania (1987/US, 1988/EU)Enter At Your Own Risk! If you think it's scary on the outside, wait till you see the basement.You're in for the longest night of your life. Ghosts, goblins, demons, wolves, bats creatures lurking around every corner. Better pick up a weapon or two, because when you finally meet the Count, you know he'll be going for the jugular. Castlevania Simon's Quest1988/US, 1990/EU) NESThis title tells the tale of Simon's subsequent adventures following the events in Castlevania.Unlike the previous installment, this one was developed as an action RPG. It maintains the action elements of its predecessor but mainly focuses on exploration and puzzle solving within a far more expansive game world. Castlevania Dracula's Curse (1990/US, 1992/EU) NESLed by the immortal Count Dracula, the greatest army of evil ever assembled is poised to bury mankind in a tomb of terror. Destroying His legions will be the supreme challenge for the mightiest warrior.100 years before Simon Belmont's birth, Dracula is young at heart and it will take more than a stake to penetrate his evil. Luckily, you command the role of Trevor - Simon's forefather and the original vampire slayer. Super Castlevania (1991/US, 1992/EU) SNESA century of Transylvanian tranquility is about to come to a shocking end. Once again the mortifying screams of helpless villagers shake the ground as they shrink from new horrors unleashed by the Duke of Darkness, Count Dracula. And this time he has a tombstone with your name on it, Simon Belmont. Castlevania The Adventure (1989/US, 1991/EU) GBThis is the first title in the series to be released on the Game Boy handheld game console.The variety of power-ups available for the whip added depth to the strategy of the gameplay. Castlevania Belmont's Revenge (1991/US, 1992/EU) GBFifteen years after vanquishing the evil Count Dracula, Christopher Belmont now faces a vampire swearing vengeance. Drac's back. And he's turned your son, Soleil Belmont, into a deadly demon to do his dirty deeds. To rescue him from the Count's clutches, you must first track him down through four creep packed castles. Castlevania Bloodlines (1994) GENUnlike the medieval setting of the other titles, this installment takes place during World War I. It introduces new elements to the series, such as the ability to choose one of two characters when starting the game.Huge bosses with dynamic, multi-jointed limbs that move erratically are just one of the many examples of the cutting-edge effects the game had for the time. Kid Dracula (1990/Japan exclusive) NESWith its laugh-inducing content and world full of gags, this spinoff is unlike anything else in the series. Players take control of Dracula's son (or so he says...), Kid Dracula, as he goes on a hilarious adventure filled with laughs that also satisfies as a full-fledged action game.… Expand"}, {"name": "Kohan II: Kings of War", "details_link": "https://www.metacritic.com/game/pc/kohan-ii-kings-of-war", "publisher": "Global Star Software", "release_date": "Sep 22 2004", "developers": ["TimeGate Studios"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy", "Command"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/7e8efc7f53af7071c6e3e5356c03780d-98.jpg", "descriptions": "Ages have passed since the Cataclysm and the complacency of time has set in. A shadow has once again fallen across the land. Rumors abound of strang creatures prowling the night. War comes ever more frequently and a deep-rooted unease holds the hearts of men in its grip. Brother has turnedAges have passed since the Cataclysm and the complacency of time has set in. A shadow has once again fallen across the land. Rumors abound of strang creatures prowling the night. War comes ever more frequently and a deep-rooted unease holds the hearts of men in its grip. Brother has turned against brother and the great Houses of Kohan have erupted into civil war. The Shadow is rising and a new evil is spreading its wings. Will you stand against the shadow in this time of darkness? Kings of War, the latest game to the award winning fantasy real-time strategy series Kohan, returns players to the magical world of Khaldun. Players will find themselves caught up in a civil war, even as greater threats loom on the horizon. Fighting through armies of hundreds, laying siege to dozens of cities across diverse environments, players must learn to become Kings of War. [TimeGate Studios]… Expand"}, {"name": "Star Wars Pinball: The Force Awakens", "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-pinball-the-force-awakens", "publisher": "Zen Studios", "release_date": "Jan 12 2016", "developers": ["Zen Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Pinball"], "meta_score": 81, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/7b892ced0f226332dbf295a9557c97c9-98.jpg", "descriptions": "Star Wars Pinball: The Force Awakens Table is an intergalactic adventure that no Star Wars Pinball fan will want to miss!"}, {"name": "College Hoops 2K8", "details_link": "https://www.metacritic.com/game/xbox-360/college-hoops-2k8", "publisher": "2K Sports", "release_date": "Nov 19 2007", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/a04a3dcf50d10bd2c1e1867e6a83167b-98.jpg", "descriptions": "In the All-American Training Challenge, players can improve their game skills by competing in passing, shooting, and defensive tests against former college basketball standouts like Mike Conley Jr. of Ohio State, Julian Wright of Kansas, Glen \"Big Baby\" Davis of LSU, Alando Tucker ofIn the All-American Training Challenge, players can improve their game skills by competing in passing, shooting, and defensive tests against former college basketball standouts like Mike Conley Jr. of Ohio State, Julian Wright of Kansas, Glen \"Big Baby\" Davis of LSU, Alando Tucker of Wisconsin, Al Thornton of Florida State, J.J. Redick of Duke, and College Hoops 2K8 cover athlete, Greg Oden of Ohio State. Gamers can progress through the challenge drills against these great players while tracking their best times and highest scores in the game. With multiplayer support for up to four players, gamers can compete against their friends to see who has the best College Hoops skills. College basketball fans can truly feel the benefit of playing in front of a frenzied crowd—be it at home or in a neutral tournament venue—with the 6th Man Advantage where the energy of a team’s fans can motivate a team to play harder and with more confidence. During a game, the 6th Man Meter measures the current energy and excitement level of the crowd. By scoring often, playing good defense, and raising the excitement level of the crowd, the 6th Man Meter will rise. Once the meter is full, the home team gains the advantage of playing with less fatigue for a brief period while the opposing team starts to lose confidence in their playing ability. The 6th Man Advantage delivers a realistic element with how a great crowd can inspire their team to victory. [2K Sports]… Expand"}, {"name": "Monaco: What's Yours Is Mine", "details_link": "https://www.metacritic.com/game/xbox-360/monaco-whats-yours-is-mine", "publisher": "Majesco Games", "release_date": "May 10 2013", "developers": ["Pocketwatch Games"], "platforms": ["PC", "Switch", "Xbox 360"], "num_players": "1-4 ", "genres": ["Adventure", "General", "General"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/5fa5ba735ee47b370886ed680a637a0e-98.jpg", "descriptions": "Build a crack team of thieves and execute the perfect crime. Sneak, steal, and run for your life in single-player or with up to 4 friends in local or online co-op."}, {"name": "Tails of Iron", "details_link": "https://www.metacritic.com/game/pc/tails-of-iron", "publisher": "United Label", "release_date": "Sep 17 2021", "developers": ["Odd Bug Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/7a72eb0a9014566ede927bb2734c2367-98.jpg", "descriptions": "Set in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart. As you explore the deceivinglySet in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart. As you explore the deceivingly charming world, you'll encounter a cast of unique companions, ready to aid you in your adventure. And you'll need all the help you can get, whether that's new meal recipes, blueprints to forge deadly weapons and armour, or even a land-chugging, armour-plated mole mobile! Overcome your fears. Rescue your brothers. Restore Your Kingdom. Your tail has begun. Master Brutal Combat: From frog zombies to gargantuan grubs - and everything in-between - the Kingdom is awash with danger. To overcome each perilous encounter, you'll need to study your opponent's attacks and react accordingly! Thankfully, there's a range of deadly abilities at your disposal, including parry bashes and fatal executions, not to mention ranged attacks with your nifty bow and arrow. Explore a Treacherous Kingdom: Fully accompanied by the deep, raspy narrations of Doug Cockle (voice of Geralt of Rivia from The Witcher), prepare to embark on an epic adventure across the mediaeval-fantasy Rat Kingdom. Complete side quests and faction hunts for some additional gold-on-the-side, or join forces with a sharp-eyed companion to help even the playing field. Customise your Attack: Adapt Redgi's combat style to the task at hand. Heavy armour may provide better protection but can you really afford to slow down your dodge-roll? And then there's the question of weapon; axes pack a punch, while spears are quick and nimble. Perhaps you'd prefer the all-round performance of a trusty broadsword? … Expand"}, {"name": "Monster Hunter Stories 2: Wings of Ruin", "details_link": "https://www.metacritic.com/game/switch/monster-hunter-stories-2-wings-of-ruin", "publisher": "Capcom", "release_date": "Jul  9 2021", "developers": ["Capcom"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/37db630796c8a8e51e6bc6329ea7bf3d-98.jpg", "descriptions": "Monster Hunter Stories 2: Wings of Ruin offers both RPG and Monster Hunter fans a unique new experience with a rich storyline featuring charming characters, challenging quests and friendly encounters with familiar monsters from the Monster Hunter series. Assuming the role of a young MonsterMonster Hunter Stories 2: Wings of Ruin offers both RPG and Monster Hunter fans a unique new experience with a rich storyline featuring charming characters, challenging quests and friendly encounters with familiar monsters from the Monster Hunter series. Assuming the role of a young Monster Rider who can use a Kinship Stone to form strong bonds with monsters, players can gain experience and improve their skills to form deeper connections with these wonderful creatures. When ready, players can embark on memorable adventures filled with dramatic events and heartwarming friendships as the epic tale unfolds.… Expand"}, {"name": "Chivalry 2", "details_link": "https://www.metacritic.com/game/xbox-series-x/chivalry-2", "publisher": "Deep Silver", "release_date": "Jun  8 2021", "developers": ["Torn Banner Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 64 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 81, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/b834a56e2baafc85d5bcb365cf378fd2-98.jpg", "descriptions": "Chivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era - from the thunder of cavalry charges, to storms of flaming arrows, sprawling castle sieges and more. Catapults tear the earth apartChivalry 2 is a multiplayer first person slasher inspired by epic medieval movie battles. Players are thrust into the action of every iconic moment of the era - from the thunder of cavalry charges, to storms of flaming arrows, sprawling castle sieges and more. Catapults tear the earth apart as players lay siege to castles, set fire to villages and slaughter filthy peasants in the return of grand Team Objective maps. Ride to war on horseback and claim glory by your blade. Are ye a heroic warrior, or a blood-soaked murderer? Keep fighting and gurgling out battlecries even when wounded, bleeding out and missing limbs.  Enhanced player expression brings thousands of hilarious new voice-lines and deep character customization. A revamped, faster and more fluid combat system offers an expanded range of creative choices, allowing players to perfect their playstyle. Immersive sound and effects ensure every blow lands with the sickening thud of steel sinking into bone.… Expand"}, {"name": "Littlewood", "details_link": "https://www.metacritic.com/game/switch/littlewood", "publisher": "SmashGames", "release_date": "Feb 25 2021", "developers": ["SmashGames"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/e937603e99ac80b983af5dadc90d0558-98.jpg", "descriptions": "The world has already been saved. Now it's time to rebuild your town, learn new hobbies, and forge lifelong friendships in this peaceful and relaxing RPG."}, {"name": "Midnight Club: Los Angeles", "details_link": "https://www.metacritic.com/game/xbox-360/midnight-club-los-angeles", "publisher": "Rockstar Games", "release_date": "Oct 20 2008", "developers": ["Rockstar San Diego"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/8e42597d2218df822eba2050eb01c9af-98.jpg", "descriptions": "Whether driving by the beach or beating the competition by cutting through a parking garage at 200 mph, Midnight Club: Los Angeles provides a seamless, breathtaking environment for everyone who loves to compete. With no load times, no tracks, and no rules, the game allows players to race whoWhether driving by the beach or beating the competition by cutting through a parking garage at 200 mph, Midnight Club: Los Angeles provides a seamless, breathtaking environment for everyone who loves to compete. With no load times, no tracks, and no rules, the game allows players to race who they want, when they want, and where they want in an unbelievable recreation of Los Angeles. A racing game is nothing without the great cars and Midnight Club: Los Angeles allows extensive customization of vehicles for both performance and appearance. Players can now fully personalize their officially licensed imports, tuners, classic muscle cars and motorcycles both inside and out with a dizzying array of licensed rims, spoilers, interior gauges, tires and more. [Rockstar Games]… Expand"}, {"name": "Metal Gear Online", "details_link": "https://www.metacritic.com/game/playstation-3/metal-gear-online", "publisher": "Konami", "release_date": "Jun 12 2008", "developers": ["Kojima Productions"], "platforms": "PlayStation 3", "genres": ["Action Adventure", "Modern", "General"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/10c434f6ec18d8019995ab832314cd58-98.jpg", "descriptions": "Metal Gear Online uses the MGS4 engine to bring pure multiplayer Metal Gear action to the PlayStation 3."}, {"name": "Xenosaga Episode III: Also sprach Zarathustra", "details_link": "https://www.metacritic.com/game/playstation-2/xenosaga-episode-iii-also-sprach-zarathustra", "publisher": "Namco Bandai Games America", "release_date": "Aug 29 2006", "developers": ["Monolith Soft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 81, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/7/515482b61ff7f97a84e340215ce44495-98.jpg", "descriptions": "The story of Xenosaga III starts a year after \"Xenosaga II\" ended. Shion has resigned from Vector Industries after learning that the company is deeply connected to the appearance of the Gnosis. She instead joins Scientia, an underground organization working to unveil Vector's secrets inThe story of Xenosaga III starts a year after \"Xenosaga II\" ended. Shion has resigned from Vector Industries after learning that the company is deeply connected to the appearance of the Gnosis. She instead joins Scientia, an underground organization working to unveil Vector's secrets in order to bring them down. Uncover the truth and save mankind in the finale of the Xenosaga series which boasts over 3 hours of movies, an updated battle system, and an improved customization feature with more in-depth character specialization and diversification and higher rewards for strategic party management. This RPG also includes an easily accessible database feature, the \"Xeno Bible\" and a mini-game with over 50 levels that challenges both you and your friends. [Namco Bandai]… Expand"}, {"name": "Signalis", "details_link": "https://www.metacritic.com/game/pc/signalis", "publisher": "rose-engine", "release_date": "Oct 27 2022", "developers": ["rose-engine"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/1bbe8c43469bb1d27554069915ec915e-98.jpg", "descriptions": "Awaken from slumber and explore a surreal retrotech world as Elster, a technician Replika searching for her lost partner and her lost dreams.\r Discover terrifying secrets, challenging puzzles, and nightmarish creatures in a tense and melancholic experience of cosmic dread and classicAwaken from slumber and explore a surreal retrotech world as Elster, a technician Replika searching for her lost partner and her lost dreams.\r Discover terrifying secrets, challenging puzzles, and nightmarish creatures in a tense and melancholic experience of cosmic dread and classic psychological survival horror.… Expand"}, {"name": "Tentacular", "details_link": "https://www.metacritic.com/game/pc/tentacular", "publisher": "Devolver Digital", "release_date": "Mar 24 2022", "developers": ["Firepunchd"], "platforms": ["PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/0d7f655e733f8e7ce54a8e88c6fcba81-98.jpg", "descriptions": "Ever felt like a squid out of water?Tentacular plunges you into the ocean-dwelling hulk of a gigantic, kind-hearted tentacled beast trying to figure out its place in the world.\n\nRaised among humans on the bustling and eccentric island of La Kalma, the time has finally come to unravel theEver felt like a squid out of water?Tentacular plunges you into the ocean-dwelling hulk of a gigantic, kind-hearted tentacled beast trying to figure out its place in the world.Raised among humans on the bustling and eccentric island of La Kalma, the time has finally come to unravel the secrets of your mysterious origin while working as the world's strongest handyman. Help your human friends to research a strange and an incredibly powerful energy source through a colossal collection of action-based activities and constructions puzzles, using your titanic tentacles to aid your quest for answers and unlock elements for your very own playground in the creative sandbox mode.… Expand"}, {"name": "Resident Evil Village", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-village", "publisher": "Capcom", "release_date": "May  7 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/0a4a252a418f061627d0a2392385dff3-98.jpg", "descriptions": "The next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner.Years after the tragic events of ResidentThe next generation of survival horror rises in the form of Resident Evil Village, the eighth major entry in the Resident Evil series. With ultra-realistic graphics powered by the RE Engine, fight for survival as danger lurks around every corner.Years after the tragic events of Resident Evil 7 biohazard, Ethan Winters has started over with his wife Mia, finally living in peace and putting the past behind them. However, Chris Redfield, the legendary hero from previous Resident Evil games, suddenly disrupts their life, throwing a devastated Ethan into a new and twisted nightmare in search of answers.… Expand"}, {"name": "The Age of Decadence", "details_link": "https://www.metacritic.com/game/pc/the-age-of-decadence", "publisher": "Iron Tower Studio", "release_date": "Oct 15 2015", "developers": ["Iron Tower Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["PC-style RPG", "Role-Playing", "Western-Style"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/fc6ec3c50f4ca5f96a650369391c380c-98.jpg", "descriptions": "The Age of Decadence is an isometric, turn-based, single-player role-playing game set in a low magic, post-apocalyptic fantasy world, inspired by the fall of the Roman Empire. The game features a detailed skill-based character system, multiple skill-based ways to handle quests, choices &The Age of Decadence is an isometric, turn-based, single-player role-playing game set in a low magic, post-apocalyptic fantasy world, inspired by the fall of the Roman Empire. The game features a detailed skill-based character system, multiple skill-based ways to handle quests, choices & consequences, and extensive dialogue trees. … Expand"}, {"name": "Galactic Civilizations III", "details_link": "https://www.metacritic.com/game/pc/galactic-civilizations-iii", "publisher": "Stardock", "release_date": "Mar 27 2014", "developers": ["Stardock"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "4X"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/69b9a0380e628417ea3eab499c3434ce-98.jpg", "descriptions": "Galactic Civilizations III challenges players to assemble an empire that dominates the galaxy through conquest, diplomacy, cultural hegemony, or scientific research."}, {"name": "Moonlighter", "details_link": "https://www.metacritic.com/game/playstation-4/moonlighter", "publisher": "11 bit studios", "release_date": "May 29 2018", "developers": ["11 bit studios", "Digital Sun"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/dd37282bad281d898d2b49ed4625e5d5-98.jpg", "descriptions": "Moonlighter is an action RPG with rogue-lite elements following the everyday routines of Will, an adventurous shopkeeper that dreams of becoming a hero."}, {"name": "Shovel Knight Dig", "details_link": "https://www.metacritic.com/game/pc/shovel-knight-dig", "publisher": "Yacht Club Games", "release_date": "Sep 23 2022", "developers": ["Yacht Club Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/6811e703fbd3492cb7b71a62316c8aa2-98.jpg", "descriptions": "When Drill Knight and his dastardly digging crew blast apart Shovel Knight's peaceful campsite and steal his loot, he grabs his trusty Shovel Blade and starts tunnelling after them. Meet new friends and foes, visit strange lands, and outfit yourself in your quest to keep the entire land fromWhen Drill Knight and his dastardly digging crew blast apart Shovel Knight's peaceful campsite and steal his loot, he grabs his trusty Shovel Blade and starts tunnelling after them. Meet new friends and foes, visit strange lands, and outfit yourself in your quest to keep the entire land from collapsing underfoot! Jump, slash, and dig your way down an ever-changing chasm of mystery in Shovel Knight Dig, an all-new Shovel Knight adventure!… Expand"}, {"name": "Hand of Fate 2", "details_link": "https://www.metacritic.com/game/switch/hand-of-fate-2", "publisher": "Defiant Development", "release_date": "Jul 17 2018", "developers": ["Defiant Development"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/52d2af2cabbeb22336e8b22aa59a502c-98.jpg", "descriptions": "Hand of Fate 2 is a dungeon crawler set in a world of dark fantasy. Master a living boardgame where every stage of the adventure is drawn from a deck of legendary encounters chosen by you! Choose wisely -- your opponent, the enigmatic Dealer, will pull no punches as he shapes you into theHand of Fate 2 is a dungeon crawler set in a world of dark fantasy. Master a living boardgame where every stage of the adventure is drawn from a deck of legendary encounters chosen by you! Choose wisely -- your opponent, the enigmatic Dealer, will pull no punches as he shapes you into the instrument of his revenge. The table has changed, but the stakes remain the same: life or death!… Expand"}, {"name": "Stories Untold", "details_link": "https://www.metacritic.com/game/pc/stories-untold", "publisher": "Devolver Digital", "release_date": "Feb 27 2017", "developers": ["No Code"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Text"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/559afeeaf608cca20871342f880fb217-98.jpg", "descriptions": "Stories Untold is a compilation tape of four experimental text adventures, including a remaster of the original episode The House Abandon."}, {"name": "Marvel: Ultimate Alliance", "details_link": "https://www.metacritic.com/game/psp/marvel-ultimate-alliance", "publisher": "Activision", "release_date": "Oct 24 2006", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PSP"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/99cb14398d305fac86ed41fdbdca02c7-98.jpg", "descriptions": "Marvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine theMarvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine the fate of both planet Earth and the Marvel universe – revealed in one of multiple epilogues. Marvel: Ultimate Alliance offers total team customization, where players create their own team name, icon and vehicle, as well as establish their team reputation as they play throughout the story.  Gamers also have the option to level up each character individually to their liking, or all team members at the same time to keep their heroes balanced.  With the game's new combat system, players battle against the world's most notorious Marvel Super Villains in the air, underwater, and on the ground, using grappling, blocking and dodging moves, by charging up their Super Hero powers before unleashing them, and using environmental objects as one and two-handed weapons. Marvel:  Ultimate Alliance features a storyline where the missions players accept, the objectives they complete, and their interactions with other characters throughout the game directly impact how the story plays out. The game also features a robust multiplayer component where fans can band together with friends as their favorite Marvel Super Heroes, and fight evil in both on and offline cooperative story modes.  There's also a Competitive Mode where the game tracks various in-game stats so players can see how well they stack up against one another – affecting the amount of experience points earned and how equipment is distributed. [Activision]… Expand"}, {"name": "Pocky & Rocky Reshrined", "details_link": "https://www.metacritic.com/game/switch/pocky-rocky-reshrined", "publisher": "Natsume", "release_date": "Jun 24 2022", "developers": ["NATSUME ATARI Inc."], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/70899b687ba33b70ed32a01b9aea2fc5-98.jpg", "descriptions": "Pocky the shrine maiden and Rocky the raccoon are back together in the latest game in the long-running classic shooter series! As the evil Black Mantle attacks, Pocky and Rocky need to team up once again, this time with some new friends to take on the upcoming challenges! With 8 stages ofPocky the shrine maiden and Rocky the raccoon are back together in the latest game in the long-running classic shooter series! As the evil Black Mantle attacks, Pocky and Rocky need to team up once again, this time with some new friends to take on the upcoming challenges! With 8 stages of high-paced shooting action, you'll have your hands full with creepy enemies, big bosses, and lots of twists and turns! … Expand"}, {"name": "Pinball Fantasies", "details_link": "https://www.metacritic.com/game/psp/pinball-fantasies", "publisher": "Cowboy Rodeo", "release_date": "Nov 24 2009", "developers": ["Cowboy Rodeo"], "platforms": ["iPhone/iPad", "PSP"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/1309b72817aa00a5d3987c27783e64d9-98.jpg", "descriptions": "[PSP Minis]  Pinball Fantasies is the official port of the classic Amiga pinball simulator originally released in 1992."}, {"name": "Catan", "details_link": "https://www.metacritic.com/game/xbox-360/catan", "publisher": "Microsoft Game Studios", "release_date": "May  2 2007", "developers": ["Big Huge Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "4  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/88c6241eff4aaafdb700185ebbf680d5-98.jpg", "descriptions": "[Xbox Live Arcade]  Catan, based on the best-selling board game \"Settlers of Catan,\" places you in the role of a colonist on a newly discovered imaginary island. Through strategy and trading, vie for control with other players over the territory and resources of this uncharted wilderness.[Xbox Live Arcade]  Catan, based on the best-selling board game \"Settlers of Catan,\" places you in the role of a colonist on a newly discovered imaginary island. Through strategy and trading, vie for control with other players over the territory and resources of this uncharted wilderness. Compete online with your friends from around the world, or go up against a computer personality. Features include an all-new 3-D \"Living World\" environment and robust computer gameplay to challenge all skill levels—even the experts. Difficulty levels: Play against historical personalities including Alexander, Cleopatra, and Tokugawa—a challenge to all skill levels, even experts! Also included is a \"Learn As You Play\" tutorial. House rules: Use popular house rules including Friendly Robber and Friendly Resources. Dice roll options: Choose from Randomized, Dice Deck with re-shuffling options. Multiplayer interaction: Taunt your opponents with engaging animations and emotes. Online support: Engane in multiplayer on Xbox LIVE (1-4 players, limited to one player per console) with Voice Chat enabled. [Microsoft]… Expand"}, {"name": "Planet Zoo", "details_link": "https://www.metacritic.com/game/pc/planet-zoo", "publisher": "Frontier Developments", "release_date": "Nov  5 2019", "developers": ["Frontier Developments"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/e3339d2fb327b1f978bc0f965d6a29fc-98.jpg", "descriptions": "Build a world for wildlife in Planet Zoo. From the developers of Planet Coaster and Zoo Tycoon comes the ultimate zoo sim, featuring authentic living animals who think, feel and explore the world you create around them. Experience a globe-trotting campaign or let your imagination run wild inBuild a world for wildlife in Planet Zoo. From the developers of Planet Coaster and Zoo Tycoon comes the ultimate zoo sim, featuring authentic living animals who think, feel and explore the world you create around them. Experience a globe-trotting campaign or let your imagination run wild in the freedom of Sandbox mode. Create unique habitats and vast landscapes, make big decisions and meaningful choices, and nurture your animals as you construct and manage the world's wildest zoos. Meet a world of incredible animals. From playful lion cubs to mighty elephants, every animal in Planet Zoo is a thinking, feeling individual with a distinctive look and personality of their own. Craft detailed habitats to bring your animals' natural environments home, research and manage each species to allow them to thrive, and help your animals raise families to pass their genes onto future generations. Manage an amazing living world that responds to every decision you make. Focus on the big picture or go hands-on and control the smallest details. Thrill visitors with iconic exhibits, develop your zoo with new research, and release new generations of your animals back into the wild. Your choices come alive in a world where animal welfare and conservation comes first.… Expand"}, {"name": "Tiger Woods PGA Tour 09 All-Play", "details_link": "https://www.metacritic.com/game/wii/tiger-woods-pga-tour-09-all-play", "publisher": "Electronic Arts", "release_date": "Aug 26 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/0e4569d55f84966b3459e32f4e50db2b-98.jpg", "descriptions": "Tiger Woods PGA Tour 09 All-Play features personalized coaching from Tiger Woods' personal coach, Hank Haney and all types of gamers can pick up this game and have a fun and challenging experience. The game features new graphics and user interface while also incorporating interactive andTiger Woods PGA Tour 09 All-Play features personalized coaching from Tiger Woods' personal coach, Hank Haney and all types of gamers can pick up this game and have a fun and challenging experience. The game features new graphics and user interface while also incorporating interactive and social mini-games. The standing swing control truly takes advantage of the Wii console’s unique control scheme. The game also features online play for the first time with Simultaneous Online Play that allows up to four players the ability to play each hole at the same time. [Electronic Arts]… Expand"}, {"name": "Madden NFL 08", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-08", "publisher": "EA Sports", "release_date": "Aug 14 2007", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 81, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/d272fe6bbc46ad762565e4b0fdc47769-98.jpg", "descriptions": "All-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. All-New Front Office Mode: Take full controlAll-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. All-New Front Office Mode: Take full control of every aspect of an NFL franchise. Construct a state-of-the-art stadium, set concession prices, hire your coaching staff, draft players, and manage the entire operation from the top down to build your dynasty. Your Ring of a Champion: Increase your Madden Gamer Level to help create and customize your own in-game championship ring. Madden Unmatched: All-new player moves, including auto-motion, backward passes and low-hitting tackles, plus ultra-smooth gameplay provide the most realistic NFL gaming experience ever. Control receivers and make spectacular catches or key possession receptions, or roam the secondary and jar the ball loose with big hits and ball-stripping tackles. [EA Sports]… Expand"}, {"name": "Far Cry 5", "details_link": "https://www.metacritic.com/game/playstation-4/far-cry-5", "publisher": "Ubisoft", "release_date": "Mar 27 2018", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/9b7628d417d779dffd0456a23887f07e-98.jpg", "descriptions": "Welcome to Hope County, Montana. This idyllic location is home to a community of freedom-loving people - and a fanatical doomsday cult known by many as The Project at Eden's Gate. Led by the charismatic prophet Joseph Seed and his devoted siblings, Eden's Gate has been surreptitiouslyWelcome to Hope County, Montana. This idyllic location is home to a community of freedom-loving people - and a fanatical doomsday cult known by many as The Project at Eden's Gate. Led by the charismatic prophet Joseph Seed and his devoted siblings, Eden's Gate has been surreptitiously infiltrating all aspects of daily life. When your arrival incites the cult to violently assume control of the region, you have to rise up ans spark the fires of resistance to liberate the besieged community. Freely explore Hope Couny's rivers, lands and skies with the largest customisable weapon and vehicle roster ever in a Far Cry game. You are the hero of the story in a world that hits back with every strike, and where the places you discover and the locals you team up with will shape your story in ways you will never anticipate. [Ubisoft]… Expand"}, {"name": "Paranormasight: The Seven Mysteries of Honjo", "details_link": "https://www.metacritic.com/game/pc/paranormasight-the-seven-mysteries-of-honjo", "publisher": "Square Enix", "release_date": "Mar  8 2023", "developers": ["Square Enix", "Xeen"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Visual Novel"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/9524b56067e7c15486f7e113d8b33a09-98.jpg", "descriptions": "Shogo Okiie, an ordinary office worker, visits Kinshibori Park in the dead of night with his friend, Yoko Fukunaga, to investigate a well-known local ghost story: The Seven Mysteries of Honjo. Shogo doesn't quite believe Yoko when she talks about how the Mysteries are connected to the RiteShogo Okiie, an ordinary office worker, visits Kinshibori Park in the dead of night with his friend, Yoko Fukunaga, to investigate a well-known local ghost story: The Seven Mysteries of Honjo. Shogo doesn't quite believe Yoko when she talks about how the Mysteries are connected to the Rite of Resurrection and doesn't pay it much mind - that is, until strange events begin to unfold before his very eyes.\r Meanwhile, several others are making their own investigations into The Seven Mysteries...\r Detectives investigating a series of strange deaths, a high-school girl seeking the truth behind her classmate's suicide, and a mother who has sworn revenge for her lost son.\r Their desires and motives intertwine and interplay, with the Seven Mysteries of Honjo at the core, leading the story towards a battle of wits and curses.… Expand"}, {"name": "Blacktail", "details_link": "https://www.metacritic.com/game/xbox-series-x/blacktail", "publisher": "The Parasight", "release_date": "Dec 15 2022", "developers": ["The Parasight"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/8d1e9d451ecfbc6e8c47eedf3f0c4f1d-98.jpg", "descriptions": "Create the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling set in a vibrant fairy tale world. Choose your path toCreate the myth of Baba Yaga by living out the origins of this classic Slavic folk story in BLACKTAIL, the first-person action-adventure from THE PARASIGHT. Experience a one-of-a-kind blend of intense archery combat and dark storytelling set in a vibrant fairy tale world. Choose your path to become either the guardian of the woods or the terror nightmares are made of.\r You play as Yaga, a 16-year-old girl accused of witchcraft and expelled from an early medieval Slavic settlement. When living memories of her past return as foul, walking spirits, Yaga is faced with no other option than to hunt them down in hopes of unravelling her own mystery.… Expand"}, {"name": "Railbound", "details_link": "https://www.metacritic.com/game/switch/railbound", "publisher": "7Levels", "release_date": "Dec  1 2022", "developers": ["7Levels", "Afterburn"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/5d35f187d3c7f939bf069565f4258ed4-98.jpg", "descriptions": "Railbound is a comfy track-bending puzzle game about a pair of dogs on a train journey around the world.Connect and sever railways across the world to help everyone reach their homes, and solve over 150 clever puzzles ranging from gentle slopes to twisted passageways."}, {"name": "Exo One", "details_link": "https://www.metacritic.com/game/pc/exo-one", "publisher": "Exbleative", "release_date": "Nov 18 2021", "developers": ["Exbleative"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "General", "Space", "Civilian"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/cad2819ca96826f539e1dc70c51c35fc-98.jpg", "descriptions": "A strange signal… an alien craft… Exo One is an interplanetary, gravity-defying journey through space and time. Master a truly alien traversal system and move through enigmatic and desolate landscapes in ways you’ve never experienced. Use gravity and momentum to reach colossal speeds andA strange signal… an alien craft… Exo One is an interplanetary, gravity-defying journey through space and time. Master a truly alien traversal system and move through enigmatic and desolate landscapes in ways you’ve never experienced. Use gravity and momentum to reach colossal speeds and exhilarating heights.… Expand"}, {"name": "Neon Abyss", "details_link": "https://www.metacritic.com/game/xbox-one/neon-abyss", "publisher": "Team17", "release_date": "Jul 14 2020", "developers": ["Veewo Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/3e1190c27934677ac033e061c5f06640-98.jpg", "descriptions": "Neon Abyss is a frantic, roguelite action-platformer where you run ‘n’ gun your way into the Abyss. Featuring unlimited item synergies and a unique dungeon evolution system, each run diversifies the experience and every choice alters the ruleset."}, {"name": "Slime Rancher", "details_link": "https://www.metacritic.com/game/pc/slime-rancher", "publisher": "Monomi Park", "release_date": "Aug  1 2017", "developers": ["Monomi Park"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Open-World", "First-Person", "Arcade"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/943b19475490d93aa6079df0030ce920-98.jpg", "descriptions": "Slime Rancher is the tale of Beatrix LeBeau, a plucky, young rancher who sets out for a life a thousand light years away from Earth on the ‘Far, Far Range’ where she tries her hand at making a living wrangling slimes."}, {"name": "Nelly Cootalot: The Fowl Fleet", "details_link": "https://www.metacritic.com/game/pc/nelly-cootalot-the-fowl-fleet", "publisher": "Application Systems Heidelberg Software GmbH", "release_date": "Mar 22 2016", "developers": ["Application Systems Heidelberg Software GmbH", "Application Systems Heidelberg"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/655eb5bd85cab91edbf0df93dfeb6c38-98.jpg", "descriptions": "Pirate heroine Nelly Cootalot takes on the villainous Baron Widebeard in this point and click adventure game. Meet a cast of outlandish characters and face perplexing challenges in your quest for the Treasure of the Seventh Sea."}, {"name": "Order of Battle: Pacific", "details_link": "https://www.metacritic.com/game/pc/order-of-battle-pacific", "publisher": "Slitherine", "release_date": "Apr 30 2015", "developers": ["The Artistocrats"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 81, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/9b466bdbb149e6d03a7dfa94f97efbda-98.jpg", "descriptions": "Order of Battle: Pacific features playable campaigns for both US-led Allies and Japanese Empire. Starting from the attack on Pearl Harbor, the dynamic campaign system allows players to alter the course of history and win the war as Japan or lead Allied forces to ultimate victory with theOrder of Battle: Pacific features playable campaigns for both US-led Allies and Japanese Empire. Starting from the attack on Pearl Harbor, the dynamic campaign system allows players to alter the course of history and win the war as Japan or lead Allied forces to ultimate victory with the invasion of Japan. … Expand"}, {"name": "Mortal Kombat: Deadly Alliance", "details_link": "https://www.metacritic.com/game/game-boy-advance/mortal-kombat-deadly-alliance", "publisher": "Midway", "release_date": "Nov 20 2002", "developers": ["Criterion Games"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/e6b91dfcb9adc2d802bc16b06c38962c-98.jpg", "descriptions": "A controversial franchise marks its return in Mortal Kombat:  Deadly Alliance.  This time around, the fighting game features an all-new fighting system, an in-depth, supernatural storyline, and the infamous brutal fatalities.  Beginning the next chapter in the battle of good versus evil, twoA controversial franchise marks its return in Mortal Kombat:  Deadly Alliance.  This time around, the fighting game features an all-new fighting system, an in-depth, supernatural storyline, and the infamous brutal fatalities.  Beginning the next chapter in the battle of good versus evil, two powerful sorcerers--Shang Tsung and Quan Chi--join forces to deliver unrivaled fighting action in their quest for supreme mortality.  Use new or classic Mortal Kombat fighters and engage in hand-to-hand and special-weapon combat, executing secret moves and combinations for fatalities and deadly body blows.… Expand"}, {"name": "Genesis Noir", "details_link": "https://www.metacritic.com/game/xbox-one/genesis-noir", "publisher": "Surprise Attack", "release_date": "Mar 26 2021", "developers": ["Feral Cat Den"], "platforms": ["PC", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/cb94c9443a08a3d1f24458ff68272edd-98.jpg", "descriptions": "Genesis Noir is an adventure game with an emphasis on exploration, simple interactions, and generative art."}, {"name": "Mass Effect 2: Overlord", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-2-overlord", "publisher": "EA Games", "release_date": "Jun 15 2010", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/fd441c69f52848815ff577a200199b53-98.jpg", "descriptions": "(Downloadable Content)  Keep a powerful hybrid VI intelligence – and the geth it has unleashed upon a planet – from wreaking havoc across the galaxy! Overlord includes 5 new levels, exciting ground combat and Hammerhead missions, and all-new achievements. [Xbox.com]"}, {"name": "MX Unleashed", "details_link": "https://www.metacritic.com/game/xbox/mx-unleashed", "publisher": "THQ", "release_date": "Feb 17 2004", "developers": ["Rainbow Studios"], "platforms": ["PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/aa57c2f25e5107e95140999e92ae5e43-98.jpg", "descriptions": "The newest installment of the MX series gives off-road racers more freedom than ever before.  Challenge yourself in the freeworld mode - an off-road playground filled with treacherous terrain, minigames and machine races.  Work your way up the ranks racing against the top champions in theThe newest installment of the MX series gives off-road racers more freedom than ever before.  Challenge yourself in the freeworld mode - an off-road playground filled with treacherous terrain, minigames and machine races.  Work your way up the ranks racing against the top champions in the world on over 40 tracks in 14 separate leagues.  Face off against friends in both racing and freestyle modes. Prepare yourself for mud, dirt, high speeds and a serious attitude.… Expand"}, {"name": "Fatal Frame II: Crimson Butterfly", "details_link": "https://www.metacritic.com/game/playstation-2/fatal-frame-ii-crimson-butterfly", "publisher": "Tecmo", "release_date": "Dec 10 2003", "developers": ["Tecmo"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 81, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/afdaa4d4ce9b94224c865e7ea6d39b89-98.jpg", "descriptions": "(Also known as \"Project Zero II: Crimson Butterfly\") This time the terrifying journey takes you to a whole new creepy setting, an abandoned village, where you play the role of Mio Amakura, a young girl who is gifted with a strong sixth sense and her twin sister Mayu, who notices a crimson(Also known as \"Project Zero II: Crimson Butterfly\") This time the terrifying journey takes you to a whole new creepy setting, an abandoned village, where you play the role of Mio Amakura, a young girl who is gifted with a strong sixth sense and her twin sister Mayu, who notices a crimson butterfly faintly glowing in the sky. Mayu, feeling mysteriously compelled to follow the butterfly, chases it into the dark forest. Mio unwillingly follows her sister into the forest's depths. After chasing the crimson butterfly to a clearing in the forest, the two sisters stumble upon a deserted village. Unknown to either sister is that this lost village will become the spooky setting for yet another horrifying tale guaranteed keep you up at night. [Tecmo]… Expand"}, {"name": "Secret Weapons Over Normandy", "details_link": "https://www.metacritic.com/game/playstation-2/secret-weapons-over-normandy", "publisher": "LucasArts", "release_date": "Nov 18 2003", "developers": ["Totally Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Simulation", "Flight", "WWII"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/4f39cb259de6e2add5a2e5183845eb81-98.jpg", "descriptions": "Join a secret squad of pilots dedicated to thwarting the most heinous plans of the Third Reich. Fly over twenty authentic aircraft across thirty daring missions in this new WWII action-flyer. Lawrence Holland, the legendary creator of \"Star Wars X-Wing,\" \"Star Wars Tie Fighter\" and \"SecretJoin a secret squad of pilots dedicated to thwarting the most heinous plans of the Third Reich. Fly over twenty authentic aircraft across thirty daring missions in this new WWII action-flyer. Lawrence Holland, the legendary creator of \"Star Wars X-Wing,\" \"Star Wars Tie Fighter\" and \"Secret Weapons of the Luftwaffe\" returns with an exhilarating new game of action and intrigue. Can you be trusted with the most dangerous secrets of the war? Immerse yourself in intense WWII flight action as you make your way through the ranks of an elite fighter squadron. Fly more than twenty realistic aircraft across a variety of combat theaters over World War II Europe and other territories as you make your way through the ranks of an elite fighter squadron. Engage in over thirty action-packed missions featuring air-to-air and air-to-ground battle scenarios. [LucasArts]… Expand"}, {"name": "NHL Hitz Pro", "details_link": "https://www.metacritic.com/game/xbox/nhl-hitz-pro", "publisher": "Midway", "release_date": "Sep 25 2003", "developers": ["Next Level Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Arcade"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/9c21897de2528a50e6c0f214f410a9a4-98.jpg", "descriptions": "NHL Hitz Pro mixes a hard-hitting blend of NHL authenticity and adrenaline-style gameplay with real five-on-five NHL hockey.  While huge hits and rocket goals are common, the games still follows all NHL penalties from offsides and two-line passing to holding and cross-checking.  Choose fromNHL Hitz Pro mixes a hard-hitting blend of NHL authenticity and adrenaline-style gameplay with real five-on-five NHL hockey.  While huge hits and rocket goals are common, the games still follows all NHL penalties from offsides and two-line passing to holding and cross-checking.  Choose from 23-man NHL player rosters to play in a variety of real stadiums.  Practice your skills in the retooled Hockey School mode, and then build your own dynasty in Franchise mode.  You can also play head-to-head online or set up a tournament for up to 16 teams.… Expand"}, {"name": "Pokemon Pinball: Ruby & Sapphire", "details_link": "https://www.metacritic.com/game/game-boy-advance/pokemon-pinball-ruby-sapphire", "publisher": "Nintendo", "release_date": "Aug 26 2003", "developers": ["Jupiter Corporation"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/523c850dfd31dac1f51c614e9a9dbbb7-98.jpg", "descriptions": "It's time to retire your copy of Pokémon Pinball for the Game Boy Color and upgrade to Pokémon Pinball: Ruby & Sapphire for Game Boy Advance.  Pokémon Pinball challenges you to rack up huge Hi-Scores as you catch over 200 Pokémon from Pokémon Ruby andIt's time to retire your copy of Pokémon Pinball for the Game Boy Color and upgrade to Pokémon Pinball: Ruby & Sapphire for Game Boy Advance.  Pokémon Pinball challenges you to rack up huge Hi-Scores as you catch over 200 Pokémon from Pokémon Ruby and Sapphire.  Use the fast flippers to shoot the Poké Ball at targets on either the Ruby or Sapphire fields and catch your favorite Pokémon.  With the coins you earn during the game, you can visit the Pokémon Mart to purchase special bonus items.  Pokémon Pinball: Ruby & Sapphire is easy to pick up and play, but only true masters will have the skill and determination it takes to catch every last Pokémon.… Expand"}, {"name": "Freekstyle", "details_link": "https://www.metacritic.com/game/playstation-2/freekstyle", "publisher": "EA Sports", "release_date": "Jun 17 2002", "developers": ["Page 44 Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/9660fac7f58bbe4a2db1159fcbeafa35-98.jpg", "descriptions": "Picture flying through rugged terrain with massive jumps at more than 70 mph, hitting a 40-foot jump at the ledge of a 200-foot cliff, and pulling off a Backflip, a Tsunami and a 360 all before you land. If you've got the guts to get this done, then Freekstyle is for you! Race as one ofPicture flying through rugged terrain with massive jumps at more than 70 mph, hitting a 40-foot jump at the ledge of a 200-foot cliff, and pulling off a Backflip, a Tsunami and a 360 all before you land. If you've got the guts to get this done, then Freekstyle is for you! Race as one of eight different riders in any one of the nine awesome venues and get major air as you show off some of the tightest tricks possible. Get off the beaten path as you find hidden routes, and piece together combo moves that let you rack up the points and the props. If you're into high-flying, hard-charging Freeky motocross action, then rev it up and show the world your own Freekstyle! [Electronic Arts]… Expand"}, {"name": "Bomberman Generation", "details_link": "https://www.metacritic.com/game/gamecube/bomberman-generation", "publisher": "Majesco Games", "release_date": "Jun  3 2002", "developers": ["Hudson"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/474115c87488cc19231cba1becddfed5-98.jpg", "descriptions": "Bomberman makes his explosive debut on Nintendo GameCube! Mujoe and his gang are up to their old tricks. This time, they're after the Bomb Elements - powerful crystals that will give them the means to rule the universe."}, {"name": "All-Star Baseball 2003", "details_link": "https://www.metacritic.com/game/playstation-2/all-star-baseball-2003", "publisher": "Acclaim", "release_date": "Feb 26 2002", "developers": ["Acclaim Studios Austin"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/0ec9b0d43681d91bff0805c2c05cb9ae-98.jpg", "descriptions": "New features include Expansion Play, which allows baseball fanatics to choose a city, stadium, and team logo and integrate that team into Major League Baseball, after which they'll draft from a pool of unprotected players in an expansion draft of free agents and Minor League players to buildNew features include Expansion Play, which allows baseball fanatics to choose a city, stadium, and team logo and integrate that team into Major League Baseball, after which they'll draft from a pool of unprotected players in an expansion draft of free agents and Minor League players to build a team from scratch. 10 game modes include Season, Career, Franchise (with 20 consecutive seasons), All-Star Game, Home Run Derby, and Batting Practice. [Acclaim]… Expand"}, {"name": "Empire Earth", "details_link": "https://www.metacritic.com/game/pc/empire-earth", "publisher": "Sierra Entertainment", "release_date": "Nov 12 2001", "developers": ["Stainless Steel Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/176c67edf56f46ef301d4033c5bce1fd-98.jpg", "descriptions": "From the lead designer of Age of Empires® comes Empire EarthTM a real-time strategy game that lets you control the destiny of a fledgling civilization through 500,000 years of human history. Choose any point in time and establish a civilization to transcend the ages and dominate the earth. [Sierra]"}, {"name": "FIFA Soccer 2002", "details_link": "https://www.metacritic.com/game/playstation/fifa-soccer-2002", "publisher": "EA Sports", "release_date": "Nov  1 2001", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 81, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/7da981b2496ca87dc001260ac282d291-98.jpg", "descriptions": "The PlayStation version of FIFA 2002 doesn't quite have all the features available on the PlayStation 2, but it makes a solid case for an investment on its own."}, {"name": "Ooga Booga", "details_link": "https://www.metacritic.com/game/dreamcast/ooga-booga", "publisher": "Sega", "release_date": "Sep 13 2001", "developers": ["Visual Concepts"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/c54b67f064d7e2acff7bc03410740c03-98.jpg", "descriptions": "Wage all-out war in a wacky Polynesian game world. Strap on your grass skirt because you're the Big Kahuna, battling for the heart of the volcano goddess, Ooga Booga!"}, {"name": "XGIII: Extreme G Racing", "details_link": "https://www.metacritic.com/game/playstation-2/xgiii-extreme-g-racing", "publisher": "Acclaim", "release_date": "Aug 21 2001", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/2b7480093e4d6f6b85116e7342bac8f6-98.jpg", "descriptions": "\"Wipeout Fusion\" is in for some competition (if it is ever released!) with this anti-gravity racer which moves at 60 frames per second and features three modes (league, arcade, and time-trial) and two-player split-screen racing within a playable field of up to 12 bikes."}, {"name": "Star Trek: Deep Space Nine: The Fallen", "details_link": "https://www.metacritic.com/game/pc/star-trek-deep-space-nine-the-fallen", "publisher": "Simon & Schuster", "release_date": "Nov 15 2000", "developers": ["Double Helix Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/6a203862cc42091f6bc92874c6c4b684-98.jpg", "descriptions": "The Federation believes that whoever controls all three Red Orbs may have the power to destroy the universe as we know it, so it's up to you -- playing as either Captain Sisko, Major Kira, or Lt. Commander Worf -- to find the Orbs first.  [Simon & Schuster Interactive]"}, {"name": "Railroad Tycoon II: Gold Edition", "details_link": "https://www.metacritic.com/game/dreamcast/railroad-tycoon-ii-gold-edition", "publisher": "Gathering", "release_date": "Jun 30 2000", "developers": ["Tremor Entertainment"], "platforms": "Dreamcast", "genres": ["Strategy", "Tycoon"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/4b7aaa33a3efc056082aed669fdb2c13-98.jpg", "descriptions": "Railroad Tycoon II, based on the award-winning original for PC, steamrolls onto Sega Dreamcast with a boxcar load of new enhancements. Control 40 plus cargo types using over 60 different train engines from around the world and establish transportation empires while outmaneuvering fellowRailroad Tycoon II, based on the award-winning original for PC, steamrolls onto Sega Dreamcast with a boxcar load of new enhancements. Control 40 plus cargo types using over 60 different train engines from around the world and establish transportation empires while outmaneuvering fellow robber barons. Play the Stock Market, manage your resources and watch as your empire grows throughout history.… Expand"}, {"name": "Parasite Eve", "details_link": "https://www.metacritic.com/game/playstation/parasite-eve", "publisher": "Square EA", "release_date": "Sep  9 1998", "developers": ["SquareSoft"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "General"], "meta_score": 81, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/9/8896902bc00bc2200cf3557924933de9-98.jpg", "descriptions": "One of them is a police officer. The other is possessed by an ancient evil threatening all life on Earth. The horrifying bond between them will continue until something dies. A chilling adventure that could only come from the creators of Final Fantasy VII. An epic sci-fi tale told throughOne of them is a police officer. The other is possessed by an ancient evil threatening all life on Earth. The horrifying bond between them will continue until something dies. A chilling adventure that could only come from the creators of Final Fantasy VII. An epic sci-fi tale told through stunning 3D rendered sequences. Battle mutant monsters in real-time polygon combat. Customize weapons, armor, and character abilities.… Expand"}, {"name": "Valiant Hearts: The Great War", "details_link": "https://www.metacritic.com/game/xbox-one/valiant-hearts-the-great-war", "publisher": "Ubisoft", "release_date": "Jun 25 2014", "developers": ["Ubisoft Montpellier"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/8970c0aafe5f4719a0a1fa4b90f32743-98.jpg", "descriptions": "The story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course ofThe story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course of the game. Friendship, love, sacrifice, and tragedy befall each one as they help each other to retain their humanity against the horrors of war. … Expand"}, {"name": "WWE 2K23", "details_link": "https://www.metacritic.com/game/xbox-series-x/wwe-2k23", "publisher": "2K Games", "release_date": "Mar 14 2023", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/7ab196a998c10b26b217cb3675f3184e-98.jpg", "descriptions": "Expanded features, gorgeous graphics, and the ultimate WWE experience. Hit the ring with a deep roster of WWE Superstars and Legends including Roman Reigns, \"American Nightmare\" Cody Rhodes, Ronda Rousey, Brock Lesnar, \"Stone Cold\" Steve Austin and more!\r 2K SHOWCASE: INTERACTIVE SPORTSExpanded features, gorgeous graphics, and the ultimate WWE experience. Hit the ring with a deep roster of WWE Superstars and Legends including Roman Reigns, \"American Nightmare\" Cody Rhodes, Ronda Rousey, Brock Lesnar, \"Stone Cold\" Steve Austin and more!\r 2K SHOWCASE: INTERACTIVE SPORTS DOCUMENTARY\rPlay through the key moments and toughest opponents of John Cena’s storied 20-year WWE career. And in a franchise-first, take on the role of each marquee opponent - some of WWE’s greatest of all time - as you aim to take down Mr. Hustle, Loyalty, and Respect.\r IT’S WARGAMES\rThe fan-favorite action-packed WarGames makes its debut in WWE 2K23 and delivers heart-pounding 3v3 and 4v4 multiplayer mayhem inside two side-by-side rings, surrounded by a double-steel cage!\r YOUR SHOW, YOUR CHOICES\rWith MyGM, take the reins of a weekly show and compete against rival general managers for brand supremacy. Now featuring more GMs to choose from, additional show options, multiple seasons, expanded match cards, and more match types for up to 4 players.\r YOU HOLD ALL THE CARDS\rCollect and upgrade cards of WWE Superstars and Legends to build the ultimate faction and compete for global dominance in MyFACTION, now featuring online multiplayer!\r DEFINE YOUR FUTURE IN MyRISE\rWalk through the curtains for your WWE debut and shape your career as a WWE Superstar with the decisions you make along the way through distinct storylines - The Lock and The Legacy.… Expand"}, {"name": "Fast RMX", "details_link": "https://www.metacritic.com/game/switch/fast-rmx", "publisher": "Shin'en", "release_date": "Mar  3 2017", "developers": ["Shin'en"], "platforms": "Switch", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/8ae86fb37fbf059fd35d011d88275e59-98.jpg", "descriptions": "Jump into the driver's seat of your anti-gravity vehicle and put your skills to the test in high octane competitions. Play locally with three of your friends in splitscreen or online against 7 other players from all around the world. Drive through abandoned mines in the depths of the earth,Jump into the driver's seat of your anti-gravity vehicle and put your skills to the test in high octane competitions. Play locally with three of your friends in splitscreen or online against 7 other players from all around the world. Drive through abandoned mines in the depths of the earth, to dense jungle areas, futuristic cities, crossing vast deserts and finally up into the stratosphere and beyond. Become a legend and master all courses on even the highest speed. [Nintendo]… Expand"}, {"name": "Maldita Castilla EX: Cursed Castilla", "details_link": "https://www.metacritic.com/game/xbox-one/maldita-castilla-ex-cursed-castilla", "publisher": "Abylight", "release_date": "Jul 20 2016", "developers": ["Locomalito"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/84502c5ce7d5067dd5e57879b8dc93fd-98.jpg", "descriptions": "The tears of a young witch have been turned by a demon into a key that opens up a gateway for the evil in this world. The King Alfonso VI of León has assembled his loyal knights to get to Tolomera del Rey and finish the nightmare using the power of the Witch’s tears. Banish the zombies andThe tears of a young witch have been turned by a demon into a key that opens up a gateway for the evil in this world. The King Alfonso VI of León has assembled his loyal knights to get to Tolomera del Rey and finish the nightmare using the power of the Witch’s tears. Banish the zombies and demons that entered the Kingdom of Castile with Don Ramiro, the loyal King’s Knight, and his friends. For that, you will use a different range of weapons to defeat your enemies through the cursed lands of Tolomera, in a pure classic arcade action style. [Xbox.com]… Expand"}, {"name": "Sam & Max Episode 101: Culture Shock", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-101-culture-shock", "publisher": "GameTap", "release_date": "Oct 18 2006", "developers": ["Telltale Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/6f0c768004238d27d34af1418e7542e5-98.jpg", "descriptions": "Culture Shock begins as Sam and Max discover that a group of former child stars have become involved in nefarious deeds. Only the six foot dog and his cunning rabbit companion can unravel the mystery! [Telltale Games]"}, {"name": "Overcooked!", "details_link": "https://www.metacritic.com/game/pc/overcooked!", "publisher": "Team17", "release_date": "Aug  3 2016", "developers": ["Ghost Town Games Ltd."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Action", "Simulation", "Arcade", "Virtual", "Career"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/a8b8d584314f1dee065d68b2a9f9c7ec-98.jpg", "descriptions": "Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook and serve up a variety of tasty orders before the baying customers storm out in a huff."}, {"name": "Child of Eden", "details_link": "https://www.metacritic.com/game/playstation-3/child-of-eden", "publisher": "Ubisoft", "release_date": "Sep 27 2011", "developers": ["Q Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Rail", "Rail", "Fantasy"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/d7d0cc83170586380658412c266e51a6-98.jpg", "descriptions": "Child of Eden thrusts the player into the center of a battle to save Project Lumi, a mission to reproduce a human personality inside Eden, the archive of all human memories. As the project nears completion, the archive is invaded by an unknown virus. The player's mission is to save Eden fromChild of Eden thrusts the player into the center of a battle to save Project Lumi, a mission to reproduce a human personality inside Eden, the archive of all human memories. As the project nears completion, the archive is invaded by an unknown virus. The player's mission is to save Eden from the virus, restoring hope and peace.… Expand"}, {"name": "Prince of Persia Classic Trilogy HD", "details_link": "https://www.metacritic.com/game/playstation-3/prince-of-persia-classic-trilogy-hd", "publisher": "Ubisoft", "release_date": "Apr 19 2011", "developers": ["Ubisoft"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Action Adventure", "Fantasy", "Compilation"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/c68af0fe91fad18bb64671e8735cf149-98.jpg", "descriptions": "Prince of Persia Trilogy contains Prince of Persia: The Sands of Time, Prince of Persia: Warrior Within and Prince of Persia: The Two Thrones."}, {"name": "Age of Empires IV", "details_link": "https://www.metacritic.com/game/pc/age-of-empires-iv", "publisher": "Microsoft Game Studios", "release_date": "Oct 28 2021", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/c647a457cc6e36f843c704d1592bb6c0-98.jpg", "descriptions": "The real-time strategy series returns to glory with Age of Empires IV, putting you at the center of epic historical battles that shaped the world. Featuring both familiar and innovative new ways to expand your empire in vast landscapes with stunning 4K visual fidelity, Age of Empires IVThe real-time strategy series returns to glory with Age of Empires IV, putting you at the center of epic historical battles that shaped the world. Featuring both familiar and innovative new ways to expand your empire in vast landscapes with stunning 4K visual fidelity, Age of Empires IV brings an evolved real-time strategy game to a new generation.\r Return to History – The past is prologue as you are immersed in a rich historical setting of 8 diverse civilizations across the world from the English to the Chinese to the Delhi Sultanate in your quest for victory. Build cities, manage resources, and lead your troops to battle on land and at sea in 4 distinct campaigns with 35 missions that span across 500 years of history from the Dark Ages up to the Renaissance.\r Choose Your Path to Greatness with Historical Figures – Live the adventures of Joan of Arc in her quest to defeat the English, or command mighty Mongol troops as Genghis Khan in his conquest across Asia. The choice is yours – and every decision you make will determine the outcome of history.\r Customize Your Game with Mods – Available in Early 2022, play how you want with user generated content tools for custom games.\r Challenge the World – Jump online to compete, cooperate or spectate with up to 7 of your friends in PVP and PVE multiplayer modes.\r An Age for All Players – Age of Empires IV is an inviting experience for new players with a tutorial system that teaches the essence of real-time strategy and a Campaign Story Mode designed for first time players to help achieve easy setup and success, yet is challenging enough for veteran players with new game mechanics, evolved strategies, and combat techniques.… Expand"}, {"name": "The Entropy Centre", "details_link": "https://www.metacritic.com/game/pc/the-entropy-centre", "publisher": "Playstack", "release_date": "Nov  3 2022", "developers": ["Stubby Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/e5d1af10fbd5b7e0d830de5fdf05c00c-98.jpg", "descriptions": "An extinction level event has set the world ablaze. You appear to be the last remaining person alive. Mankind's only hope lies at the core of the Entropy Centre. The Entropy Centre is a mind-bending puzzle adventure where you reverse objects through time to overcome seemingly impossibleAn extinction level event has set the world ablaze. You appear to be the last remaining person alive. Mankind's only hope lies at the core of the Entropy Centre. The Entropy Centre is a mind-bending puzzle adventure where you reverse objects through time to overcome seemingly impossible obstacles and conundrums. Manipulate time to your will and solve ingeniously challenging puzzle rooms, each one taking you closer to the heart of a colossal space station in orbit of Earth.\r Deviously challenging with razor-sharp witty writing and outstanding voice acting performances, The Entropy Centre merges a brilliant puzzle game with an epic adventure.… Expand"}, {"name": "Wo Long: Fallen Dynasty", "details_link": "https://www.metacritic.com/game/playstation-5/wo-long-fallen-dynasty", "publisher": "Koei Tecmo Games", "release_date": "Mar  3 2023", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Linear", "Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/af4668309f51915fde6ac9265db5d050-98.jpg", "descriptions": "Wo Long: Fallen Dynasty follows the dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms.  Players fight off deadly creatures and enemy soldiers using swordplay based on theWo Long: Fallen Dynasty follows the dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms.  Players fight off deadly creatures and enemy soldiers using swordplay based on the Chinese martial arts, attempting to overcome the odds by awakening the true power from within.… Expand"}, {"name": "Mirror's Edge", "details_link": "https://www.metacritic.com/game/pc/mirrors-edge", "publisher": "EA Games", "release_date": "Jan 12 2009", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Modern", "Action Adventure", "Modern", "General", "Modern"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/8400dc6cacb3a317bd479884b6f5b640-98.jpg", "descriptions": "In a city where information is heavily monitored, agile couriers called runners transport sensitive data away from prying eyes. In this seemingly utopian paradise, a crime has been committed, your sister has been framed and now you are being hunted. You are a runner called faith - and thisIn a city where information is heavily monitored, agile couriers called runners transport sensitive data away from prying eyes. In this seemingly utopian paradise, a crime has been committed, your sister has been framed and now you are being hunted. You are a runner called faith - and this innovative first-person action-adventure is your story. Flow is what keeps you running, what keeps you alive. Mirror's Edge delivers you straight into the shoes of this unique heroine as she traverses the vertigo-inducing cityscape, engaging in intense combat and fast paced chases. With a never before seen sense of movement and perspective, you will be drawn into Faith's world. A world that is visceral, immediate, and very dangerous. Live or die? Soar or plummet? One thing is certain: in this city you will learn how to run. [Electronic Arts]… Expand"}, {"name": "Street Fighter: 30th Anniversary Collection", "details_link": "https://www.metacritic.com/game/switch/street-fighter-30th-anniversary-collection", "publisher": "Capcom", "release_date": "May 29 2018", "developers": ["Capcom", "Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/5cec7e10332e4ef163aff9d68d51b7c7-98.jpg", "descriptions": "Celebrate the 30th Anniversary of the iconic Street Fighter franchise with the ultimate tribute to its arcade legacy in the Street Fighter 30th Anniversary Collection. This content-rich all-in-one package highlights the series' past in an anthology of 12 classic titles with arcade-perfectCelebrate the 30th Anniversary of the iconic Street Fighter franchise with the ultimate tribute to its arcade legacy in the Street Fighter 30th Anniversary Collection. This content-rich all-in-one package highlights the series' past in an anthology of 12 classic titles with arcade-perfect balancing including the original Street Fighter, Street Fighter II, Street Fighter II: Champion Edition, Street Fighter II: Hyper Fighting, Super Street Fighter II, Super Street Fighter II: Turbo, Street Fighter Alpha, Street Fighter Alpha 2, Street Fighter Alpha 3, Street Fighter III, Street Fighter III: 2nd Impact and Street Fighter III: Third Strike.The collection also offers a definitive online experience across four of the included titles; Street Fighter II: Hyper Fighting, Super Street Fighter II: Turbo, Street Fighter Alpha 3 and Street Fighter III: Third Strike. Street Fighter players can recreate the classic arcade gaming experience by competing against the CPU whilst waiting for friends in online battles where they can put their fighting skills to the ultimate test. Fans of the series can also enjoy diving into the past 30 years of Street Fighter history with rich character bios, a huge Museum Mode including never before seen art and interactive timeline, and listen to tracks in the Music Player.GAMEPLAY FEATURES:* Celebrate 30 years of the most iconic fighting game series The hit series with over 39 million units in global sales returns for its 30th anniversary celebration with a compilation of 12 classic arcade titles in one package.* Relive the titles that made gaming history Includes the original Street Fighter released in 1987 which introduced two of gaming's most famous heroes, Ryu and Ken. Additionally, the iconic Street Fighter II became the first ever one-on-one video game that gave players a choice of characters, including the debut of the series' strongest female Chun-Li. Street Fighter III continued the core numbered series and was the first game to introduce the parry attack.* New gameplay options including online play Players can utilize save states as they progress through the game offline. In addition, players can duke it out online in four classic titles (Street Fighter II: Hyper Fighting, Super Street Fighter II: Turbo, Street Fighter Alpha 3 and Street Fighter III: Third Strike). In addition to Ranked and Casual Match options, up to four players can join a lobby where they can play against the CPU while waiting for their match. Each title will have their own Global leaderboard and the \"rewind\" tech ensures low-latency online battles.* Hadoken your way down memory lane Revisit historic moments from the series and explore an interactive timeline of events that helped create one of the world's leading fighting game series. View stunning pieces of concept art and uncover little known facts behind each game release.* Learn more about fan-favorite characters Scroll through character bios and learn new details about series favorites whilst enjoying sprites and key animations to see how the classic fighters have evolved over time.* Remember the tunes! Sit back and enjoy the most memorable Street Fighter tracks from the collection in the Music Player.… Expand"}, {"name": "Danganronpa 2: Goodbye Despair", "details_link": "https://www.metacritic.com/game/playstation-vita/danganronpa-2-goodbye-despair", "publisher": "NIS America", "release_date": "Sep  2 2014", "developers": ["Spike Chunsoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Visual Novel"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/a97ced0a974f7597b533a9dc6199eaf4-98.jpg", "descriptions": "Jabberwock Island was, at one time, a popular tourist haunt. This now populated island remains oddly pristine. You and your classmates at the elite Hope's Peak Academy have been brought to this island by your cute teacher for a “lovey-dovey, heart-throbbing school trip.” Everyone seems to beJabberwock Island was, at one time, a popular tourist haunt. This now populated island remains oddly pristine. You and your classmates at the elite Hope's Peak Academy have been brought to this island by your cute teacher for a “lovey-dovey, heart-throbbing school trip.” Everyone seems to be having fun in the sun...until Monokuma returns to restart his murderous game! Trapped on this island of mutual killing, your only hope of escape rests in solving the island’s mysteries. But be warned—sometimes the truth can be its own despair. [NIS America]… Expand"}, {"name": "Persona 5 Strikers", "details_link": "https://www.metacritic.com/game/switch/persona-5-strikers", "publisher": "Sega", "release_date": "Feb 23 2021", "developers": ["Omega Force", "P-Studio"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/f638054f556f90cbae132b916f442065-98.jpg", "descriptions": "The sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gatherThe sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gather once more during their summer break to solve the mystery behind new change of heart cases that are occurring all over Japan! \r\rPersona 5 is now an action RPG!\rThe new action battle system makes hitting enemy weak points to activate a 1 More or All-Out Attack, which fans have come to love, even easier!\r You can even use Baton Pass to play as other characters!\rIn the newly introduced Jails, you can switch controls between characters at any time! Clear the game with style by using different characters in unique situations!\r \rNew character! \rWho is this new mysterious girl you meet in the Shibuya of the other world? Find out as she fights alongside you as the newest member of the Phantom Thieves of Hearts!… Expand"}, {"name": "FIFA Soccer 08", "details_link": "https://www.metacritic.com/game/playstation-3/fifa-soccer-08", "publisher": "EA Sports", "release_date": "Oct  9 2007", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/3361837066ef3a61613015e267a93ed4-98.jpg", "descriptions": "The FIFA Soccer 08 next-gen gameplay engine, built to maximize the power of Xbox 360 and PLAYSTATION 3, delivers animations and ball control that is so responsive you feel like you are actually on the pitch. Players in FIFA Soccer 08 now benefit from A.I. so smart, it features a 35-pointThe FIFA Soccer 08 next-gen gameplay engine, built to maximize the power of Xbox 360 and PLAYSTATION 3, delivers animations and ball control that is so responsive you feel like you are actually on the pitch. Players in FIFA Soccer 08 now benefit from A.I. so smart, it features a 35-point decision engine which enables players to process multiple decisions and reactions in real-time. The A.I.'s dynamic ‘Threat Map’ system captures the excitement and realism of soccer. Players are now aware of their surroundings, reacting authentically to threats and opportunities to make intelligent football decisions. A true next-generation ball-striking engine calculates shot success by combining an almost infinite number of different contexts, including ball spin, pressure from defenders, player attributes, and even air pressure to recreate the drama and unpredictable nature of shooting. A new play mode called Be A Pro locks you in the role of a single player and challenges you to master the same disciplines as a real soccer player—from positioning and tackling to reading the field and passing. FIFA Soccer 08 introduces skill moves with a true next-generation organic 'building-block' system enabling you to combine tricks and skill moves together to recreate signature moves from the real-world superstars or define your own style of play. Animations can be interrupted at any time to transition into a new move, enabling you to read and respond to the defence, just like real life. Master the skills to break down the defence, elude your marker and lead your team to victory. Represent your club online against your rivals throughout the season in the F.A. Premier League, Bundesliga, French League or Mexican 1st Division. When they play, you play. [Electronic Arts]… Expand"}, {"name": "Worms: Open Warfare 2", "details_link": "https://www.metacritic.com/game/ds/worms-open-warfare-2", "publisher": "THQ", "release_date": "Sep  4 2007", "developers": ["Team17", "Two Tribes"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/c41693879a3b746a199c9e5092e1e174-98.jpg", "descriptions": "Players can challenge others from all over the world via multiplayer battles using a wireless connection as they command their worms through clashes that take place in famous battles of the past, as well as fictional fights of the future. Battles include the Spanish Armada conquest inPlayers can challenge others from all over the world via multiplayer battles using a wireless connection as they command their worms through clashes that take place in famous battles of the past, as well as fictional fights of the future. Battles include the Spanish Armada conquest in \"Pirates!,\" the frontlines of real war in \"World War II\" and laser shooting spaceships in \"Space War!,\" among others. In addition to the classic Deathmatch mode, the game also includes robust new single and multiplayer modes such as Rope Race, Fort, Puzzle and Campaign modes that challenge players to use new strategies and teamwork to defeat their enemies. The new Firing Range allows gamers to test their weapons skills, including 11 new weapons like the Bunker Buster and Buffalo of Lies as well as classics such as the Super Sheep, Concrete Donkey and the Holy Hand Grenade. Gamers that take the battle online will be able to demonstrate their Worms combat prowess with daily updated stats and leaderboards on the official Worms website. Players will also enjoy the new, in-depth customization options including custom landscape and team flag editors in addition to modified hats, tombstones and victory dances for their worm teams. [THQ]… Expand"}, {"name": "RAGE", "details_link": "https://www.metacritic.com/game/playstation-3/rage", "publisher": "Bethesda Softworks", "release_date": "Oct  4 2011", "developers": ["id Software"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/e0f88f1a60f0b28c8206b42659cf3861-98.jpg", "descriptions": "An action game set in a post-apocalyptic landscape jam-packed with driving and shooting, created by John Carmack and the rest of the Doom crew."}, {"name": "TrackMania 2 Canyon", "details_link": "https://www.metacritic.com/game/pc/trackmania-2-canyon", "publisher": "Ubisoft", "release_date": "Sep 14 2011", "developers": ["Nadeo"], "platforms": "PC", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/8d155c252eb8c10bb821244004509185-98.jpg", "descriptions": "Trackmania 2 Canyon is a racing game by Nadeo."}, {"name": "Rainbow Billy: The Curse of the Leviathan", "details_link": "https://www.metacritic.com/game/switch/rainbow-billy-the-curse-of-the-leviathan", "publisher": "ManaVoid Entertainment Inc.", "release_date": "Oct  5 2021", "developers": ["ManaVoid Entertainment Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D"], "meta_score": 81, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/3d2bf74ce3644b860f22068876e1a01e-98.jpg", "descriptions": "Rainbow Billy: The Curse of the Leviathan is a wholesome, creature capture, 2.5D Adventure-Puzzle-Platformer with RPG elements. It is a family-friendly and openly accessible adventure in which you must save whimsical creatures by bringing back color to the world you once knew!\r RainbowRainbow Billy: The Curse of the Leviathan is a wholesome, creature capture, 2.5D Adventure-Puzzle-Platformer with RPG elements. It is a family-friendly and openly accessible adventure in which you must save whimsical creatures by bringing back color to the world you once knew!\r Rainbow Billy tells a universal coming of age story about dealing with changes in the world and accepting ourselves and the others around us! Sometimes it only takes a conversation, empathy, and a new point of view to make a world of a difference. EXPLORE A WONDROUS WORLD!\rFrom dark caverns on secret islands to hidden coves off in the stormy seas, explore a rich world filled with treasure, fish (because every great game has a fishing minigame!), friendship and... danger!\rSOLVE ENVIRONMENTAL PUZZLES!\rEach world is filled with clever challenges and secrets that unlock new areas to explore!\r BEFRIEND CURIOUS CREATURES!\rMeet over 60 strange, lovable creatures and help them with their problems in non-violent encounters! Create your own unique team to save the day!\r RECOLOR THE WORLD!\rRestore color to a monochrome world and help your friends find the courage to be their true selves in a story about empathy and growth.… Expand"}, {"name": "The Pathless", "details_link": "https://www.metacritic.com/game/pc/the-pathless", "publisher": "Giant Squid", "release_date": "Nov 12 2020", "developers": ["Giant Squid"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/f3924c42215acc66286b64ee05692e8f-98.jpg", "descriptions": "From the creators of ABZÛ, The Pathless is a mythic adventure game about an archer and an eagle in a vast forest. Become the Hunter, a master of archery who travels to a mystical island to dispel a curse of darkness that grips the world. Forge a connection with your eagle companion as youFrom the creators of ABZÛ, The Pathless is a mythic adventure game about an archer and an eagle in a vast forest. Become the Hunter, a master of archery who travels to a mystical island to dispel a curse of darkness that grips the world. Forge a connection with your eagle companion as you hunt corrupted spirits, but be careful not to become the hunted yourself. Explore misty forests full of secrets, solve puzzles in ancient ruins, and test your skill in epic battles. The bond with your eagle and the fate of the world hang in the balance. [Giant Squid]… Expand"}, {"name": "Gunvolt Chronicles: Luminous Avenger iX", "details_link": "https://www.metacritic.com/game/switch/gunvolt-chronicles-luminous-avenger-ix", "publisher": "Inti Creates", "release_date": "Sep 26 2019", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/b6388b7c2db0cffde8c9df17b2054fc8-98.jpg", "descriptions": "The hero, Copen, can dash into enemies to lock-on onto them so his shots never miss their mark. Put your ingenuity to the test, and you can use his \"Bullit Dash\" to fly through stages without touching the ground! You have many tools at your disposal, so make find a style that works for youThe hero, Copen, can dash into enemies to lock-on onto them so his shots never miss their mark. Put your ingenuity to the test, and you can use his \"Bullit Dash\" to fly through stages without touching the ground! You have many tools at your disposal, so make find a style that works for you and conquer each stage with style.… Expand"}, {"name": "Motorsport Manager", "details_link": "https://www.metacritic.com/game/pc/motorsport-manager", "publisher": "Sega", "release_date": "Nov  9 2016", "developers": ["Playsport Games", "Playsport Games Ltd"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "Virtual", "Career"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/a6d7ce829f012689ecb1a27ad166185b-98.jpg", "descriptions": null}, {"name": "Zero Escape: Zero Time Dilemma", "details_link": "https://www.metacritic.com/game/3ds/zero-escape-zero-time-dilemma", "publisher": "Aksys Games", "release_date": "Jun 28 2016", "developers": ["Spike Chunsoft", "Chime"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/34c57759a7cea8aa5314cffb24fe97d3-98.jpg", "descriptions": "Choice is your only method of salvation and your only method of escape. How much of your humanity will you sacrifice to gain your freedom? As a new age of ruin looms large on the horizon, you have to make impossible decisions and weather unimaginable consequences as you straddle the lineChoice is your only method of salvation and your only method of escape. How much of your humanity will you sacrifice to gain your freedom? As a new age of ruin looms large on the horizon, you have to make impossible decisions and weather unimaginable consequences as you straddle the line between absolution and damnation.… Expand"}, {"name": "WWE SmackDown vs. Raw 2010", "details_link": "https://www.metacritic.com/game/playstation-3/wwe-smackdown-vs-raw-2010", "publisher": "THQ", "release_date": "Oct 20 2009", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/d0a4e5cd361c65b1b49f462dd20054d5-98.jpg", "descriptions": "CREATE-A-SUPERSTAR REDESIGN - The franchise’s renowned customization interface delivers a new look, improved graphical quality and a host of new parts, allowing players to create Superstars who are comparable in quality with their WWE counterparts.  Take creation one step further with a newCREATE-A-SUPERSTAR REDESIGN - The franchise’s renowned customization interface delivers a new look, improved graphical quality and a host of new parts, allowing players to create Superstars who are comparable in quality with their WWE counterparts.  Take creation one step further with a new Paint Tool to detail created Superstars with original tattoos, logos and other unique designs. SHARE THE CREATIVITY - Share created content with the WWE Universe by uploading created Superstars, entrances, finishing moves, highlight reels, created storylines and more.  Utilize the keyword search engine to view created content from around the world and download for use both offline and online. SUPERSTAR THREADS - For the first time in franchise history, create alternate ring gear for Superstars by customizing the colors of shirts, logos, face paint, elbow pads, boots and much more.  Save the alternate looks for use throughout the game and online to show off the Superstars in grand fashion. [THQ]… Expand"}, {"name": "Marvel: Ultimate Alliance", "details_link": "https://www.metacritic.com/game/playstation-2/marvel-ultimate-alliance", "publisher": "Activision", "release_date": "Oct 24 2006", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 2"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/98e93a6ca41f52b6dda1e666e220e358-98.jpg", "descriptions": "Marvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine theMarvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine the fate of both planet Earth and the Marvel universe – revealed in one of multiple epilogues. Marvel: Ultimate Alliance offers total team customization, where players create their own team name, icon and vehicle, as well as establish their team reputation as they play throughout the story.  Gamers also have the option to level up each character individually to their liking, or all team members at the same time to keep their heroes balanced.  With the game's new combat system, players battle against the world's most notorious Marvel Super Villains in the air, underwater, and on the ground, using grappling, blocking and dodging moves, by charging up their Super Hero powers before unleashing them, and using environmental objects as one and two-handed weapons. Marvel:  Ultimate Alliance features a storyline where the missions players accept, the objectives they complete, and their interactions with other characters throughout the game directly impact how the story plays out. The game also features a robust multiplayer component where fans can band together with friends as their favorite Marvel Super Heroes, and fight evil in both on and offline cooperative story modes.  There's also a Competitive Mode where the game tracks various in-game stats so players can see how well they stack up against one another – affecting the amount of experience points earned and how equipment is distributed. [Activision]… Expand"}, {"name": "Capcom vs. SNK 2: Mark of the Millennium 2001", "details_link": "https://www.metacritic.com/game/playstation-2/capcom-vs-snk-2-mark-of-the-millennium-2001", "publisher": "Capcom", "release_date": "Nov  6 2001", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/bf052465cbb0d23c56be4c340414ab53-98.jpg", "descriptions": "Choose from over 44 characters from an arsenal of fighters from the Capcom and SNK fighting universes and customize your fighting style with even more fighting ?Grooves.? [Capcom]"}, {"name": "Onimusha: Dawn of Dreams", "details_link": "https://www.metacritic.com/game/playstation-2/onimusha-dawn-of-dreams", "publisher": "Capcom", "release_date": "Mar  7 2006", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 81, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/484a53fde72c0da2a9aad00c2c0a5986-98.jpg", "descriptions": "Onimusha: Dawn of Dreams begins approximately 15 years following the annihilation of the infamous Japanese warlord Oda Nobunaga at Honno Temple. Another dark shadow now looms over Japan as Nobunaga's successor, Hideyoshi Toyotomi, has decided to align himself with the evil Genma forces.Onimusha: Dawn of Dreams begins approximately 15 years following the annihilation of the infamous Japanese warlord Oda Nobunaga at Honno Temple. Another dark shadow now looms over Japan as Nobunaga's successor, Hideyoshi Toyotomi, has decided to align himself with the evil Genma forces. Assume the role of Soki, a young warrior who possesses incredible power, along with several other cohorts to try and thwart Hideyoshi's pursuit for power. [Capcom]… Expand"}, {"name": "Battlefield V", "details_link": "https://www.metacritic.com/game/pc/battlefield-v", "publisher": "Electronic Arts", "release_date": "Nov 15 2018", "developers": ["EA DICE"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 81, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/2/3acd46d6a3f2a24ef8b71520d5d0e221-98.jpg", "descriptions": "Enter mankind's greatest conflict with Battlefield 5 as the series goes back to its roots with a never-before-seen portrayal of World War 2. Lead your squad to victory with new ways to turn the battlefield to your advantage. Assemble your Company of customized soldiers, weapons, and vehiclesEnter mankind's greatest conflict with Battlefield 5 as the series goes back to its roots with a never-before-seen portrayal of World War 2. Lead your squad to victory with new ways to turn the battlefield to your advantage. Assemble your Company of customized soldiers, weapons, and vehicles then take them on an epic journey through the Tides of War. Experience the most intense, immersive Battlefield yet. You will never be the same.… Expand"}, {"name": "Mortal Kombat: Deception", "details_link": "https://www.metacritic.com/game/playstation-2/mortal-kombat-deception", "publisher": "Midway", "release_date": "Oct  4 2004", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/7e1ccb4bb4ae34ea5ccbbe942aa5261b-98.jpg", "descriptions": "Shocking and evil, Mortal Kombat: Deception pushes martial arts-style fighting and the Mortal Kombat franchise to new heights with an innovative fighting system, unparalleled depth and brutally intense action that will appeal to long-time Mortal Kombat fans as well as next-generation gamers.Shocking and evil, Mortal Kombat: Deception pushes martial arts-style fighting and the Mortal Kombat franchise to new heights with an innovative fighting system, unparalleled depth and brutally intense action that will appeal to long-time Mortal Kombat fans as well as next-generation gamers. The game features lightning-fast hand-to-hand and special weapons combat, secret and returning characters, moves and combinations with new death-dealing battles and fatalities. With a host of new features including multiple fatalities per character, multi-tiered interactive backgrounds and extensive new game modes, Mortal Kombat: Deception will set a precedent for all other fighting games to follow. [Midway]… Expand"}, {"name": "The Vanishing of Ethan Carter", "details_link": "https://www.metacritic.com/game/playstation-4/the-vanishing-of-ethan-carter", "publisher": "The Astronauts", "release_date": "Jul 14 2015", "developers": ["The Astronauts"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "General", "Adventure", "3D", "First-Person"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/91b455e998516f2767e01cccbe30b35e-98.jpg", "descriptions": "The Vanishing of Ethan Carter is a first-person story-driven mystery focused on exploration and discovery. As occult-minded private detective Paul Prospero communicates with the dead to discover the fate of a missing boy and the mystery behind a dark ancient force inhabiting Red Creek Valley."}, {"name": "Syberia: The World Before", "details_link": "https://www.metacritic.com/game/pc/syberia-the-world-before", "publisher": "Microids", "release_date": "Mar 18 2022", "developers": ["Microids", "Koalabs"], "platforms": ["PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/246b29ab6b7ad8d505eb8064ec746f69-98.jpg", "descriptions": "Embark on a journey across continents and through time, as you piece together the puzzle of a life."}, {"name": "Pokemon FireRed Version", "details_link": "https://www.metacritic.com/game/game-boy-advance/pokemon-firered-version", "publisher": "Nintendo", "release_date": "Sep  7 2004", "developers": ["Game Freak"], "platforms": "Game Boy Advance", "num_players": "1-5 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/af0b6ad13cdef1ad64fc95926b11c2fe-98.jpg", "descriptions": "Pokémon Fire Red adds more content and features to one of the first Pokémon games ever released. In this version of the classic role-playing game, you can collect all of the monsters from different Pokémon installments, including Ruby, Sapphire, and Colosseum. The gamePokémon Fire Red adds more content and features to one of the first Pokémon games ever released. In this version of the classic role-playing game, you can collect all of the monsters from different Pokémon installments, including Ruby, Sapphire, and Colosseum. The game comes with a wireless adapter, which lets you connect with your friends' Game Boy Advances to chat, trade Pokémon, and participate in battles. Other new features include a tutorial mode, a recap system, minigames, and more. … Expand"}, {"name": "NBA 2K6", "details_link": "https://www.metacritic.com/game/xbox-360/nba-2k6", "publisher": "2K Sports", "release_date": "Nov 16 2005", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/b0871bfececadab50b6e38c9b3ba991f-98.jpg", "descriptions": "Shot Stick -- Control the direction of your shot with the right analog stick. Pull off runners, fade-aways, finger rolls and dunks with a flick of the stick. Dual Player Control -- Set teammates into motion for alley-oops, give and gos, or to hit an open man for a 3 point play with the touchShot Stick -- Control the direction of your shot with the right analog stick. Pull off runners, fade-aways, finger rolls and dunks with a flick of the stick. Dual Player Control -- Set teammates into motion for alley-oops, give and gos, or to hit an open man for a 3 point play with the touch of the d-pad. Strip n Rip System -- Direction specific stealing controls let players anticipate passes by jumping into passing lanes to deflect or intercept a pass, as well as, strip the ball from a player driving to the hoop or a player with weak hands coming down with the rebound. V.I.P. System -- After your game, save your friends’ profiles to compete when they’re not available! Learn their tendencies, moves, & logic for more heated battles. Get the upper hand in an online tournaments by downloading other players’ VIP profiles. The Crib -- New to NBA 2K6 this year, you can now earn crib credits with every game you play to deck out your crib, buy music, or play mini-games. 24/7: Road to the EBC  -- Take to the streets of Harlem in the Entertainer's Basketball Classic to play against NBA players and Def Jam Celebrities including Red Man, Method Man, Flavor Flav, and many other special guests. [2K Games]… Expand"}, {"name": "Mini Motorways", "details_link": "https://www.metacritic.com/game/switch/mini-motorways", "publisher": "Dinosaur Polo Club", "release_date": "May 11 2022", "developers": ["Dinosaur Polo Club"], "platforms": ["iPhone/iPad", "PC", "Switch"], "genres": ["Strategy", "General", "Management", "Government"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/118282a4aefdee5c3e7a0957cbb9e4e2-98.jpg", "descriptions": "Have you ever been stuck in traffic and wished you could do something to fix it?In Mini Motorways, the city's traffic problems are in your hands.\n\nFrom the makers of Mini Metro, Mini Motorways is a game about drawing the roads that drive a growing city. Build a road network, one road at aHave you ever been stuck in traffic and wished you could do something to fix it?In Mini Motorways, the city's traffic problems are in your hands.From the makers of Mini Metro, Mini Motorways is a game about drawing the roads that drive a growing city. Build a road network, one road at a time, to create a bustling metropolis. Redesign your city to keep the traffic flowing, and carefully manage upgrades to meet the changing demands. How long can you keep the cities of the world moving?… Expand"}, {"name": "My Friend Pedro", "details_link": "https://www.metacritic.com/game/pc/my-friend-pedro", "publisher": "Devolver Digital", "release_date": "Jun 20 2019", "developers": ["DeadToast Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/50a8acc7010b8a994c139cff1f1c69ca-98.jpg", "descriptions": "My Friend Pedro is a violent ballet about friendship and imagination where players strategically bounce bullets off frying pans and jump through windows in slow motion."}]