[{"name": "Star Trek: Armada II", "details_link": "https://www.metacritic.com/game/pc/star-trek-armada-ii", "publisher": "Activision", "release_date": "Nov 12 2001", "developers": ["Mad Doc Software"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/ad6b81877b7b4c0129fae22cc4fa7ded-98.jpg", "descriptions": "Takes the concept of its predecessor to it's logical conclusion by allowing the player to experience the game in a full 3D mode, so the battles and elements of space conquest and exploration take on the vividness of the best of Star Trek. With over 45 new ship classes, 22 new specialTakes the concept of its predecessor to it's logical conclusion by allowing the player to experience the game in a full 3D mode, so the battles and elements of space conquest and exploration take on the vividness of the best of Star Trek. With over 45 new ship classes, 22 new special weapons, over 30 new stations, building a devastating armada has been taken to a new level. [Activision]… Expand"}, {"name": "Stupid Invaders", "details_link": "https://www.metacritic.com/game/pc/stupid-invaders", "publisher": "Ubisoft", "release_date": "Feb 21 2001", "developers": ["Xilam"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/a2b45fcd42df2b4ecbb5f0aac4df9f7f-98.jpg", "descriptions": "State-of-the-art toilet humor! First graphic adventure to fully exploit next-gen graphics and sound hardware capabilities. Strong emphasis on humor, inspired by popular culture, Monty Python, X-Files, etc. Movie quality animations and cut scenes with full voice-overs.  [Ubi Soft]"}, {"name": "Battleship: Surface Thunder", "details_link": "https://www.metacritic.com/game/pc/battleship-surface-thunder", "publisher": "Hasbro Interactive", "release_date": "Oct 15 2000", "developers": ["Meyer / Glass Interactive"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "General", "General", "Board / Card Game"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/37a5fe3f83579768d8ccca8ad21f35b4-98.jpg", "descriptions": "Battle stations! Battleship: Surface Thunder is now a fast-action, 3-D naval adventure. Now you can take command of your own battleship and sink enemy convoys, attack shore gun emplacements, and free captured ports in an all-out effort to defeat a renegade empire.  [Hasbro Interactive]"}, {"name": "LEGO The Incredibles", "details_link": "https://www.metacritic.com/game/switch/lego-the-incredibles", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 15 2018", "developers": ["TT Games", "TT Fusion"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/2001e94f63887c661a0f0525c5e61456-98.jpg", "descriptions": "LEGO The Incredibles takes players on a fun-filled adventure where they'll control their favorite Incredibles characters and team up as a family to conquer crime and family life. Reimagined in LEGO form and featuring TT Games' signature LEGO humor, the game recreates scenes and actionLEGO The Incredibles takes players on a fun-filled adventure where they'll control their favorite Incredibles characters and team up as a family to conquer crime and family life. Reimagined in LEGO form and featuring TT Games' signature LEGO humor, the game recreates scenes and action sequences from both Incredibles movies.\r … Expand"}, {"name": "MXGP2: The Official Motocross Videogame", "details_link": "https://www.metacritic.com/game/playstation-4/mxgp2-the-official-motocross-videogame", "publisher": "Milestone S.r.l", "release_date": "Jun 21 2016", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 65, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/3e66046e002af214d8e4992ecb922ade-98.jpg", "descriptions": "MXGP2 is the evolution of the Official Motocross Videogame experience, based on the FIM Motocross World Championship license with updated tracks and riders, including Glen Helen and the new Americas tracks. Players also have the chance to ride in two brand new indoor stadiums to test theirMXGP2 is the evolution of the Official Motocross Videogame experience, based on the FIM Motocross World Championship license with updated tracks and riders, including Glen Helen and the new Americas tracks. Players also have the chance to ride in two brand new indoor stadiums to test their riding abilities and take part, for the first time in a cross videogame, in the Monster Energy FIM Motocross of Nations. Customise every part of your bike, rider, and team, and hone your stills in test track performances. … Expand"}, {"name": "Rustler", "details_link": "https://www.metacritic.com/game/pc/rustler", "publisher": "Jutsu Games", "release_date": "Aug 31 2021", "developers": ["Jutsu Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/62711dfc6fb34441a40fed1f40bcf9ff-98.jpg", "descriptions": "Become a medieval thug in a crazy open-world action game, full of pop-culture references. Complete insane quests, kill heroes, steal horses, fight guards, rob peasants, listen to some bard music, and much more! All packed in old-school gameplay style!"}, {"name": "Final Fantasy XV: Episode Prompto", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xv-episode-prompto", "publisher": "Square Enix", "release_date": "Jun 27 2017", "developers": ["Square Enix"], "platforms": ["Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/3aa541939a2571076715c3d21f3635f6-98.jpg", "descriptions": "It's time for Prompto to take centre stage in his very own episode. Become the cheerful gunslinger himself and experience a brand new storyline, wrapped in thrilling Third Person Shooter gameplay. Separated from the group in a harsh arctic environment, Prompto heads off to the place of hisIt's time for Prompto to take centre stage in his very own episode. Become the cheerful gunslinger himself and experience a brand new storyline, wrapped in thrilling Third Person Shooter gameplay. Separated from the group in a harsh arctic environment, Prompto heads off to the place of his birth to uncover the truth of his mysterious origins. [Square Enix]… Expand"}, {"name": "Mystery Case Files: MillionHeir", "details_link": "https://www.metacritic.com/game/ds/mystery-case-files-millionheir", "publisher": "Nintendo", "release_date": "Sep  8 2008", "developers": ["Griptonite Games"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Puzzle", "General", "Hidden Object", "Puzzle"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7272f27895056c787a94a7af352773a6-98.jpg", "descriptions": "Mystery Case Files: MillionHeir uses the unique Nintendo DS interface to expand upon the seek-and-solve game play of the popular series from Big Fish Games. Players seek out cleverly hidden items in a multitude of painted scenes. Players progress through an interactive detective storyMystery Case Files: MillionHeir uses the unique Nintendo DS interface to expand upon the seek-and-solve game play of the popular series from Big Fish Games. Players seek out cleverly hidden items in a multitude of painted scenes. Players progress through an interactive detective story investigating a cast of characters and uncovering new evidence to find the rightful heir to a million-dollar fortune. This new portable installment is available only for Nintendo DS. With interactive logic puzzles that use both the touch-screen interface and built-in microphone and include the first ever multiplayer mode for a Mystery Case Files game, Mystery Case Files: MillionHeir presents a new generation of seek-and-solve games for casual gamers and franchise fans. [Nintendo]… Expand"}, {"name": "Pirates of the Caribbean", "details_link": "https://www.metacritic.com/game/xbox/pirates-of-the-caribbean", "publisher": "Bethesda Softworks", "release_date": "Jul  1 2003", "developers": ["Akella"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/c5f53d41ac42267b05ec0db897e358f0-98.jpg", "descriptions": "The ruthless Captain Barbossa rules the high seas with treasures beyond your wildest dreams.  As rogue pirate Jack Sparrow, your mission is to collect enough wealth to lead an attack against the dark captain and his band of undead.  Fight, cheat, and steal your way through 20 missions filledThe ruthless Captain Barbossa rules the high seas with treasures beyond your wildest dreams.  As rogue pirate Jack Sparrow, your mission is to collect enough wealth to lead an attack against the dark captain and his band of undead.  Fight, cheat, and steal your way through 20 missions filled with hidden treasures.  Among the weapons you'll have to fight your foes are cannons, artillery, and swords.  If you have what it takes, you'll soon unravel the mystery of the treacherous skeleton crew.  … Expand"}, {"name": "The Red Lantern", "details_link": "https://www.metacritic.com/game/switch/the-red-lantern", "publisher": "Timberline Studio", "release_date": "Oct 22 2020", "developers": ["Timberline Studio"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 65, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/c6eb806456b2ff8c68a299c24dc9f5bd-98.jpg", "descriptions": "The Red Lantern is a story-driven, rogue-lite, survival game where you and your team of 5 sled dogs, lost in the wilderness, must navigate the ever-changing encounters of the Alaskan bush to find your way home. Features:\r- A dynamic world that changes as you play\r- Nearly 100 differentThe Red Lantern is a story-driven, rogue-lite, survival game where you and your team of 5 sled dogs, lost in the wilderness, must navigate the ever-changing encounters of the Alaskan bush to find your way home. Features:\r- A dynamic world that changes as you play\r- Nearly 100 different encounters each with varied results\r- Gain items and upgrades as you discover things about the world around you\r- 8 different pups to add to your team, each with their own personalities.… Expand"}, {"name": "The LEGO Movie 2 Videogame", "details_link": "https://www.metacritic.com/game/xbox-one/the-lego-movie-2-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb 26 2019", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 65, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/9489b775bdf98be1fa44119368437671-98.jpg", "descriptions": "The alien monster invaders have left Bricksburg in ruins. It is now up to Emmet and a host of heroic characters to go beyond their world and save their friends from the strange inhabitants of the Systar System. Players can journey into outer space, discover new worlds, and test their MasterThe alien monster invaders have left Bricksburg in ruins. It is now up to Emmet and a host of heroic characters to go beyond their world and save their friends from the strange inhabitants of the Systar System. Players can journey into outer space, discover new worlds, and test their Master Building skills. … Expand"}, {"name": "88 Heroes: 98 Heroes Edition", "details_link": "https://www.metacritic.com/game/switch/88-heroes-98-heroes-edition", "publisher": "Rising Star Games", "release_date": "Oct 10 2017", "developers": ["Bitmap Bureau"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/644cf1fc875e2353eefd8293f733fbcc-98.jpg", "descriptions": "88 Heroes is a chaotic 2D platformer that is as fun to watch as it is to play, where each level completed or untimely death brings a new uniquely skilled hero into the action. With just 88 minutes to complete all 88 levels, youll need every one of the 88 heroes to stop the dastardly Dr. H888 Heroes is a chaotic 2D platformer that is as fun to watch as it is to play, where each level completed or untimely death brings a new uniquely skilled hero into the action. With just 88 minutes to complete all 88 levels, youll need every one of the 88 heroes to stop the dastardly Dr. H8 destroying the Earth! Are you up to the challenge?… Expand"}, {"name": "Kick & Fennick", "details_link": "https://www.metacritic.com/game/playstation-vita/kick-fennick", "publisher": "Green Hill", "release_date": "Feb  5 2015", "developers": ["Jaywalkers Interactive"], "platforms": ["PlayStation 4", "Wii U", "Xbox One", "PlayStation Vita"], "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/1dbb3afa6e2e7d89961e34eace7acefe-98.jpg", "descriptions": "Kick and Fennick is a a mellow platform adventure about Kick, a boy with a very big gun, and a small, flying robot named Fennick. Dare great heights, and time your jumps just right to accomplish amazing feats."}, {"name": "Heroes Over Europe", "details_link": "https://www.metacritic.com/game/pc/heroes-over-europe", "publisher": "Ubisoft", "release_date": "Sep  8 2009", "developers": ["Atari", "Transmission Games", "Atari SA"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/718bba99f37ebee6249a826120e43b92-98.jpg", "descriptions": "Developed by Transmission Games in Melbourne, Australia, and powered by an all-new engine, Heroes Over Europe promises to raise the bar for flight combat games with the all new \"Ace Kill\" close combat action, four online modes supporting up to 16 players and fully customizable aircrafts withDeveloped by Transmission Games in Melbourne, Australia, and powered by an all-new engine, Heroes Over Europe promises to raise the bar for flight combat games with the all new \"Ace Kill\" close combat action, four online modes supporting up to 16 players and fully customizable aircrafts with localized damage. Visually, the game takes no prisoners with meticulously rendered environments including faithful recreations of London, Berlin and the French Alps, and ultra-realistic iconic warplanes of the era, all presented in stunning high definition graphics. [Ubisoft]… Expand"}, {"name": "Barrow Hill: Curse of the Ancient Circle", "details_link": "https://www.metacritic.com/game/pc/barrow-hill-curse-of-the-ancient-circle", "publisher": "Got Game Entertainment", "release_date": "Aug 25 2006", "developers": ["Shadow Tor Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "Modern", "Third-Person", "Modern"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/c3a198521dc0c480016d075db151836c-98.jpg", "descriptions": "Somewhere deep within the woods a timeless force is stirring. Beneath the ancient burial mound, known locally as Barrow Hill, a forgotten myth awakes. Join the adventure, and uncover the secrets of the past. The legends of the Cornish world will live again; renewed, refreshed and hungry.Somewhere deep within the woods a timeless force is stirring. Beneath the ancient burial mound, known locally as Barrow Hill, a forgotten myth awakes. Join the adventure, and uncover the secrets of the past. The legends of the Cornish world will live again; renewed, refreshed and hungry. Time has no meaning, as the sun sets low across the landscape. Stranded on the lonely road, which leads up to the Barrow, you must make your way through the trees, and darkening landscape, and out onto the Barrow itself. Following in the footsteps of the well-known archaeologist, Conrad Morse, you will discover that the barrow is more than just a mound of earth and a collection of forgotten standing stones. However, not all archaeology is constructive, for some things should be left buried and undisturbed. Perhaps it is too late for that... [Shadow Tor]… Expand"}, {"name": "Saints Row: Gat Out of Hell", "details_link": "https://www.metacritic.com/game/xbox-one/saints-row-gat-out-of-hell", "publisher": "Deep Silver", "release_date": "Jan 20 2015", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/47f50aac927398af4b7e528aeb9d54f9-98.jpg", "descriptions": "Get with Johnny Gat & Kinzie Kensington as you tear apart Hell in a mission to save the Boss’ soul. Historic icons, old friends, older enemies, a talking gun, a full length musical number and more shenanigans await you."}, {"name": "Harvest Moon DS: Island of Happiness", "details_link": "https://www.metacritic.com/game/ds/harvest-moon-ds-island-of-happiness", "publisher": "Natsume", "release_date": "Aug 26 2008", "developers": ["TOSE"], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Breeding/Constructing", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/8e1a3e75ec7315546868ee59fef37b11-98.jpg", "descriptions": "You're shipwrecked on a deserted island. Starting with an abandoned farm, a handful of seeds, and the determination to start a new life, it's up to you to tame the land and make the island prosper. By farming crops, raising animals, and mining for precious gems, you'll help the island growYou're shipwrecked on a deserted island. Starting with an abandoned farm, a handful of seeds, and the determination to start a new life, it's up to you to tame the land and make the island prosper. By farming crops, raising animals, and mining for precious gems, you'll help the island grow into a vibrant town bustling with people, businesses, and eligible bachelors and bachelorettes. Are you a good enough farmer to turn this island into a paradise? Play as a boy or as a girl. Attract settlers by building your farm. Fall in love and start a family. Explore the biggest portable Harvest Moon ever. Compete against other ranchers via Nintendo Wi-Fi Connection. [Natsume]… Expand"}, {"name": "Dragon Age II: Legacy", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-age-ii-legacy", "publisher": "Electronic Arts", "release_date": "Jul 26 2011", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "PC-style RPG", "Action RPG"], "meta_score": 65, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/6/87bea1539c11bfe33ec1f1dd68c12855-98.jpg", "descriptions": "Dragon Age II: Legacy is the first major story-based DLC for the PS3, 360, and PC."}, {"name": "Legion Arena", "details_link": "https://www.metacritic.com/game/pc/legion-arena", "publisher": "Strategy First", "release_date": "Nov 22 2005", "developers": ["Slitherine"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/0ca397d8a8be7ab1f88a77e17438ab80-98.jpg", "descriptions": "Legion Arena puts you the player in charge of a Roman army and takes you up against the enemies of Rome. You must recruit & train up your troops, choosing the skills they will develop in an effort to create the most powerful army. Games will be played entirely online & all results are passedLegion Arena puts you the player in charge of a Roman army and takes you up against the enemies of Rome. You must recruit & train up your troops, choosing the skills they will develop in an effort to create the most powerful army. Games will be played entirely online & all results are passed back to the server and logged and the player?s army ranked. And the best part is? it?s free! The player?s army starts small?really small! In fact to start with it only includes the player?s general character. The player also starts with a small treasury and can choose which units to recruit into their fledgling army. Initially you wont be able to afford too many troops & the higher quality units like Legionaries & Praetorians will be well out of reach. As the player fights and wins battles, their men gain experience & honours. These can be used to buy skills for the squad, ranging from improved weapons handling to the ability to hold a new formation. [Slitherine]… Expand"}, {"name": "Torchlight III", "details_link": "https://www.metacritic.com/game/pc/torchlight-iii", "publisher": "Perfect World Entertainment", "release_date": "Oct 13 2020", "developers": ["Echtra Games", "Inc."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 40 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/0/b4849c519e7aca914b3d52d2eadd27be-98.jpg", "descriptions": "In Torchlight III, Novastraia is again under threat of invasion and it’s up to you to defend against the Netherim and its allies. Gather your wits and brave the frontier to find fame, glory, and new adventures."}, {"name": "Squad Assault: Second Wave", "details_link": "https://www.metacritic.com/game/pc/squad-assault-second-wave", "publisher": "Merscom LLC", "release_date": "Aug 31 2005", "developers": ["Freedom LLC"], "platforms": "PC", "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/576a00937374199150ace687c2b406d3-98.jpg", "descriptions": "Your men need your strategic mind and unwavering nerve as battles rage in this riveting recreation of World War II tactical combat. Command troops in both the Allied and German Armies of the West Front of World War II in an immersive full 3D continuous time environment. Once the battleYour men need your strategic mind and unwavering nerve as battles rage in this riveting recreation of World War II tactical combat. Command troops in both the Allied and German Armies of the West Front of World War II in an immersive full 3D continuous time environment. Once the battle starts, the soldiers you command respond with real reactions to the combat situations around them. Detailed models for all the major armies that fought in France in 1944, including American, German, British, Canadian, and Free French, combine with unsurpassed detail in terrain, weather, weapons, vehicles, and armor penetration to make Squad Assault: Second Wave a first-rate military strategy game. [Got Game]… Expand"}, {"name": "Dungeons", "details_link": "https://www.metacritic.com/game/pc/dungeons", "publisher": "Kalypso", "release_date": "Feb 10 2011", "developers": ["Realmforge Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 65, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/eb729f2c8293ff729d239e266b3f38eb-98.jpg", "descriptions": "Dungeons follows the mis-adventures of the foremost of all Dungeon Lords, who spends his time luring heroes into his labyrinthine creations with the promise of treasure and a good fight - only to be trapped by his ingenious devices. Once they are in his grasp, our Dungeon Lord must lookDungeons follows the mis-adventures of the foremost of all Dungeon Lords, who spends his time luring heroes into his labyrinthine creations with the promise of treasure and a good fight - only to be trapped by his ingenious devices. Once they are in his grasp, our Dungeon Lord must look after and cherish his new found prisoners until they are more comfortable with their surroundings because come the \"harvest\", happy heroes have more precious soul energy for you to gleefully extract via foul prisons or twisted torture chambers!… Expand"}, {"name": "Last Stop", "details_link": "https://www.metacritic.com/game/playstation-5/last-stop", "publisher": "Annapurna Interactive", "release_date": "Jul 22 2021", "developers": ["Variable State"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 65, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/b388ccfebf61b368fe7ae1571565e4c3-98.jpg", "descriptions": "Last Stop is a single-player third-person narrative adventure game set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis. An anthology drama, Last Stop is three stories in one. What connects these three strangers?Last Stop is a single-player third-person narrative adventure game set in present day London, where you play as three separate characters whose worlds collide in the midst of a supernatural crisis. An anthology drama, Last Stop is three stories in one. What connects these three strangers? Where will fate lead them?… Expand"}, {"name": "Super Blood Hockey", "details_link": "https://www.metacritic.com/game/switch/super-blood-hockey", "publisher": "Digerati Distribution", "release_date": "Apr 26 2019", "developers": ["Loren Lemcke", "Kittehface Software"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Team", "Ice Hockey", "Arcade"], "meta_score": 65, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/5e5262cd3c92b39e64b58a8bbfd2317e-98.jpg", "descriptions": "Relive the golden age of arcade sports gaming with Super Blood Hockey — A violent homage to classic 8-bit and 16-bit ice hockey games. Now featuring the Franchise Mode update."}, {"name": "Brawlout", "details_link": "https://www.metacritic.com/game/xbox-one/brawlout", "publisher": "Angry Mob Games", "release_date": "Aug 21 2018", "developers": ["Angry Mob Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Beat-'Em-Up", "Action", "Fighting", "2D"], "meta_score": 65, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/cc20d4a51fae833bded69ad67a5bb4f5-98.jpg", "descriptions": "Brawlout packs a punch with couch and online play modes, blending platform fighter mechanics and traditional fighting game play into a stylish and fluid battle royale. Rather than slow-paced defensive battles, Brawlout goes all-out with the lightning-fast aerobatics which platform fightersBrawlout packs a punch with couch and online play modes, blending platform fighter mechanics and traditional fighting game play into a stylish and fluid battle royale. Rather than slow-paced defensive battles, Brawlout goes all-out with the lightning-fast aerobatics which platform fighters are famous for. Striking the balance between the growing competitive scene and the genre’s party game roots, Brawlout hopes to cater to the veteran platform fighter, the casual fan and the newcomer looking to make their mark. … Expand"}, {"name": "Gretzky NHL 06", "details_link": "https://www.metacritic.com/game/psp/gretzky-nhl-06", "publisher": "SCEA", "release_date": "Oct  4 2005", "developers": ["Page 44 Studios"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/cd8b704f2cbfeab16bcbd804391c06f3-98.jpg", "descriptions": "Gretzky NHL 2006 for PSP hits the virtual ice with two all-new modes, 3-on-3 and Ladder, which offer gamers a quick arcade-style experience.  Returning features include Quick Game, Exhibition and Season Modes, along with a revamped shot meter for the perfect one-timer.  For gamers on the go,Gretzky NHL 2006 for PSP hits the virtual ice with two all-new modes, 3-on-3 and Ladder, which offer gamers a quick arcade-style experience.  Returning features include Quick Game, Exhibition and Season Modes, along with a revamped shot meter for the perfect one-timer.  For gamers on the go, Gretzky NHL 2006 for PSP offers multiplayer gameplay locally via Ad Hoc Mode, or across the nation via Infrastructure Mode. [SCEA]… Expand"}, {"name": "The Adventures of Jimmy Neutron Boy Genius: Attack of the Twonkies", "details_link": "https://www.metacritic.com/game/gamecube/the-adventures-of-jimmy-neutron-boy-genius-attack-of-the-twonkies", "publisher": "THQ", "release_date": "Sep 13 2004", "developers": ["THQ"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/2e70fb4e7af29513447c3af60abd3f53-98.jpg", "descriptions": "Jimmy Neutron sets off on another adventure filled with brand-new inventions and gadgets. Aliens from Twonkus-3--the annual comet that passes over Retroville--have overrun the town, threatening everything in their path. When the aliens hear music, they become agitated and grow even larger.Jimmy Neutron sets off on another adventure filled with brand-new inventions and gadgets. Aliens from Twonkus-3--the annual comet that passes over Retroville--have overrun the town, threatening everything in their path. When the aliens hear music, they become agitated and grow even larger. As Jimmy, it's up to you to figure out combinations of everyday items and turn them into inventions that will defeat the Twonkus-3 aliens. Secret gizmos hidden throughout each level give you enhanced power-ups.… Expand"}, {"name": "Aliens vs. Predator", "details_link": "https://www.metacritic.com/game/playstation-3/aliens-vs-predator", "publisher": "Sega", "release_date": "Feb 16 2010", "developers": ["Rebellion"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 18 ", "genres": ["Action", "General", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/fb5be38d9a3385484e6c25a8a0055617-98.jpg", "descriptions": "Developed at Rebellion by the team responsible for the original 1999 PC classic, the all-new Aliens vs. Predator allows players to take the role of three infamous species: Colonial Marines, Predators and Aliens. The game features a unique three-way online multiplayer experience, allowingDeveloped at Rebellion by the team responsible for the original 1999 PC classic, the all-new Aliens vs. Predator allows players to take the role of three infamous species: Colonial Marines, Predators and Aliens. The game features a unique three-way online multiplayer experience, allowing gamers to battle for survival and the right to be crowned the deadliest species in the galaxy. Each race also has its own distinct action-packed single-player campaign mode, with a storyline that cleverly interweaves with the other two species’ paths. Set on planet BG-386; a human colonist mining group discovers an ancient pyramid containing a dark and horrible secret. Across the galaxy, a race of warriors is alerted to the discovery of their pyramid and a hunting party is dispatched to ensure that it remains sealed at all costs. Deep inside the ruined pyramid meanwhile, nature's deadliest species awakes from centuries of hibernation intent on finding new prey. The Colonial Marine's story is an incredible fight against all odds from horrors lurking in the dark. Surrounded on all sides yet armed to the teeth, the Colonial Marine represents humanity's last stand with the firepower to fight back. As the Alien, players discover what it's like to be the scariest, most murderous creature in the universe, with the ability to traverse any surface at lightning speed in order to get close enough to unleash its deadly claws, tail and teeth. A master of the hunt, the Predator grants the player an arsenal of exotic weaponry with which to stalk from the shadows. Earn the greatest honor by ambushing prey up-close, before butchering them for a gory trophy kill. [Sega]… Expand"}, {"name": "Immortal Planet", "details_link": "https://www.metacritic.com/game/pc/immortal-planet", "publisher": "teedoubleuGAMES", "release_date": "Jul 27 2017", "developers": ["teedoubleuGAMES"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/91766a9c629ae15286cd4b6b92869687-98.jpg", "descriptions": "Immortal Planet is an action RPG with challenging combat that rewards patience and punishes recklessness. Explore the crumbling remains of a society of immortals trapped in endless cycles of rebirth. Fight your way to discover the planet's mystery and escape its curse."}, {"name": "Kung Fu Rabbit", "details_link": "https://www.metacritic.com/game/wii-u/kung-fu-rabbit", "publisher": "Neko Entertainment", "release_date": "May  2 2013", "developers": ["Neko Entertainment", "Bulkypix"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/da32cf44abea23d59074bb07300a1b3b-98.jpg", "descriptions": "Life in the temple of rabbits hangs by a thread. Universal evil has struck again and kidnapped all of your disciples. Only you managed to escape. They let you live... and they'll soon regret it!\r Use your agility and combat skills to save your disciples! Jump from roof to roof, slideLife in the temple of rabbits hangs by a thread. Universal evil has struck again and kidnapped all of your disciples. Only you managed to escape. They let you live... and they'll soon regret it!\r Use your agility and combat skills to save your disciples! Jump from roof to roof, slide gracefully along walls, sneak up on your enemies and then rip them to shreds!\r Detailed graphics, humour, hours of gameplay and intuitive controls. Each level requires logic, precision, agility and lots of sabre rattling. The game also has plenty of trophies to win, babies to save, carrots to eat and a universal evil to expunge!\r - 80 levels in normal and hard mode, providing dozen of hours of play!\r - 15 unlockable items to customise your rabbit… Expand"}, {"name": "Dillon's Rolling Western", "details_link": "https://www.metacritic.com/game/3ds/dillons-rolling-western", "publisher": "Nintendo", "release_date": "Feb 22 2012", "developers": ["Vanpool"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/aa635e02b49262ce26ca447c0385fb26-98.jpg", "descriptions": "Dillons Rolling Western is a character driven action game with tower defense elements.\r Armadillo ranger Dillon leaps into action at the touch of the stylus, using his rolling attack skills to defend frontier villages from waves of invading rock monsters. During the day, Dillon collectsDillons Rolling Western is a character driven action game with tower defense elements.\r Armadillo ranger Dillon leaps into action at the touch of the stylus, using his rolling attack skills to defend frontier villages from waves of invading rock monsters. During the day, Dillon collects resources to build up defenses such as gun towers and defensive walls. At night, he battles the Grocks with the help of those defenses. The 3-D graphics bring the games Wild West setting to life. Dillons story unfolds as he and his partner, Russ, interact with the inhabitants of the many western villages they fight to save.\r Features:\r 10 different villages, each with 3 days and nights of action.\r 22 different types of Grocks, from lowly Footgrocks to gigantic Ultimogrocks.\r Multiple strategies are possible, and you can re-play the stages to get a better time.\r Dillon gains additional attack abilities as he progresses through the game.\r Unique mix of character action and tower defense.… Expand"}, {"name": "The Grim Adventures of Billy & Mandy", "details_link": "https://www.metacritic.com/game/playstation-2/the-grim-adventures-of-billy-mandy", "publisher": "Midway", "release_date": "Sep 25 2006", "developers": ["High Voltage Software"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 65, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/afa6a61db8553c1767c090ec9f81e5a8-98.jpg", "descriptions": "The Grim Adventures of Billy & Mandy videogame pits 15 characters from the popular television show against each other in a fighting/adventure game filled with mayhem and chaos. Whether players use Billy's gas attack or Mandy's deadly smile, all of the characters will feature individualThe Grim Adventures of Billy & Mandy videogame pits 15 characters from the popular television show against each other in a fighting/adventure game filled with mayhem and chaos. Whether players use Billy's gas attack or Mandy's deadly smile, all of the characters will feature individual abilities based on their personalities. Players will be able to smash objects, destroy environments and battle in 20 fully interactive environments from the show. In battle mode, up to four players can use a multitude of weapons in destructible arenas like the \"Desert of Doom\" and the \"Underworld\" to battle it out and be the last one standing. Players also have the option to play on their own or with a friend in mission mode, a series of 45 missions where players can unlock new weapons and characters like Hoss Delgado and Fred Fredburger. [Midway]… Expand"}, {"name": "Dynasty Warriors: Strikeforce", "details_link": "https://www.metacritic.com/game/psp/dynasty-warriors-strikeforce", "publisher": "Koei", "release_date": "Apr 28 2009", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/1288e1cb0803f1e99194143caa91bee0-98.jpg", "descriptions": "For the first time in the franchise, up to four friends can join together to form a tactical \"Strikeforce\" with history's mightiest warriors. Working as a team, players can plan coordinated assaults to conquer massive armed fortresses and colossal beasts. The game's heart-pounding actionFor the first time in the franchise, up to four friends can join together to form a tactical \"Strikeforce\" with history's mightiest warriors. Working as a team, players can plan coordinated assaults to conquer massive armed fortresses and colossal beasts. The game's heart-pounding action will go where it has never gone before- the skies above. Gifted with new supernatural powers, characters can unleash new \"Fury\" transformations, streak across the skies and battle enemies in the air. Completely re-designed levels featuring immense castles, towers and ships serve as the backdrop for these legendary quests and battles with massive bosses. With both single-player and multi-player quests, new \"air\" fighting techniques, radical character customization, new challenges to conquer, and downloadable content, Dynasty Warriors: Strikeforce will forever change the way you experience the Dynasty Warriors universe. [KOEI]… Expand"}, {"name": "BioMotor Unitron", "details_link": "https://www.metacritic.com/game/switch/biomotor-unitron", "publisher": "SNK Corporation", "release_date": "May 26 2022", "developers": ["SNK Corporation"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/3157c346bf504f2b328f2905755eef4d-98.jpg", "descriptions": "Using the ore mined from the Unitice meteor, humans have been able to develop the man-shaped robots known as UNITRONS. As a Unitron master, you control one of these mighty machines as you explore mysterious dungeons and fight for the ultimate prize in the Unitron Arena! Create - Collect -Using the ore mined from the Unitice meteor, humans have been able to develop the man-shaped robots known as UNITRONS. As a Unitron master, you control one of these mighty machines as you explore mysterious dungeons and fight for the ultimate prize in the Unitron Arena! Create - Collect - Trade! Build your own weapons for your Unitron using Arms and Material. There are over 200 possible combinations! Battles against fearsome monsters and skilled Unitron masters await you! If you can defeat them all, you too can become... The Master of Masters!… Expand"}, {"name": "Elements of Destruction", "details_link": "https://www.metacritic.com/game/xbox-360/elements-of-destruction", "publisher": "THQ", "release_date": "Jun 18 2008", "developers": ["Frozen Codebase"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Strategy", "General", "General", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/c5d514812cfd4bcb94c0c44b2c09ca19-98.jpg", "descriptions": "[Xbox Live Arcade]  In Elements of Destruction, you are the master of disaster. Use tornadoes, lightning, earthquakes, and other forces of nature to do your bidding. Fired from your job as a top research scientist, you have built a machine that allows you to control nature and exact revenge[Xbox Live Arcade]  In Elements of Destruction, you are the master of disaster. Use tornadoes, lightning, earthquakes, and other forces of nature to do your bidding. Fired from your job as a top research scientist, you have built a machine that allows you to control nature and exact revenge on the corporation that fired you. Your quest for revenge takes you to locations across the globe where you must use the forces of nature in challenging ways. Shake down buildings with earthquakes, suck up and throw objects with tornadoes, and strike down aircraft with lightning to cause mayhem in cities and towns across the earth. Compete in two online and split screen multiplayer modes including Destruction (go head-to-head with another player to see who can cause the most damage) and Cooperative (work together with other players to destroy the corporate menace). [THQ]… Expand"}, {"name": "Disney's Meet the Robinsons", "details_link": "https://www.metacritic.com/game/xbox-360/disneys-meet-the-robinsons", "publisher": "Buena Vista Games", "release_date": "Mar 27 2007", "developers": ["Buena Vista Games"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/37d7ce2dc3b647b7a08a6eef5e62498b-98.jpg", "descriptions": "What if you could change the past? What if you could control the future? What if time was on your side? Play as Wilbur Robinson and experience the thrills of time travel adventure. With a ton of crazy gadgets at your disposal, battle enemies and solve puzzles while in pursuit of theWhat if you could change the past? What if you could control the future? What if time was on your side? Play as Wilbur Robinson and experience the thrills of time travel adventure. With a ton of crazy gadgets at your disposal, battle enemies and solve puzzles while in pursuit of the dastardly Bowler Hat Guy and his diabolical robotic hat, Doris. It's up to you to thward their evil plans and save the future! Explore ancient Egypt, the Robinsons' mansion, The Hive and other supercool locales. Break out the Charge Glove, the Disassembler, the Scanner, the family Album, the Havoc Gloves and the Leviathon device. [Buena Vista Games]… Expand"}, {"name": "Virtua Tennis 4", "details_link": "https://www.metacritic.com/game/wii/virtua-tennis-4", "publisher": "Sega", "release_date": "May 10 2011", "developers": ["Sega"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/f2e718aafa045b6039219e427f3116b3-98.jpg", "descriptions": "Virtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controllerVirtua Tennis 4 with the PlayStation Move is more than just hitting the ball; it's about the angle of the racquet, the spin and speed of the ball and the power of the shot.  The advanced motion sensors of PlayStation Move precisely track both the fast and subtle movements of the controller allowing for pinpoint accurate shots as players improve their racquet skills.  Virtua Tennis 4 will also support 3D technology delivering unprecedented realism to the tennis experience, bringing you closer than ever to being out on the court.… Expand"}, {"name": "Ms. Pac-Man", "details_link": "https://www.metacritic.com/game/xbox-360/ms-pac-man", "publisher": "Namco Bandai Games", "release_date": "Jan 10 2007", "developers": ["Namco Bandai Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/c706d5c0eff25e392cadcc22db0ee7c8-98.jpg", "descriptions": "[Xbox Live Arcade]  Guide Ms. Pac-Man through mazes, munching Pac-Dots and Power Pellets to clear each stage. Remains true to the classic arcade version, including ghosts, dot chomping action, and Ms. Pac-Man's original \"waka waka\" sounds. Full of hilarious antics as you avoid moving fruits[Xbox Live Arcade]  Guide Ms. Pac-Man through mazes, munching Pac-Dots and Power Pellets to clear each stage. Remains true to the classic arcade version, including ghosts, dot chomping action, and Ms. Pac-Man's original \"waka waka\" sounds. Full of hilarious antics as you avoid moving fruits and smart monsters through the fun filled mazes. Munch a Power Pellet to momentarily turn ghosts blue. When ghosts are blue, Ms. Pac-Man can eat them for bonus points.. Play all 255 mazes from the original. Free trial demo provides players with the first 2 levels of the game. Gamers can track their high scores on the Ms. Pac-Man leaderboards and strive to garner all 12 Achievements. [Namco Bandai Games]… Expand"}, {"name": "Vostok Inc.", "details_link": "https://www.metacritic.com/game/switch/vostok-inc", "publisher": "Wired Productions", "release_date": "Dec  7 2017", "developers": ["Nosebleed Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/71692e61565d46b38badb72e68b7d9b3-98.jpg", "descriptions": "Vostok Inc. is a casual game for a hardcore audience and a hardcore game for a casual audience. The premise is that you're a corrupt, narcissistic yuppie, out to make as much money as possible. Think the Wolf of Wall Street... in Space.It's a twin stick shooter for the modern age, an ageVostok Inc. is a casual game for a hardcore audience and a hardcore game for a casual audience. The premise is that you're a corrupt, narcissistic yuppie, out to make as much money as possible. Think the Wolf of Wall Street... in Space.It's a twin stick shooter for the modern age, an age where audiences are limited by time and want to be able to play when they want, how they want, and on whatever devices they want. Want to play on console whilst sitting on the sofa? Sure. Fancy a quick game on handheld whilst on the bus? Go ahead. Want the game to reward you whilst it's playing itself, on your mobile whilst at work? Don't let us stop you!The introduction of an idle clicker metagame into an already brilliant and satisfying second-to-second experience adds a whole extra dimension to the genre. Not to mention it makes the game more addictive than crack once you get going.Of course no Nosebleed Interactive game would be complete without the extra bells and whistles, so as well as an adaptive audio system (which you can remix to your heart's content) we've also got 13 minigames (including an FPS), Tamagotchi style virtual pets (or in our case, a Virtual Executives), and a massive suite of ship and weapon upgrades to unlock and mess about with.… Expand"}, {"name": "Surf World Series", "details_link": "https://www.metacritic.com/game/playstation-4/surf-world-series", "publisher": "Vision Games Publishing LTD", "release_date": "Aug 29 2017", "developers": ["Climax Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Sports", "Individual", "Surf / Wakeboard"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/3122d75861c1fc557d25c62078e6609e-98.jpg", "descriptions": "Take to the waves in Surf World Series. Experience the thrill of killer tricks and monster waves at five legendary surfing destinations."}, {"name": "Capcom Digital Collection", "details_link": "https://www.metacritic.com/game/xbox-360/capcom-digital-collection", "publisher": "Capcom", "release_date": "Mar 27 2012", "developers": ["Capcom"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 65, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/33c33b35b6ecbe961f0fb2efcad4998b-98.jpg", "descriptions": "The Capcom Digital Collection is packed with eight hit games previously available via Xbox LIVE Arcade."}, {"name": "The Sims 2: Pets", "details_link": "https://www.metacritic.com/game/wii/the-sims-2-pets", "publisher": "EA Games", "release_date": "Jun 12 2007", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/74a6e57b5c48a5ceb715584552cd389e-98.jpg", "descriptions": "The Sims 2 Pets for the Wii uses the accessible Wii controls to create pets for your Sims to train, play with, and love as their own. Not only do players have the opportunity to choose from a variety of existing breeds, and the latest designer mixes, but they can also personally design theirThe Sims 2 Pets for the Wii uses the accessible Wii controls to create pets for your Sims to train, play with, and love as their own. Not only do players have the opportunity to choose from a variety of existing breeds, and the latest designer mixes, but they can also personally design their new furry friends with the Create-a-Pet feature. The ability to customize gives players the opportunity to create their ideal pet by choosing their body shape, unique markings, even their pets' personalities. With so many different animals to choose from, there's no telling what unpredictable experiences could occur. The addition of a new friend for The Sims 2 Pets for the Wii is sure to enrich the daily lives of your Sims. Players can also to teach their pets new tricks, take them for a romp in the park, outfit them with new pet accessories and even give them jobs. As in real life, your Sims' pets require care and training. A neglected cat with an urge to scratch might claw up your new couch if you aren't careful, and leaving your dog unattended near a freshly planted flower bed probably isn't wise. [Electronic Arts]… Expand"}, {"name": "007: Quantum of Solace", "details_link": "https://www.metacritic.com/game/xbox-360/007-quantum-of-solace", "publisher": "Activision", "release_date": "Nov  4 2008", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "General", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/884237bdcd09fc8317dff7ebcdaee2b5-98.jpg", "descriptions": "Introducing a more lethal and cunningly efficient Bond, the game blends intense first-person action with a unique third-person cover combat system that allows players to truly feel what it is like to be the ultimate secret agent as they use their stealth, precision shooting and lethal combatIntroducing a more lethal and cunningly efficient Bond, the game blends intense first-person action with a unique third-person cover combat system that allows players to truly feel what it is like to be the ultimate secret agent as they use their stealth, precision shooting and lethal combat skills to progress through missions. Blending the action of the \"Quantum of Solace\" feature film with the \"Casino Royale\" movie, the title propels players into the cinematic experience of international espionage.  Based on the Call of Duty 4: Modern Warfare game engine that has been specifically engineered to immerse players in the Bond universe, the Quantum of Solace game delivers high-definition graphics, reactive AI and visually stunning locations inspired by locales portrayed in the films. Quantum of Solace marks the first time players can become the dangerous and cunning Bond as portrayed by Daniel Craig. From silent take downs and sneaking through confined spaces, to one-on-one shoot outs and large scale battles, players experience a variety of gameplay that challenges them to think through situations and choose how they progress, whether it's through covert means or confronting enemies in full force. Advanced combat and Realistic AI: Players engage in both first-person and third-person gameplay that allows gamers to be Bond in unscripted battles against the world's most evil villains and mercenaries. Filled with armed combat, massive explosions and vertigo-inducing chases, gamers are immersed in an authentic Bond universe and drawn into epic movie moments with theatrical camera angles, split screen effects, picture-in-picture sequences, and amazing environments inspired by real world locations such as Montenegro, Venice, Bolivia and Austria. Bringing James Bond to next-gen consoles for the first time, gamers now have the ability to battle online in a variety of modes. [Activision]… Expand"}, {"name": "Resident Evil Code: Veronica X HD", "details_link": "https://www.metacritic.com/game/playstation-3/resident-evil-code-veronica-x-hd", "publisher": "Capcom", "release_date": "Sep 27 2011", "developers": ["Capcom"], "platforms": ["PlayStation 2", "PlayStation 4", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 65, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/95495b98f9f764ab05da034de1b33712-98.jpg", "descriptions": "Experience another terrifying chapter in the Resident Evil series with Resident Evil: Code Veronica X.  After narrowly surviving the horrific onslaught in Raccoon City, Claire Redfield now seeks clues in search of her missing brother, Chris.  Join Claire as she uncovers the insidiousExperience another terrifying chapter in the Resident Evil series with Resident Evil: Code Veronica X.  After narrowly surviving the horrific onslaught in Raccoon City, Claire Redfield now seeks clues in search of her missing brother, Chris.  Join Claire as she uncovers the insidious activities of the Umbrella Corporation.   Avoid or eliminate flesh-eating zombies and horrific beasts.  Use a variety weapons, items, and clues scattered around Raccoon City to help you survive the nightmare and make sure the virus doesn't spread any farther.… Expand"}, {"name": "Farming Simulator 17", "details_link": "https://www.metacritic.com/game/xbox-one/farming-simulator-17", "publisher": "Focus Home Interactive", "release_date": "Oct 25 2016", "developers": ["Giants Software"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/855360444773798a94d9e2fb29409259-98.jpg", "descriptions": "Farming Simulator 17, developed by Giants Software, invites you into the challenging world of a modern day farmer. Take on all the challenges of farming life, including animal husbandry, crops, sales, and woodcutting. You decide how you want to manage and grow your farm in a huge, open world."}, {"name": "Tharsis", "details_link": "https://www.metacritic.com/game/playstation-4/tharsis", "publisher": "Choice Provisions", "release_date": "Jan 12 2016", "developers": ["Choice Provisions"], "platforms": ["PC", "Switch", "PlayStation 4"], "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/523fda14ef798de0a4c60fc49111eb10-98.jpg", "descriptions": "Tharsis is a turn-based strategy game about humanity’s first mission to Mars. It’s an important mission, and not just because of its potential to greatly increase our knowledge of the red planet. No, this mission is humanity’s attempt to locate the source of a mysterious signal emanatingTharsis is a turn-based strategy game about humanity’s first mission to Mars. It’s an important mission, and not just because of its potential to greatly increase our knowledge of the red planet. No, this mission is humanity’s attempt to locate the source of a mysterious signal emanating from the red planet. [Choice Provisions]… Expand"}, {"name": "Choplifter HD", "details_link": "https://www.metacritic.com/game/pc/choplifter-hd", "publisher": "InXile Entertainment", "release_date": "Jan 11 2012", "developers": ["InXile Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/b953e9f4d329dfa27a427800786d4f72-98.jpg", "descriptions": "In Choplifter HD, players take on the role of an up and coming rescue pilot asked to join the elite, international helicopter rescue team C.H.O.P.R. (Coordinated Helicopter Operations, Preservation and Rescue).  Pilots will be trained to command a variety of helicopters deployed on more thanIn Choplifter HD, players take on the role of an up and coming rescue pilot asked to join the elite, international helicopter rescue team C.H.O.P.R. (Coordinated Helicopter Operations, Preservation and Rescue).  Pilots will be trained to command a variety of helicopters deployed on more than 20 different missions ranging from captured military prisoner extraction to saving survivors of viral outbreaks. Pilots must bank, hover and touch-down in perilous conditions in order to make their rescue and complete their mission.… Expand"}, {"name": "CSI: Crime Scene Investigation: Dark Motives", "details_link": "https://www.metacritic.com/game/pc/csi-crime-scene-investigation-dark-motives", "publisher": "Ubisoft", "release_date": "Mar 23 2004", "developers": ["369 Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "First-Person", "Point-and-Click", "Modern", "Modern"], "meta_score": 65, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/bde206fafc2bcca1922c84a50ebd89cd-98.jpg", "descriptions": "Building off the success of Ubisoft's top-selling CSI: Crime Scene Investigation PC game, CSI: Dark Motives is a first-person adventure game that will test players' nerves and intellect as they examine crime scenes, question witnesses and analyze evidence utilizing the latest in forensicBuilding off the success of Ubisoft's top-selling CSI: Crime Scene Investigation PC game, CSI: Dark Motives is a first-person adventure game that will test players' nerves and intellect as they examine crime scenes, question witnesses and analyze evidence utilizing the latest in forensic equipment. The new CSI PC game features a number of gameplay improvements including in-depth evidence examination, scalable difficulty and more interactive lab functionality. CSI: Dark Motives will once again feature the likenesses and voices of the entire CSI cast. [Ubisoft]… Expand"}, {"name": "Dragon Ball Z: Budokai", "details_link": "https://www.metacritic.com/game/gamecube/dragon-ball-z-budokai", "publisher": "Atari", "release_date": "Oct 28 2003", "developers": ["Pyramid"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Action", "Fighting", "3D"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/2f13a6124ebf05738d8aed775d445b6b-98.jpg", "descriptions": "The fiercest fighters in the universe have come together in the spectacular 3D world of Dragon Ball Z: Budokai.  Test your skills against the most powerful Dragon Ball Z heroes and the most sinister villains in five exciting play modes.   You can unlock, customize, and trade devastatingThe fiercest fighters in the universe have come together in the spectacular 3D world of Dragon Ball Z: Budokai.  Test your skills against the most powerful Dragon Ball Z heroes and the most sinister villains in five exciting play modes.   You can unlock, customize, and trade devastating skills with friends to create the most powerful fighters ever.  Every battle is more intense, more dangerous, and more epic than the one before.… Expand"}, {"name": "Triple Play 2002", "details_link": "https://www.metacritic.com/game/playstation-2/triple-play-2002", "publisher": "Electronic Arts", "release_date": "Mar 11 2002", "developers": ["Pandemic Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/92ec0cbc5e60876d8aeeee783c273ca2-98.jpg", "descriptions": "New player animations bring the hitting, pitching and fielding to life with signature styles and stances. 3D-scanned faces put your favorite star players in the game. Play in every major league ballpark and experience the detail and beauty of a big-league setting. Hear commentary fromNew player animations bring the hitting, pitching and fielding to life with signature styles and stances. 3D-scanned faces put your favorite star players in the game. Play in every major league ballpark and experience the detail and beauty of a big-league setting. Hear commentary from broadcasters Bob Costas and Harold Reynolds. Four different game modes include Home Run Derby for those who live by the long ball. Other extras include Create-A-Player, Fantasy Draft, and widescreen TV support. [Electronic Arts]… Expand"}, {"name": "X-COM: Enforcer", "details_link": "https://www.metacritic.com/game/pc/x-com-enforcer", "publisher": "Infogrames", "release_date": "Apr 18 2001", "developers": ["MicroProse"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/dda5dbff795f9645ebe1f6c911a28f72-98.jpg", "descriptions": "Microprose has abandoned the suspenseful, tactical combat inherent in the previous installments of the \"X-COM\" series in favor of a pure, straightforward arcade action format with more than 30 levels of non-stop shooting from a third-person perspective."}, {"name": "Tiger Woods PGA Tour Golf", "details_link": "https://www.metacritic.com/game/playstation/tiger-woods-pga-tour-golf", "publisher": "EA Sports", "release_date": "Nov 13 2000", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/9d2fe218999ba810cabc62fd24ee39cf-98.jpg", "descriptions": "Those simply looking for a good PlayStation golf game are better off looking at the Hot Shots series than picking up this antiquated, middle-of-the-road golf game."}, {"name": "Marvel: Ultimate Alliance 2", "details_link": "https://www.metacritic.com/game/ds/marvel-ultimate-alliance-2", "publisher": "Activision", "release_date": "Sep 15 2009", "developers": ["n-Space"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "DS"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/9f34ce5700aa248f78ad9988ea2c334a-98.jpg", "descriptions": "The \"greatest Super Hero action/RPG of all time\" is back with the world’s largest army of heroes and villains in Marvel: Ultimate Alliance 2. Incorporating elements of the acclaimed Marvel Civil War storyline, the game allows players to choose their side and team up with revered heroes andThe \"greatest Super Hero action/RPG of all time\" is back with the world’s largest army of heroes and villains in Marvel: Ultimate Alliance 2. Incorporating elements of the acclaimed Marvel Civil War storyline, the game allows players to choose their side and team up with revered heroes and villains, including Spider-Man, Wolverine, Hulk, Iron Man, Deadpool, Venom, Green Goblin and Captain America. Players can combine characters’ powers and unleash astonishing new attacks. [Activision]… Expand"}, {"name": "Space Invaders Forever", "details_link": "https://www.metacritic.com/game/switch/space-invaders-forever", "publisher": "ININ Games", "release_date": "Dec 11 2020", "developers": ["Taito Corporation"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "Shoot-'Em-Up", "Vertical"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/aba66a46f3468fbd203803e1aa1b8e7c-98.jpg", "descriptions": "Space Invaders Extreme has arrived to invade consoles with greatly improved graphics and interactive sound to deliver a new immersive experience! Packed with vibrant visuals and a pulsing soundtrack. Space Invaders Extreme comes with 16 stages, packed with devious invaders and fiendish bossSpace Invaders Extreme has arrived to invade consoles with greatly improved graphics and interactive sound to deliver a new immersive experience! Packed with vibrant visuals and a pulsing soundtrack. Space Invaders Extreme comes with 16 stages, packed with devious invaders and fiendish boss fights. Practice individual stages in Free Play, then boost your high score to new heights in Arcade Mode! Can you find all the countless, hidden bonuses? Welcome to the new invasion! … Expand"}, {"name": "InnerSpace", "details_link": "https://www.metacritic.com/game/pc/innerspace", "publisher": "PolyKnight Games", "release_date": "Jan 16 2018", "developers": ["PolyKnight Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Civilian"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/c4c24d27edbab412e34bc63419f5ea53-98.jpg", "descriptions": "InnerSpace is an exploration flying game set in a world where physics are inverted. Take the role of an unnamed cartographer to explore the various bubble-worlds, collect relics, and encounter each bubble’s mythical demigod, in order to discover more about the universe, its history, and itsInnerSpace is an exploration flying game set in a world where physics are inverted. Take the role of an unnamed cartographer to explore the various bubble-worlds, collect relics, and encounter each bubble’s mythical demigod, in order to discover more about the universe, its history, and its future. … Expand"}, {"name": "Super Dodgeball Brawlers", "details_link": "https://www.metacritic.com/game/ds/super-dodgeball-brawlers", "publisher": "Aksys Games", "release_date": "May 27 2008", "developers": ["Million"], "platforms": "DS", "num_players": "8  Online", "genres": ["Sports", "Alternative", "Team", "Other", "Other"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/5b6dfc74cbb922ff78f35a76e2a9b5c8-98.jpg", "descriptions": "Based on the classic Super Dodgeball released on the Nintendo Entertainment System, Super Dodgeball Brawlers brings back the old-school Kunio characters with an all new arsenal of super throws and attacks in an all-out war for playground supremacy. Super Dodgeball Brawlers has over 100Based on the classic Super Dodgeball released on the Nintendo Entertainment System, Super Dodgeball Brawlers brings back the old-school Kunio characters with an all new arsenal of super throws and attacks in an all-out war for playground supremacy. Super Dodgeball Brawlers has over 100 ball-busting special attacks! Dish out a variety of pain with over 100 special attacks with their own special animations and effects, like the Cactus Attack and Panda Shot. The Perfect Game for Multiplayer Mayhem! Compete in a traditional game of dodgeball against a friend or take part in a multiplayer street brawl with up to 8 players with a single Game Card. Finally, an open season for Violence! If the old-fashioned way doesn't work for you, you can now use punches, kicks, and even weapons against the opposing team.… Expand"}, {"name": "Twin Mirror", "details_link": "https://www.metacritic.com/game/pc/twin-mirror", "publisher": "Bandai Namco Games", "release_date": "Dec  1 2020", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 65, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/97ce696bfaec13743d7c6fd4f6cec6ae-98.jpg", "descriptions": "Sam, a 33-year old man recovering from a recent break-up, returns to his hometown Basswood, West Virginia, for the funeral of his best friend. Understandably depressed and bitter, he feels completely out of sorts and out of place... But when he wakes up in his hotel room with a bloody shirtSam, a 33-year old man recovering from a recent break-up, returns to his hometown Basswood, West Virginia, for the funeral of his best friend. Understandably depressed and bitter, he feels completely out of sorts and out of place... But when he wakes up in his hotel room with a bloody shirt and no memory of his whereabouts the previous night, he embarks on a twisted investigation to find the truth.\r FEATURES:\r * Play a Thrilling Investigation -- Recall your memories and find the truth by exploring the dark undertones of a small town in West Virginia.\r * Embark on a Compelling Emotional Journey -- Sam's quest is also one of redemption in his journey to find himself again and heal his wounded heart.\r * Direct Sam's Fate -- Your choices and values decide Sam's place in life as you shape his relationships with the Basswood's inhabitants.… Expand"}, {"name": "Mass Effect 2: Arrival", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-2-arrival", "publisher": "EA Games", "release_date": "Mar 29 2011", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/20f357036ea0e34fcc3841cac74beb71-98.jpg", "descriptions": "In Mass Effect: Arrival, Commander Shepard is sent to the edge of the galaxy to rescue an undercover operative who may have evidence of an imminent Reaper invasion that has been looming since the very beginning of the series. Returning and playing a prominent role in Mass Effect: Arrival isIn Mass Effect: Arrival, Commander Shepard is sent to the edge of the galaxy to rescue an undercover operative who may have evidence of an imminent Reaper invasion that has been looming since the very beginning of the series. Returning and playing a prominent role in Mass Effect: Arrival is fan favorite Admiral Hackett, who is voiced by legendary science-fiction actor Lance Henriksen (Alien, Terminator).… Expand"}, {"name": "Windbound", "details_link": "https://www.metacritic.com/game/xbox-one/windbound", "publisher": "Deep Silver", "release_date": "Aug 28 2020", "developers": ["5 Lives Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/61d2fe3dd0104e2f626529428e7fdf38-98.jpg", "descriptions": "Embark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island'sEmbark on a personal journey and discover the history of the idyllic forbidden islands; each holding the key to a mystery and unexpected revelations. Head towards the horizon, advancing across the islands, each with their own wildlife, landscapes and challenges to face. Scavenge the island's untamed terrain for resources that you can use to craft a full range of tools and weapons to hunt wildlife and upgrade your boat. You must set sail when resources become scarce. Your boat is your key companion on this journey, carefully craft your own custom sailing vessel to take on the treacherous waters, traversing from one island to the next.… Expand"}, {"name": "FOX n FORESTS", "details_link": "https://www.metacritic.com/game/playstation-4/fox-n-forests", "publisher": "EuroVideo Medien", "release_date": "May 17 2018", "developers": ["Bonus Level Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/9967ab7c47bb3ee584eb08e05a27441f-98.jpg", "descriptions": "Fox n Forests is a 2D action platformer with RPG and puzzle elements inspired by the glorious days of 16-bit! Switch between various seasons on the fly, shoot and slash with your magic melee crossbow and snatch loot to unveil the mystery of the 5th seasons."}, {"name": "Dino Frontier", "details_link": "https://www.metacritic.com/game/playstation-4/dino-frontier", "publisher": "Uber Entertainment", "release_date": "Aug  1 2017", "developers": ["Uber Entertainment"], "platforms": "PlayStation 4", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 65, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/d0c081f9b7978005aa4242e3db55c009-98.jpg", "descriptions": "Build and manage a frontier settlement in a world where the wild west and jurassic collide. Dino Frontier is a virtual reality simulation where players assume the role of Big Mayor. They must carefully balance resources while growing their town and surviving bandit attacks."}, {"name": "Disney/Pixar Ratatouille", "details_link": "https://www.metacritic.com/game/playstation-2/disneypixar-ratatouille", "publisher": "THQ", "release_date": "Jun 26 2007", "developers": ["Asobo Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/9ac0dcd509d52f499ac75bc6edc77969-98.jpg", "descriptions": "Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6 action-packed worlds filled with dangerous enemies, heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down. [THQ]… Expand"}, {"name": "Spore Creatures", "details_link": "https://www.metacritic.com/game/ds/spore-creatures", "publisher": "EA Games", "release_date": "Sep  7 2008", "developers": ["Griptonite Games"], "platforms": ["iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "General", "Breeding/Constructing"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/557e8547be0d8b947825f6e0c1a741d3-98.jpg", "descriptions": "Spore Creatures gives players their own personal universe in a box. Create and evolve life, establish tribes, build civilizations, sculpt entire worlds and explore a universe created by other gamers. Spore Creatures gives players a wealth of creative tools to customize nearly every aspect ofSpore Creatures gives players their own personal universe in a box. Create and evolve life, establish tribes, build civilizations, sculpt entire worlds and explore a universe created by other gamers. Spore Creatures gives players a wealth of creative tools to customize nearly every aspect of their universe: creatures, vehicles, buildings, and even UFOs. Players can then seamlessly share their creations with the world or explore infinite new galaxies created by other gamers. [Electronic Arts]… Expand"}, {"name": "Maize", "details_link": "https://www.metacritic.com/game/pc/maize", "publisher": "Finish Line Games", "release_date": "Dec  1 2016", "developers": ["Finish Line Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/04b4601113840e55db427055bfcb5093-98.jpg", "descriptions": "Maize is a first-person adventure game about what happens when two scientists misinterpret a memo from the U.S. Government and create sentient corn. And that last sentence is pretty much the least ridiculous thing about the game."}, {"name": "Texas Cheat 'Em", "details_link": "https://www.metacritic.com/game/xbox-360/texas-cheat-em", "publisher": "D3Publisher", "release_date": "May 13 2009", "developers": ["Wideload Games Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "8  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/ef1577f96f0e1bbb1887ae13836fdce2-98.jpg", "descriptions": "[Xbox Live Arcade]  It's not whether you win or lose … it's about how far you can bend the rules without getting caught. In Texas Cheat 'Em, that's pretty darn far. Play casino-themed mini-games to activate one of 15 cheating abilities—then make your own luck. Turn a bad hand into a sure[Xbox Live Arcade]  It's not whether you win or lose … it's about how far you can bend the rules without getting caught. In Texas Cheat 'Em, that's pretty darn far. Play casino-themed mini-games to activate one of 15 cheating abilities—then make your own luck. Turn a bad hand into a sure thing. Send your opponent's Royal Flush right down the drain. Steal chips, fold for free, or know the community cards in advance. Cheat strangers out of their fortunes over Xbox Live before they do it to you. Remember: glory is forever, but broke is only funny when it happens to someone else. [Wideload Games]… Expand"}, {"name": "Mister Mosquito", "details_link": "https://www.metacritic.com/game/playstation-2/mister-mosquito", "publisher": "Eidos Interactive", "release_date": "Mar 12 2002", "developers": ["Zoom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 65, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/3c1a719555a7d04f1fa87a4ac006346b-98.jpg", "descriptions": "You are Mister Mosquito, an uninvited guest in the Yamada family home in Japan. In order to store up enough food for the winter, you must drink as much of their precious blood as possible while they are in bed, talking on the phone, watching tv, or even a bath. The Yamadas know you are inYou are Mister Mosquito, an uninvited guest in the Yamada family home in Japan. In order to store up enough food for the winter, you must drink as much of their precious blood as possible while they are in bed, talking on the phone, watching tv, or even a bath. The Yamadas know you are in the house and have plans to take you out. Deadly insecticides fill the air, and they have the ability to crush you like the bug you are. [Fresh Games]… Expand"}, {"name": "Marvel's Guardians of the Galaxy - Episode 3: More Than A Feeling", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-guardians-of-the-galaxy---episode-3-more-than-a-feeling", "publisher": "Telltale Games", "release_date": "Aug 22 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/ba82cc0ce49f1fe428880046643a9304-98.jpg", "descriptions": "In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-partIn the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure.… Expand"}, {"name": "Dynasty Warriors: Gundam 3", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-gundam-3", "publisher": "Namco Bandai Games", "release_date": "Jun 28 2011", "developers": ["Omega Force", "Koei Tecmo Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 65, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/9f930a7c28c4ae7f6f7f70729055aa01-98.jpg", "descriptions": "First released in December 2008, the DYNASTY WARRIORS GUNDAM series has gained much popularity, and finally the newest entry is going to be released soon. By continuing all of the popular elements and loosing unpopular elements of the previous installments, we hope that this installment isFirst released in December 2008, the DYNASTY WARRIORS GUNDAM series has gained much popularity, and finally the newest entry is going to be released soon. By continuing all of the popular elements and loosing unpopular elements of the previous installments, we hope that this installment is the best of the series. With newly added features to set this installment apart from the rest, it has evolved to increase the player's sense of \"an authentic battlefield experience.\"… Expand"}, {"name": "Zombi", "details_link": "https://www.metacritic.com/game/pc/zombi", "publisher": "Ubisoft", "release_date": "Aug 18 2015", "developers": ["Ubisoft Montpellier"], "platforms": ["PlayStation 4", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "First-Person", "Arcade"], "meta_score": 65, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/9488eba86fdcbe56be4361d9d65036af-98.jpg", "descriptions": "ZombiU thrusts players in the middle of London circa 2012, where an outbreak has infected the population, destroying their humanity and turning them into mindless monsters preying on the flesh of the few remaining survivors. This fear-fueled first-person shooter invites takes all the horror,ZombiU thrusts players in the middle of London circa 2012, where an outbreak has infected the population, destroying their humanity and turning them into mindless monsters preying on the flesh of the few remaining survivors. This fear-fueled first-person shooter invites takes all the horror, chaos and tension found in the best of the horror genre and adds original interactive elements, including a unique death mechanic that puts players in the body of a different survivor each time they die, allowing them to track and take down their old, infected characters, recover  their equipment and see if they can stay alive just a little bit longer this time.… Expand"}, {"name": "Sunset Overdrive and the Mystery of the Mooil Rig!", "details_link": "https://www.metacritic.com/game/xbox-one/sunset-overdrive-and-the-mystery-of-the-mooil-rig!", "publisher": "Microsoft Game Studios", "release_date": "Dec 23 2014", "developers": ["Insomniac Games"], "platforms": "Xbox One", "genres": ["Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/520ee7f5bf35f95c7055022ea75d7325-98.jpg", "descriptions": "Sunset Overdrive and the Mystery of the Mooil Rig! features new story missions, two weapons, two Amps, one trap, two vanity items PLUS new quests, challenges, Chaos Squad missions, a Night Defense base, and a new boss that promises to keep you busy and distracted from the horrors of reality."}, {"name": "Two Worlds", "details_link": "https://www.metacritic.com/game/pc/two-worlds", "publisher": "SouthPeak Games", "release_date": "Aug 23 2007", "developers": ["Reality Pump"], "platforms": ["Xbox 360", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Third-Person", "Third-Person", "General"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/f41ca55793ce548ba4f64b9d09eb933f-98.jpg", "descriptions": "Two Worlds combines the dynamic combat system with the meaning and freedom of exploration. The ultimate goal of the Two Worlds project is to deliver a superior Role Playing Game to the PC and Xbox 360 market where players have a real chance to shape the game world with their actions - to anTwo Worlds combines the dynamic combat system with the meaning and freedom of exploration. The ultimate goal of the Two Worlds project is to deliver a superior Role Playing Game to the PC and Xbox 360 market where players have a real chance to shape the game world with their actions - to an extent that has yet to seen in other productions. This premise is supported with a strong, non-linear storyline and stunning combat sequences. The world comes to life as it immediately reacts to the player's actions and changes accordingly - offering new and exciting challenges. Players can shape their own story by choosing the path of conducting the main conflict and resolving meaningful side-quests. The combat system combines intuitive steering, tactical challenges and movie-like visual experiences. Players can experiment with different careers and even reverse their former choices with the help of \"career changers\". Players can travel and fight on various animals from horses to tamed lizards and beasts. Randomly generated pieces of equipment, thematic sets and combined items offer the space to experiment and satisfy the need to collect. [SouthPeak Interactive]… Expand"}, {"name": "DreamWorks Over the Hedge", "details_link": "https://www.metacritic.com/game/pc/dreamworks-over-the-hedge", "publisher": "Activision", "release_date": "May  9 2006", "developers": ["Beenox"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/004aca1036e7ce402baa4c2c88493ab2-98.jpg", "descriptions": "When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals,When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals, and save the forest (and your own hide) from the world’s peskiest critter-man. [Activision]… Expand"}, {"name": "Mario & Sonic at the Rio 2016 Olympic Games", "details_link": "https://www.metacritic.com/game/wii-u/mario-sonic-at-the-rio-2016-olympic-games", "publisher": "Nintendo", "release_date": "Jun 24 2016", "developers": ["Nintendo", "Sega Sports R&D"], "platforms": ["3DS", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Athletics"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/e2dfab6fa3be4527cba24fa519f91570-98.jpg", "descriptions": "Compete On-the-go with Mario and Sonic. Many of your Mario and Sonic characters are ready to join the fun in Rio de Janeiro, host of the Olympic Games in 2016. Then take the rivalry on the road with this portable collection of supercharged events like Soccer, Table Tennis, or test yourCompete On-the-go with Mario and Sonic. Many of your Mario and Sonic characters are ready to join the fun in Rio de Janeiro, host of the Olympic Games in 2016. Then take the rivalry on the road with this portable collection of supercharged events like Soccer, Table Tennis, or test your skills in a challenging game of Golf.\r Features:\r-Take on fun and exciting events set throughout host city Rio de Janeiro.\r-Join Mario, Sonic and your favorite characters to take on new challenging events like Soccer and Beach Volleyball.\r-Soccer is a popular sport in Brazil where the Rio 2016 Olympic Games are set.\r-Golf returns to the Olympic Games for the first time in 112 years; enjoy the event exclusively in the Nintendo 3DS version of Mario & Sonic at the Rio 2016 Olympic Games.… Expand"}, {"name": "Disney/Pixar Cars", "details_link": "https://www.metacritic.com/game/xbox-360/disneypixar-cars", "publisher": "THQ", "release_date": "Oct 23 2006", "developers": ["Rainbow Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/b5aacbe1f2413085ec100b26481736ce-98.jpg", "descriptions": "Race to the finish line as you live all the fun and excitement of the next Walt Disney Pictures presentation of a Pixar Animation Studios film, Cars. Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. Story-based adventure thatRace to the finish line as you live all the fun and excitement of the next Walt Disney Pictures presentation of a Pixar Animation Studios film, Cars. Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. Story-based adventure that relives key moments of the movie. Burn rubber in over 30 races and mini-games. Explore the open-world of Radiator Springs. Speed to the finish line with over 10 playable characters. Make your friends eat your dust in multiplayer mode. Features all of the major voice talent from the movie. [THQ]… Expand"}, {"name": "TOHU", "details_link": "https://www.metacritic.com/game/switch/tohu", "publisher": "The Irregular Corporation", "release_date": "Jan 28 2021", "developers": ["Fireart Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/858b0db9142272e223e87dda07a34c0c-98.jpg", "descriptions": "Explore beautiful environments and solve intricate puzzles in a brand new adventure game set amongst a world of wonderful fish planets.\r Experience a brand new adventure game set amongst a world of weird and wonderful fish planets. Explore beautiful environments, solve intricate puzzlesExplore beautiful environments and solve intricate puzzles in a brand new adventure game set amongst a world of wonderful fish planets.\r Experience a brand new adventure game set amongst a world of weird and wonderful fish planets. Explore beautiful environments, solve intricate puzzles and discover the truth about a mysterious little girl and her mechanical alter-ego, Cubus.\r Adventure as a little girl\rExplore vivid and atmospheric locations, meet intriguing characters, and solve elaborate puzzles - all on your quest to repair the Sacred Engine. As The Girl you are light and nimble, and so can reach areas of the world that others can't.\r Utilise the might of Cubus\rAt any time you can transform into The Girl’s mechanical friend, Cubus. Need something heavy lifting? Need big strong arms to catch lightbulb flies as they pass by? Need to win an impromptu arm wrestle with an arcane and somehow tangible mirror image of yourself? Cubus has you covered.\r Discover gorgeous handcrafted worlds\rEach fish planet in TOHU is brought to life through bewitchingly beautiful artwork and is packed with detail. Meet a cast of bizarre characters and uncover cute critters to collect!\r Solve intricately crafted puzzles\rYou'll need your wits about you to solve TOHU’s unique and wacky conundrums. From a simple search for critters needed to power your expanse-traversing fly-ship, to learning how to operate a moustache-imbuing mole cannon.\r Bathe in an entrancing soundscape\rTOHU features a musical score by Christopher Larkin, the award winning composer responsible for the soundtrack of Hollow Knight.\r… Expand"}, {"name": "Degrees of Separation", "details_link": "https://www.metacritic.com/game/xbox-one/degrees-of-separation", "publisher": "Modus Games", "release_date": "Feb 14 2019", "developers": ["Moondrop Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/af718bb13549975bc2a5f8648b190d94-98.jpg", "descriptions": "Degrees of Separation is a puzzle platformer where cooperation is built into every move. Two contrasting souls, Ember and Rime, fall in love, but are separated by an enigmatic force, and must use their powers to progress through a spectacular world of fantasy and adventure."}, {"name": "Turok", "details_link": "https://www.metacritic.com/game/pc/turok", "publisher": "Touchstone", "release_date": "Apr 22 2008", "developers": ["Propaganda Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/cd711f2f8b71da59605a81a489bc35c6-98.jpg", "descriptions": "Turok is an epic, story-driven first-person shooter set on a dark, mysterious planet in the future. Players take on the role of Joseph Turok, a former black ops commando, now part of an elite special forces squad, known as Whiskey Company, which is on a mission to take down a war criminal –Turok is an epic, story-driven first-person shooter set on a dark, mysterious planet in the future. Players take on the role of Joseph Turok, a former black ops commando, now part of an elite special forces squad, known as Whiskey Company, which is on a mission to take down a war criminal – Turok’s former mentor, Roland Kane. Set on a planet inhabited by Kane and his Mendel-Gruman Corporation soldiers, Turok must use his elite military training to elude Kane’s well-trained army and the ravenous, unpredictable dinosaurs, huge insects and other massive creatures that populate the environment. [Touchstone]… Expand"}, {"name": "Puzzle Guzzle", "details_link": "https://www.metacritic.com/game/psp/puzzle-guzzle", "publisher": "Agetec", "release_date": "Feb 27 2008", "developers": ["Irem", "Agetec"], "platforms": "PSP", "num_players": "Up to 8 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/4622fd93f73900907a962c1d183c9adb-98.jpg", "descriptions": "Puzzle Guzzle is an action puzzle game in vein of classics like Tetris except faster paced and evolved for the PSP. The goal is to complete shapes using blocks that drop down. Puzzle Guzzle features three puzzle modes, each with multiple impossible-to-put-down gameplay styles and mini games.Puzzle Guzzle is an action puzzle game in vein of classics like Tetris except faster paced and evolved for the PSP. The goal is to complete shapes using blocks that drop down. Puzzle Guzzle features three puzzle modes, each with multiple impossible-to-put-down gameplay styles and mini games. In addition to hot puzzle intensity, the game pushes the player to progress and face off against opponents by offering loads of unlockable content. [Agetec Inc.]… Expand"}, {"name": "Batman Begins", "details_link": "https://www.metacritic.com/game/xbox/batman-begins", "publisher": "EA Games", "release_date": "Jun 14 2005", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/1c54c1b04855ab3e3e5cd75e72a116b1-98.jpg", "descriptions": "Step into the shadows of Gotham City's dangerous criminal underworld as Batman. Based on the movie of the same name, Batman Begins lets you explore both the origins of the \"dark knight\" and his transformation into a superhero. As Batman, you must use your strength and an array ofStep into the shadows of Gotham City's dangerous criminal underworld as Batman. Based on the movie of the same name, Batman Begins lets you explore both the origins of the \"dark knight\" and his transformation into a superhero. As Batman, you must use your strength and an array of high-tech gadgets to fight the evil forces that threaten the city, including Scarecrow, Ra's Al Ghul, and Carmine Falcone.… Expand"}, {"name": "Anthem", "details_link": "https://www.metacritic.com/game/xbox-one/anthem", "publisher": "Electronic Arts", "release_date": "Feb 22 2019", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/5/aed1811bd263e0825eec46f027c4ecee-98.jpg", "descriptions": "Anthem is a shared-world action-RPG in which players delve into a vast world teeming with amazing technology and forgotten treasures. The world is also filled with savage beasts and ruthless marauders where Freelancers are called to defeat the forces plotting to conquer humanity. In Anthem,Anthem is a shared-world action-RPG in which players delve into a vast world teeming with amazing technology and forgotten treasures. The world is also filled with savage beasts and ruthless marauders where Freelancers are called to defeat the forces plotting to conquer humanity. In Anthem, up to 4 friends unravel the world’s mysteries and take on its most fearsome challenges together. Shared danger means shared glory, and successful Freelancers are all be richly rewarded for successful exploits. Throughout their adventure, players outfit their Freelancers with powerful Javelin exosuits, each of which are equipped with unique weapons and abilities. Players also customize their Javelin with gear they earn and craft throughout the adventure, and leave a lasting mark on the world. [Electronic Arts]… Expand"}, {"name": "Kao the Kangaroo", "details_link": "https://www.metacritic.com/game/switch/kao-the-kangaroo", "publisher": "Tate Multimedia", "release_date": "May 27 2022", "developers": ["Tate Multimedia"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/61bcb8b4c37951ab493d3d5b779d290b-98.jpg", "descriptions": "Join Kao on his biggest adventure yet! This time the brave kangaroo has to find his missing sister and solve the mystery of what happened to his long-gone father. He will need to travel the world and confront the famous fighting masters, who are influenced by the mysterious, dark power. OnJoin Kao on his biggest adventure yet! This time the brave kangaroo has to find his missing sister and solve the mystery of what happened to his long-gone father. He will need to travel the world and confront the famous fighting masters, who are influenced by the mysterious, dark power. On the course of his journey, Kao will learn under the guidance of his master - Walt, how to become not only an awesome fighter but also a clever one who uses his head as much as his fists.… Expand"}, {"name": "Transient", "details_link": "https://www.metacritic.com/game/pc/transient", "publisher": "Iceberg Interactive", "release_date": "Oct 28 2020", "developers": ["Stormling Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/e371890d8c75dbfc4ab2b98c5d8880a3-98.jpg", "descriptions": "H.P. Lovecraft meets Cyberpunk. Delve deep into a dystopian world and investigate what is happening to you and your friends in a domed city. Solve puzzles, hack systems and plug in to explore other dimensions. Discover a truth that might tear apart your sanity and question your very existence."}, {"name": "Dangerous Driving", "details_link": "https://www.metacritic.com/game/xbox-one/dangerous-driving", "publisher": "Maximum Games", "release_date": "Apr  9 2019", "developers": ["Three Fields Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 65, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/9/633a0991b58144fbaaff8b338ab64d4d-98.jpg", "descriptions": "From the creative talent behind the genre-defining Burnout series, Dangerous Driving puts aggression back into the racing genre, recapturing the spirit of the past and taking it to a new place. Dangerous Driving is a game about real driving. The sort of driving you want to do when no oneFrom the creative talent behind the genre-defining Burnout series, Dangerous Driving puts aggression back into the racing genre, recapturing the spirit of the past and taking it to a new place. Dangerous Driving is a game about real driving. The sort of driving you want to do when no one else is looking. The sort of driving you’d love to do if only everyone else would get OUT OF THE DAMN WAY! This game gives you the chance to live out that fantasy. To floor it in everyday cars, at high speeds, weaving in and out of traffic and slamming the other cars right off the road. This is a game built in the spirit of the classic arcade racing games of the 80’s and 90’s. It’s about speed, driving skill and beautiful powerslides around epic corners. It’s also about all out aggression, instant retaliation and sweet, sweet revenge. The more dangerously you drive, the faster you can go.… Expand"}, {"name": "2Dark", "details_link": "https://www.metacritic.com/game/xbox-one/2dark", "publisher": "Gloomywood", "release_date": "Mar 10 2017", "developers": ["Gloomywood"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/af72b4085963025637d43668d4e35c1d-98.jpg", "descriptions": "From Frédérick Raynal, the creator of Alone in the Dark and pioneer of survival-horror, 2Dark is a grim journey of stealth and courage into the heart of corruption. Use your cunning to infiltrate Gloomywood’s bastions of cruelty. Investigate to uncover the secrets of the deranged psychopathsFrom Frédérick Raynal, the creator of Alone in the Dark and pioneer of survival-horror, 2Dark is a grim journey of stealth and courage into the heart of corruption. Use your cunning to infiltrate Gloomywood’s bastions of cruelty. Investigate to uncover the secrets of the deranged psychopaths within, seek retribution for their crimes, and bring the children to safety.A NEW STEALTH-HORROR ADVENTURE- A nerve-wracking experience of ruthless consequences with only your wits to guide you.- Perfect your plan to infiltrate intricately handcrafted levels and escape with the children.- Stick to the shadows and step carefully. Light and sound can be your allies, and your undoing.- Supplies are limited. From flashlight batteries to bullets, make every item count.- Investigate every nook and cranny to expose the sinister secrets behind the abductions.- Kids will be kids. Stop for too long and they'll fidget and cry, putting both of you in harm's way. [Microsoft.com]… Expand"}, {"name": "Feist", "details_link": "https://www.metacritic.com/game/pc/feist", "publisher": "Finji", "release_date": "Jul 23 2015", "developers": ["Bits & Beasts"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/3fe4a58c0474b1fbd36c0a77c35a0459-98.jpg", "descriptions": "Outwit a sprawling forest full of secret danger and fierce creatures in the world of FEIST."}, {"name": "Rocky: Legends", "details_link": "https://www.metacritic.com/game/playstation-2/rocky-legends", "publisher": "Ubisoft", "release_date": "Sep 28 2004", "developers": ["Venom Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 65, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/4367f8b1f5d882f31c3493002141b583-98.jpg", "descriptions": "Rocky Legends lets players experience the pummelling action and untold backstories that lead up to the events chronicled in the blockbuster Rocky movies. Pound the competition as legendary fighters Rocky Balboa (the Italian Stallion from the streets of Philly), Apollo Creed (the Master ofRocky Legends lets players experience the pummelling action and untold backstories that lead up to the events chronicled in the blockbuster Rocky movies. Pound the competition as legendary fighters Rocky Balboa (the Italian Stallion from the streets of Philly), Apollo Creed (the Master of Disaster), Clubber Lang (straight out of a Chicago jailhouse) and Ivan Drago, (the Iron Fist of mother Russia), rise from their raw beginnings as unproven amateurs toughing it out along the way to their professional careers as boxing champions. [Ubisoft]… Expand"}, {"name": "Digimon Rumble Arena 2", "details_link": "https://www.metacritic.com/game/xbox/digimon-rumble-arena-2", "publisher": "Bandai", "release_date": "Sep  3 2004", "developers": ["Black Ship Games"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/589b45442945eb6d5f5cb9a0532d62bc-98.jpg", "descriptions": "Digimon Rumble Arena 2 lets you play as and against your favorite Digimon characters. The game features all the popular Digimon from all four seasons of the TV show, plus secret Digimon. Each Digimon has a signature move that can earn Digipoints and, with enough Digipoints, you can DigivolveDigimon Rumble Arena 2 lets you play as and against your favorite Digimon characters. The game features all the popular Digimon from all four seasons of the TV show, plus secret Digimon. Each Digimon has a signature move that can earn Digipoints and, with enough Digipoints, you can Digivolve and destroy your opponents. In locations ranging from icy glaciers to fields of fire, you can conquer the Digimon in single-player mode or compete against three of your friends in multiplayer brawls.… Expand"}, {"name": "Spider-Man 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/spider-man-2", "publisher": "Activision", "release_date": "Jun 29 2004", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/b7f2156e3e3e449332a62a1ca79d3465-98.jpg", "descriptions": "The city is at risk, and only you can save it from the evil clutches of an old enemy--the powerful Electro. He has a mysterious new device that makes his million volts of destruction even deadlier. But now Spider-Man has Insulated Armor, which makes him impervious to electricity, in additionThe city is at risk, and only you can save it from the evil clutches of an old enemy--the powerful Electro. He has a mysterious new device that makes his million volts of destruction even deadlier. But now Spider-Man has Insulated Armor, which makes him impervious to electricity, in addition to new powers such as Ice and Taser-Webbing. With your new bag of tricks, you can stop Electro, Sandman, and other villains' nefarious schemes to bring the city to its knees. … Expand"}, {"name": "Onimusha Blade Warriors", "details_link": "https://www.metacritic.com/game/playstation-2/onimusha-blade-warriors", "publisher": "Capcom", "release_date": "Mar 24 2004", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 65, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/36ab0d6b1e740b7cf4e88c7f244c7d89-98.jpg", "descriptions": "All of your favorite heroes from the ancient world of Onimusha gather together for one multi-battle action fighting game that will bring the world to its knees. Select your warrior from among a bold cast of characters spanning the world of Onimusha. For the first time, Samanosuke, star ofAll of your favorite heroes from the ancient world of Onimusha gather together for one multi-battle action fighting game that will bring the world to its knees. Select your warrior from among a bold cast of characters spanning the world of Onimusha. For the first time, Samanosuke, star of Onimusha Warlords can go head-to-head with Jubei Yagyu of Onimusha 2: Samurai?s Destiny. Enter into battle alone, or with up to three other opponents for lightning quick multi-player action battles that show off your skills as a warrior. Each stage is beautifully rendered to create the intense action of battle for the ultimate in hardcore fighting! [Capcom]… Expand"}, {"name": "Mafia", "details_link": "https://www.metacritic.com/game/playstation-2/mafia", "publisher": "Gathering", "release_date": "Jan 28 2004", "developers": ["Illusion Softworks"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 65, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/f4a0bb00f50715c5bf33821996b43f96-98.jpg", "descriptions": "Mafia brings the 1930's underworld to life in this 3rd person 3D action game. Rise from the lowly but well-dressed footsoldier to the envied and feared Made Man in an era of big bands, zoot suits and Model T's. Take on the role of a hitman, enforcer, getaway driver and more in your struggleMafia brings the 1930's underworld to life in this 3rd person 3D action game. Rise from the lowly but well-dressed footsoldier to the envied and feared Made Man in an era of big bands, zoot suits and Model T's. Take on the role of a hitman, enforcer, getaway driver and more in your struggle for respect, money and power within the Salieri Family. Arriving on console, Mafia has been enhanced to deliver an awesome experience that will make the Cosa Nostra look like a bunch of choirboys. [Gathering of Developers]… Expand"}, {"name": "Medal of Honor Rising Sun", "details_link": "https://www.metacritic.com/game/xbox/medal-of-honor-rising-sun", "publisher": "EA Games", "release_date": "Nov 11 2003", "developers": ["EA LA"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 65, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/b48b5261d7749aee2b3c7add5a084426-98.jpg", "descriptions": "The epic saga of World War II continues with Medal of Honor Rising Sun.  Play as Marine Corporal Joseph Griffin in a far-reaching tale of two brothers trying to prevent Japanese forces from dominating the Pacific.  Rising Sun features real-life historical battles like Pearl Harbor andThe epic saga of World War II continues with Medal of Honor Rising Sun.  Play as Marine Corporal Joseph Griffin in a far-reaching tale of two brothers trying to prevent Japanese forces from dominating the Pacific.  Rising Sun features real-life historical battles like Pearl Harbor and Guadalcanal, over 20 authentic WWII weapons, highly intelligent enemies, and a heroic cast of characters that fight on your side from level to level.  Battle other soldiers in ten multiplayer levels and an all-new two-player co-op mode.  … Expand"}, {"name": "Journey to the Center of the Earth", "details_link": "https://www.metacritic.com/game/pc/journey-to-the-center-of-the-earth", "publisher": "Viva Media", "release_date": "Oct 27 2003", "developers": ["Micro Application"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/79147ed10e8b008f49b8851ec566adfd-98.jpg", "descriptions": "Join Ariane, a determined, young journalist, who falls into the scoop of a lifetime when she discovers an unknown world far below the Earth's surface.  Explore primitive landscapes brimming with strange beasts, and encounter the fascinating civilizations that inhabit this foreign land. TheJoin Ariane, a determined, young journalist, who falls into the scoop of a lifetime when she discovers an unknown world far below the Earth's surface.  Explore primitive landscapes brimming with strange beasts, and encounter the fascinating civilizations that inhabit this foreign land. The choices Ariane makes will determine the future of this forgotten and primitive world.  Will she help save these strange beings and their home - already in peril - or launch her career by exposing their story and threatening their very existence?  Cross the threshold into the unknown for an unparalleled adventure, and come face to face with the land at the center of the Earth. [Viva Media]… Expand"}, {"name": "Marvel vs. Capcom 2", "details_link": "https://www.metacritic.com/game/xbox/marvel-vs-capcom-2", "publisher": "Capcom", "release_date": "Mar 27 2003", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 65, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/983be3856db587e59a2ae47b28441a1c-98.jpg", "descriptions": "Two powerful universes collide in Marvel vs. Capcom 2. The game mixes characters from Capcom games with superheroes from the Marvel Universe, creating a total of 56 fighters. Assemble a team of your favorite heroes and villains for intense three-on-three tag-team matches. Each character typeTwo powerful universes collide in Marvel vs. Capcom 2. The game mixes characters from Capcom games with superheroes from the Marvel Universe, creating a total of 56 fighters. Assemble a team of your favorite heroes and villains for intense three-on-three tag-team matches. Each character type has an array of special attributes and, with the right team combination, you can pull off amazing super combos and special moves.… Expand"}, {"name": "Star Wars: Bounty Hunter", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-bounty-hunter", "publisher": "LucasArts", "release_date": "Nov 19 2002", "developers": ["LucasArts"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/0e8ad017aaa41079e63c9410cb9a5f4c-98.jpg", "descriptions": "The Hunt Begins! You are Jango Fett, the galaxy's most dangerous bounty hunter, hired to hunt down the elusive leader of a mysterious cult - dead or alive. Through 18 action-packed levels across six diverse worlds, face off against galactic scum, fearsome beasts, and brutal competition thatThe Hunt Begins! You are Jango Fett, the galaxy's most dangerous bounty hunter, hired to hunt down the elusive leader of a mysterious cult - dead or alive. Through 18 action-packed levels across six diverse worlds, face off against galactic scum, fearsome beasts, and brutal competition that stands between you and your prey: a deranged dark Jedi. This hunt will lead you to the darkest corners of the Star Wars universe where no one else has dared to go, but you are the fearless, ruthless, and relentless Jango Fett. For the galaxy's most wanted, there is no place to hide... [LucasArts]… Expand"}, {"name": "Monster Force", "details_link": "https://www.metacritic.com/game/game-boy-advance/monster-force", "publisher": "Universal Interactive", "release_date": "Sep 29 2002", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/68aeea90f9e965e49e10488091b3ee26-98.jpg", "descriptions": "Digital Eclipse is giving Universal's monsters a facelift in this Gauntlet-inspired GBA game."}, {"name": "US Open 2002", "details_link": "https://www.metacritic.com/game/pc/us-open-2002", "publisher": "Strategy First", "release_date": "Aug 14 2002", "developers": ["Wanadoo"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/41f51b71466d12af7b141d3bf1c3469a-98.jpg", "descriptions": "Have you ever dreamed of stepping into a famous player?s shoes, playing on the centre court or having your winning shot applauded by a jubilant crowd? For those of you who want to try your luck on the courts this summer, US OPEN 2002 will give you access to the most prestigious tennis courtsHave you ever dreamed of stepping into a famous player?s shoes, playing on the centre court or having your winning shot applauded by a jubilant crowd? For those of you who want to try your luck on the courts this summer, US OPEN 2002 will give you access to the most prestigious tennis courts in the world. [Strategy First Inc.]… Expand"}, {"name": "Dark Eclipse", "details_link": "https://www.metacritic.com/game/playstation-4/dark-eclipse", "publisher": "SunSoft", "release_date": "Sep 25 2018", "developers": ["SunSoft"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/9e2581d4ff5cb69e8258e68468b6d7c1-98.jpg", "descriptions": "Dark Eclipse is PS4’s first ever VR MOBA. Command a team of three Leaders, each with their own unique characteristics and abilities, and battle for supremacy in the post-apocalyptic dark fantasy world of Oldus."}, {"name": "Dynasty Warriors 8", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-8", "publisher": "Tecmo Koei America Corp.", "release_date": "Jul 16 2013", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/c315ab6fbd3d80b1e8bcc9775f63d8c0-98.jpg", "descriptions": "Dynasty Warriors 8 is a tactical action game that follows the stories of the kingdoms of Wei, Wu, Shu and Jin through the actions of historical military and political figures of the time as they fight to wrest control over the Three Kingdoms of China."}, {"name": "Need for Speed: The Run", "details_link": "https://www.metacritic.com/game/3ds/need-for-speed-the-run", "publisher": "Electronic Arts", "release_date": "Nov 15 2011", "developers": ["Firebrand Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "3DS"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/7a78ae160ccd0cb251672a0686481b5d-98.jpg", "descriptions": "Need for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on - and it isn't just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passesNeed for Speed The Run lures players into an underground world of illicit, high-stakes racing. The heat is on - and it isn't just the fuzz who are after you. Entering the race is just the beginning as you blow across borders, weave through dense urban traffic, rocket down icy mountain passes and navigate narrow canyons at breakneck speeds. Powered by DICE's state-of-the-art Frostbite 2 engine, Need for Speed The Run takes the action racing genre to new heights with stunning visuals and car physics that hug the road even at top speeds all built around a gripping storyline. The cars are hot, the racing is intense and the story will have you at the edge of your seat… all the way from the Golden Gate Bridge to the Empire State building.… Expand"}, {"name": "Smarty Pants", "details_link": "https://www.metacritic.com/game/wii/smarty-pants", "publisher": "Electronic Arts", "release_date": "Nov 13 2007", "developers": ["Planet Moon Studios"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/0c66c55625571c28e49afb3a62d8ce86-98.jpg", "descriptions": "How smart are you? Do you know more than your Grandma about world history? Does your little sister know more than your Dad about sports? Smarty Pants levels the playing field for friends and family, combining age-targeted trivia with action-based gestures, making it a trulyHow smart are you? Do you know more than your Grandma about world history? Does your little sister know more than your Dad about sports? Smarty Pants levels the playing field for friends and family, combining age-targeted trivia with action-based gestures, making it a truly trans-generational game for the Wii. The game tailors questions to the contestant's age, allowing friends and family members ages eight to eighty to play simultaneously. The game tracks every player’s answers, and adjusts the difficulty level to provide continuous stimulation and challenge. Exciting Wii gestures make everything a game, from spinning the category wheel and tug-of-wars over correct answers, to \"dance-offs\" for additional points. The game also features a family mode, where everyone tries to beat the clock and a rapid-fire competitive mode for groups of friends. The game features both competitive and collaborative game modes and 20,000 questions in multiple categories. [Electronic Arts]… Expand"}]