[
  {
    "name": "Sakura Wars: So Long, My Love",
    "details_link": "https://www.metacritic.com/game/wii/sakura-wars-so-long-my-love",
    "publisher": "NIS America",
    "release_date": "Mar 30 2010",
    "developers": [
      "Idea Factory"
    ],
    "platforms": [
      "PlayStation 2",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy",
      "Fantasy",
      "Tactics"
    ],
    "meta_score": 75,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/1dabc93ce4b6a61b60d77cb3918d742d-98.jpg",
    "descriptions": "Sakura Wars: So Long, My Love combines the epic battles of an RPG with the character interaction and development of a sim game in the free-roaming environment of 1920s New York City. Pilot mechs, perform in plays, and experience action and adventure in this Steampunk Extravaganza."
  },
  {
    "name": "Quake 4",
    "details_link": "https://www.metacritic.com/game/xbox-360/quake-4",
    "publisher": "Activision",
    "release_date": "Nov 18 2005",
    "developers": [
      "Raven Software"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 75,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/4/5358a0ffdfc853cc9b0352f89cf9e20e-98.jpg",
    "descriptions": "Quake 4 is the first game to utilize id Software's revolutionary DOOM 3 technology.  In the game, you are Matthew Kane, an elite member of Rhino Squad and Earth's valiant invasion force.  Fight alone, with your squad, and in hover tanks and mechanized walkers as you engage in a heroicQuake 4 is the first game to utilize id Software's revolutionary DOOM 3 technology.  In the game, you are Matthew Kane, an elite member of Rhino Squad and Earth's valiant invasion force.  Fight alone, with your squad, and in hover tanks and mechanized walkers as you engage in a heroic mission into the heart of the Strogg war machine.  But, in this epic war between worlds, the only way to defeat the Strogg is to become one of them.  Battle through early missions as a deadly marine, then after your capture as a marine-turned-Strogg with enhanced abilities and the power to turn the tide of the war. [Activision]… Expand"
  },
  {
    "name": "Crash Bandicoot 2: N-Tranced",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/crash-bandicoot-2-n-tranced",
    "publisher": "Universal Interactive",
    "release_date": "Jan  7 2003",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/adfaebc09fdec9bfd271ef9b0b50802d-98.jpg",
    "descriptions": "Crash is back and ready to take on an all-new nefarious villain.  After the events of Crash Bandicoot: The Huge Adventure, Tropy, with the help of N. Trance, kidnaps Coco and Crunch, planning to brainwash them to the evil side.  Now, Crash must travel to N. Trance's twisted realm, battle andCrash is back and ready to take on an all-new nefarious villain.  After the events of Crash Bandicoot: The Huge Adventure, Tropy, with the help of N. Trance, kidnaps Coco and Crunch, planning to brainwash them to the evil side.  Now, Crash must travel to N. Trance's twisted realm, battle and rescue Coco and Crunch, and ultimately defeat N. Trance and N. Tropy.  To achieve these goals, you must use all of Crash's spin, slide, and jumping abilities across 24 different levels.  As you progress through the game, you'll find yourself flying a helicopter, water-skiing, and piloting a spaceship--all for the sake of saving your friends.… Expand"
  },
  {
    "name": "Dead Head Fred",
    "details_link": "https://www.metacritic.com/game/psp/dead-head-fred",
    "publisher": "D3Publisher",
    "release_date": "Aug 28 2007",
    "developers": [
      "Vicious Cycle"
    ],
    "platforms": "PSP",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 75,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/8/e0c251c35a03fabbad1ac7b0896aedd6-98.jpg",
    "descriptions": "Dead Head Fred draws players into an original alternative universe as they embark on a quest for vengeance to solve their own murder by using the decapitated heads of enemies to battle through environments designed to showcase each head's unique abilities. In Dead Head Fred, players take onDead Head Fred draws players into an original alternative universe as they embark on a quest for vengeance to solve their own murder by using the decapitated heads of enemies to battle through environments designed to showcase each head's unique abilities. In Dead Head Fred, players take on the persona of private detective Fred Neuman. Savagely murdered and then resurrected in a bizarre scientific experiment, Fred is without his memory or his head! The game immerses players in the action with the most revolutionary camera to date on a handheld device as they collect, upgrade and switch heads on the fly to strategically fight malformed mutants, ghoulish gangsters, and maniacal mob bosses in a unique and compelling story of revenge and redemption. [D3Publisher of America]… Expand"
  },
  {
    "name": "DiRT Showdown",
    "details_link": "https://www.metacritic.com/game/xbox-360/dirt-showdown",
    "publisher": "Codemasters",
    "release_date": "Jun 12 2012",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Rally / Offroad",
      "Driving",
      "Racing",
      "Simulation",
      "Rally / Offroad",
      "Automobile"
    ],
    "meta_score": 75,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/3/80a75597d3be1de44a592804f01d1d6d-98.jpg",
    "descriptions": "Dirt Showdown is an arcade spin-off of the Dirt series featuring over-the-top Hoonigan, Demolition, and Race events."
  },
  {
    "name": "Steel Assault",
    "details_link": "https://www.metacritic.com/game/switch/steel-assault",
    "publisher": "Tribute Games",
    "release_date": "Sep 28 2021",
    "developers": [
      "Zenovia"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "genres": [
      "Action",
      "Platformer",
      "Shooter",
      "First-Person",
      "2D",
      "Arcade"
    ],
    "meta_score": 75,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/83a219bbb4f7da85863eb8c0896b796e-98.jpg",
    "descriptions": "Punch, whip, and zipline your way through a post-apocalyptic America in this 16-bit retro-style action platformer! Play as Taro Takahashi, a resistance soldier on a revenge mission against the dictator who lords over the ashes."
  },
  {
    "name": "Chernobylite",
    "details_link": "https://www.metacritic.com/game/pc/chernobylite",
    "publisher": "The Farm 51",
    "release_date": "Jul 28 2021",
    "developers": [
      "The Farm 51"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 75,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/cb525c5ef99c7e60d47131ba693dc1f1-98.jpg",
    "descriptions": "Chernobylite is an RPG survival horror mixing free exploration of disturbing locations with challenging combat, unique crafting, and non-linear science-fiction story. Build your team, survive and reveal the twisted secrets of Chernobyl in the 3D-scanned recreation of the Exclusion Zone."
  },
  {
    "name": "DreamWorks Kung Fu Panda",
    "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-kung-fu-panda",
    "publisher": "Activision",
    "release_date": "Jun  3 2008",
    "developers": [
      "Luxoflux",
      "Inc."
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 75,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/3f40976b206266489f8e3da5ab263729-98.jpg",
    "descriptions": "In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13 legendary levels from the movie and beyond, and spanning land, water and air, players must work their way to become the Dragon Warrior and defeat the ultimate enemy, Tai Lung, as they battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles. Featuring a deep variety of gameplay, unique co-op and competitive multiplayer modes, collectibles, and a host of character upgrades, the Kung Fu Panda video game provides an experience gamers of all ages will enjoy. [Activision]… Expand"
  },
  {
    "name": "Push Me Pull You",
    "details_link": "https://www.metacritic.com/game/playstation-4/push-me-pull-you",
    "publisher": "House House",
    "release_date": "May  3 2016",
    "developers": [
      "House House"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "genres": [
      "Sports",
      "General"
    ],
    "meta_score": 75,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/2/33d8f249988306319811ff8db79392f2-98.jpg",
    "descriptions": "Push Me Pull You is a four-player videogame about friendship and wrestling. Joined at the waist, you and your partner share a single worm-like body and must wrestle the other sports-monster for control of the ball. It’s a bit like a big hug, or playing soccer with your small intestines. WithPush Me Pull You is a four-player videogame about friendship and wrestling. Joined at the waist, you and your partner share a single worm-like body and must wrestle the other sports-monster for control of the ball. It’s a bit like a big hug, or playing soccer with your small intestines. With every action affecting both you and your partner (and mandatory shouting) PMPY combines the best parts of 2v2 local multiplayer with the worst parts of your last breakup.… Expand"
  },
  {
    "name": "Shank",
    "details_link": "https://www.metacritic.com/game/playstation-3/shank",
    "publisher": "Electronic Arts",
    "release_date": "Aug 24 2010",
    "developers": [
      "Klei Entertainment"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/3/aa54b17c1ebde3d0e4863b7cb69721b6-98.jpg",
    "descriptions": "Shank is a new game that a small team at Klei is working on. It's an over-the-top action/adventure, built with all the things that we at Klei are passionate about: amazing control, great animation, immersive environment, and everything else that we feel like, and none of the stuff we don't."
  },
  {
    "name": "Yomawari: Night Alone",
    "details_link": "https://www.metacritic.com/game/playstation-vita/yomawari-night-alone",
    "publisher": "NIS America",
    "release_date": "Oct 25 2016",
    "developers": [
      "Nippon Ichi Software"
    ],
    "platforms": [
      "PC",
      "PlayStation Vita"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "General",
      "3D",
      "Survival",
      "First-Person"
    ],
    "meta_score": 75,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/8/06664ddb9ae5dbcbf07998d1895e4119-98.jpg",
    "descriptions": "Yomawari: Night Alone is an isometric survival horror where you guide a young girl through the streets of her hometown, ridden with unnerving spirits, to help find her missing dog and sister."
  },
  {
    "name": "Kingdom Hearts 358/2 Days",
    "details_link": "https://www.metacritic.com/game/ds/kingdom-hearts-3582-days",
    "publisher": "Square Enix",
    "release_date": "Sep 29 2009",
    "developers": [
      "h.a.n.d. Inc."
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 75,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/0/ef5358d89c0b7d71e4b7305b348e2c44-98.jpg",
    "descriptions": "Kingdom Hearts 358/2 Days revolves around Roxas, the \"other\" hero from King Hearts II. Players follow Roxas through his days among Organization XIII's ranks, unraveling the events that took place during the year that Sora was asleep, and ultimately revealing one of the Kingdom Hearts saga'sKingdom Hearts 358/2 Days revolves around Roxas, the \"other\" hero from King Hearts II. Players follow Roxas through his days among Organization XIII's ranks, unraveling the events that took place during the year that Sora was asleep, and ultimately revealing one of the Kingdom Hearts saga's most shocking secrets. Players and their friends join Roxas, his friend Axel and the mysterious fourteenth member of Organization XIII on a journey across charming, vibrant worlds full of Square Enix’s and Disney’s beloved characters. Additionally, KINGDOM HEARTS 358/2 Days uses the local wireless capabilities of Nintendo DS to introduce the series’ first ever multiplayer mode, in which players can take control of their favorite Organization XIII members and tackle a variety of missions on their own terms. In KINGDOM HEARTS, Sora turned the Keyblade on himself in order to release Kairi’s heart, but his heart was also released in the process. This brought about the creation of Roxas, Sora’s Nobody. Unlike most Nobodies, however, Roxas has no memories of his past. He joins Organization XIII and slowly begins to discover the truth behind his existence and the Organization itself. He meets and befriends the fourteenth member of the Organization, who also has no recollection of her past. What will Roxas see during his time in the Organization? What is the connection between him, Sora and the fourteenth member? And what becomes of them? Dive into the heart of the KINGDOM HEARTS storyline’s biggest secrets. A series-first multiplayer mode, allowing up to four players to control any Organization XIII member. Learn about the origins of the \"Organization XIII\" name. Get to know the members of Organization XIII, including the mysterious fourteenth member. Finally experience the KINGDOM HEARTS storyline’s missing chapter. [Square Enix]… Expand"
  },
  {
    "name": "Darkwatch",
    "details_link": "https://www.metacritic.com/game/xbox/darkwatch",
    "publisher": "Capcom",
    "release_date": "Aug 16 2005",
    "developers": [
      "High Moon Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "16  Online",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Fantasy"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/3cd3f20739297042536ebfc2e176d4d1-98.jpg",
    "descriptions": "Darkwatch: Curse of the West blends vampire horror with western genres.  Darkwatch is a secret strike-force that has a protected man from evil since the dawn of civilization.  You play its newest and deadliest agent, Jericho Cross, an outlaw gunslinger hunting the vampire that bit him.Darkwatch: Curse of the West blends vampire horror with western genres.  Darkwatch is a secret strike-force that has a protected man from evil since the dawn of civilization.  You play its newest and deadliest agent, Jericho Cross, an outlaw gunslinger hunting the vampire that bit him.  Blast your way through an American frontier overrun by the undead using your arsenal of powerful assault vehicles, enhanced versions of Western weapons, supernatural vampire abilities, and your trusty undead horse.   In this frightening version of the Wild West, you're never safe.… Expand"
  },
  {
    "name": "Monster Energy Supercross - The Official Videogame 5",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/monster-energy-supercross---the-official-videogame-5",
    "publisher": "Milestone S.r.l",
    "release_date": "Mar 14 2022",
    "developers": [
      "Milestone S.r.l"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Racing",
      "Simulation",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 75,
    "users_score": 1.9,
    "image": "https://static.metacritic.com/images/products/games/4/9825c088a9bc0bf8f1268e5dc5784faf-98.jpg",
    "descriptions": "Enjoy all new customization possibilities with our enhanced Track Editor, and give a boost to your creativity! Mix and match pre-existing modules with the brand new Rhythm Section Editor, to design complex prefab track sections, ready to be shared with the Community. Creating amazing jumpsEnjoy all new customization possibilities with our enhanced Track Editor, and give a boost to your creativity! Mix and match pre-existing modules with the brand new Rhythm Section Editor, to design complex prefab track sections, ready to be shared with the Community. Creating amazing jumps has never been easier. Bring the challenge to a whole new level of fun with the new Split Screen Mode, for exciting Multiplayer challenges to race shoulder to shoulder with your friends on the couch! And when the couch is not enough, compete in exciting races online against the whole world. … Expand"
  },
  {
    "name": "Exit",
    "details_link": "https://www.metacritic.com/game/xbox-360/exit",
    "publisher": "Taito Corporation",
    "release_date": "Oct 24 2007",
    "developers": [
      "Taito Corporation"
    ],
    "platforms": "Xbox 360",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 75,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/e42c9d0c4dbf61b8a1d12f3ebe56cf74-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Meet Mr. ESC, otherwise known as Mr. Escape. Mr. ESC is an escape artist whose objective is to save people from disastrous situations, clearing each danger-filled stage within a limited amount of time. Save lives in EXIT, a frantic, mind-stretching, action-packed puzzle[Xbox Live Arcade]  Meet Mr. ESC, otherwise known as Mr. Escape. Mr. ESC is an escape artist whose objective is to save people from disastrous situations, clearing each danger-filled stage within a limited amount of time. Save lives in EXIT, a frantic, mind-stretching, action-packed puzzle game! Frantic rescue action: As Mr. ESC, take control and rescue people from dangers like fires and earthquakes. Turn them into Companions and lead them to safety. Puzzle-solving skills required: Use your Companions by commanding them to use items, solve puzzles, and reach the exit within the time limit. Companion abilities: The different Companions you save have different abilities. Young Companions have average abilities, Adults are strong, and Kids can make it through tight passages. Be sure to save the injured Patients as well. Multiple stages: There are over 120 challenging stages to escape, and even more stages will be available for download. Twelve new achievements and leaderboard: Master twelve new achievements, and compete for the best stage times on the leaderboards to prove you are the greatest escape artist in the world. [Microsoft]… Expand"
  },
  {
    "name": "Kerbal Space Program",
    "details_link": "https://www.metacritic.com/game/xbox-one/kerbal-space-program",
    "publisher": "SQUADTeam",
    "release_date": "Jul 15 2016",
    "developers": [
      "Flying Tiger Entertainment Inc.",
      "Squad"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Simulation",
      "Space",
      "Combat",
      "Civilian"
    ],
    "meta_score": 75,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/3/f0736326e42e7216102608f0acf41ef5-98.jpg",
    "descriptions": "Kerbal Space Program puts you in charge of the recently launched space program for a fun & clever alien race – the Kerbals. These little guys are counting on you to build spaceships, rockets & vehicles that can take off & hold on during COOL space travel missions, without hurting them in theKerbal Space Program puts you in charge of the recently launched space program for a fun & clever alien race – the Kerbals. These little guys are counting on you to build spaceships, rockets & vehicles that can take off & hold on during COOL space travel missions, without hurting them in the process. [Xbox.com]… Expand"
  },
  {
    "name": "Resident Evil: Revelations 2",
    "details_link": "https://www.metacritic.com/game/xbox-one/resident-evil-revelations-2",
    "publisher": "Capcom",
    "release_date": "Mar 17 2015",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "2 ",
    "genres": [
      "Horror",
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/0c2c4d41f345b984b976188776f43384-98.jpg",
    "descriptions": "In Revelations 2, Raid Mode begins with choosing a character, and there are several characters to match all tastes. After that, you'll customize your weapons and skills to prepare for deployment. Raid Mode has been about collecting loot such as weapons, custom parts, and currency; inIn Revelations 2, Raid Mode begins with choosing a character, and there are several characters to match all tastes. After that, you'll customize your weapons and skills to prepare for deployment. Raid Mode has been about collecting loot such as weapons, custom parts, and currency; in Revelations 2, you'll also find treasure chests thrown into the mix. Remember, however, your ultimate goal is to find and break the goal emblem at the end of each stage. Raid Mode allows for cooperative play -- including local two-player split-screen. Grab a friend and get ready to shoot your way through this additional mode. … Expand"
  },
  {
    "name": "Samurai Warriors 5",
    "details_link": "https://www.metacritic.com/game/playstation-4/samurai-warriors-5",
    "publisher": "Koei Tecmo Games",
    "release_date": "Jul 27 2021",
    "developers": [
      "Koei Tecmo Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "3D"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/0/51170a8e1a8c6c4e76cf9051752c2b28-98.jpg",
    "descriptions": "Experience exhilarating action set in a dramatic historical setting in Samurai warriors 5. As the latest numbered entry in the Samurai warriors franchise, the story, characters, and visuals have been re-imagined to set the stage for a thrilling new series. The story takes place after theExperience exhilarating action set in a dramatic historical setting in Samurai warriors 5. As the latest numbered entry in the Samurai warriors franchise, the story, characters, and visuals have been re-imagined to set the stage for a thrilling new series. The story takes place after the ōnin war during the Golden age of the Sengoku period, and features a story that centers on the lives of two of the most representative military commanders of this era: nobunaga oda and mitsuhide akechi. Choose from a number of new and returning characters while utilizing new abilities to take on evolving enemy forces. Experience electrifying Musou action like never before in Samurai warriors 5! Features: • announced and showcased on Nintendo direct with over 1.4mm real-time viewers. Featured on this week on Xbox. • experience an intense historical drama set during Japan's Sengoku period, told from the perspective of this era's foremost military commanders: nobunaga oda and mitsuhide akechi. • 27 playable characters - both returning heroes and brand new characters have received re-imagined designs in order to Showcase the captivating world of the Sengoku period. • Enjoy exhilarating strategic action on an evolved Battlefield. Enemy forces continue to evolve as time passes in the story, making full use of a number of different military tactics to take on the player. … Expand"
  },
  {
    "name": "Sly Cooper: Thieves in Time",
    "details_link": "https://www.metacritic.com/game/playstation-3/sly-cooper-thieves-in-time",
    "publisher": "SCEA",
    "release_date": "Feb  5 2013",
    "developers": [
      "Sanzaru Games"
    ],
    "platforms": [
      "PlayStation Vita",
      "PlayStation 3"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D",
      "Action Adventure",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 75,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/8/6db4fd9384b5bae85ac2a2f03bc6bf03-98.jpg",
    "descriptions": "Sly Cooper Thieves in Time continues to chronicle the adventures of the Sly Cooper gang from where Sly 3: Honor Among Thieves concluded."
  },
  {
    "name": "Final Fantasy Fables: Chocobo Tales",
    "details_link": "https://www.metacritic.com/game/ds/final-fantasy-fables-chocobo-tales",
    "publisher": "Square Enix",
    "release_date": "Apr  3 2007",
    "developers": [
      "h.a.n.d. Inc."
    ],
    "platforms": "DS",
    "num_players": "4  Online",
    "genres": [
      "Role-Playing",
      "Action Adventure",
      "Adventure",
      "Console-style RPG",
      "General",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 75,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/6/ae3c60421f90d697c87d5726e49486b1-98.jpg",
    "descriptions": "(Also known as \"Chocobo and the Magic Picture Book\")  Final Fantasy Fables: Chocobo Tales begins with the Final Fantasy black magician bringing a picture book onto the Chocobo farm. This book is home to the great devil Bebuzu, and it sucks the entire farm into its pages. Chocobo embarks on(Also known as \"Chocobo and the Magic Picture Book\")  Final Fantasy Fables: Chocobo Tales begins with the Final Fantasy black magician bringing a picture book onto the Chocobo farm. This book is home to the great devil Bebuzu, and it sucks the entire farm into its pages. Chocobo embarks on an adventure with the white and black magicians in order to stop Bebezu from reviving himself to full form. Final Fantasy Fables: Chocobo Tales combines the field exploration of an RPG, with card-based battles. You are free to move about through the game's picture book influenced world. Encounter an enemy, and you find yourself in a card battle, referred to officially as a \"Pop-Up Duel.\" You and your enemies take turns sending out cards to perform attacks.… Expand"
  },
  {
    "name": "Dark Fall 3: Lost Souls",
    "details_link": "https://www.metacritic.com/game/pc/dark-fall-3-lost-souls",
    "publisher": "Strategy First",
    "release_date": "Apr 21 2010",
    "developers": [
      "Darkling Room"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person",
      "Modern",
      "Modern"
    ],
    "meta_score": 75,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/4/2cb7fbf23a98bc0ab61caaa00923f916-98.jpg",
    "descriptions": "The third game in the Dark Fall adventure game series."
  },
  {
    "name": "Pro Evolution Soccer 2009",
    "details_link": "https://www.metacritic.com/game/psp/pro-evolution-soccer-2009",
    "publisher": "Konami",
    "release_date": "Nov 11 2008",
    "developers": [
      "Konami"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "PSP"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 75,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/74ee41ba4484163765cc80ea3cc52999-98.jpg",
    "descriptions": "Known by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor theKnown by fans for its superior gameplay and incredible realism, PES 2009 further bridges the gap between PES and the real thing. The game has undergone a graphical update to ensure its players look more like their real-life counterparts. Similarly, all-new options allow users to tailor the game to their own tastes, while new stylish moves, innovative control schemes and key online elements further the realism. [Konami]… Expand"
  },
  {
    "name": "Blitzkrieg: Burning Horizon",
    "details_link": "https://www.metacritic.com/game/pc/blitzkrieg-burning-horizon",
    "publisher": "cdv Software",
    "release_date": "Jun 13 2004",
    "developers": [
      "Nival Interactive"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Real-Time",
      "Historic",
      "General",
      "Historic",
      "Tactics"
    ],
    "meta_score": 75,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/6/2d4ba356ba62c907258184f72a6a908a-98.jpg",
    "descriptions": "Burning Horizon, throws you in even more dramatic battles of WWII. Burning Horizon offers a huge 18-missions-campaign around General Rommel, giving you the opportunity to play famous battles like Ardennes, Tripolis, Tobruk, El Alamein, Sicily and, of course, Normandy. Furthermore, the add-onBurning Horizon, throws you in even more dramatic battles of WWII. Burning Horizon offers a huge 18-missions-campaign around General Rommel, giving you the opportunity to play famous battles like Ardennes, Tripolis, Tobruk, El Alamein, Sicily and, of course, Normandy. Furthermore, the add-on contains 8 single missions, with an entire new nation at war: Japan. 50 new units like Zero fighters and Blenheim bombers, the M5 Stuart and many specialized German tanks, US Marines and Afrika Korps units fill the strategy package. Burning Horizon gives the parties a better AI: the enemy seeks weak spots in your lines, clears minefields, handles his air force cleverly. The mission objectives offer a wide range, e.g. airborne assaults, evacuations, covert ops, defense manoeuvres, counter attacks or assassinations. [CDV Software]… Expand"
  },
  {
    "name": "Transformers",
    "details_link": "https://www.metacritic.com/game/playstation-2/transformers",
    "publisher": "Atari",
    "release_date": "May 11 2004",
    "developers": [
      "Melbourne House"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Sci-Fi"
    ],
    "meta_score": 75,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/6/5a1e4117c60ec8c8f0f5b6abf7e73abb-98.jpg",
    "descriptions": "Transformers is a fast-paced third-person action/combat game which puts the player in control of Optimus Prime, Hot Shot and Red Alert across 8 different environments on Earth and Cybertron. Features include 40 different kinds of mini-con upgrades, 20 assorted types weapons, and the abilityTransformers is a fast-paced third-person action/combat game which puts the player in control of Optimus Prime, Hot Shot and Red Alert across 8 different environments on Earth and Cybertron. Features include 40 different kinds of mini-con upgrades, 20 assorted types weapons, and the ability to transform from vehicle to robot form. Released exclusively for PlayStation 2.… Expand"
  },
  {
    "name": "Jurassic Park: Operation Genesis",
    "details_link": "https://www.metacritic.com/game/playstation-2/jurassic-park-operation-genesis",
    "publisher": "VU Games",
    "release_date": "Mar 25 2003",
    "developers": [
      "Blue Tongue Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Tycoon"
    ],
    "meta_score": 75,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/0/b3f08be32e7907eedc67acb82c556cc2-98.jpg",
    "descriptions": "Now is your chance to fulfill Dr. John Hammond's dream by successfully designing and managing the ultimate dinosaur theme park. Jurassic Park: Operation Genesis allows gamers to create the most amazing theme park he world has ever seen. As the first ever fully 3D action-sim, OperationNow is your chance to fulfill Dr. John Hammond's dream by successfully designing and managing the ultimate dinosaur theme park. Jurassic Park: Operation Genesis allows gamers to create the most amazing theme park he world has ever seen. As the first ever fully 3D action-sim, Operation Genesis gives players two games in one. Either build the ultimate dinosaur theme park or engage in 12 action-packed missions that will truly test your gaming skills. Dream it. Build it. Survive it. This truly is Jurassic Park... your way! [Vivendi Universal]… Expand"
  },
  {
    "name": "BloodRayne",
    "details_link": "https://www.metacritic.com/game/playstation-2/bloodrayne",
    "publisher": "Majesco Games",
    "release_date": "Oct 15 2002",
    "developers": [
      "Terminal Reality"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 75,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/402d2501dbfb1bb46314b2a8f7d534c8-98.jpg",
    "descriptions": "As the half-vampire BloodRayne, you have sworn your life to protect humanity from the supernatural. Your latest assignment: Seek and destroy the nefarious vampire Jurgen Wolf before he can use powerful occult relics to unleash untold horror upon the world. Slaughter, dismember, and beheadAs the half-vampire BloodRayne, you have sworn your life to protect humanity from the supernatural. Your latest assignment: Seek and destroy the nefarious vampire Jurgen Wolf before he can use powerful occult relics to unleash untold horror upon the world. Slaughter, dismember, and behead devious enemies that seek reinforcements and plan ambushes. Acquire supernatural skills and master brutal weaponry as you progress. BloodRayne is a pulse-pounding thrillride that gets you by the jugular and won't let go until it's over. [Majesco]… Expand"
  },
  {
    "name": "Beyond Atlantis II",
    "details_link": "https://www.metacritic.com/game/pc/beyond-atlantis-ii",
    "publisher": "DreamCatcher Interactive",
    "release_date": "Oct 24 2001",
    "developers": [
      "Cryo Interactive"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "General"
    ],
    "meta_score": 75,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/5/bd9c8c24e7bd08efbe93f916454df017-98.jpg",
    "descriptions": "A young archeologist searches for the existence of a metropolis built, according to myth and legend, by the ancient Egyptians...From the palaces of the Thousand and One Nights to the Sahara Desert, from the Egyptian Book of the Dead to the icy plains of the Paleolithic, immerse yourself...A young archeologist searches for the existence of a metropolis built, according to myth and legend, by the ancient Egyptians...From the palaces of the Thousand and One Nights to the Sahara Desert, from the Egyptian Book of the Dead to the icy plains of the Paleolithic, immerse yourself... [DreamCatcher Interactive] -  Also known as \"Atlantis 3: The New World\"… Expand"
  },
  {
    "name": "Toy Story 2: Buzz Lightyear to the Rescue!",
    "details_link": "https://www.metacritic.com/game/playstation/toy-story-2-buzz-lightyear-to-the-rescue!",
    "publisher": "Activision",
    "release_date": "Nov 30 1999",
    "developers": [
      "Traveller's Tales"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 75,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/1/20c0f8cad982acfd22f6eedc95d38519-98.jpg",
    "descriptions": "As space hero Buzz Lightyear, you've got your hands full. Your best buddy, Woody, has been kidnapped by a greedy toy collector and it's going to be an all-out race against time to save him."
  },
  {
    "name": "Need for Speed: Hot Pursuit Remastered",
    "details_link": "https://www.metacritic.com/game/playstation-4/need-for-speed-hot-pursuit-remastered",
    "publisher": "Electronic Arts",
    "release_date": "Nov  6 2020",
    "developers": [
      "Criterion Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Racing",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 75,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/2/589799f0000129f0981bfc480eb6181f-98.jpg",
    "descriptions": "Feel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponryFeel the thrill of the chase and the rush of escape in Need for Speed™ Hot Pursuit Remastered on Nintendo Switch™. Unleash a savage sense of speed both as an outlaw and a cop in the world's hottest high-performance cars. Outsmart the heat or take down lawbreakers with the tactical weaponry at your disposal in a heart-pumping, socially competitive racing experience. Updated with enhanced visuals, cross-platform multiplayer – including the asynchronous competition powered by Autolog – plus all additional DLC content, this is the ultimate edition of Criterion Games’ critically acclaimed Need for Speed debut. It’s time to reignite the pursuit.\r CROSS-PLATFORM MULTIPLAYER AND AUTOLOG – Bolt down the winding Seacrest County roads headfirst in racing that is socially competitive at its core. The groundbreaking Autolog connects you and your friends in head-to-head pursuits and races and instinctively delivers challenges based on your friends’ activities. This highly dynamic system is fueled by friendly competition and is now supported with cross-platform sync and new multiplayer gameplay so that you can race each other no matter what platform you are on.\r ALL DLC INCLUDED, PLUS MORE UPDATES – Get all the additional DLC content delivered at launch including an extra six hours of gameplay and more than 30 challenges. Brand new achievements, wraps, car colors, reduced hard stops, an updated photo mode and gallery, and multiple quality of life updates create an even more well-rounded gameplay experience this time around.\r EXOTIC CARS WITH WEAPONS – Drive the world’s most desirable supercars on both sides of the law. Bust suspects in supercharged cop interceptors enhanced with tactical weaponry, or level the playing field with counterattacks and defensive maneuvers as an elite racer. Strategize to gain an edge over the competition, no matter what side you’re on!\r CHASE AND ESCAPE – A deep and fully-defined single-player career delivers the action of both cops and racers, with a seamlessly linked multiplayer experience across all race modes. Take on friends or play through the career solo to earn Bounty and unlock new cars, weapons, and equipment.\r ENHANCED VISUALS – Need for Speed: Hot Pursuit Remastered delivers a timeless racing experience updated for today’s generation of hardware with enhanced visuals.… Expand"
  },
  {
    "name": "Sleeping Dogs: Definitive Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/sleeping-dogs-definitive-edition",
    "publisher": "Square Enix",
    "release_date": "Oct 14 2014",
    "developers": [
      "United Front Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "Open-World"
    ],
    "meta_score": 75,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/17f791c76bf4bec86ca0d1ef48efcd04-98.jpg",
    "descriptions": "The Definitive Edition of the critically acclaimed, award winning open-world action adventure, reworked, rebuilt and re-mastered for Xbox One. All 24 previously available DLC extensions from the Xbox 360 version have been integrated into the game, including the story-extending episode YearThe Definitive Edition of the critically acclaimed, award winning open-world action adventure, reworked, rebuilt and re-mastered for Xbox One. All 24 previously available DLC extensions from the Xbox 360 version have been integrated into the game, including the story-extending episode Year of the Snake and the horror-themed Nightmare in North Point. Alongside a wealth of new technological, audio and visual improvements, Hong Kong has never felt so alive. A vibrant, neon city teaming with life, Hong Kongs exotic locations and busy streets and markets hide one of the most powerful and dangerous criminal organizations in the world: the notorious Triads. Play as Wei Shen - the highly skilled undercover cop trying to take down the Triads from the inside out. You'll have to prove yourself worthy as you fight your way up the organization, taking part in brutal criminal activities without blowing your cover. Destroy your opponents in brutal hand-to-hand combat using an unmatched martial arts system. Dominate Hong Kongs buzzing streets in thrilling illegal street races and tear it up in explosive firearms action. Sleeping Dogs Hong Kong is the ultimate playground. Undercover, the rules are different.\rFEATURES:\r-With all previously available content included and a wealth of new improvements, Hong Kong has never felt so alive.\r-A mature, gritty undercover cop drama where a wrong decision can blow your cover at any time.\r-Explosive action fuelled by a seamless mix of deadly martial arts, intense gunfights and brutal takedowns.\r-Epic high-speed thrills: Burn up the streets or tear up the sea in a vast array of exotic cars, superbikes and speedboats.\r-Hong Kong is your ultimate playground: Enter illegal street races, gamble on cock fights, or kick back with some karaoke. There are countless ways to entertain yourself in Hong Kong's diverse districts.… Expand"
  },
  {
    "name": "El Shaddai: Ascension of the Metatron",
    "details_link": "https://www.metacritic.com/game/xbox-360/el-shaddai-ascension-of-the-metatron",
    "publisher": "Ignition Entertainment",
    "release_date": "Aug 16 2011",
    "developers": [
      "Ignition Entertainment"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 75,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/1/4e926e8c3e0e7a81fd8e631cf4f26a48-98.jpg",
    "descriptions": "Developed by a hugely-talented, Tokyo-based team headed by the legendary Sawaki Takeyasu (Devil May Cry) and Masato Kimura (Okami, Viewtiful Joe) El Shaddai: Ascension of the Metatron, draws players into a rich storyline inspired by events in the Old Testament's apocryphal 'Book of Enoch.'Developed by a hugely-talented, Tokyo-based team headed by the legendary Sawaki Takeyasu (Devil May Cry) and Masato Kimura (Okami, Viewtiful Joe) El Shaddai: Ascension of the Metatron, draws players into a rich storyline inspired by events in the Old Testament's apocryphal 'Book of Enoch.'  In the game, players take on the role of Enoch and must harness his natural combat skills to master a range of powerful and Heavenly weapons under the guidance of the watchful Archangels.  Only then will he be able to deliver the souls of the Fallen Angels and spare the world from a great flood ordered by Heaven. … Expand"
  },
  {
    "name": "Metal Gear Acid",
    "details_link": "https://www.metacritic.com/game/psp/metal-gear-acid",
    "publisher": "Konami",
    "release_date": "Mar 22 2005",
    "developers": [
      "Konami"
    ],
    "platforms": "PSP",
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Modern",
      "Modern",
      "Card Battle"
    ],
    "meta_score": 75,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/5/883e7bf1cf46fd7f8e9ed209f5cf3053-98.jpg",
    "descriptions": "Offering gameplay based on strategy and sharp decision-making skills, Metal Gear Acid is a turn-based, tactical espionage game requiring players to collect cards and strategically construct their own decks to complete various missions and objectives. Metal Gear Acid takes place in 2016 onOffering gameplay based on strategy and sharp decision-making skills, Metal Gear Acid is a turn-based, tactical espionage game requiring players to collect cards and strategically construct their own decks to complete various missions and objectives. Metal Gear Acid takes place in 2016 on Lobito Island, located in the fictitious Tejan Republic of South Africa. Players once again take the role of Solid Snake, the famed top-secret agent, who has been called out of his retirement when a plane is hijacked over U.S. airspace. Tasked with infiltrating an unknown terrorist organization holding passengers hostage thousands of feet in the air, players must diffuse the situation to save hundreds of innocent lives. While playing through the game, Solid Snake encounters numerous dynamic characters, including a new playable female heroine. Players will have the ability to strategically control both Solid Snake and the new female character to defeat their enemies. [Konami]… Expand"
  },
  {
    "name": "Ultra Kaiju Monster Rancher",
    "details_link": "https://www.metacritic.com/game/switch/ultra-kaiju-monster-rancher",
    "publisher": "Bandai Namco Games",
    "release_date": "Oct 20 2022",
    "developers": [
      "Bandai Namco Games",
      "Koei Tecmo Games"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Trainer"
    ],
    "meta_score": 75,
    "users_score": 9.4,
    "image": "https://static.metacritic.com/images/products/games/4/27d4d4745a5c2a00bad8162d7cee9e6d-98.jpg",
    "descriptions": "Ultra Kaiju Monster Rancher is a brand-new collaboration between Ultraman, a famous Japanese Tokusatsu work, and Monster Rancher, a popular role-playing simulation series.This new game introduces the iconic \"Ultra Kaiju\" such as Alien Baltan, Zetton, and Gomora to the popular gameplayUltra Kaiju Monster Rancher is a brand-new collaboration between Ultraman, a famous Japanese Tokusatsu work, and Monster Rancher, a popular role-playing simulation series.This new game introduces the iconic \"Ultra Kaiju\" such as Alien Baltan, Zetton, and Gomora to the popular gameplay mechanics of raising and battling monsters from the Monster Rancher series.… Expand"
  },
  {
    "name": "NBA Live 19",
    "details_link": "https://www.metacritic.com/game/xbox-one/nba-live-19",
    "publisher": "Electronic Arts",
    "release_date": "Sep  7 2018",
    "developers": [
      "EA Sports",
      "EA Tiburon"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Sports",
      "Team",
      "Basketball",
      "Sim"
    ],
    "meta_score": 75,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/0/619b8493029926c970fc45ac1a1c0c22-98.jpg",
    "descriptions": "Create your own player and rise to legend status in THE ONE. Play on different courts across the world, Build Your Squad, and challenge others for global dominance in THE LEAGUE and on THE STREETS. With new ways to develop your player and play the game, experience the most authentic feel NBACreate your own player and rise to legend status in THE ONE. Play on different courts across the world, Build Your Squad, and challenge others for global dominance in THE LEAGUE and on THE STREETS. With new ways to develop your player and play the game, experience the most authentic feel NBA LIVE has ever had.… Expand"
  },
  {
    "name": "Game of Thrones: Episode Six - The Ice Dragon",
    "details_link": "https://www.metacritic.com/game/playstation-4/game-of-thrones-episode-six---the-ice-dragon",
    "publisher": "Telltale Games",
    "release_date": "Nov 17 2015",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "General",
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 75,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/9/be58380f4a41bbfb6dc65370ab0509eb-98.jpg",
    "descriptions": "Your chronicle is about to come to a conclusion. With House Whitehill tightening its grip on Ironrath at the behest of Ramsay Bolton, the remaining Forresters need to give their all to save the family, whether through diplomacy, subterfuge, or violent force. In the frozen wilds beyond TheYour chronicle is about to come to a conclusion. With House Whitehill tightening its grip on Ironrath at the behest of Ramsay Bolton, the remaining Forresters need to give their all to save the family, whether through diplomacy, subterfuge, or violent force. In the frozen wilds beyond The Wall, Gared learns the secrets of the mysterious North Grove, and Mira discovers that political games in a King's Landing controlled by Cersei Lannister often involve the highest stakes of all. What is the fate of House Forrester? When you play the Game of Thrones, you win or you die. Your choices, your story: you decide. [Telltale Games]… Expand"
  },
  {
    "name": "In Sound Mind",
    "details_link": "https://www.metacritic.com/game/pc/in-sound-mind",
    "publisher": "Modus Games",
    "release_date": "Sep 28 2021",
    "developers": [
      "We Create Stuff"
    ],
    "platforms": [
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "3D",
      "Survival",
      "First-Person"
    ],
    "meta_score": 75,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/0/65575617acdc58f46b5dbbb75bb89693-98.jpg",
    "descriptions": "From the creators of cult classic Nightmare House 2, comes an imaginative psychological horror experience that challenges your expectations and ushers you through the deepest corners of your mind. As you awake in the corridors of an inexplicable building, you find the environment takes on aFrom the creators of cult classic Nightmare House 2, comes an imaginative psychological horror experience that challenges your expectations and ushers you through the deepest corners of your mind. As you awake in the corridors of an inexplicable building, you find the environment takes on a life of its own and leads you to discover a series of victims, all exposed to the same experimental therapy. In your search for answers, bizarre visions emerge and introduce a host of imposing horrors. With your sanity in question, you have no choice but to rely on your instinct…and a cat named Tonia. In Sound Mind is a witty first-person psychological horror with frenetic puzzles, unique boss fights, and original music by The Living Tombstone. Explore and fight through a series of unsettling memories as you journey within the inner workings of the one place you can’t seem to escape—your own mind.… Expand"
  },
  {
    "name": "The Dishwasher: Dead Samurai",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-dishwasher-dead-samurai",
    "publisher": "Microsoft Game Studios",
    "release_date": "Apr  1 2009",
    "developers": [
      "Ska Studios"
    ],
    "platforms": "Xbox 360",
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/f7c14e17adb8c24b90b0a87b68c6ac61-98.jpg",
    "descriptions": "[Xbox Live Arcade]  The Dishwasher: Dead Samurai is a 2-D stylistic action platformer for Xbox LIVE Arcade showcasing fast action, deep gameplay, and a unique visual style. An undead samurai dishwasher in a dystopian universe is on a quest for revenge against the evil cyborg army. To[Xbox Live Arcade]  The Dishwasher: Dead Samurai is a 2-D stylistic action platformer for Xbox LIVE Arcade showcasing fast action, deep gameplay, and a unique visual style. An undead samurai dishwasher in a dystopian universe is on a quest for revenge against the evil cyborg army. To dispatch hordes of zombies, cyborgs, and robots, the Dishwasher has at his fingertips a devastating array of attacks using ancient blades, disturbing machinery, and screen-obliterating Dish Magic. Compete with the rest of the world in a variety of speed run and high score challenges to become the most formidable Dishwasher yet. Fresh take on gameplay: Gameplay in The Dishwasher is a fresh take on popular stylistic action combat, taking combo- and timing-intensive combat into a 2-D, blood-soaked environment emphasizing speed, vertical movement, and maneuverability, and player-driven pacing to create a truly unique, fluid and visceral experience, with an appealingly psychotic art style. New game modes with guitar peripheral: The Dishwasher has arcade co-op, drop-in solo campaign co-op, and drop-in solo phantom guitar co-op using the guitar peripheral. Phantom guitar players can unload electric death by playing wicked solos, perform basic movement, and use the guitar's motion control to rip through enemies with a razor-sharp headstock. The power of XNA: The Dishwasher is a testament to the power of XNA. The game was created by one guy with no professional game development experience (and a self-described lousy programmer) in about a year and a half. [Ska Studios]… Expand"
  },
  {
    "name": "Grand Theft Auto: Vice City Stories",
    "details_link": "https://www.metacritic.com/game/playstation-2/grand-theft-auto-vice-city-stories",
    "publisher": "Rockstar Games",
    "release_date": "Mar  5 2007",
    "developers": [
      "Rockstar Leeds"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 75,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/6/4c826dfc4fcf06e1391fd9a6afd624bb-98.jpg",
    "descriptions": "Vice City, 1984. Opportunity abounds in a city emerging from the swamps, its growth fueled by the violent power struggle in a lucrative drugs trade. Construction is everywhere as a shining metropolis rises from foundations of crime and betrayal. As a soldier, Vic Vance always protected hisVice City, 1984. Opportunity abounds in a city emerging from the swamps, its growth fueled by the violent power struggle in a lucrative drugs trade. Construction is everywhere as a shining metropolis rises from foundations of crime and betrayal. As a soldier, Vic Vance always protected his dysfunctional family, his country, himself. One bad decision later and that job is about to get much harder. Kicked out onto the streets of a city between glamour and gluttony, Vic is faced with a stark choice - build an empire or be crushed. [Rockstar Games]… Expand"
  },
  {
    "name": "Master of Magic Remake",
    "details_link": "https://www.metacritic.com/game/pc/master-of-magic-remake",
    "publisher": "Slitherine",
    "release_date": "Dec 13 2022",
    "developers": [
      "MuHa Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Tactics"
    ],
    "meta_score": 75,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/5edef459cd644a11046aeaeda9ec10b8-98.jpg",
    "descriptions": "Master of Magic is a combination of an RPG and a strategy game, a remake of a classic from the 90s.In Master of Magic you take up the role of one of 14 unique and diverse great wizards who compete with each other to dominate the worlds of Arcanus and Myrror. Choose from different schoolsMaster of Magic is a combination of an RPG and a strategy game, a remake of a classic from the 90s.In Master of Magic you take up the role of one of 14 unique and diverse great wizards who compete with each other to dominate the worlds of Arcanus and Myrror. Choose from different schools of magic and fantasy races to command, then lead your minions and expand your influence and power across the land.Recruit and command mighty armies of elves, dragons, dwarves, orcs and many more. Support them with powerful spells. Fight tactical turn-based battles and affect the outcome with your magic.Always beware of the machinations of your rival wizards, who seek to reach your same goals. But in the end, remember: there can be only one Master of Magic.… Expand"
  },
  {
    "name": "Carto",
    "details_link": "https://www.metacritic.com/game/playstation-4/carto",
    "publisher": "Humble Games",
    "release_date": "Oct 27 2020",
    "developers": [
      "Sunhead Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Adventure",
      "General"
    ],
    "meta_score": 75,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/1/6663a1fc0e8721e3603c7d97f460d05c-98.jpg",
    "descriptions": "Carto is a chill adventure game wrapped around a unique, world-shifting puzzle mechanic. Use this power to explore mysterious lands, help a quirky cast of new friends, and guide Carto on her journey home."
  },
  {
    "name": "The Ninja Saviors: Return of the Warriors",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-ninja-saviors-return-of-the-warriors",
    "publisher": "Taito Corporation",
    "release_date": "Oct 15 2019",
    "developers": [
      "NATSUME ATARI Inc."
    ],
    "platforms": [
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/8/82910f52f6f06a9a611e642975f2b42d-98.jpg",
    "descriptions": "The Ninja Saviors: Return of the Warriors is a reboot of the 90s Super Nintendo hit \"The Ninja Warriors Again\" by TAITO. The classic 2D sidescrolling Beat 'Em Up has been enhanced with higher level graphics, 2 new playable characters, re-recorded soundtrack, two player local co-op and more."
  },
  {
    "name": "My Time At Portia",
    "details_link": "https://www.metacritic.com/game/playstation-4/my-time-at-portia",
    "publisher": "Team17",
    "release_date": "Apr 16 2019",
    "developers": [
      "Pathea Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 75,
    "users_score": 5.4,
    "image": "https://static.metacritic.com/images/products/games/6/21bc2297947f590c0e86e94b28ed5d09-98.jpg",
    "descriptions": "Embark on a new life in the enchanting town of Portia! Restore your Pa’s neglected workshop to its former glory by fulfilling commissions, growing crops, raising animals, and befriending the quirky inhabitants of this charming post-apocalyptic land."
  },
  {
    "name": "Hotline Miami 2: Wrong Number",
    "details_link": "https://www.metacritic.com/game/playstation-4/hotline-miami-2-wrong-number",
    "publisher": "Devolver Digital",
    "release_date": "Mar 10 2015",
    "developers": [
      "Dennaton"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Stadia",
      "PlayStation 4"
    ],
    "genres": [
      "General",
      "Action",
      "Action Adventure",
      "General",
      "Linear"
    ],
    "meta_score": 75,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/ef48ffb19f975afb47e3d2d97dc2f09f-98.jpg",
    "descriptions": "A brutal conclusion to the gruesome saga, Hotline Miami 2: Wrong Number follows the escalating level of violence through multiple factions born from the events of the original game and driven by uncertain motivations. Step into the murderous mind of several distinct characters - each withA brutal conclusion to the gruesome saga, Hotline Miami 2: Wrong Number follows the escalating level of violence through multiple factions born from the events of the original game and driven by uncertain motivations. Step into the murderous mind of several distinct characters - each with their own motivations and methods of execution -- as storylines intersect and reality slips away into a haze of neon and carnage. Blistering combat, an unmistakable visual style, and a powerfully intense soundtrack will once again push you to the limit and questioning your own thirst for blood.… Expand"
  },
  {
    "name": "The Wolf Among Us: Episode 4 - In Sheep's Clothing",
    "details_link": "https://www.metacritic.com/game/pc/the-wolf-among-us-episode-4---in-sheeps-clothing",
    "publisher": "Telltale Games",
    "release_date": "May 27 2014",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Fantasy",
      "Action Adventure",
      "Adventure",
      "General",
      "Fantasy",
      "Point-and-Click"
    ],
    "meta_score": 75,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/e444f1cd7d24182936693402336520a5-98.jpg",
    "descriptions": "The penultimate episode from The Wolf Among Us, a five episode series from developer Telltale Games where your every decision can have enormous consequences. As Bigby Wolf, the wolf in human form, you discover that the brutal, bloody murder of a Fable is just a taste of things to come."
  },
  {
    "name": "The Next Big Thing",
    "details_link": "https://www.metacritic.com/game/pc/the-next-big-thing",
    "publisher": "Focus Home Interactive",
    "release_date": "Apr 21 2011",
    "developers": [
      "Pendulo Studios"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "General"
    ],
    "meta_score": 75,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/0/da0931ccae161466979d3ffee49c8553-98.jpg",
    "descriptions": "After having put the adventure game genre back into the spotlight with the Runaway trilogy, which had captivated more than a million players during the last decade, Pendulo Studios is back with an original, great adventure game. The Next BIG Thing revisits with class and humor the fantasticAfter having put the adventure game genre back into the spotlight with the Runaway trilogy, which had captivated more than a million players during the last decade, Pendulo Studios is back with an original, great adventure game. The Next BIG Thing revisits with class and humor the fantastic movie genre with a modern, funny adventure packed with hints and references made to popular movies and TV shows.\r The story introduces the couple of charismatic heroes Dan Murray and Liz Allaire involved in an incredible and crazy adventure, full of twists and packed with moments of pure comedy! With The Next BIG Thing, Pendulo Studios stay faithful to their unique graphic style that puts their games close to actual animated movies. The Next BIG Thing also maintains Runaway’s popular and beloved ingredients: an intricate story, funny and charismatic characters, wacky mysteries and puzzles, and a definite adult and modern tone.… Expand"
  },
  {
    "name": "Sam & Max: The Devil's Playhouse - Episode 3: They Stole Max's Brain!",
    "details_link": "https://www.metacritic.com/game/pc/sam-max-the-devils-playhouse---episode-3-they-stole-maxs-brain!",
    "publisher": "Telltale Games",
    "release_date": "Jun 22 2010",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "PlayStation 3",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Adventure",
      "General",
      "3D",
      "Compilation",
      "Third-Person"
    ],
    "meta_score": 75,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/c6c0f840be3b73709a274f70a277b9a2-98.jpg",
    "descriptions": "The Sam & Max franchise gets a film noir twist."
  },
  {
    "name": "echoshift",
    "details_link": "https://www.metacritic.com/game/psp/echoshift",
    "publisher": "SCEA",
    "release_date": "Feb 24 2010",
    "developers": [
      "Artoon",
      "SCEJ"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "PSP"
    ],
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Puzzle",
      "Logic",
      "Logic"
    ],
    "meta_score": 75,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/3/d09863b5c782c2144772a8d40cf61a81-98.jpg",
    "descriptions": "echoshift is a franchise spin-off of the previously released PlayStation Network title echochrome."
  },
  {
    "name": "WWE SmackDown vs. Raw 2010",
    "details_link": "https://www.metacritic.com/game/ds/wwe-smackdown-vs-raw-2010",
    "publisher": "THQ",
    "release_date": "Oct 20 2009",
    "developers": [
      "Yuke's"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "DS"
    ],
    "genres": [
      "Action",
      "Sports",
      "Fighting",
      "Fighting",
      "Individual",
      "Wrestling",
      "Combat",
      "Wrestling"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/4c9ab335e6e3b50710ca25e58585ada7-98.jpg",
    "descriptions": "The best-selling fighting videogame franchise returns to the virtual ring with the most authentic, entertaining and portable simulation of WWE programming to date.  Featuring innovative new gameplay controls, an engaging Story Mode and an extensive array of unlockable content, WWE SmackDownThe best-selling fighting videogame franchise returns to the virtual ring with the most authentic, entertaining and portable simulation of WWE programming to date.  Featuring innovative new gameplay controls, an engaging Story Mode and an extensive array of unlockable content, WWE SmackDown vs. Raw 2010 delivers a compelling experience unique to the Nintendo DS.  It’s the player’s world now. [THQ]… Expand"
  },
  {
    "name": "Final Fantasy Crystal Chronicles: Echoes of Time",
    "details_link": "https://www.metacritic.com/game/ds/final-fantasy-crystal-chronicles-echoes-of-time",
    "publisher": "Square Enix",
    "release_date": "Mar 24 2009",
    "developers": [
      "Square Enix"
    ],
    "platforms": "DS",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 75,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/4/b92e34a263e7e37c35b8ae8561eeace0-98.jpg",
    "descriptions": "An innovative new concept in multiplayer gaming, Final Fantasy Crystal Chronicles: Echoes of Time enables Wii and DS users to play side by side for the first time. This breakthrough in gaming connectivity allows players on both Nintendo platforms to journey together in the fantastical worldAn innovative new concept in multiplayer gaming, Final Fantasy Crystal Chronicles: Echoes of Time enables Wii and DS users to play side by side for the first time. This breakthrough in gaming connectivity allows players on both Nintendo platforms to journey together in the fantastical world of the beloved Final Fantasy Crystal Chronicles series. Echoes of Time offers a gameplay system that allows for a seamless, hassle-free in-game switch from single to multiplayer mode. Play anytime, anywhere, with anyone and experience a new level of connectivity with this latest adventure in the FFCC series. A triumphant return from a monster-infested forest marks the completion of the 16-year-old hero’s coming-of-age ceremony. However, the hero's joy is short-lived as a young village girl is found to be afflicted by a mysterious illness known as \"crystal sickness.\" Determined to obtain the cure, the hero steps out of the secluded village for the first time, only to discover a world in which crystals are merely artifacts of the past and no longer exist. Play anytime, anywhere with anyone Multiplayer connectivity reaches new heights in Echoes of Time, where players can team up or compete with friends and players around the world. The intuitive control scheme introduced in Ring of Fates returns, now adapted to Wii for double the action. Players can switch between single and multiplayer modes at any time while playing, enjoying two great gaming options in one integrated experience. A personalized hero can be generated from a choice of the four familiar races of the series; Clavats, Lilties, Selkies or Yukes. Players joining from the Wii can also introduce their Miis to the world of FFCC. Create and customize materials, armor and equipment for characters with tailored appearances and abilities - no two heroes will be the same! Players can continue to enjoy the game even after completing the main adventure, as the New Game+ feature provides increased difficulty and better items with every new round. [Square Enix]… Expand"
  },
  {
    "name": "Chibi-Robo!",
    "details_link": "https://www.metacritic.com/game/gamecube/chibi-robo!",
    "publisher": "Nintendo",
    "release_date": "Feb  6 2006",
    "developers": [
      "Skip Ltd."
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 75,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/34dfc07f4ed00903f8b06d745967c0aa-98.jpg",
    "descriptions": "The Sanderson family just got the ultimate in high-tech, house-helper technology: Chibi-Robo. In this inventive, story-driven game, players guide a miniature robot as he completes chores and clashes with enemies in his epic quest to become the highest-ranked Chibi-Robo out there. The livingThe Sanderson family just got the ultimate in high-tech, house-helper technology: Chibi-Robo. In this inventive, story-driven game, players guide a miniature robot as he completes chores and clashes with enemies in his epic quest to become the highest-ranked Chibi-Robo out there. The living room can be a dangerous place when you're a robot less than a foot tall, so players will need to team up with the native toys to overcome obstacles, rack up points and keep the family happy. Normally running on battery power, Chibi-Robo needs to plug into power outlets with his built-in cord when he runs low on juice. Doing chores has never been so much fun.… Expand"
  },
  {
    "name": "The Bard's Tale",
    "details_link": "https://www.metacritic.com/game/xbox/the-bards-tale",
    "publisher": "InXile Entertainment",
    "release_date": "Oct 26 2004",
    "developers": [
      "InXile Entertainment"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Third-Person"
    ],
    "meta_score": 75,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/aae45bef1638add1ad6b7f47a4133816-98.jpg",
    "descriptions": "The Bard's Tale is a modern interpretation of the original role-playing game of the same name. In this game, you'll take on the role of the Bard, a sardonic and opportunistic musician and adventurer. You can choose the Bard's responses toward other characters that he encounters with eitherThe Bard's Tale is a modern interpretation of the original role-playing game of the same name. In this game, you'll take on the role of the Bard, a sardonic and opportunistic musician and adventurer. You can choose the Bard's responses toward other characters that he encounters with either \"snarky\" or nice dialogue. Each choice changes the course of events in the game. All the action takes place in medieval environments rife with townsfolk, birds, animals, rustling trees, and trickling water.… Expand"
  },
  {
    "name": "Still Life",
    "details_link": "https://www.metacritic.com/game/pc/still-life",
    "publisher": "The Adventure Company",
    "release_date": "May  4 2005",
    "developers": [
      "Microids"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Third-Person",
      "Point-and-Click",
      "Modern",
      "Modern"
    ],
    "meta_score": 75,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/2/a260a0e8f78243fb35adfe62df74518f-98.jpg",
    "descriptions": "Victoria McPherson is a brilliant young FBI agent who's investigating a serial murder case. The body count is now at five and with the lack of real leads and a mountain of circumstantial evidence, Victoria is beginning to show signs of fatigue and stress. She decides to take a break and goVictoria McPherson is a brilliant young FBI agent who's investigating a serial murder case. The body count is now at five and with the lack of real leads and a mountain of circumstantial evidence, Victoria is beginning to show signs of fatigue and stress. She decides to take a break and go rest at her father's home in suburban Chicago; after all, it is close to the Christmas holidays. However, Victoria does not find rest. Instead, she finds one of her grandfather's old case files and begins to read. Oddly enough, Victoria's present case resembles the one from the past, right down to the killer's MO. The game features a compelling storyline set in modern Chicago and late 1920's Prague; beautifully detailed environments; rich and intriguing characters; Breath-taking cinematics; the opportunity to investigate the crime scenes of gruesome serial homicides and to solve challenging puzzles finely integrated into the storyline. [Microids]… Expand"
  },
  {
    "name": "Green Day: Rock Band",
    "details_link": "https://www.metacritic.com/game/xbox-360/green-day-rock-band",
    "publisher": "MTV Games",
    "release_date": "Jun  8 2010",
    "developers": [
      "Harmonix Music Systems",
      "Demiurge Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 75,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/8/d59a6001d89bae7ce123bf94a0476f47-98.jpg",
    "descriptions": "Green Day: Rock Band allows players to step onto the stage and into the shoes of Green Day, the multi-platinum, Grammy Award-winning band that jump-started the punk-pop revival and has continued to pave the way for American rock music into the 21st century. Taking on the likenesses of GreenGreen Day: Rock Band allows players to step onto the stage and into the shoes of Green Day, the multi-platinum, Grammy Award-winning band that jump-started the punk-pop revival and has continued to pave the way for American rock music into the 21st century. Taking on the likenesses of Green Day members Billie Joe Armstrong, Mike Dirnt and Tré Cool, players progress through the story and history of Green Day, gaining access into the band’s media vault, where they can unlock more than 100 collectible images, and more than 40 minutes of rare and unreleased video from interviews, outtakes and performances. [MTV Games]… Expand"
  },
  {
    "name": "Shadow of Rome",
    "details_link": "https://www.metacritic.com/game/playstation-2/shadow-of-rome",
    "publisher": "Capcom",
    "release_date": "Feb  8 2005",
    "developers": [
      "Capcom"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Historic"
    ],
    "meta_score": 75,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/0/765e6997aded668faee3cbf9914876c2-98.jpg",
    "descriptions": "The year is 48 B.C. The grandeur of the Roman Empire has been tarnished by political corruption and society has been overrun by unruliness and violence. Julius Caesar advocates for drastic reform to rebuild the republic to its former glory, but is metwith opposition. Before changes could beThe year is 48 B.C. The grandeur of the Roman Empire has been tarnished by political corruption and society has been overrun by unruliness and violence. Julius Caesar advocates for drastic reform to rebuild the republic to its former glory, but is metwith opposition. Before changes could be implemented, the enlightened head of state is murdered. Consequently the horrific news finds its way on the battlefield and to the ears of one soldier, Agrippa, who rushes back to Rome only to be confronted withthe announcement that his father, Uesnius who was a close advisor to Caesar, is the accused murderer. Unfortunately, time is running out for Agrippa as his father is to be publicly executed by the winner of the next gladiatorial event. Together with the help of his best friend, Octavius, and a freed female gladiator named Claudia, Agrippa embarks on a mission to restore his family?s honor and uncover the truth concerning Caesar?s assassination. Shadow of Rome has been designed to allow players the opportunity to venture throughout the world of ancient Rome by flawlessly switching between Agrippa and Octavius, each of whom have their own area of expertise. Playing Agrippa lends itself more to action while Octavius is towards the more stealth and adventure elements of the game. To remain true to the Roman era, players will have to use objects in the environment and weapons of the day such as stones, slingshots, spears and swords in order to progress through the game. Also, situations will arise when Agrippa or Octavius will rely on nothing but their hands in order to combat those impeding his quest to absolve Uesnius. [Capcom]… Expand"
  },
  {
    "name": "Sonic Mega Collection Plus",
    "details_link": "https://www.metacritic.com/game/xbox/sonic-mega-collection-plus",
    "publisher": "Sega",
    "release_date": "Nov  2 2004",
    "developers": [
      "Sonic Team"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 75,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/aa2121e9dcb77e86e5ce89fa77b01b55-98.jpg",
    "descriptions": "Sonic has appeared in many games in the last decade, and now you can relive seven of them from Sonic Mega Collection Plus. This compilation includes the first three Sonic the Hedgehog titles, plus Sonic & Knuckles, Sonic 3D Flickies' Island, Sonic the Hedgehog Spinball, and Dr. Robotnik'sSonic has appeared in many games in the last decade, and now you can relive seven of them from Sonic Mega Collection Plus. This compilation includes the first three Sonic the Hedgehog titles, plus Sonic & Knuckles, Sonic 3D Flickies' Island, Sonic the Hedgehog Spinball, and Dr. Robotnik's Mean Bean Machine. The Plus version also adds more content, such as illustrations and movies, to Sonic Mega Collection .… Expand"
  },
  {
    "name": "Road Not Taken",
    "details_link": "https://www.metacritic.com/game/pc/road-not-taken",
    "publisher": "Spry Fox",
    "release_date": "Aug  5 2014",
    "developers": [
      "Spry Fox"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "General"
    ],
    "meta_score": 75,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/3/f92bc55c383f939e1bbafc719c72078e-98.jpg",
    "descriptions": "Road Not Taken is a roguelike puzzle game about surviving the surprises in life. You assume the role of a ranger adventuring through a vast, unforgiving forest in the aftermath of a brutal winter storm, rescuing children who have lost their way. Randomly generated levels deliver a limitlessRoad Not Taken is a roguelike puzzle game about surviving the surprises in life. You assume the role of a ranger adventuring through a vast, unforgiving forest in the aftermath of a brutal winter storm, rescuing children who have lost their way. Randomly generated levels deliver a limitless supply of possibilities to explore and challenges to overcome. Your actions influence not only your own story, but the stories of the villagers you hope to befriend and the town you call home.… Expand"
  },
  {
    "name": "Call of Juarez: Gunslinger",
    "details_link": "https://www.metacritic.com/game/playstation-3/call-of-juarez-gunslinger",
    "publisher": "Ubisoft",
    "release_date": "May 14 2013",
    "developers": [
      "Techland"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/7359986756b2295b6c2178d47d5529de-98.jpg",
    "descriptions": "From the dust of a gold mine to the dirt of a saloon, Call of Juarez Gunslinger is an homage to the Wild West tales. Live the epic and violent journey of a ruthless bounty hunter onto the trail of the West's most notorious outlaws. Blurring the lines between man and myth, this adventure madeFrom the dust of a gold mine to the dirt of a saloon, Call of Juarez Gunslinger is an homage to the Wild West tales. Live the epic and violent journey of a ruthless bounty hunter onto the trail of the West's most notorious outlaws. Blurring the lines between man and myth, this adventure made of memorable encounters unveils the untold truth behind some of the greatest legends of the Old West.… Expand"
  },
  {
    "name": "Smash T.V.",
    "details_link": "https://www.metacritic.com/game/xbox-360/smash-tv",
    "publisher": "Midway",
    "release_date": "Nov 24 2005",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": "Xbox 360",
    "num_players": "2  Online",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Static",
      "Static",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 75,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/1eeeff474bb7f03d00c35a139c2cf614-98.jpg",
    "descriptions": "[Xbox Live Arcade]  The future of reality TV is Smash TV! It's the game show that asks: \"How far would you go for a brand-new toaster?\" You could win a VCR ... or you might lose your life! This new version of the original arcade game features online multiplayer co-op and versus modes. Listen[Xbox Live Arcade]  The future of reality TV is Smash TV! It's the game show that asks: \"How far would you go for a brand-new toaster?\" You could win a VCR ... or you might lose your life! This new version of the original arcade game features online multiplayer co-op and versus modes. Listen to the audience cheer as you risk life and limb in room after carnage-filled room. Can you make it to the legendary Pleasure Dome? Cash and fabulous prizes could be yours - but only if you survive. And with the likes of Mr. Shrapnel, Mutoid Man, and Scarface out to get you, it's not likely. Good luck ... you're going to need it! [Xbox.com]… Expand"
  },
  {
    "name": "Lost Words: Beyond the Page",
    "details_link": "https://www.metacritic.com/game/pc/lost-words-beyond-the-page",
    "publisher": "Modus Games",
    "release_date": "Apr  6 2021",
    "developers": [
      "Sketchbook Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Adventure",
      "General",
      "Platformer",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/9/b1340258a263700539cfd6db55b4db61-98.jpg",
    "descriptions": "Interact with the words inscribed in the pages of a young girl’s diary to solve challenging puzzles, tackle unique platforming segments and discover an emotional tale set across the vibrant world of Estoria in Lost Words: Beyond the Page."
  },
  {
    "name": "The Escapists 2",
    "details_link": "https://www.metacritic.com/game/pc/the-escapists-2",
    "publisher": "Team17",
    "release_date": "Aug 21 2017",
    "developers": [
      "Mouldy Toof Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 75,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/3/e751d4a8a774e4b186e6baf8bf614365-98.jpg",
    "descriptions": "Craft, Steal, Brawl and Escape! It’s time to bust out of the toughest prisons in the world as you return to the life of an inmate in The Escapists 2, now with multiplayer! Have you got what it takes to escape?"
  },
  {
    "name": "escapeVektor",
    "details_link": "https://www.metacritic.com/game/3ds/escapevektor",
    "publisher": "Nnooo",
    "release_date": "Dec 20 2012",
    "developers": [
      "Nnooo"
    ],
    "platforms": [
      "PlayStation Vita",
      "3DS"
    ],
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Action"
    ],
    "meta_score": 75,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/3c8b308f06513dd5fbcb1adfc3d5ef34-98.jpg",
    "descriptions": "Vektor has been trapped inside the CPU for what feels like an eternity and you are his only hope of escape! As he travels through the CPU, help him recover his memories and destroy the different enemy types sent to hunt him. But be careful  the further Vektor gets, the more devious the CPUVektor has been trapped inside the CPU for what feels like an eternity and you are his only hope of escape! As he travels through the CPU, help him recover his memories and destroy the different enemy types sent to hunt him. But be careful  the further Vektor gets, the more devious the CPU becomes!\r There is a whole world to uncover within your CPU! Hiding away are 150 levels (nodes), 27 worlds (zones) and four unique abilities to unlock and upgrade. With Vektor providing you with various skills  Detonate to destroy enemies, Boost and Super Boost to outrun them and Boostenate to smash your way through  you are sure to be able to help him escape!\r Online leaderboards allow you to compete against your friends, both those in the surrounding area and those closest to you in score. Use wildcards to double your score in each level and boost your standing in the leaderboards!… Expand"
  },
  {
    "name": "Tak 2: The Staff of Dreams",
    "details_link": "https://www.metacritic.com/game/gamecube/tak-2-the-staff-of-dreams",
    "publisher": "THQ",
    "release_date": "Oct 11 2004",
    "developers": [
      "Avalanche Software"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 75,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/e29718254a795c6c7a5ce1f203ca0509-98.jpg",
    "descriptions": "Tak must learn new Juju magic to recover the Staff of Dreams and defeat Tlaloc once and for all. Now dabbling with new abilities, Tak can create a little Juju magic of his own. As Tak, try to master three new Jujus, expanded combat capabilities, and new weapons as you battle NightmareTak must learn new Juju magic to recover the Staff of Dreams and defeat Tlaloc once and for all. Now dabbling with new abilities, Tak can create a little Juju magic of his own. As Tak, try to master three new Jujus, expanded combat capabilities, and new weapons as you battle Nightmare creatures. Interact with familiar characters from the series, along with Jibolba's brother, JB. Multiplayer \"Dinky\" games let you face off in head-to-head action with playable characters from Tak's world.… Expand"
  },
  {
    "name": "The Dark Eye: Chains of Satinav",
    "details_link": "https://www.metacritic.com/game/pc/the-dark-eye-chains-of-satinav",
    "publisher": "Deep Silver",
    "release_date": "Jun 22 2012",
    "developers": [
      "Daedalic Entertainment"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 75,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/6/4c656e788e42330024470e03e46c8019-98.jpg",
    "descriptions": "The Dark Eye: Chains of Satinav is a point and click adventure from the makers of The Whispered World."
  },
  {
    "name": "Afterparty",
    "details_link": "https://www.metacritic.com/game/xbox-one/afterparty",
    "publisher": "Night School Studio",
    "release_date": "Oct 29 2019",
    "developers": [
      "Night School Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 75,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/9/569528ce1ecf638acc6432cba730e8d6-98.jpg",
    "descriptions": "In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you.In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you. Time to go on the best bender ever, uncover the mystery of why you’ve been damned, and drink the big guy under the table. [Night School]… Expand"
  },
  {
    "name": "Nidhogg 2",
    "details_link": "https://www.metacritic.com/game/switch/nidhogg-2",
    "publisher": "Messhof",
    "release_date": "Nov 22 2018",
    "developers": [
      "Messhof"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/48bde131b017699622721034aee6e275-98.jpg",
    "descriptions": "Return of the Wurm. The next installment of the epic award-winning dueling tug-of-war is here. Stab, shoot, slice, or stomp your opponent to gain control of the screen, then book it to your side of the arena. Before long, a new opponent will appear in your way. If they kill you, they getReturn of the Wurm. The next installment of the epic award-winning dueling tug-of-war is here. Stab, shoot, slice, or stomp your opponent to gain control of the screen, then book it to your side of the arena. Before long, a new opponent will appear in your way. If they kill you, they get control. Get all the way to your end of the arena to win--and be devoured by the Nidhogg. Enjoy new monstrous visuals by artist Toby Dixon and bangin beats from Mux Mool, Daedelus, Doseone, and more.… Expand"
  },
  {
    "name": "Vesper",
    "details_link": "https://www.metacritic.com/game/pc/vesper",
    "publisher": "Deck 13",
    "release_date": "Jul 30 2021",
    "developers": [
      "Cordens Interactive"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/652f61164ea9845e557103eb46a7238e-98.jpg",
    "descriptions": "Thousands of years after the activation of the Vesper Protocol, a small android crosses a fallen world, hunted by merciless machines, to control the power of Light and decide the fate of his race."
  },
  {
    "name": "Ode",
    "details_link": "https://www.metacritic.com/game/pc/ode",
    "publisher": "Ubisoft",
    "release_date": "Nov 27 2017",
    "developers": [
      "Ubisoft Reflections"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "Third-Person"
    ],
    "meta_score": 75,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/9/ea6d276b0cd7e12b98e07d900745a99d-98.jpg",
    "descriptions": "Control and transform Joy, a fallen star who lands in a beautiful land of light and sound. Navigate this mesmerising musical garden in this unique experience completely at your own pace. Bring the world around you to life and return fallen stars to the sky."
  },
  {
    "name": "Monster Lab",
    "details_link": "https://www.metacritic.com/game/ds/monster-lab",
    "publisher": "Eidos Interactive",
    "release_date": "Nov  4 2008",
    "developers": [
      "Backbone Entertainment"
    ],
    "platforms": [
      "PlayStation 2",
      "DS"
    ],
    "genres": [
      "Role-Playing",
      "Action RPG",
      "General",
      "Action RPG"
    ],
    "meta_score": 75,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/1/e276b3e8f42ce353787c4dfea954c516-98.jpg",
    "descriptions": "Monster Lab is set in an eerie, supernatural world where the evil Baron Mharti rules the region with a cruel hand. Gamers take on the role of an apprentice scientist who must perform a vast array of intricate experiments to create creepy monsters from over 150 monster parts. From mechanicalMonster Lab is set in an eerie, supernatural world where the evil Baron Mharti rules the region with a cruel hand. Gamers take on the role of an apprentice scientist who must perform a vast array of intricate experiments to create creepy monsters from over 150 monster parts. From mechanical to biological to alchemical laboratories, players take control of their monstrous creations and explore the land, searching for ingredients to make stronger monster parts, hunting out and defeating enemy monsters, discovering quests to embark upon or simply competing in the numerous mini-games available. Monster Lab gives players the ability to challenge and compete with friends in ferocious multiplayer combat and collect monster parts and recipes in an obsessive pursuit of knowledge and power. The ultimate goal is to vanquish the evil Baron Mharti and liberate the villagers through mastering experiments, creating a powerful army of monsters and conquering all of the vast environments. Only then will the player rise through the ranks and become a Mad Scientist worthy of defeating the Baron! [Eidos Interactive]… Expand"
  },
  {
    "name": "Game of Thrones: Episode One - Iron From Ice",
    "details_link": "https://www.metacritic.com/game/pc/game-of-thrones-episode-one---iron-from-ice",
    "publisher": "Telltale Games",
    "release_date": "Dec  2 2014",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Adventure",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 75,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/2/c406168c908c9815dec53d87621e1e11-98.jpg",
    "descriptions": "Episode 1 - Iron From Ice. The series is based on the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire). The events in the game series begin towards the end of Season 3 of the television show and endEpisode 1 - Iron From Ice. The series is based on the world, characters and events seen in HBO’s television show, which in turn is based on George R. R. Martin’s books (A Song of Ice and Fire). The events in the game series begin towards the end of Season 3 of the television show and end just before the beginning of Season 5. You'll traverse familiar locations such as King’s Landing and The Wall, as well as unfamiliar locations such as Ironrath, the home of House Forrester.… Expand"
  },
  {
    "name": "The Medium",
    "details_link": "https://www.metacritic.com/game/playstation-5/the-medium",
    "publisher": "Koch Media",
    "release_date": "Sep  3 2021",
    "developers": [
      "Bloober Team"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 75,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/6/e8711f9ab4c585dbfd8e89be3190e249-98.jpg",
    "descriptions": "Become a medium living in two different worlds: the real one and the spirit one. Haunted by the vision of a child's murder, you travel to an abandoned hotel resort, which many years ago became the stage of an unthinkable tragedy. There you begin your search for difficult answers. As a mediumBecome a medium living in two different worlds: the real one and the spirit one. Haunted by the vision of a child's murder, you travel to an abandoned hotel resort, which many years ago became the stage of an unthinkable tragedy. There you begin your search for difficult answers. As a medium with access to both worlds, you have a wider perspective and can see more clearly that there's no one simple truth to what others perceive. Nothing is what it seems, everything has another side.\r The Medium features a \"dual\" soundtrack by Bloober Team's Arkadiusz Reikowski and legendary composer Akira Yamaoka of Silent Hill fame.… Expand"
  },
  {
    "name": "Age of Empires III: Definitive Edition",
    "details_link": "https://www.metacritic.com/game/pc/age-of-empires-iii-definitive-edition",
    "publisher": "Xbox Game Studios",
    "release_date": "Oct 15 2020",
    "developers": [
      "Tantalus"
    ],
    "platforms": "PC",
    "num_players": "Up to 8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Command"
    ],
    "meta_score": 75,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/5/3ba77d8e43297787cb3f404af7387ffa-98.jpg",
    "descriptions": "Age of Empires III: Definitive Edition completes the celebration of one of the most beloved real-time strategy franchises with remastered graphics and music, all previously released expansions and brand-new content to enjoy for the very first time."
  },
  {
    "name": "Chime Sharp",
    "details_link": "https://www.metacritic.com/game/xbox-one/chime-sharp",
    "publisher": "Chilled Mouse",
    "release_date": "Feb 24 2017",
    "developers": [
      "Chilled Mouse"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "genres": [
      "Puzzle",
      "General"
    ],
    "meta_score": 75,
    "users_score": 2.1,
    "image": "https://static.metacritic.com/images/products/games/6/a95d7f6a7e42c7b1bfd5e3fd00ab1e40-98.jpg",
    "descriptions": "Arrange pieces, paint the board, make music. Chime Sharp is a sequel to 2009’s Chime, a music puzzle game with an ambient heartbeat. You tessellate shapes to cover a grid, while a beatline reads those shapes as notes. As you cover the board the music builds to a crescendo of your own design."
  },
  {
    "name": "Metrico+",
    "details_link": "https://www.metacritic.com/game/xbox-one/metrico+",
    "publisher": "Digital Dreams",
    "release_date": "Jan 20 2017",
    "developers": [
      "Digital Dreams"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Puzzle",
      "Action"
    ],
    "meta_score": 75,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/433789bd1be5569219676aa720b70d08-98.jpg",
    "descriptions": "Metrico+ is an input-driven game in a world of infographics. All the bar charts, line diagrams and pie charts react to what the player is doing. One bar diagram might grow for every step you walk to the left, while another could decline with every jump you make. You will have to exploreMetrico+ is an input-driven game in a world of infographics. All the bar charts, line diagrams and pie charts react to what the player is doing. One bar diagram might grow for every step you walk to the left, while another could decline with every jump you make. You will have to explore Metrico+ and carefully analyze your every move to see how it affects the world, and whether it will get you further. This mechanic is called “Input Morphing” and it makes you think about actions you normally don’t think about. Metrico+ is a combination of exploration, skill, experimentation, but most of all: thinking outside of the box. [Microsoft.com]… Expand"
  },
  {
    "name": "Prison Architect",
    "details_link": "https://www.metacritic.com/game/xbox-one/prison-architect",
    "publisher": "Sold Out Software",
    "release_date": "Jul  1 2016",
    "developers": [
      "Introversion",
      "Double Eleven"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Strategy",
      "General",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 75,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/6/978c02f88f864eeb571e52c8368ca5f2-98.jpg",
    "descriptions": "Will you build and manage a prison to create social order where it’s failed in the past, offering rehabilitation and peaceful coexistence amongst inmates? Will your prison disregard human rights, impose intentional harshness and be devoid of any notions of wellbeing and freedom? The choiceWill you build and manage a prison to create social order where it’s failed in the past, offering rehabilitation and peaceful coexistence amongst inmates? Will your prison disregard human rights, impose intentional harshness and be devoid of any notions of wellbeing and freedom? The choice is yours.  In Prison Architect you will see the impact of your grand design on the lives of your inmates; be it a utopic center for rehabilitation, a brutal Super Max Prison or anything in between. Even when all of your prisoners’ needs are met, remember one thing - it’s still a prison and no one really wants to be there.… Expand"
  },
  {
    "name": "Need for Speed Carbon",
    "details_link": "https://www.metacritic.com/game/gamecube/need-for-speed-carbon",
    "publisher": "EA Games",
    "release_date": "Oct 31 2006",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/3/14cf9b848e8b14abe666b310f79cdd76-98.jpg",
    "descriptions": "What starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods oneWhat starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Need for Speed Carbon delivers the next generation of customization giving you the power to design and tweak your crew's cars in every way using the ground-breaking new Autosculpt technology. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games.… Expand"
  },
  {
    "name": "NBA Street Showdown",
    "details_link": "https://www.metacritic.com/game/psp/nba-street-showdown",
    "publisher": "EA Sports Big",
    "release_date": "Apr 27 2005",
    "developers": [
      "EA Canada"
    ],
    "platforms": "PSP",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Arcade",
      "Arcade"
    ],
    "meta_score": 75,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/3/587d4e30c84f48d412c2cbccf88e450a-98.jpg",
    "descriptions": "Rule the Streets: Take on the biggest stars of the NBA in full Street style, battle it out with a 3-on-3 game, or go on the ultimate quest to become a Street legend in the King of the Court mode. Create Your Own Baller: Add your personal style to your created street baller and hold your ownRule the Streets: Take on the biggest stars of the NBA in full Street style, battle it out with a 3-on-3 game, or go on the ultimate quest to become a Street legend in the King of the Court mode. Create Your Own Baller: Add your personal style to your created street baller and hold your own against the greatest legends in King of the Court mode. Two Unique Game Modes: Earn style points in Shot Blocker and Arcade Shootout modes and enhance your status as the game’s newest street legend. Wireless Head-to-Head Play: Play one-on-one against a friend in the original Pick Up game mode. Party Play: Up to four players can compete in two high-flyin’ game modes: Shot Blocker and Arcade Shootout using one PSP. EA Pocket Trax: This new feature designed for PSP allows you to listen and watch music content via this built in player. [Electronic Arts]… Expand"
  },
  {
    "name": "Assassin's Creed: Brotherhood - The Da Vinci Disappearance",
    "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-brotherhood---the-da-vinci-disappearance",
    "publisher": "Ubisoft",
    "release_date": "Mar  8 2011",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 75,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/8/d85a33c885625834efe2081e0cdd35d3-98.jpg",
    "descriptions": "The Da Vinci Disappearance will include both single-player and multiplayer content for Assassin's Creed Brotherhood. After the fall of the Borgias in Rome, Leonardo Da Vinci is kidnapped by the Hermeticists, an underground cult dedicated to transforming mankind. Ezio will embark on aThe Da Vinci Disappearance will include both single-player and multiplayer content for Assassin's Creed Brotherhood. After the fall of the Borgias in Rome, Leonardo Da Vinci is kidnapped by the Hermeticists, an underground cult dedicated to transforming mankind. Ezio will embark on a relentless quest to recover stolen paintings in order to find Leo before it is too late, discovering two new locations and two new gameplay features along the way.… Expand"
  },
  {
    "name": "Nihilumbra",
    "details_link": "https://www.metacritic.com/game/pc/nihilumbra",
    "publisher": "BEAUTIFUN GAMES SL",
    "release_date": "Sep 24 2013",
    "developers": [
      "BEAUTIFUN GAMES SL",
      "BeautiFun Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation Vita",
      "Switch",
      "Wii U",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Adventure",
      "General",
      "General",
      "Platformer",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/8/938e2f2736e439a22b8fc37d51737431-98.jpg",
    "descriptions": "Nihilumbra is a dark, atmospheric 2D puzzle platform game boasting hand painted dark environments, nightmarish monsters, and a hauntingly beautiful soundtrack. It tells a story that really panders to the existential dread lurking within us all."
  },
  {
    "name": "Dead Nation: Road of Devastation",
    "details_link": "https://www.metacritic.com/game/playstation-3/dead-nation-road-of-devastation",
    "publisher": "SCEA",
    "release_date": "Sep 27 2011",
    "developers": [
      "Housemarque"
    ],
    "platforms": "PlayStation 3",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Shoot-'Em-Up",
      "Modern",
      "Modern",
      "Top-Down"
    ],
    "meta_score": 75,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/0/a17d13a1572eaa28c86449e54edcbe22-98.jpg",
    "descriptions": "Continuing from the events where the original game left off (or, is it actually the other way around...), you'll find ‘Road of Devastation’ will put your skills to the ultimate test. You'll find yourself waking up in a laboratory with only one way out. Outside the door you're presented withContinuing from the events where the original game left off (or, is it actually the other way around...), you'll find ‘Road of Devastation’ will put your skills to the ultimate test. You'll find yourself waking up in a laboratory with only one way out. Outside the door you're presented with a choice - you're faced with a crossroads leading to three different roads, each with their own unique environments, challenges and enemies waiting for you.… Expand"
  },
  {
    "name": "Tell Me Why",
    "details_link": "https://www.metacritic.com/game/pc/tell-me-why",
    "publisher": "Xbox Game Studios",
    "release_date": "Aug 27 2020",
    "developers": [
      "DONTNOD Entertainment"
    ],
    "platforms": [
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 75,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/2/5a2ef49454458e89270f141acf085155-98.jpg",
    "descriptions": "Tell Me Why is the latest narrative adventure game from DONTNOD Entertainment, the studio behind the beloved franchise, Life Is Strange. In this intimate thriller, twins Tyler and Alyson Ronan use their special bond to unravel mysteries of their loving but troubled childhood. Set inTell Me Why is the latest narrative adventure game from DONTNOD Entertainment, the studio behind the beloved franchise, Life Is Strange. In this intimate thriller, twins Tyler and Alyson Ronan use their special bond to unravel mysteries of their loving but troubled childhood. Set in beautiful small-town Alaska, Tell Me Why features true-to-life characters, mature themes and gripping choices.… Expand"
  },
  {
    "name": "Command & Conquer 3: Kane's Wrath",
    "details_link": "https://www.metacritic.com/game/xbox-360/command-conquer-3-kanes-wrath",
    "publisher": "EA Games",
    "release_date": "Jun 23 2008",
    "developers": [
      "EA LA"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "4  Online",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 75,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/7/bb54222dea0240f496999cdbf839b201-98.jpg",
    "descriptions": "As the expansion pack to Command & Conquer 3 Tiberium Wars, this Real-time Strategy game returns to the Tiberium universe with Kane at the center of an epic new single player campaign which allows players to experience a new story that spans 20 years – from the rebirth of the Brotherhood ofAs the expansion pack to Command & Conquer 3 Tiberium Wars, this Real-time Strategy game returns to the Tiberium universe with Kane at the center of an epic new single player campaign which allows players to experience a new story that spans 20 years – from the rebirth of the Brotherhood of Nod after the Second Tiberium War through the dramatic events of the Third Tiberium War and beyond. The story is told through a new set of high-definition live action video sequences starring a celebrity cast. Joe Kucan, the original actor who portrayed the character Kane in Command & Conquer games over the last decade, reprises his role as the megalomaniacal leader of the Brotherhood of Nod. Kane's Wrath also features a new strategic layer to gameplay that allows players to establish bases, build customized armies, and attack their enemies on a global scale – and then dive into the frenzied tactical combat where their skills as a commander makes the difference in battle. The game introduces six new sub-factions and a wealth of new units, structures, and powers to the armies of the Global Defense Initiative, the Brotherhood of Nod, and the enigmatic alien Scrin. The Xbox 360 version features a revolutionary new radial interface designed specifically for console gamers. Taking RTS controls to a whole new level, players utilize the command stick to build, deploy, and attack. [Electronic Arts]… Expand"
  },
  {
    "name": "Myst IV: Revelation",
    "details_link": "https://www.metacritic.com/game/xbox/myst-iv-revelation",
    "publisher": "Ubisoft",
    "release_date": "Mar 29 2005",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": "Xbox",
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "First-Person",
      "Fantasy"
    ],
    "meta_score": 75,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/b818ab66d60ab2e7451a64901d09cdf1-98.jpg",
    "descriptions": "In Myst IV: Revelation, you can finally learn the fate of Sirrus and Achenar--the two villains first introduced in the original Myst. The brothers have remained trapped in separate prison worlds, abandoned by their father for crimes they had committed. Now you must venture deep inside theseIn Myst IV: Revelation, you can finally learn the fate of Sirrus and Achenar--the two villains first introduced in the original Myst. The brothers have remained trapped in separate prison worlds, abandoned by their father for crimes they had committed. Now you must venture deep inside these worlds, while uncovering the mystery surrounding a little girl's disappearance. As you solve puzzles, take pictures, and interact with other characters, you'll soon understand the villains' motives.… Expand"
  },
  {
    "name": "Dungeons 3",
    "details_link": "https://www.metacritic.com/game/pc/dungeons-3",
    "publisher": "Kalypso",
    "release_date": "Oct 13 2017",
    "developers": [
      "Realmforge Studios"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "General"
    ],
    "meta_score": 75,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/d9687529e6bfdee969822b3eb5bb659f-98.jpg",
    "descriptions": "At last, the Dungeon Lord has successfully united the forces of evil and established his dark empire. Time for the next step in his most diabolical quest: expansion!"
  },
  {
    "name": "Warp",
    "details_link": "https://www.metacritic.com/game/pc/warp",
    "publisher": "Electronic Arts",
    "release_date": "Mar 13 2012",
    "developers": [
      "Trapdoor"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "General"
    ],
    "meta_score": 75,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/3/92a5fca81513a19c9abb7b528aec2e29-98.jpg",
    "descriptions": "Warp is a puzzle-based stealth action game from Trapdoor."
  },
  {
    "name": "Dragon Ball: Advanced Adventure",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/dragon-ball-advanced-adventure",
    "publisher": "Atari",
    "release_date": "Jun  6 2006",
    "developers": [
      "Dimps Corporation"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 75,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/54007c0faf842a706150d94470c07726-98.jpg",
    "descriptions": "Join Goku® in his very first epic adventure as he defends the earth from the relentless Red Ribbon Army. Start down his path to power, and help turn an ordinary boy into the ultimate champion."
  },
  {
    "name": "Hidden & Dangerous 2",
    "details_link": "https://www.metacritic.com/game/pc/hidden-dangerous-2",
    "publisher": "Gathering",
    "release_date": "Oct 21 2003",
    "developers": [
      "Illusion Softworks"
    ],
    "platforms": "PC",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Tactical",
      "Historic",
      "Historic"
    ],
    "meta_score": 75,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/5/b3c4f26ebc5c1fe3ae9526e979adee6d-98.jpg",
    "descriptions": "Hidden & Dangerous 2 is a first and third person tactical shooter that builds upon the tremendous success of Hidden & Dangerous. You lead a small squad of Allied soldiers deep behind enemy lines, to carry out secret missions during World War II. The gripping story line takes you to Europe,Hidden & Dangerous 2 is a first and third person tactical shooter that builds upon the tremendous success of Hidden & Dangerous. You lead a small squad of Allied soldiers deep behind enemy lines, to carry out secret missions during World War II. The gripping story line takes you to Europe, Africa, Burma, and other locations scattered across the globe. Each critical decision impacts you, your men, and your country.  This unique blend of action, strategy, and tactics forces you to use your brain just as much as your trigger finger. [Gathering of Developers]… Expand"
  },
  {
    "name": "Dynasty Warriors 4",
    "details_link": "https://www.metacritic.com/game/xbox/dynasty-warriors-4",
    "publisher": "Koei",
    "release_date": "Sep  5 2003",
    "developers": [
      "Omega Force"
    ],
    "platforms": [
      "PC",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 75,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/051c876c5f40861b5a53251d330bba26-98.jpg",
    "descriptions": "The fourth entry in the Dynasty Warriors series puts you in command of huge armies from ancient China. Based on historical battles in China during the Han period, Dynasty Warriors 4 lets you choose from the Wu, Wei, or Shu factions and start a campaign over 50 stages and across 17 uniqueThe fourth entry in the Dynasty Warriors series puts you in command of huge armies from ancient China. Based on historical battles in China during the Han period, Dynasty Warriors 4 lets you choose from the Wu, Wei, or Shu factions and start a campaign over 50 stages and across 17 unique maps. This time, you can create your own bodyguards and officers and engage in one-on-one duels. Giant siege engines, essential to battlefield victory, include catapults, battering rams, bridge layers, flame-throwing tiger tanks, and more.… Expand"
  },
  {
    "name": "Mortal Kombat: Tournament Edition",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/mortal-kombat-tournament-edition",
    "publisher": "Midway",
    "release_date": "Aug 27 2003",
    "developers": [
      "Criterion Games"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/3e570b049366c62c8a9b2af0ca81937d-98.jpg",
    "descriptions": "The deadly alliance between Shang Tsung and Quan Chi remains intact. In Mortal Kombat: Tournament Edition, however, a new set of warriors seeks revenge against these evil warlords. See who proves victorious as you fight your way through both tournament and tag-team action on your Game BoyThe deadly alliance between Shang Tsung and Quan Chi remains intact. In Mortal Kombat: Tournament Edition, however, a new set of warriors seeks revenge against these evil warlords. See who proves victorious as you fight your way through both tournament and tag-team action on your Game Boy Advance. In addition to more fighters, this installment in the Mortal Kombat series provides multiplayer support for up to four players (via Game Boy Advance link cable), a variety of gameplay modes, and new battlegrounds.… Expand"
  },
  {
    "name": "NHL 2003",
    "details_link": "https://www.metacritic.com/game/pc/nhl-2003",
    "publisher": "EA Sports",
    "release_date": "Sep 30 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 75,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/6/8f07f219029bc03b90e89db0d89f265b-98.jpg",
    "descriptions": "Dynamic Deke Control: User-activated dekes give you full control of the puck. Game Breaker: Build enough momentum and the action slows in key moments -- feel your heart pounding while you go for goal. New Graphics and Animation Engine: NHL action comes to life with all-new animations andDynamic Deke Control: User-activated dekes give you full control of the puck. Game Breaker: Build enough momentum and the action slows in key moments -- feel your heart pounding while you go for goal. New Graphics and Animation Engine: NHL action comes to life with all-new animations and stunning graphics. New Puck Physics and Goalie AI: The players and puck respond more accurately to your actions. More Cool Features: 4 game modes, Create-A-Player, real on-ice sounds, and dynamic camera work bring the NHL to your fingertips. [EA Sports]… Expand"
  },
  {
    "name": "Mat Hoffman's Pro BMX",
    "details_link": "https://www.metacritic.com/game/dreamcast/mat-hoffmans-pro-bmx",
    "publisher": "Activision",
    "release_date": "Sep 11 2001",
    "developers": [
      "Runecraft"
    ],
    "platforms": [
      "PC",
      "Dreamcast"
    ],
    "genres": [
      "Sports",
      "Alternative",
      "Biking"
    ],
    "meta_score": 75,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/62c88d51b131344601fcf5815189c4b9-98.jpg",
    "descriptions": "Mat Hoffman is easily the best BMX game on the Dreamcast."
  },
  {
    "name": "Dynasty Warriors 2",
    "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-2",
    "publisher": "Koei",
    "release_date": "Oct 25 2000",
    "developers": [
      "Omega Force"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 75,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/8/6656f34e8a6fecb3eea58f4df8767a0d-98.jpg",
    "descriptions": "The Romance of the Three Kingdoms comes to life in Dynasty Warriors 2. As a general in second-century China, you must lead your troops into epic battles against thousands of warriors. On horseback or on foot, you'll use various weapons and combo attacks to forge a path into enemy lines andThe Romance of the Three Kingdoms comes to life in Dynasty Warriors 2. As a general in second-century China, you must lead your troops into epic battles against thousands of warriors. On horseback or on foot, you'll use various weapons and combo attacks to forge a path into enemy lines and scatter all who dare stand in your path. Strategic planning is key to victory, as enemies can attack from all sides and when you least expect it. … Expand"
  },
  {
    "name": "X-Men: Mutant Academy",
    "details_link": "https://www.metacritic.com/game/playstation/x-men-mutant-academy",
    "publisher": "Activision",
    "release_date": "Jul 11 2000",
    "developers": [
      "Paradox Development"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 75,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/7/e5e6cfb24c689f88d22e458f28f0e7c8-98.jpg",
    "descriptions": "X-Men sticks close to the standard fighting game formula, and as a result, it manages to be fun for a short period of time."
  },
  {
    "name": "Airfix Dogfighter",
    "details_link": "https://www.metacritic.com/game/pc/airfix-dogfighter",
    "publisher": "EON Digital Entertainment",
    "release_date": "Jan 14 2000",
    "developers": [
      "Paradox Interactive"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Simulation",
      "Flight",
      "Modern Jet",
      "Modern Jet",
      "Combat"
    ],
    "meta_score": 75,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/3/495be642fc2c16b272b93f60df8b9133-98.jpg",
    "descriptions": "Get behind the controls and take on the role of a WWII fighter pilot. Wreak havoc by raiding and ransacking your house in search of new model kits and tools, such as bombs and cannons with which to upgrade your firepower. Top speed and skill are imperative to survive.  [EON Digital Entertainment]"
  },
  {
    "name": "Shovel Knight Showdown",
    "details_link": "https://www.metacritic.com/game/switch/shovel-knight-showdown",
    "publisher": "Yacht Club Games",
    "release_date": "Dec 10 2019",
    "developers": [
      "Yacht Club Games"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 75,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/5/43afb29880609d8053228a5149ef9209-98.jpg",
    "descriptions": "Shovel Knight Showdown is the ultimate platform fighting experience, where you can duel with up to 4 players and scramble after gems as your favorite heroic or villainous knight from the Shovel Knight: Treasure Trove saga. Gather your pals for endless multiplayer clashes, or choose from moreShovel Knight Showdown is the ultimate platform fighting experience, where you can duel with up to 4 players and scramble after gems as your favorite heroic or villainous knight from the Shovel Knight: Treasure Trove saga. Gather your pals for endless multiplayer clashes, or choose from more than 16 playable characters in Story Mode, each with their own unique story to tell. Master every move, explore a vast array of items and locales, and discover new revelations in Shovel Knight Showdown. When a magical catastrophe creates a world of never-ending battle, the heroes and villains of the Shovel Knight saga must discover the source of the disaster and fight to set things right! Play as your favorite character (alone or with a friend in co-op battles), face off against powerful rivals, and perfect your platform fighting skills in full-featured practice and target modes on your way to an all-new final encounter. Unlock new content and revisit Shovel Knight Showdown again and again as you dig into an immense variety of single-player and local multiplayer modes, features, and customizations.… Expand"
  },
  {
    "name": "NightSky",
    "details_link": "https://www.metacritic.com/game/3ds/nightsky",
    "publisher": "Nicalis",
    "release_date": "Oct 25 2012",
    "developers": [
      "Nicalis"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "3DS"
    ],
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Action"
    ],
    "meta_score": 75,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/2/e7f0f37fac54d8c388e45665bc9c1e17-98.jpg",
    "descriptions": "NightSky is an ambient action-puzzle game that offers a gameplay experience unlike any other cerebral challenges fill uniquely designed picturesque worlds. Each of these worlds is broken into different areas in which the player must maneuver a sphere by using realistic physics to advance."
  },
  {
    "name": "No More Heroes III",
    "details_link": "https://www.metacritic.com/game/switch/no-more-heroes-iii",
    "publisher": "Grasshopper Manufacture",
    "release_date": "Aug 27 2021",
    "developers": [
      "Grasshopper Manufacture"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General",
      "Open-World"
    ],
    "meta_score": 75,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/4/888f83955fb01257552c276481c35244-98.jpg",
    "descriptions": "Travis Touchdown returns to Santa Destroy after a ten-year absence. There he finds a huge artificial island metropolis floating in the sea, and a mysterious flying object hovering high above. What kind of crazy dangerous assassins will Travis face off against this time?!"
  },
  {
    "name": "The Walking Dead: The Telltale Series - The Final Season Episode 4: Take Us Back",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---the-final-season-episode-4-take-us-back",
    "publisher": "Telltale Games",
    "release_date": "Mar 26 2019",
    "developers": [
      "Telltale Games",
      "Skybound Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 75,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/2e8746525fce3d755e2b7b8650484dfd-98.jpg",
    "descriptions": null
  },
  {
    "name": "Omensight",
    "details_link": "https://www.metacritic.com/game/pc/omensight",
    "publisher": "Spearhead Games",
    "release_date": "May 15 2018",
    "developers": [
      "Spearhead Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 75,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/0/e3972a218e8a526c4be7486939533a3c-98.jpg",
    "descriptions": "Omensight is an Action Murder-Mystery game. You are the Harbinger, a powerful mystical warrior who has witnessed the destruction of the world. In order to prevent annihilation, you are destined to repeat that fateful day and solve the murder of the Godless-Priestess, whose death precipitatedOmensight is an Action Murder-Mystery game. You are the Harbinger, a powerful mystical warrior who has witnessed the destruction of the world. In order to prevent annihilation, you are destined to repeat that fateful day and solve the murder of the Godless-Priestess, whose death precipitated the apocalypse.\r… Expand"
  },
  {
    "name": "Bomber Crew",
    "details_link": "https://www.metacritic.com/game/pc/bomber-crew",
    "publisher": "Curve Digital",
    "release_date": "Oct 19 2017",
    "developers": [
      "Runner Duck"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Strategy",
      "Flight",
      "Real-Time",
      "General",
      "Combat"
    ],
    "meta_score": 75,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/1/7db46b4dfa1a14ec4095a16d0bb2f420-98.jpg",
    "descriptions": "Chocks away! Bomber Crew is a strategic simulation game, where picking the right crew and keeping your bomber in tip top shape is the difference between completing your mission or losing it all."
  },
  {
    "name": "The Evil Within: The Consequence",
    "details_link": "https://www.metacritic.com/game/playstation-4/the-evil-within-the-consequence",
    "publisher": "Bethesda Softworks",
    "release_date": "Apr 21 2015",
    "developers": [
      "Tango Gameworks"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 75,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/8/a7536af65737333840f910725958a20e-98.jpg",
    "descriptions": "This is the final installment of a two-part, story driven experience where players take on the role of detective Juli Kidman, Sebastian Castellanos’ mysterious partner, in a concurrent story that looks to answer some of the questions surrounding her whereabouts during The Evil Within. AlongThis is the final installment of a two-part, story driven experience where players take on the role of detective Juli Kidman, Sebastian Castellanos’ mysterious partner, in a concurrent story that looks to answer some of the questions surrounding her whereabouts during The Evil Within. Along the way she will encounter disturbing new enemies, discover new mysteries, and uncover new horrors.… Expand"
  }
]