[{"name": "Operation: Vietnam", "details_link": "https://www.metacritic.com/game/ds/operation-vietnam", "publisher": "Majesco Games", "release_date": "Aug 20 2007", "developers": ["Coyote Console"], "platforms": "DS", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Historic", "Historic"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/a95b43ebe1962a608403bd354f1c12e6-98.jpg", "descriptions": "On a routine run over the Vietnam war-zone your chopper is taken down in VC territory. It’s up to you and your squad to make it out of the VC infested region while liberating civilians.  You’re in total command as you make your way through war-torn Vietnam and eliminate the VCOn a routine run over the Vietnam war-zone your chopper is taken down in VC territory. It’s up to you and your squad to make it out of the VC infested region while liberating civilians.  You’re in total command as you make your way through war-torn Vietnam and eliminate the VC insurgence.Command your squad of up to four soldiers at once. Use the Touch Screen to issue commands, view the map, access inventory and select which squad member to control. 20 different jungle missions include rescuing POWs, saving civilians, hunting down VC, and more. Utilize your squad to combat multiple enemy types including: soldiers, tanks, turrets, enemy barracks, etc. Take advantage of different specialties and weapons per solider: long range shot, grenade launcher, automatic weapons, etc. Beware land mines and other traps throughout war-torn Vietnam. Flush out enemies with smoke grenades or take out a swarm of VC with fragmentation grenades. Destructible environments filled with barrels, crates and animals add to the war experience. [Majesco]… Expand"}, {"name": "Sega Superstars Tennis", "details_link": "https://www.metacritic.com/game/ds/sega-superstars-tennis", "publisher": "Sega", "release_date": "Mar 18 2008", "developers": ["Sumo Digital"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 65, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/07111a2ced23d4a53392f8494b64613a-98.jpg", "descriptions": "Sixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos andSixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos and comical guest umpires from SEGA's rich gaming history, this fun-filled tennis party promises to be a smashing good time for the whole family. Zany SEGA Characters with Superstar Abilities - Each of the 16 characters has their own superstar alter-ego, which gives them the winning edge on the court. Ten Fantastical Themed Courts - Guest umpires will supervise the action on a wide variety of colorful courts, from Sonic's lush Green Hill Zone to Ulala's galactic Space Channel 5 world, just to name a couple. Four Action-Packed Tournaments - As you slice your way through the competitive tournaments, you will unlock loads of bonus content. Classic Soundtrack - Faithfully recreated in full Dolby Digital 5.1, treasured SEGA tunes will entertain SEGA fans new and old. [Sega]… Expand"}, {"name": "Flow: Urban Dance Uprising", "details_link": "https://www.metacritic.com/game/playstation-2/flow-urban-dance-uprising", "publisher": "Ubisoft", "release_date": "Nov 15 2005", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/6439fa01cda5a84ebb6dcec8bb93f114-98.jpg", "descriptions": "Feel the flow. Everybody’s got a story to tell. In Urban Dance, you tell it with your body. Whether you’re old school, pioneering fresh moves, or new to breakdancing altogether, you’ll find fresh beats and challenges in Flow: Urban Dance Uprising, the first-ever breakdancing game where youFeel the flow. Everybody’s got a story to tell. In Urban Dance, you tell it with your body. Whether you’re old school, pioneering fresh moves, or new to breakdancing altogether, you’ll find fresh beats and challenges in Flow: Urban Dance Uprising, the first-ever breakdancing game where you actually get up and move. Host dance battles, get fit, and master up to 300 moves from all schools of Urban Dance. Rhythm scores you points; style scores respect. Express your skills and style to 50 current, licensed hip-hop tracks. Learn the foundations of Urban Dance in Easy mode, and challenge yourself with fly power moves as you advance through Medium and Expert. Establish your character’s rep across town in 100 single-player challenges and unlock songs, power moves, custom interfaces, and more. Break out your dance pad and master up to 300 moves per character. Or, try them out with your Dual shock 2 controller. Develop your moves and stamina in three single-player modes, then battle against friends in Versus, Break Style, and 8-player Competition mode. Pick from 10 different b-boys and girls, or watch yourself dance using the Sony USB Camera Eye Toy. [Ubisoft]… Expand"}, {"name": "Counter-Strike: Condition Zero", "details_link": "https://www.metacritic.com/game/pc/counter-strike-condition-zero", "publisher": "Sierra Entertainment", "release_date": "Jan  3 2004", "developers": ["Turtle Rock Studios"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 65, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/b9c72f04c48b4d4681850bcff1b0583f-98.jpg", "descriptions": "Counter-Strike: Condition Zero (CS:CZ), a tactical action game, challenges you to compete with and against cunning AI opponents in mission-based campaigns spread across the globe. As squad leader of an elite counter-terrorist operative, use specialized maneuvers and weapon skills to completeCounter-Strike: Condition Zero (CS:CZ), a tactical action game, challenges you to compete with and against cunning AI opponents in mission-based campaigns spread across the globe. As squad leader of an elite counter-terrorist operative, use specialized maneuvers and weapon skills to complete over 20 new missions, each containing numerous objectives. Drop into challenging scenarios -- from harsh jungle environments to severe arctic terrains, from unforgiving deserts to dangerous international city streets. Rescue hostages. Escort VIPs to safety. Locate and defuse bombs. This collection of entirely new episodes challenges your ability to think quickly and strategically! CS:CZ advances the award-winning Counter-Strike series by introducing single-player action and special enhancements for online play. Powered by an enriched Half-Life engine, CS:CZ introduces new game technologies including highly-detailed models, atmospheric enhancements such as snow and rain, and many more dynamic special effects. [Sierra]… Expand"}, {"name": "Phantom Brave: The Hermuda Triangle", "details_link": "https://www.metacritic.com/game/psp/phantom-brave-the-hermuda-triangle", "publisher": "NIS America", "release_date": "Mar  8 2011", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 65, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/f37a05d02f68c5a736e5b9da26a8b772-98.jpg", "descriptions": "Phantom Brave: Heroes of the Hermuda Triangle comes to the PSP with some new content."}, {"name": "Unrest", "details_link": "https://www.metacritic.com/game/pc/unrest", "publisher": "KISS Ltd.", "release_date": "Jul 23 2014", "developers": ["Pyrodactyl Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/beee0d3b7bd050d5d4f26d66db2ab8cf-98.jpg", "descriptions": "Legends tell of heroes, villains, and quests that save the world from darkness. The streets tell a different story.  Unrest is a story driven RPG set in ancient India in the midst of an uprising. Play as ordinary men and women struggling for safety, freedom, food for their children, and aLegends tell of heroes, villains, and quests that save the world from darkness. The streets tell a different story.  Unrest is a story driven RPG set in ancient India in the midst of an uprising. Play as ordinary men and women struggling for safety, freedom, food for their children, and a chance at peace.… Expand"}, {"name": "Supreme Ruler 2020", "details_link": "https://www.metacritic.com/game/pc/supreme-ruler-2020", "publisher": "Paradox Interactive", "release_date": "Jul  1 2008", "developers": ["BattleGoat Studios"], "platforms": "PC", "num_players": "16  Online", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 65, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/6086c5377591ed41de1b9f9376e5e4ac-98.jpg", "descriptions": "Control any department within your government or  delegate decisions to your Cabinet Ministers. Sophisticated Military Strategic and Tactical Command System. Select from hundreds of actual military vehicles to research, build, and deploy. Choose conventional warfare or develop your nuclearControl any department within your government or  delegate decisions to your Cabinet Ministers. Sophisticated Military Strategic and Tactical Command System. Select from hundreds of actual military vehicles to research, build, and deploy. Choose conventional warfare or develop your nuclear weapons program. Detailed Economic and Political Models. Flexible Diplomatic Interface allowing sophisticated negotiations. Play any one of over 250 Regions world-wide. High Resolution Satellite imagery provided courtesy of NASA. Single Player or Multi Player support. Includes Map Editor and extensive modability. Varied Game-play options include Regional Battles, Missions and Campaigns. Introducing BattleGoat's new Super Sandbox Mode for unlimited customization and replayability. [Paradox Interactive]… Expand"}, {"name": "Warhammer 40,000: Kill Team", "details_link": "https://www.metacritic.com/game/playstation-3/warhammer-40000-kill-team", "publisher": "THQ", "release_date": "Aug  2 2011", "developers": ["THQ Warrington"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/7561cbc86477eeb984445f096d570b46-98.jpg", "descriptions": "In this third person arcade style shooter, players take on the role of an elite Space Marine team sent to assault a giant Ork Kroozer en-route to an Imperial Forge World. Do you have what it takes to take out the Warboss and prevent the Waaaagh?"}, {"name": "Star Wars: The Force Unleashed - Ultimate Sith Edition", "details_link": "https://www.metacritic.com/game/pc/star-wars-the-force-unleashed---ultimate-sith-edition", "publisher": "Aspyr", "release_date": "Nov  3 2009", "developers": ["LucasArts"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "Compilation"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/782afb00779c60fc6e5258d3e8448368-98.jpg", "descriptions": "Star Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode IIIStar Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode III Revenge of the Sith\" and \"Star Wars: Episode IV A New Hope.\" In it, players assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny. Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos. The Secret Apprentice doesn't just Force push enemies into walls - he Force pushes enemies through walls.… Expand"}, {"name": "Heroes of Might & Magic III - HD Edition", "details_link": "https://www.metacritic.com/game/pc/heroes-of-might-magic-iii---hd-edition", "publisher": "Ubisoft", "release_date": "Jan 29 2015", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "General"], "meta_score": 65, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/7/8ba4f3173e63c3abcff090c2420a215f-98.jpg", "descriptions": "Fifteen years later, rediscover the epic tale of Queen Catherine Ironfist, as she begins her critically acclaimed quest to unite her ravaged homeland and re-conquer the kingdom of Erathia."}, {"name": "The Godfather II", "details_link": "https://www.metacritic.com/game/xbox-360/the-godfather-ii", "publisher": "Electronic Arts", "release_date": "Apr  7 2009", "developers": ["EA Redwood Shores"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action Adventure", "Adventure", "Third-Person", "Historic", "Linear", "Open-World", "Modern"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/2371adc1f32dbaeb091d02be046529c3-98.jpg", "descriptions": "After being promoted by Michael Corleone to Don of New York, players expand to new cities, as they build up their families through extorting businesses, monopolizing illegal crime rings and defeating new families in an effort to become the most powerful mob family in America. To help playersAfter being promoted by Michael Corleone to Don of New York, players expand to new cities, as they build up their families through extorting businesses, monopolizing illegal crime rings and defeating new families in an effort to become the most powerful mob family in America. To help players manage their empire, The Godfather II introduces \"The Don's View\" – an innovative strategy meta-game that allows players to oversee the entire world as they grow the family business. Using the Don's View, players will be able to build, defend and expand their crime rings, while keeping an eye on the movements and plans of the rival families. Players will also learn to master the business of organized crime by building a family of Made Men, hiring crew, handing out orders, and promoting their best men up the ranks. Set in a stunning open-world environment, The Godfather II expands on the popular gameplay mechanics of the first game and doubles down on the series' signature BlackHand control scheme, which now features even more visceral hand-to-hand brutality at your fingertips, introducing a new combo system, pressure tactics and executions. In The Godfather II, players fight alongside their hand-picked crew, who have their own skills and expertise. Each family member specializes in a specific field such as demolitions, arson, engineering, first-aid and more. As The Don you control the family, sending some of your men on missions while heading off into action with others. The combination of strategic organized crime gameplay and brutal BlackHand action promises to set The Godfather II apart from other open-world games. Play The Godfather II online multiplayer modes and become the true Don of Dons. Take your money, weapons, and crew from your single-player experience online and wage mob warfare against up to 16 players from around the world.  Play as one of the family’s crew specialists and put your best strategies to the test as you take over territory and strike back at rivals. Earn upgrades and money that can be used in your single-player experience. [Electronic Arts]… Expand"}, {"name": "Ace Angler: Fishing Spirits", "details_link": "https://www.metacritic.com/game/switch/ace-angler-fishing-spirits", "publisher": "Bandai Namco Games", "release_date": "Oct 28 2022", "developers": ["Racjin"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Nature", "Fishing"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/e1915b63bd0e4864eb7b5ca16cc826b8-98.jpg", "descriptions": "A request has arrived from the “Encyclopedia of Unfortunate Creatures”. By catching certain creatures in “Ace Angler +”, you can unlock a range of fascinating information about unfortunate creatures.\r Catch the creatures that have escaped from the “Encyclopedia of UnfortunateA request has arrived from the “Encyclopedia of Unfortunate Creatures”. By catching certain creatures in “Ace Angler +”, you can unlock a range of fascinating information about unfortunate creatures.\r Catch the creatures that have escaped from the “Encyclopedia of Unfortunate Creatures” and return them to earn rewards.\r  Check the encyclopedia after you’ve caught each animal to learn about their adorably unfortunate characteristics.… Expand"}, {"name": "Little Orpheus", "details_link": "https://www.metacritic.com/game/switch/little-orpheus", "publisher": "Secret Mode", "release_date": "Sep 13 2022", "developers": ["Secret Mode"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/cb86d4117a913a28b5fbeb7cebe1bf3c-98.jpg", "descriptions": "The year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia, a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the center of the earth. HeThe year is 1962 and NASA are trying to put a man on the moon. In a remote corner of Siberia, a Soviet cosmonaut is heading in the other direction. Comrade Ivan Ivanovich is dropped into an extinct volcano in his exploration capsule, Little Orpheus, to explore the center of the earth. He promptly vanishes.Join our bold yet hapless hero as he explores lost civilizations, undersea kingdoms, prehistoric jungles and lands beyond imagination. Gasp as he battles the subhuman tribe of the Menkv and escapes the clutches of dreadful monsters! Cheer as he triumphs over impossible odds and brings socialism to the subterranean worlds!Little Orpheus is a technicolor side-scrolling adventure game inspired by classic movies like Flash Gordon, Sinbad and The Land that Time Forgot. Delivered in eight bite-size, commute-friendly episodes, Little Orpheus is simple enough for casual players but rich enough for seasoned adventure fans.… Expand"}, {"name": "Within the Blade", "details_link": "https://www.metacritic.com/game/switch/within-the-blade", "publisher": "Ratalaika Games", "release_date": "Jul 16 2021", "developers": ["Ametist Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/cabdd15963b709a4ef540699260e12bd-98.jpg", "descriptions": "WTB has many distinguishing and unique features with its simplistic presentation offering detailed pixel art animations, ninjas galore fighting to their death, crafting of weapons and a whole lot more to present an ongoing challenge that will please and entice even the best of players.WTB has many distinguishing and unique features with its simplistic presentation offering detailed pixel art animations, ninjas galore fighting to their death, crafting of weapons and a whole lot more to present an ongoing challenge that will please and entice even the best of players. Importantly elements such as random level generation, crafting, skill trees are all part of a great mixture of ideas and interesting implementation. A Japanese Daime named Mamoru Imai summons demons to join his army, but darkness takes over his body and demons wreak havoc in the country. The player starts in the village “Black Lotus” and sensei sends him on the next mission. After each mission, the player returns to the village (Hub location) and here the player can take a break, craft, trade, inventory management, Sensei can learn new skills and get a new task.… Expand"}, {"name": "Cyanide & Happiness - Freakpocalypse", "details_link": "https://www.metacritic.com/game/switch/cyanide-happiness---freakpocalypse", "publisher": "Serenity Forge", "release_date": "Mar 11 2021", "developers": ["Serenity Forge", "Explosm"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/7bb6aaa76b3f5463a1fadd5510dda177-98.jpg", "descriptions": "From the creators of Cyanide & Happiness and I-Mockery, comes an all new point-an-click adventure game filled with dark humor, drama, and all the weirdness you've grown to love and/or dread over the years!"}, {"name": "Golden Force", "details_link": "https://www.metacritic.com/game/switch/golden-force", "publisher": "Just For Games", "release_date": "Jan 28 2021", "developers": ["Storybird", "Storybird Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/ea039b2b48dd190d21c4f262a570da92-98.jpg", "descriptions": "Defeat forces of evil along with Gutz, Spina, Drago, and Elder! Have some fun with their individual skills and movesets in a journey through Muscle Island.\r The King of Demons set his sights on Muscle Island, a paradisaical and peaceful place where it’s good to live. This evil personDefeat forces of evil along with Gutz, Spina, Drago, and Elder! Have some fun with their individual skills and movesets in a journey through Muscle Island.\r The King of Demons set his sights on Muscle Island, a paradisaical and peaceful place where it’s good to live. This evil person settled his army and persecutes the population with the help of his generals.\r Wasting their last coins in the taverns of the island, mercenaries from the feared GOLDEN FORCE enjoy their last moments of vacation when they receive a new contract: beat down this new evil in order to take back the mountain of gold in his possession.\r When there is gold and a promise of great battles, you can count on the GOLDEN FORCE to save your skin!… Expand"}, {"name": "HyperBrawl Tournament", "details_link": "https://www.metacritic.com/game/switch/hyperbrawl-tournament", "publisher": "Milky Tea Studios", "release_date": "Oct 20 2020", "developers": ["Milky Tea Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/b91f07b6dae0cc2e90ae0cb467938974-98.jpg", "descriptions": "The universe's greatest heroes have gathered to compete in a showdown for the ages; the legendary HyperBrawl Tournament! Armed with unique weapons and a thirst for glory, take to battle-tested arenas in this 1-4 player arcade-style sport played locally or online.\r Only the universe's eliteThe universe's greatest heroes have gathered to compete in a showdown for the ages; the legendary HyperBrawl Tournament! Armed with unique weapons and a thirst for glory, take to battle-tested arenas in this 1-4 player arcade-style sport played locally or online.\r Only the universe's elite champions can summon this incredible skill. The HyperCurve lets you seize control of the ball mid-flight to 'magically' manoeuvre it around the opposition and obstacles to score legendary goals that could only happen in HyperBrawl. The fabled HyperForce runs through your very DNA, channel it to launch game changing attacks that can literally see your enemies shot out of the arena with its devastating power.\r Already fabled heroes of their own worlds, competitors are drawn across the furthest realms to compete in the HyperBrawl Tournament. Choose from 12 heroes in three classes and load them out with lethal weaponry combos and paint their armour for victory.\r Travel the vast expanse of time and space to HyperBrawl arenas from the home planets of the heroes themselves. Take in Chrome City's elevated stadium with its Cyberpunk stylings, the ancient stadium of Steelhenge or the demonic Court of Azdritch. Each arena is laden with perilous obstacles and traps that layer more challenge and unpredictability into every game.… Expand"}, {"name": "Ultracore", "details_link": "https://www.metacritic.com/game/switch/ultracore", "publisher": "ININ Games", "release_date": "Jun 23 2020", "developers": ["Strictly Limited Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/1aca38d5e0b32ccd38940085f7be6d70-98.jpg", "descriptions": "Ultracore is a run-and-gun title developed by Digital Illusions."}, {"name": "My Hero One's Justice 2", "details_link": "https://www.metacritic.com/game/switch/my-hero-ones-justice-2", "publisher": "Bandai Namco Games", "release_date": "Mar 13 2020", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/06ad3c8d1532f51810c97b0d0387735d-98.jpg", "descriptions": "Fight for your justice in MY HERO ONE'S JUSTICE! The popular manga and anime series clashes head-to-head and Quirk-to-Quirk in this 3D arena fighter. Pave your path and choose between hero or villain and battle through iconic moments."}, {"name": "Might & Magic: Chess Royale", "details_link": "https://www.metacritic.com/game/pc/might-magic-chess-royale", "publisher": "Ubisoft", "release_date": "Jan 30 2020", "developers": ["Ubisoft"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Up to more than 64 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Board / Card Game", "Tactics"], "meta_score": 65, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/3/27bed00be9933f136fd7660e6a4a0dc6-98.jpg", "descriptions": "Discover the first massive real-time 100 players autobattler. \rFight 99 other players on a real-time chess battlefield and be the last hero standing! Re-discover classic units and heroes from the Might & Magic high-fantasy universe and create deep strategies in ten-minute competition. WhoDiscover the first massive real-time 100 players autobattler. \rFight 99 other players on a real-time chess battlefield and be the last hero standing! Re-discover classic units and heroes from the Might & Magic high-fantasy universe and create deep strategies in ten-minute competition. Who will win the Chess Royale? … Expand"}, {"name": "SELF", "details_link": "https://www.metacritic.com/game/switch/self", "publisher": "indienova", "release_date": "Jan 16 2020", "developers": ["doBell"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Text"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/8073cd8a2714e4eb551d28676aadd823-98.jpg", "descriptions": "SELF is a Kafkaesque suspense text-based adventure game with simulation and puzzle mechanics."}, {"name": "Weakless", "details_link": "https://www.metacritic.com/game/xbox-one/weakless", "publisher": "Punk Notion", "release_date": "Dec 13 2019", "developers": ["Cubeish Games"], "platforms": ["PC", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/87a72532ece8bade624ebd2c7b5aec21-98.jpg", "descriptions": "Weakless is an adventure game focusing on the relationship between two characters: The Blind One and The Deaf One. During their journey they will have to overcome the obstacles standing in their way, and face their own limitations.The core of Weakless is solving puzzles and exploring theWeakless is an adventure game focusing on the relationship between two characters: The Blind One and The Deaf One. During their journey they will have to overcome the obstacles standing in their way, and face their own limitations.The core of Weakless is solving puzzles and exploring the world using characters' unique skills - hearing and vision. The player controls one character at the time, which means they can't use both senses simultaneously.  Two heroes, who perceive their surroundings in completely different ways, and can overcome adversities thanks to cooperation.  A diverse world with a rich history waiting to be discovered.… Expand"}, {"name": "The Church in the Darkness", "details_link": "https://www.metacritic.com/game/pc/the-church-in-the-darkness", "publisher": "Paranoid Productions", "release_date": "Aug  2 2019", "developers": ["Paranoid Productions"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/b31f3baafaf649478ccc4e8096fdee65-98.jpg", "descriptions": "An action/infiltration game in which the story changes every time you play. In the 1970s, extremist religious sect the Collective Justice Mission moves to South America to isolate themselves. You infiltrate the compound to check on a relative but soon learn that things may not be what they seem."}, {"name": "Graveyard Keeper", "details_link": "https://www.metacritic.com/game/switch/graveyard-keeper", "publisher": "tinyBuild", "release_date": "Jun 27 2019", "developers": ["Lazy Bear Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "Virtual", "Open-World", "Career"], "meta_score": 65, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/da051cb64e915dda96ff515bb372b4e1-98.jpg", "descriptions": "Face ethical dilemmas. Do you really want to spend money on that proper hotdog meat for the festival when you have so many resources lying around? \r\rGather valuable resources & craft new items. Expand your Graveyard into a thriving business, go ahead and gather valuable resourcesFace ethical dilemmas. Do you really want to spend money on that proper hotdog meat for the festival when you have so many resources lying around? \r\rGather valuable resources & craft new items. Expand your Graveyard into a thriving business, go ahead and gather valuable resources scattered in the surrounding areas, and explore what this land has to offer. \r\rMake business alliances. These dead bodies don't need all that blood, do they? Why not sell it to someone who can put it to good use. Same for body parts. Hey, it's being efficient with recycling! \r\rExplore mysterious dungeons. No medieval game would be complete without these. Take a trip into the unknown and find useful new ingredients which may or may not poison a whole bunch of nearby villagers. Capitalism.\r… Expand"}, {"name": "Sniper Elite V2 Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/sniper-elite-v2-remastered", "publisher": "Rebellion", "release_date": "May 14 2019", "developers": ["Rebellion"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 65, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/5532246319ebd8e6cdfcce6bbcac5417-98.jpg", "descriptions": "You are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.You are elite sniper Karl Fairburne, parachuted into Berlin amidst the Germans' final stand. Your mission is to prevent Nazi V2 rocket technology falling into the hands of the Red Army. You must aid key scientists keen to defect to the US, and terminate those who stand in your way.\r Stealth is key as you find yourself trapped between two desperate armies in a race against time. Master authentic weaponry, stalk your target, fortify your position, set up the shot, and use your skill, patience and cunning to achieve the mission.\r All new graphics and rendering technology gives you improved ball busting X-ray kill camera detail. Witness the terrifying power of your bullet as it enters an enemy's body.\rWith all DLC missions included, take the fate of the war into your own hands, and hunt the Fuhrer himself.… Expand"}, {"name": "One Piece: World Seeker", "details_link": "https://www.metacritic.com/game/xbox-one/one-piece-world-seeker", "publisher": "Bandai Namco Games", "release_date": "Mar 15 2019", "developers": ["Ganbarion"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/17579f255ff04e6a0f5783b9b505accd-98.jpg", "descriptions": "Leave your compass behind and join Luffy as he embarks on a brand new action-packed adventure where you can experience the powers of the legendary Gum-Gum fruit to uncover hidden secrets on an original, never-before-seen island."}, {"name": "The VideoKid", "details_link": "https://www.metacritic.com/game/switch/the-videokid", "publisher": "Chorus Worldwide", "release_date": "Aug 30 2018", "developers": ["Chorus Worldwide"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 65, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/9fe65beb601e1283b54f2927dc4d809f-98.jpg", "descriptions": "Test your skills to the max with this gnarly & challenging arcade style skate game set in a retro 1980s neighborhood filled with bogus dangers..."}, {"name": "I Hate Running Backwards", "details_link": "https://www.metacritic.com/game/xbox-one/i-hate-running-backwards", "publisher": "Devolver Digital", "release_date": "May 22 2018", "developers": ["Binx Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/753d37d342a469d8362efa9db935089f-98.jpg", "descriptions": "I Hate Running Backwards is a never-ending adrenaline packed shoot’em down roguelite that puts the emphasis on destruction and fighting never ending waves of enemies while time traveling through procedurally generated, fully destructible worlds."}, {"name": "Spelunker Party!", "details_link": "https://www.metacritic.com/game/switch/spelunker-party!", "publisher": "Square Enix", "release_date": "Oct 19 2017", "developers": ["Tozai Games"], "platforms": ["PC", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/4f0c89e72a26e6e1a5fea6dbfc4a35d7-98.jpg", "descriptions": "Go on a Journey to the underground with your buddies. Spelunker, the Weakest Action Hero is now on Nintendo Switch. Offline and Online Co-op Multiplay with up to 4 players. Power-up your characters by customizing them with various costumes and items. A variety of adorable pets are also hereGo on a Journey to the underground with your buddies. Spelunker, the Weakest Action Hero is now on Nintendo Switch. Offline and Online Co-op Multiplay with up to 4 players. Power-up your characters by customizing them with various costumes and items. A variety of adorable pets are also here to help you on your adventure. Time Attack, Quests and more! Enjoy Spelunker Party together. [Nintendo]… Expand"}, {"name": "Atomega", "details_link": "https://www.metacritic.com/game/pc/atomega", "publisher": "Ubisoft", "release_date": "Sep 19 2017", "developers": ["Ubisoft Reflections"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Action", "General", "Shooter", "First-Person", "Tactical"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/cdb5153b2df227d94a7006721b531cc0-98.jpg", "descriptions": "Grow, fight, collect and evade in the last cosmic arena the very end of time. Acquire MASS to evolve your EXOFORM from the nimble ATOM to the godlike OMEGA and compete for fun and dominance in a fast-paced, multiplayer shooter. ATOMEGA™ !"}, {"name": "Baja: Edge of Control HD", "details_link": "https://www.metacritic.com/game/playstation-4/baja-edge-of-control-hd", "publisher": "THQ Nordic", "release_date": "Sep 14 2017", "developers": ["THQ Nordic"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/92d2a24718ef8feb4100acd00acc86e4-98.jpg", "descriptions": "From the core founding members of the MX vs. ATV franchise comes the next off-road racing experience: BAJA. Conquer the toughest terrain Mother Nature has to offer and build the ultimate off-road vehicle. Combining the best elements of the real-world sport with the right balance of arcadeFrom the core founding members of the MX vs. ATV franchise comes the next off-road racing experience: BAJA. Conquer the toughest terrain Mother Nature has to offer and build the ultimate off-road vehicle. Combining the best elements of the real-world sport with the right balance of arcade fun, BAJA transports players to the epic open worlds and unforgiving terrain found at the pinnacle of off-road racing. Stunning visuals, vertical environments, and unpredictable terrain are crossed in over 100 square miles of drive-to-horizon landscape. Master hill-climb, circuit, and rally races to earn career sponsorships on the path to off-road supremacy. Harness the horsepower of elite Trophy Trucks, 4x4's and Buggies to finally compete in the definitive off-road endurance challenge, the Baja. Supercharged Vehicles: Harness the horsepower of over 40 elite Trophy Trucks, 4x4's and Buggies across eight varied vehicle classes. Horizontal Racing: Suspension, torque and horsepo wer are perfectly balanced to create the ultimate edge-of-control racing experience. Fine-tune the roar of your off-road machine with over 200 authentic vehicle parts. Power past the competition in 4-player split screen and 8-player online racing.… Expand"}, {"name": "Nevermind", "details_link": "https://www.metacritic.com/game/xbox-one/nevermind", "publisher": "Flying Mollusk", "release_date": "Jan 11 2017", "developers": ["Flying Mollusk"], "platforms": ["PC", "Xbox One"], "genres": ["Action Adventure", "Adventure", "3D", "Linear", "First-Person"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/9e3bb4795bc8f74d931bf56c5c4c1c28-98.jpg", "descriptions": "Nevermind ushers you into dark and surreal worlds within the minds of trauma victims. When played with an (optional) biofeedback sensor, Nevermind senses your fear - lashing out if you allow your feelings of anxiety to get the better of you. Can you brave the terrors within Nevermind...and yourself?"}, {"name": "Reus", "details_link": "https://www.metacritic.com/game/xbox-one/reus", "publisher": "Soedesco", "release_date": "Oct 11 2016", "developers": ["BlitWorks", "Soedesco"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/e937a1ee754401d40b62d929848869bd-98.jpg", "descriptions": "In Reus, you control powerful giants that help you shape the planet to your will. You can create mountains and oceans, forests and more. Enrich your planet with plants, minerals and animal life. There is only one thing on the planet that you do not control: mankind, with all their virtuesIn Reus, you control powerful giants that help you shape the planet to your will. You can create mountains and oceans, forests and more. Enrich your planet with plants, minerals and animal life. There is only one thing on the planet that you do not control: mankind, with all their virtues and and all their vices. You can shape their world, but not their will. Provide for them and they may thrive. Give them too much, and their greed may gain the upper hand.… Expand"}, {"name": "Rememoried", "details_link": "https://www.metacritic.com/game/pc/rememoried", "publisher": "Hangonit", "release_date": "Aug 31 2015", "developers": ["Vladimir Kudelka"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/7f7960624e9e2f4e56ab7f0a6e19333a-98.jpg", "descriptions": "Rememoried is an independent video game, a virtual place where memories change to dreams and the only possible way is forgetting, which becomes a mechanism for proceeding to the next layer of dreams. The Surrealist explorative first-person adventure game."}, {"name": "Futuridium EP Deluxe", "details_link": "https://www.metacritic.com/game/playstation-vita/futuridium-ep-deluxe", "publisher": "MixedBag", "release_date": "Sep 30 2014", "developers": ["MixedBag"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 4", "Wii U", "PlayStation Vita"], "genres": ["Action", "Shooter", "Rail"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/ee933fb47a3d9ed7c9abeb932ed0b72c-98.jpg", "descriptions": "An old school shoot'em up with a modern twist. Futuridium EP offers fast paced, non stop, hard as hell action, with an original 45 minutes soundtrack and colourful, glitchy graphic.\r Free, on Pc Windows, Mac and (soon) Linux."}, {"name": "Blood of the Werewolf", "details_link": "https://www.metacritic.com/game/pc/blood-of-the-werewolf", "publisher": "Midnight City", "release_date": "Oct 28 2013", "developers": ["Scientifically Proven"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/69595ced0ae0e7e3e44008e2c920e98f-98.jpg", "descriptions": "Become Selena, loving mother, devoted wife and -- powerful werewolf. Take revenge on the monsters that have slain your husband and stolen your child, in this love letter to classic platformers. Seamlessly transform from human to werewolf in light of the moon, as you shoot, slash and smashBecome Selena, loving mother, devoted wife and -- powerful werewolf. Take revenge on the monsters that have slain your husband and stolen your child, in this love letter to classic platformers. Seamlessly transform from human to werewolf in light of the moon, as you shoot, slash and smash your way through over 30 enemies and face off against five brutal boss arenas.… Expand"}, {"name": "Gotham City Impostors", "details_link": "https://www.metacritic.com/game/pc/gotham-city-impostors", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  7 2012", "developers": ["Monolith Productions"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Adventure", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Fantasy", "Arcade"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/dec3f6ff71333bd8bf795bf43bd93518-98.jpg", "descriptions": "Gotham City Impostors is a multiplayer game unlike any other, giving players the opportunity to rebel against conformity as they customize their own characters.  Posing as amateur vigilantes or villains, gamers will create their very own Bats and Jokerz characters using unprecedentedGotham City Impostors is a multiplayer game unlike any other, giving players the opportunity to rebel against conformity as they customize their own characters.  Posing as amateur vigilantes or villains, gamers will create their very own Bats and Jokerz characters using unprecedented customization options including insane costumes, homebrewed gadgets and a wide range of traditional and imagined weapons.… Expand"}, {"name": "Viking: Battle for Asgard", "details_link": "https://www.metacritic.com/game/playstation-3/viking-battle-for-asgard", "publisher": "Sega", "release_date": "Mar 25 2008", "developers": ["Creative Assembly"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Fantasy"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/e1afa73d855ea22f64741a0a57d8e706-98.jpg", "descriptions": "Viking: Battle For Asgard takes players to the world of Norse Gods, where the Goddess Hel in all her fury, has raised an army of demonic warriors sent to enslave the mortal realm of Midgard and ultimately provoke Ragnarok - the apocalyptic battle that will destroy even the Gods themselves.Viking: Battle For Asgard takes players to the world of Norse Gods, where the Goddess Hel in all her fury, has raised an army of demonic warriors sent to enslave the mortal realm of Midgard and ultimately provoke Ragnarok - the apocalyptic battle that will destroy even the Gods themselves. Play as Skarin, a powerful yet flawed Viking warrior, filled with rage and ready to wage war on whoever stands in his way. Manipulated by the gods and fated to a destiny he has yet to understand, Skarin is the only one able to stop this ultimate clash of great wills. As Skarin, players leave behind them a bloody trail of dismembered foes using a huge array of ruthless and brutal combat moves while mastering the addictive and destructive mystical powers and abilities given to him by the Viking Gods he looks to come between. Explore vast and visually stunning open-world environments where gamers strive to free enslaved warriors and lead them into huge, epic battles featuring colossal giants, powerful shaman, deadly assassins and the Gods' own champions. Tame mighty dragons and unleash their rain of fire, laying waste to the enemy hordes that stand in your way and use Skarin's emerging skills to strategically turn the tide of conflict. Taking full advantage of the technology only next-gen consoles offer, Viking: Battle for Asgard excels at flowing seamlessly from small-scale battles to massive wars featuring multitudes of bloodthirsty warriors waiting to unleash their fury. [Sega]… Expand"}, {"name": "Dragon Ball Z: Shin Budokai - Another Road", "details_link": "https://www.metacritic.com/game/psp/dragon-ball-z-shin-budokai---another-road", "publisher": "Atari", "release_date": "Mar 20 2007", "developers": ["Dimps Corporation"], "platforms": "PSP", "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 65, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/fdc7f9ab611f8675c8c689e48ab4d02c-98.jpg", "descriptions": "Dragon Ball Z Shin Budokai: Another Road takes the intense wireless multiplayer battles and combative gameplay made popular in 2006's game and adds an improved fighting system with over 50 new fighting skills and ultimate attacks and will send players into a completely new story arcDragon Ball Z Shin Budokai: Another Road takes the intense wireless multiplayer battles and combative gameplay made popular in 2006's game and adds an improved fighting system with over 50 new fighting skills and ultimate attacks and will send players into a completely new story arc following the future world of Trunks on his adventures against rival Majin Buu. [Atari]… Expand"}, {"name": "Disney/Pixar Cars", "details_link": "https://www.metacritic.com/game/wii/disneypixar-cars", "publisher": "THQ", "release_date": "Nov 16 2006", "developers": ["Rainbow Studios"], "platforms": ["PC", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/4769286077fdd7073e399d1883f575cb-98.jpg", "descriptions": "Race to the finish line as you live all the fun and excitement of the next Walt Disney Pictures presentation of a Pixar Animation Studios film, Cars. Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. Story-based adventure thatRace to the finish line as you live all the fun and excitement of the next Walt Disney Pictures presentation of a Pixar Animation Studios film, Cars. Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. Story-based adventure that relives key moments of the movie. Burn rubber in over 30 races and mini-games. Explore the open-world of Radiator Springs. Speed to the finish line with over 10 playable characters. Make your friends eat your dust in multiplayer mode. Features all of the major voice talent from the movie. Cars for Wii emulates driver seat functionality using real-to-life driving techniques and maneuvers.  [THQ]… Expand"}, {"name": "Heroes of Annihilated Empires", "details_link": "https://www.metacritic.com/game/pc/heroes-of-annihilated-empires", "publisher": "cdv Software", "release_date": "Nov 16 2006", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 65, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/b1430006ac7a36f4708e120dc627178c-98.jpg", "descriptions": "Creating the Heroes of Annihilated Empires, far from making a game, we build a bridge to the world of imagination living deep inside in each of us. A world that has become an arena for six great races that are ready to engage in the conflict, never seen by these lands before. While leadingCreating the Heroes of Annihilated Empires, far from making a game, we build a bridge to the world of imagination living deep inside in each of us. A world that has become an arena for six great races that are ready to engage in the conflict, never seen by these lands before. While leading heroes and mighty armies to victory, bringing your people to peace and prosperity you will encounter hundreds of obstacles on your way. Mixing role-playing game with real-time strategy, we deliver you a new experience and unique gameplay, where you can feel yourself the Hero of a legendary epic tale. This time it's not about units, it's about armies with thousands of soldiers that entrust their fate in your hands. It's about responsibility taken by great leaders and future of entire races. Survival or extinction? It's all up to you to decide. [GSC Game World]… Expand"}, {"name": "The Sims 2", "details_link": "https://www.metacritic.com/game/psp/the-sims-2", "publisher": "Electronic Arts", "release_date": "Dec  7 2005", "developers": ["Maxis"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/34742b4d9de8ad571b6914e57a25e5e2-98.jpg", "descriptions": "A world created, customized and controlled by you is in your hands now that the Sims 2 is coming to the PSP! Explore Strangetown and uncover the secrets of this classic Sims destination as you work to build out your mansion. Keep your Sanity Meter high by fulfilling your wants and fears soA world created, customized and controlled by you is in your hands now that the Sims 2 is coming to the PSP! Explore Strangetown and uncover the secrets of this classic Sims destination as you work to build out your mansion. Keep your Sanity Meter high by fulfilling your wants and fears so that you don't have a nervous breakdown. Take advantage of the capabilities of the PSP to participate in the evolution of Reality Gaming. [Electronic Arts]… Expand"}, {"name": "Tim Burton's The Nightmare Before Christmas: Oogie's Revenge", "details_link": "https://www.metacritic.com/game/xbox/tim-burtons-the-nightmare-before-christmas-oogies-revenge", "publisher": "Buena Vista Games", "release_date": "Oct 10 2005", "developers": ["Capcom"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/c04c1eb428adeca21ce0df48c0099bee-98.jpg", "descriptions": "Based on the animated movie, Tim Burton's The Nightmare Before Christmas: Oogie's Revenge continues the story of Jack Skellington, Oogie Boogie, and other familiar favorites. In the game, you'll assume the role of Jack Skellington, the Pumpkin King of Halloween Town, who must help reclaimBased on the animated movie, Tim Burton's The Nightmare Before Christmas: Oogie's Revenge continues the story of Jack Skellington, Oogie Boogie, and other familiar favorites. In the game, you'll assume the role of Jack Skellington, the Pumpkin King of Halloween Town, who must help reclaim the town from the mischievous Oogie Boogie and his henchmen. Jack has a variety of attack options, including his trusty \"rubber soul\" attack, and real-time costume changes.… Expand"}, {"name": "Animaniacs: The Great Edgar Hunt", "details_link": "https://www.metacritic.com/game/gamecube/animaniacs-the-great-edgar-hunt", "publisher": "Ignition Entertainment", "release_date": "Sep 18 2005", "developers": ["Warthog"], "platforms": "GameCube", "num_players": "24  Online", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/5e7261d3f3719028abc90ac8c339547d-98.jpg", "descriptions": "Animaniacs: The Great Edgar Hunt is a third-person action adventure, which brings the colourful and hysterical world of the Animaniacs wonderfully to life. Players must guide the Warner brothers and sister Wakko, Yakko and Dot through six levels in a quest to locate the hidden EdgarAnimaniacs: The Great Edgar Hunt is a third-person action adventure, which brings the colourful and hysterical world of the Animaniacs wonderfully to life. Players must guide the Warner brothers and sister Wakko, Yakko and Dot through six levels in a quest to locate the hidden Edgar trophies. Each Animaniac has his or her own special abilities, and each must be used in order to fully explore the luscious landscapes. Puzzle elements are featured in the game along with ever-changing enemies and obstacles. Five incredible 'Pinky & The Brain mini-games vary the pace of the adventure, as they explore the huge Animaniacs world, which is populated with dozens of characters from the cartoon.… Expand"}, {"name": "RPG Maker II", "details_link": "https://www.metacritic.com/game/playstation-2/rpg-maker-ii", "publisher": "Agetec Inc.", "release_date": "Oct 24 2003", "developers": ["Kuusou Kagaku"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 65, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/f0954263414f177fdec4309c9d9da539-98.jpg", "descriptions": "RPG Maker 2 for PlayStation2 gives players a virtual blank screen and every conceivable tool they?ll need to create the RPG of their dreams. By providing fully rendered 3D models for all characters, monsters, backgrounds, and items, RPG Maker 2 lets the players create intricate, detailedRPG Maker 2 for PlayStation2 gives players a virtual blank screen and every conceivable tool they?ll need to create the RPG of their dreams. By providing fully rendered 3D models for all characters, monsters, backgrounds, and items, RPG Maker 2 lets the players create intricate, detailed worlds of their own. No other game in the history of video games has ever provided this much incentive for gamers to use every ounce of their creativity!… Expand"}, {"name": "Dragon's Lair 3D", "details_link": "https://www.metacritic.com/game/gamecube/dragons-lair-3d", "publisher": "Encore Software, Inc.", "release_date": "Dec 22 2002", "developers": ["Dragonstone"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/8219a3d923d215cb6cc3586c460ec835-98.jpg", "descriptions": "Princess Daphne has been kidnapped by the evil dragon, Singe, and hidden in a medieval castle owned my Mordroc, a powerful and malevolent wizard. To save her, you will take on the role of Dirk the Daring, a goofy but courageous knight. As he advances through the castle with the help of aPrincess Daphne has been kidnapped by the evil dragon, Singe, and hidden in a medieval castle owned my Mordroc, a powerful and malevolent wizard. To save her, you will take on the role of Dirk the Daring, a goofy but courageous knight. As he advances through the castle with the help of a magical amulet, Dirk must overcome a slew of challenges, from jumping over flaming pits and climbing ropes to flying across chasms and battling swarms of the wizard's minions. Use quick reflexes, cunning, and resourcefulness to fight your way through the castle to find Daphne and save the kingdom from Mordroc's clutches.… Expand"}, {"name": "Tiger Woods PGA Tour 2001", "details_link": "https://www.metacritic.com/game/pc/tiger-woods-pga-tour-2001", "publisher": "EA Sports", "release_date": "Nov  6 2000", "developers": ["Headgate"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/26f77426f12c66f582bb0a1d241ae0a4-98.jpg", "descriptions": "Tiger Woods PGA Tour 2001 delivers three new courses, enhanced online play, and a brand new game type. The Presidents Cup lets you join either the U.S. or International team in this exciting match play tournament.  [EA Sports]"}, {"name": "Chaos Legion", "details_link": "https://www.metacritic.com/game/playstation-2/chaos-legion", "publisher": "Capcom", "release_date": "Aug  6 2003", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 65, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/f949bffd21c52d1464638cbb1f96c106-98.jpg", "descriptions": "Savage by Nature. Two allies torn apart by tragedy...yet bound by fate. The three sacred glyphs...the mythic and forbidden symbols of an ancient world torn apart. Only these mystic relics have the power to open the Gateway of Chaos and lead the people to the Red Moon. Legend says that whenSavage by Nature. Two allies torn apart by tragedy...yet bound by fate. The three sacred glyphs...the mythic and forbidden symbols of an ancient world torn apart. Only these mystic relics have the power to open the Gateway of Chaos and lead the people to the Red Moon. Legend says that when the three glyphs meet, the three worlds will once again be reunited. Two men, once friends, now have their fates tied together by the tragic death of a young maiden. One, a brave young knight and summoner of the Chaos Legion. The other, a noble lord who has fallen to the dark side. Both hold thekey to the sacred glyphs in their power. The legions shall be summoned in this dark gothic opera!  [Capcom]… Expand"}, {"name": "Baja: Edge of Control", "details_link": "https://www.metacritic.com/game/xbox-360/baja-edge-of-control", "publisher": "THQ", "release_date": "Sep 22 2008", "developers": ["2XL Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/2c5586aee61bbad516502d0c82548c70-98.jpg", "descriptions": "From the core founding members of the MX vs. ATV franchise comes the next off-road racing experience: BAJA. Conquer the toughest terrain Mother Nature has to offer and build the ultimate off-road vehicle. Combining the best elements of the real-world sport with the right balance of arcadeFrom the core founding members of the MX vs. ATV franchise comes the next off-road racing experience: BAJA. Conquer the toughest terrain Mother Nature has to offer and build the ultimate off-road vehicle. Combining the best elements of the real-world sport with the right balance of arcade fun, BAJA transports players to the epic open worlds and unforgiving terrain found at the pinnacle of off-road racing. Stunning visuals, vertical environments, and unpredictable terrain are crossed in over 100 square miles of drive-to-horizon landscape. Master hill-climb, circuit, and rally races to earn career sponsorships on the path to off-road supremacy. Harness the horsepower of elite Trophy Trucks, 4x4’s and Buggies to finally compete in the definitive off-road endurance challenge, the Baja. Supercharged Vehicles: Harness the horsepower of over 40 elite Trophy Trucks, 4x4’s and Buggies across eight varied vehicle classes. Horizontal Racing: Suspension, torque and horsepo wer are perfectly balanced to create the ultimate edge-of-control racing experience. Fine-tune the roar of your off-road machine with over 200 authentic vehicle parts. Power past the competition in 4-player split screen and 8-player online racing. [THQ]… Expand"}, {"name": "Brave: The Search for Spirit Dancer", "details_link": "https://www.metacritic.com/game/playstation-2/brave-the-search-for-spirit-dancer", "publisher": "SouthPeak Games", "release_date": "Apr  9 2007", "developers": ["VIS Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/2d7791baf80fc8eb12b9388629acdda8-98.jpg", "descriptions": "Brave is the sole escapee of an attack by the vicious Wendigo spirit. His tribe enslaved, their only hope is that Brave can find Spirit Dancer, the greatest shaman to ever live. Only Spirit Dancer has the power to defeat the Wendigo and release them. So starts Brave's epic journey... BraveBrave is the sole escapee of an attack by the vicious Wendigo spirit. His tribe enslaved, their only hope is that Brave can find Spirit Dancer, the greatest shaman to ever live. Only Spirit Dancer has the power to defeat the Wendigo and release them. So starts Brave's epic journey... Brave takes you on a journey through beautifully rich and interactive scenery. Hunt wolves in the depths of the forest, face stampedes of buffalo and canoe down crashing rapids in the search for Sprit Dancer. Master a range of talents from combat with a tomahawk and bow, to animal tracking and mimicry. Your hunting skills are surpassed only by initiation into the ways of the shaman. Overcome bizarre creatures and terrifying foes, learning to work alongside and possess animal spirits as you progress. Take on the shape of the smallest rabbit to escape down burrows or the form of a mighty bear spirit to battle your foes. [SCEE]… Expand"}, {"name": "Rango", "details_link": "https://www.metacritic.com/game/playstation-3/rango", "publisher": "Paramount Digital Entertainment", "release_date": "Mar  1 2011", "developers": ["Behaviour Interactive"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/939ec560eb302d6c73c582eecb6da8b0-98.jpg", "descriptions": "Rango The Video Game invites players to continue on Rango's journey through new adventures inspired by the movie."}, {"name": "F1 2015", "details_link": "https://www.metacritic.com/game/playstation-4/f1-2015", "publisher": "Codemasters", "release_date": "Jul 21 2015", "developers": ["Codemasters"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/9d1232a48e98c3aed6b8ec1db9c0e28f-98.jpg", "descriptions": "Honda returns and once more forges an alliance with McLaren, which also welcomes back Fernando Alonso. Sebastien Vettel moves to Ferrari and, alongside a new generation of exciting young drivers on the grid, will attempt to halt the winning start Mercedes have made in the new era of FORMULAHonda returns and once more forges an alliance with McLaren, which also welcomes back Fernando Alonso. Sebastien Vettel moves to Ferrari and, alongside a new generation of exciting young drivers on the grid, will attempt to halt the winning start Mercedes have made in the new era of FORMULA 1. The race calendar for 2015 also features a new circuit, with a return to Mexico for the first time in over 20 years.… Expand"}, {"name": "Fallout 3 - Operation: Anchorage", "details_link": "https://www.metacritic.com/game/pc/fallout-3---operation-anchorage", "publisher": "Bethesda Softworks", "release_date": "Jan 27 2009", "developers": ["Bethesda Game Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 65, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/0c7f6218e1183147e574822f0dbe47dc-98.jpg", "descriptions": "Enter the simulation pod and embark on one of the greatest military campaigns of the Fallout universe – the liberation of Anchorage, Alaska from its Chinese Communist invaders. Experience harrowing winter combat using Fallout 3’s patented V.A.T.S. targeting system, and employ powerful newEnter the simulation pod and embark on one of the greatest military campaigns of the Fallout universe – the liberation of Anchorage, Alaska from its Chinese Communist invaders. Experience harrowing winter combat using Fallout 3’s patented V.A.T.S. targeting system, and employ powerful new equipment like the Gauss Rifle, Chinese Stealth Armor, Winterized T-51b Power Armor, and more. Enlist today, soldier! [Microsoft]… Expand"}, {"name": "Nickelodeon All-Star Brawl", "details_link": "https://www.metacritic.com/game/playstation-5/nickelodeon-all-star-brawl", "publisher": "GameMill Entertainment", "release_date": "Oct  5 2021", "developers": ["Ludosity Interactive", "Fair Play Labs"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party / Minigame", "Action", "Fighting", "2D"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/71b409f9be16586d04d8aa5e126cf3c0-98.jpg", "descriptions": "THE ALL-STAR BRAWL BEGINS!\r Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles,THE ALL-STAR BRAWL BEGINS!\r Nickelodeon All-Star Brawl brings together all your Nickelodeon favorites for one bombastic battle. Face off with a power-packed cast of heroes from the top shows within the Nickelodeon universe, including SpongeBob SquarePants, Teenage Mutant Ninja Turtles, Invader Zim, and many more, to determine the ultimate champion. With unique moves and attacks drawn directly from their identifiable personalities, each brawler has its own style of play for endless action.… Expand"}, {"name": "The Testament of Sherlock Holmes", "details_link": "https://www.metacritic.com/game/playstation-3/the-testament-of-sherlock-holmes", "publisher": "Atlus", "release_date": "Sep 25 2012", "developers": ["Frogwares", "Spiders"], "platforms": ["PC", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "3D", "Third-Person"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/9e416327a29382594a55f37338e95a46-98.jpg", "descriptions": "The famous detective Sherlock Holmes is back on the PC, PS3, and Xbox 360 for a great adventure and probably the most dangerous investigation of his entire career."}, {"name": "Jet Kave Adventure", "details_link": "https://www.metacritic.com/game/switch/jet-kave-adventure", "publisher": "7Levels", "release_date": "Sep 17 2019", "developers": ["7Levels"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/daabaae87784e2c8985f7a70c53da13c-98.jpg", "descriptions": "Jet Kave Adventure brings everything you love about 2.5D platformers. Enjoy the skill-based action, challenging boss fights, clever secrets and thrilling set-pieces in a game where the Stone Age and science fiction collide.\r Meet Kave, the jet-powered caveman. A has-been chief banished byJet Kave Adventure brings everything you love about 2.5D platformers. Enjoy the skill-based action, challenging boss fights, clever secrets and thrilling set-pieces in a game where the Stone Age and science fiction collide.\r Meet Kave, the jet-powered caveman. A has-been chief banished by his own tribe, he stumbles upon… a jetpack! The device turns him into the only prehistoric man who stands a chance against “the alien invader” – a rather unlikable guy from the sky who’ll readily kick off a disastrous volcanic eruption just so he can repair his spaceship. So begins Kave’s quest to save the whole island and prove his worth to the tribe.… Expand"}, {"name": "Kane & Lynch: Dead Men", "details_link": "https://www.metacritic.com/game/xbox-360/kane-lynch-dead-men", "publisher": "Eidos Interactive", "release_date": "Nov 13 2007", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 65, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/8/ac080e5847c6b76cd059800cd618009d-98.jpg", "descriptions": "Kane & Lynch: Dead Men is a dark and gritty drama featuring two men, one is a flawed mercenary and the other a medicated psychopath. Forced together on a violent and chaotic path of redemption and revenge, no action is considered too harsh as this volatile partnership is pushed beyond reasonKane & Lynch: Dead Men is a dark and gritty drama featuring two men, one is a flawed mercenary and the other a medicated psychopath. Forced together on a violent and chaotic path of redemption and revenge, no action is considered too harsh as this volatile partnership is pushed beyond reason in this brutally realistic, character-driven third person action shooter. [Eidos Interactive]… Expand"}, {"name": "Need for Speed", "details_link": "https://www.metacritic.com/game/xbox-one/need-for-speed", "publisher": "Electronic Arts", "release_date": "Nov  3 2015", "developers": ["Ghost Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/ef43e650d4eca034f06333a3db4bc17e-98.jpg", "descriptions": "Jump behind the wheel of some iconic cars and put the pedal to the metal through Ventura Bay, a sprawling urban playground. Explore overlapping stories as you establish your reputation – and your dream car – and become the top racing icon. Play repeatedly this time, you have five distinctJump behind the wheel of some iconic cars and put the pedal to the metal through Ventura Bay, a sprawling urban playground. Explore overlapping stories as you establish your reputation – and your dream car – and become the top racing icon. Play repeatedly this time, you have five distinct ways to win.… Expand"}, {"name": "Opoona", "details_link": "https://www.metacritic.com/game/wii/opoona", "publisher": "Koei", "release_date": "Mar 25 2008", "developers": ["ArtePiazza"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 65, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/6304d2278a2704b81193982ff8a52f7f-98.jpg", "descriptions": "While on an interplanetary family vacation, the young boy Opoona crash lands on Planet Landroll after his spaceship is involved in a mysterious accident. Separated from his family, Opoona is forced to live alone. On the planet, Opoona must find a job, search for his siblings, and defendWhile on an interplanetary family vacation, the young boy Opoona crash lands on Planet Landroll after his spaceship is involved in a mysterious accident. Separated from his family, Opoona is forced to live alone. On the planet, Opoona must find a job, search for his siblings, and defend himself and the people of Landroll against creatures known as the Dark Rogues. Luckily for Opoona, he is the descendant of a long line of warriors known as the Cosmo Guards. Thus, Opoona’s adventure begins as he struggles to establish a new life and reunite his family. The game’s action-oriented battle system lets players use powerful \"Energy Bonbons\" against their enemies. Using just the Nunchuk, players can manipulate an Energy Bonbon’s trajectory in a number of different ways. All of Opoona's commands are also controlled by the Nunchuk, to allow a complete \"single-hand control\" of the game. Opoona is not just about battling; it is a “Lifestyle RPG.” As Opoona, players must adapt to a new environment, meet new people, and contribute to society through work, all while becoming aware of the precious world and people around him. As the game progresses, Opoona will develop relationships and uncover a broader range of activities including new jobs and clues to new adventures. [KOEI]… Expand"}, {"name": "Neptunia x Senran Kagura: Ninja Wars", "details_link": "https://www.metacritic.com/game/switch/neptunia-x-senran-kagura-ninja-wars", "publisher": "Idea Factory", "release_date": "Apr 19 2022", "developers": ["Tamsoft"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/4364bd94a5e5883431758e1a359423af-98.jpg", "descriptions": "Gamninjustri a place where all manner of ninjas gather.As the struggle for control increased between the Daimyos of the nations, tensions rose between the two great nations, each of which was home to one of the major schools of martial arts.\n\nThe Compa Style which has mastered the NinjaGamninjustri a place where all manner of ninjas gather.As the struggle for control increased between the Daimyos of the nations, tensions rose between the two great nations, each of which was home to one of the major schools of martial arts.The Compa Style which has mastered the Ninja Arts based on the Command Technique.The Honeypa Style which has mastered the Ninja Arts rooted in the Action Technique.The two camps were stuck in a ruthless competition of skill in order to achieve hegemony, but as they fought on, a mysterious army of mechanical ninjas made their assault.The mechanical ninja army overran the smaller nations in an instant, and the Steeme Legion leader, Yoh Gamer, made an announcement to the world:The Super NINJA War to decide the world's strongest school is about to begin!Key Features:When 2 Become 1 The two warring nations from the Neptunia and SENRAN KAGURA series have now joined forces in one action-packed RPG! Choose from 10 possible characters, including two new characters: Yuuki and Goh, and pick two characters to set forth on your adventure. Swiftly switch between your two chosen characters in battle!The Art of the Ninja Each character possess a unique set of skills, known as Ninja Art Skills. Chain your Ninja Art Skills to leave your enemies in the dust. Ninjas and shinobi are also equipped with projectiles that can inflict physical damage or temporary status ailments to slow down foes.Stay Stylin' with Spirit Gems Collect Spirit Gems for helpful stat boosts! Legend says arranging them in certain combinations can add even bigger boosts...Are You a True Ninja Warrior? The Peaches & Cream Meditation mini-game allows players to test their balance with the PS4 motion controller. Successfully filling the Peach Gauge gives extra stat boosts in battle! Plus, test your might with the post-game content, Yomi-Training! Expert ninjas and shinobi can play through 8 different trials, each set with difficult restrictions!… Expand"}, {"name": "Top Spin 3", "details_link": "https://www.metacritic.com/game/ds/top-spin-3", "publisher": "2K Sports", "release_date": "Jun 23 2008", "developers": ["Pam Development", "2K Sports"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/8df49bcc19ac9f4836fb96ebad3787de-98.jpg", "descriptions": "Top Spin 3 immerses players in a visually and physically realistic tennis experience. Using next generation technology, gameplay and graphics, Top Spin 3 is a tennis experience with dynamic weather changes, evolutionary player visuals and comprehensive online offerings. In Top Spin 3,Top Spin 3 immerses players in a visually and physically realistic tennis experience. Using next generation technology, gameplay and graphics, Top Spin 3 is a tennis experience with dynamic weather changes, evolutionary player visuals and comprehensive online offerings. In Top Spin 3, players compete online and offline to rise in the ranks against current top ranked professional players. [2K Sports]… Expand"}, {"name": "Blacksad: Under the Skin", "details_link": "https://www.metacritic.com/game/pc/blacksad-under-the-skin", "publisher": "Microids", "release_date": "Nov  5 2019", "developers": ["Pendulo Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/97a1b01f3a6f45a489b65fb3989735e4-98.jpg", "descriptions": "A dark corruption scandal in the heart of the New York City's underworld for charismatic detective John Blacksad!The 50s, New York City: Joe Dunn, owner of a boxing club, is found dead. Meanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career,A dark corruption scandal in the heart of the New York City's underworld for charismatic detective John Blacksad!The 50s, New York City: Joe Dunn, owner of a boxing club, is found dead. Meanwhile, rising star Bobby Yale, due to take to the ring for the most important fight of his career, has mysteriously disappeared. Sonia Dunn, Joe's daughter, takes over the gym and must deal with its financial woes. She hires private detective John Blacksad to investigate Yale's disappearance. This sinister case will take our investigator to the darkest, most dismal depths of New York.With its anthropomorphic characters and its incredible 1950s feel, BLACKSAD: Under the Skin promises all the eerily dark adventure of a detective novel, just like the eponymous comic book series.Conduct the investigation in your own way. Make use of your feline senses as you hunt for new clues. Make decisions on behalf of Blacksad and influence the outcome of the case.… Expand"}, {"name": "The Crow's Eye", "details_link": "https://www.metacritic.com/game/pc/the-crows-eye", "publisher": "3D2 Entertainment", "release_date": "Mar 20 2017", "developers": ["3D2 Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/e52d3ff744263c7fe387299173aca88c-98.jpg", "descriptions": "The Crow’s Eye is a story-driven first person horror adventure. Learn to survive while you investigate the disturbing fate of the missing students in Crowswood university. Craft items, defend yourself from unknown threats, and forget all you thought you knew about survival horrors. They sayThe Crow’s Eye is a story-driven first person horror adventure. Learn to survive while you investigate the disturbing fate of the missing students in Crowswood university. Craft items, defend yourself from unknown threats, and forget all you thought you knew about survival horrors. They say you can’t hide, but you better do… or be the next.… Expand"}, {"name": "Divekick", "details_link": "https://www.metacritic.com/game/playstation-3/divekick", "publisher": "Iron Galaxy Studios", "release_date": "Aug 20 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/4d9181844f042c18a88df69eac6da8f3-98.jpg", "descriptions": "Divekick revolves around two characters, Dive and Kick, where the action is controlled by two buttons, dive and kick."}, {"name": "Saints Row", "details_link": "https://www.metacritic.com/game/pc/saints-row", "publisher": "Deep Silver", "release_date": "Aug 23 2022", "developers": ["Volition Inc."], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 65, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/2/66a44af8ba520c02a7b3fa6bafc76dab-98.jpg", "descriptions": "Welcome to Santo Ileso, a vibrant fictional city in the heart of the American Southwest. In a world rife with crime, where lawless factions fight for power, a group of young friends embark on their own criminal venture, as they rise to the top in their bid to become Self Made.\r As theWelcome to Santo Ileso, a vibrant fictional city in the heart of the American Southwest. In a world rife with crime, where lawless factions fight for power, a group of young friends embark on their own criminal venture, as they rise to the top in their bid to become Self Made.\r As the future Boss, with Neenah, Kevin, and Eli by your side, you'll form The Saints and take on Los Panteros, The Idols, and Marshall as you build your empire across the streets of Santo Ileso and battle for control of the city. Ultimately Saints Row is the story of a start-up company, it's just that the business The Saints are in happens to be crime.\r Experience the biggest and best Saints Row playground ever created; the unique sprawling world of Santo Ileso is the backdrop for a wild, larger than life sandbox of thrilling side hustles, criminal ventures and blockbuster missions, as you shoot, drive, and wingsuit your way to the top.\r Express yourself and unleash your inner Saint, with the most advanced suite of customization tools yet seen in an open-world game make your character, your car and your crew your own.\r Dive into epic gunfights and highspeed chases, and witness outrageous only-in-Saints-Row moments in an original story that charts the Saints' remarkable rise to power. Enjoy the freedom of playing the entire campaign with a friend through seamless untethered co-op play, where you can both push the limits of your gang and create your own gameplay moments together.… Expand"}, {"name": "Monopoly Streets", "details_link": "https://www.metacritic.com/game/wii/monopoly-streets", "publisher": "Electronic Arts", "release_date": "Oct 26 2010", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 65, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/cf3d664ac72fd2605b294cc459544f3b-98.jpg", "descriptions": "To celebrate its 75th anniversary, the world of Monopoly comes to life through a living, breathing city that you can build, own, and monopolize. MONOPOLY STREETS has everything you love about the board game, presented as a street level tour of Mr. Monopoly's fully animated world."}, {"name": "TV Show King", "details_link": "https://www.metacritic.com/game/wii/tv-show-king", "publisher": "Gameloft", "release_date": "May 12 2008", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "PlayStation 3", "Wii"], "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 65, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/789693f463940bf98ef13f8b2f524bad-98.jpg", "descriptions": "[WiiWare]  Confront friends and family in a TV quiz game show. Let your Mii try to answer fun and challenging trivia questions, from the classics to original stumpers, spanning across history, geography, literature, science, sports and entertainment! For an extra challenge, use your Wiimote[WiiWare]  Confront friends and family in a TV quiz game show. Let your Mii try to answer fun and challenging trivia questions, from the classics to original stumpers, spanning across history, geography, literature, science, sports and entertainment! For an extra challenge, use your Wiimote in original ways. Make it to the finals and see who can win the greatest amount of cash in one last, ultimate duel. TV Show King will challenge your brain! Now, get ready, get set, and go play TV Show King! [Nintendo]… Expand"}, {"name": "UEFA Euro 2012", "details_link": "https://www.metacritic.com/game/playstation-3/uefa-euro-2012", "publisher": "EA Sports", "release_date": "Apr 24 2012", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 65, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/7/944093b29d67d5992a8b8da552a12d9c-98.jpg", "descriptions": "This digital-only expansion for FIFA 12 brings all the stadiums, teams and events from UEFA Euro 2012, as well as up-to-date versions of the rest of the UEFA teams."}, {"name": "Midway Arcade Treasures 3", "details_link": "https://www.metacritic.com/game/gamecube/midway-arcade-treasures-3", "publisher": "Midway", "release_date": "Oct 26 2005", "developers": ["Midway"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/c13440250d28a06f87e3634cd192f996-98.jpg", "descriptions": "Relive eight of Midway's classic arcade games in Midway Arcade Treasures 3. The game includes both single-player and multiplayer action. You can post your high scores via Xbox Live to see if you measure up to the best in the world. The games include: Badlands, Hydro Thunder, Off RoadRelive eight of Midway's classic arcade games in Midway Arcade Treasures 3. The game includes both single-player and multiplayer action. You can post your high scores via Xbox Live to see if you measure up to the best in the world. The games include: Badlands, Hydro Thunder, Off Road Thunder: Mud, Sweat, N' Gears, Race Drivin', San Francisco Rush The Rock: Alcatraz Edition, San Francisco Rush 2049, S.T.U.N. Runner, and Super Off Road with the Bonus Tracks Pack.… Expand"}, {"name": "Downward Spiral: Horus Station", "details_link": "https://www.metacritic.com/game/pc/downward-spiral-horus-station", "publisher": "3rd Eye Studios", "release_date": "May 31 2018", "developers": ["3rd Eye Studios"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/ee0c87d1cb9f552c0fde5a895cb2f392-98.jpg", "descriptions": "Downward Spiral: Horus Station is a mysterious and atmospheric zero gravity thriller set in the lost and forgotten Horus Station."}, {"name": "Capcom Puzzle World", "details_link": "https://www.metacritic.com/game/psp/capcom-puzzle-world", "publisher": "Capcom", "release_date": "Feb  6 2007", "developers": ["Capcom"], "platforms": "PSP", "num_players": "2 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/54a7e7eb3e4e1ddb5379b0d6b001a980-98.jpg", "descriptions": "Capcom Puzzle World provides gem busting mayhem at its best with the cult hit, Super Puzzle Fighter II. This time around, in addition to the renowned Super Puzzle Fighter II: X gem breaking mode, two new never-before-released-in-the-US options will be added to increase the level ofCapcom Puzzle World provides gem busting mayhem at its best with the cult hit, Super Puzzle Fighter II. This time around, in addition to the renowned Super Puzzle Fighter II: X gem breaking mode, two new never-before-released-in-the-US options will be added to increase the level of addictiveness. Super Puzzle Fighter II: Y has player’s group similar colors to create groups of three or more. Once the colors are line up, they break and charge up the \"Change Gem\" meter creating furious chains for come-from-behind wins. With the Super Puzzle Fighter II: Z mode, the rules are the same as X, but instead of falling blocks, the play field raises and the first one to the top loses. Block Block is an innovative twist to the block breaking genre. Released for the arcades in 1990, Block Block features a two player co-op mode, allowing for the cooperative destruction of blocks. Also unique to this title was the constantly shrinking paddle that forced player to finish each board as quickly as possible. Originally released for the PlayStation game console, the Buster Bros. Collection is a simple yet extremely addictive three-games-in-one puzzle shooter that consists of Buster Bros, Super Buster Bros and Buster Buddies. An arcade hit, Buster Bros has one or two players navigating through over 50 timed environmental stages shooting all the bubbles on screen while avoiding contact. Super Buster Bros is an updated version of its predecessor with improved graphics and the inclusion of “Panic Mode” which added 99 levels of feverish action. [Capcom]… Expand"}, {"name": "AO Tennis 2", "details_link": "https://www.metacritic.com/game/pc/ao-tennis-2", "publisher": "Bigben Interactive", "release_date": "Jan  9 2020", "developers": ["Big Ant Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Sports", "Individual", "Tennis"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/928629708e2f78c0612008f7d708437b-98.jpg", "descriptions": "AO Tennis 2 is the only tennis experience designed for and by its community. Create your own players, stadiums and legendary matches. Enter the competition to reach the top of world tennis in Career Mode."}, {"name": "The Solus Project", "details_link": "https://www.metacritic.com/game/playstation-4/the-solus-project", "publisher": "Teotl Studios", "release_date": "Sep 18 2017", "developers": ["Grip Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "General", "Survival"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/e9ab826719932e16a2fe0d8c0ecb7c5b-98.jpg", "descriptions": "Humanity is on the verge of extinction. You are the last hope, tasked with finding a safe haven for a colony. But now you are stranded on a deserted alien planet and every other member of your crew is dead. The fate of humanity rests in your hands: you must survive \rThe Solus Project is aHumanity is on the verge of extinction. You are the last hope, tasked with finding a safe haven for a colony. But now you are stranded on a deserted alien planet and every other member of your crew is dead. The fate of humanity rests in your hands: you must survive \rThe Solus Project is a first-person survival adventure game by the award-winning Teotl Studios and Grip Digital. \r- Plants grow and rot, weather changes from scorching heat to chilling storms, the wind and humidity are unforgiving... The Solus Project contains some of the most advanced environmental simulations ever seen in a video game.\r- Craft items, explore vast areas, monitor your health, sleep regularly, and more A true survival experience!\r- Learn the secrets of a mysterious alien civilization that might hold the key to humanity's survival!… Expand"}, {"name": "Orwell's Animal Farm", "details_link": "https://www.metacritic.com/game/pc/orwells-animal-farm", "publisher": "The Dairymen", "release_date": "Dec 10 2020", "developers": ["Nerial"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 65, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/f4af0e708dc3205a6fc563b7ec902475-98.jpg", "descriptions": "Orwell’s Animal Farm is an adventure game where all animals are equal, but some animals are more equal than others. Immerse yourself in George Orwell's story of absolute power and corruption and follow the ups and downs of Animalism."}, {"name": "Flock!", "details_link": "https://www.metacritic.com/game/pc/flock!", "publisher": "Capcom", "release_date": "Apr  7 2009", "developers": ["Proper Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 65, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/9009fdba3c75ef8fb68038ed39bfb0b7-98.jpg", "descriptions": "FLOCK! uses a sophisticated physics engine that drives the challenging puzzle elements of the game. Whether it's using the Tractor beam to move obstacles out of the way, or the Depressor beam to stamp out crop circles to guide your herds, being an extraterrestrial has never been thisFLOCK! uses a sophisticated physics engine that drives the challenging puzzle elements of the game. Whether it's using the Tractor beam to move obstacles out of the way, or the Depressor beam to stamp out crop circles to guide your herds, being an extraterrestrial has never been this addictive. Friends can also join in through co-op play. And when all the levels have been completed, users can make their own with the level editor that comes with the game. Flock comes packed with so much content, the potential fun is out of this world! Over 50 levels of pastoral puzzle challenges. Explore levels to find secret collectables and upgrades. Level Editor allows players to make their own \"plushie\" and puzzle-filled levels and share them with their friends online. Two-player local co-op mode makes the \"flocking\" exponentially fun. Compelling environments complemented by a whimsical art style, beautiful lighting and distinctive textures make this one of the most graphically-advanced downloadable titles to date. Real-world physics engine creates all new types of puzzles: pick up wooden planks to form bridges, move items to create obstructions, crush wheat into pathways. [Capcom]… Expand"}, {"name": "Thunder Tier One", "details_link": "https://www.metacritic.com/game/pc/thunder-tier-one", "publisher": "fragOut Studio", "release_date": "Dec  7 2021", "developers": ["fragOut Studio", "KRAFTON Inc."], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Command", "Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/1729b8e9888db7fbaa0ef2bc918c50d7-98.jpg", "descriptions": "Thunder Tier One is a realistic top-down shooter where you join an elite special operations team tasked with stopping a dangerous terrorist organization wreaking havoc across the fictional Eastern European country of Salobia."}, {"name": "Rock of Ages 3: Make & Break", "details_link": "https://www.metacritic.com/game/playstation-4/rock-of-ages-3-make-break", "publisher": "Modus Games", "release_date": "Jul 21 2020", "developers": ["ACE Team"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "General", "Defense"], "meta_score": 65, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/34bc7aa3251825c509a2be3a9d3b167d-98.jpg", "descriptions": "Make & Break Worlds: Design and build your own levels in the easy-to-use editor and share your creations with players from all over the world for nearly limitless creative fun\r  Competitive Tower Defense: Build defenses and race to destroy your opponents’ in up to 4-player onlineMake & Break Worlds: Design and build your own levels in the easy-to-use editor and share your creations with players from all over the world for nearly limitless creative fun\r  Competitive Tower Defense: Build defenses and race to destroy your opponents’ in up to 4-player online multiplayer, or head-to-head in 2-player split-screen action\r  Boulder-Smashing Arcade Action: Crash your way through everything in your path as fast as you can in six distinct and arcadey game modes with over 20 zany boulders\r  Absurdly Funny: Take a ride on the wild side with everyone from Caesar and Moctezuma to Krampus and the Spaghetti Monster make an appearance in an expansive campaign across history and beyond.\r  Game Modes Galore: Defend your base in the new Boulder Avalanche, perfect your rolling skills in the fragile Humpty-Dumpty Mode, race the clock in Time Trials, or create your own unique gameplay\r… Expand"}, {"name": "NHL Rivals 2004", "details_link": "https://www.metacritic.com/game/xbox/nhl-rivals-2004", "publisher": "Microsoft Game Studios", "release_date": "Nov 18 2003", "developers": ["Microsoft Game Studios"], "platforms": "Xbox", "num_players": "1-10 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 65, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/e677b987e652378b2c6f0aceb7da8d45-98.jpg", "descriptions": "NHL Rivals 2004 is a dramatic hockey simulation that immerses gamers into a realistic and exciting hockey experience.  With more than 700 motion-captured animations, you can take one-timers, blast slap shots, and dish out the big body checks just like real NHL superstars.  You also canNHL Rivals 2004 is a dramatic hockey simulation that immerses gamers into a realistic and exciting hockey experience.  With more than 700 motion-captured animations, you can take one-timers, blast slap shots, and dish out the big body checks just like real NHL superstars.  You also can settle your hockey grudge matches and create their own rivalries online with Xbox Live and XSN Sports.  Control an NHL team on a quest to win the Stanley Cup, or take on your friends in a single game between two bitter rivals.… Expand"}, {"name": "BloodRayne", "details_link": "https://www.metacritic.com/game/pc/bloodrayne", "publisher": "Majesco Games", "release_date": "Sep  9 2003", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/ca84df89b9b41da231a4265a2d6c3f14-98.jpg", "descriptions": "As the half-vampire BloodRayne, you have sworn your life to protect humanity from the supernatural. Your latest assignment: Seek and destroy the nefarious vampire Jurgen Wolf before he can use powerful occult relics to unleash untold horror upon the world. Slaughter, dismember, and beheadAs the half-vampire BloodRayne, you have sworn your life to protect humanity from the supernatural. Your latest assignment: Seek and destroy the nefarious vampire Jurgen Wolf before he can use powerful occult relics to unleash untold horror upon the world. Slaughter, dismember, and behead devious enemies that seek reinforcements and plan ambushes. Acquire supernatural skills and master brutal weaponry as you progress. BloodRayne is a pulse-pounding thrillride that gets you by the jugular and won't let go until it's over. [Majesco]… Expand"}, {"name": "Resident Evil: Dead Aim", "details_link": "https://www.metacritic.com/game/playstation-2/resident-evil-dead-aim", "publisher": "Capcom", "release_date": "Jun 18 2003", "developers": ["Cavia Inc."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 65, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/2a8f24b952bba4704aef290dac6afa91-98.jpg", "descriptions": "A Deadly Game of Search and Pursuit. Join anti-Umbrella searchand pursuit team agent, Bruce MacGavin, as he encounters a new layer of Umbrella's insidious activities. In this all-new Resident Evil first-person action-shooter, you must search, sneak and use battle moves to regain control of aA Deadly Game of Search and Pursuit. Join anti-Umbrella searchand pursuit team agent, Bruce MacGavin, as he encounters a new layer of Umbrella's insidious activities. In this all-new Resident Evil first-person action-shooter, you must search, sneak and use battle moves to regain control of a sea-jacked cruiseship lost in the Atlantic. And should you find yourself trapped amongst hordes of zombiesand mutant beasts, your aim better be dead on ... or you?re gone! [Capcom]… Expand"}, {"name": "Mega Man Network Transmission", "details_link": "https://www.metacritic.com/game/gamecube/mega-man-network-transmission", "publisher": "Capcom", "release_date": "Jun 17 2003", "developers": ["Arika"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 65, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/bd38ac1544a344be22bc01652f72e73a-98.jpg", "descriptions": "Mega Man and his Battle Network pal Lan are in trouble again.  It's only been a month since the evil WWW terrorist's attempts to hijack an important military satellite was shut down; and yet, Cyberspace is about to be hit by an even more resilient, never-before-seen virus, codenamedMega Man and his Battle Network pal Lan are in trouble again.  It's only been a month since the evil WWW terrorist's attempts to hijack an important military satellite was shut down; and yet, Cyberspace is about to be hit by an even more resilient, never-before-seen virus, codenamed \"Zero.\" It's up to you, Lan, and Mega Man to terminate this seemingly impermeable and decidedly relentless new enemy.  Collect battle chips, battle enemies, solve puzzles, and uncover secret characters from the Mega Man universe.… Expand"}, {"name": "Conflict: Desert Storm", "details_link": "https://www.metacritic.com/game/xbox/conflict-desert-storm", "publisher": "Gotham Games", "release_date": "Sep 30 2002", "developers": ["SCi"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 65, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/c2fa1b18852ec4231fc66c9aa9283109-98.jpg", "descriptions": "Conflict: Desert Storm lets you lead one of the best known and most feared special operations forces in the world: the elite British SAS or the US Delta Force.  Covert missions take you through hostile environments where only your expertise in stealth, tactics, and firepower will ensure theConflict: Desert Storm lets you lead one of the best known and most feared special operations forces in the world: the elite British SAS or the US Delta Force.  Covert missions take you through hostile environments where only your expertise in stealth, tactics, and firepower will ensure the success and safety of your men.  Your missions are as unpredictable as they are dangerous: from vital scud-hunting missions deep within enemy territory to highly secretive rescue and assassination operations in Baghdad itself.  … Expand"}, {"name": "Taz Wanted", "details_link": "https://www.metacritic.com/game/playstation-2/taz-wanted", "publisher": "Infogrames", "release_date": "Sep 17 2002", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/613ac40a2453d873ed9e16d8847e1005-98.jpg", "descriptions": "The ravenous, relentless, natural disaster of a hero, TAZ, is rip-roaring mad. Yosemite Sam locked him in a zoo and wants to turn Taz's homeland into a tacky theme park! Now as an escapee, Taz is on the run gobbling power-ups, using disguises and leaving a wacky wake of destruction acrossThe ravenous, relentless, natural disaster of a hero, TAZ, is rip-roaring mad. Yosemite Sam locked him in a zoo and wants to turn Taz's homeland into a tacky theme park! Now as an escapee, Taz is on the run gobbling power-ups, using disguises and leaving a wacky wake of destruction across four hazard-filled worlds in an attempt to stop Sam. [Infogrames]… Expand"}, {"name": "Legends of Wrestling", "details_link": "https://www.metacritic.com/game/xbox/legends-of-wrestling", "publisher": "Acclaim", "release_date": "May 27 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/d91b25b766bc8ef085e507ed7776ed32-98.jpg", "descriptions": "Legends of Wrestling throws the greatest wrestlers into one game to find out who is the true king of kings. Wrestling superstars, including Hulk Hogan, Bret \"Hitman\" Hart, and Jerry \"The King\" Lawler, step back into the ring to deliver more body slams, piledrivers, andLegends of Wrestling throws the greatest wrestlers into one game to find out who is the true king of kings. Wrestling superstars, including Hulk Hogan, Bret \"Hitman\" Hart, and Jerry \"The King\" Lawler, step back into the ring to deliver more body slams, piledrivers, and powerbombs to the competition. Play as authentic professional wrestlers or create your own legendary fighter, and then travel around the world to battle for wrestling's top titles. Legends of Wrestling also features customizable ring attire and new wrestler entrances.… Expand"}, {"name": "Dark Arena", "details_link": "https://www.metacritic.com/game/game-boy-advance/dark-arena", "publisher": "Majesco Games", "release_date": "Jan 18 2002", "developers": ["Graphic State"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Fantasy"], "meta_score": 65, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/a702ad596cfdcafde460469bd698f550-98.jpg", "descriptions": "Dark Arena is 20 levels of terrifying, non-stop action. You play the role of Angela Bradshaw, a special forces agent who is trapped in the bowels of a deadly labyrinth of maze-like passages crawling with bloodthirsty, genetic horrors. Armed with a deadly array of futuristic weaponry and yourDark Arena is 20 levels of terrifying, non-stop action. You play the role of Angela Bradshaw, a special forces agent who is trapped in the bowels of a deadly labyrinth of maze-like passages crawling with bloodthirsty, genetic horrors. Armed with a deadly array of futuristic weaponry and your wits, you must make your escape.… Expand"}, {"name": "Vampire Night", "details_link": "https://www.metacritic.com/game/playstation-2/vampire-night", "publisher": "Namco", "release_date": "Nov 14 2001", "developers": ["Wow Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/eb099bb38dc81fb9392c458915bdfca1-98.jpg", "descriptions": "The legend has existed for centuries. Very few have survived to tell their account of terror. But we know, the Vampire is real. Grab a friend and the GunCon2 and experience the shoot'em up action. Namco puts you in the role of the vampire hunter. Includes a special training mode, anThe legend has existed for centuries. Very few have survived to tell their account of terror. But we know, the Vampire is real. Grab a friend and the GunCon2 and experience the shoot'em up action. Namco puts you in the role of the vampire hunter. Includes a special training mode, an adventure mode, and other hidden features. [Namco]… Expand"}, {"name": "Dexter's Laboratory: Deesaster Strikes!", "details_link": "https://www.metacritic.com/game/game-boy-advance/dexters-laboratory-deesaster-strikes!", "publisher": "Bam Entertainment", "release_date": "Sep 26 2001", "developers": ["Virtucraft"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/50798fde8cd81157bace884a851187ed-98.jpg", "descriptions": "Dexter must stop close of his sister Dee Dee from wrecking his laboratory."}, {"name": "NBA Hoopz", "details_link": "https://www.metacritic.com/game/dreamcast/nba-hoopz", "publisher": "Midway", "release_date": "Feb 13 2001", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "Dreamcast"], "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 65, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/3bb77feb86df8b0c8ad5789133160c6b-98.jpg", "descriptions": "NBA Hoopz for the Dreamcast is the same old song and dance that Midway has been perpetuating for years now."}, {"name": "Q-Ball: Billiards Master", "details_link": "https://www.metacritic.com/game/playstation-2/q-ball-billiards-master", "publisher": "Take-Two Interactive", "release_date": "Feb 29 2000", "developers": ["Ornith"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Parlor", "Billiards"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/60480a62c1e50986ef4c7fb1cfac738e-98.jpg", "descriptions": "Succeeding in the surprisingly competitive PlayStation 2 billiards genre isn't easy, but Q-Ball competes with a wide selection of game options. Seven modes of play are available: straight pool, free play, eight ball, US nine ball, international nine ball, rotation, frozen, plus carrot,Succeeding in the surprisingly competitive PlayStation 2 billiards genre isn't easy, but Q-Ball competes with a wide selection of game options. Seven modes of play are available: straight pool, free play, eight ball, US nine ball, international nine ball, rotation, frozen, plus carrot, random six, and bowlliards. Q-Ball also makes full use of the analog buttons and sticks for you to determine the power and angle of your shots.\rWith beautiful graphics and precision ball movement, billiards has never been this real! Qball: Billiards Master is a pool player's dream, using the power of the PlayStation 2 to create an unforgettably challenging game.\rPlay in style with QBall!… Expand"}, {"name": "Yoshi's Story", "details_link": "https://www.metacritic.com/game/nintendo-64/yoshis-story", "publisher": "Nintendo", "release_date": "Mar  1 1998", "developers": ["Nintendo"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/40a519e57414a95ee0738a11bb68ba69-98.jpg", "descriptions": "Baby Bowser has taken the Super Happy Tree and cast a spell on Yoshi's world, turning it into the pages of a picture book. The only Yoshis not affected by the spell were six hatchlings that were still protected by their shells. It's up to them to reclaim the Super Happy Tree and restoreBaby Bowser has taken the Super Happy Tree and cast a spell on Yoshi's world, turning it into the pages of a picture book. The only Yoshis not affected by the spell were six hatchlings that were still protected by their shells. It's up to them to reclaim the Super Happy Tree and restore happiness to the world. That is the only thing that can break Baby Bowser's spell!… Expand"}, {"name": "Wii Party U", "details_link": "https://www.metacritic.com/game/wii-u/wii-party-u", "publisher": "Nintendo", "release_date": "Oct 25 2013", "developers": ["Nd Cube"], "platforms": "Wii U", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/f39f55f7cb7a43eb7a892ec031e8b963-98.jpg", "descriptions": "Wii Party U lets players enjoy board games and mini-games on the TV. You can play familiar tabletop games using the Wii U GamePad controller or transform your living room into a game show floor."}, {"name": "Darkspore", "details_link": "https://www.metacritic.com/game/pc/darkspore", "publisher": "Electronic Arts", "release_date": "Apr 25 2011", "developers": ["Maxis"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/261f3fd8780f9cb76d92abf7a5ac99af-98.jpg", "descriptions": "Darkspore will feature dynamic, fast-paced action as players battle across alien worlds to save the galaxy from the mutated forces of Darkspore in a four-player co-operative and full single-player campaign, as well as intense multiplayer battles. In order to defeat the malicious Darkspore,Darkspore will feature dynamic, fast-paced action as players battle across alien worlds to save the galaxy from the mutated forces of Darkspore in a four-player co-operative and full single-player campaign, as well as intense multiplayer battles. In order to defeat the malicious Darkspore, players will need to collect an arsenal of living weapons - genetic heroes with different combat abilities - and upgrade them with tens of thousands of collectible body parts and armor.… Expand"}, {"name": "Black Knight Sword", "details_link": "https://www.metacritic.com/game/xbox-360/black-knight-sword", "publisher": "D3Publisher", "release_date": "Dec 12 2012", "developers": ["Digital Reality", "Grasshopper Manufacture"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/879c8239ef22604d392240dcf6461589-98.jpg", "descriptions": "Black Knight Sword 2D is a side-scrolling platformer from Suda-51's development house Grasshopper Manufacture."}, {"name": "Defend Your Castle", "details_link": "https://www.metacritic.com/game/wii/defend-your-castle", "publisher": "XGenStudios", "release_date": "May 12 2008", "developers": ["XGenStudios"], "platforms": ["iPhone/iPad", "PC", "Switch", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Strategy", "General", "Real-Time", "General", "Defense"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/473801128d4a351ef117fc8bd89e91a7-98.jpg", "descriptions": "[WiiWare]  Defend Your Castle takes place on a grassy plain surrounded by invaders. You are the commander of your castle, and at your disposal is only a hand for picking up the enemy and flinging them to their doom. Over time, add power-ups and other weapons to your arsenal to repel the[WiiWare]  Defend Your Castle takes place on a grassy plain surrounded by invaders. You are the commander of your castle, and at your disposal is only a hand for picking up the enemy and flinging them to their doom. Over time, add power-ups and other weapons to your arsenal to repel the attacks. How long can you hold them off? [Nintendo]… Expand"}, {"name": "Feeding Frenzy 2: Shipwreck Showdown", "details_link": "https://www.metacritic.com/game/xbox-360/feeding-frenzy-2-shipwreck-showdown", "publisher": "PopCap", "release_date": "Sep 17 2008", "developers": ["Gastronaut Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/22fdd45b65d71e3a546aa9e2a8682161-98.jpg", "descriptions": "[Xbox Live Arcade]  Chomp your way through an underwater mystery in Feeding Frenzy 2: Shipwreck Showdown. Play solo or with friends to dodge predators and eat your way up the food chain to save the sea in this sequel to \"Feeding Frenzy.\" Play wild, wacky party games, and try to stay alive in[Xbox Live Arcade]  Chomp your way through an underwater mystery in Feeding Frenzy 2: Shipwreck Showdown. Play solo or with friends to dodge predators and eat your way up the food chain to save the sea in this sequel to \"Feeding Frenzy.\" Play wild, wacky party games, and try to stay alive in Time Attack mode. Sixty spectacular levels, brand-new fish, and underwater scenes await. New features: New fish and 60 new levels are included. And now, your fish has the ability to jump out of the water. Multiple game modes: Play wacky party games, try to survive the Time Attack mode, or take on the main challenge and eat your way up the food chain. Multiplayer: Try co-op campaign play on the same console for up to four players, or try the four player mini-games. Everyone can get into a Feeding Frenzy. [PopCap Games]… Expand"}, {"name": "Night Call", "details_link": "https://www.metacritic.com/game/xbox-one/night-call", "publisher": "Raw Fury", "release_date": "Jun 24 2020", "developers": ["BlackMuffin Studio"], "platforms": ["PC", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/4/a73e16bac4d09ec8ed5013b21aa37239-98.jpg", "descriptions": "A mysterious serial killer stalks the streets of modern-day Paris. The body count rises, and the police are no closer to catching the culprit. You are a taxi driver and survivor to the killer's most recent attacks, having barely escaped with your life. You have seven nights to help find theA mysterious serial killer stalks the streets of modern-day Paris. The body count rises, and the police are no closer to catching the culprit. You are a taxi driver and survivor to the killer's most recent attacks, having barely escaped with your life. You have seven nights to help find the killer, or the police will pin it on you. These next few shifts will be far from ordinary or safe...Night Call is a non-linear, narrative-driven noire investigation game. You are no detective, but you do have a gift. Around you, people feel more at ease. They talk. They share their thoughts, their emotions, their stories... their secrets. To passengers, you are more than just a driver; you are also a friend, a confidant, a shrink. A voyeur catching a glimpse under the masked but very real lives throughout the City of Light. And you'll need to play these roles well if you want to catch the killer.Use the limited time you have available each night to gather clues while earning money to pay your bills. Drive passengers to their destinations, hear their stories and choose your responses carefully -- some are just regular people with a tale to tell, while others might reveal a clue that's key to your investigation. Follow the right leads to uncover new info about the suspects, and don't forget to make enough money to buy gas and pay your bills.Can you solve the mystery before it's too late? Better hurry -- both the clock and the meter are running...… Expand"}, {"name": "The Bradwell Conspiracy", "details_link": "https://www.metacritic.com/game/pc/the-bradwell-conspiracy", "publisher": "Bossa Studios", "release_date": "Oct  8 2019", "developers": ["Bossa Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/75b76cb32d853a3005a28fda5b9c806d-98.jpg", "descriptions": "Following a sudden explosion at the Stonehenge Museum fundraiser, you find yourself trapped in a hidden underground complex. Faced with a series of puzzles, your only means of escape is by sending photographs of your surroundings to another survivor confined elsewhere. But before long, aFollowing a sudden explosion at the Stonehenge Museum fundraiser, you find yourself trapped in a hidden underground complex. Faced with a series of puzzles, your only means of escape is by sending photographs of your surroundings to another survivor confined elsewhere. But before long, a disturbing truth begins to dawn…… Expand"}, {"name": "WRC 5", "details_link": "https://www.metacritic.com/game/pc/wrc-5", "publisher": "Bigben Interactive", "release_date": "Oct  8 2015", "developers": ["Kylotonn"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 65, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/bf39b87edcbfc319908b80aac36d4e44-98.jpg", "descriptions": "Realistic driving on different road surfaces, dynamic damage, day/night system, weather. Experience all the sensations of rally racing in WRC 5."}, {"name": "Risen 3: Titan Lords", "details_link": "https://www.metacritic.com/game/pc/risen-3-titan-lords", "publisher": "Deep Silver", "release_date": "Aug 12 2014", "developers": ["Piranha Bytes"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 65, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/5e95ce295b43c6cbd4e5ff75a9ed9e27-98.jpg", "descriptions": "The world of the RPG Risen 3 is abandoned by all gods and suffers from the Titan Wars when a new threat emerges. A young warrior is attacked from the darkness and deprived of his soul. He intends to reclaim what is lost amidst the shadows that is spreading throughout the world. The bannedThe world of the RPG Risen 3 is abandoned by all gods and suffers from the Titan Wars when a new threat emerges. A young warrior is attacked from the darkness and deprived of his soul. He intends to reclaim what is lost amidst the shadows that is spreading throughout the world. The banned Mages might be powerful allies on his quest. To attain their help, he must find the Mage sanctuary on Taranis, otherwise known as the Island of Thunder. Protected by the Guardians, the Mages search the mines of Taranis for crystals loaded with magic energy.… Expand"}, {"name": "Explodemon", "details_link": "https://www.metacritic.com/game/playstation-3/explodemon", "publisher": "Curve Studios", "release_date": "Feb  8 2011", "developers": ["Curve Studios"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/b1959ef6403028b4802452c2121818b0-98.jpg", "descriptions": "Explodemon! is a 2.5D platform action game brought kicking and screaming into the HD era. Influenced by classic Japanese games from the golden era of the SNES, players use Explodemon’s self-destructive nature to combat enemies and fly through the air, all the while solving a huge variety ofExplodemon! is a 2.5D platform action game brought kicking and screaming into the HD era. Influenced by classic Japanese games from the golden era of the SNES, players use Explodemon’s self-destructive nature to combat enemies and fly through the air, all the while solving a huge variety of physics-based puzzles (and, naturally, causing incalculable collateral damage).… Expand"}]