[{"name": "Batman: The Telltale Series - Episode 3: New World Order", "details_link": "https://www.metacritic.com/game/playstation-4/batman-the-telltale-series---episode-3-new-world-order", "publisher": "Telltale Games", "release_date": "Oct 25 2016", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/d130658590e44d78ba9f7f9fda1ca59b-98.jpg", "descriptions": "Penguin's brutal attack broadcast on live TV has left Gotham City reeling. As Bruce and Batman, you'll dig deeper into the web of intrigue surrounding the newly revealed Children of Arkham. Meanwhile, behind closed doors, the mysterious Selina Kyle reveals more of herself to Bruce. And inPenguin's brutal attack broadcast on live TV has left Gotham City reeling. As Bruce and Batman, you'll dig deeper into the web of intrigue surrounding the newly revealed Children of Arkham. Meanwhile, behind closed doors, the mysterious Selina Kyle reveals more of herself to Bruce. And in the aftermath of the attack, Bruce’s friend and Gotham’s new mayor, Harvey Dent, is a deeply changed man. Who can be trusted when the future of Bruce Wayne - and the Batman - could be determined by the flip of a coin?… Expand"}, {"name": "Blues and Bullets - Episode 2: Shaking The Hive", "details_link": "https://www.metacritic.com/game/xbox-one/blues-and-bullets---episode-2-shaking-the-hive", "publisher": "A Crowd of Monsters", "release_date": "Apr  8 2016", "developers": ["A Crowd of Monsters"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/0/929547fa7af2462910eb69db57ee0e96-98.jpg", "descriptions": "Eliot Ness, the former leader of the legendary Untouchables, wished only to spend the rest of his days working in his diner, not dwelling too much on the cesspit of corruption his city, Santa Esperanza, had degenerated into.\r But things rarely go as planned.\r\n\r\nWhen children suddenly startEliot Ness, the former leader of the legendary Untouchables, wished only to spend the rest of his days working in his diner, not dwelling too much on the cesspit of corruption his city, Santa Esperanza, had degenerated into.\r But things rarely go as planned.\r When children suddenly start to disappear and the police just simply a blind eye, Eliot decides to take the law into his own hands, track down the culprit and bring him to justice by any means necessary, even if he has to abandon his dreams of a peaceful life and again get embroiled in shootouts with the usual array of assassins and hoodlums.\r Helped by various characters from some unexpected places, the player must guide Eliot through the increasingly morbid and decadent scenarios searching for clues to solve the cases in the five episodes of this season's Blues and Bullets.… Expand"}, {"name": "Mercury Hg", "details_link": "https://www.metacritic.com/game/playstation-3/mercury-hg", "publisher": "UTV Ignition Games", "release_date": "Sep 27 2011", "developers": ["UTV Ignition Games"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 74, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/cd7e7e9fd8fb051b0a90a48d801688af-98.jpg", "descriptions": "Mercury Hg expands on the addictive qualities of its predecessors, crafting 60 all-new deviously constructed levels filled with hazards and obstacles while adding improvements and polish to almost every aspect of the game. The 'Mercury Blob' is still as mesmerizing as ever, moving uniquelyMercury Hg expands on the addictive qualities of its predecessors, crafting 60 all-new deviously constructed levels filled with hazards and obstacles while adding improvements and polish to almost every aspect of the game. The 'Mercury Blob' is still as mesmerizing as ever, moving uniquely under player control, changing color in order to progress through the level and dividing if cut by a protruding surface. While this dissection is important to solve puzzles, the real test of a player's skill is the ability to navigate strategically through varying types of slippery objects and sticky tiles with the use of balance and momentum in order to get to the finish line with their blob fully intact. A scoring system with full online leaderboard support adds a competitive touch to an already engrossing single-player experience. Additionally, the blob and game levels pulsate and react to the in-game music or songs from the player's library in real-time.  … Expand"}, {"name": "Star Ocean: First Departure", "details_link": "https://www.metacritic.com/game/psp/star-ocean-first-departure", "publisher": "Square Enix", "release_date": "Oct 21 2008", "developers": ["TOSE"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/5c86d4e9187421a826591ea0b459e7d2-98.jpg", "descriptions": "Space Date 346: The crew of a Terran Federation ship arrives on the planet Roak. With the help of a stalwart band of local heroes, the crew must work together to unravel a mystery and halt a galactic war."}, {"name": "Fire Emblem Warriors", "details_link": "https://www.metacritic.com/game/switch/fire-emblem-warriors", "publisher": "Nintendo", "release_date": "Oct 20 2017", "developers": ["Omega Force"], "platforms": ["3DS", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/84e7079272db43dec72428082a46342b-98.jpg", "descriptions": "Clash with legions of soldiers and fierce monsters as Marth, Xander, Corrin, and other Fire Emblem heroes unleashing over-the-top-powerful Dynasty Warriors-style moves. Take direct control of known and original Fire Emblem characters, issue them strategic commands in the midst of battle,Clash with legions of soldiers and fierce monsters as Marth, Xander, Corrin, and other Fire Emblem heroes unleashing over-the-top-powerful Dynasty Warriors-style moves. Take direct control of known and original Fire Emblem characters, issue them strategic commands in the midst of battle, pair up heroes to unleash stunning attacks, and more. Unlock new playable heroes, each with their own unique moves, special attacks, weapon types, and voiced dialogue in this large-scale action game from the Hyrule Warriors team.… Expand"}, {"name": "Kamiko", "details_link": "https://www.metacritic.com/game/switch/kamiko", "publisher": "Flyhigh Works", "release_date": "Apr 27 2017", "developers": ["Skipmore"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/804d0e2ecaee8a4d33a285f9759dc4fa-98.jpg", "descriptions": "Wield your weapon bestowed by the gods, and open the gates between worlds. KAMIKO is a game styled around Japanese Shinto beliefs. Fight as priestesses called \"KAMIKO\" and battle against demons while solving puzzles to make your way through the stages. Look no further if you are looking forWield your weapon bestowed by the gods, and open the gates between worlds. KAMIKO is a game styled around Japanese Shinto beliefs. Fight as priestesses called \"KAMIKO\" and battle against demons while solving puzzles to make your way through the stages. Look no further if you are looking for an arcade action game with a twist. Each stage has several Torii (gates) which are magically sealed. Find a way to break all the seals to make your way to the stage boss. [Nintendo.com]… Expand"}, {"name": "TASTEE: Lethal Tactics", "details_link": "https://www.metacritic.com/game/pc/tastee-lethal-tactics", "publisher": "SkyBox Labs", "release_date": "May 10 2016", "developers": ["SkyBox Labs"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/7461465a6f356129c2c3e1ff5fe7ea29-98.jpg", "descriptions": "Strategy has a new name and it’s damn TASTEE. Recruit a team of volatile mercs and execute dramatic gunfights on a mission to take down the Cartel. Out think, outmaneuver, and eliminate enemies in a fresh take on simultaneous turn-based tactics. Precision planning meets epic action."}, {"name": "Anna's Quest", "details_link": "https://www.metacritic.com/game/pc/annas-quest", "publisher": "Daedalic Entertainment", "release_date": "Jul  2 2015", "developers": ["Krams Design"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/f7613d056f186e8d12f05b46be370a01-98.jpg", "descriptions": "In a land far, far away lives a brave young girl called Anna. She lives a peaceful life in the forest with her grandfather, until a mysterious illness befalls him. And so Anna ventures forth to find a cure for him, but this world is a much more dangerous and bizarre place than she'd thought:In a land far, far away lives a brave young girl called Anna. She lives a peaceful life in the forest with her grandfather, until a mysterious illness befalls him. And so Anna ventures forth to find a cure for him, but this world is a much more dangerous and bizarre place than she'd thought: putting her journey to a sudden end, the witch Winfriede kidnaps Anna to use her for an experiment.… Expand"}, {"name": "Destination: Treasure Island", "details_link": "https://www.metacritic.com/game/pc/destination-treasure-island", "publisher": "DreamCatcher Interactive", "release_date": "Aug 21 2007", "developers": ["Kheops Studio"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Adventure", "First-Person", "General", "Point-and-Click", "Fantasy"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/014a68e1c132cdc80abb71aaa51dce2e-98.jpg", "descriptions": "Set out in search of the incredible treasure, but beware as your journey will be treacherous. The sequel to R.L. Stevenson's adventure. [DreamCatcher Interactive]"}, {"name": "Sam & Max Episode 103: The Mole, the Mob and the Meatball", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-103-the-mole-the-mob-and-the-meatball", "publisher": "Telltale Games", "release_date": "Jan 25 2007", "developers": ["Telltale Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/78813cd87177d22ce0393cc38f2c3268-98.jpg", "descriptions": "The commissioner is looking into an underground operation at the Ted E. Bear Mafia-Free Playland and Casino, but the mole he sent in has suddenly gone quiet. To find the mole, Sam & Max must infiltrate the operation and become members of the Toy Mafia themselves. [Telltale Games]"}, {"name": "HYPERCHARGE: Unboxed", "details_link": "https://www.metacritic.com/game/switch/hypercharge-unboxed", "publisher": "Digital Cybercherries", "release_date": "Jan 31 2020", "developers": ["Digital Cybercherries"], "platforms": ["PC", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/f437957914729827cf08d09a2ddec097-98.jpg", "descriptions": "HYPERCHARGE Unboxed tells the story of Sgt. Max Ammo and his epic mission to defend the HYPER-CORE. Your task is to fulfill his mission and prevent the HYPER-CORE from being destroyed. If it’s destroyed, you can bid farewell to your human friends. They’ll forget about you. It’ll be like youHYPERCHARGE Unboxed tells the story of Sgt. Max Ammo and his epic mission to defend the HYPER-CORE. Your task is to fulfill his mission and prevent the HYPER-CORE from being destroyed. If it’s destroyed, you can bid farewell to your human friends. They’ll forget about you. It’ll be like you never existed. Do not let that happen. Work together and win, for the future of toys everywhere.… Expand"}, {"name": "Cat Quest", "details_link": "https://www.metacritic.com/game/switch/cat-quest", "publisher": "PQube", "release_date": "Nov 10 2017", "developers": ["The Gentlebros"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/b8787ec5a876a327ded010c0841440e6-98.jpg", "descriptions": "Cat Quest is an open world RPG set in the pawsome world of cats! In search of your catnapped sister you pounce into the massive continent of Felingard -- a world crafted in the style of overworld maps of yore and purrrring with cat-tastic characters, stories, and puns!Leap into a grandCat Quest is an open world RPG set in the pawsome world of cats! In search of your catnapped sister you pounce into the massive continent of Felingard -- a world crafted in the style of overworld maps of yore and purrrring with cat-tastic characters, stories, and puns!Leap into a grand adventure in purrsuit of the evil Drakoth and your catnapped sister! Explore Felingard's huge overworld map, risk life and limb delving into dungeons for epic loot, and lend a paw to a furry cast of characters in a flurry of side quests.… Expand"}, {"name": "Resident Evil: Revelations 2", "details_link": "https://www.metacritic.com/game/pc/resident-evil-revelations-2", "publisher": "Capcom", "release_date": "Mar 18 2015", "developers": ["Capcom"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox 360", "Xbox One", "PC"], "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/28fe3de06e5d931fb651f0a4a6c26da1-98.jpg", "descriptions": "In Revelations 2, Raid Mode begins with choosing a character, and there are several characters to match all tastes. After that, you'll customize your weapons and skills to prepare for deployment. Raid Mode has been about collecting loot such as weapons, custom parts, and currency; inIn Revelations 2, Raid Mode begins with choosing a character, and there are several characters to match all tastes. After that, you'll customize your weapons and skills to prepare for deployment. Raid Mode has been about collecting loot such as weapons, custom parts, and currency; in Revelations 2, you'll also find treasure chests thrown into the mix. Remember, however, your ultimate goal is to find and break the goal emblem at the end of each stage. Raid Mode allows for cooperative play -- including local two-player split-screen. Grab a friend and get ready to shoot your way through this additional mode. … Expand"}, {"name": "Bit.Trip Fate", "details_link": "https://www.metacritic.com/game/pc/bittrip-fate", "publisher": "Gaijin Games", "release_date": "Jul 11 2013", "developers": ["Gaijin Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/b7db9b808802d4dc76cf69e586880143-98.jpg", "descriptions": "FATE is the penultimate chapter in the six-part BIT.TRIP series and will leave you wondering what’s next.Key Features: The arrow keys control CommanderVideo while the mouse allows you to fire anywhere on screen! Or if you prefer, plug in a controller for dual-stick shooting action!"}, {"name": "The Sims 2: Bon Voyage", "details_link": "https://www.metacritic.com/game/pc/the-sims-2-bon-voyage", "publisher": "Electronic Arts", "release_date": "Sep  4 2007", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/8bf0ce266cc8528ecddcd2ede85f71d3-98.jpg", "descriptions": "As your Sims travel, they'll interact and learn from a variety of real and mythical locals including the wise old hermit, fire dancers -- even Big Foot! Like all true vacationers, your Sims will be able to decorate their homes with unique souvenirs from their trips that are available only atAs your Sims travel, they'll interact and learn from a variety of real and mythical locals including the wise old hermit, fire dancers -- even Big Foot! Like all true vacationers, your Sims will be able to decorate their homes with unique souvenirs from their trips that are available only at destinations within The Sims 2 Bon Voyage. They can even buy unique jewelry to wear or take home as gifts. Fall in love with the hula dance lei from your Sims tropical beach vacation? Bring it back and flaunt to the neighbors! Love the moves your Sim mastered doing the Slap Dance at the rustic lodge? Teach fellow Sims the tricks of the trade back at home. What your Sims learn and collect, is up to you. [Electronic Arts]… Expand"}, {"name": "Red Dead Revolver", "details_link": "https://www.metacritic.com/game/xbox/red-dead-revolver", "publisher": "Rockstar Games", "release_date": "May  3 2004", "developers": ["Rockstar San Diego"], "platforms": ["PlayStation 2", "PlayStation 4", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Historic"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/cb13521d1a586369515273b93598533b-98.jpg", "descriptions": "Learn the ways of the Wild West as a bounty hunter seeking vengeance. Red Dead Revolver tells the story of Red, a man on a mission to kill General Diego--the rogue Mexican general who murdered Red's family for gold. As Red, you'll have a variety of weapons to choose from, including pistols,Learn the ways of the Wild West as a bounty hunter seeking vengeance. Red Dead Revolver tells the story of Red, a man on a mission to kill General Diego--the rogue Mexican general who murdered Red's family for gold. As Red, you'll have a variety of weapons to choose from, including pistols, rifles, shotguns, and dynamite. Dusty towns, windswept prairies, rugged saloons--the game integrates all of the elements of a classic Western movie.… Expand"}, {"name": "Midway Arcade Treasures", "details_link": "https://www.metacritic.com/game/xbox/midway-arcade-treasures", "publisher": "Midway", "release_date": "Nov 24 2003", "developers": ["Midway"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/0c9b7c7a26ef146f29dc7b278c3fb3bf-98.jpg", "descriptions": "Midway Arcade Treasures is jam-packed with over 20 classic arcade games.  Take a trip down memory lane as you relive the fast-paced action of SpyHunter, the cooperative multiplayer of Gauntlet, the space age adventure of Defender, the charm of Paperboy, the destructive monsters of Rampage,Midway Arcade Treasures is jam-packed with over 20 classic arcade games.  Take a trip down memory lane as you relive the fast-paced action of SpyHunter, the cooperative multiplayer of Gauntlet, the space age adventure of Defender, the charm of Paperboy, the destructive monsters of Rampage, and the dueling combat of Joust.  While you rest your fingers, check out the DVD content with game histories, creator interviews, and top secrets from videogaming's early days. … Expand"}, {"name": "Hulk", "details_link": "https://www.metacritic.com/game/pc/hulk", "publisher": "Universal Interactive", "release_date": "May 27 2003", "developers": ["Radical Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/ba66f1d60bb24e39477b3443baff5ad1-98.jpg", "descriptions": "One year after the events that take place in the film; troubled scientist Bruce Banner and his enraged alter ego, the Hulk, are forced into battle against the terrifying forces of the Leader, who's intent on using the Hulk's gamma energy to unleash a relentless army of gamma creatures on theOne year after the events that take place in the film; troubled scientist Bruce Banner and his enraged alter ego, the Hulk, are forced into battle against the terrifying forces of the Leader, who's intent on using the Hulk's gamma energy to unleash a relentless army of gamma creatures on the world. Two types of gameplay - use the powers of stealth and logic as Bruce Banner or command the incredible strength and fury of the Hulk. 30 massive, highly-detailed levels featuring environments both directly from the film and exclusive to the game. Fully destructible and interactive environments - virtually anything can be manipulated, picked up, destroyed or used a weapon. Intense boss battles - battle it out against gamma-enhanced super villains like Flux, Rampage and Half Life. Hollywood quality VO and soundtrack featuring detailed voice over from Eric Bana as Bruce Banner. Take down the Hulk's foes with over 25 devastating attacks, including super attacks like the Sonic Clap and Gamma Slam. [Vivendi Universal]… Expand"}, {"name": "GT Advance 3: Pro Concept Racing", "details_link": "https://www.metacritic.com/game/game-boy-advance/gt-advance-3-pro-concept-racing", "publisher": "THQ", "release_date": "Feb  6 2003", "developers": ["MTO"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 74, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/4aae9e1bc641c3428c4f2daf8e1892cf-98.jpg", "descriptions": "Choose from more than 90 authentic cars with upgradable parts from 10 top car manufacturers. Unlock cars with different acceleration, top speeds, and handling in order to master the 46 tracks."}, {"name": "Capcom vs. SNK Pro", "details_link": "https://www.metacritic.com/game/playstation/capcom-vs-snk-pro", "publisher": "Capcom", "release_date": "Aug 14 2002", "developers": ["Klein Computer Entertainment"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 74, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/a8702cba37f959060e0ae73d89f98c2a-98.jpg", "descriptions": "Two monster corporations at war. One solution. A massive martial arts event is organized to settle the score and eliminate all conflict between the two parties. Join over 30 brawlers from Capcom's legendary Street Fighter and SNK's renowned King of Fighters series; as they fight forTwo monster corporations at war. One solution. A massive martial arts event is organized to settle the score and eliminate all conflict between the two parties. Join over 30 brawlers from Capcom's legendary Street Fighter and SNK's renowned King of Fighters series; as they fight for universal domination. Capcom vs. SNK PRO...the ultimate collision of strength and power.… Expand"}, {"name": "Wreckless: The Yakuza Missions", "details_link": "https://www.metacritic.com/game/xbox/wreckless-the-yakuza-missions", "publisher": "Activision", "release_date": "Feb  4 2002", "developers": ["Bunkasha Publishing"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 74, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/7/f2f6d2098ccbdaf59fa3cb9dbcf8a49d-98.jpg", "descriptions": "Welcome to Hong Kong, where mystery and intrigue, money and power, and East and West intermingle. As the Yakuza terrorizes citizens, you arrive on the scene to answer the call of the city. You'll command an elite police unit called the Dragons, or you can play as a couple of spies hired toWelcome to Hong Kong, where mystery and intrigue, money and power, and East and West intermingle. As the Yakuza terrorizes citizens, you arrive on the scene to answer the call of the city. You'll command an elite police unit called the Dragons, or you can play as a couple of spies hired to defeat Tiger Takagi--the head of the Hong Kong Yakuza. In 40 wild missions, you'll fire at moving targets with car-mounted rocket launchers, maneuver through the destructive environments, and experience real-time crashes and vehicle deformation. … Expand"}, {"name": "MX 2002 Featuring Ricky Carmichael", "details_link": "https://www.metacritic.com/game/xbox/mx-2002-featuring-ricky-carmichael", "publisher": "THQ", "release_date": "Dec  6 2001", "developers": ["Pacific Coast Power & Light"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/d2107aad11295c564a3f1dd125771d59-98.jpg", "descriptions": "The biggest extreme sport just got bigger! Prepare for new levels of immersion, authenticity and compelling gameplay with MX 2002 featuring Ricky Carmichael for the Microsoft Xbox. Ride like a champion, compete for rockstar status in freestyle mode or just cruise the open terrain for yourThe biggest extreme sport just got bigger! Prepare for new levels of immersion, authenticity and compelling gameplay with MX 2002 featuring Ricky Carmichael for the Microsoft Xbox. Ride like a champion, compete for rockstar status in freestyle mode or just cruise the open terrain for your moto kicks. Featuring jaw-dropping graphics, awe-inspiring speed, a perfect blend of traditional racing and free ride madness, plus 30 pro riders including the sport's new grand champion, MX 2002 featuring Ricky Carmichael isn't just a game - it's a complete motocross experience!… Expand"}, {"name": "Dance Dance Revolution Disney Mix", "details_link": "https://www.metacritic.com/game/playstation/dance-dance-revolution-disney-mix", "publisher": "Konami", "release_date": "Sep 17 2001", "developers": ["Konami"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/e936939fc698cb7d7d4a60398bdd108c-98.jpg", "descriptions": "If you're a DDR fan who hasn't already imported the bevy of dancing games available in Japan, DDR Disney is worth checking out."}, {"name": "BPM: Bullets Per Minute", "details_link": "https://www.metacritic.com/game/pc/bpm-bullets-per-minute", "publisher": "Awe Interactive", "release_date": "Sep 15 2020", "developers": ["Awe Interactive"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Shooter", "First-Person", "Music", "Arcade"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/1c83490aa06f82295343440b71ac5c4e-98.jpg", "descriptions": "BPM is a rhythm-action FPS rogue-like where you must shoot, jump and dodge to the beat of an epic rock soundtrack. Delve into a randomly generated dungeon where one missed note can lead to your death. Gain game-changing abilities and loot powerful weaponry to defeat your ancient enemy: Nidhogg."}, {"name": "Syndicate", "details_link": "https://www.metacritic.com/game/xbox-360/syndicate", "publisher": "Electronic Arts", "release_date": "Feb 21 2012", "developers": ["Starbreeze"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/52ea91f6d5411ba90844e9bb33b4e23c-98.jpg", "descriptions": "2069 - No longer governed by politicians, the world is divided into regions controlled by mega-corporations known as Syndicates. These Syndicates have revolutionized the way consumers interact with the digital world. Consumers no longer require a device to access the world's data and control2069 - No longer governed by politicians, the world is divided into regions controlled by mega-corporations known as Syndicates. These Syndicates have revolutionized the way consumers interact with the digital world. Consumers no longer require a device to access the world's data and control their technology - they can achieve this with the blink of an eye after a neural chip implant. Civilians clamored to be \"chip'd\" and to enjoy all that their selected syndicate has to offer. Housing, medical, banking, insurance, education, entertainment, and employment.  One complete package - one complete lifestyle. In return, the syndicates gained unprecedented insights, and control, over individuals and their behavior. With insufficient government oversight, business has become war. The Syndicates stop at nothing for ultimate market dominance. On the front lines of this war are the Agents, the syndicates' bio-engineered and chip-augmented enforcers. They can breach anything in the wired dataverse including their enemies, their weapons, and the environment surrounding them, making them the most efficient and deadly technological weapons in the world. Assume the role of Miles Kilo, Eurocorp's latest prototype Agent, and embark on a brutal action adventure of corruption and revenge. [Electronic Arts]… Expand"}, {"name": "Relicta", "details_link": "https://www.metacritic.com/game/pc/relicta", "publisher": "Ravenscourt", "release_date": "Aug  3 2020", "developers": ["Mighty Polygon"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/7dc682556522c2fa9070df7ff07c4398-98.jpg", "descriptions": "Relicta is a first-person puzzle game whose main mechanics combine magnetism and gravity. The player is equipped with a pair of special gloves that allow them to change the magnetic and gravitational properties of experimental cubes scattered around each level. These cubes can be moved byRelicta is a first-person puzzle game whose main mechanics combine magnetism and gravity. The player is equipped with a pair of special gloves that allow them to change the magnetic and gravitational properties of experimental cubes scattered around each level. These cubes can be moved by the player, either carrying them bodily or using magnetism or gravity. They can also be placed on teleporting machines to warp them to another teleporter and help solve puzzles. Mechanics really come alive when combined in ingenious ways. For instance, magnetism can be used to repel or attract cubes, but repelling a cube that has previously “anti-gravitated” gives you a frictionless device that will retain inertia until it collides against something solid, like a wall (or your skull). It can even be used as a means of transport for the player to reach new places. Cubes can also be used to power up some devices, in order to operate doors and force fields. As the player progresses towards more complex puzzles, they will encounter other devices - magnetic plates, elevators, buttons or even drones capable of nullifying magnetic and gravitational fields as well as stealing cubes.… Expand"}, {"name": "The Alliance Alive HD Remastered", "details_link": "https://www.metacritic.com/game/switch/the-alliance-alive-hd-remastered", "publisher": "NIS America", "release_date": "Oct  8 2019", "developers": ["Cattle Call"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/10d54d8590ff4b7aeb16323f0ea75213-98.jpg", "descriptions": "An age of darkness has befallen the world. The Dark Current, a cataclysmic event caused by the Daemons’ emergence, has decimated the population and divided land into separate regions, leaving the survivors to be subjugated by Daemonic overlords."}, {"name": "A Pixel Story", "details_link": "https://www.metacritic.com/game/pc/a-pixel-story", "publisher": "Channel 4", "release_date": "Mar 30 2015", "developers": ["Lamplight Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/d57bc1d4b750b614f5f71234077d189f-98.jpg", "descriptions": "A Pixel Story is a sinister 2D puzzle platformer that charts the evolution of video games. You have to use your Magical Teleportation Hat to explore six increasingly detailed zones on your mission to reach the core of The System to stop the evil OS and save the world."}, {"name": "Taito Legends", "details_link": "https://www.metacritic.com/game/xbox/taito-legends", "publisher": "Sega", "release_date": "Oct 25 2005", "developers": ["Empire Oxford"], "platforms": ["PC", "Xbox"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/426d0faafc8db0e814cfbc953712174f-98.jpg", "descriptions": "The complete Taito Legends title list: Space Invaders (1978), Phoenix(1980), Space Invaders Part 2 (1980), Colony 7 (1981), Electric Yoyo (1982), Jungle Hunt (1982), Zoo Keeper (1982), Elevator Action (1983), Great Swordsman (1984), Return of the Invaders (1985), Bubble Bobble (1986),The complete Taito Legends title list: Space Invaders (1978), Phoenix(1980), Space Invaders Part 2 (1980), Colony 7 (1981), Electric Yoyo (1982), Jungle Hunt (1982), Zoo Keeper (1982), Elevator Action (1983), Great Swordsman (1984), Return of the Invaders (1985), Bubble Bobble (1986), Gladiator (1986), Tokio (1986), Exzisus (1987), Plump Pop (1987), Operation Wolf (1987), Rainbow Islands (1987), Rastan (1987), Super Qix (1987), The New Zealand Story (1988), Operation Thunderbolt (1988), Battle Shark (1989), Continental Circus (1989), Plotting (1989), Volfied (1989), Ninja Kids (1990), Space Gun (1990), Thunderfox (1990) Tube It (1993).… Expand"}, {"name": "Atelier Iris: Eternal Mana", "details_link": "https://www.metacritic.com/game/playstation-2/atelier-iris-eternal-mana", "publisher": "NIS America", "release_date": "Jun 28 2005", "developers": ["Gust"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/a69471269d2392bb3b2a16a57aca4399-98.jpg", "descriptions": "Assume the role of a young alchemist named Krein Kiesling. Krein will be traveling the world of Regallzine to unlock the hidden secrets of alchemy. Customize your weapons and items with help of spirits called Mana. Beautifully hand drawn 2D backgrounds combined with detailed characterAssume the role of a young alchemist named Krein Kiesling. Krein will be traveling the world of Regallzine to unlock the hidden secrets of alchemy. Customize your weapons and items with help of spirits called Mana. Beautifully hand drawn 2D backgrounds combined with detailed character animation.  Over 300 creatable items. Action controls allow players to run, jump, and attack like in an action game.… Expand"}, {"name": "Need for Speed Carbon", "details_link": "https://www.metacritic.com/game/xbox/need-for-speed-carbon", "publisher": "EA Games", "release_date": "Oct 31 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/70e36c22dd314af35080a62d36acc36a-98.jpg", "descriptions": "What starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods oneWhat starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Need for Speed Carbon delivers the next generation of customization giving you the power to design and tweak your crew's cars in every way using the ground-breaking new Autosculpt technology. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games.… Expand"}, {"name": "The Ascent", "details_link": "https://www.metacritic.com/game/pc/the-ascent", "publisher": "Curve Digital", "release_date": "Jul 29 2021", "developers": ["Neon Giant"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/d69f12af0cb0bc8039c76cb73e050b68-98.jpg", "descriptions": "You belong to the corporation. Can you survive without it? The Ascent is a solo and co-op action RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Confusion and chaos ensue, security and order are in disarray, and withoutYou belong to the corporation. Can you survive without it? The Ascent is a solo and co-op action RPG set in a cyberpunk world. The mega corporation that owns you and everyone, The Ascent Group, has just collapsed. Confusion and chaos ensue, security and order are in disarray, and without protection, everyone is left to fend for themselves. Stop gangs and hostile corporations from taking over and discover what really happened.… Expand"}, {"name": "Darius Cozmic Collection: Arcade", "details_link": "https://www.metacritic.com/game/playstation-4/darius-cozmic-collection-arcade", "publisher": "ININ Games", "release_date": "Jun 16 2020", "developers": ["Taito Corporation", "M2"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/2/d96c42435d456e1677cfc44f51a5c361-98.jpg", "descriptions": "The Darius Cozmic Collection Arcade contains 4 legendary console titles in a total of 7 versions:\r DARIUS (old version)\r  DARIUS (new version)\r  DARIUS (extra version)\r  DARIUS II (dual screen version)\r  SAGAIA (Ver. 1)\r  SAGAIA (Ver. 2)\r  DARIUS GAIDEN"}, {"name": "Afterparty", "details_link": "https://www.metacritic.com/game/switch/afterparty", "publisher": "Night School Studio", "release_date": "Mar  6 2020", "developers": ["Night School Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/a6ef9f7e686dd1401cc31a7f5e81e4e4-98.jpg", "descriptions": "In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you.In Afterparty, you are Milo and Lola, recently deceased best buds who suddenly find themselves staring down an eternity in Hell. But there’s a loophole: outdrink Satan and he’ll grant you re-entry to Earth. What adventures will you stumble through in the underworld? Every step is up to you. Time to go on the best bender ever, uncover the mystery of why you’ve been damned, and drink the big guy under the table. [Night School]… Expand"}, {"name": "John Wick Hex", "details_link": "https://www.metacritic.com/game/pc/john-wick-hex", "publisher": "Good Shepherd Entertainment", "release_date": "Oct  8 2019", "developers": ["Mike Bithell"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/abba26d7ba8505014d1bd98e19ec39aa-98.jpg", "descriptions": "BECOME THE BABA YAGA - John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex isBECOME THE BABA YAGA - John Wick Hex is a fast-paced, action-oriented strategy game that makes you think and strike like John Wick, the professional hitman of the critically acclaimed film franchise. Created in close cooperation with the creative teams behind the films, John Wick Hex is fight-choreographed chess brought to life as a video game, capturing the series’ signature gun fu style while expanding its story universe. Players must make quick decisions and choose every action and attack they make, all the while considering their immediate cost and consequences. Featuring a unique blend of strategic momentum-based combat, John Wick Hex captures the feel of the unique tactical combat from the films and blurs the line between the strategy and action video game genres. Perform well and progress in the main story mode (which features an original story created for the game) to unlock new weapons, suit options and locations. Each weapon changes up the tactics you’ll use and the manner in which you’ll play. Ammo is finite and realistically simulated, so time your reloads and make the most of weapons you scavenge on the job. John Wick Hex complements the style of the films with a unique graphic noir art design and features the world class voice talents of Ian McShane and Lance Reddick amongst its stellar cast.\r … Expand"}, {"name": "Disgaea PC", "details_link": "https://www.metacritic.com/game/pc/disgaea-pc", "publisher": "NIS America", "release_date": "Feb  4 2016", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 74, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/06cf6970bf2894e3429c0e11688b59c4-98.jpg", "descriptions": "Laharl, just woken from a two]year long nap and finds out that his father, who was the king, has passed away. In order to regain his rightful title as King of the Netherworld, Laharl sets off on a demonic adventure, but must do so with a back stabbing servant, love stupid angel, and a fewLaharl, just woken from a two]year long nap and finds out that his father, who was the king, has passed away. In order to regain his rightful title as King of the Netherworld, Laharl sets off on a demonic adventure, but must do so with a back stabbing servant, love stupid angel, and a few disgruntled penguins who are looking for trouble.… Expand"}, {"name": "Dying Light", "details_link": "https://www.metacritic.com/game/xbox-one/dying-light", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jan 27 2015", "developers": ["Techland"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 5 ", "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/a704fb4e8aca3eefe485f9407e23082d-98.jpg", "descriptions": "A survival game presented from a first-person perspective, Dying Light is set in a broad, dangerous open world. Throughout the day, you comb a city environment ravaged by a puzzling epidemic, scouring for supplies and fashioning weapons to assist you in defeating the hordes of brainless,A survival game presented from a first-person perspective, Dying Light is set in a broad, dangerous open world. Throughout the day, you comb a city environment ravaged by a puzzling epidemic, scouring for supplies and fashioning weapons to assist you in defeating the hordes of brainless, flesh-hungry enemies the plague has spawned. When the night falls, the hunter becomes the hunted as the infected increase their strength and aggressiveness - but even more deadly are the nocturnal, inhuman predators that leave their nests to feed.… Expand"}, {"name": "Just Dance 4", "details_link": "https://www.metacritic.com/game/wii/just-dance-4", "publisher": "Ubisoft", "release_date": "Oct  9 2012", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/6fd7e4ef0fbb57ef4cef499c140ad81c-98.jpg", "descriptions": "Just Dance 4 features more than 40 new tracks, ranging from chart-topping Billboard hits to classic dance party tracks. Whether it's pop, Hip-Hop, rock, R&B, country or funk, there is something for everyone."}, {"name": "Rock of Ages", "details_link": "https://www.metacritic.com/game/pc/rock-of-ages", "publisher": "Atlus", "release_date": "Sep  7 2011", "developers": ["ACE Team"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Miscellaneous", "General", "General", "General"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/72517a71d5c1c2f6d2cbff4ce6ca5bc0-98.jpg", "descriptions": "This game is the newest title by Atlus."}, {"name": "Fortix 2", "details_link": "https://www.metacritic.com/game/pc/fortix-2", "publisher": "Nemesys", "release_date": "May  6 2011", "developers": ["Nemesys"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Puzzle", "Action", "Fantasy", "General", "Fantasy"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/d7442a1c5ee6b792df6a58c864b0778b-98.jpg", "descriptions": "In the next chapter crusader Fortix has to save the rest of the continent from an evil curse. On his journeys Fortix will be aided by his sister Floriana. Fortix 2 will be a “funtasy” game, where you have to conquer dozens of hostile wastelands, deserts, swamps, and convert to lushIn the next chapter crusader Fortix has to save the rest of the continent from an evil curse. On his journeys Fortix will be aided by his sister Floriana. Fortix 2 will be a “funtasy” game, where you have to conquer dozens of hostile wastelands, deserts, swamps, and convert to lush landscapes. Savage wolfs will be turned to peaceful lambs, bloodthirsty dragons to seed-picking pigeons.… Expand"}, {"name": "NHL 2K8", "details_link": "https://www.metacritic.com/game/playstation-3/nhl-2k8", "publisher": "Take-Two Interactive", "release_date": "Sep 10 2007", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/7b66f07a0392981130136183454a2bd8-98.jpg", "descriptions": "Fully redesigned next-gen player models with accurate equipment and updated player faces brings you realistic hockey. Goaltending has been completely overhauled with instinctive AI, entirely new animations, and situation specific behaviors. Goaltenders now come out and challenge, guard theFully redesigned next-gen player models with accurate equipment and updated player faces brings you realistic hockey. Goaltending has been completely overhauled with instinctive AI, entirely new animations, and situation specific behaviors. Goaltenders now come out and challenge, guard the post, perform spectacular butterfly saves, and much more. A new control system delivers an experience that transcends the hockey videogame genre. Take control of \"the DEEPEST franchise mode in the business,\" now complete with realistic CBA features including waivers, two-way contracts, restricted and unrestricted free agents, and salary cap management. Off-season has also been revamped, boasting a brand new negotiation system, improved draft, and refurbished free agent signing. Topping off everything is the addition of an all-new player progression system and dynamic player types. 2K Sports Online - Go head-to-head against the best players on the planet and enter for your chance to win a new Dodge. [2K Sports]… Expand"}, {"name": "SSX Blur", "details_link": "https://www.metacritic.com/game/wii/ssx-blur", "publisher": "EA Sports Big", "release_date": "Feb 27 2007", "developers": ["EA Montreal"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/81c86129ff2eb6ca45e30434e2db78b3-98.jpg", "descriptions": "SSX Blur is everything you expect from the franchise, delivered in a totally unexpected way. Revolutionary controls take full advantage of the Wii's potential by putting you in total command of your skier or rider, on-the-ground & in-the-air, by translating every motion you make into theSSX Blur is everything you expect from the franchise, delivered in a totally unexpected way. Revolutionary controls take full advantage of the Wii's potential by putting you in total command of your skier or rider, on-the-ground & in-the-air, by translating every motion you make into the skills that create mountain legends. [Electronic Arts]… Expand"}, {"name": "Warhammer 40,000: Darktide", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-darktide", "publisher": "Fatshark", "release_date": "Nov 30 2022", "developers": ["Fatshark"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Action", "First-Person", "Strategy", "General", "Shooter", "Arcade"], "meta_score": 74, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/1/f6db1665741187d5bc05d9f8016b82bf-98.jpg", "descriptions": "Fight together with your friends against hordes of enemies in this new Warhammer 40,000 experience. From the developers of the best-selling and award-winning co-op action franchise Vermintide, Warhammer 40,000: Darktide is a visceral 4-player co-op action game set in the hive city ofFight together with your friends against hordes of enemies in this new Warhammer 40,000 experience. From the developers of the best-selling and award-winning co-op action franchise Vermintide, Warhammer 40,000: Darktide is a visceral 4-player co-op action game set in the hive city of Tertium. In the depths of the hive, the seeds of corruption threaten an overwhelming tide of darkness. A heretical cult known as the Admonition seeks to seize control of the planet Atoma Prime and lay waste to its inhabitants. It is up to you and your allies in the Inquisition to root out the enemy before the city succumbs to Chaos. … Expand"}, {"name": "Sonic Colors: Ultimate", "details_link": "https://www.metacritic.com/game/playstation-4/sonic-colors-ultimate", "publisher": "Sega", "release_date": "Sep  7 2021", "developers": ["Sega", "Blind Squirrel Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "genres": ["Action", "Platformer", "2D", "3D"], "meta_score": 74, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/0ea6bc3895cc108efa6dff51f9663dbd-98.jpg", "descriptions": "The evil Dr. Eggman has built an interstellar amusement park – but he’s powering it with a captured alien race called “Wisps.” Use Sonic’s speed to free the Wisps and gain their amazing powers as you explore six colorful unique worlds."}, {"name": "Hamilton's Great Adventure", "details_link": "https://www.metacritic.com/game/playstation-3/hamiltons-great-adventure", "publisher": "Fatshark AB", "release_date": "Aug 23 2011", "developers": ["Fatshark AB", "Fatshark"], "platforms": ["PC", "PlayStation 3"], "genres": ["Adventure", "General", "General"], "meta_score": 74, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/c443440298d9564c2e94522971114370-98.jpg", "descriptions": "Hamilton’s Great Adventure will introduce Ernest Hamilton, the great explorer, and his friendly bird Sasha, on their quest that will remain secret to not spoil the story."}, {"name": "2014 FIFA World Cup Brazil", "details_link": "https://www.metacritic.com/game/xbox-360/2014-fifa-world-cup-brazil", "publisher": "EA Sports", "release_date": "Apr 15 2014", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim"], "meta_score": 74, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/cc225c86932d66d506ee509a94479ea4-98.jpg", "descriptions": "EA SPORTS 2014 FIFA World Cup marks the return of one of the most popular FIFA game modes. Start from the bottom, work your way up the squad list and eventually lead your country from through qualifying, and onto the World Cup. A brand new auto-positioning system makes the mode accessible toEA SPORTS 2014 FIFA World Cup marks the return of one of the most popular FIFA game modes. Start from the bottom, work your way up the squad list and eventually lead your country from through qualifying, and onto the World Cup. A brand new auto-positioning system makes the mode accessible to new players. … Expand"}, {"name": "Eiyuden Chronicle: Rising", "details_link": "https://www.metacritic.com/game/playstation-5/eiyuden-chronicle-rising", "publisher": "505 Games", "release_date": "May 10 2022", "developers": ["NATSUME ATARI Inc.", "Rabbit & Bear Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Japanese-Style", "Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/63579a23e6d68f0e5d3d7727e013751b-98.jpg", "descriptions": "Eiyuden Chronicle: Rising combines a thrilling adventure through ancient ruins with the tale of one town’s rise from the ashes. Drawn by lenses and other treasure in the nearby Runebarrows, our heroes learn that the town is struggling to rebuild after an earthquake and decide to help. AlongEiyuden Chronicle: Rising combines a thrilling adventure through ancient ruins with the tale of one town’s rise from the ashes. Drawn by lenses and other treasure in the nearby Runebarrows, our heroes learn that the town is struggling to rebuild after an earthquake and decide to help. Along the way, they’ll resolve disputes between eager adventurers and wary locals who don’t think the Barrows should be disturbed. And they’ll learn more about each other’s reasons for seeking treasure, deepening their bonds in the process. As you will learn, these Runebarrows hide a great secret that has fateful implications for one of the characters. What begins as a simple treasure hunt turns into a dark conspiracy that will shake the world and plant seeds that carry over into the main story of Eiyuden Chronicle: Hundred Heroes. The game will introduce a portion of Eiyuden Chronicle’s cast of characters in an original story with thrilling action and engaging town-upgrading elements.\r… Expand"}, {"name": "Jurassic World Evolution 2", "details_link": "https://www.metacritic.com/game/xbox-series-x/jurassic-world-evolution-2", "publisher": "Frontier Developments", "release_date": "Nov  9 2021", "developers": ["Frontier Developments"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/873ef44e15a3c47999b22d38fe745390-98.jpg", "descriptions": "Jurassic World Evolution 2 is the sequel to Frontier’s Jurassic World Evolution, building upon the 2018 management simulation. It introduces a compelling, new narrative campaign, incredible new features, and awe-inspiring new dinosaurs brought to life with captivating authenticity. TogetherJurassic World Evolution 2 is the sequel to Frontier’s Jurassic World Evolution, building upon the 2018 management simulation. It introduces a compelling, new narrative campaign, incredible new features, and awe-inspiring new dinosaurs brought to life with captivating authenticity. Together with expanded construction and more customisation options, the result is an even bigger, better and authentic Jurassic World game.  \rFEATURES\r An Original Jurassic Story\rImmerse yourself in a compelling and original Jurassic World narrative set after the Earth-shattering events of Jurassic World: Fallen Kingdom. Lead efforts to control, conserve and contain dinosaurs as you work alongside iconic characters from the films, including Dr. Ian Malcolm (Jeff Goldblum) and Claire Dearing (Bryce Dallas Howard). \r\rCreate your own Jurassic World\rTake control with deeper management tools and creative options. Construct and customise new buildings and flex your managerial muscle across never-before-seen locations ranging from dense forests to rocky deserts. Rescue and bioengineer more than 75 prehistoric species, including highly requested flying and marine reptiles , and watch them seek territory, fight and interact with staggering realism. \r\rPlay with Chaos Theory\rChaos Theory mode lets you play through key moments of your favourite films - with a twist. Experience \"what-if\" scenarios from iconic Jurassic World and Jurassic Park films, with each level set across eras and locations from all five movies. Immerse yourself at the heart of the Jurassic World franchise and see how things turn out when you are put at the helm of managing new challenges with unpredictable outcomes.   … Expand"}, {"name": "Beholder: Complete Edition", "details_link": "https://www.metacritic.com/game/xbox-one/beholder-complete-edition", "publisher": "Curve Digital", "release_date": "Jan 19 2018", "developers": ["Warm Lamp Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/b51b3f37ec72446afe488dbb4fa9f9c0-98.jpg", "descriptions": "Seize control of your destiny in a grim dystopian world over which the State has absolute authority. Privacy is dead in this forbidding new age but you still have to make a living. As the manager of a government-run apartment building, you must keep your residents comfortable and well-fedSeize control of your destiny in a grim dystopian world over which the State has absolute authority. Privacy is dead in this forbidding new age but you still have to make a living. As the manager of a government-run apartment building, you must keep your residents comfortable and well-fed while fulfilling the directives of your superiors, who insist on knowing everything that's going on between your dilapidated walls.… Expand"}, {"name": "Headlander", "details_link": "https://www.metacritic.com/game/pc/headlander", "publisher": "Double Fine Productions", "release_date": "Jul 26 2016", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "2D"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/f0387136b898a604264bfcc127324e83-98.jpg", "descriptions": "Assume the role of the last known human in the universe, and all that's left of you is a disembodied head. Seeking clues to your fractured past, you must travel through a hostile world of machines using a special helmet that allows you to dock into and take control of any robotic host body.Assume the role of the last known human in the universe, and all that's left of you is a disembodied head. Seeking clues to your fractured past, you must travel through a hostile world of machines using a special helmet that allows you to dock into and take control of any robotic host body. As you launch from one body to the next, you'll start to discover that things are not quite what they appear to be, and the fate of humanity has yet to be decided. From Double Fine Productions, Headlander is a a retro-futuristic, side-scrolling, action-adventure game set in a world inspired by 70’s science fiction. It's a world of automation, a utopia gone wrong in which all of humanity have transferred their minds into robotic imposter bodies and are ruled by a deranged computer.… Expand"}, {"name": "The Bridge (2013)", "details_link": "https://www.metacritic.com/game/pc/the-bridge-2013", "publisher": "The Quantum Astrophysicists Guild", "release_date": "Feb 22 2013", "developers": ["Ty Taylor and Mario Castaneda"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "Logic", "General"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/25e7ac76919b50b288d1d3ac6683094b-98.jpg", "descriptions": "The Bridge is a 2D logic puzzle game that forces the player to reevaluate their preconceptions of physics and perspective."}, {"name": "RPG Time: The Legend of Wright", "details_link": "https://www.metacritic.com/game/switch/rpg-time-the-legend-of-wright", "publisher": "Aniplex Inc.", "release_date": "Aug 18 2022", "developers": ["Aniplex Inc.", "Deskworks"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/cf4ffb63f455b103219cd473da592310-98.jpg", "descriptions": "It's time for adventure! When school's out, it's RPG time!Let's play an RPG that's hand-drawn by a game-loving boy named Kenta, who drew it all on his notebook. Fun and exciting gimmicks and tricks appear every time you turn the page!\n\nWhile the game's title contains the term \"RPG,\"It's time for adventure! When school's out, it's RPG time!Let's play an RPG that's hand-drawn by a game-loving boy named Kenta, who drew it all on his notebook. Fun and exciting gimmicks and tricks appear every time you turn the page!While the game's title contains the term \"RPG,\" players will soon find themselves playing games other than the hand-drawn RPG on a notebook: a world made from cardboard and stationary strewn across a desk will also have players play action, adventure, side-scrolling shooters, and command battle games! The game is absolutely chock full of Kenta's playful imagination!Taking fifteen years to conceive and 9 years to develop, \"RPG Time: The Legend of Wright\" is packed with its creators' ideas and entertaining flourishes.… Expand"}, {"name": "Samurai Warriors 5", "details_link": "https://www.metacritic.com/game/pc/samurai-warriors-5", "publisher": "Koei Tecmo Games", "release_date": "Jul 27 2021", "developers": ["Koei Tecmo Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/48760494a5f7a75506216c33f4c43170-98.jpg", "descriptions": "Experience exhilarating action set in a dramatic historical setting in SAMURAI WARRIORS 5. As the latest numbered entry in the SAMURAI WARRIORS franchise, the story, characters, and visuals have been re imagined to set the stage for a thrilling new series. The story takes place after theExperience exhilarating action set in a dramatic historical setting in SAMURAI WARRIORS 5. As the latest numbered entry in the SAMURAI WARRIORS franchise, the story, characters, and visuals have been re imagined to set the stage for a thrilling new series. The story takes place after the Onin War during the golden age of the Sengoku period, and features a story that centers on the lives of two of the most representative military commanders of this era: Nobunaga Oda and Mitsuhide Akechi. Choose from a number of new and returning characters while utilising new abilities to take on evolving enemy forces. Experience electrifying Musou action like never before in SAMURAI WARRIORS 5!Features:* Experience an intense historical drama set during Japan's Sengoku period, told from the perspective of this era's foremost military commanders: Nobunaga Oda and Mitsuhide Akechi.* Both returning heroes and brand new characters have received re imagined designs in order to showcase the captivating world of the Sengoku period.* Enjoy exhilarating strategic action on an evolved battlefield. A total of 27 Samurai Warriors take to the battlefield.* Enemy forces continue to evolve as time passes in the story, making full use of a number of different military tactics to take on the player.… Expand"}, {"name": "Yes, Your Grace", "details_link": "https://www.metacritic.com/game/switch/yes-your-grace", "publisher": "No More Robots", "release_date": "Jun 26 2020", "developers": ["Brave at Night"], "platforms": ["PC", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/ffdc7d57421b14cae2da27032c34240d-98.jpg", "descriptions": "These are troubling times, Your Grace. The petitioners’ petty matters exceed our limited resources, to say nothing of the war. A careful balance must be struck. Your throne awaits.\r In this kingdom management RPG, petitioners will arrive in the throne room each turn to ask for your adviceThese are troubling times, Your Grace. The petitioners’ petty matters exceed our limited resources, to say nothing of the war. A careful balance must be struck. Your throne awaits.\r In this kingdom management RPG, petitioners will arrive in the throne room each turn to ask for your advice and assistance. Decide whether to help them with their problems, or to conserve resources for more important matters. Remember: supplies are limited, and not everyone has the kingdom’s best interests at heart...… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 5: From The Gallows", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---a-new-frontier-episode-5-from-the-gallows", "publisher": "Telltale Games", "release_date": "May 30 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/620a1c3abb5229c24765d75affb47b46-98.jpg", "descriptions": "After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? Telltale’s latest episodic adventure in the world of the Walking Dead is now available on all your favorite devices."}, {"name": "Neverending Nightmares", "details_link": "https://www.metacritic.com/game/playstation-4/neverending-nightmares", "publisher": "Infinitap Games", "release_date": "May  3 2016", "developers": ["Infinitap Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/8ebbf55b720a7099be55d0d6c8c28877-98.jpg", "descriptions": "A terrifying psychological horror game inspired by the developer's battle with mental illness. Explore nightmares! Branching narrative!"}, {"name": "Shantae: Risky's Revenge - Director's Cut", "details_link": "https://www.metacritic.com/game/playstation-4/shantae-riskys-revenge---directors-cut", "publisher": "WayForward", "release_date": "Jun 23 2015", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Wii U", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/0036ff4f097473c8a374ea799a033cf4-98.jpg", "descriptions": "Discover magical attacks, brew zombie coffee, save golden babies and master the art of belly dancing to transform Shantae into more powerful creatures. Use your powers to foil the lady pirate Risky Boots and save Sequin Land from certain doom."}, {"name": "Dead or Alive 5", "details_link": "https://www.metacritic.com/game/playstation-3/dead-or-alive-5", "publisher": "Tecmo Koei America Corp.", "release_date": "Sep 25 2012", "developers": ["Team Ninja"], "platforms": ["PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/c26c638b4c4fade3cbdf460c55d6b0b9-98.jpg", "descriptions": "Fight on through impactful stages as you knock your opponents off of an exotic waterfall, into an exploding oil rig and more. Over twenty of the most popular characters in fighting games including ninjas, assassins, roughnecks and wrestlers. The enhanced story and training modes willFight on through impactful stages as you knock your opponents off of an exotic waterfall, into an exploding oil rig and more. Over twenty of the most popular characters in fighting games including ninjas, assassins, roughnecks and wrestlers. The enhanced story and training modes will acclimate newcomers to the signature Dead or Alive Triangle System, and the  online modes will enable the best fighters in the world to compete with one another.… Expand"}, {"name": "Tokyo Jungle", "details_link": "https://www.metacritic.com/game/playstation-3/tokyo-jungle", "publisher": "SCEA", "release_date": "Sep 25 2012", "developers": ["Crispy's"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Survival"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/4c9dfaefcde9759fe1c956fa9fd4c855-98.jpg", "descriptions": "A hunting game for the PlayStation 3 is finally here! The story takes place in the year 20XX, where you are an animal fighting for survival in the deserted city of Tokyo which was once a lively metropolis. At times, you can be a Pomeranian who has given up a domesticated life for itsA hunting game for the PlayStation 3 is finally here! The story takes place in the year 20XX, where you are an animal fighting for survival in the deserted city of Tokyo which was once a lively metropolis. At times, you can be a Pomeranian who has given up a domesticated life for its independence, be a racehorse on a mission to find fellow competitors or even be a lion, the king of all beasts, seeking the warmth of home. You can choose to be a carnivore or herbivore, to survive alone or as part of a herb. You must hunt all the animals in sight for your own survival. See what challenges await you...… Expand"}, {"name": "Mirror's Edge Catalyst", "details_link": "https://www.metacritic.com/game/pc/mirrors-edge-catalyst", "publisher": "Electronic Arts", "release_date": "Jun  7 2016", "developers": ["EA DICE"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Modern", "Modern", "Action Adventure", "General"], "meta_score": 74, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/c8cbb66ec7b19c9444744d2d46517e82-98.jpg", "descriptions": "Through Mirror’s Edge Catalyst, experience the emergence of Faith, a brave Runner who uncovers a hidden truth inside the walls of the city of Glass. Through her journey, Faith explores every corner of the city, from the highest, most pristine skyscrapers, to the dark and dingy tunnels thatThrough Mirror’s Edge Catalyst, experience the emergence of Faith, a brave Runner who uncovers a hidden truth inside the walls of the city of Glass. Through her journey, Faith explores every corner of the city, from the highest, most pristine skyscrapers, to the dark and dingy tunnels that underlie the city. Players must master the environment, using their momentum and timing their combat to fight the oppressiveness of the ruling elite, uncovering the dark secrets behind the city’s beautiful façade. Mirror’s Edge Catalyst offers players the freedom to explore the expanse of the city, discovering a variety of new activities, like ‘Dash’, races from point A to B, environmental puzzles and story missions to complete at their leisure. [EA]… Expand"}, {"name": "One Piece Odyssey", "details_link": "https://www.metacritic.com/game/playstation-5/one-piece-odyssey", "publisher": "Bandai Namco Games", "release_date": "Jan 13 2023", "developers": ["ILCA", "Inc."], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/41f4dbf2568f9eec78d6e427326ad561-98.jpg", "descriptions": "Join this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and TalesJoin this brand-new RPG featuring new character and monster designs produced by Eiichiro Oda, the author of ONE PIECE. The game is also complemented by the beautiful music of Motoi Sakuraba, a composer well known for his various contributions to video games such as the Dark Souls and Tales of series.During their voyage, the Straw Hats, led by Monkey D. Luffy are swallowed by a huge storm at sea. They end up on a mysterious island full of nature amidst the storm and become separated from each other. The crew sets out on a new adventurous journey filled with wonders of a raging nature, powerful enemies, and strange encounters with island locals.Work together with Luffy and his crew to set sail once again!… Expand"}, {"name": "Virginia", "details_link": "https://www.metacritic.com/game/pc/virginia", "publisher": "505 Games", "release_date": "Sep 22 2016", "developers": ["Variable State"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 74, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/ae33d6a54d252aa4c6d0029e3397c1be-98.jpg", "descriptions": "Virginia is a single-player first-person thriller set in a small town with a secret. Experience a missing person investigation through the eyes of graduate FBI agent Anne Tarver."}, {"name": "Dead In Vinland", "details_link": "https://www.metacritic.com/game/pc/dead-in-vinland", "publisher": "Playdius", "release_date": "Apr 12 2018", "developers": ["CCCP"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/b6342b273915e116f4caed2a43fee83d-98.jpg", "descriptions": "Dead in Vinland is a survival/management game, mixed with RPG and adventure elements, focusing on a Viking family trying their level best to survive on a mysterious island. Exiled on a faraway and unknown land, lead Eirik and his family on their quest to survive. Manage their physical andDead in Vinland is a survival/management game, mixed with RPG and adventure elements, focusing on a Viking family trying their level best to survive on a mysterious island. Exiled on a faraway and unknown land, lead Eirik and his family on their quest to survive. Manage their physical and mental health, explore the island, organize your camp and deal with other human beings. Some will help you, and some will be less... friendly. Unveil the esoteric mysteries of Vinland. They could save your life… or lead you to your demise.… Expand"}, {"name": "SBK X: Superbike World Championship", "details_link": "https://www.metacritic.com/game/xbox-360/sbk-x-superbike-world-championship", "publisher": "SouthPeak Games", "release_date": "Dec  7 2010", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/ec8b40387e861f59aab3668451196dcf-98.jpg", "descriptions": "SBK X delivers the incomparable excitement of the Superbike World Championship; all the bikes, all the riders and all the tracks of the official season. For the first time, this edition of the hit SBK series contains three categories of game play: Superbike, Superstock and Supersport. SBK XSBK X delivers the incomparable excitement of the Superbike World Championship; all the bikes, all the riders and all the tracks of the official season. For the first time, this edition of the hit SBK series contains three categories of game play: Superbike, Superstock and Supersport. SBK X includes a career mode, allowing the player to personalize their rider and manage their career.  For even further game play options, players can choose to race in arcade and simulation modes for a quick blast around the track or a detailed simulation. Whichever game play style is preferred, with up to 16 player online multiplayer, SBK X is the most complete sport bike experience on the market. … Expand"}, {"name": "Just Dance 2020", "details_link": "https://www.metacritic.com/game/switch/just-dance-2020", "publisher": "Ubisoft", "release_date": "Nov  5 2019", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 74, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/d6294e8921bc870c738e82685b26dbe2-98.jpg", "descriptions": "Gather your friends and family and Just Dance like nobody's watching with Just Dance 2020! The 1 Music Video Game Franchise of All Time, with over 67 million units sold, is back this Fall. The newest, freshest Just Dance celebrates 10 years of bringing people together with 40 new hot tracks,Gather your friends and family and Just Dance like nobody's watching with Just Dance 2020! The 1 Music Video Game Franchise of All Time, with over 67 million units sold, is back this Fall. The newest, freshest Just Dance celebrates 10 years of bringing people together with 40 new hot tracks, more stunning universes and exclusive surprises for the players to discover!Join a community of more than 120 million players around the world and get ready to set the dancefloor on fire. Whether there's something to celebrate or for no reason at all, Just Dance is there for every occasion! Fan favourite features are back in Just Dance 2020, along with 40 new songs from the top of the charts for the whole family to enjoy!Features:* From chart-topping hits to family favourites, viral internet sensations, and the latest emerging artists, there is something for everyone to have fun in Just Dance.* Enjoy a wide range of creative universes, created using new production techniques, never before seen in Just Dance.* Track your calories burnt, time spent dancing, and keep yourself motivated while having fun with the fan favourite Sweat mode!… Expand"}, {"name": "Infected", "details_link": "https://www.metacritic.com/game/psp/infected", "publisher": "Majesco Games", "release_date": "Nov 15 2005", "developers": ["Planet Moon Studios"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/d035f5e5db9ae4d9f4bfa4a6e3e3fbd9-98.jpg", "descriptions": "It's Christmas time in New York City and a strange virus has appeared turning seemingly normal citizens into the insane, violent Infected. Rookie Officer Stevens is one of the first victims but unlike others, is strangely immune. The mysterious Dr. Schaeffer discovers that Stevens' blood canIt's Christmas time in New York City and a strange virus has appeared turning seemingly normal citizens into the insane, violent Infected. Rookie Officer Stevens is one of the first victims but unlike others, is strangely immune. The mysterious Dr. Schaeffer discovers that Stevens' blood can be used to destroy the otherwise invincible Infected, and creates a special \"viral gun\" that fills shells with blood from Stevens' arm and blasts them straight into the Infected, causing them to violently explode. Featuring an engrossing single-player campaign with lavishly gory details, Infected unlocks the world of Wi-Fi via exciting multiplayer modes. To participate in multiplayer combat, players create their own character or avatar. Those who are victorious in combat can \"infect\" the loser’s PSP system with their avatar and gain ranking points. Avatars can be defeated through a variety of methods, as well as passed along from player to player thus creating a viral chain letter of attack. Infect the world - spread your unique avatar like a virus to other players’ PSP systems via exciting multiplayer modes such as Deathmatch and Team Deathmatch; Form clans with shared uniforms, spreading the same unique virus to the lesser skilled; Set off massive chain reactions of exploding Infected, showering the streets with blood. [Majesco]… Expand"}, {"name": "The Flame in the Flood", "details_link": "https://www.metacritic.com/game/xbox-one/the-flame-in-the-flood", "publisher": "The Molasses Flood", "release_date": "Feb 24 2016", "developers": ["The Molasses Flood"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "General", "Survival"], "meta_score": 74, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/a36ef714c8ee5c6e4f08cfaaf798b195-98.jpg", "descriptions": "A rogue-lite river journey through the backwaters of a forgotten post-societal America. Forage, craft, evade predators. For PC, Mac, and Xbox One."}, {"name": "Ghostbusters: Spirits Unleashed", "details_link": "https://www.metacritic.com/game/xbox-series-x/ghostbusters-spirits-unleashed", "publisher": "IllFonic", "release_date": "Oct 18 2022", "developers": ["IllFonic"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/6ed81c8dad9f728e12adfe23e9b1a9ed-98.jpg", "descriptions": "Ghostbusters: Spirits Unleashed is coming to a platform near you. As a Ghostbuster, join with other Ghostbusters to chase and trap ghosts in museums, prisons, hotels, and more, and capture the ghosts before they can fully haunt the areas. Or, as the Ghost, hide, sneak, surprise, scare, andGhostbusters: Spirits Unleashed is coming to a platform near you. As a Ghostbuster, join with other Ghostbusters to chase and trap ghosts in museums, prisons, hotels, and more, and capture the ghosts before they can fully haunt the areas. Or, as the Ghost, hide, sneak, surprise, scare, and of course, slime Ghostbusters and civilians until the everything has gone completely spooky. Use trickery, deception, and Ectoplasm to gain the upper hand and drive the Ghostbusters out.… Expand"}, {"name": "Eador: Masters of the Broken World", "details_link": "https://www.metacritic.com/game/pc/eador-masters-of-the-broken-world", "publisher": "Snowbird Game Studios", "release_date": "Apr 19 2013", "developers": ["Snowbird Game Studios"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/4ecbf6693aed8abc7bea082bf9a03c32-98.jpg", "descriptions": "Eador. Masters of the Broken World - is a turn-based strategy in the original fantasy setting, where the decisions you make affect the world even deeper than the battles you win. The game combines the unmatched strategic depth with boundless role-playing opportunities, granting the playerEador. Masters of the Broken World - is a turn-based strategy in the original fantasy setting, where the decisions you make affect the world even deeper than the battles you win. The game combines the unmatched strategic depth with boundless role-playing opportunities, granting the player the power of the immortal ruler of the magic world of Eador. The game is set for release in 2012.… Expand"}, {"name": "Rocketbirds: Hardboiled Chicken", "details_link": "https://www.metacritic.com/game/playstation-3/rocketbirds-hardboiled-chicken", "publisher": "Ratloop Asia Pte Ltd", "release_date": "Oct 18 2011", "developers": ["Ratloop Asia Pte Ltd"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "PlayStation 3"], "genres": ["Action", "Adventure", "General", "General", "Platformer", "2D"], "meta_score": 74, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/78fb4550364949edc9bd0408b0e63001-98.jpg", "descriptions": "Rocketbirds: Hardboiled Chicken builds upon the browser-based game Rocketbirds: Revolution! and expands the Rocketbirds universe with new characters, missions, puzzles, exclusive music videos, retro cut scenes and more. Set in Albatropolis, a land full of birds taken over by a totalitarianRocketbirds: Hardboiled Chicken builds upon the browser-based game Rocketbirds: Revolution! and expands the Rocketbirds universe with new characters, missions, puzzles, exclusive music videos, retro cut scenes and more. Set in Albatropolis, a land full of birds taken over by a totalitarian penguin regime, Hardboiled Chicken, the original Coq of War, must assassinate the evil penguin leader Putzki.  His mission will unlock the secrets to his mysterious, hard boiled past and uncover the real enemies of Albatropolis.  In single-player mode, take on the role of Hardboiled Chicken and destroy your enemies with a slew of weapons you collect and unlock in each chapter. Master fowl play in the co-op campaign as a pair of Budgie commandos on a mission to save the general’s daughter.  Many lives will be destroyed, countless penguins will die, and an astonishing past will be unveiled through a series of unlockable cut scenes and videos.  … Expand"}, {"name": "Sonic Origins", "details_link": "https://www.metacritic.com/game/switch/sonic-origins", "publisher": "Sega", "release_date": "Jun 23 2022", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 74, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/262d5ffc03989a029a47198f20268ce9-98.jpg", "descriptions": "Relive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans ofRelive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans of Doctor Robotnik in polished high definition! This latest version includes new areas to explore, additional animations, and a brand new Anniversary mode! Explore the classic Sonic titles in high-resolution, with all-new opening and ending animations for each title! New Unlockables: Complete various missions to collect coins to unlock new content, challenges, and Special Stages through the Museum. Classic and Anniversary Mode. Choose to Spin Dash your way through the numerous zones in Classic mode with the game's original resolution and limited lives, or the new Anniversary mode with unlimited lives and revamped fullscreen resolution.… Expand"}, {"name": "Project Warlock", "details_link": "https://www.metacritic.com/game/playstation-4/project-warlock", "publisher": "Crunching Koalas", "release_date": "Jun  9 2020", "developers": ["Buckshot Software"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 74, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/6e18ef07dfcfa07f9a1e1e395a5ecf96-98.jpg", "descriptions": "One man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hoursOne man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hours of super fun carnage. Let’s rock and roll! Explore 60 vast levels in five settings, from frozen Antarctic base to the sands of Egypt to the medieval castles’ courts and graveyards. Find keys to unlock passages, reveal secret caches with ammo and gold, use lifts and hidden buttons to access new areas. Finally descend to hell to face the ultimate challenge and emerge victorious. Combat tons of enemies from flying demons to five-storeys robots, splashing walls and floors with their blood and chunks. Dodge bullets and projectiles, figure out strategies and weapons that work best against each of the nasty villains. Learn their moves and stay one step ahead to survive through the levels. Face megabosses in vast final arenas to complete each world. Expand your arsenal with new weapons found along your way. From powerful blades to massive guns, collect and develop your favourite gear and master the craft of carnage. Reach into vast arsenal of 38 types of weapons and learn their secret tricks to deliver maximum damage, fast! Grab ammo and spit out series of bullets, walls of flames, and bursts of magic shots to bring down enemies foolish enough to stand in your way. Develop your hero the way you like, by assigning upgrade points and perks to the favourite skills between each level. Develop and upgrade spells and weapons to create your unique character through the game, and use their powers to master the game in higher difficulty modes.… Expand"}, {"name": "Tom Clancy's The Division 2: Warlords of New York", "details_link": "https://www.metacritic.com/game/playstation-4/tom-clancys-the-division-2-warlords-of-new-york", "publisher": "Ubisoft", "release_date": "Mar  3 2020", "developers": ["Massive Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 74, "users_score": 1.1, "image": "https://static.metacritic.com/images/products/games/6/76ec671fbbfd8e9038abdf1b3fbabb79-98.jpg", "descriptions": "While The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and usedWhile The Division was working to secure Washington, D.C., a familiar shadow fell over the streets of New York. Aaron Keener - one of The Division's original antagonists, as well as the first Division Agent to go rogue - has brought the factions of New York City under his control, and used them to conquer Lower Manhattan. With other rogue Agents and a lethal new viral strain at his command, Keener is poised to eradicate what little has been rebuilt since the catastrophic Black Friday pandemic. The battle to restore order continues, but now The Division has a new mission: Stop Keener at any cost.… Expand"}, {"name": "The Beast Inside", "details_link": "https://www.metacritic.com/game/pc/the-beast-inside", "publisher": "Movie Games S.A.", "release_date": "Oct 17 2019", "developers": ["Illusion Ray Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "First-Person"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/7a57ef8b8b66adba1af0494c70859874-98.jpg", "descriptions": "The Beast Inside is a unique, gripping twist on thriller and survival horror. The game mixes intriguing story-driven adventure with unnerving survival horror experience. Immerse in the tale of long-buried secrets, personal tragedies, and madness. Play as two protagonists living in differentThe Beast Inside is a unique, gripping twist on thriller and survival horror. The game mixes intriguing story-driven adventure with unnerving survival horror experience. Immerse in the tale of long-buried secrets, personal tragedies, and madness. Play as two protagonists living in different centuries but bounded by dark heritage.Boston, 1979, Adam, the CIA cryptanalyst, leaves the city and moves to the countryside with his wife, Emma. His handlers are afraid they won't be able to keep him safe there, but Adam believes he needs a peaceful place in the woodland, to take a shot at the military code. His work may alter the course of the Cold War. As it turns out, this area is quite the opposite of a peaceful place they have expected...In the attic Adam finds a mysterious diary written by a man called Nicolas Hyde, allegedly, a past resident of the same house who lived there in the 19th Century. Once opened, the diary carries the nightmares of the past right into Adam's times, putting the lives of Adam and Emma in great danger. Density increases as these two stories come to an inevitable crash. Distant past and his eternal prisoner - Nicolas against Adam, cryptanalyst from the Cold War. What can it lead to? In tangled times, who will you trust?FEATURES* Explore Blackstone, the forgotten domain of Hyde's lineage. A rich world designed to complement the thrilling story.* Sink in the immersive environment created with photogrammetry technology. Enjoy the realism of a setting achieved by the inclusion of 3D-scanned objects.* Play as two independent characters living in different centuries. Take their faiths in your hands and unveil how their stories interfere.* Experience a unique history, solve mysteries on your way, collect the clues, and decide by yourself how this story will end.* Discover the new levels of horror sharpen by the motion capture technology* Use your trusted revolver to shoot your way out from even the most lethal scenarios.… Expand"}, {"name": "Fate/Extella Link", "details_link": "https://www.metacritic.com/game/switch/fateextella-link", "publisher": "XSEED Games", "release_date": "Mar 19 2019", "developers": ["Marvelous Inc.", "Marvelous First Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/4575c4a02fa32a37ce23f144df96d5c8-98.jpg", "descriptions": "Picking up right where the 2017 smash hit Fate/EXTELLA: The Umbral Star left off, Fate/EXTELLA LINK adds 10 Servants to the original roster of 16. The high-speed action gameplay has been refined, and players will battle their way through massive invading armies to wrest back control ofPicking up right where the 2017 smash hit Fate/EXTELLA: The Umbral Star left off, Fate/EXTELLA LINK adds 10 Servants to the original roster of 16. The high-speed action gameplay has been refined, and players will battle their way through massive invading armies to wrest back control of SE.RA.PH. from an invading force. Players on the PlayStation®4 can now engage in massive 4-on-4 online battles with up to 7 other players. Choose your favorite Servant and make your foes quiver at the true name of their Noble Phantasm. … Expand"}, {"name": "LEGO The Incredibles", "details_link": "https://www.metacritic.com/game/xbox-one/lego-the-incredibles", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 15 2018", "developers": ["TT Games", "TT Fusion"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/d10ee7fd8354ff378107afab031bf52c-98.jpg", "descriptions": "LEGO The Incredibles, a new video game where players take control of their favourite Incredibles characters in unforgettable scenes and action sequences from both Disney Pixar films, The Incredibles and the upcoming The Incredibles 2. The game encourages players to work together by combiningLEGO The Incredibles, a new video game where players take control of their favourite Incredibles characters in unforgettable scenes and action sequences from both Disney Pixar films, The Incredibles and the upcoming The Incredibles 2. The game encourages players to work together by combining the Parr family's abilities and unique powers to conquer crime and family life in a LEGO world full of fun and humour. With LEGO The Incredibles, fans can experience the non-stop action from both movies while fighting crime together as a super hero family. In LEGO The Incredibles, players explore action-packed story levels and an epic hub world, including Municiberg and New Urbem, as they use their unique super abilities to bring the city's villains to justice.… Expand"}, {"name": "Paladins: Champions of the Realm", "details_link": "https://www.metacritic.com/game/switch/paladins-champions-of-the-realm", "publisher": "Hi-Rez Studios", "release_date": "Jun 12 2018", "developers": ["Hi-Rez Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/2396d41d57c6608670b68e289efa2793-98.jpg", "descriptions": "Paladins is a free-to-play game that combines a rich fantasy setting with the fast action of a team-based first-person shooter."}, {"name": "Sparc", "details_link": "https://www.metacritic.com/game/playstation-4/sparc", "publisher": "Sony Interactive Entertainment", "release_date": "Aug 29 2017", "developers": ["CCP", "CCP Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/809c9bd6b6893a523f6a41f867842b6b-98.jpg", "descriptions": "Sparc is a vSport - a unique physical sport only possible in virtual reality, in which players compete in fast-paced, full-body VR gameplay and connect in an online community."}, {"name": "LEGO Batman 3: Beyond Gotham", "details_link": "https://www.metacritic.com/game/xbox-one/lego-batman-3-beyond-gotham", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 11 2014", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Modern"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/50c2815c65ca8600a44f998bb6a0a76b-98.jpg", "descriptions": "Batman joins up with the super heroes of the DC Comics universe and blasts off to outer space to stop the evil Brainiac from destroying Earth. Using the power of the Lantern Rings, Brainiac miniaturizes worlds to add to his demented collection of mini cities from around the galaxy. TeBatman joins up with the super heroes of the DC Comics universe and blasts off to outer space to stop the evil Brainiac from destroying Earth. Using the power of the Lantern Rings, Brainiac miniaturizes worlds to add to his demented collection of mini cities from around the galaxy. Te greatest super heroes and the most cunning villains must now unite and travel to different Lantern Worlds to collect the Lantern Rings and stop Brainiac before nothing more can be done.… Expand"}, {"name": "Marvel Pinball 3D", "details_link": "https://www.metacritic.com/game/3ds/marvel-pinball-3d", "publisher": "Zen Studios", "release_date": "Jun 28 2012", "developers": ["Zen Studios"], "platforms": "3DS", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/da18c39fd7a0769b8e15f19640d6743f-98.jpg", "descriptions": "ZEN Studios and Marvel Entertainment are proud to announce Marvel Pinball, an epic collaboration combining the greatest comic book characters of all time with the definitive videogame pinball experience on PlayStation Network and Xbox LIVE Arcade for the Xbox 360 videogame and entertainmentZEN Studios and Marvel Entertainment are proud to announce Marvel Pinball, an epic collaboration combining the greatest comic book characters of all time with the definitive videogame pinball experience on PlayStation Network and Xbox LIVE Arcade for the Xbox 360 videogame and entertainment system from Microsoft. Use your pinball wizardry to help Iron Man, Spider-Man, Wolverine and Blade save the world from the most notorious Super Villains on four beautifully crafted pinball tables. … Expand"}, {"name": "Borderlands: Claptrap's New Robot Revolution", "details_link": "https://www.metacritic.com/game/playstation-3/borderlands-claptraps-new-robot-revolution", "publisher": "2K Games", "release_date": "Sep 28 2010", "developers": ["Gearbox Software"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/6fbe5eb8b0fb5244310a7c5a1091a1bc-98.jpg", "descriptions": "Claptrap's New Robot Revolution invites recruits to attempt to beat down the deadly Claptrap revolution either as a lone gunman or in co-op teams of four treasure hunters using many of the more than 17 million unique weapons available in the game. Brave volunteers will find themselves caughtClaptrap's New Robot Revolution invites recruits to attempt to beat down the deadly Claptrap revolution either as a lone gunman or in co-op teams of four treasure hunters using many of the more than 17 million unique weapons available in the game. Brave volunteers will find themselves caught in the lethal cross hairs between the Hyperion Corporation's fortified armadas and the ever-growing army of homicidal Claptraps and \"Claptrap-ified\" enemies led by one of the most eagerly awaited characters in the franchiseâ€™s history - the cunning Ninja Assassin Claptrap.  … Expand"}, {"name": "Caesar IV", "details_link": "https://www.metacritic.com/game/pc/caesar-iv", "publisher": "Vivendi Games", "release_date": "Sep 26 2006", "developers": ["Tilted Mill"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 74, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/2ac846a2813fa8f701549e74d18731f5-98.jpg", "descriptions": "In Caesar IV you govern a province (and most importantly its capital city) in the Roman Empire. Success yields political advancement, allowing you to take on a new challenge in another province, as you climb the ladder of power in ancient Rome. As city planner, you design and layout eachIn Caesar IV you govern a province (and most importantly its capital city) in the Roman Empire. Success yields political advancement, allowing you to take on a new challenge in another province, as you climb the ladder of power in ancient Rome. As city planner, you design and layout each city in detail, creating road networks to facilitate the distribution of resources, and to provide homes access to entertainment venues, healthcare facilities, fire protection services, and so on. Of course, you must in turn develop these industries and services to meet the needs of your growing population. You control your city's finances, and must quickly turn a profit in your new endeavor or face the wrath of the emperor. You must build a military force and direct the defense of the province against barbarian threats. You must establish far flung trade networks so the exotic wealth of the empire can flow into your province, bringing it fully under the Roman fold. As the city grows from a simple village to a bustling cosmopolitan city, so too do your challenges and responsibilities increase. To achieve your goals as provincial governor in Caesar IV you must consistently provide for your citizens' needs, keep them healthy, happy and safe... and on top of that satisfy the demands of the empire. Your ultimate goal is to rise among the political ranks of the empire, and become Caesar yourself.  [Vivendi Universal]… Expand"}, {"name": "Darkwatch", "details_link": "https://www.metacritic.com/game/playstation-2/darkwatch", "publisher": "Capcom", "release_date": "Aug 16 2005", "developers": ["High Moon Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Fantasy"], "meta_score": 74, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/c77e8195ba2d74497dcabf10b2538047-98.jpg", "descriptions": "The game introduces the Darkwatch, a secret strike-force that has vigilantly protected man from evil incarnate since the dawn of civilization. Their newest and deadliest agent is Jericho Cross, an outlaw gunslinger pulled into their ranks by an unfortunate close encounter with a vampireThe game introduces the Darkwatch, a secret strike-force that has vigilantly protected man from evil incarnate since the dawn of civilization. Their newest and deadliest agent is Jericho Cross, an outlaw gunslinger pulled into their ranks by an unfortunate close encounter with a vampire lord. To save the West, and his own soul from damnation, Jericho must hunt the vampire that bit him through an American frontier suddenly overrun by his undead minions. At his disposal is the advanced, deadly technology of the Darkwatch, including an arsenal of powerful assault vehicles and enhanced versions of Western weapons, along with supernatural vampire abilities and a trusty undead horse. Players will experience an action-packed \"living West\" in \"Darkwatch: Curse of the West\" with massive environments, non-linear missions, dynamic enemy and non-player-character artificial intelligence (A.I.) affected by a player reputation system, and precision gunplay with location-specific damage. [Sammy Studios]… Expand"}, {"name": "Call of Duty: Finest Hour", "details_link": "https://www.metacritic.com/game/gamecube/call-of-duty-finest-hour", "publisher": "Activision", "release_date": "Nov 16 2004", "developers": ["Exakt"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/0856b6a519b7bf96748357a9da8bacf4-98.jpg", "descriptions": "You've been called to defend your Allied country against the Axis foes. In Call of Duty: Finest Hour, you must fight as part of a squad through the chaos of battle. Whether you play as American, British, or Russian forces, you'll discover the hardships that every unsung hero had to faceYou've been called to defend your Allied country against the Axis foes. In Call of Duty: Finest Hour, you must fight as part of a squad through the chaos of battle. Whether you play as American, British, or Russian forces, you'll discover the hardships that every unsung hero had to face during World War II. The game also features authentic weapons, vehicles, environments, combat missions, and the real sounds of war. Finally, the cinematic battlefield conflicts come to life on your gaming console.… Expand"}, {"name": "Nemesis of the Roman Empire", "details_link": "https://www.metacritic.com/game/pc/nemesis-of-the-roman-empire", "publisher": "Enlight Software", "release_date": "Mar 25 2004", "developers": ["Haemimont", "Haemimont Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/8e61217d5541e8fe3fe7e5a32d2afe08-98.jpg", "descriptions": "(Also known as \"The Punic Wars: A Clash of Two Empires\")  In the height of its glory Carthage was the greatest power in the ancient world. With trade routes throughout the entire Mediterranean there the was no other nation to dispute its strength. Goods, gold and slaves poured in to the(Also known as \"The Punic Wars: A Clash of Two Empires\")  In the height of its glory Carthage was the greatest power in the ancient world. With trade routes throughout the entire Mediterranean there the was no other nation to dispute its strength. Goods, gold and slaves poured in to the majestic city ? the source of its might. Countless mercenaries armies were constantly bought to ensure that all who threatened Carthage or its interest would be dealt with. However, another Empire was also on the rise. The city of Rome too had begun to gain strength. The Romans soon decided openly to challenge their Carthaginian rivals. The time of the Punic Wars had begun. [Enlight Software]… Expand"}, {"name": "Counter-Strike", "details_link": "https://www.metacritic.com/game/xbox/counter-strike", "publisher": "Microsoft Game Studios", "release_date": "Nov 18 2003", "developers": ["Valve Software"], "platforms": "Xbox", "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/e0525610abac3f9bfd483c6d32624161-98.jpg", "descriptions": "Counter-Strike, the popular online action game and first-person shooter for the PC, makes its console debut on Xbox and Xbox Live.  Challenge other players in intense team-based multiplayer action in two thrilling game types--Bomb Defusal and Hostage Rescue--via Xbox Live or System Link.Counter-Strike, the popular online action game and first-person shooter for the PC, makes its console debut on Xbox and Xbox Live.  Challenge other players in intense team-based multiplayer action in two thrilling game types--Bomb Defusal and Hostage Rescue--via Xbox Live or System Link.  More than 20 real-life weapons, including shotguns, sniper rifles, pistols, are part of your military artillery.  Get ready for the most graphically advanced version of the Counter-Strike series to date.… Expand"}, {"name": "Law & Order II: Double or Nothing", "details_link": "https://www.metacritic.com/game/pc/law-order-ii-double-or-nothing", "publisher": "Legacy Interactive", "release_date": "Sep 30 2003", "developers": ["Legacy Interactive"], "platforms": "PC", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 74, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/4946aaa330caabe54a2353776d739765-98.jpg", "descriptions": "Law & Order 2: Double or Nothing introduces an all-new story and challenges you to be both Criminal Investigator and District Attorney as you bring a killer to justice! Partner with Detective Lennie Briscoe to investigate the death of a scientist found shot in midtown Manhattan. InterviewLaw & Order 2: Double or Nothing introduces an all-new story and challenges you to be both Criminal Investigator and District Attorney as you bring a killer to justice! Partner with Detective Lennie Briscoe to investigate the death of a scientist found shot in midtown Manhattan. Interview witnesses, interrogate suspects, gather evidence and order lab tests as you unravel entangled love affairs, financial misdeeds and secret identities. Arrest the right murder suspect and test your prosecution powers as you build your case with Assistant D.A. Serena Southerlyn. A successful conviction is up to you! [Vivendi Universal]… Expand"}, {"name": "TransWorld Snowboarding", "details_link": "https://www.metacritic.com/game/xbox/transworld-snowboarding", "publisher": "Atari", "release_date": "Oct 29 2002", "developers": ["Housemarque"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 74, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/990e41d9499311333036422c2ad53be3-98.jpg", "descriptions": "Featuring authentic tricks and 17 true-to-life locations around the world, TransWorld Snowboarding™ gives you the power to jib and grind just like the pros. Perfect your misty flips and switch backside 180s in Freestyle, Halfpipe and Boarder Rally events - or float through deep,Featuring authentic tricks and 17 true-to-life locations around the world, TransWorld Snowboarding™ gives you the power to jib and grind just like the pros. Perfect your misty flips and switch backside 180s in Freestyle, Halfpipe and Boarder Rally events - or float through deep, untouched powder in the backcountry. Trick and huck off all kinds of kickers, tables, pipes, downed trees, ice blocks and more! And remember to save your best stuff for the photographers who just might put you on the in-game cover of TransWorld Snowboarding™ magazine.… Expand"}, {"name": "Spyro: Season of Ice", "details_link": "https://www.metacritic.com/game/game-boy-advance/spyro-season-of-ice", "publisher": "VU Games", "release_date": "Oct 29 2001", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/01dd9bc4d2b03b11f4366d6d765f1cd6-98.jpg", "descriptions": "Hold Spyro in the palm of your hand! A careless wizard has cursed himself with a big headache and itsthe wings of 100 fairies he nees for the cure. Now it is up to Spyro to save the fairies and restore order to the dragon realms!"}, {"name": "Hot Potato!", "details_link": "https://www.metacritic.com/game/game-boy-advance/hot-potato!", "publisher": "Bam Entertainment", "release_date": "Jul  1 2001", "developers": ["Pukka Games"], "platforms": "Game Boy Advance", "genres": ["Action", "General"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/ef7cf39c1dbf835ef72991e35fd931ee-98.jpg", "descriptions": "Silly spuds from outer space have taken over the streets and are waiting for someone to take them home. Now the rescure party arrives and the real fun begins! Pilot the sled through the streets to match up the male potato with his mate! Evacuate as many of the shipwrecked spuds as possibleSilly spuds from outer space have taken over the streets and are waiting for someone to take them home. Now the rescure party arrives and the real fun begins! Pilot the sled through the streets to match up the male potato with his mate! Evacuate as many of the shipwrecked spuds as possible as you guide your sled to the escape rocket. Clear the streets of the invaders and help save the Earth once and for all!… Expand"}, {"name": "Vampire: The Masquerade - Redemption", "details_link": "https://www.metacritic.com/game/pc/vampire-the-masquerade---redemption", "publisher": "Activision", "release_date": "Jun  7 2000", "developers": ["Nihilistic"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 74, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/700db7b25d9886943067bf691815d79c-98.jpg", "descriptions": "Your unholy showdown begins in Europe and rages on into the modern day as you track a soulless enemy in an eternal struggle to destroy him.  [Activision]"}, {"name": "Castlevania: Curse of Darkness", "details_link": "https://www.metacritic.com/game/xbox/castlevania-curse-of-darkness", "publisher": "Konami", "release_date": "Nov  1 2005", "developers": ["Konami"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/72792dad3cba4a1c6430e18ddd3c04e6-98.jpg", "descriptions": "The Castlevania series gets a new protagonist in the form of Hector, a Devil Forgemaster, in Castlevania: Curse of Darkness. Hector left Dracula's service to lead a normal life, leaving Dracula vulnerable to attack by the Belmonts. Now that Dracula has been vanquished, you must fight backThe Castlevania series gets a new protagonist in the form of Hector, a Devil Forgemaster, in Castlevania: Curse of Darkness. Hector left Dracula's service to lead a normal life, leaving Dracula vulnerable to attack by the Belmonts. Now that Dracula has been vanquished, you must fight back the unholy curse that has spread across Europe. You can use your skills as a Devil Forgemaster to craft familiars that will help you during your travels. Castlevania: Curse of Darkness provides role-playing game and adventure elements, letting your character grow as he progresses through the story.… Expand"}, {"name": "Game of Thrones: Episode Five - A Nest of Vipers", "details_link": "https://www.metacritic.com/game/pc/game-of-thrones-episode-five---a-nest-of-vipers", "publisher": "Telltale Games", "release_date": "Jul 21 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 74, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/6265c3d6aab4991838c057349b8cc1cc-98.jpg", "descriptions": "In this penultimate episode, the actions of every Forrester are vital to the survival of the house. Rodrik's alliance with House Glenmore, and his defiance of the Whitehills, has drawn the ire of an even greater threat: Ramsay Snow. Far across the Narrow Sea in Essos, with Meereen now a freeIn this penultimate episode, the actions of every Forrester are vital to the survival of the house. Rodrik's alliance with House Glenmore, and his defiance of the Whitehills, has drawn the ire of an even greater threat: Ramsay Snow. Far across the Narrow Sea in Essos, with Meereen now a free city, Asher is close to securing the army he desperately needs to return home, and save his family. In King's Landing, Mira's activities at Tommen's coronation have not escaped the attention of Margaery Tyrell, and Cersei has realized that the handmaiden may prove useful in her political games. Finally, beyond the Wall, Gared's unlikely allies are reluctant to help in the search for the North Grove... but this far into the frozen wilds, Crows and Free Folk have a common enemy; and winter is coming.… Expand"}, {"name": "FIFA 21 NXT LVL EDITION", "details_link": "https://www.metacritic.com/game/playstation-5/fifa-21-nxt-lvl-edition", "publisher": "Electronic Arts", "release_date": "Dec  4 2020", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 74, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/9/09c34f51e39f0e5d1c47d494eda0fe9f-98.jpg", "descriptions": "On the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new AgileOn the street and in the stadium, FIFA 21 has more ways to play than ever before.  FIFA 21 rewards you for your creativity and control all over the pitch. Create more scoring opportunities with all-new dynamic attacking systems in the most intelligent FIFA gameplay to date. A new Agile Dribbling system gives you the means to unleash your creativity in 1-on-1 situations. Use fast footwork, more responsive close control, and new skill moves like the ball roll fake to explode past defenders. In FIFA 21, increased positional awareness elevates footballers’ in-game intelligence to put them in the right place at the right time. See world-class forwards hold their runs in line with the last defender, creative playmakers find space to play through balls, and midfielders shut off passing lanes as players better live up to their real-world understanding of space and time on the pitch. [Electronic Arts]… Expand"}, {"name": "Puzzlegeddon", "details_link": "https://www.metacritic.com/game/pc/puzzlegeddon", "publisher": "Pieces Interactive", "release_date": "Nov 27 2008", "developers": ["Pieces Interactive"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "1-6 ", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/4be3939f23123c87125877d969ddaae5-98.jpg", "descriptions": "Puzzlegeddon features an inventive mix of puzzle, action and strategy. Select your island of choice and puzzle for resources to defend yourself and to defeat opponents throughout the many galaxies, game modes and challenges which awaits you in Puzzlegeddon. Join the battles online inPuzzlegeddon features an inventive mix of puzzle, action and strategy. Select your island of choice and puzzle for resources to defend yourself and to defeat opponents throughout the many galaxies, game modes and challenges which awaits you in Puzzlegeddon. Join the battles online in multiplayer games for up to 6 players. Fight evil robots or puzzle for survival on a poisonous planet in the game's challenging and addictive single player modes. Puzzlegeddon is a game for all tastes and play styles which challenges players both to think hard, play smart and act fast. [Pieces Interactive]… Expand"}, {"name": "Outlaw Golf 2", "details_link": "https://www.metacritic.com/game/xbox/outlaw-golf-2", "publisher": "Global Star Software", "release_date": "Oct 21 2004", "developers": ["Hypnotix"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/80c01ca4ebfcdbf6facca5b3732c7c93-98.jpg", "descriptions": "The crude cast of Outlaw Golf is back with new friends, courses, fighting moves, and more. Choose from 11 wild characters--including babes, rappers, and thugs--and take on the challenges from eight courses, ranging from the arctic to the jungle. By playing through the tour and winningThe crude cast of Outlaw Golf is back with new friends, courses, fighting moves, and more. Choose from 11 wild characters--including babes, rappers, and thugs--and take on the challenges from eight courses, ranging from the arctic to the jungle. By playing through the tour and winning events, you can unlock more clubs, balls, and outfits. In addition to tournament mode, the game features match, time attack, and baseball golf modes. Just remember--even if your golf game is off, you can still beat up your opponents, or even your caddy. … Expand"}, {"name": "The Outer Worlds: Peril on Gorgon", "details_link": "https://www.metacritic.com/game/pc/the-outer-worlds-peril-on-gorgon", "publisher": "Private Division", "release_date": "Sep  9 2020", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 74, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/32f8cd1056b83dad96095a9d178d2b6e-98.jpg", "descriptions": "The Outer Worlds: Peril on Gorgon takes place on the Gorgon asteroid, which was the site of one of the most ambitious scientific undertakings in Halcyon: the development and synthesis of Adrena-Time, a drug intended to improve the productivity of workers across the Halcyon colony."}, {"name": "PlayStation All-Stars Battle Royale", "details_link": "https://www.metacritic.com/game/playstation-3/playstation-all-stars-battle-royale", "publisher": "SCEA", "release_date": "Nov 20 2012", "developers": ["SuperBot Entertainment"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/33dd067530a80fdacbba14f22b1dcc4f-98.jpg", "descriptions": "Battle Royale is a brawler featuring a broad array of PlayStation characters and worlds. From Kratos to Sly Cooper, Sweet Tooth to Parappa the Rapper, Sony characters from throughout Sony history are brought together in a brawling adventure that's simple to pick up and tough to master. BringBattle Royale is a brawler featuring a broad array of PlayStation characters and worlds. From Kratos to Sly Cooper, Sweet Tooth to Parappa the Rapper, Sony characters from throughout Sony history are brought together in a brawling adventure that's simple to pick up and tough to master. Bring the battle online for competitive multiplayer fury, or go head to head with a group of opponents at your pad to prove who's the top dog.… Expand"}, {"name": "Narita Boy", "details_link": "https://www.metacritic.com/game/pc/narita-boy", "publisher": "Team17", "release_date": "Mar 30 2021", "developers": ["Studio Koba"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/31d898e047fc8b87d70dcd10c1d3a656-98.jpg", "descriptions": "Become symphonic in Narita Boy! A radical action-adventure as a legendary pixel hero trapped as a mere echo within the Digital Kingdom. Discover the mysteries behind the Techno-sword, lock swords with the corrupt and tainted Stallions. Save the world!"}, {"name": "PQ2: Practical Intelligence Quotient", "details_link": "https://www.metacritic.com/game/psp/pq2-practical-intelligence-quotient", "publisher": "D3Publisher", "release_date": "Jun 18 2007", "developers": ["Now Production"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 74, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/674543f36b3b5638849291bdd2d826cc-98.jpg", "descriptions": "PQ2 helps players calculate their intelligence by using the PQ scoring system based on the number of moves and the speed with which they complete more than 250 puzzles. PQ2 players use the PSP system's infrastructure mode to take their score online to measure their brain power against theirPQ2 helps players calculate their intelligence by using the PQ scoring system based on the number of moves and the speed with which they complete more than 250 puzzles. PQ2 players use the PSP system's infrastructure mode to take their score online to measure their brain power against their friends, their country and even their gender. PQ2 uses a measuring system that was created under the guidance of Professor Masuo Koyasu of Kyoto University in Japan that determines players' \"Practical Intelligence Quotient\" or PQ. Players create their own puzzles and share with friends utilizing the PSP system's gamesharing mode or utilize infrastructure mode to upload puzzles and download new ones. PQ2 allows players the flexibility to choose which puzzles they want to play first and the ability to get a preliminary PQ score in roughly 10 minutes or play through the full puzzle set, including 10 unlockable puzzles, for their full PQ score. [D3 Publisher of America]… Expand"}]