[{"name": "Underrail", "details_link": "https://www.metacritic.com/game/pc/underrail", "publisher": "Stygian Software", "release_date": "Dec  5 2012", "developers": ["Stygian Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/21d2206d54ee8a031f0c7b53bbfe5d8e-98.jpg", "descriptions": "Underrail is an old-school turn-based isometric indie role playing game that focuses on exploration and combat. The game is set in a distant future, when the life on the Earth’s surface has long since been made impossible and the remnants of humanity now dwell in the Underrail, a vast systemUnderrail is an old-school turn-based isometric indie role playing game that focuses on exploration and combat. The game is set in a distant future, when the life on the Earth’s surface has long since been made impossible and the remnants of humanity now dwell in the Underrail, a vast system of metro station-states.… Expand"}, {"name": "Wallace & Gromit's Grand Adventures, Episode 2: The Last Resort", "details_link": "https://www.metacritic.com/game/pc/wallace-gromits-grand-adventures-episode-2-the-last-resort", "publisher": "Telltale Games", "release_date": "May  5 2009", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "Xbox 360", "PC"], "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e98002d73cf5b40a61ae0c757ad3c76d-98.jpg", "descriptions": "When unrelenting rain ruins their holiday plans, Wallace & Gromit bring the beach to 62 West Wallaby with a makeshift resort — in their basement. Keeping customers satisfied is tricky business, especially when one of them is clocked on the head by an unknown assailant. Whodunnit? Find out...When unrelenting rain ruins their holiday plans, Wallace & Gromit bring the beach to 62 West Wallaby with a makeshift resort — in their basement. Keeping customers satisfied is tricky business, especially when one of them is clocked on the head by an unknown assailant. Whodunnit? Find out... with a little help from Wallace's latest invention, the Deduct-o-matic! [TellTale Games]… Expand"}, {"name": "Disney's Chicken Little: Ace in Action", "details_link": "https://www.metacritic.com/game/wii/disneys-chicken-little-ace-in-action", "publisher": "Buena Vista Games", "release_date": "Dec 11 2006", "developers": ["Avalanche Software"], "platforms": ["PC", "PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/456f36f5da2953e05f9a612e0a4b8e71-98.jpg", "descriptions": "Inspired by the \"superhero movie within the movie\" finale of Walt Disney Pictures'  film \"Chicken Little,\" Disney\"s Chicken Little: Ace in Action features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends:  Runt, Abby andInspired by the \"superhero movie within the movie\" finale of Walt Disney Pictures'  film \"Chicken Little,\" Disney\"s Chicken Little: Ace in Action features Ace, the superhero alter ego of Chicken Little, and the Hollywood versions of his misfit band of friends:  Runt, Abby and Fish-Out-of-Water. The crew of the intergalactic Battle Barn faces off against Foxy Loxy and her evil Amazonian sidekick, Goosey Loosey, who have an evil plan to take over Earth. Battle evil alien robots through multiple levels across the solar system and combat your foes in one of three distinct game play modes: Ace on foot as a soldier, Runt as the driver of an armored tank, or Abby as the pilot of a spaceship.  The original Chicken Little and his friends Abby, Runt and Fish we know from the film are featured in cut scenes throughout the game. [Buena Vista Games]… Expand"}, {"name": "Book of Demons", "details_link": "https://www.metacritic.com/game/pc/book-of-demons", "publisher": "Thing Trunk", "release_date": "Dec 13 2018", "developers": ["Thing Trunk"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "Action RPG", "Point-and-Click"], "meta_score": 72, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/2/896e19557f1d7e219c47cce113913cac-98.jpg", "descriptions": "Book of Demons is a Hack & Slash Deck-building hybrid in which YOU decide the length of quests. Wield magic cards instead of weapons and slay the armies of darkness in the dungeons below the Old Cathedral. Save the terror-stricken Paperverse from the clutches of the Archdemon himself."}, {"name": "Worms: Battle Islands", "details_link": "https://www.metacritic.com/game/psp/worms-battle-islands", "publisher": "Team17", "release_date": "Nov 22 2010", "developers": ["Team17"], "platforms": "PSP", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/46c3ad4f08735ffa431499459ade564a-98.jpg", "descriptions": "Rally your worm troops, plot to defeat your enemies and battle your way through 30 single-player campaign mode missions, 30 brain teasing single-player Puzzle challenges and five different multiplayer game modes on or offline as you fight to take control of a secret island Worms base.Rally your worm troops, plot to defeat your enemies and battle your way through 30 single-player campaign mode missions, 30 brain teasing single-player Puzzle challenges and five different multiplayer game modes on or offline as you fight to take control of a secret island Worms base.  Packed with more than 40 different in-game weapons and utilities, a deep customization tool set that allows users to personalize their Worms appearance and create their own weapons of mass destruction in the weapon factory, Worms: Battle Islands will quench all gamers thirst for ammo and destruction. … Expand"}, {"name": "Justice League Heroes", "details_link": "https://www.metacritic.com/game/psp/justice-league-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 22 2006", "developers": ["Snowblind Studios"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/00d14dc90025a27b6c4b71244ff89c4e-98.jpg", "descriptions": "Justice League Heroes is an action adventure game with role-playing customization featuring Superman, Batman, Green Lantern, The Flash, Wonder Woman, Martian Manhunter, Zatanna and other unlockable Justice League super heroes. Each hero possesses an array of character-specific, upgradeableJustice League Heroes is an action adventure game with role-playing customization featuring Superman, Batman, Green Lantern, The Flash, Wonder Woman, Martian Manhunter, Zatanna and other unlockable Justice League super heroes. Each hero possesses an array of character-specific, upgradeable superpowers resulting in unique controls and fighting-styles. Engaging in one-to-two player cooperative combat, gamers are be able to customize and master these superpowers as they travel through interactive and destructible environments spanning the farthest corners of the universe. [Eidos Interactive]… Expand"}, {"name": "Namco Museum", "details_link": "https://www.metacritic.com/game/switch/namco-museum", "publisher": "Bandai Namco Games", "release_date": "Jul 28 2017", "developers": ["Namco", "Bandai Namco Games"], "platforms": ["PlayStation 2", "Switch"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/70557246b6892f7eb43e4079eae8d8fb-98.jpg", "descriptions": "Includes Namco classics such as PAC-MAN™, GALAGA™, SPLATTERHOUSE™, and TOWER OF DRUAGA™, or play games such as ROLLING THUNDER ™, SKYKID™, or TANK FORCE™ with friends and family on the Nintendo Switch."}, {"name": "Dark Sector", "details_link": "https://www.metacritic.com/game/playstation-3/dark-sector", "publisher": "D3Publisher", "release_date": "Mar 25 2008", "developers": ["Digital Extremes"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Sci-Fi", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/541e35c51b7c65e546a5ddabb63a1f19-98.jpg", "descriptions": "An all-new and original action-thriller designed exclusively for next-generation consoles, Dark Sector thrusts players into the role of Hayden Tenno, an elite black-ops agent sent on a dangerous mission into a decaying Eastern European city that hides a deadly Cold War secret. Attacked by anAn all-new and original action-thriller designed exclusively for next-generation consoles, Dark Sector thrusts players into the role of Hayden Tenno, an elite black-ops agent sent on a dangerous mission into a decaying Eastern European city that hides a deadly Cold War secret. Attacked by an unknown enemy, he awakens to find part of his body altered by an infection that has granted him inhuman abilities and he must learn to evolve along with his powers, to survive and to become a hero. A dark, gritty experience packed with fast action, incredible superpowers and an engaging story. [D3Publisher of America]… Expand"}, {"name": "Dead Rising 2: Off the Record", "details_link": "https://www.metacritic.com/game/playstation-3/dead-rising-2-off-the-record", "publisher": "Capcom", "release_date": "Oct 11 2011", "developers": ["Capcom Vancouver"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Horror", "Horror", "Open-World"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/def06cabed14446a9ca49258c518acc1-98.jpg", "descriptions": "Dead Rising 2: Off the Record, sees photojournalist and original hero of Dead Rising's Willamette incident, Frank West take center stage as players experience a reimagining of the Fortune City outbreak. Forget what you know about Dead Rising 2,\"Frank West is back in the game!\" The new, \"OffDead Rising 2: Off the Record, sees photojournalist and original hero of Dead Rising's Willamette incident, Frank West take center stage as players experience a reimagining of the Fortune City outbreak. Forget what you know about Dead Rising 2,\"Frank West is back in the game!\" The new, \"Off the Record\" storyline means an all new Dead Rising 2 experience. Frank will face off against more twisted enemies, build more outrageous combo weapons, follow his own unique mission structure and explore brand new areas of Fortune City to get his biggest scoop yet. Frank's come back means the return of his trusty camera, with players able to earn Prestige Points (PP) for specific photo opportunities that are graded against criteria such as horror, drama, erotica and brutality. In addition to the new scenario and gameplay enhancements, Dead Rising 2: Off the Record offers a suite of technical updates including load time optimizations, improved network performance and a host of system upgrades to deliver a more satisfying Dead Rising experience. … Expand"}, {"name": "Endless Ocean", "details_link": "https://www.metacritic.com/game/wii/endless-ocean", "publisher": "Nintendo", "release_date": "Jan 21 2008", "developers": ["Arika"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/ea3eb833b65465e7ecaf5143502fb6c2-98.jpg", "descriptions": "The beauty of Endless Ocean is that players can do as much or as little as they like. The relaxed and calm atmosphere of the game gives divers the freedom to explore special locations such as shipwrecks and underwater ruins, discover and interact with sea-life, complete fish logs or simplyThe beauty of Endless Ocean is that players can do as much or as little as they like. The relaxed and calm atmosphere of the game gives divers the freedom to explore special locations such as shipwrecks and underwater ruins, discover and interact with sea-life, complete fish logs or simply relax in the soothing environment. The game opens with players onboard a diving boat, with a crew member who provides advice and tips on finding the best locations for fish and helps players advance the storyline. Players must assume the role of the diver, opting to go into the water to explore sea-life at their own pace utilising tools such as a camera or fish bait. In the cabin on the boat, divers can access the fish log to check out the fish that have been spotted, as well as carry out missions like photographing marine life. These missions unlock content, such as new items to use underwater, or different diving gear that can be used to customize the diver. Navigating their way through the depths using the Wii remote, players guide their character using the pointer's cursor, visible as a bright blue dot. When players wish to interact with fish or plants they can highlight them with the pointer and press the A Button. By doing so, players discover new species and build up their fish log. What's more you can also befriend companions like a dolphin which will become your partner and with whom you can train and swim with. [Nintendo]… Expand"}, {"name": "Outriders Worldslayer", "details_link": "https://www.metacritic.com/game/playstation-5/outriders-worldslayer", "publisher": "Square Enix", "release_date": "Jun 30 2022", "developers": ["People Can Fly"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 72, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/4bcacd6d4b20998ea6060ddc3c137415-98.jpg", "descriptions": "OUTRIDERS is a story driven RPG-Shooter that will put the player in the shoes of an Outrider, the last hope of the human race trapped on Enoch, a dangerous and untamed planet. The campaign can be played entirely in single player, or in co-op with up to three players. Outriders Worldslayer isOUTRIDERS is a story driven RPG-Shooter that will put the player in the shoes of an Outrider, the last hope of the human race trapped on Enoch, a dangerous and untamed planet. The campaign can be played entirely in single player, or in co-op with up to three players. Outriders Worldslayer is a new expansion that takes place directly after the events of the main campaign. In it, you and up to 2 other players must travel to the far reaches of Enoch to battle a new threat known as Ereshkigal, a dark overlord, and the main villain of the expansion.… Expand"}, {"name": "Need for Speed Heat", "details_link": "https://www.metacritic.com/game/playstation-4/need-for-speed-heat", "publisher": "Electronic Arts", "release_date": "Nov  8 2019", "developers": ["Ghost Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 72, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/725a8986026e6d5f50f3ffdbf5241a1e-98.jpg", "descriptions": "Hustle by day and risk it all at night in Need for Speed Heat, a white-knuckle racer that pits you against a city's rogue police force as you battle your way into street racing's elite. By day compete in the Speedhunter Showdown -- a sanctioned competition where you earn bank to customizeHustle by day and risk it all at night in Need for Speed Heat, a white-knuckle racer that pits you against a city's rogue police force as you battle your way into street racing's elite. By day compete in the Speedhunter Showdown -- a sanctioned competition where you earn bank to customize and upgrade your garage of high-performance cars. When your ride's perfectly styled and hyper-tuned, and you're ready to ramp up the intensity, drive out into the night where you and your crew take on the competition in illicit street races that build your reputation and grant you access to bigger races and better parts. But under the cover of darkness patrols a rogue task force looking to bring you down and swipe all you've earned. Take them on and risk it all for underground glory or head back to your safehouse and begin another thrilling day. The roads, the risks, and the rides never end in this street racer where your crew rolls deep, your garage is full of hot cars, and the city's your nonstop playground.… Expand"}, {"name": "Shadows: Awakening", "details_link": "https://www.metacritic.com/game/playstation-4/shadows-awakening", "publisher": "Kalypso", "release_date": "Sep  4 2018", "developers": ["Kalypso"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Western-Style"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/56aa3ea4014ed32a823e787740b7ddf8-98.jpg", "descriptions": "Shadows: Awakening is an isometric single-player RPG with real-time tactical combat. You take control of a demon summoned from the Shadow Realm to consume the souls of long-dead heroes and embark on an epic adventure."}, {"name": "Spintires: Mudrunner", "details_link": "https://www.metacritic.com/game/xbox-one/spintires-mudrunner", "publisher": "Maximum Games", "release_date": "Oct 31 2017", "developers": ["Maximum Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 72, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/e64d5ef90dc1b7b0dd99fac8dbff4e59-98.jpg", "descriptions": "Spintires: MudRunner is the ultimate version of the million-seller indie hit Spintires. Like Spintires before it, Spintires: MudRunner puts players in the driver seat and dares them to take charge of incredible all-terrain vehicles, venturing across extreme Siberian landscapes with only aSpintires: MudRunner is the ultimate version of the million-seller indie hit Spintires. Like Spintires before it, Spintires: MudRunner puts players in the driver seat and dares them to take charge of incredible all-terrain vehicles, venturing across extreme Siberian landscapes with only a map and compass as guides!\r A huge upgrade over its predecessor, this edition comes complete with a brand new Sandbox Map joining the original game's 5 environments, a total graphical overhaul, a new Challenge mode with 9 new dedicated maps, 13 new vehicles and other comprehensive improvements. It's not just an enhanced edition, it's the ultimate off-road simulation experience!\r Drive 19 powerful all-terrain vehicles, each with its own characteristics and attachable equipment. Complete your objectives and deliveries by enduring perilous conditions across wild, untamed landscapes in extreme conditions with dynamic day-night cycles. Explore an immersive sandbox environment, enhanced by improved graphics. Overcome muddy terrain, raging rivers and other obstacles that all realistically react to the weight and movement of your vehicle powered by the game's advanced physics engine.\r With your map, compass, winch, and your driving skills as allies, go solo or join up to three others in the coop multiplayer. Download mods created by the passionate community for truck-loads of content and an ever-evolving Spintires: MudRunner experience.… Expand"}, {"name": "Star Wars Battlefront", "details_link": "https://www.metacritic.com/game/pc/star-wars-battlefront", "publisher": "Electronic Arts", "release_date": "Nov 17 2015", "developers": ["EA DICE"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["General", "General", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 72, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/9/6837004d171f75826d006254521981b2-98.jpg", "descriptions": "Star Wars Battlefront lets players live out a broad array of heroic moments and intense battle fantasies of their own – firing blasters, riding speeder bikes and snow speeders, commanding AT-ATs and piloting TIE fighters and the Millennium Falcon. These battles will take place on the iconicStar Wars Battlefront lets players live out a broad array of heroic moments and intense battle fantasies of their own – firing blasters, riding speeder bikes and snow speeders, commanding AT-ATs and piloting TIE fighters and the Millennium Falcon. These battles will take place on the iconic planets of the Star Wars universe, including Endor, Hoth, Tatooine and the previously unexplored planet, Sullust. Gamers can play as the memorable characters from the original trilogy such as Darth Vader and Boba Fett. Star Wars Battlefront features a wide range of modes tailored for different types of battles, from larger 40-person competitive multiplayer to crafted missions that are played solo, with a partner via split-screen offline or co-operatively online. [EA/Lucasfilm] … Expand"}, {"name": "Killzone: Shadow Fall - Intercept", "details_link": "https://www.metacritic.com/game/playstation-4/killzone-shadow-fall---intercept", "publisher": "SCEA", "release_date": "Jun 24 2014", "developers": ["Guerrilla"], "platforms": "PlayStation 4", "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/e6aab340ecbee2eae1613d5a08335828-98.jpg", "descriptions": "In this online co-op expansion for Killzone Shadow Fall, you and three of your friends are tasked with establishing a secure uplink to VSA headquarters from behind enemy lines while fending off an army of Helghast soldiers. To complete your mission, the four of you will have to rely on solidIn this online co-op expansion for Killzone Shadow Fall, you and three of your friends are tasked with establishing a secure uplink to VSA headquarters from behind enemy lines while fending off an army of Helghast soldiers. To complete your mission, the four of you will have to rely on solid teamwork and make the most of your unique combat roles.… Expand"}, {"name": "Cognition: An Erica Reed Thriller Episode 2 - The Wise Monkey", "details_link": "https://www.metacritic.com/game/pc/cognition-an-erica-reed-thriller-episode-2---the-wise-monkey", "publisher": "Phoenix Online Studios", "release_date": "Jan 30 2013", "developers": ["Phoenix Online Studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/e652a264ab252aebed47cdcdcad91f0b-98.jpg", "descriptions": "When someone close to Erica is kidnapped by the Wise Monkey, a serial killer fixated on the gruesome mutilation of their victims, Erica is in a race against time to save her life. With the Wise Monkey case in her hands and the FBI's resources already stretched thin, she’s on her own to findWhen someone close to Erica is kidnapped by the Wise Monkey, a serial killer fixated on the gruesome mutilation of their victims, Erica is in a race against time to save her life. With the Wise Monkey case in her hands and the FBI's resources already stretched thin, she’s on her own to find the killer before it's too late - again.… Expand"}, {"name": "Test Drive: Eve of Destruction", "details_link": "https://www.metacritic.com/game/xbox/test-drive-eve-of-destruction", "publisher": "Atari", "release_date": "Aug 25 2004", "developers": ["Monster Games Inc."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Demolition Derby"], "meta_score": 72, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/ba1f2895b2e7eb5e5b7bab2b257781f8-98.jpg", "descriptions": "Having the fastest car doesn't guarantee you success in Test Drive: Eve of Destruction. If you can take out your opponents while minimizing damage to your own vehicle, you'll be the last one standing in 25 events, including Demo Derby, Suicide Race, and Figure 8 Race. Choose from more thanHaving the fastest car doesn't guarantee you success in Test Drive: Eve of Destruction. If you can take out your opponents while minimizing damage to your own vehicle, you'll be the last one standing in 25 events, including Demo Derby, Suicide Race, and Figure 8 Race. Choose from more than 12 racing venues and a variety of vehicles, such as buses, hearses, and ambulances, and fight to the finish in single-player races or split-screen multiplayer battles.… Expand"}, {"name": "Sword of Mana", "details_link": "https://www.metacritic.com/game/game-boy-advance/sword-of-mana", "publisher": "Nintendo", "release_date": "Dec  1 2003", "developers": ["Brownie Brown"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/ae44158a714c3632bace252844c754d7-98.jpg", "descriptions": "Fans of Secret of Mana have waited over ten years for a successor to Square's SNES role-playing game, and now it's here.  Sword of Mana shares the art style and action-oriented gameplay of its predecessor, but boasts a huge game environment, a new gripping storyline, and a deep class andFans of Secret of Mana have waited over ten years for a successor to Square's SNES role-playing game, and now it's here.  Sword of Mana shares the art style and action-oriented gameplay of its predecessor, but boasts a huge game environment, a new gripping storyline, and a deep class and upgrade system.  You'll choose between playing a man or a female hero and slay enemies to upgrade your abilities.  Sword of Mana blends its fast action and depth with classic RPG style and fun.… Expand"}, {"name": "Disciples II: Guardians of the Light", "details_link": "https://www.metacritic.com/game/pc/disciples-ii-guardians-of-the-light", "publisher": "Strategy First", "release_date": "Jun 14 2003", "developers": ["Strategy First"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 72, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/1f100dae068489f50ca17103d64bd6a9-98.jpg", "descriptions": "A stand-alone expansion that lets you dive into the fantastical world of Disciples II as either the Empire or the Mountain Clans. In Guardians of the Light, the Empire is decaying from within as self-proclaimed rulers struggle for control of the now vacant throne while a cruel InquisitionA stand-alone expansion that lets you dive into the fantastical world of Disciples II as either the Empire or the Mountain Clans. In Guardians of the Light, the Empire is decaying from within as self-proclaimed rulers struggle for control of the now vacant throne while a cruel Inquisition sweeps across the human lands, causing rebellion and misery. Meanwhile the Clans, recovering from their near-destruction, begin to reunite their tribes. They have received divine instructions and now seek to uncover an ancient ritual that will let them communicate with their god, Wotan. [Strategy First]… Expand"}, {"name": "Hearts of Iron", "details_link": "https://www.metacritic.com/game/pc/hearts-of-iron", "publisher": "Strategy First", "release_date": "Nov 24 2002", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/de28ecc4b2fa2187a18abffa8fb62391-98.jpg", "descriptions": "Hearts of Iron is the first ever World War II PC game of true Grand Strategic scope. The game map spans the entire world and allows players to take the War to any new front of their choosing. Any nation in the world is playable, but the game focuses on the epic struggle between the greatHearts of Iron is the first ever World War II PC game of true Grand Strategic scope. The game map spans the entire world and allows players to take the War to any new front of their choosing. Any nation in the world is playable, but the game focuses on the epic struggle between the great alliances of the new world orders Fascism, Communism and Democracy. Hearts of Iron is developed by the team behind the award-winning sales success Europa Universalis I and II and brings the same depth of gameplay and historical accuracy to a modern day gaming experience. Hearts of Iron aims to be no less than the definitive World War II strategic experience. [Strategy First]… Expand"}, {"name": "NFL Blitz 20-03", "details_link": "https://www.metacritic.com/game/xbox/nfl-blitz-20-03", "publisher": "Midway", "release_date": "Aug 12 2002", "developers": ["Point of View"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/bd29ead33c999b602bd06628845bb7b1-98.jpg", "descriptions": "NFL Blitz returns to the field with it unique brand of hard hits, wild moves, and flying tackles. In this year's installment, you can create your own player and take on the best the NFL has to offer. The game features all your favorite teams, players, and stadiums--all of which are broughtNFL Blitz returns to the field with it unique brand of hard hits, wild moves, and flying tackles. In this year's installment, you can create your own player and take on the best the NFL has to offer. The game features all your favorite teams, players, and stadiums--all of which are brought to life with more than 1,500 new animations. Take control of real players with ripped physiques and real faces, or have fun with fantasy players in imagined locales. … Expand"}, {"name": "NFL Blitz 20-03", "details_link": "https://www.metacritic.com/game/gamecube/nfl-blitz-20-03", "publisher": "Midway", "release_date": "Aug 12 2002", "developers": ["Point of View"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/44815ee83344fed04ee47414bb138415-98.jpg", "descriptions": "NFL Blitz returns to the field with it unique brand of hard hits, wild moves, and flying tackles. In this year's installment, you can create your own player and take on the best the NFL has to offer. The game features all your favorite teams, players, and stadiums--all of which are broughtNFL Blitz returns to the field with it unique brand of hard hits, wild moves, and flying tackles. In this year's installment, you can create your own player and take on the best the NFL has to offer. The game features all your favorite teams, players, and stadiums--all of which are brought to life with more than 1,500 new animations. Take control of real players with ripped physiques and real faces, or have fun with fantasy players in imagined locales. … Expand"}, {"name": "Silpheed: The Lost Planet", "details_link": "https://www.metacritic.com/game/playstation-2/silpheed-the-lost-planet", "publisher": "Working Designs", "release_date": "Apr 23 2001", "developers": ["Treasure"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/d33da632ab6e0c4a580e663a9ac63506-98.jpg", "descriptions": "Not officially developed by Treasure, this two-dimensinal, gorgeous vertically-scrolling shoot-'em-up from Game Arts features nine weopons gained and powered-up in the traditional, scrolling manner.  Stop reading...start blasting!"}, {"name": "RC Revenge", "details_link": "https://www.metacritic.com/game/playstation/rc-revenge", "publisher": "Acclaim", "release_date": "Aug 16 2000", "developers": ["Acclaim"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/dec7740ea4a78463d977a39e7a80db89-98.jpg", "descriptions": "RC Revenge is intensely playable and highly polished - a far cry from its predecessor."}, {"name": "A New Beginning - Final Cut", "details_link": "https://www.metacritic.com/game/pc/a-new-beginning---final-cut", "publisher": "Daedalic Entertainment", "release_date": "Dec 11 2012", "developers": ["Daedalic Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/3fdb319ce63c3f3fc32d784058d9a0af-98.jpg", "descriptions": "In the eco-thriller A New Beginning from Daedalic Entertainment, Fay teams up with scientist Bent Svensson to try and stem the tide of the ecological disaster that causes the extinction of mankind. Players will experience an absorbing adventure about the most important issue of our times. AtIn the eco-thriller A New Beginning from Daedalic Entertainment, Fay teams up with scientist Bent Svensson to try and stem the tide of the ecological disaster that causes the extinction of mankind. Players will experience an absorbing adventure about the most important issue of our times. At locations around the globe, it is up to them to change the course of history - with the whole world hanging in the balance.… Expand"}, {"name": "Convoy", "details_link": "https://www.metacritic.com/game/pc/convoy", "publisher": "Indietopia Games", "release_date": "Apr 21 2015", "developers": ["Convoy Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Roguelike"], "meta_score": 72, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/cff6ecb7b3afd7d892e2ce51395d6503-98.jpg", "descriptions": "Convoy is a tactical roguelike-like inspired by Mad Max and FTL in which you cross a wasteland in search of parts for your broken ship. Presented in pixel art and set in a future post-apocalyptic setting, Convoy is a squad based tactical combat roguelike-like in its core."}, {"name": "Pokemon Scarlet", "details_link": "https://www.metacritic.com/game/switch/pokemon-scarlet", "publisher": "Nintendo", "release_date": "Nov 18 2022", "developers": ["Game Freak"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 72, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/0/01f9bb07b979fe4f7ac381ecf6fed139-98.jpg", "descriptions": "The Pokémon Scarlet and Pokémon Violet games, the newest chapters in the Pokémon series, are coming to Nintendo Switch. With these new titles, the Pokémon series takes a new evolutionary step, allowing you to explore freely in a richly expressed open world.  Various towns blend seamlesslyThe Pokémon Scarlet and Pokémon Violet games, the newest chapters in the Pokémon series, are coming to Nintendo Switch. With these new titles, the Pokémon series takes a new evolutionary step, allowing you to explore freely in a richly expressed open world.  Various towns blend seamlessly into the wilderness with no borders. You'll be able to see the Pokémon of this region in the skies, in the seas, in the forests, on the streetsall over! You'll be able to experience the true joy of the Pokémon seriesbattling against wild Pokémon in order to catch themnow in an open-world game that players of any age can enjoy. \r\rMeet the First Partner Pokémon\rThe three Pokémon from which you'll be able to choose your first partner are Sprigatito, Fuecoco, and Quaxly. How will you meet these three, and what sorts of Pokémon are they? \r\rSprigatito \rType: Grass \rCategory: Grass Cat Pokémon \rHeight: 1'4\" \rWeight: 9 lbs. \rAbility: Overgrow \rThe capricious, attention-seeking Grass Cat Pokémon. \r\rFuecoco\rType: Fire\rCategory: Fire Croc Pokémon \rHeight: 1'4\" \rWeight: 21.6 lbs. \rAbility: Blaze \rThe laid-back Fire Croc Pokémon that does things at its own pace. \r\rQuaxly\rType: Water \rCategory: Duckling Pokémon \rHeight: 1'8\" \rWeight: 13.4 lbs. \rAbility: Torrent \rThe earnest and tidy Duckling Pokémon. \r\rIntroducing the Main Characters \rAs one of the main characters, you'll set off on your adventure. Your outfit will vary depending on whether you play Pokémon Scarlet or Pokémon Violet. Who knows what kind of story awaits you?… Expand"}, {"name": "Assassin's Creed III Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-iii-remastered", "publisher": "Ubisoft", "release_date": "Mar 29 2019", "developers": ["Ubisoft"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/7a59e5dcafc917f4176870a9a7e841d0-98.jpg", "descriptions": "Relive the American Revolution or experience it for the first time in Assassin's Creed III Remastered, with enhanced graphics and improved gameplay mechanics. Plus, Assassin's Creed Liberation Remastered and all solo DLC content are included."}, {"name": "Matterfall", "details_link": "https://www.metacritic.com/game/playstation-4/matterfall", "publisher": "SCEA", "release_date": "Aug 15 2017", "developers": ["Housemarque", "XDEV"], "platforms": "PlayStation 4", "genres": ["Action", "Platformer", "Shooter", "Third-Person", "2D", "Arcade"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/ae637c8f65acccc65a4d6c0057101a08-98.jpg", "descriptions": "As a hero-for-hire, survive high-intensity side-scrolling war zones in vertical cities overrun by mysterious smart matter. Weaponize alien tech to destroy enemies infected by deadly Red Matter -- and control Blue Matter to manipulate the world and forge the path forward."}, {"name": "Super Dragon Ball Z", "details_link": "https://www.metacritic.com/game/playstation-2/super-dragon-ball-z", "publisher": "Atari", "release_date": "Jul 18 2006", "developers": ["Crafts & Meister"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/30d900ef78a500a15f6836c92f332efa-98.jpg", "descriptions": "From the producer of the acclaimed Street Fighter II game comes Super DBZ, a new, highly intense DBZ fighting experience unlike any other Dragon Ball Z game. Super DBZ features an all new DBZ fighting system plus intense combos for super damage. With multiple unique special attacks andFrom the producer of the acclaimed Street Fighter II game comes Super DBZ, a new, highly intense DBZ fighting experience unlike any other Dragon Ball Z game. Super DBZ features an all new DBZ fighting system plus intense combos for super damage. With multiple unique special attacks and fighting styles for all 18 characters, Super DBZ gives players a more hard-core 3D fighting experience in the air or on the ground, complete with enough super-fast combination moves and dynamic battle scenes to satisfy any DBZ buff. [Atari]… Expand"}, {"name": "Sudeki", "details_link": "https://www.metacritic.com/game/xbox/sudeki", "publisher": "Microsoft Game Studios", "release_date": "Jul 20 2004", "developers": ["Climax Group"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/282dd518ec536babd9c0a07aff04febb-98.jpg", "descriptions": "A sultry wizardress, a soaring gunslinger, a powerful swordsman, and a dark huntress are about to be hurtled into a dark adventure.  Set in a world ripped apart by deceit, the heroes of Sudeki journey down a twisting path of betrayal, gravity-defying combat, and unbelievable magic.  SudekiA sultry wizardress, a soaring gunslinger, a powerful swordsman, and a dark huntress are about to be hurtled into a dark adventure.  Set in a world ripped apart by deceit, the heroes of Sudeki journey down a twisting path of betrayal, gravity-defying combat, and unbelievable magic.  Sudeki pushes the limits of what you think an RPG can be, with bigger worlds, more powerful heroes, and sexier heroines--all wrapped up in Hong Kong-style cinematic combat.  … Expand"}, {"name": "Amped 3", "details_link": "https://www.metacritic.com/game/xbox-360/amped-3", "publisher": "2K Sports", "release_date": "Nov 16 2005", "developers": ["2K Sports"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/eb91e4bce4cd5be18db93ac9b5be1b0f-98.jpg", "descriptions": "Massive Mountains - Amped 3 features seven new resorts, up to three times larger than levels in Amped 1 & 2. Take on hundreds of challenges around the resorts, or pull out your sled and try to hang on for dear life. Explore the entire mountain on a snowmobile, get away from it all in theMassive Mountains - Amped 3 features seven new resorts, up to three times larger than levels in Amped 1 & 2. Take on hundreds of challenges around the resorts, or pull out your sled and try to hang on for dear life. Explore the entire mountain on a snowmobile, get away from it all in the back country, or find the perfect spot and build your own obstacles, rails, and jumps. Snowbox - The resorts are loaded with hundreds of challenges; beat them and earn upgrades, new stuff, or Coin you can use to buy a ton of swag. And these challenges aren't just about your skills on a snowboard... there's snowmobiling, sledding, and more. All your top scored runs, hang-times and crashes are automatically posted for all to see on Live... see how you measure up against the rest of the planet and go grab the top spot. Park Builder - Anywhere, anytime, you can plant your own jumps and rails to create a personal terrain park, add things to trick off to get better High Scores, or just make a difficult challenge a little easier. You can even create your own sessioning area. And you earn newer and crazier objects to plant as you play the game. [2K Sports]… Expand"}, {"name": "GreedFall", "details_link": "https://www.metacritic.com/game/playstation-4/greedfall", "publisher": "Focus Home Interactive", "release_date": "Sep 10 2019", "developers": ["Spiders"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/9390d5fa7b4cf61b1796653fbc66aeea-98.jpg", "descriptions": "Explore uncharted new lands as you set foot on a remote island seeping with magic, and filled with riches, lost secrets, and fantastic creatures. Forge this new world's destiny, as you befriend or betray companions and entire factions. With diplomacy, deception and force, become part of aExplore uncharted new lands as you set foot on a remote island seeping with magic, and filled with riches, lost secrets, and fantastic creatures. Forge this new world's destiny, as you befriend or betray companions and entire factions. With diplomacy, deception and force, become part of a living, evolving world - influence its course and shape your story.\r * Engage in a core roleplaying experience achieve quests and complete objectives in a multitude of different ways through combat, diplomacy, deception, or stealth.\r* Complete freedom in character progression play as a male or female, customize your appearance, and freely choose your abilities, spells and skills.\r* Delve into a mysterious world of magic begin a grand journey and uncover ancient secrets protected by supernatural beings, manifestations of the island's earthly magic.… Expand"}, {"name": "NBA Live 18", "details_link": "https://www.metacritic.com/game/xbox-one/nba-live-18", "publisher": "Electronic Arts", "release_date": "Sep 15 2017", "developers": ["EA Sports"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 72, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/7e1f83e2e4ecf2e59956bea052974f79-98.jpg", "descriptions": "NBA LIVE 18 introduces THE ONE, a new, dynamic career experience centered on your player, your choices and your legacy. Create your unique player identity and decide how you become a legend by mastering your selected role on the court along with signature abilities and traits, only you canNBA LIVE 18 introduces THE ONE, a new, dynamic career experience centered on your player, your choices and your legacy. Create your unique player identity and decide how you become a legend by mastering your selected role on the court along with signature abilities and traits, only you can pull off. Embark on your quest to be the greatest basketball player on the planet in The League and The Streets with, or against other players in solo, co-op and multiplayer challenges delivered through LIVE Event content. Dominate the court with innovative one-on-one gameplay arming you with an arsenal of all-new moves for each position with unprecedented control and responsiveness. Put your new-found skills to the test as you manage and build your favorite team in Franchise and Live Ultimate Team. … Expand"}, {"name": "The Fall", "details_link": "https://www.metacritic.com/game/wii-u/the-fall", "publisher": "Over The Moon", "release_date": "Aug 26 2014", "developers": ["Over The Moon"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Wii U"], "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/3ffe2cd34b55d253593330199fb89fc9-98.jpg", "descriptions": "Be an AI. Save your human.\r\"Super Metroid meets Monkey Island.\"\rConform to Protocol.\r\n\r\nExperience the first story in a mind bending trilogy!\r\n\r\nTake on the role of ARID, the artificial intelligence onboard a high-tech combat suit. ARID's program activates after crashing on anBe an AI. Save your human.\r\"Super Metroid meets Monkey Island.\"\rConform to Protocol.\r Experience the first story in a mind bending trilogy!\r Take on the role of ARID, the artificial intelligence onboard a high-tech combat suit. ARID's program activates after crashing on an unknown planet. The human pilot within the combat suit is unconscious, and it is ARID's duty to protect him at all costs! As she progresses into her twisted and hostile surroundings, events transpire that will cause her to rethink her rules, regulations, and her very self-image.\r The Fall is a unique blend of adventure-game puzzle solving, and side-scroller action. Exploration will be paramount to surviving your adventure. Utilize ARID's flashlight to uncover a myriad of interactive objects as you progress through a rich and detailed story, hand-crafted over the course of two years to blend seemlessly with gameplay.\r Get ready for a disturbing journey as you fight, explore, and think your way forward, expanding ARID's world, in spite of her protocols.… Expand"}, {"name": "Rayman 3 HD", "details_link": "https://www.metacritic.com/game/playstation-3/rayman-3-hd", "publisher": "Ubisoft", "release_date": "Mar 20 2012", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 72, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/d1c2423ea1bfade071a1dd06afc5c217-98.jpg", "descriptions": "Rayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge theRayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge the Dark Lum Lord from the manic Globox, scour the lands for new powers, and battle with hordes of Hoodlum soldiers. Even without arms or legs, Rayman can still unleash an arsenal of special powers and fighting moves.… Expand"}, {"name": "Dementium: The Ward", "details_link": "https://www.metacritic.com/game/ds/dementium-the-ward", "publisher": "Gamecock Media Group", "release_date": "Oct 26 2007", "developers": ["Renegade Kid"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Shooter", "Horror", "Horror", "Survival", "First-Person", "Modern"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/fa52cb637d78fb9d4e0a9cdaf97abb97-98.jpg", "descriptions": "Dementium: The Ward tells the tale of a man who awakens to find himself alone in a mysterious, derelict hospital that is frozen in time. Confronted by the deadly, grotesque surgical experiments that wander the halls, a series of challenging puzzles and a cast of peculiar characters, he mustDementium: The Ward tells the tale of a man who awakens to find himself alone in a mysterious, derelict hospital that is frozen in time. Confronted by the deadly, grotesque surgical experiments that wander the halls, a series of challenging puzzles and a cast of peculiar characters, he must face his deepest fears, unlock the mysteries of the hospital, and escape with his life. A completely new experience on the Nintendo DS, Dementium promises to creep you out with gory visuals and bone-chilling audio that brings the world screaming to life. [Gamecock]… Expand"}, {"name": "Proteus", "details_link": "https://www.metacritic.com/game/playstation-3/proteus", "publisher": "Curve Studios", "release_date": "Oct 29 2013", "developers": ["Ed Key and David Kanaga"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "num_players": "1 Player", "genres": ["Adventure", "General", "General", "3D", "First-Person", "Fantasy"], "meta_score": 72, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/8/c2075f163796fb73fa9140d4c45de1a3-98.jpg", "descriptions": "Proteus is a minimalist game of pure exploration and sublime discovery in a musical wilderness environment. There are no challenges and no goals other than those set by the player. A reactive audio mixing system allows the player to explore the environment as music."}, {"name": "Prinny: Can I Really Be the Hero?", "details_link": "https://www.metacritic.com/game/psp/prinny-can-i-really-be-the-hero", "publisher": "NIS America", "release_date": "Feb 17 2009", "developers": ["Nippon Ichi Software"], "platforms": ["Switch", "PSP"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/436638e3dbf4bd2747c85c3eba674eea-98.jpg", "descriptions": "Prinny: Can I Really Be the Hero? is a side-scrolling action game and will have you slashing your way through various Netherworlds."}, {"name": "Sea of Solitude", "details_link": "https://www.metacritic.com/game/xbox-one/sea-of-solitude", "publisher": "Electronic Arts", "release_date": "Jul  5 2019", "developers": ["Jo-Mei Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Linear", "Third-Person"], "meta_score": 72, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/0e025862fb9c26ac696d35abc61ce2eb-98.jpg", "descriptions": "When humans get too lonely, they turn into monsters Sea of Solitude takes you on a personal journey of a young woman's loneliness. Set sail across a beautiful and evolving world, where nothing is quite what it seems. Meet fantastical creatures and monsters, learn their stories, and solveWhen humans get too lonely, they turn into monsters Sea of Solitude takes you on a personal journey of a young woman's loneliness. Set sail across a beautiful and evolving world, where nothing is quite what it seems. Meet fantastical creatures and monsters, learn their stories, and solve challenges. Explore a flooded city, either by boat, on foot, or by swimming through the water itself. Dare to look what lies beneath the surface, in a haunting struggle of darkness and light, and discover what it truly means to be human. KEY FEATURES - AN EMOTIONAL JOURNEY Sea of Solitude embarks players on a nuanced and intimate action-adventure, experienced through the mind of Kay, as she struggles to overcome her inner loneliness. Players must help Kay see below the surface and beyond, guiding her through her Sea of Solitude, in this deeply touching tale of darkness and light. - A METAPHORICAL WORLD As her journey evolves, Kay's dark and stormy environment begins to transform, with light and color shining into the world. Water levels rise and fall to reflect her own state of mind, transforming the flooded city landscape into new areas for the player to explore, with new challenges to face. - FACE THE MONSTERS WITHIN Encounter fantastical creatures, solve puzzles, and rid the world of tainted memories. Meet a variety of beautiful and terrifying monsters, each with their own struggles of loneliness to tell. Through confronting these monsters, Kay will not only learn more about them, but also herself, and what it means to be human.… Expand"}, {"name": "Zombi", "details_link": "https://www.metacritic.com/game/xbox-one/zombi", "publisher": "Ubisoft", "release_date": "Aug 18 2015", "developers": ["Ubisoft Montpellier", "Straight Right"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "First-Person", "Arcade"], "meta_score": 72, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/dc6460eb6e9bd96715306a5230be58f4-98.jpg", "descriptions": "ZombiU thrusts players in the middle of London circa 2012, where an outbreak has infected the population, destroying their humanity and turning them into mindless monsters preying on the flesh of the few remaining survivors. This fear-fueled first-person shooter invites takes all the horror,ZombiU thrusts players in the middle of London circa 2012, where an outbreak has infected the population, destroying their humanity and turning them into mindless monsters preying on the flesh of the few remaining survivors. This fear-fueled first-person shooter invites takes all the horror, chaos and tension found in the best of the horror genre and adds original interactive elements, including a unique death mechanic that puts players in the body of a different survivor each time they die, allowing them to track and take down their old, infected characters, recover  their equipment and see if they can stay alive just a little bit longer this time.… Expand"}, {"name": "Inazuma Eleven 3: Bomb Blast", "details_link": "https://www.metacritic.com/game/3ds/inazuma-eleven-3-bomb-blast", "publisher": "Nintendo", "release_date": "Sep 27 2013", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 72, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/4c64d2c2cba05c5ce06725778fdf0ce7-98.jpg", "descriptions": "Mark Evans, footballing hero, has risen to the top in Japan by winning the Football Frontier Tournament and then saving his country from crisis, but now… he’s about to take on the world.  All of them, though, have only one thing on their mind – getting onto the national side: InazumaMark Evans, footballing hero, has risen to the top in Japan by winning the Football Frontier Tournament and then saving his country from crisis, but now… he’s about to take on the world.  All of them, though, have only one thing on their mind – getting onto the national side: Inazuma National. The Football Frontier International championship is coming up, pitting the best young players from around the world against each other, and Mark and his friends are about to face the challenge of a lifetime. [Nintendo UK]… Expand"}, {"name": "Broken Sword 5: The Serpents' Curse - Part II", "details_link": "https://www.metacritic.com/game/pc/broken-sword-5-the-serpents-curse---part-ii", "publisher": "Revolution Software", "release_date": "Apr 17 2014", "developers": ["Revolution Software"], "platforms": ["PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/f19c4c22da56fec1ef8868a8fa62022f-98.jpg", "descriptions": "In this second episode, you will burst out from Paris and London, going on to locations throughout Spanish Catalonia and to deepest Iraq, the birthplace of civilization. This episode ramps up the drama, as well as the difficulty – and concludes the themes set up in the first episode. CharlesIn this second episode, you will burst out from Paris and London, going on to locations throughout Spanish Catalonia and to deepest Iraq, the birthplace of civilization. This episode ramps up the drama, as well as the difficulty – and concludes the themes set up in the first episode. Charles is currently writing a Director’s Message which will aim to encapsulate the historical themes that he wanted to convey through the game.… Expand"}, {"name": "The Saboteur", "details_link": "https://www.metacritic.com/game/playstation-3/the-saboteur", "publisher": "Electronic Arts", "release_date": "Dec  8 2009", "developers": ["Pandemic Studios"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/0932956ad2ba624407d6825f0d54a950-98.jpg", "descriptions": "Inspired by a true story, The Saboteur stars Sean Devlin, a street-tough Irish race car driver trapped behind enemy lines in 1940s Nazi-occupied France. Motivated by personal revenge, Sean fights, climbs, and races through open-world Paris, sneaking into the heart of the Nazi operations andInspired by a true story, The Saboteur stars Sean Devlin, a street-tough Irish race car driver trapped behind enemy lines in 1940s Nazi-occupied France. Motivated by personal revenge, Sean fights, climbs, and races through open-world Paris, sneaking into the heart of the Nazi operations and sabotaging their every move. With the help of the French Resistance, the British intelligence, an arsenal of weaponry, street smarts and brawn, players exact revenge on those who aim to destroy Sean's life. From derailing trains and blowing up zeppelins to scaling famous Parisian landmarks and more, this action hero uses a broad range of weapons, explosives and vehicles to get the job done. As Sean takes down enemies, the citizens of Paris are empowered to resist the tyrannical Third Reich and their eyes open to the colorful world around them. This innovative mechanic, called the 'Will to Fight,' change the way Paris is seen and felt - from a dark and oppressed policed state to a bright and inspired world where the citizens fight back. As the player executes acts of sabotage against the occupying force, color returns to the stylized black and white world - both figuratively and literally. The ‘Will to Fight’ spawns an underground resistance that takes players not only through Paris, but across various parts of France. [Pandemic Studios]… Expand"}, {"name": "Area 51", "details_link": "https://www.metacritic.com/game/xbox/area-51", "publisher": "Midway", "release_date": "Apr 25 2005", "developers": ["Midway Studios - Austin"], "platforms": ["PC", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/5752c7e5f8f124488319b5d25c20d410-98.jpg", "descriptions": "A viral outbreak has shut down one of the US government's most secret and secure military facilities and all scientific and military personnel are locked inside. A small Special Forces unit, led by specialist Ethan Cole, is sent to investigate. As Cole, you'll delve into five expansiveA viral outbreak has shut down one of the US government's most secret and secure military facilities and all scientific and military personnel are locked inside. A small Special Forces unit, led by specialist Ethan Cole, is sent to investigate. As Cole, you'll delve into five expansive levels within the confines of Area 51, discovering a deadly mutagenic side effect of the virus as well as an ancient alien colony buried beneath the facility. With an array of human and alien weapons, you must explore conspiracies in order to solve the enigma of Area 51.… Expand"}, {"name": "Warhammer 40,000: Battlesector", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-battlesector", "publisher": "Slitherine", "release_date": "Jul 15 2021", "developers": ["Black Lab Games"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/8b0da37b7cb3de15bbd41428a2da5cf1-98.jpg", "descriptions": "In the grim darkness of the far future, there is only war. Experience every bone-rattling explosion and soul-crushing charge in Warhammer 40,000: Battlesector, the definitive battle-scale game of turn-based strategy and fast-paced combat that takes you to the battlefields of the 41stIn the grim darkness of the far future, there is only war. Experience every bone-rattling explosion and soul-crushing charge in Warhammer 40,000: Battlesector, the definitive battle-scale game of turn-based strategy and fast-paced combat that takes you to the battlefields of the 41st Millenium. Experience an epic twenty mission single-player campaign that explores the aftermath of the Devastation of Baal. Help Sergeant Carleon and his allies purge the Tyranid infestation on Baal Secundus, and preserve the honour of the noble Blood Angels.… Expand"}, {"name": "TOHU", "details_link": "https://www.metacritic.com/game/pc/tohu", "publisher": "The Irregular Corporation", "release_date": "Jan 28 2021", "developers": ["Fireart Games"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/96cae348ddd9529595b6e0f833c318ee-98.jpg", "descriptions": "Experience a brand new adventure game set amongst a world of weird and wonderful fish planets. Explore beautiful environments, solve intricate puzzles and discover the truth about a mysterious little girl and her mechanical alter-ego, Cubus."}, {"name": "Chasm", "details_link": "https://www.metacritic.com/game/pc/chasm", "publisher": "Discord Games", "release_date": "Jul 30 2018", "developers": ["Discord Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "2D", "2D", "Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/97b4138cb6311f675c440464cd3cbe49-98.jpg", "descriptions": "Chasm is a 2D Action-RPG Platformer. Taking equal inspiration from hack 'n slash dungeon crawlers (procedurally generated dungeons, loot drops, etc) and Metroidvania-style platformers, the game aims to immerse you in its 2D fantasy world full of exciting treasure, deadly enemies, andChasm is a 2D Action-RPG Platformer. Taking equal inspiration from hack 'n slash dungeon crawlers (procedurally generated dungeons, loot drops, etc) and Metroidvania-style platformers, the game aims to immerse you in its 2D fantasy world full of exciting treasure, deadly enemies, and abundant secrets. Players assume the role of a soldier passing through a remote mining town on their journey home from a long war. The town's miners have recently disappeared after breaching a long-forgotten temple far below the town, and reawakened an ancient slumbering evil. Now trapped in the town by supernatural forces, you're left with no option but to explore the mines below, battle enemies and bosses, and increase your abilities in hopes of finally escaping and returning home.… Expand"}, {"name": "LEGO Jurassic World", "details_link": "https://www.metacritic.com/game/pc/lego-jurassic-world", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 11 2015", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/27cf0485a5786c2b3116c6b89a8a6953-98.jpg", "descriptions": "Following the epic storylines of Jurassic Park, The Lost World: Jurassic Park and Jurassic Park III, as well as the highly anticipated Jurassic World, LEGO Jurassic World is the first videogame where players will be able to relive and experience all four Jurassic films."}, {"name": "MouseCraft", "details_link": "https://www.metacritic.com/game/pc/mousecraft", "publisher": "Crunching Koalas", "release_date": "Jul  8 2014", "developers": ["Crunching Koalas"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Puzzle", "Miscellaneous", "Puzzle", "Action", "General"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/d9c162c96f82736fb5658cb0bc41300e-98.jpg", "descriptions": "Ever wondered what a cross between Tetris and Lemmings would look like? Well, wonder no more, 'cause... MouseCraft is here! MouseCraft is an A to B puzzle game where players help mice in their relentless quest for cheese by stacking the world's most famous blocks: Tetrominos."}, {"name": "Kingdom of Paradise", "details_link": "https://www.metacritic.com/game/psp/kingdom-of-paradise", "publisher": "SCEA", "release_date": "Nov 15 2005", "developers": ["Climax Entertainment"], "platforms": ["PlayStation 4", "PlayStation 5", "PSP"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/83768d57a954ddb5a226358a7b87c245-98.jpg", "descriptions": "(Also known as \"Key of Heaven\")  Kingdom of Paradise is an action-RPG title where players take the role of a young warrior outcast named Shinbu.  When one of the five martial clans attempts to disrupt a peaceful balance of power within the land of Ohka, Shinbu seeks to defend his clan and(Also known as \"Key of Heaven\")  Kingdom of Paradise is an action-RPG title where players take the role of a young warrior outcast named Shinbu.  When one of the five martial clans attempts to disrupt a peaceful balance of power within the land of Ohka, Shinbu seeks to defend his clan and restore equal power to the five clans that once ruled the world.  With more than 20 hours of gameplay, players will venture through vast, living worlds and battle mythical enemies in a quest to restore peace to Ohka.  More than 150 sword attack styles are available and players can create unique fighting combos by customizing sword attacks and moves gained throughout the game.  In Ad Hoc mode, custom-created sword skills can be shared with friends and players can battle in one-on-one matches.  Special skills and defensive items, along with an exclusive sword, are available to download via Infrastructure mode. [SCEA]… Expand"}, {"name": "Akka Arrh", "details_link": "https://www.metacritic.com/game/switch/akka-arrh", "publisher": "Atari", "release_date": "Feb 21 2023", "developers": ["Llamasoft", "Jeff Minter"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/9587e0e4790d9248ba47e3e8f1197390-98.jpg", "descriptions": "A cascade of words, color, shapes and sound flows around your turret as you desperately fight off swarms of inbound attackers. If enemies penetrate your perimeter you need to zoom into close range combat and beat them back, adjusting to a completely different perspective in the blink of anA cascade of words, color, shapes and sound flows around your turret as you desperately fight off swarms of inbound attackers. If enemies penetrate your perimeter you need to zoom into close range combat and beat them back, adjusting to a completely different perspective in the blink of an eye. Welcome to Jeff Minter's Akka Arrh.This modern take from the fine developers at Llamasoft combines the intrigue of an incredibly rare Atari arcade prototype with a unique creative vision that delivers a wave shooter that is insanely addictive. Akka Arrh drips with Minter's sense of humor, love of psychedelic color, and ability to create games that are a joy to play.… Expand"}, {"name": "WWE SmackDown vs. Raw 2011", "details_link": "https://www.metacritic.com/game/wii/wwe-smackdown-vs-raw-2011", "publisher": "THQ", "release_date": "Oct 26 2010", "developers": ["Yuke's"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/9c703086999f09e39d520825697c5843-98.jpg", "descriptions": "WWE SmackDown vs. Raw 2011 will empower players more than ever to to define their gameplay experiences in a dynamic and ever-changing WWE.  Along the way, gameplay scenarios will change based on player decisions, allowing for more spontaneous WWE action in and out of the ring.  Players willWWE SmackDown vs. Raw 2011 will empower players more than ever to to define their gameplay experiences in a dynamic and ever-changing WWE.  Along the way, gameplay scenarios will change based on player decisions, allowing for more spontaneous WWE action in and out of the ring.  Players will also enjoy a greater level of interactivity and have increased control of their destinies in the game's popular Road to WrestleMania story-driven mode.  … Expand"}, {"name": "Yo-kai Watch 2: Bony Spirits", "details_link": "https://www.metacritic.com/game/3ds/yo-kai-watch-2-bony-spirits", "publisher": "Nintendo", "release_date": "Sep 30 2016", "developers": ["Level 5"], "platforms": "3DS", "num_players": "2 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/00c344f4e3b8cdb879148651763e42c3-98.jpg", "descriptions": "A pair of sinister Yo-kai have arrived in Springdale, and they’re up to no good. Can Nate and his friends stop them?"}, {"name": "Theme Park", "details_link": "https://www.metacritic.com/game/ds/theme-park", "publisher": "EA Games", "release_date": "Mar 20 2007", "developers": ["EA Japan Studio"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/10a525cf8a0da5c016c053b10afb1192-98.jpg", "descriptions": "Become a Theme Park expert with guidance from your hand-picked Advisor. Fill your park with willing workers, then encourage their efforts with speed-boosting stylus taps. Assign handymen to make your park a destination to visit and add entertainers to amuse demanding customers. Start yourBecome a Theme Park expert with guidance from your hand-picked Advisor. Fill your park with willing workers, then encourage their efforts with speed-boosting stylus taps. Assign handymen to make your park a destination to visit and add entertainers to amuse demanding customers. Start your career in the UK, then advance to new countries as your success grows - Unique shops, attractions and staff worldwide. Control everything, from the speed of your rides to the amount of ice in your drinks.… Expand"}, {"name": "Road 96: Mile 0", "details_link": "https://www.metacritic.com/game/xbox-series-x/road-96-mile-0", "publisher": "Ravenscourt", "release_date": "Apr  4 2023", "developers": ["Digixart Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Adventure", "3D", "First-Person"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/48851ec65835ce96b7e3d674adb47792-98.jpg", "descriptions": "Road 96: Mile 0 is a Narrative-Adventure game with a musical component created by DigixArt, the French studio behind the successful Road 96, 11-11 Memories Retold and 5 Pegases Awards winner. Published by Ravenscourt, players will alternate between the roles of Zoe and Kaito, two teenagersRoad 96: Mile 0 is a Narrative-Adventure game with a musical component created by DigixArt, the French studio behind the successful Road 96, 11-11 Memories Retold and 5 Pegases Awards winner. Published by Ravenscourt, players will alternate between the roles of Zoe and Kaito, two teenagers with different backgrounds and beliefs. They live and explore White Sands, a luxurious condominium where Petria´s elite reside and where Kaito´s parents work.Their journey in Road 96: Mile 0 will challenge their friendship and everything they believe in. They say money doesn't buy happiness, nor friendship. These teens are dreamers and they are going to learn where they belong. Will they remain friends?… Expand"}, {"name": "Hooked on You: A Dead by Daylight Dating Sim", "details_link": "https://www.metacritic.com/game/pc/hooked-on-you-a-dead-by-daylight-dating-sim", "publisher": "Behaviour Interactive Inc.", "release_date": "Aug  3 2022", "developers": ["Psyop Games", "Psyop"], "platforms": "PC", "genres": ["Adventure", "Visual Novel"], "meta_score": 72, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/0717e913f75b325a1b7259f9596c9af2-98.jpg", "descriptions": "Welcome to Murderer’s Island. Your companions: four dead-sexy Killers who, underneath their murderous exteriors, just want a little romance. Flirt your way into their hearts, uncovering dark twists along the way. Will you find true love, forge friendships… or get hacked to death?"}, {"name": "Ground Divers!", "details_link": "https://www.metacritic.com/game/switch/ground-divers!", "publisher": "Arc System Works", "release_date": "Jun 30 2022", "developers": ["Arc System Works"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/1e225c81d2cb57010319a64374a0bba0-98.jpg", "descriptions": "The slapstick, discovery game from the small team Studio Tsuruhashi! Dig up the “Secret of the Rare Matter” never before explored by mankind. \r\r– Guide Tsuruhashi to the deepest depths and get the Rare Matter!\r– The enemy has you in their sights! You can’t just dig to protect yourself!\r\n–The slapstick, discovery game from the small team Studio Tsuruhashi! Dig up the “Secret of the Rare Matter” never before explored by mankind. \r\r– Guide Tsuruhashi to the deepest depths and get the Rare Matter!\r– The enemy has you in their sights! You can’t just dig to protect yourself!\r– Build and modify Pit relay stations! Dig strategically!\r– Pits have lots of useful functions! How will you use them?\r– CHEER Energy drives Tsuruhashi!\r– Smart usage of energy is the key to success!\r– Gather CHEER and unleash your powerful special attack!\r– Upgrade Tsuruhashi using materials obtained from mining!\r– Liven up your home base!… Expand"}, {"name": "Brigandine: The Legend of Runersia", "details_link": "https://www.metacritic.com/game/pc/brigandine-the-legend-of-runersia", "publisher": "Happinet", "release_date": "May 10 2022", "developers": ["Matrix Software"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/22a72557b7312be4e6502a7cf63d29ba-98.jpg", "descriptions": "Conquer the continent in this grand strategy simulation game. The continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters. Select a ruler, compose your platoons of knights and monsters, and march to claim enemy bases. The playerConquer the continent in this grand strategy simulation game. The continent of Runersia is home to six major powers with more than 40 bases, 100 knights, and 50 types of monsters. Select a ruler, compose your platoons of knights and monsters, and march to claim enemy bases. The player chooses how they will battle, so devise the best strategy to lead your nation toward continental conquest. How will your legend unfold?… Expand"}, {"name": "Infliction: Extended Cut", "details_link": "https://www.metacritic.com/game/xbox-one/infliction-extended-cut", "publisher": "Blowfish Studios", "release_date": "Feb 25 2020", "developers": ["Caustic Reality"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "First-Person"], "meta_score": 72, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/b387e5abe7d1eb07180ad487405f797e-98.jpg", "descriptions": "Wander through an interactive nightmare set within a once-happy home. Uncover the heartbreaking mystery hidden within messages, artwork, and other vestiges of domestic life all while struggling to survive encounters with a relentless entity that stands in the way of finding absolution."}, {"name": "Dark Devotion", "details_link": "https://www.metacritic.com/game/playstation-4/dark-devotion", "publisher": "Limited Run Games", "release_date": "Oct 24 2019", "developers": ["Hibernian Workshop", "The Arcade Crew"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/d74d3a71743eb9ea788fc5d2e550f13c-98.jpg", "descriptions": "Explore the secrets of a mysterious fallen temple and put your Templar faith to the test in Dark Devotion, where no sacrifice is too great in praise of your God. Measure your devotion and your bravery by journeying into deepest darkness for answers to questions that will challenge your veryExplore the secrets of a mysterious fallen temple and put your Templar faith to the test in Dark Devotion, where no sacrifice is too great in praise of your God. Measure your devotion and your bravery by journeying into deepest darkness for answers to questions that will challenge your very existence.… Expand"}, {"name": "Massive Chalice", "details_link": "https://www.metacritic.com/game/xbox-one/massive-chalice", "publisher": "Double Fine Productions", "release_date": "Jun  1 2015", "developers": ["Double Fine Productions"], "platforms": ["PC", "Xbox One"], "genres": ["Strategy", "Turn-Based", "General", "Fantasy", "Tactics"], "meta_score": 72, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/327b370df1a79c3c8c2ddf6bd618e9b2-98.jpg", "descriptions": "MASSIVE CHALICE is a tactical strategy game set on an epic timeline from Double Fine Productions. As the Immortal Ruler of the Nation, you'll take command of its heroes, forge marriages to strengthen your Bloodlines, and battle a mysterious enemy known as the Cadence in a war lastingMASSIVE CHALICE is a tactical strategy game set on an epic timeline from Double Fine Productions. As the Immortal Ruler of the Nation, you'll take command of its heroes, forge marriages to strengthen your Bloodlines, and battle a mysterious enemy known as the Cadence in a war lasting hundreds of years.… Expand"}, {"name": "Mighty Gunvolt", "details_link": "https://www.metacritic.com/game/3ds/mighty-gunvolt", "publisher": "Inti Creates", "release_date": "Aug 29 2014", "developers": ["Inti Creates"], "platforms": ["PC", "3DS"], "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/eed885c23600a5ee738bcda1878dfcc7-98.jpg", "descriptions": "From the 8-bit generation. For the 8-bit generation!\r For the Nintendo 3DS e-shop comes MIGHTY GUNVOLT, along with retro graphics and sounds!\r\n\r\nThis game is reminiscent of the 80s, not just in looks, but also with simple controls that create a surprising amount of complexity and fun.From the 8-bit generation. For the 8-bit generation!\r For the Nintendo 3DS e-shop comes MIGHTY GUNVOLT, along with retro graphics and sounds!\r This game is reminiscent of the 80s, not just in looks, but also with simple controls that create a surprising amount of complexity and fun.\r Accompanying Gunvolt in this adventure are the angel Ekoro from Gal&#9734;Gun and Beck from Mighty Number 9. Each character possesses different skills that will force the player to finish each stage in different and creative ways.… Expand"}, {"name": "Mario Party DS", "details_link": "https://www.metacritic.com/game/ds/mario-party-ds", "publisher": "Nintendo", "release_date": "Nov 19 2007", "developers": ["Hudson Soft"], "platforms": "DS", "num_players": "4  Online", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/375023307eb38f13eaf38d966f0d8ebe-98.jpg", "descriptions": "You'd think years of defeat would get to a guy, but Bowser just doesn't give up! He's captured Mario and his friends in his pursuit of a crystal that the group collected when it fell from the sky, and he doesn't hesitate to shrink them to miniature size to get rid of them and get his handsYou'd think years of defeat would get to a guy, but Bowser just doesn't give up! He's captured Mario and his friends in his pursuit of a crystal that the group collected when it fell from the sky, and he doesn't hesitate to shrink them to miniature size to get rid of them and get his hands on the other four crystals. The mini-heroes have to find the crystals before he does, making their way through giant environments filled with enormous creatures. The single-player campaign takes place in five different settings, each of them ending with a boss. As usual, players have to collect coins and stars, at the same time escaping dangers such as Piranha Plants and other classic creatures from the Mario universe. As they progress through the game, players also can unlock various mini-games, such as Rail Riders, Sweet Sleuth and Goomba Wrangler! When players are tired of exploring the story mode, they can choose one of the other modes, like Puzzle and Minigame. Play with up to four friends on the DS' local Wi-Fi and let the party begin. [Nintendo]… Expand"}, {"name": "The Silent Hill Experience", "details_link": "https://www.metacritic.com/game/psp/the-silent-hill-experience", "publisher": "Konami", "release_date": "Apr  6 2006", "developers": ["Konami"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Videos", "Application"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/bc66549a449bfbd3cc34dee882d1df9d-98.jpg", "descriptions": "(Note: This is not a video game)  The Silent Hill Experience combines a variety of media - comics, music and movies to deliver a complete behind-the-scenes look at the popular Silent Hill franchise. Using an intuitive 3D interface, Silent Hill fans will be able to view all-new digital(Note: This is not a video game)  The Silent Hill Experience combines a variety of media - comics, music and movies to deliver a complete behind-the-scenes look at the popular Silent Hill franchise. Using an intuitive 3D interface, Silent Hill fans will be able to view all-new digital interactive comics, listen to music from the long-running series of Silent Hill video games, and watch exclusive video content, including an interview with the director of the highly-anticipated Silent Hill motion picture. View over 2 hours of digital comics based on the popular Silent Hill comic series presented with haunted music. Includes the acclaimed comic series Silent Hill: Dying Inside and a brand new Silent Hill story The Hunger. 20 unforgettable music tracks selected from series' producer and music composer Akira Yamaoka. Exclusive video interview with the director of the Silent Hill movie Christophe Gans and series' music composer Akira Yamaoka. Rare video content from previous Silent Hill games. [Konami]… Expand"}, {"name": "Blood II: The Chosen", "details_link": "https://www.metacritic.com/game/pc/blood-ii-the-chosen", "publisher": "GT Interactive", "release_date": "Oct 31 1998", "developers": ["Monolith Productions"], "platforms": "PC", "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 72, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/3b6e0d22e723c4b17e692c53a0d8ea69-98.jpg", "descriptions": "Take control of any one of \"The Chosen\" -- four extraordinary characters who inhabit a dark near-future world reminiscent of Blade Runner and The Crow. Become Caleb, the vicious protagonist from the original Blood, his cold-blooded love Ophelia, the ruthless Ishmael, or the unrelentingTake control of any one of \"The Chosen\" -- four extraordinary characters who inhabit a dark near-future world reminiscent of Blade Runner and The Crow. Become Caleb, the vicious protagonist from the original Blood, his cold-blooded love Ophelia, the ruthless Ishmael, or the unrelenting warrior Gabriela. Blood 2: The Chosen uses Monolith?s LithTech - one of the most advanced next-generation 3D engines in gaming. Blood 2?s weapons let you kill and be killed in more ways than any other 3D action game. Burn, electrocute, shoot, stab, voodoo, blow up, slowly dismember, or flay the skin from your opposition, and expect the same treatment right back! Take on a virtual army of enemies, from homicidal cultists to otherworldly horrors beyond imagining. Blood 2 has over 20 all new enemies to fight, as well as one returning fiend from the first game. [Monolith]… Expand"}, {"name": "After Burner Climax", "details_link": "https://www.metacritic.com/game/xbox-360/after-burner-climax", "publisher": "Sega", "release_date": "Apr 21 2010", "developers": ["Sega AM2"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 72, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/eb68f1f7a4222f8f0b966a8b4b98601c-98.jpg", "descriptions": "[Xbox Live Arcade]  The classic arcade game After Burner has now returned for a new generation of gamers. After Burner Climax is fast and frantic action, putting you in the cockpit of the world’s fastest fighter plane. Dodge planes, rockets and bullets while trying to target multiple[Xbox Live Arcade]  The classic arcade game After Burner has now returned for a new generation of gamers. After Burner Climax is fast and frantic action, putting you in the cockpit of the world’s fastest fighter plane. Dodge planes, rockets and bullets while trying to target multiple on-screen enemy aircraft. Built for all skill levels, everyone will be able to take to the air and blaze through a branching storyline and over 20 stages. Unlock achievements along the way to unlock exclusive Avatar Awards using your experience and expertise. [Sega]… Expand"}, {"name": "MotorStorm Arctic Edge", "details_link": "https://www.metacritic.com/game/playstation-2/motorstorm-arctic-edge", "publisher": "SCEA", "release_date": "Oct 20 2009", "developers": ["Virtuos"], "platforms": "PlayStation 2", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 72, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/65a8c1b03865e899761c68fe54c88cf0-98.jpg", "descriptions": "MotorStorm's next mission is battling the frozen wasteland of Alaska's Arctic Edge. MotorStorm Arctic Edge delivers brutal off-road racing in the beautiful yet lethal and unpredictable setting of Alaska. With temperatures plummeting, sudden avalanches, broken ice bridges, and three differentMotorStorm's next mission is battling the frozen wasteland of Alaska's Arctic Edge. MotorStorm Arctic Edge delivers brutal off-road racing in the beautiful yet lethal and unpredictable setting of Alaska. With temperatures plummeting, sudden avalanches, broken ice bridges, and three different racing altitudes, Arcitc Edge is the most inhospitable environment in the franchise's history. In addition to the six vehicle classes from the original MotorStorm, two new vehicles (the Snowcat and Snow Machine) have been introduced to combat the ice, the cold and the snow. One has the power and size to blast through packed snow, while the other has the grip and pace to combat most of what the sub-zero conditions can throw at it. MotorStorm Arctic Edge is fit for single player action, online multiplayer or playing with friends; two to eight players can compete against each other wirelessly via Ad Hoc Mode on PSP. Alternatively, you can also compete via online multiplayer using Infrastructure Mode on PSP to make it to the summit of the online global leaderboards.… Expand"}, {"name": "Mortal Kombat vs. DC Universe", "details_link": "https://www.metacritic.com/game/xbox-360/mortal-kombat-vs-dc-universe", "publisher": "Midway", "release_date": "Nov 16 2008", "developers": ["Midway"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "3D"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/a506dc7512e1ab7207336f231efaaf8f-98.jpg", "descriptions": "For the first time ever Scorpion, Sub-Zero and the Mortal Kombat warriors battle with Batman, Superman and other popular DC Universe Super Heroes. Choose your side and challenge your opponents with a new fighting system including Freefall Kombat and Klose Kombat along with dynamicFor the first time ever Scorpion, Sub-Zero and the Mortal Kombat warriors battle with Batman, Superman and other popular DC Universe Super Heroes. Choose your side and challenge your opponents with a new fighting system including Freefall Kombat and Klose Kombat along with dynamic multi-tiered environments. Plus, pick your favorite character from MK or DCU and pursue a fighting adventure in the new single player mode with an intertwined storyline and two unique perspectives. [Midway]… Expand"}, {"name": "Boing! Docomodake DS", "details_link": "https://www.metacritic.com/game/ds/boing!-docomodake-ds", "publisher": "Ignition Entertainment", "release_date": "Mar 10 2009", "developers": ["Suzak"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/3e86360745d558a95ed5d9b3d49f2d38-98.jpg", "descriptions": "Dig and climb your way through puzzle based levels in Boing! Docomodake."}, {"name": "Cloudbuilt", "details_link": "https://www.metacritic.com/game/pc/cloudbuilt", "publisher": "Rising Star Games", "release_date": "Mar 20 2014", "developers": ["Coilworks"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/d03f56f7b31826ba07c0d029c11e67d9-98.jpg", "descriptions": "Cloudbuilt is a game of speed, precision and freedom. Quick wits and even quicker reflexes will become your closest friends as you carve your own path through the mysterious floating ruins high above the clouds. Use your rocket-powered exoskeleton and manipulate the laws of physics to avoidCloudbuilt is a game of speed, precision and freedom. Quick wits and even quicker reflexes will become your closest friends as you carve your own path through the mysterious floating ruins high above the clouds. Use your rocket-powered exoskeleton and manipulate the laws of physics to avoid fatal hazards, dodge hostile robots… Expand"}, {"name": "Gel: Set & Match", "details_link": "https://www.metacritic.com/game/xbox-360/gel-set-match", "publisher": "Gastronaut Studios", "release_date": "May 20 2009", "developers": ["Gastronaut Studios"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/654df03f156027f9a73cb5778adfa4a5-98.jpg", "descriptions": "[Xbox Live Arcade]  Gel: Set & Match offers brain-busting fun for everyone with its unique take on puzzle gameplay. Match colored blocks together and they melt, but throw a melting block into another one and the chain continues! In Puzzle Mode, blocks are arranged to test your wits. Action[Xbox Live Arcade]  Gel: Set & Match offers brain-busting fun for everyone with its unique take on puzzle gameplay. Match colored blocks together and they melt, but throw a melting block into another one and the chain continues! In Puzzle Mode, blocks are arranged to test your wits. Action mode throws in a side-scrolling twist and challenges you to clear a path. Battle mode puts you up against your friends in fast-paced multiplayer showdowns. Jiggle up, and get ready for fun. [Gastronaut]… Expand"}, {"name": "Blazing Angels 2: Secret Missions of WWII", "details_link": "https://www.metacritic.com/game/xbox-360/blazing-angels-2-secret-missions-of-wwii", "publisher": "Ubisoft", "release_date": "Sep 18 2007", "developers": ["Ubisoft Romania"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/ce5127e00e25aa8f5935d36c355ad053-98.jpg", "descriptions": "Blazing Angels 2: Secret Missions shows World War II from a different perspective – that of an elite pilot who is part of a secret team. In the game, the player undertakes some of the most dangerous missions in exotic locations all over the globe. As an elite pilot, the player goes from oneBlazing Angels 2: Secret Missions shows World War II from a different perspective – that of an elite pilot who is part of a secret team. In the game, the player undertakes some of the most dangerous missions in exotic locations all over the globe. As an elite pilot, the player goes from one great adventure to another, while battling the most lethal experimental weapons of the Third Reich. The squad's mission is to prevent the ultimate weapon from being built. To help players in this quest, they have at their disposal an assortment of highly experimental aircraft and weaponry. Secret Missions comes straight out of the history books of World War II's most top secret projects. Fly above hills and mountains, navigate through treacherous mountain passes and dogfight in the clouds with enemies. Take part in large-scale battles through various conditions: darkness, rain, snow, and air turbulence. Secret Missions takes players around the world, from Paris, Rome and Moscow to exotic locations like Rangoon and Cairo and the highest mountain ranges of the Himalayas. Each mission brings its own surprises, twists and unique challenges. Players have access to some of the most advanced and unusual aircraft and weapons of WWII, as well as access to a huge assortment of weapons, including high-velocity cannons and early guided missiles. Multiplayer features free-for-all, co-op and squad-based play, including the brand new Capture the Flag and Epic Battle modes, the latter pitting two teams of players against each other in a large-scale battle with conquerable bases and objectives that can be destroyed in order to gain the upper hand on the opponent. [Ubisoft]… Expand"}, {"name": "Star Ocean: The Last Hope", "details_link": "https://www.metacritic.com/game/xbox-360/star-ocean-the-last-hope", "publisher": "Square Enix", "release_date": "Feb 24 2009", "developers": ["Square Enix", "Tri-Ace"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/e0466d499446ced7c72f79eb51d0292b-98.jpg", "descriptions": "STAR OCEAN: THE LAST HOPE continues the franchise's soaring space opera, blending science fiction with fantasy for a unique RPG experience. The refined gameplay features four party members and team-oriented combat, while maintaining the innovative real-time battle system that has become aSTAR OCEAN: THE LAST HOPE continues the franchise's soaring space opera, blending science fiction with fantasy for a unique RPG experience. The refined gameplay features four party members and team-oriented combat, while maintaining the innovative real-time battle system that has become a trademark of the STAR OCEAN franchise. The year is S.D. 10. In the aftermath of World War III, humanity voyages into the stars in search of a new home - and a second chance. A prequel that combines sci-fi and fantasy elements, spanning multiple planets and the vastness of space itself to recount the origins of the STAR OCEAN universe. Exhilarating combat expands upon the franchise's famous real-time battle system, including the amazing graphics and visual effects only possible on Xbox 360. Features CG movies by Visual Works, the cutting-edge studio whose previous work includes cut scenes for the acclaimed Final Fantasy RPG series. [Square Enix]… Expand"}, {"name": "Ultimate Ghosts 'n Goblins", "details_link": "https://www.metacritic.com/game/psp/ultimate-ghosts-n-goblins", "publisher": "Capcom", "release_date": "Aug 29 2006", "developers": ["TOSE"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/60b8caa84acb974d0923690b28389976-98.jpg", "descriptions": "In Ultimate Ghosts 'n Goblins, Arthur's heroic battle with the underworld was finally over and the entrance to the realm was sealed. So he thought. Time passes and unknowing to mankind, the dark lord has awaken from his slumber and kidnaps the princess in an effort to conquer the humanIn Ultimate Ghosts 'n Goblins, Arthur's heroic battle with the underworld was finally over and the entrance to the realm was sealed. So he thought. Time passes and unknowing to mankind, the dark lord has awaken from his slumber and kidnaps the princess in an effort to conquer the human world. Arthur must set off for the evil forest, the gateway to the underworld, to save the princess from imminent doom and keep the devil as well as his minions at bay. The excitement and intensity of the forerunner continues as our armored hero takes on this new challenge for the sake of humanity. With the use of a 3D graphics engine, the Ultimate Ghosts 'n Goblins world comes alive as effects, cutscenes, backgrounds and animations are given more depth and richer detail. Retaining the classic design of the series, several new facets have been created including a broader range of motion and new control techniques. Now our hero has the capability to dash, double-jump, shoot up or down in a vertical fashion, grab onto ledges, etc. With a new leveling system, allows gamers to build up Arthur’s skills for more powerful magic abilities and attacks. With the addition of extra lives, death doesn’t mean starting from a check point but rematerializing where they left off. [Capcom]… Expand"}, {"name": "NBA Live 18", "details_link": "https://www.metacritic.com/game/playstation-4/nba-live-18", "publisher": "Electronic Arts", "release_date": "Sep 15 2017", "developers": ["EA Sports"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Sim"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/74165d8e3a6808278f6782a3d745758d-98.jpg", "descriptions": "NBA LIVE 18 introduces THE ONE, a new, dynamic career experience centered on your player, your choices and your legacy. Create your unique player identity and decide how you become a legend by mastering your selected role on the court along with signature abilities and traits, only you canNBA LIVE 18 introduces THE ONE, a new, dynamic career experience centered on your player, your choices and your legacy. Create your unique player identity and decide how you become a legend by mastering your selected role on the court along with signature abilities and traits, only you can pull off. Embark on your quest to be the greatest basketball player on the planet in The League and The Streets with, or against other players in solo, co-op and multiplayer challenges delivered through LIVE Event content. Dominate the court with innovative one-on-one gameplay arming you with an arsenal of all-new moves for each position with unprecedented control and responsiveness. Put your new-found skills to the test as you manage and build your favorite team in Franchise and Live Ultimate Team. … Expand"}, {"name": "The Club", "details_link": "https://www.metacritic.com/game/playstation-3/the-club", "publisher": "Sega", "release_date": "Feb 19 2008", "developers": ["Bizarre Creations"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/e5a6cccf6c99f8097e93f6b3704e0092-98.jpg", "descriptions": "The Club is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, lethal weapons and an in-depth story structure. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influentialThe Club is a new breed of third-person shooter, combining fast-paced run and gun gameplay, destructive environments, lethal weapons and an in-depth story structure. You will fight to survive in a shadowy underground blood-sport controlled by a faceless, obscenely wealthy and influential elite who place their bets on who will survive as the blood-bath ensues before them. Take control of up to eight uniquely trained killers motivated by greed, driven by pure insane bloodlust, and hell bent on earning respect on a global level. As one of eight fighters, blast your way through five single player game modes including: Standard Mode, Time Attack, Survivor, Siege, and Run the Gauntlet. Earn Respect Online. Shoot your way to the top of the leader boards in over nine cut-throat multiplayer modes.  Face-off with 15 real-time opponents online or battle with your friends offline in 4-player split-screen action modes. Battle in eight unique real-world locations from around the globe, including war-torn cities, abandoned factories, steel mills and many more. Extreme Gun Battles in Hazardous Environments: A motion blur camera system intensifies the adrenaline rush in both open range and close quarter firefights. Destroy and manipulate objects in the environment to your advantage. A unique score-based accumulation system creates even more competition among players; the faster, more efficient and accurate that you are, the more points you will earn to unlock weapons, characters and maps. There are 17 high-powered assault weapons to choose from and customize, including Automatic Weapons, Sniper Rifles, High Caliber Pistols, Sub Machine Guns, and Mounted Weapons. Each Character has a Story to Tell. [Sega]… Expand"}, {"name": "Tiger Woods PGA Tour 08", "details_link": "https://www.metacritic.com/game/psp/tiger-woods-pga-tour-08", "publisher": "EA Sports", "release_date": "Aug 28 2007", "developers": ["EA Salt Lake"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/402729ec16b699f9f955cfde95861acf-98.jpg", "descriptions": "All-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. Nine Unique MentalAll-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. Nine Unique Mental GamesRegain your composure and stay focused while playing one of the new confidence building micro-games. 14 Championship Courses Featuring eight new courses, experience the all-new PGA TOUR FedExCup championship format by teeing up at Westchester Country Club, TPC of Boston, Cog Hill, and East Lake. [Electronic Arts]… Expand"}, {"name": "Monsters (Probably) Stole My Princess", "details_link": "https://www.metacritic.com/game/psp/monsters-probably-stole-my-princess", "publisher": "Mediatonic", "release_date": "Apr 22 2010", "developers": ["Mediatonic"], "platforms": "PSP", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/657cc0eab73375eadb305967d4b129cb-98.jpg", "descriptions": "[PSP Minis]  Take control of the aristocratic demon known only as The Duke in an upwards-scrolling platformer and chase down fleeing monsters."}, {"name": "Nintendo Switch Sports", "details_link": "https://www.metacritic.com/game/switch/nintendo-switch-sports", "publisher": "Nintendo", "release_date": "Apr 29 2022", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "2 ", "genres": ["Sports", "General", "Individual", "Athletics"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/57fa968ab17c361d8c5667eb46e28a28-98.jpg", "descriptions": "Swing, kick, spike, and bowl your way to victory in a sports collection that will get the whole family moving. Get moving* with Soccer, Volleyball, Bowling, Tennis, Badminton, and Chambara (Swordplay) using Joy-Con™ controllers! Controls are intuitive, so you can hit the court (or lanes, orSwing, kick, spike, and bowl your way to victory in a sports collection that will get the whole family moving. Get moving* with Soccer, Volleyball, Bowling, Tennis, Badminton, and Chambara (Swordplay) using Joy-Con™ controllers! Controls are intuitive, so you can hit the court (or lanes, or field, or arena) and get started. With controlled motions you can curve your bowling ball, add spin to a tennis shot, or even use a Joy-Con with the Leg Strap accessory to kick the ball in a Soccer Shootout. Family and friends can join in on the fun on the same system** or online***. Plus a seventh sport is planned to be added via a free update this fall; get ready to Golf!****\r Play online and face opponents near and far to earn in-game rewards or aim for the Pro League\r Face off against opponents worldwide and strive to reach the Pro League in every sport. As you play online*** in random matchmaking, redeem points you earn for in-game rewards like outfits, sports accessories, gear, and much more for your avatar. The selection of items will rotate each week, so check back and see what’s in stock!\r Play with friends and family in the same room or across the world\r Bowl, spike, and duel with friends in all 6 sports! Pass a Joy-Con controller to a friend** for some 1v1, 2v2, or a free-for-all that will get everyone moving. In Bowling, all players can bowl simultaneously—no waiting for your turn. Play each game online***, or team up with a friend on the same system to take on opponents near and far in team sports like Volleyball and Tennis.\r… Expand"}, {"name": "The Adventure Pals", "details_link": "https://www.metacritic.com/game/playstation-4/the-adventure-pals", "publisher": "Armor Games", "release_date": "Apr  3 2018", "developers": ["Massive Monster"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 72, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/a0a4c9b5f486817ffabd6d4f7b7aefdd-98.jpg", "descriptions": "Inspired by classic platformers and cartoons , The Adventure Pals sets you and your best friends (a giraffe and a rock) out to save the world and your dad from turning into hotdogs."}, {"name": "Squids Odyssey", "details_link": "https://www.metacritic.com/game/3ds/squids-odyssey", "publisher": "The Game Bakers", "release_date": "Jul  3 2014", "developers": ["The Game Bakers"], "platforms": ["PC", "Switch", "Wii U", "3DS"], "genres": ["Role-Playing", "Console-style RPG", "Japanese-Style"], "meta_score": 72, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/3924573bb91a249f068fc43f314e36f7-98.jpg", "descriptions": "A unique mix of action strategy and RPG!\r Squids Odyssey is a unique mix of action strategy and RPG: build your team of Squid heroes for epic turn-based battles against corrupted crabs and shrimps!\r\n\r\nSteev, Vahine and the rest of the Squids are in danger! An infectious black ooze isA unique mix of action strategy and RPG!\r Squids Odyssey is a unique mix of action strategy and RPG: build your team of Squid heroes for epic turn-based battles against corrupted crabs and shrimps!\r Steev, Vahine and the rest of the Squids are in danger! An infectious black ooze is corrupting their world. The band of unlikely heroes need to fight back to save their underwater kingdom!\r Squids Odyssey is not just about gorgeous cartoon art, jaunty music and humorous storytelling, the battles also provide a deep challenge as strategy and skill are required to use the environment, the Squids strengths, and enemies weaknesses to victory!\r Features:\r-More than 15 hours of gameplay, 90+ levels and 15 Squids, plus the Pro Mode!\r-Recruit a unique team of Squids in four different classes: shooters, scouts, troopers and healers\r-Customize your party with special ability-boosting and crazy looking helmets\r-An epic story with giant turtle rides and heroic boss battles\r-Discover the Squids' legendary world through gorgeous levels.… Expand"}, {"name": "Need for Speed ProStreet", "details_link": "https://www.metacritic.com/game/xbox-360/need-for-speed-prostreet", "publisher": "EA Games", "release_date": "Nov 15 2007", "developers": ["EA Black Box"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 72, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/b37a41f261289a784f7324810f45e4ec-98.jpg", "descriptions": "Need for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting yourNeed for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting your skills and reputation against the very best street racers. Need for Speed ProStreet boasts impeccable precision and impressively detailed photo-realistic graphics, effectively transporting you to the center of the action. It pushes the Autosculpt technology to a new level, allowing you to directly impact your car's performance for the first time as well as personalize its appearance. Need for Speed ProStreet is a true taste of raw adrenaline and racing with consequences. Every dent, every scratch and every crumpled body panel is a battle scar, proof of your commitment and competitive mettle. With an aggressive and skilled AI system, you become immersed in an unmatched believable race experience. Add in a revolutionary online mode that will redefine the meaning of competitive social play, and Need for Speed ProStreet is the ultimate formula for an emotionally charged street racing showdown. [Electronic Arts]… Expand"}, {"name": "Mafia II: Definitive Edition", "details_link": "https://www.metacritic.com/game/pc/mafia-ii-definitive-edition", "publisher": "2K Games", "release_date": "May 19 2020", "developers": ["Hangar 13"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 72, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/71c78be78faa0ce1fb87bbc49e2c4f00-98.jpg", "descriptions": "After taking a bullet during World War II and returning home to Empire Bay on leave, Sicilian immigrant Vito Scaletta discovers that his late father was indebted to a loan shark. He needs to make a lot of money fast, and thanks to his career criminal best friend Joe, soon becomes entangledAfter taking a bullet during World War II and returning home to Empire Bay on leave, Sicilian immigrant Vito Scaletta discovers that his late father was indebted to a loan shark. He needs to make a lot of money fast, and thanks to his career criminal best friend Joe, soon becomes entangled with the mob. As Vito, you need to prove yourself by committing crimes of escalating reward, status, and consequence. But what happens when your motivations become less about necessity and more about greed? When having it all is not enough? For the first time ever, Mafia II: Definitive Edition packs the entire Mafia II crime drama into one HD package. HDR and 4K resolution are supported on PC as well as on PlayStation®4 Pro and Xbox One X consoles. Mafia II: Definitive Edition also benefits from improved facial animations to give cutscenes an even more cinematic feel. While technological and graphical improvements have given Empire Bay and its inhabitants a visual overhaul, Vito's timeless story is unchanged.… Expand"}, {"name": "Snake Pass", "details_link": "https://www.metacritic.com/game/switch/snake-pass", "publisher": "Sumo Digital", "release_date": "Mar 28 2017", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Puzzle", "Action", "General"], "meta_score": 72, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/03dd728b959acf7d4b7e202d803e7c3d-98.jpg", "descriptions": "THINK LIKE A SNAKE!\r When the tranquillity of Haven Tor is interrupted by a mysterious interloper only the unlikeliest of heroes can save the day! Meet Noodle the Snake and his hyperactive best friend, Doodle the Hummingbird, who together must re-unite the missing Keystones with theTHINK LIKE A SNAKE!\r When the tranquillity of Haven Tor is interrupted by a mysterious interloper only the unlikeliest of heroes can save the day! Meet Noodle the Snake and his hyperactive best friend, Doodle the Hummingbird, who together must re-unite the missing Keystones with the magical gates that give Haven Tor its mythical power.\r A unique, physics based puzzle platform game, Snake Pass challenges players to 'think like a snake' as they tackle precarious puzzles as only a snake can. Slither through long grass, coil around bamboo and climb out of trouble in the latest game from award winning independent studio Sumo Digital!\r Master Noodle's one-of-a-kind abilities\r -Unravel the mystery of the nefarious gatecrasher\r-Restore Haven Tor to its former glory\r-Slither into every nook and cranny in search of cunning collectibles\r-A brand-new soundtrack from fan favourite composer David Wise… Expand"}, {"name": "Grandia HD Collection", "details_link": "https://www.metacritic.com/game/switch/grandia-hd-collection", "publisher": "GungHo", "release_date": "Aug 16 2019", "developers": ["GungHo"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Compilation", "Japanese-Style"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/04a87a33de4e9a3a760c14665df104f9-98.jpg", "descriptions": "Grandia and Grandia 2, a pair of games originally released on Sega's Saturn and Dreamcast consoles, respectively, are coming to Nintendo Switch. Both games feature newly retouched details for the user interface, sprites, and textures, enhanced cinematics, Japanese and English audio tracks,Grandia and Grandia 2, a pair of games originally released on Sega's Saturn and Dreamcast consoles, respectively, are coming to Nintendo Switch. Both games feature newly retouched details for the user interface, sprites, and textures, enhanced cinematics, Japanese and English audio tracks, and Japanese and English language support along with new French and German translations.… Expand"}, {"name": "SILT", "details_link": "https://www.metacritic.com/game/pc/silt", "publisher": "Sold Out", "release_date": "Jun  1 2022", "developers": ["Spiral Circus"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 72, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/ea1e26e389209aad1d960be780ec9ac4-98.jpg", "descriptions": "Silt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roamSilt is a puzzle-adventure set deep within a harrowing ocean abyss, where you play as a lone diver searching the deep and exploring dangerous waters to uncover long-forgotten mysteries. But the diver has a secret. Harnessing an unusual power, you’ll be able to possess sea creatures that roam the ocean void, discovering new creatures and using their unique abilities to solve puzzles, traverse the environment, and make your way deeper into the darkness.… Expand"}, {"name": "Kingdoms of Amalur: Re-Reckoning", "details_link": "https://www.metacritic.com/game/xbox-one/kingdoms-of-amalur-re-reckoning", "publisher": "THQ Nordic", "release_date": "Sep  8 2020", "developers": ["Kaiko"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/dea0c1953696c2ae46b716b38b8e9c1e-98.jpg", "descriptions": "The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, spawn creator Todd mcfarlane, and Elder Scrolls IV: oblivion lead designer Ken rolston, comes kingdoms of amalur: re-reckoning. Remastered with stunning visuals and refined gameplay re-reckoning delivers intense,The hit RPG returns! From the minds of the bestselling author R.A. Salvatore, spawn creator Todd mcfarlane, and Elder Scrolls IV: oblivion lead designer Ken rolston, comes kingdoms of amalur: re-reckoning. Remastered with stunning visuals and refined gameplay re-reckoning delivers intense, customizable RPG combat inside a sprawling game world. Uncover the secrets of amalur, from the vibrant city of rathir to the vast region of dalentarth to the grim dungeons of the brigand Hall caverns. Rescue a world torn apart by a vicious war and control the keys to immortality as the first Warrior ever to be resurrected from the grips of death. * Build the ideal character for the most intense combat, choosing from a countless combinations of skills, abilities, weapons and pieces of armor* The revolutionary destiny system allows you to continuously evolve your character class to your style of play* Seamlessly Integrate magical and melee attacks as you take on scores of enemies in grand fight sequences and finish them Off with brutal fate shift kills* Extend your experience in amalur with all DLC from the original release, from teeth of naros to Legend of Dead kel and more!* Hundreds of hours of RPG play await! Travel from the vibrant city of rathir, to the vast region of dalentarth, and the grim dungeons of the brigand Hall caverns as you uncover the secrets of amalur!… Expand"}, {"name": "Mirror's Edge Catalyst", "details_link": "https://www.metacritic.com/game/xbox-one/mirrors-edge-catalyst", "publisher": "Electronic Arts", "release_date": "Jun  7 2016", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Modern", "Modern", "Action Adventure", "General"], "meta_score": 72, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/516bfc5db64dec70882b605ad9fb7327-98.jpg", "descriptions": "Through Mirror’s Edge Catalyst, experience the emergence of Faith, a brave Runner who uncovers a hidden truth inside the walls of the city of Glass. Through her journey, Faith explores every corner of the city, from the highest, most pristine skyscrapers, to the dark and dingy tunnels thatThrough Mirror’s Edge Catalyst, experience the emergence of Faith, a brave Runner who uncovers a hidden truth inside the walls of the city of Glass. Through her journey, Faith explores every corner of the city, from the highest, most pristine skyscrapers, to the dark and dingy tunnels that underlie the city. Players must master the environment, using their momentum and timing their combat to fight the oppressiveness of the ruling elite, uncovering the dark secrets behind the city’s beautiful façade. Mirror’s Edge Catalyst offers players the freedom to explore the expanse of the city, discovering a variety of new activities, like ‘Dash’, races from point A to B, environmental puzzles and story missions to complete at their leisure. [EA]… Expand"}, {"name": "Pid", "details_link": "https://www.metacritic.com/game/xbox-360/pid", "publisher": "D3Publisher", "release_date": "Oct 31 2012", "developers": ["Might and Delight"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/407894948817ea7a89a3f7e3730b5aee-98.jpg", "descriptions": "In the fantastic world of Pid, the player's unique and eccentric journey unfolds as the young protagonist is stranded on a remote planet. Players hone their gaming abilities through creative approaches to gravity-bending action, intricate puzzle-solving and classic precision platform action,In the fantastic world of Pid, the player's unique and eccentric journey unfolds as the young protagonist is stranded on a remote planet. Players hone their gaming abilities through creative approaches to gravity-bending action, intricate puzzle-solving and classic precision platform action, overcoming larger-than-life obstacles and truly original enemies and characters. Throughout the course of the adventure, players will be challenged to outwit a variety of quirky robots and befriend unlikely allies on their quest to face-off against a ruler that has no intention of letting anyone leave the planet.… Expand"}, {"name": "Dragon Ball Z: Burst Limit", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-ball-z-burst-limit", "publisher": "Atari", "release_date": "Jun 10 2008", "developers": ["Dimps Corporation", "Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/f835b16b9838bf7821a4e5285e306292-98.jpg", "descriptions": "Dragon Ball Z: Burst Limit is the first game of the Dragonball Z series to hit the next generation consoles. During each battle, find conditions to create new dramatic scenes. After the battles, watch a unique story unfold each time you play. There is also a stronger element of offence andDragon Ball Z: Burst Limit is the first game of the Dragonball Z series to hit the next generation consoles. During each battle, find conditions to create new dramatic scenes. After the battles, watch a unique story unfold each time you play. There is also a stronger element of offence and defence, due to added energy saving and fighting techniques. Competition grows with the ability to play online in both the co-op and vs. modes. During each battle, find conditions to create new scenes and watch a unique story unfold at the end of each game. Experience visuals and movement reminiscent of the anime due to Z3 shading technology and detailed effects. Increased speed of charge and release on the field, free movement around the field, and increased speed and power of attacks. Use of special skills will no longer drain energy. The lower your energy, the stronger you get, making for a possible turnaround of the battle. Each character in the game has his own \"Fatal Blow\". If the player successfully attacks his opponent, this would be a finishing move, but if not, it will put the player in the disadvantageous situation, and he must battle with no Fatal Blow for the rest of the battle. [Atari]… Expand"}, {"name": "The Sims: Life Stories", "details_link": "https://www.metacritic.com/game/pc/the-sims-life-stories", "publisher": "EA Games", "release_date": "Feb  6 2007", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/46d655e71dd160b4be611da232392319-98.jpg", "descriptions": "Play through all the great moments of your Sim's life in this easy-to-play, laptop-friendly version of The Sims. In the new and engaging directed Story mode, you take your Sims through a unique and entertaining storyline full of romance and dramatic twists. You even unlock cool rewards alongPlay through all the great moments of your Sim's life in this easy-to-play, laptop-friendly version of The Sims. In the new and engaging directed Story mode, you take your Sims through a unique and entertaining storyline full of romance and dramatic twists. You even unlock cool rewards along the way as you achieve set goals. In open-ended Classic mode, you create Sims and then choose how they'll fulfill their dreams through life's biggest moments. Stay connected by using your own IM and email while playing. [Electronic Arts]… Expand"}, {"name": "Shrek 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/shrek-2", "publisher": "Activision", "release_date": "Apr 28 2004", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 72, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/3802072fa1e2387416f2caac04e87f0c-98.jpg", "descriptions": "Shrek 2 takes players on a twisted fairy tale adventure with Shrek and his buddies.  Revisit key locations from the movie sequel while discovering all-new locations and characters.  Shrek 2 combines squad-based action with traditional action adventure elements.  You control a team of fourShrek 2 takes players on a twisted fairy tale adventure with Shrek and his buddies.  Revisit key locations from the movie sequel while discovering all-new locations and characters.  Shrek 2 combines squad-based action with traditional action adventure elements.  You control a team of four and play as Shrek or any of his ten friends, switching between each to best utilize the character's unique abilities to solve puzzles, fight monsters, and complete wild and dangerous adventures.… Expand"}, {"name": "Sonic Heroes", "details_link": "https://www.metacritic.com/game/gamecube/sonic-heroes", "publisher": "Sega", "release_date": "Jan  5 2004", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 72, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/8ce2beb309461cbc5665dd5eb78a0a55-98.jpg", "descriptions": "Sonic Heroes brings the Sonic series to the PS2 and Xbox for the first time.  Dr.  Eggman is causing havoc again and it's up to you to maneuver a team of three Sonic characters through massive levels.  All 12 characters--divided into Team Sonic, Team Dark, Team Rose and Team Chaotix--haveSonic Heroes brings the Sonic series to the PS2 and Xbox for the first time.  Dr.  Eggman is causing havoc again and it's up to you to maneuver a team of three Sonic characters through massive levels.  All 12 characters--divided into Team Sonic, Team Dark, Team Rose and Team Chaotix--have their own unique strengths, so choose your teams wisely.  Find the best combination to complete missions full of enemies, puzzles, and huge environments.  No matter what team you choose, the only direction is forward and the only way to get there is fast.… Expand"}, {"name": "Secret Weapons Over Normandy", "details_link": "https://www.metacritic.com/game/pc/secret-weapons-over-normandy", "publisher": "LucasArts", "release_date": "Nov 18 2003", "developers": ["Totally Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 72, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/120da6c988dc9158a4f529abc504d4c0-98.jpg", "descriptions": "Join a secret squad of pilots dedicated to thwarting the most heinous plans of the Third Reich. Fly over twenty authentic aircraft across thirty daring missions in this new WWII action-flyer. Lawrence Holland, the legendary creator of \"Star Wars X-Wing,\" \"Star Wars Tie Fighter\" and \"SecretJoin a secret squad of pilots dedicated to thwarting the most heinous plans of the Third Reich. Fly over twenty authentic aircraft across thirty daring missions in this new WWII action-flyer. Lawrence Holland, the legendary creator of \"Star Wars X-Wing,\" \"Star Wars Tie Fighter\" and \"Secret Weapons of the Luftwaffe\" returns with an exhilarating new game of action and intrigue. Can you be trusted with the most dangerous secrets of the war? Immerse yourself in intense WWII flight action as you make your way through the ranks of an elite fighter squadron. Fly more than twenty realistic aircraft across a variety of combat theaters over World War II Europe and other territories as you make your way through the ranks of an elite fighter squadron. Engage in over thirty action-packed missions featuring air-to-air and air-to-ground battle scenarios. [LucasArts]… Expand"}, {"name": "Romance of the Three Kingdoms VII", "details_link": "https://www.metacritic.com/game/playstation-2/romance-of-the-three-kingdoms-vii", "publisher": "Koei", "release_date": "Jun 25 2002", "developers": ["Koei"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 72, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/fc243f176e0f9e88064c6e537e18fd5b-98.jpg", "descriptions": "This title is the latest in the popular Romance of the Three Kingdoms series of strategy games revolving around the Three Kingdoms period of ancient China.  RTK VII introduces a number of dramatic improvements to the series, such as the ability to play as any character in the game, as wellThis title is the latest in the popular Romance of the Three Kingdoms series of strategy games revolving around the Three Kingdoms period of ancient China.  RTK VII introduces a number of dramatic improvements to the series, such as the ability to play as any character in the game, as well as a variety of character roles/positions. [KOEI]… Expand"}, {"name": "Pirates: The Legend of Black Kat", "details_link": "https://www.metacritic.com/game/playstation-2/pirates-the-legend-of-black-kat", "publisher": "Electronic Arts", "release_date": "Feb 17 2002", "developers": ["Westwood Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 72, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/c86b9d2dfc216bd6d510526cd7f306e5-98.jpg", "descriptions": "Take to the high seas as fearless pirate Katarina de Leon, the \"Black Kat.\" Master a dozen pirate ships from the simple gunboat to the massive Man 'O War. Discover and explore increasingly dangerous and fantastic island worlds. Develop swordplay skills to defeat evil pirate bands and lootTake to the high seas as fearless pirate Katarina de Leon, the \"Black Kat.\" Master a dozen pirate ships from the simple gunboat to the massive Man 'O War. Discover and explore increasingly dangerous and fantastic island worlds. Develop swordplay skills to defeat evil pirate bands and loot their treasures. [Electronic Arts]… Expand"}, {"name": "ESPN International Track & Field", "details_link": "https://www.metacritic.com/game/playstation-2/espn-international-track-field", "publisher": "Konami", "release_date": "Oct 25 2000", "developers": ["Konami Computer Entertainment Osaka"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Olympic Sports"], "meta_score": 72, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/20d7630b3f0f391fd2e98eb7b59d75c2-98.jpg", "descriptions": "Compete against the greatest athletes on earth in ESPN International Track & Field. Compete as or against top Olympic athletes in over 10 real world events. ESPN International Track and Field features over 750 motion-captured animations and true-to-life graphics and sounds that captureCompete against the greatest athletes on earth in ESPN International Track & Field. Compete as or against top Olympic athletes in over 10 real world events. ESPN International Track and Field features over 750 motion-captured animations and true-to-life graphics and sounds that capture the spirit of international track and field competition.… Expand"}, {"name": "Fantavision", "details_link": "https://www.metacritic.com/game/playstation-2/fantavision", "publisher": "SCEA", "release_date": "Oct 25 2000", "developers": ["SCEJ"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 72, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/6b122dfc46835e0207412c16059ca93e-98.jpg", "descriptions": "Catch 'em. Detonate 'em. Watch an explosive display of brilliant pyrotechnics that you control. Sound pretty simple. But once you get the hang of it, it gets faster, tougher and more fantastic than you could ever imagine!"}]