[{"name": "Shining Force Neo", "details_link": "https://www.metacritic.com/game/playstation-2/shining-force-neo", "publisher": "Sega", "release_date": "Oct 20 2005", "developers": ["Neverland"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/454f15d31f3b902ffd6bde6ae0fa6327-98.jpg", "descriptions": "New fast-paced gameplay takes the classic Shining Force franchise in a bold new direction. Shining Force Neo is an Action RPG featuring a dramatic, character-driven story and a high gloss anime aesthetic. Real-time combat creates a deeper sense of personal involvement in battles, and theNew fast-paced gameplay takes the classic Shining Force franchise in a bold new direction. Shining Force Neo is an Action RPG featuring a dramatic, character-driven story and a high gloss anime aesthetic. Real-time combat creates a deeper sense of personal involvement in battles, and the presence of more than 90 enemies on screen at once ratchets up the grand scale that the Shining Force games are known for. [Sega]… Expand"}, {"name": "Supreme Ruler 2010", "details_link": "https://www.metacritic.com/game/pc/supreme-ruler-2010", "publisher": "Strategy First", "release_date": "May 12 2005", "developers": ["BattleGoat Studios"], "platforms": "PC", "num_players": "16  Online", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "General"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/f8ba8cf17d49f519da746a35d43114ac-98.jpg", "descriptions": "The year is 2010 and the Major Powers of the world as we currently know them have disintegrated into bickering economic and military regions. The United Nations has disappeared, and in its place an organization with far sharper teeth referred to simply as \"The World Market\" has taken itsThe year is 2010 and the Major Powers of the world as we currently know them have disintegrated into bickering economic and military regions. The United Nations has disappeared, and in its place an organization with far sharper teeth referred to simply as \"The World Market\" has taken its place. Individual Regions are left to fight for power to dominate their neighbors, their countries, their continents, and then the world. Supreme Ruler 2010 represents the next generation of strategy game. Not another build and attack 'click fest', but a challenging simulation of political and military leadership. You control the agenda of your region as you maintain its economy, grow the support of your population, and strive to influence your neighbors. Through skilled management your influence and popularity will grow... Will you be a successful diplomat, who can increase your power through an incredibly flexible diplomacy model, or will you be a ruthless and ambitious ruler that lets your tanks and missiles speak for you? [Strategy First]… Expand"}, {"name": "SpongeBob SquarePants: The Cosmic Shake", "details_link": "https://www.metacritic.com/game/playstation-4/spongebob-squarepants-the-cosmic-shake", "publisher": "THQ Nordic", "release_date": "Jan 31 2023", "developers": ["Purple Lamp Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/f6fca56d21cefbc86eb7259a4e45b65a-98.jpg", "descriptions": "Wish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that'sWish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that's nothing everyone's favorite sponge can't handle - with the right cosmic costume! Everybody do the Cosmic Shake!Features* Unlock classic and new platforming skills like the Fishhook Swing and Karate Kick* Don more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar* Travel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom* Experience all the buddy movie banter with SpongeBob's permanent companion Balloon-Patrick* Meet all your favorite Bikini Bottomites from the series, voiced by their original actors* Enjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory… Expand"}, {"name": "Clandestine", "details_link": "https://www.metacritic.com/game/pc/clandestine", "publisher": "Logic Artists", "release_date": "Nov  5 2015", "developers": ["Logic Artists"], "platforms": "PC", "genres": ["Modern", "Action Adventure", "General"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/0a2c4c3fd641ed4bdefe87bb15f48998-98.jpg", "descriptions": "Clandestine is a 2-player or singleplayer stealth/hacking game set in 1996. Asymmetrical co-op allows one player to take the role of the spy while a friend provides overwatch and assistance as the hacker, and unravel a post-Cold War espionage conspiracy."}, {"name": "Master of Illusion", "details_link": "https://www.metacritic.com/game/ds/master-of-illusion", "publisher": "Nintendo", "release_date": "Nov 26 2007", "developers": ["Eighting", "Tenyo"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Application", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/b30183b0d26b4df4ba044a3b6705a38b-98.jpg", "descriptions": "(Known as \"Magic Made Fun\" in the UK/EU)  Unique magic tricks - possible only on the Nintendo DS - stun your audience in to saying \"How'd you do that?\" Become the master of your DS as you learn, perform and amaze your friends and family. The secrets of magic are now yours to behold.(Known as \"Magic Made Fun\" in the UK/EU)  Unique magic tricks - possible only on the Nintendo DS - stun your audience in to saying \"How'd you do that?\" Become the master of your DS as you learn, perform and amaze your friends and family. The secrets of magic are now yours to behold. Step-by-step tutorials let you unlock the mystery of more than 20 tricks. Three individual modes make this game fun solo or with friends. A “special” deck of cards packaged with the game creates a fully portable magic kit. Now the fun extends beyond your Nintendo DS. Interactive tricks make the DS your magic assistant. Draw; speak; tap; instruct; and blow in to the microphone to astonish your audience. The learning curve keeps growing: unlock new tricks as you advance in skill. [Nintendo]… Expand"}, {"name": "Speed Racer", "details_link": "https://www.metacritic.com/game/wii/speed-racer", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "May  6 2008", "developers": ["Sidhe Interactive"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Drag", "Futuristic", "Drag"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/2acd8f9c7bbb229b0e2cf06813b19ffa-98.jpg", "descriptions": "Players take on the role of the characters from the Speed Racer film, getting behind the wheels of each character’s signature vehicles to experience first hand the film’s high adrenaline, combative racing style.  The car-fu style of action within the game closely represent the action stylePlayers take on the role of the characters from the Speed Racer film, getting behind the wheels of each character’s signature vehicles to experience first hand the film’s high adrenaline, combative racing style.  The car-fu style of action within the game closely represent the action style designed by the Wachowski brothers for the film itself as they lend direction and assets to the development team directly from their Berlin set. Written and directed by the Wachowski brothers and produced by Joel Silver, Speed Racer is based on the classic series created by anime pioneer Tatsuo Yoshida. Speed Racer follows the young race car driver Speed in his quest for glory on and off the track in his thundering Mach 5. The film features other characters that fans of the show remember, including Speed's family and his mysterious arch-rival, Racer X. [Warner Bros.]… Expand"}, {"name": "Madden NFL 21", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-21", "publisher": "Electronic Arts", "release_date": "Aug 25 2020", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 69, "users_score": 0.5, "image": "https://static.metacritic.com/images/products/games/4/9e184d9ff7d2df2026daa06ef7a3f3c1-98.jpg", "descriptions": "Innovative new gameplay mechanics in Madden NFL 21 deliver advanced levels of control and inspire creativity. Get crafty with the all-new Skill Stick that allows for enhanced precision on both sides of the ball. Push the limits of your legacy in Face of the Franchise: Rise To Fame. The newInnovative new gameplay mechanics in Madden NFL 21 deliver advanced levels of control and inspire creativity. Get crafty with the all-new Skill Stick that allows for enhanced precision on both sides of the ball. Push the limits of your legacy in Face of the Franchise: Rise To Fame. The new playable documentary career mode offers all-out levels of agency and depth throughout your journey to the Hall of Fame. Pull up for a brand-new season of Ultimate Team content as you earn rewards to finesse your depth chart and flex your fantasy roster on the competition. Your favorite NFL teams’ playbooks are updated in Play Now and Franchise based on new schemes and new plays utilized during the real-life NFL season. [Electronic Arts]… Expand"}, {"name": "Final Fantasy Explorers", "details_link": "https://www.metacritic.com/game/3ds/final-fantasy-explorers", "publisher": "Square Enix", "release_date": "Jan 26 2016", "developers": ["Racjin"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/a7b7b171f6c6670e6ecc608ab81f7c86-98.jpg", "descriptions": "FINAL FANTASY EXPLORERS focuses on cooperative play with friends, utilizing a refined party system allowing Explorers to master over twenty jobs, each offering unique ways to defeat or even recruit the realm’s mightiest monsters. Players have the ability to call upon the powers of eidolonsFINAL FANTASY EXPLORERS focuses on cooperative play with friends, utilizing a refined party system allowing Explorers to master over twenty jobs, each offering unique ways to defeat or even recruit the realm’s mightiest monsters. Players have the ability to call upon the powers of eidolons like Ifrit and Bahamut, as well as to transform into legendary characters from the FINAL FANTASY series via the Trance ability. Multiplayer functionality is enabled through the Nintendo 3DS wireless communication. [Square Enix]… Expand"}, {"name": "Breathedge", "details_link": "https://www.metacritic.com/game/xbox-one/breathedge", "publisher": "HypeTrain Digital", "release_date": "Apr  6 2021", "developers": ["HypeTrain Digital"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/7a32b4daca77d3bd5100dbe4406ce69d-98.jpg", "descriptions": "Breathedge is an ironic outer space survival adventure game. Take on the role of a simple guy called the Man who is just carrying his grandpa's ashes to a galactic funeral and suddenly finds himself in the middle of a universal conspiracy.A massive space hearse suffers a wreck in the deepBreathedge is an ironic outer space survival adventure game. Take on the role of a simple guy called the Man who is just carrying his grandpa's ashes to a galactic funeral and suddenly finds himself in the middle of a universal conspiracy.A massive space hearse suffers a wreck in the deep space, leaving the area filled with debris, coffins, dead passengers and yourself. Survive in this interstellar dump, uncover a global conspiracy, save the princess and don't break your fingers while tapping the keyboard as you travel around the world (keeping your display on for full immersion is advised).It took a long time for our ancestors to develop because they had no electrical tape. You have it and you know how to use it. With this magical artifact, you can create a vast variety of useless objects and throw them out of the airlock! There are also many useful items to be created, but be careful as this may result in completing the game.When all your neighbors just hover around in vacuum doing nothing but playing dead, various tools and gears will help you become the worst noisy neighbor ever. Create a unique space station, provide it with oxygen and electricity, install all kinds of equipment from solar panels to a hamster farm, and turn it into a real bachelor pad by stuffing it with furniture mixed with all kinds of junk.Yes, you heard that right, it's your own private car horn! Besides that, you can assemble a small rocket, ride the dead or build a large space shuttle. Transportation helps you move faster, evade obstacles and see the death screen after a head-on collision.Surviving in space is fun, and surviving with a story is even more fun because you can just skip it all to annoy the scriptwriters! Breathedge offers you an intriguing plot with lots of dark jokes, cynical dialogues, an immortal chicken, a mad enemy, as well as badly animated cutscenes and other features that make an excellent game an excellent game.… Expand"}, {"name": "Pure Farming 2018", "details_link": "https://www.metacritic.com/game/pc/pure-farming-2018", "publisher": "Techland", "release_date": "Mar 13 2018", "developers": ["Ice Flames"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/7532d9cff90a20c8018b69df82e5fb7e-98.jpg", "descriptions": "Go global and expand your farm across four continents!Use the latest technology and state-of-the-art licensed machines to manage all aspects of modern farming, from cultivating land and growing crops to breeding livestock and producing green energy. Travel between Europe, Asia, and bothGo global and expand your farm across four continents!Use the latest technology and state-of-the-art licensed machines to manage all aspects of modern farming, from cultivating land and growing crops to breeding livestock and producing green energy. Travel between Europe, Asia, and both Americas to plant region-specific crops such as hemp, coffee beans, cherries, and olives using dedicated farming vehicles. Play the way you like best: three vastly different modes means this game is meant for you, no matter if you are a simulation veteran or an enthusiastic newcomer.… Expand"}, {"name": "Gradius ReBirth", "details_link": "https://www.metacritic.com/game/wii/gradius-rebirth", "publisher": "Konami", "release_date": "Mar  9 2009", "developers": ["M2"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/6356c9897d6cc05414bc5f7dca594238-98.jpg", "descriptions": "[WiiWare]  Blast your way through levels filled with alien spaceships and otherworldly creatures in this retro side-scrolling shooter. Pick your weapons carefully and upgrade them to create a devastating arsenal of space-aged weapons that will aid you in your challenging mission. Players can[WiiWare]  Blast your way through levels filled with alien spaceships and otherworldly creatures in this retro side-scrolling shooter. Pick your weapons carefully and upgrade them to create a devastating arsenal of space-aged weapons that will aid you in your challenging mission. Players can post their high scores to worldwide leader boards via Nintendo Wi-Fi Connection and see where they rank against all the other Gradius ReBirth players. Test your skills with Gradius ReBirth and see if you have what it takes to beat this action-packed arcade shooter. [Nintendo]… Expand"}, {"name": "The Dark Pictures Anthology: Man of Medan", "details_link": "https://www.metacritic.com/game/playstation-4/the-dark-pictures-anthology-man-of-medan", "publisher": "Bandai Namco Games", "release_date": "Aug 30 2019", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/9fe159e879b34377318a7837c89eac48-98.jpg", "descriptions": "DON'T PLAY ALONE - From the developers of Until Dawn..Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable characters canDON'T PLAY ALONE - From the developers of Until Dawn..Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable characters can live, any and all can die... Man of Medan is the first game in The Dark Pictures anthology, bringing supernatural horror to the South Pacific. Five friends set sail on a holiday diving trip with a rumored WWII wreck to find. As the day unfolds and a storm rolls in, their trip soon changes into something much more sinister. Who will live? Who will die? It's down to you. Can you save them all?\r Features:\r A NEW TERRIFYING EXPERIENCE\rSupermassive Games delivers a new, horrific narrative journey where you will have to confront your deepest fears.\r CAN YOU SAVE THEM ALL?\rAll payable characters can live and all can die. The choices you make will decide their fate. Death could be just around the corner...\r WHAT WILL YOU DO TO SURVIVE?\rEach choice you make has a consequence which can mean life or death for your character. Will you keep your head whilst struggling to survive? What decisions will you make?… Expand"}, {"name": "Archangel", "details_link": "https://www.metacritic.com/game/playstation-4/archangel", "publisher": "Skydance Interactive", "release_date": "Jul 18 2017", "developers": ["Skydance Interactive"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Shooter", "Vehicle", "First-Person", "Combat", "Arcade"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/a01c80292930631a736cff78012664ae-98.jpg", "descriptions": "Enter the cockpit of a six-story mech and feel its might at your command. You are the tip of the spear in the United States Free Forces’ war against the overwhelming mechanized forces of HUMNX, a tyrannical corporation that rules a post-apocalyptic America."}, {"name": "River City: Tokyo Rumble", "details_link": "https://www.metacritic.com/game/3ds/river-city-tokyo-rumble", "publisher": "Natsume", "release_date": "Sep 27 2016", "developers": ["Million", "Aplus"], "platforms": "3DS", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/9292ae776f1e44efda7385862aba18a1-98.jpg", "descriptions": "Follow the story of a hot-blooded high school student named Kunio and his good friends. When a nefarious gang moves into Tokyo to try to take it over, it's up to this self-proclaimed \"fighter for justice\" and his buddies to make sure the streets stay safe! Punch, kick, use weapons such asFollow the story of a hot-blooded high school student named Kunio and his good friends. When a nefarious gang moves into Tokyo to try to take it over, it's up to this self-proclaimed \"fighter for justice\" and his buddies to make sure the streets stay safe! Punch, kick, use weapons such as soccer balls, iron knuckles, chains, and even bicycles to knock some sense into those devious gang members. [Nintendo.com]… Expand"}, {"name": "Wolfenstein: Youngblood", "details_link": "https://www.metacritic.com/game/pc/wolfenstein-youngblood", "publisher": "Bethesda Softworks", "release_date": "Jul 26 2019", "developers": ["MachineGames"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 69, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/3/18c8afdf8bcc88f5a15cfb222165bde3-98.jpg", "descriptions": "Wolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus. Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: YoungbloodWolfenstein®: Youngblood is a brand-new co-op experience from MachineGames, the award-winning studio that developed the critically acclaimed Wolfenstein® II: The New Colossus. Set in 1980, 19 years after BJ Blazkowicz ignited the second American Revolution, Wolfenstein®: Youngblood introduces the next Blazkowicz generation to the fight against the Nazis. Play as one of BJ's twin daughters, Jess and Soph, as you search for your missing father in Nazi-occupied Paris.… Expand"}, {"name": "Nancy Drew: The Phantom of Venice", "details_link": "https://www.metacritic.com/game/pc/nancy-drew-the-phantom-of-venice", "publisher": "Her Interactive", "release_date": "Jul 11 2008", "developers": ["Her Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/7bf52009752ef50122c8ac0aac9b593d-98.jpg", "descriptions": "Somewhere beyond the bright piazzas and open markets of the Venice Carnevale lurks a masked thief. Despite months of investigations, the Italian police remain helpless as stolen treasures vanish in the night. That's why the authorities asked you, as detective Nancy Drew, to join the case, toSomewhere beyond the bright piazzas and open markets of the Venice Carnevale lurks a masked thief. Despite months of investigations, the Italian police remain helpless as stolen treasures vanish in the night. That's why the authorities asked you, as detective Nancy Drew, to join the case, to infiltrate a dangerous crime syndicate and catch this phantom thief before he or she destroys the heart of Venice! [Her Interactive]… Expand"}, {"name": "Trek to Yomi", "details_link": "https://www.metacritic.com/game/playstation-5/trek-to-yomi", "publisher": "Devolver Digital", "release_date": "May  5 2022", "developers": ["Flying Wild Hog"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "General", "Linear"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/5333b23866fadcd35c9d6d131a42ef3f-98.jpg", "descriptions": "Trek to Yomi is an ultra-stylised cinematic action-adventure that follows an enthralling story of Hiroki during his fall against the forces of evil. Experience his heroic return to make good on his failed promise to save the people he swore to protect. As a vow to his dying Master, the youngTrek to Yomi is an ultra-stylised cinematic action-adventure that follows an enthralling story of Hiroki during his fall against the forces of evil. Experience his heroic return to make good on his failed promise to save the people he swore to protect. As a vow to his dying Master, the young swordsman Hiroki is sworn to protect his town and the people he loves against all threats.  Faced with tragedy and bound to duty, the lone samurai must voyage beyond life and death to confront himself and decide his path forward.\r… Expand"}, {"name": "Disney/Pixar Cars 2", "details_link": "https://www.metacritic.com/game/wii/disneypixar-cars-2", "publisher": "Disney Interactive Studios", "release_date": "Jun 21 2011", "developers": ["Disney Interactive Studios"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/4fa5d9b434055c212f63a986d71b9d12-98.jpg", "descriptions": "Inspired by the upcoming DisneyPixar animated film, Cars 2: The Video Game lets players jump into the Cars 2 universe with some of their favorite Cars personalities in exotic locations around the globe."}, {"name": "Mario Hoops: 3 on 3", "details_link": "https://www.metacritic.com/game/ds/mario-hoops-3-on-3", "publisher": "Nintendo", "release_date": "Sep 11 2006", "developers": ["Square Enix"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 69, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/424fb945ed645b9ced3f0afc181a25d8-98.jpg", "descriptions": "(Also known as \"Mario Slam Basketball\")  Get that magic touch. There are plenty of basketball games out there, but none with the hands-on control of Mario Hoops 3-on-3. Players use the touch screen to get their game on as they execute tricky dribbles, special passes and sweet shots – all(Also known as \"Mario Slam Basketball\")  Get that magic touch. There are plenty of basketball games out there, but none with the hands-on control of Mario Hoops 3-on-3. Players use the touch screen to get their game on as they execute tricky dribbles, special passes and sweet shots – all with strokes and taps of the stylus. Players choose their teams of three characters from the Mario universe and hit the parquet. Power-ups like Red Shells and Bob-ombs can turn the tide as they chase down coins – they will affect the score, so players collect as many as they can as they drive to the hoop. Whether playing against friends on a local wireless connection, jamming through a tournament or just playing mini-games, there's a mode for everyone. [Nintendo]… Expand"}, {"name": "Chocobo's Mystery Dungeon: Every Buddy!", "details_link": "https://www.metacritic.com/game/playstation-4/chocobos-mystery-dungeon-every-buddy!", "publisher": "Square Enix", "release_date": "Mar 20 2019", "developers": ["Square Enix"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Roguelike"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/be4cdcbc69854ad926c4299f2d0bfdf7-98.jpg", "descriptions": "A new installment of the ever-popular series is here. The classic FINAL FANTASY FABLES: Chocobo’s Dungeon is back with an enhanced gameplay system - to be enjoyed by both first-timers and fans of the series!. Explore the challenges of the never-ending dungeons (\"Insatiable Hunger\"), befriendA new installment of the ever-popular series is here. The classic FINAL FANTASY FABLES: Chocobo’s Dungeon is back with an enhanced gameplay system - to be enjoyed by both first-timers and fans of the series!. Explore the challenges of the never-ending dungeons (\"Insatiable Hunger\"), befriend monsters with the new buddy system. You adhere to one simple rule, … every time you enter, the world around you changes shape, but it only moves whenever Chocobo moves. … Expand"}, {"name": "Mages of Mystralia", "details_link": "https://www.metacritic.com/game/switch/mages-of-mystralia", "publisher": "Borealys Games", "release_date": "Jan 29 2019", "developers": ["Borealys Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 69, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/fc88650354875ff619522ffbc90b7ebb-98.jpg", "descriptions": "Accompany Zia as she strikes off to train and learn to control her magical abilities that had her exiled. Journey across the lands to meet other exiled mages and uncover runes with magical properties that can be combined into millions of different possibilities, letting you come up withAccompany Zia as she strikes off to train and learn to control her magical abilities that had her exiled. Journey across the lands to meet other exiled mages and uncover runes with magical properties that can be combined into millions of different possibilities, letting you come up with completely new and incredible spells!… Expand"}, {"name": "Light Fall", "details_link": "https://www.metacritic.com/game/pc/light-fall", "publisher": "Bishop Games", "release_date": "Apr 26 2018", "developers": ["Bishop Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/7b6cd52355085cec2cd059528f57652f-98.jpg", "descriptions": "Explore the Forgotten World of Numbra to uncover your mysterious past and save the land from an imminent threat. In this land of eternal night, you will rely on your Shadow Core to brave the many challenges and foes standing in your way. Do you have what it takes to survive in perilous Numbra?"}, {"name": "Sorcery! Parts 1 and 2", "details_link": "https://www.metacritic.com/game/pc/sorcery!-parts-1-and-2", "publisher": "inkle", "release_date": "Feb  2 2016", "developers": ["inkle"], "platforms": "PC", "genres": ["Action", "Miscellaneous", "General", "Compilation"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/03cade424f02eb411ec63dc228835c92-98.jpg", "descriptions": "An epic adventure in a land of monsters, traps and magic. Journey across the deadly Shamutanti Hills and through the Cityport of Kharé, home to thieves, corrupt nobles and deadly mutants, as you attempt to recover the Crown of Kings. Armed with your sword, and over fifty spells with weirdAn epic adventure in a land of monsters, traps and magic. Journey across the deadly Shamutanti Hills and through the Cityport of Kharé, home to thieves, corrupt nobles and deadly mutants, as you attempt to recover the Crown of Kings. Armed with your sword, and over fifty spells with weird and wonderful effects, embark on a journey of a thousand choices where every one is remembered and will change your story. This is Parts 1 and 2 of a four-part series.… Expand"}, {"name": "Styx: Master of Shadows", "details_link": "https://www.metacritic.com/game/xbox-one/styx-master-of-shadows", "publisher": "Focus Home Interactive", "release_date": "Oct  8 2014", "developers": ["Cyanide"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/13d8706c688ea9e0220929b317bf2645-98.jpg", "descriptions": "Styx: Master of Shadows is an infiltration game with RPG elements taking place in a dark fantasy universe. Guide the goblin assassin Styx through the vertical and multi-layered Tower of Akenash, home to the World Tree, source of the Amber  a powerful and magical golden sap  prowling throughStyx: Master of Shadows is an infiltration game with RPG elements taking place in a dark fantasy universe. Guide the goblin assassin Styx through the vertical and multi-layered Tower of Akenash, home to the World Tree, source of the Amber  a powerful and magical golden sap  prowling through the shadows with aide of a host of special abilities refined throughout Styxs 200 years of history. The downloadable version of this game supports English, French, German, Spanish.… Expand"}, {"name": "Invizimals", "details_link": "https://www.metacritic.com/game/psp/invizimals", "publisher": "SCEA", "release_date": "Oct 12 2010", "developers": ["Novarama"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Puzzle", "Puzzle", "General", "Card Battle"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/a08676bbc95ae31df3fda31d4ca98508-98.jpg", "descriptions": "There are invisible creatures everywhere - and only your PSP Camera can see them. Track down the mysterious Invizimals, lay down your magical trap and try to capture as many of them as possible. Your Invizimals can face off in exciting battles using magic and special moves to defeat theirThere are invisible creatures everywhere - and only your PSP Camera can see them. Track down the mysterious Invizimals, lay down your magical trap and try to capture as many of them as possible. Your Invizimals can face off in exciting battles using magic and special moves to defeat their opponents. Watch as they learn new attacks and evolve, becoming even more powerful. Make amazing discoveries on your own or enjoy multiplayer action via Ad Hoc and Infrastructure Mode. Trade Invizimals with your friends and build up your own personal collection of fantastic creatures. [SCEE]… Expand"}, {"name": "Super Stardust Portable", "details_link": "https://www.metacritic.com/game/psp/super-stardust-portable", "publisher": "SCEA", "release_date": "Dec  4 2008", "developers": ["Housemarque"], "platforms": ["PlayStation 5", "PSP"], "genres": ["Action", "General", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/0c801268e7536700603585e1df4c0fa8-98.jpg", "descriptions": "[Playstation Network]  Super Stardust Portable brings the PlayStation Network favorite, Super Stardust HD, to the PSP system. In this classic arcade shooter, the player's mission is simple: destroy everything in sight! Controlling a ship, the player must defeat enemy forces and save his home[Playstation Network]  Super Stardust Portable brings the PlayStation Network favorite, Super Stardust HD, to the PSP system. In this classic arcade shooter, the player's mission is simple: destroy everything in sight! Controlling a ship, the player must defeat enemy forces and save his home solar system from total annihilation. Based on Super Stardust HD, the game has been tuned and redesigned to take advantage of the unique power and features of the PSP system. With five highly detailed 3D planets to save, hordes of enemies and asteroids to destroy, and various game play modes, Super Stardust Portable presents super intense action on the PSP system. [Sony]… Expand"}, {"name": "Shark Tale", "details_link": "https://www.metacritic.com/game/gamecube/shark-tale", "publisher": "Activision", "release_date": "Sep 27 2004", "developers": ["Edge of Reality"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/6420b3f7195d74733898eb59bf816348-98.jpg", "descriptions": "In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish--at least that's what he wants you to think. Dive into the underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on DreamWorks'In the murky depths of the ocean, the fate of Reef City lies in the fins of one little fish--at least that's what he wants you to think. Dive into the underwater metropolis of Shark Tale and play as Oscar, a fast-talking fish whose little fib gets him into big trouble. Based on DreamWorks' animated film, Shark Tale features 25 missions that will have you exploring Reef City, racing through the coral, fighting Fish Fu and great white sharks, and dancing to the sounds of hip-hop tracks.… Expand"}, {"name": "Chrome", "details_link": "https://www.metacritic.com/game/pc/chrome", "publisher": "Strategy First", "release_date": "Oct 28 2003", "developers": ["Techland"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/ef40970df43c07e0914bbe2ab0fc0730-98.jpg", "descriptions": "Take on the role of Logan, a veteran mercenary turned bounty hunter who is out to make it rich. Using a system of implants, the player is able to manipulate Logan?s personality and abilities in order to accomplish all of the 14 missions where Logan takes part in breathtaking chases usingTake on the role of Logan, a veteran mercenary turned bounty hunter who is out to make it rich. Using a system of implants, the player is able to manipulate Logan?s personality and abilities in order to accomplish all of the 14 missions where Logan takes part in breathtaking chases using futuristic vehicles, becomes a silent assassin to strike at unwitting enemies, and grabs his heavy plasma gun and implants enhanced muscles to storm through enemy lines. [Strategy First]… Expand"}, {"name": "Rally Fusion: Race of Champions", "details_link": "https://www.metacritic.com/game/xbox/rally-fusion-race-of-champions", "publisher": "Activision", "release_date": "Nov 29 2002", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/5be9207617efa0d96851c0332010fa9a-98.jpg", "descriptions": "Tear up the turf and put your driving skills to the test as you battle it out for the Race of Champions crown. Rally Fusion: The Race of Champions pushes off-road racing to the limit with realistic damage, cars, and tracks. In one of 20 vehicles, you and your co-driver will grind, drift, andTear up the turf and put your driving skills to the test as you battle it out for the Race of Champions crown. Rally Fusion: The Race of Champions pushes off-road racing to the limit with realistic damage, cars, and tracks. In one of 20 vehicles, you and your co-driver will grind, drift, and slide through a variety of terrain. Nothing less than a world-class performance will get you through different terrain, changing weather conditions, and challenging competitions against the world's top motorsport drivers. … Expand"}, {"name": "Age of Sail II: Privateer's Bounty", "details_link": "https://www.metacritic.com/game/pc/age-of-sail-ii-privateers-bounty", "publisher": "Global Star Software", "release_date": "Aug 13 2002", "developers": ["Akella"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/fc7a905aa48c46692ff276b85872b251-98.jpg", "descriptions": "Now you too can lead the wooden fleets of the world's most powerful nautical powers into battle in the new standard of naval combat simulation, Age of Sail II: Privateer's Bounty. Never before has every aspect of nautical combat been so faithfully reproduced, from advanced sailing tactics,Now you too can lead the wooden fleets of the world's most powerful nautical powers into battle in the new standard of naval combat simulation, Age of Sail II: Privateer's Bounty. Never before has every aspect of nautical combat been so faithfully reproduced, from advanced sailing tactics, to the handling of your crews. It's time for you to accept your Letter of Marques, and immerse yourself into an epoch of adventure and intrigue, into the Age of Sail. [Global Star Software]… Expand"}, {"name": "Herdy Gerdy", "details_link": "https://www.metacritic.com/game/playstation-2/herdy-gerdy", "publisher": "Eidos Interactive", "release_date": "Mar  4 2002", "developers": ["Core Design Ltd."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 69, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/676d78f4a7dd3cff59ec4f61e17caa79-98.jpg", "descriptions": "Gerdy, an apprentice herder, embarks on an epic quest to revive his father from an evil spell. His journey takes him across an island populated by an assortment of wild creatures. To defeat his father's nemesis and restore goodness to the island, Gerdy must hone his herding skills andGerdy, an apprentice herder, embarks on an epic quest to revive his father from an evil spell. His journey takes him across an island populated by an assortment of wild creatures. To defeat his father's nemesis and restore goodness to the island, Gerdy must hone his herding skills and ultimately compete in a magnificent tournament to become Master Herder. [Eidos Interactive]… Expand"}, {"name": "MXRider", "details_link": "https://www.metacritic.com/game/playstation-2/mxrider", "publisher": "Atari", "release_date": "Oct 30 2001", "developers": ["Paradigm Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/db9ae2a8742eb42c647f3b2b4390e8db-98.jpg", "descriptions": "Assume the role of 58 licensed FIM Motocross riders on 24 exclusive bikes attacking 23 licensed FIM Motocross tracks in fourteen countries.  Over thirty stunts are available to every rider."}, {"name": "Kororinpa: Marble Mania", "details_link": "https://www.metacritic.com/game/wii/kororinpa-marble-mania", "publisher": "Konami", "release_date": "Mar 20 2007", "developers": ["Hudson"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "General", "Puzzle", "Action"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/6381d4516e5ad2c8dabb695c3dbac93b-98.jpg", "descriptions": "Using the Wii Remote, players navigate their balls through a series of complex 3D mazes. No complicated button combinations are required - just the tilt of the Wii Remote to tip and tilt the game environment in all directions. Each ball in the game has its own level of response, speed, slideUsing the Wii Remote, players navigate their balls through a series of complex 3D mazes. No complicated button combinations are required - just the tilt of the Wii Remote to tip and tilt the game environment in all directions. Each ball in the game has its own level of response, speed, slide and bounce, so the player must choose his balls carefully in order to successfully complete Kororinpa. As more mazes are completed, additional balls are be made available to choose from. These include balls such as ladybug, cat, penguin, watermelon and pig. Players can also go head-to-head with another player, splitting the screen horizontally or vertically, where the winner is the player to collect all the red crystals and reach the goal first. The game includes more than 50 mazes and five different environments, each with its own unique music, obstacles and visual style to enjoy.… Expand"}, {"name": "West of Dead", "details_link": "https://www.metacritic.com/game/pc/west-of-dead", "publisher": "Raw Fury", "release_date": "Jun 18 2020", "developers": ["Upstream Arcade"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 69, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/80679c1d4ca6ba33f1da843a61e21b11-98.jpg", "descriptions": "Descend into the grim and gritty world of Purgatory in this fast-paced cover shooter which combines the fluidity of twin-stick controls and tactical cover usage. Dodge behind cover as you try to outgun your enemies in the unknown procedurally generated hunting grounds."}, {"name": "The Walking Dead: The Telltale Series - A New Frontier", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---a-new-frontier", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Dec 20 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 69, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/cc7089e19131980e3e63c01dbd376753-98.jpg", "descriptions": "Telltale's award-winning and chart-dominating The Walking Dead series returns with its third season  \"A New Frontier\".\r Continuing the emotionally powerful story-telling seen in Seasons One and Two, we return to one of gaming's most favoured characters - Clementine - a young girl who hasTelltale's award-winning and chart-dominating The Walking Dead series returns with its third season  \"A New Frontier\".\r Continuing the emotionally powerful story-telling seen in Seasons One and Two, we return to one of gaming's most favoured characters - Clementine - a young girl who has grown up amid the horrors of the zombie apocalypse. We see her story through the eyes of Javier, a young man determined to find the family taken from him, and via playable flashbacks from Clem's past telling the story of how she came to be on a quest for vengeance. In A New Frontier, players will discover what the world is like when civilisation begins to rebuild, and what sacrifices it will take to make society work again.… Expand"}, {"name": "Project CARS 3", "details_link": "https://www.metacritic.com/game/xbox-one/project-cars-3", "publisher": "Bandai Namco Games", "release_date": "Aug  3 2020", "developers": ["Slightly Mad Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 69, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/3/1f782840377623af2c490976314f8053-98.jpg", "descriptions": "Project CARS 3 is the third instalment in the best-seller racing franchise that brings all the intense thrills, emotions and fun from the vibrant world of motor racing to vivid life as players undertake a whole new exciting career journey that sees them rise from weekend warrior to racingProject CARS 3 is the third instalment in the best-seller racing franchise that brings all the intense thrills, emotions and fun from the vibrant world of motor racing to vivid life as players undertake a whole new exciting career journey that sees them rise from weekend warrior to racing legend.Also new to the franchise is a deeply engaging metagame that challenges players to race hard and earn in-game Credits with which to buy and own hundreds of cars from the world's most elite brands and race them all on dynamic and spectacular circuits around the globe featuring stunning all-weather, all-seasons conditions.Race-won Credits and XP will also entice players to buy authentic performance upgrades and customisation options for their stable of exclusive cars, including wheels, tyres, body kits, rims, as well as personalisation options to create their own racing hero personas.With a completely redesigned and unrivalled controller experience, an even more accurate and fun handling model, adjustable skill settings for every level of driver and every element of weather-affected races, Project CARS 3 is the biggest, most exciting and authentic evolution to the definitive racing franchise.… Expand"}, {"name": "Kingdom Come: Deliverance", "details_link": "https://www.metacritic.com/game/playstation-4/kingdom-come-deliverance", "publisher": "Deep Silver", "release_date": "Feb 13 2018", "developers": ["Warhorse Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Historic", "Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/34964cc668fab5d27627bcdcff4415fc-98.jpg", "descriptions": "Kingdom Come: Deliverance is an open world, action-adventure, role-playing game featuring blockbuster production values, a nonlinear story and revolutionary, first-person melee combat."}, {"name": "Rhem 3: The Secret Library", "details_link": "https://www.metacritic.com/game/pc/rhem-3-the-secret-library", "publisher": "Got Game Entertainment", "release_date": "Feb 28 2008", "developers": ["Knut Mueller"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Fantasy"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/f48f093798474be6d98a55c6a62bf8aa-98.jpg", "descriptions": "In this intricate pure-puzzle first person adventure game for PC and Mac, the adventures of brothers Kales and Zetais continue in the mysterious land of RHEM. Like its predecessors, RHEM 3 features non-linear gameplay, non-violent story, and mind-bending puzzles. Set in a labyrinthine worldIn this intricate pure-puzzle first person adventure game for PC and Mac, the adventures of brothers Kales and Zetais continue in the mysterious land of RHEM. Like its predecessors, RHEM 3 features non-linear gameplay, non-violent story, and mind-bending puzzles. Set in a labyrinthine world of hidden rooms and secret passages, strange vehicles and odd machines, RHEM 3 opens the door to a new journey of mystery and adventure. In search of a certain black gem, hints hidden in a secret library and clues offered by the peculiar inhabitants of RHEM will assist you in your quest. With an adventurous spirit, logical thinking, and keen puzzle-solving, you will slowly but surely divine the location of this curious treasure and unveil the secret it holds. [Got Game]… Expand"}, {"name": "Lost in Blue", "details_link": "https://www.metacritic.com/game/ds/lost-in-blue", "publisher": "Konami", "release_date": "Sep 27 2005", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Survival", "Modern", "Third-Person", "Modern"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/a3929aa951d54b4044c2a536e9fb0646-98.jpg", "descriptions": "This innovative RPG takes players on a journey of survival, adventure and mystery. After a disastrous incident at sea, the young hero of the game awakens to find himself on a seemingly uninhabited island. After meeting another survivor, a 17-year old girl who has also drifted ashore, the twoThis innovative RPG takes players on a journey of survival, adventure and mystery. After a disastrous incident at sea, the young hero of the game awakens to find himself on a seemingly uninhabited island. After meeting another survivor, a 17-year old girl who has also drifted ashore, the two must work together to survive. While planning their escape, they will learn survival skills, such as hunting, searching for food and building tools while uncovering the island's many mysteries. [Konami]… Expand"}, {"name": "Full Spectrum Warrior: Ten Hammers", "details_link": "https://www.metacritic.com/game/xbox/full-spectrum-warrior-ten-hammers", "publisher": "THQ", "release_date": "Mar 28 2006", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Military"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/1cee8e515a49c9919175b20d9a86f105-98.jpg", "descriptions": "As squad leader, players coordinate the actions of multiple infantry fire teams, leading them through a variety of hostile environments. An intuitive control scheme allows direction of squads in real-time as players outthink, outmaneuver and outgun enemies through more than 12 levels ofAs squad leader, players coordinate the actions of multiple infantry fire teams, leading them through a variety of hostile environments. An intuitive control scheme allows direction of squads in real-time as players outthink, outmaneuver and outgun enemies through more than 12 levels of intense warfare. Players will utilize authentic battlefield tactics as they confront the enemy with a deadly arsenal of weapons, the latest military equipment, and new Player-controlled mechanized units. With an enhanced multiplayer mode, players can go online and battle friends through a variety of new head-to-head and co-op objective-based missions.… Expand"}, {"name": "The Walking Dead: Michonne - Episode 1: In Too Deep", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-michonne---episode-1-in-too-deep", "publisher": "Telltale Games", "release_date": "Feb 23 2016", "developers": ["Skybound LLC", "Skybound Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/1e574327ce7a3793e4abae313f9b7208-98.jpg", "descriptions": "In this premiere episode, 'In Too Deep,' Michonne joins Pete and his crew on the sailing ship The Companion as they cruise the coast for survivors and supplies. When a desperate signal for help draws them to a scene of horrific massacre, Michonne and the crew are lead further to the floatingIn this premiere episode, 'In Too Deep,' Michonne joins Pete and his crew on the sailing ship The Companion as they cruise the coast for survivors and supplies. When a desperate signal for help draws them to a scene of horrific massacre, Michonne and the crew are lead further to the floating survivors' colony of Monroe, which may just be harboring the person responsible for the carnage. [TellTale Games]… Expand"}, {"name": "Ikenfell", "details_link": "https://www.metacritic.com/game/pc/ikenfell", "publisher": "Humble Bundle", "release_date": "Oct  8 2020", "developers": ["Happy Ray Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 69, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/7c41c1c1eff4cd47f07590fee2607538-98.jpg", "descriptions": "A turn-based tactical RPG about a group of troublesome magic students. Use timing mechanics to power your spells and block attacks, explore the twisted halls of a vast magic school, fight challenging monsters and bosses, and uncover dark secrets never meant to be found."}, {"name": "Warsaw", "details_link": "https://www.metacritic.com/game/switch/warsaw", "publisher": "Crunching Koalas", "release_date": "Oct  1 2020", "developers": ["Pixelated Milk"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/cc75af03f6803756d3ed4aeb584abe12-98.jpg", "descriptions": "WARSAW is a challenging WWII turn-based tactical rpg taking place in a war torn city and sporting beautiful hand painted graphics. Lead a small, dedicated outfit of civilians and soldiers with their unique skills in their fight to take back the city besieged by occupying forces."}, {"name": "One Piece: Pirate Warriors 4", "details_link": "https://www.metacritic.com/game/switch/one-piece-pirate-warriors-4", "publisher": "Bandai Namco Games", "release_date": "Mar 27 2020", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/1cff17a9579e952cdecbcefafaa0f07a-98.jpg", "descriptions": "The Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of ﬁnding theThe Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of ﬁnding the illustrious treasure - the One Piece. Play through some of the most extraordinary islands and environments in the ONE PIECE story and take on memorable foes. Choose from some of your favorite characters and take on a vast number of enemies through iconic moments from the One Piece anime. Developed by the masters of the action musou genre, KOEI TECMO GAMES, ONE PIECE Pirate Warriors 4 brings together the excitement from slashing hordes of enemies with the fun and energetic personalities from the One Piece series. Embark on a new pirate warriors adventure.… Expand"}, {"name": "Tracks: The Train Set Game", "details_link": "https://www.metacritic.com/game/xbox-one/tracks-the-train-set-game", "release_date": "Nov 14 2019", "developers": ["Whoop Group"], "platforms": ["PC", "Switch", "Xbox One"], "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/b039453b6366c15159bf98791b4e18ec-98.jpg", "descriptions": "Create colorful railway systems, decorate beautiful towns, and even ride in your train."}, {"name": "Here Be Dragons", "details_link": "https://www.metacritic.com/game/pc/here-be-dragons", "publisher": "Red Zero Games", "release_date": "Aug 16 2019", "developers": ["Red Zero Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/ae0e07251b077ca5c8d8d19b90b82417-98.jpg", "descriptions": "Here Be Dragons is a satirical turn-based strategy game featuring unique \"living map\" graphics, where you lead a group of crazed captains and eradicate legendary monsters in order to allow Christopher Columbus the discovery of the New World."}, {"name": "Battle Princess Madelyn", "details_link": "https://www.metacritic.com/game/xbox-one/battle-princess-madelyn", "publisher": "Causal Bit Games", "release_date": "Dec  6 2018", "developers": ["Causal Bit Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/1bd9b3cc50c417713b846e34c572a5bf-98.jpg", "descriptions": "Battle Princess Madelyn is a game that follows the journey of a young knight in training, Madelyn, and her ghostly pet dog, Fritzy. They set out on a journey to save her kingdom and her family from the clutches of an evil wizard.Set in the vein of such classics as Ghouls N' Ghosts andBattle Princess Madelyn is a game that follows the journey of a young knight in training, Madelyn, and her ghostly pet dog, Fritzy. They set out on a journey to save her kingdom and her family from the clutches of an evil wizard.Set in the vein of such classics as Ghouls N' Ghosts and Wonder Boy 3: The Dragon's Trap, the instantly classic and familiar gameplay will transport old-school gamers back to their heyday, and the self-adjusting difficulty will allow for even the most novice of gamer to pick up and play!Join Madelyn as she battles through graveyards, swamps, castles, the countryside and more! Polished gameplay, breathtaking visuals, jaw-dropping dual soundtracks and epic adventures await!… Expand"}, {"name": "EVE: Valkyrie", "details_link": "https://www.metacritic.com/game/pc/eve-valkyrie", "publisher": "CCP", "release_date": "Nov 17 2016", "developers": ["CCP"], "platforms": ["PlayStation 4", "PC"], "genres": ["Simulation", "Space", "Combat"], "meta_score": 69, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/eb7314c37f2022af7bae6c30066f8381-98.jpg", "descriptions": "A multiplayer spaceship dogfighting shooter set in the EVE Universe. The game uses virtual reality to give players the sense of being a real pilot in an EVE Online spaceship and will be released in 2014."}, {"name": "Diaries of a Spaceport Janitor", "details_link": "https://www.metacritic.com/game/pc/diaries-of-a-spaceport-janitor", "publisher": "tinyBuild", "release_date": "Sep 16 2016", "developers": ["Sundae Month"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 69, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/3/497391d273ce09f50aa11ffdf8b48e21-98.jpg", "descriptions": "Diaries of a Spaceport Janitor is an anti-adventure game about picking up trash in an alien bazaar. Play as the Janitor, an Alaensee girlbeast with a municipally-subsidized trash incineration job and dreams of leaving the planet of Xabran's Rock far behind her."}, {"name": "Starwhal", "details_link": "https://www.metacritic.com/game/xbox-one/starwhal", "publisher": "Breakfall", "release_date": "Dec  9 2015", "developers": ["Breakfall"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One"], "genres": ["Action", "Fighting", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/5418717e1a1df4eee5e030b254a5ef4c-98.jpg", "descriptions": "Flop it out with up to 4 players in a retro, epic narwhal battle in space."}, {"name": "Ashes of the Singularity", "details_link": "https://www.metacritic.com/game/pc/ashes-of-the-singularity", "publisher": "Stardock", "release_date": "Mar 31 2016", "developers": ["Oxide Games"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 69, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/57d7b72c914cab28199ad1c4fc70672a-98.jpg", "descriptions": "Humanity long ago shed its mortal skin and developed into beings of pure consciousness. But the Singularity is a thing of the past and the very future of human existence is being threatened. Though the post-humans wield godlike power, they find themselves at war for domination of not justHumanity long ago shed its mortal skin and developed into beings of pure consciousness. But the Singularity is a thing of the past and the very future of human existence is being threatened. Though the post-humans wield godlike power, they find themselves at war for domination of not just the Milky Way but all galaxies with Haalee, the sentient AI, who is bent on saving the universe from post-human predation.… Expand"}, {"name": "Mario Tennis Open", "details_link": "https://www.metacritic.com/game/3ds/mario-tennis-open", "publisher": "Nintendo", "release_date": "May 20 2012", "developers": ["Camelot Software Planning"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/de77f7f438a98132dbb068456e85ce0d-98.jpg", "descriptions": "Mario Tennis Open allows players to instantly jump into the multiplayer fun, locally or online, as theirr Mii or their favorite Mushroom Kingdom character."}, {"name": "Thief", "details_link": "https://www.metacritic.com/game/xbox-one/thief", "publisher": "Square Enix", "release_date": "Feb 25 2014", "developers": ["Eidos Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General", "Fantasy"], "meta_score": 69, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/ec52cecba1f5fc6d701c7a5caebc88c2-98.jpg", "descriptions": "Garrett, the Master Thief, steps out of the shadows into the City. In this treacherous place, where the Baron’s Watch spreads a rising tide of fear and oppression, his skills are the only things he can trust. Even the most cautious citizens and their best- guarded possessions are not safeGarrett, the Master Thief, steps out of the shadows into the City. In this treacherous place, where the Baron’s Watch spreads a rising tide of fear and oppression, his skills are the only things he can trust. Even the most cautious citizens and their best- guarded possessions are not safe from his reach. As an uprising emerges, Garrett finds himself entangled in growing layers of conflict. Lead by Orion, the voice of the people, the tyrannized citizens will do everything they can to claim back the City from the Baron’s grasp. The revolution is inevitable. If Garrett doesn’t get involved, the streets will run red with blood and the City will tear itself apart.… Expand"}, {"name": "Aeon Flux", "details_link": "https://www.metacritic.com/game/xbox/aeon-flux", "publisher": "Majesco Games", "release_date": "Nov 17 2005", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 69, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/9/a4d4b48cc1c351e1fca05fffb4b3ccdd-98.jpg", "descriptions": "Aeon Flux is a sci-fi action game based on the movie that is based on the MTV series of the same name. Charlize Theron stars as the underground operative Aeon Flux. You can use Aeon's acrobatic fighting techniques and futuristic weapons to battle through landscapes inspired by the movie. TheAeon Flux is a sci-fi action game based on the movie that is based on the MTV series of the same name. Charlize Theron stars as the underground operative Aeon Flux. You can use Aeon's acrobatic fighting techniques and futuristic weapons to battle through landscapes inspired by the movie. The game also features a variety of futuristic gadgets and a style meter that help you complete objectives as you move through seven single-player chapters.… Expand"}, {"name": "Fallout 76: Wastelanders", "details_link": "https://www.metacritic.com/game/pc/fallout-76-wastelanders", "publisher": "Bethesda Softworks", "release_date": "Apr 16 2020", "developers": ["Bethesda Game Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Western-Style"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/e518fe78823bdc5a6e41ec4ce81ff58b-98.jpg", "descriptions": "In addition to introducing fully voiced NPCs to the world of Fallout 76, Wastelanders brings a brand-new main questline, new locations, new enemies, new weapons, a new reputation system and much more."}, {"name": "Transformers Animated: The Game", "details_link": "https://www.metacritic.com/game/ds/transformers-animated-the-game", "publisher": "Activision", "release_date": "Oct 21 2008", "developers": ["Artificial Mind and Movement"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/2b5d6de68501b65801afb0a1dc08e690-98.jpg", "descriptions": "Based on the television series, Transformers Animated: The Game delivers an exciting action-adventure experience. As they blast through Decepticon-controlled hoverbots, players solve challenging team-building puzzles and race through futuristic Detroit roadways, dodging on-coming trafficBased on the television series, Transformers Animated: The Game delivers an exciting action-adventure experience. As they blast through Decepticon-controlled hoverbots, players solve challenging team-building puzzles and race through futuristic Detroit roadways, dodging on-coming traffic while seamlessly morphing between robot and vehicle form. Fans take control of all their favorite Autobot characters, including Optimus Prime, Bumblebee, Bulkhead and Prowl, as they work together to reclaim the lost fragments of the Allspark before the Decepticons intercept it and claim Cybertron as their own.… Expand"}, {"name": "Song of the Deep", "details_link": "https://www.metacritic.com/game/playstation-4/song-of-the-deep", "publisher": "Insomniac Games", "release_date": "Jul 12 2016", "developers": ["Insomniac Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/ad30a8234ef72de3efc4057dd7ae05ec-98.jpg", "descriptions": "In this game you’ll explore a huge undersea world, both free-diving and in a submarine. It’s a metroidvania style of progression where you are constantly getting new abilities and figuring out ways to upgrade them as you take on the seemingly impossible obstacles that stand in your way. It’sIn this game you’ll explore a huge undersea world, both free-diving and in a submarine. It’s a metroidvania style of progression where you are constantly getting new abilities and figuring out ways to upgrade them as you take on the seemingly impossible obstacles that stand in your way. It’s a challenging journey, designed to test your mind and your reflexes in equal amounts. [Insomniac]… Expand"}, {"name": "Age of Empires: Definitive Edition", "details_link": "https://www.metacritic.com/game/pc/age-of-empires-definitive-edition", "publisher": "Microsoft Game Studios", "release_date": "Feb 20 2018", "developers": ["Microsoft Game Studios", "Forgotten Empires LLC"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Command"], "meta_score": 69, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/edf66615d4b98f0f54f3c9fe5a274e57-98.jpg", "descriptions": "In 1997, Age of Empires changed RTS games forever. Today, twenty years later, Age of Empires: Definitive Edition begins that transformation anew with all-new graphics, remastered sound and music, and a smooth UI experience rebuilt from the ground up."}, {"name": "Mana Khemia: Alchemists of Al-Revis", "details_link": "https://www.metacritic.com/game/playstation-2/mana-khemia-alchemists-of-al-revis", "publisher": "NIS America", "release_date": "Apr  1 2008", "developers": ["Gust"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "General"], "meta_score": 69, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/34aac8c187f056a4c75687c0c821cb02-98.jpg", "descriptions": "Mana Khemia is the 5th entry in the Alchemy RPG series that began with Atleier Iris; Eternal Mania. The game is quest based, classic style RPG where players adventure on to various missions to complete the game. However, unlike the ordinary classic style RPG, alchemy is the main focus of theMana Khemia is the 5th entry in the Alchemy RPG series that began with Atleier Iris; Eternal Mania. The game is quest based, classic style RPG where players adventure on to various missions to complete the game. However, unlike the ordinary classic style RPG, alchemy is the main focus of the game. Meaning players will discover and create items, weapons and even character stats through the use of alchemy.… Expand"}, {"name": "What Did I Do to Deserve This, My Lord!?", "details_link": "https://www.metacritic.com/game/psp/what-did-i-do-to-deserve-this-my-lord!", "publisher": "NIS America", "release_date": "Jul 16 2009", "developers": ["Acquire"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "General", "General"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/63eda108370c26b99e6a5707922af580-98.jpg", "descriptions": "[Playstation Network] Also known as \"What Did I Do To Deserve This, My Lord?!\"   The goal of the game is clean and simple: As the God of Destruction, you must create a dungeon that is difficult and powerful enough to fend off human hero invasions. The dungeon must have a self-sustaining[Playstation Network] Also known as \"What Did I Do To Deserve This, My Lord?!\"   The goal of the game is clean and simple: As the God of Destruction, you must create a dungeon that is difficult and powerful enough to fend off human hero invasions. The dungeon must have a self-sustaining ecosystem, so players must strategically dig and create a dungeon with a balanced food chain. Periodically, human heroes will invade the dungeon in order to bring peace and harmony to the world, but they are your enemies. You must destroy the heroes before they capture the Overlord and take him back to the surface. [NIS America]… Expand"}, {"name": "SpongeBob SquarePants: Battle for Bikini Bottom - Rehydrated", "details_link": "https://www.metacritic.com/game/pc/spongebob-squarepants-battle-for-bikini-bottom---rehydrated", "publisher": "THQ Nordic", "release_date": "Jun 23 2020", "developers": ["Purple Lamp Studios"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/e187bc5804d511064747cdb584f6de68-98.jpg", "descriptions": "Are you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course youAre you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course you do! Want to underpants bungee jump? Why wouldn't you! Want to join forces in a brand new multiplayer mode? The battle is on!\r GAME FEATURES\r- Play as SpongeBob, Patrick and Sandy and use their unique sets of skills\r- Thwart Plankton's evil plan to rule Bikini Bottom with his army of wacky robots\r- Meet countless characters from the beloved series\r REMAKE FEATURES\r- Faithful remake of one of the best SpongeBob games ever created\r- High-end visuals, modern resolutions and carefully polished gameplay\r- Brand new horde mode multiplayer for up to two players, online and offline\r- Restored content that was cut from the original game like the Robo Squidward boss fight and more… Expand"}, {"name": "Battleborn", "details_link": "https://www.metacritic.com/game/pc/battleborn", "publisher": "2K Games", "release_date": "May  3 2016", "developers": ["Gearbox Software"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 10 ", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/5e7d5e444550e54c64155504bcb132b3-98.jpg", "descriptions": "Battleborn is a next-gen hero-shooter brought to you by the creators of the award-winning and best-selling Borderlands franchise. In Battleborn’s distant future, the only hope for the last star in a dying universe is a new breed of warriors, who must put aside their differences to drive backBattleborn is a next-gen hero-shooter brought to you by the creators of the award-winning and best-selling Borderlands franchise. In Battleborn’s distant future, the only hope for the last star in a dying universe is a new breed of warriors, who must put aside their differences to drive back an unstoppable menace. Choose from a myriad of powerful heroes and fight together alongside your friends in an intense co-operative campaign, or battle against them in fast-paced competitive multiplayer matches.… Expand"}, {"name": "Hitman HD Enhanced Collection", "details_link": "https://www.metacritic.com/game/playstation-4/hitman-hd-enhanced-collection", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jan 11 2019", "developers": ["IO Entertainment"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 69, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/5/832db54837bc9f51661d7d0633d04e7d-98.jpg", "descriptions": "A compilation of two classic Hitman titles remastered in 4K resolution: Hitman: Blood Money and Hitman: Absolution. In Hitman: Blood Money you experience a globe-trotting adventure from the vineyards of Chile, to the Paris Opera House and even the White House itself in a face-off against aA compilation of two classic Hitman titles remastered in 4K resolution: Hitman: Blood Money and Hitman: Absolution. In Hitman: Blood Money you experience a globe-trotting adventure from the vineyards of Chile, to the Paris Opera House and even the White House itself in a face-off against a group of assassins known as “The Franchise”. When assassins from his contract agency, the ICA, are systematically eliminated in a series of hits, Agent 47 suspects that a larger, more powerful agency has entered the fray. As he suddenly loses contact with the ICA, Agent 47 senses that he may be the next target, so our merciless contract killer travels to America to take care of business himself… Rediscover Hitman: Absolution and experience the deep and personal story of Agent 47 as he pursues redemption across 20 intense missions. Enjoy a distinctive art style that combines with rich dialogue and performances by an impressive Hollywood cast to create a unique gameplay experience.… Expand"}, {"name": "Disco Dodgeball Remix", "details_link": "https://www.metacritic.com/game/playstation-4/disco-dodgeball-remix", "publisher": "Zen Studios", "release_date": "May 22 2018", "developers": ["Zen Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Sports", "Team", "Futuristic"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/41bd025c0c99b9e6bb76b9ffba42236a-98.jpg", "descriptions": "Disco Dodgeball Remix is a ridiculous physics-based future-sport amalgamation with robots, one-hit-kill projectile combat, and crazy dodgeball action."}, {"name": "Korix", "details_link": "https://www.metacritic.com/game/playstation-4/korix", "publisher": "StellarVR", "release_date": "Mar 29 2017", "developers": ["StellarVR"], "platforms": "PlayStation 4", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 69, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/4e9a2bc994e5ee61b531e0c411859c94-98.jpg", "descriptions": "Korix places you deep in space, fighting for your race’s survival after your homeworld is destroyed. With nothing left to lose, you are put in the role of commander, with the sole mission of taking the fight back to the enemy. Build up your defences, capture resources, and build your ownKorix places you deep in space, fighting for your race’s survival after your homeworld is destroyed. With nothing left to lose, you are put in the role of commander, with the sole mission of taking the fight back to the enemy. Build up your defences, capture resources, and build your own army to exact revenge.… Expand"}, {"name": "Abyss Odyssey", "details_link": "https://www.metacritic.com/game/pc/abyss-odyssey", "publisher": "Atlus", "release_date": "Jul 15 2014", "developers": ["ACE Team"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Fantasy", "Linear"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/c9d0dff66fed100f216e89a74a37b31f-98.jpg", "descriptions": "From indie Chilean developer ACE Team comes a new side-scrolling action adventure game featuring a complex fighting engine in procedurally generated levels that destines its three warriors to battle a different abyss each time."}, {"name": "Panzer Tactics HD", "details_link": "https://www.metacritic.com/game/pc/panzer-tactics-hd", "publisher": "Bit Composer", "release_date": "May 22 2014", "developers": ["Sproing Interactive Media", "Sproing"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Historic", "Tactics"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/c0ebd9944aef023c83230f3f83e6419a-98.jpg", "descriptions": null}, {"name": "Disney/Pixar Cars Mater-National Championship", "details_link": "https://www.metacritic.com/game/ds/disneypixar-cars-mater-national-championship", "publisher": "THQ", "release_date": "Oct 29 2007", "developers": ["Rainbow Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/482d644a079ca4a78a5562c7baadf68d-98.jpg", "descriptions": "Cars Mater-National features an all-new International group of racers vying for their chance to compete against Lightning McQueen in the First Annual Mater-National Race Festival, hosted by Lightning’s best friend, Mater. Explore the new and improved open world of Radiator Springs, play inCars Mater-National features an all-new International group of racers vying for their chance to compete against Lightning McQueen in the First Annual Mater-National Race Festival, hosted by Lightning’s best friend, Mater. Explore the new and improved open world of Radiator Springs, play in the all-new Monster Mode, jump into the fast lane with 6 new International racing competitors, burn rubber on new tracks, and twist and turn your way through new mini-games like Ramone’s Rhythmic Rumble and Fillmore’s Fuel Frenzy. Explore the new open world of Radiator Springs, Lightning McQueen’s new Racing Headquarters, and practice facility Over 20 challenging mini-games. 7 exciting new international characters. Multiple new adrenaline-packed tracks to race on. Go head to head with over 10 multiplayer games. [THQ]… Expand"}, {"name": "Driver: Parallel Lines", "details_link": "https://www.metacritic.com/game/playstation-2/driver-parallel-lines", "publisher": "Atari", "release_date": "Mar 14 2006", "developers": ["Reflections Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/d55908eca121edc2e908c6373eb7bad0-98.jpg", "descriptions": "Driver: Parallel Lines is the next installment of Atari's legendary franchise action driving game. As the only game that offers an open, fast-paced driving action-movie experience, Driver: Parallel Lines features an unfolding storyline of double crossing and revenge. Set in a photorealisticDriver: Parallel Lines is the next installment of Atari's legendary franchise action driving game. As the only game that offers an open, fast-paced driving action-movie experience, Driver: Parallel Lines features an unfolding storyline of double crossing and revenge. Set in a photorealistic interpretation of New York City, players take on the role of a notorious 18 year old who, free from conscience and rules, is the most sought after driver-for-hire in town. Get down and dirty in cars of all kinds. Modify and juice up cars before engaging in Hollywood-style car chases. Features over 40 diverse missions, online multiplayer options, realistic driving physics, and a brand new story with an unforeseen twist. [Atari]… Expand"}, {"name": "Disney's Cinderella: Magical Dreams", "details_link": "https://www.metacritic.com/game/game-boy-advance/disneys-cinderella-magical-dreams", "publisher": "Buena Vista Interactive", "release_date": "Sep 20 2005", "developers": ["Culture Brain"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/50f71bca594f5cb8f389ce279d2252c6-98.jpg", "descriptions": "In Cinderella: Magical Dreams, you can relive the classic Cinderella story from one of three perspectives: Cinderella, the mice, or the Fairy Godmother."}, {"name": "Dragon Ball GT: Transformation", "details_link": "https://www.metacritic.com/game/game-boy-advance/dragon-ball-gt-transformation", "publisher": "Atari", "release_date": "Aug  9 2005", "developers": ["Webfoot Technologies"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/e8f59f6e15cc041d92e1fef2fbeb1b9f-98.jpg", "descriptions": "Dragon Ball GT: Transformation is a Game Boy Advance action game based on the Japanese cartoon Dragon Ball GT. Transformation follows the Dragon Ball GT storyline from the Child Goku Saga to the Baby Saga. You can create three-man teams from seven playable characters--such as Goku, Trunks,Dragon Ball GT: Transformation is a Game Boy Advance action game based on the Japanese cartoon Dragon Ball GT. Transformation follows the Dragon Ball GT storyline from the Child Goku Saga to the Baby Saga. You can create three-man teams from seven playable characters--such as Goku, Trunks, and Uub--and choose who you control in the middle of a battle.… Expand"}, {"name": "Rondo of Swords", "details_link": "https://www.metacritic.com/game/ds/rondo-of-swords", "publisher": "Atlus", "release_date": "Apr 15 2008", "developers": ["Success"], "platforms": "DS", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/6bb86041ab4a62d011308288ba7a388e-98.jpg", "descriptions": "Rondo of Swords combines an epic narrative, complete with a branching story and multiple endings, with an innovative combat mechanic that takes advantage of the DS touch screen and forces you to add even more strategy and planning to your attacks.  Route Maneuvers allow you to hit allRondo of Swords combines an epic narrative, complete with a branching story and multiple endings, with an innovative combat mechanic that takes advantage of the DS touch screen and forces you to add even more strategy and planning to your attacks.  Route Maneuvers allow you to hit all enemies in your path and enhance your attack or defense, while managing your Momentum Counter to gain stat bonuses and control who your enemies target becomes critical to success!  Challenging gameplay, a lengthy campaign, deep party management, and customizable skills all come together to make Rondo of Swords a compelling fantasy strategy RPG package.  Cleanse the sacred blade, protect the princess, and vanquish the oppressing armies of your enemy on your quest to deliver the Kingdom of Bretwalde from tyranny! [Atlus USA]… Expand"}, {"name": "Mystery Dungeon: Shiren the Wanderer", "details_link": "https://www.metacritic.com/game/ds/mystery-dungeon-shiren-the-wanderer", "publisher": "Sega", "release_date": "Mar  4 2008", "developers": ["ChunSoft"], "platforms": "DS", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General", "Roguelike"], "meta_score": 69, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/da44d3e80fb251155f687fd280e1503f-98.jpg", "descriptions": "On a quest to the mystical Lair of the Golden Condor, Shiren the Wanderer and his weasel ally, Koppa, venture through treacherous lands in an attempt to solve the mystery surrounding this legendary realm. Many other warriors have set out on this quest but none have survived the long,On a quest to the mystical Lair of the Golden Condor, Shiren the Wanderer and his weasel ally, Koppa, venture through treacherous lands in an attempt to solve the mystery surrounding this legendary realm. Many other warriors have set out on this quest but none have survived the long, perilous journey through deep caverns, vast forests, and dangerous mountain passes. Filled with ferocious monsters, hidden traps, and thieves, the road to the Lair of the Golden Condor is not for the faint of heart. Shiren is determined to succeed and claim the riches that await the first hero to reach the mythic land. In this classic RPG, you'll move in a turn-based manner through randomly generated dungeons that provide a great challenge and lasting replay value. Outwit your enemies using advanced tactics and clever puzzle solving skills while finding mysterious items, numerous spells and other equipment to help you on your journey. If you can survive to solve the mystery, you'll find the fortune that you seek. [Sega]… Expand"}, {"name": "Crazy Taxi 3: High Roller", "details_link": "https://www.metacritic.com/game/xbox/crazy-taxi-3-high-roller", "publisher": "Sega", "release_date": "Jul 24 2002", "developers": ["Hitmaker"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/48d56f568f971db7055877d77fd8e0d0-98.jpg", "descriptions": "The yellow cab is back on the streets of America. Crazy Taxi 3: High Roller lets you get behind the wheel with one of four new characters, each with his or her own trademark attitude and new set of wheels. Your job is to cruise around popular locations to pick up wacky customers so that youThe yellow cab is back on the streets of America. Crazy Taxi 3: High Roller lets you get behind the wheel with one of four new characters, each with his or her own trademark attitude and new set of wheels. Your job is to cruise around popular locations to pick up wacky customers so that you can amass the highest number of tips. Whether you're making crazy money in Glitter Oasis, conquering the new batch of minigame challenges, or trying out new tricks in the old stomping grounds of the West Coast and the Small Apple, Crazy Taxi 3 offers wild automotive action.… Expand"}, {"name": "Harry Potter and the Order of the Phoenix", "details_link": "https://www.metacritic.com/game/wii/harry-potter-and-the-order-of-the-phoenix", "publisher": "EA Games", "release_date": "Jun 25 2007", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 69, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/5faab2c7b01e389dc2fb7db9d7630a89-98.jpg", "descriptions": "In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster,In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster, Albus Dumbledore, is lying about Voldemort's return in order to undermine his power and take his job, the Minister for Magic, Cornelius Fudge, appoints a new Defense Against the Dark Arts teacher to keep watch over Dumbledore and the Hogwarts students. But Professor Dolores Umbridge's Ministry-approved course of defensive magic leaves the young wizards woefully unprepared to defend themselves against the dark forces threatening them and the entire wizarding community, so at the prompting of his friends Hermione and Ron, Harry takes matters into his own hands. Meeting secretly with a small group of students who name themselves \"Dumbledore’s Army,\" Harry teaches them how to defend themselves against the Dark Arts, preparing the courageous young wizards for the extraordinary battle that lies ahead. With the ability to play multiple characters, including Harry Potter, Dumbledore and Sirius Black, the videogame of Harry Potter and the Order of the Phoenix offers fans the opportunity to wield a wand, explore all around Hogwarts, and experience one of the most exciting and dangerous years in the life of the Boy Who Lived. [Electronic Arts / Warner Bros.]… Expand"}, {"name": "Sword Art Online: Hollow Realization", "details_link": "https://www.metacritic.com/game/playstation-4/sword-art-online-hollow-realization", "publisher": "Bandai Namco Games", "release_date": "Nov  8 2016", "developers": ["Bandai Namco Games", "Aquria"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/7a49b11005415a49ee3e4154c9dd1a72-98.jpg", "descriptions": "An action RPG written under the supervision of Sword Art Online creator Reki Kawahara! Kirito receives a single mysterious message — a cryptic “I’m back to Aincrad” — and is drawn once again into a familiar world in which he was once trapped."}, {"name": "Absolver", "details_link": "https://www.metacritic.com/game/playstation-4/absolver", "publisher": "Devolver Digital", "release_date": "Aug 29 2017", "developers": ["Sloclap"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/8d5ef493b0b0f7394963df7d0f70301c-98.jpg", "descriptions": "In the ruins of the fallen Adal Empire, you awaken with a mysterious mask on your face, and faint recollections of an esoteric ceremony. Freeing you from hunger, thirst, and even death, the mask is the creation of the Guides, the rulers of these lands, who have placed you here to determineIn the ruins of the fallen Adal Empire, you awaken with a mysterious mask on your face, and faint recollections of an esoteric ceremony. Freeing you from hunger, thirst, and even death, the mask is the creation of the Guides, the rulers of these lands, who have placed you here to determine whether you are worthy of becoming part of the elite corps of Absolvers. As you wander these forsaken lands, encountering other Prospects like you, you will learn new combat styles, acquire weapons, gear and armor, and build a team of warriors with whom to fight side by side in Arenas of combat. [Sony]… Expand"}, {"name": "Magical Starsign", "details_link": "https://www.metacritic.com/game/ds/magical-starsign", "publisher": "Nintendo", "release_date": "Oct 23 2006", "developers": ["Brownie Brown"], "platforms": "DS", "num_players": "1-6 ", "genres": ["Role-Playing", "General", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/9a8d809f3fc7887e78d3fa5ba6bd7415-98.jpg", "descriptions": "The students of Will O'Wisp magical academy have a little problem: Their teacher has mysteriously disappeared. After commandeering a handful of rockets to rescue her, they've wound up on a strange (and sometimes scary) adventure through outer space. Now players must rescue both theirThe students of Will O'Wisp magical academy have a little problem: Their teacher has mysteriously disappeared. After commandeering a handful of rockets to rescue her, they've wound up on a strange (and sometimes scary) adventure through outer space. Now players must rescue both their classmates AND their teacher – and just maybe the whole solar system while they’re at it. Explore strange planets. Players see the sights of this strange, sci-fi fantasy setting as they uncover the secret behind their teacher's disappearance in this epic role-playing game. The stylus controls everything, from combat to conversations to outfitting allies. Simple controls make it easy to play but a challenge to master. Players can link up wirelessly with five friends and explore the amigo dungeon together – they'll find unending challenges and incredible rewards as they delve into the depths of this unique multiplayer experience. Madeleine, a respected and powerful teacher at Will O'Wisp magical academy, tells her students that she will undertake a dangerous mission in space and trains them for combat should the need arise. After not hearing from her for some time, the kids stumble upon a hangar of rocket ships. One by one, they board individual ships and crash land on distant planets alone. Players hop from planet to planet assembling the group of classmates. Once together, they learn of an evil sorcerer – a former student of the academy who now has ambitions to destroy reality – and set out to stop him. The game’s combat plays like a traditional role-playing game. The difference comes from the command wheel and the stylus interface. Players tap on the attacks they want to use and then tap on an enemy to target. The game focuses on magic attacks: Each character has a \"sign\" linked to one of the planets that determines the type of magic he or she uses. As the planets move through the solar system, the effectiveness of magic spells shifts, requiring an ever-changing battle plan: Monsters and characters grow stronger as their planets shift into prominence and weaker as they move out of those positions. Players can check the planets' positions by tapping on the astrolog. [Nintendo]… Expand"}, {"name": "Ride 2", "details_link": "https://www.metacritic.com/game/playstation-4/ride-2", "publisher": "Square Enix", "release_date": "Feb 14 2017", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 69, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/b54e8aaedd3f547406b0546d387a1bc2-98.jpg", "descriptions": "Welcome to the temple of motorcycles, the only digital garage that will allow you to discover, transform and test the world’s fastest, most iconic and original vehicles. The top of the range of the most famous brands will await you to compete against each other in a unique videogame and showWelcome to the temple of motorcycles, the only digital garage that will allow you to discover, transform and test the world’s fastest, most iconic and original vehicles. The top of the range of the most famous brands will await you to compete against each other in a unique videogame and show the world their full potential. Over 200 bikes are the undisputed protagonists of the new chapter of this long-waited two-wheel racing game! Feel the adrenaline rush through your veins and face the most dreadful bends with the passion and the boldness of a professional rider. [Milestone]… Expand"}, {"name": "God Eater 2: Rage Burst", "details_link": "https://www.metacritic.com/game/playstation-4/god-eater-2-rage-burst", "publisher": "Bandai Namco Games", "release_date": "Aug 30 2016", "developers": ["Shift"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 69, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/f5eea7dae8f2bf6d3298fc1316750fb2-98.jpg", "descriptions": "3 years following the events of GOD EATER: Resurrection, a mysterious red rain sparks a fatal pandemic called the Black Plague. With no established cure, this scourge has a mortality rate of 100% once infected. Members of the Special Unit \"Blood\", an Affiliate of the Fenrir Organization, are3 years following the events of GOD EATER: Resurrection, a mysterious red rain sparks a fatal pandemic called the Black Plague. With no established cure, this scourge has a mortality rate of 100% once infected. Members of the Special Unit \"Blood\", an Affiliate of the Fenrir Organization, are sent to assist and investigate. Assume control of their newest recruit as you master incredible weaponry, challenge enormous monsters, and cooperate with an iconic cast of characters fighting for humanity in GOD EATER 2: Rage Burst. … Expand"}, {"name": "Ty the Tasmanian Tiger 2: Bush Rescue", "details_link": "https://www.metacritic.com/game/xbox/ty-the-tasmanian-tiger-2-bush-rescue", "publisher": "EA Games", "release_date": "Oct 12 2004", "developers": ["Krome Studios"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/9e9777422db35a207b46594eb366ddd9-98.jpg", "descriptions": "The tiger returns to take back the Outback in Ty the Tasmanian Tiger 2. The evil Boss Cass has broken out of Currawong Jail and has hatched a plan to take over the world with an army of Uber Reptiles. Now it's up to Ty, the boomerang-wielding hero, and his newly formed team of BurramudgeeThe tiger returns to take back the Outback in Ty the Tasmanian Tiger 2. The evil Boss Cass has broken out of Currawong Jail and has hatched a plan to take over the world with an army of Uber Reptiles. Now it's up to Ty, the boomerang-wielding hero, and his newly formed team of Burramudgee Bush Rescue mates to stop him. As Ty, you can explore an expansive open environment on foot or in a vehicle. You'll also have access to more boomerangs and mech units, each with special powers and abilities.… Expand"}, {"name": "Wings of War", "details_link": "https://www.metacritic.com/game/pc/wings-of-war", "publisher": "Gathering", "release_date": "Aug 30 2004", "developers": ["Silver Wish Games"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Simulation", "Flight", "WWI", "WWI", "Combat"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/30a48ff4c0dcde0d766399e86e4e414d-98.jpg", "descriptions": "High-speed combat, high intensity action, and high-flying heroes rule the skies in Wings of War. All of the deadly drama and intense aerial duels of WWI will blast the PC as history's greatest flying aces take to the air. As rookie pilot Benjamin, you must prove your mettle against kings ofHigh-speed combat, high intensity action, and high-flying heroes rule the skies in Wings of War. All of the deadly drama and intense aerial duels of WWI will blast the PC as history's greatest flying aces take to the air. As rookie pilot Benjamin, you must prove your mettle against kings of the skies, and choose your destiny. Earn medals and ranks as you fight for your country under the service of your commanders. Seek fortune and glory as you take on side quests. The choice is up to you! The sky's the limit as you blaze a path to glory on Wings of War.… Expand"}, {"name": "Neighbors from Hell", "details_link": "https://www.metacritic.com/game/pc/neighbors-from-hell", "publisher": "Encore Software, Inc.", "release_date": "Sep 22 2003", "developers": ["JoWooD Entertainment AG"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 69, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/22f1d3405848dec62007094e49779de7-98.jpg", "descriptions": "Living next door to you is a real Neighbour From Hell and it's now time to have your revenge! Creep around your neighbour ?s house performing ever more elaborate tricks upon the unsuspecting resident. As the star of a fantastic new TV show, cameras will track your every move as you set yourLiving next door to you is a real Neighbour From Hell and it's now time to have your revenge! Creep around your neighbour ?s house performing ever more elaborate tricks upon the unsuspecting resident. As the star of a fantastic new TV show, cameras will track your every move as you set your fiendish traps. Your objectives are to create more and more disarray, increase ratings and maybe even winning prestigious awards. But beware of watchful neighbours and alert guard dogs; if they catch you then the show will be taken off air. [JoWood Productions]… Expand"}, {"name": "IndyCar Series", "details_link": "https://www.metacritic.com/game/playstation-2/indycar-series", "publisher": "Codemasters", "release_date": "May 21 2003", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/1d7b4f0ed6c73764df7f9d3d5af0b9f1-98.jpg", "descriptions": "The main game offers immediate high-paced action and player-friendly handling, making the feel both authentic and realistic. It is easy to pick up and play and offers a dynamic difficulty management system to keep the action packed, 200mph maneuvers coming thick and fast. Modes include QuickThe main game offers immediate high-paced action and player-friendly handling, making the feel both authentic and realistic. It is easy to pick up and play and offers a dynamic difficulty management system to keep the action packed, 200mph maneuvers coming thick and fast. Modes include Quick Race, IndyCar Series Season, and The Indy 500. Features realistic AI and team tactics modeled after real IndyCar Series drivers and tems. Learn more about IndyCar Series tactics from the Masterclass, taught by Indianapolis 500 winner Eddie Cheever Jr. Create your own racing drivers and teams with your own personalized car. IndyCar Series TV-style presentation, which enhances the immersive gameplay experience. [Codemasters]… Expand"}, {"name": "The Sum of All Fears", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-sum-of-all-fears", "publisher": "Ubisoft", "release_date": "Nov 19 2002", "developers": ["Red Storm Entertainment"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Action Adventure", "Modern"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/8218a8fd49dd6bc9b67f5c9f44653aa0-98.jpg", "descriptions": "Based on the novel by Tom Clancy, The Sum of All Fears lets you play as a member of the FBI's Hostage Rescue Team. Everything you have ever trained for will be put to the test as you command your counterterrorist group through 11 dangerous missions. Equipped with 15 authentic gun types,Based on the novel by Tom Clancy, The Sum of All Fears lets you play as a member of the FBI's Hostage Rescue Team. Everything you have ever trained for will be put to the test as you command your counterterrorist group through 11 dangerous missions. Equipped with 15 authentic gun types, flashbangs, and frag grenades, you can square off against combatants worldwide in six multiplayer zones. If you fail, the most destructive weapon known to humankind will be unleashed on American soil.… Expand"}, {"name": "Outlaw Golf", "details_link": "https://www.metacritic.com/game/gamecube/outlaw-golf", "publisher": "Simon & Schuster", "release_date": "Oct 29 2002", "developers": ["Hypnotix"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 69, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/ab4c6ee478109a1953cf7b61ad263b5f-98.jpg", "descriptions": "Golf meets strippers, ex-cons, and wannabe rappers. In Outlaw Golf, you can step into the shoes of all kinds of criminals and compete in 30 tour events. With each event, you'll unlock new characters and better equipment and improve your character's skills. Challenge three of your friends inGolf meets strippers, ex-cons, and wannabe rappers. In Outlaw Golf, you can step into the shoes of all kinds of criminals and compete in 30 tour events. With each event, you'll unlock new characters and better equipment and improve your character's skills. Challenge three of your friends in eight different games, including stroke, match, skins, best ball, casino, and more. Play like a pro and the game gets easier; play poorly and the game becomes tougher. … Expand"}, {"name": "Spring Break", "details_link": "https://www.metacritic.com/game/pc/spring-break", "publisher": "Eidos Interactive", "release_date": "Sep 10 2002", "developers": ["Deep Red"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Business / Tycoon"], "meta_score": 69, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/7596d81b945606416e2401c4bc874a48-98.jpg", "descriptions": "It's time to slather on the suntan lotion, slip on your flip-flops, and head down to the beach for an epic spring break party! From feverish flings to sloshed scuffles to savage shark attacks, with Virtual Resort: Spring Break you will experience all the pleasure and pain of running yourIt's time to slather on the suntan lotion, slip on your flip-flops, and head down to the beach for an epic spring break party! From feverish flings to sloshed scuffles to savage shark attacks, with Virtual Resort: Spring Break you will experience all the pleasure and pain of running your very own vacation hot spot. As the Spring Break kingpin, you are in charge of creating a tropical playground teeming with coeds, clubs, cabanas and more. Once developed, kick back and watch your guests' hedonistic holiday fun in the sun. The more fun they have, the more fun you have! [Eidos Interactive]… Expand"}, {"name": "Crazy Taxi", "details_link": "https://www.metacritic.com/game/gamecube/crazy-taxi", "publisher": "Acclaim", "release_date": "Nov 17 2001", "developers": ["Acclaim"], "platforms": ["iPhone/iPad", "PC", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "GameCube"], "num_players": "1 Player", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 69, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/eb83e2440f8963edd6fb7da0d94757ed-98.jpg", "descriptions": "As a fearless cab driver with attitude, your goal is to rack up the mega-bucks before your shift ends.  It's a race against the clock as you pick up passengers and white-knuckle it through busy streets and back alleys to their various destinations.  To keep that meter collecting cash, you'veAs a fearless cab driver with attitude, your goal is to rack up the mega-bucks before your shift ends.  It's a race against the clock as you pick up passengers and white-knuckle it through busy streets and back alleys to their various destinations.  To keep that meter collecting cash, you've gotta take the fastest route possible, even if it means bending the traffic laws--just a little.  So get a grip on the wheel, sharpen your senses, and don't lose your cool.… Expand"}, {"name": "Trade Empires", "details_link": "https://www.metacritic.com/game/pc/trade-empires", "publisher": "Eidos Interactive", "release_date": "Sep 17 2001", "developers": ["Frog City Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/403903fef5728fefdaa39ce774515fe8-98.jpg", "descriptions": "A scenario- based, economic simulation game about creating a merchant empire through trade. Controlling your family dynasty of merchants, your mission is to build vast transport and trade networks that change over thousands of years as new technologies are developed and more modern productsA scenario- based, economic simulation game about creating a merchant empire through trade. Controlling your family dynasty of merchants, your mission is to build vast transport and trade networks that change over thousands of years as new technologies are developed and more modern products are discovered. [Eidos Interactive]… Expand"}, {"name": "Sudden Strike", "details_link": "https://www.metacritic.com/game/pc/sudden-strike", "publisher": "Strategy First", "release_date": "Jan 23 2001", "developers": ["Fireglow"], "platforms": "PC", "num_players": "1-12 ", "genres": ["Strategy", "General", "General"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/67d0eedf748a5e4e37855dc01a7c304e-98.jpg", "descriptions": "Capture enemy fortifications, win the fight for possession of the buildings, and call for paratrooper and fighter-bomber reinforcements.  [Strategy First]"}, {"name": "Duck Dodgers Starring Daffy Duck", "details_link": "https://www.metacritic.com/game/nintendo-64/duck-dodgers-starring-daffy-duck", "publisher": "Infogrames", "release_date": "Sep 16 2000", "developers": ["Paradigm Entertainment"], "platforms": "Nintendo 64", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/bcace2807a5865942e84fdf307aef68f-98.jpg", "descriptions": "Can you do it, Duck Dodgers? Can you save the Earth? Marvin the Martian has built the Ultimate Weapon to destroy our planet. But there's one small problem: Ultimate Weapons require a lot of energy that Marvin doesn't have. So he sends out his minions to search for energy atoms. It's up toCan you do it, Duck Dodgers? Can you save the Earth? Marvin the Martian has built the Ultimate Weapon to destroy our planet. But there's one small problem: Ultimate Weapons require a lot of energy that Marvin doesn't have. So he sends out his minions to search for energy atoms. It's up to you, Duck Dodgers, savior of the Universe (and master klutz), to stop Marvin before he collects enough atoms to make his diabolical plan a success. We're counting on you!… Expand"}, {"name": "Deep Fighter: The Tsunami Offense", "details_link": "https://www.metacritic.com/game/dreamcast/deep-fighter-the-tsunami-offense", "publisher": "Ubisoft", "release_date": "Aug 22 2000", "developers": ["Criterion Games"], "platforms": "Dreamcast", "genres": ["Simulation", "Sci-Fi", "Futuristic Sub"], "meta_score": 69, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/6b59b2bbcca2c6582023d04a4bf8a04b-98.jpg", "descriptions": "While Deep Fighter isn't destined for any awards, the game's intriguing storyline, solid gameplay, and sharp graphics make playing it a pleasurable experience."}, {"name": "NCAA GameBreaker 2001", "details_link": "https://www.metacritic.com/game/playstation/ncaa-gamebreaker-2001", "publisher": "SCEA", "release_date": "Aug 21 2000", "developers": ["989 Sports"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/7f1dcc9a26486c14705da5d218b8483e-98.jpg", "descriptions": "NCAA GameBreaker 2001 is basically the same as last year's model."}, {"name": "Alien Breed: Evolution", "details_link": "https://www.metacritic.com/game/xbox-360/alien-breed-evolution", "publisher": "Team17", "release_date": "Dec 16 2009", "developers": ["Team17"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 69, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/a6fb9678b6ab58529c247765a736910e-98.jpg", "descriptions": "[Xbox Live Arcade]  Alien Breed Evolution (Episode 1) marks the rebirth of a gaming legend that has laid dormant for years. While the core gameplay remains intact, the technology, online component, and production values have improved immeasurably for your pleasure. The first episode of three[Xbox Live Arcade]  Alien Breed Evolution (Episode 1) marks the rebirth of a gaming legend that has laid dormant for years. While the core gameplay remains intact, the technology, online component, and production values have improved immeasurably for your pleasure. The first episode of three has you battling alone or partnering up against the \"breed,\" offline or online over five action-packed single-player levels and three multiplayer levels. Including bar-raising visuals and immersive gameplay, Alien Breed Evolution (Episode 1) is the definitive must-have action horror title you've been waiting for! [Team17 Software]… Expand"}, {"name": "Kukoos - Lost Pets", "details_link": "https://www.metacritic.com/game/playstation-4/kukoos---lost-pets", "publisher": "Maximum Games", "release_date": "Dec  6 2022", "developers": ["Petit Fabrik"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/580f2589152cf28e0bb66320369d7863-98.jpg", "descriptions": "This 3D platformer takes players to a new universe of limitless adventures, join the Kukoos in a corky and upbeat adventure to rescue the brainwashed pets. Enter the Kukoo Tree and its infinite doors that take you to unimaginable words of dangers and wonders.The accessible gameplay teachesThis 3D platformer takes players to a new universe of limitless adventures, join the Kukoos in a corky and upbeat adventure to rescue the brainwashed pets. Enter the Kukoo Tree and its infinite doors that take you to unimaginable words of dangers and wonders.The accessible gameplay teaches beginners to progress and uncover the mysteries story. As you play and master the mechanics the game grows with the player and challenges you with more ways to interact and think outside the box.Play as K or Kika and meet many friendly Kukoos, not so friendly Sea creatures and Join Forces with 5 uncanny Pets that will change your gameplay, inviting you to learn adapt, unleashing new powers and ways think the levels.… Expand"}, {"name": "Imp of the Sun", "details_link": "https://www.metacritic.com/game/switch/imp-of-the-sun", "publisher": "Sold Out", "release_date": "Mar 24 2022", "developers": ["Sunwolf  Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/0018f0e65504ae174b90b8d645071df9-98.jpg", "descriptions": "A fast-paced, high-skill 2D action-platformer. As the Imp of the Sun, players will explore sprawling, hand-crafted 2D environments, using platforming skills to navigate complex levels, and quick reflexes to combat various enemies, while gaining new power and abilities as they progress."}, {"name": "Nickelodeon Kart Racers 2: Grand Prix", "details_link": "https://www.metacritic.com/game/xbox-one/nickelodeon-kart-racers-2-grand-prix", "publisher": "GameMill Publishing", "release_date": "Oct  6 2020", "developers": ["Bamtang", "GameMill Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 69, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/87cdb5e7e03b8c3a3089eced7e986ff7-98.jpg", "descriptions": "Nickelodeon Kart Racers is back! We've brought the whole gang and more!Choose from 30 of Nickelodeon's Hall of Fame, incluuding Jojo Siwa, Spongebob Squarepants, The Teenage Mutant Ninja Turtles, the babies from Rugrats, the cool kids from Hey Arnold!, Ren and Stimpy, Lincoln Loud and hisNickelodeon Kart Racers is back! We've brought the whole gang and more!Choose from 30 of Nickelodeon's Hall of Fame, incluuding Jojo Siwa, Spongebob Squarepants, The Teenage Mutant Ninja Turtles, the babies from Rugrats, the cool kids from Hey Arnold!, Ren and Stimpy, Lincoln Loud and his sisters, and more! Speed your way across 28 slime filled tracks to win highly coveted cups and over 80 upgrades for your kart! Shift into next gear by challenging your friends in local or online multiplayer and see who can cross the finish line first! On your marks, get set, slime!Features:- More than Double the Racers! 30 of the most iconic Nickelodeon characters; SpongeBob, TMNT, Hey Arnold!, Rugrats, Jojo Siwa and more.- Race on 28 different slime-filled tracks, new and old.- Featuring 80 Karts with multiple power-ups and special attacks- Local and and Online Multi-Player! Non-stop action the entire family will love… Expand"}, {"name": "Darkestville Castle", "details_link": "https://www.metacritic.com/game/playstation-4/darkestville-castle", "publisher": "Buka Entertainment", "release_date": "Aug 13 2020", "developers": ["Epic llama warchief"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 69, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/ebbd8af313599cc7cbad563c509cd9c7-98.jpg", "descriptions": "Like any decent demon Cid spends his nights performing all kind of evil deeds to the peaceful people of Darkestville. Little does he know that his old arch enemy is about to change his life forever."}, {"name": "Mercenary Kings: Reloaded Edition", "details_link": "https://www.metacritic.com/game/switch/mercenary-kings-reloaded-edition", "publisher": "Tribute Games", "release_date": "Feb  6 2018", "developers": ["Tribute Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 69, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/3809552fa4b26587db454b05d01aca2b-98.jpg", "descriptions": "In this 2D action game, you are part of the Mercenary Kings, the most skilled team of warriors-for-hire on Earth, but when your friends have fallen and the fearsome forces of CLAW have seized an island-wide top secret Laboratory Base, you have to do what it takes to stop them."}, {"name": "We Were Here Too", "details_link": "https://www.metacritic.com/game/pc/we-were-here-too", "publisher": "Total Mayhem Games", "release_date": "Feb  2 2018", "developers": ["Total Mayhem Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 69, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/f9b5b734850bfb463ae24ad3fcb82eb0-98.jpg", "descriptions": "As your final hour approaches, a large structure looms up in the distance, towering above the relentless storm. Discover the truth behind this dark castle in a communication-based, cooperative puzzle adventure."}]