[{"name": "Dead Space 2", "details_link": "https://www.metacritic.com/game/pc/dead-space-2", "publisher": "Electronic Arts", "release_date": "Jan 25 2011", "developers": ["Visceral Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/086dbc6f10fc74f094f22a1cace576ba-98.jpg", "descriptions": "Hero Isaac Clarke returns for another heart-pounding adventure, taking the fight to the Necromorphs in this thrilling action-horror experience. New tools to gruesomely slice and dismember the Necromorphs complement Isaac's signature Plasma Cutter, empowering him as he meets new characters,Hero Isaac Clarke returns for another heart-pounding adventure, taking the fight to the Necromorphs in this thrilling action-horror experience. New tools to gruesomely slice and dismember the Necromorphs complement Isaac's signature Plasma Cutter, empowering him as he meets new characters, explores epic Zero-G environments, and fights against a relentless necromorph onslaught.  Survival isn't the only thing on Isaac's mind in Dead Space 2  – this time, he calls the shots. [Electronic Arts]… Expand"}, {"name": "DiRT 2", "details_link": "https://www.metacritic.com/game/playstation-3/dirt-2", "publisher": "Codemasters", "release_date": "Sep  8 2009", "developers": ["Codemasters"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/0889c213c644c93fa4a2f1e739b9e392-98.jpg", "descriptions": "(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking players on an exhilarating World Tour, DiRT 2 delivers over 100 stunning events, including aggressive, multi-vehicle races and intense solo challenges, set in the most diverse and demanding real-world environments. From the muddy tracks of the Malaysian rainforest to spectator-packed stadiums in London and Los Angeles, racers compete in contemporary off-road race disciplines covering Rallycross, Trailblazer, Raid, Landrush, and Rally. Embracing the culture and new heroes of modern off-road racing, DiRT 2 features an exciting line-up of the best new rally drivers - including the multi medal-winning Subaru Rally Team USA driver Ken Block alongside Travis Pastrana, Dave Mirra, and Tanner Faust, who help players build their racing career. [Codemasters]… Expand"}, {"name": "Theatrhythm Final Bar Line", "details_link": "https://www.metacritic.com/game/switch/theatrhythm-final-bar-line", "publisher": "Square Enix", "release_date": "Feb 16 2023", "developers": ["indieszero"], "platforms": ["PlayStation 4", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 87, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/b9d5bbb6d0155aa831b4ac8427425ace-98.jpg", "descriptions": "A rhythm action game packed with 385 carefully selected music tracks from across the whole FINAL FANTASY series. ♪ The music of FINAL FANTASY comes together here. Includes popular tracks from a total of 46 different games, featuring the latest music from FFI through to FFXV in the mainA rhythm action game packed with 385 carefully selected music tracks from across the whole FINAL FANTASY series. ♪ The music of FINAL FANTASY comes together here. Includes popular tracks from a total of 46 different games, featuring the latest music from FFI through to FFXV in the main series, as well as remakes, spin-offs and various different soundtrack CDs.\rRelive the thrilling battles and soaring emotions alongside beautiful music and video.\r ♪ Throw yourself into the rhythm\rPush the buttons in time with the music to match triggers moving across the screen on 3 different types of stage. With easy to learn controls and four different difficulty settings, anyone can jump in and have fun straight away.\rAlso supports controller sharing play using a Joy-Con™ controller.\r ♪ Online multiplayer for up to 8 players\rIntroducing riotous online Multi Battles where everyone plays together! Interfere with the other players plans and make clever use of your Burst abilities to turn the tables and grasp victory.\rDon’t forget to exchange ProfiCards once the battle is over!\r ♪Put together the party of your dreams with a total of 104 characters to choose from.\rMeet cute versions of many classic characters and monsters from the series as exciting RPG battles play out alongside the rhythm action. Gather and power up your team to beat the next stage.… Expand"}, {"name": "Raw Data", "details_link": "https://www.metacritic.com/game/pc/raw-data", "publisher": "Survios", "release_date": "Oct  5 2017", "developers": ["Survios"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/284deb692759844e63dddeca5a3f7d10-98.jpg", "descriptions": "Built from the ground up for VR, Raw Data’s action combat gameplay, intuitive controls, challenging enemies, and sci-fi atmosphere will completely immerse you within the game world. Go solo—or team up with a friend—and become the adrenaline-charged heroes of your own futuristic technothriller."}, {"name": "Disgaea: Afternoon of Darkness", "details_link": "https://www.metacritic.com/game/psp/disgaea-afternoon-of-darkness", "publisher": "NIS America", "release_date": "Oct 30 2007", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/3d6cf621b6ac6692ed07b30cd55f41dd-98.jpg", "descriptions": "Knife-wielding penguin henchmen that double as grenades. A rotten adolescent prince of darkness determined to rule the netherworld by hook or by crook. An open-ended structure that encourages players to keep playing the game and developing their characters long after the main storyline is finished."}, {"name": "Pokemon HeartGold Version", "details_link": "https://www.metacritic.com/game/ds/pokemon-heartgold-version", "publisher": "Nintendo", "release_date": "Mar 14 2010", "developers": ["Game Freak"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 87, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/1/ea34d50166d49ca4af645e85e89d5804-98.jpg", "descriptions": "Return to the beloved Johto region first introduced in the Pokémon Gold and Silver Version games for the portable Game Boy system. Several new enhancements for the series, such as updated graphics and touch screen features, enrich these timeless adventures, and the new Pokéwalker accessoryReturn to the beloved Johto region first introduced in the Pokémon Gold and Silver Version games for the portable Game Boy system. Several new enhancements for the series, such as updated graphics and touch screen features, enrich these timeless adventures, and the new Pokéwalker accessory allows players to take their favorite Pokémon with them wherever they go. Both games feature detailed graphics that spotlight the unique environments and hundreds of Pokémon that players can encounter and catch. Players can even see and interact with their favorite Pokémon outside of battle, selecting one from their team to follow behind them as they travel through the Johto region. [Nintendo]… Expand"}, {"name": "DOOM Eternal", "details_link": "https://www.metacritic.com/game/playstation-4/doom-eternal", "publisher": "Bethesda Softworks", "release_date": "Mar 20 2020", "developers": ["id Software"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/6/3a99440dc8efd4b087dc5c2f08a97ee0-98.jpg", "descriptions": "DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell.DOOM Eternal is the direct sequel to 2016's DOOM. Developed by id Software, DOOM Eternal delivers the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat. As the DOOM Slayer, you’ll return to take your vengeance against the forces of Hell. Set to an all-new pulse-pounding soundtrack composed by Mick Gordon, you fight across dimensions as you slay new and classic demons with powerful new weapons and abilities. [Bethesda]… Expand"}, {"name": "NCAA Football 07", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-football-07", "publisher": "EA Sports", "release_date": "Jul 18 2006", "developers": ["EA Sports"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/c96d84001f249a58e31ca5c9ec44de87-98.jpg", "descriptions": "Momentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintainMomentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintain momentum. Featuring unprecedented graphics that capture every moment in complete detail—from the authenticity of the stadiums, mascots, and marching bands, to the true-to-life look and feel of the players on the field. [Electronic Arts]… Expand"}, {"name": "Dragon Age: Origins", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-age-origins", "publisher": "Electronic Arts", "release_date": "Nov  3 2009", "developers": ["BioWare"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/e34bd3c79ae345d86e281f237be4358d-98.jpg", "descriptions": "As the spiritual successor to BioWare's \"Baldur's Gate\", one of the most successful role-playing games in the industry, Dragon Age: Origins represents BioWare's return to its roots, delivering a fusion of the best elements of existing fantasy works with stunning visuals, emotionally-drivenAs the spiritual successor to BioWare's \"Baldur's Gate\", one of the most successful role-playing games in the industry, Dragon Age: Origins represents BioWare's return to its roots, delivering a fusion of the best elements of existing fantasy works with stunning visuals, emotionally-driven narrative, heart-pounding combat, powerful magic abilities and credible digital actors. The spirit of classic RPGs comes of age, as Dragon Age: Origins features a dark and mature story and gameplay. Epic Party-Based Combat – Dragon Age: Origins introduces an innovative, scalable combat system, as players face large-scale battles and use their party’s special abilities to destroy hoardes of enemies and massive creatures. Powerful Magic – Raining down awesome destruction on enemies is even more compelling as players apply \"spell combos,\" a way of combining together different spells to create emergent unique effects. Players develop their characters and gain powerful special abilities (spells, talents and skills) and discover ever-increasing weapons of destruction. With its emotionally compelling story, players choose with whom they wish to forge alliances or crush under their mighty fist, redefining the world with the choices they make and how they wield their power. Players select and play a unique prelude that provides the lens through which the player sees the world and how the world sees the player. The player's choice of Origin determines who they are and where they begin the adventure, as they play through a customized story opening that profoundly impacts the course of every adventure. [BioWare]… Expand"}, {"name": "Beyond Good & Evil", "details_link": "https://www.metacritic.com/game/xbox/beyond-good-evil", "publisher": "Ubisoft", "release_date": "Dec  2 2003", "developers": ["Ubisoft Milan"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/c885df2700d6248095ec5bc2a27ad085-98.jpg", "descriptions": "For centuries, the planet Hillys has been bombarded by a relentless alien race.  In Beyond Good and Evil, a rebellious action reporter named Jade sets out to capture the truth behind the invasion.  Armed with her camera, dai-jo staff, and fierce determination, you must guide Jade as sheFor centuries, the planet Hillys has been bombarded by a relentless alien race.  In Beyond Good and Evil, a rebellious action reporter named Jade sets out to capture the truth behind the invasion.  Armed with her camera, dai-jo staff, and fierce determination, you must guide Jade as she discovers shocking evidence leading to a horrific government conspiracy and is forced to battle an evil she cannot possibly fathom.  With the ability to perform stealth techniques, dai-jo staff moves, and tag-team fighting combos, you can stop at nothing to expose the truth.… Expand"}, {"name": "Diablo III: Reaper of Souls", "details_link": "https://www.metacritic.com/game/pc/diablo-iii-reaper-of-souls", "publisher": "Blizzard Entertainment", "release_date": "Mar 25 2014", "developers": ["Blizzard Entertainment"], "platforms": "PC", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/bb3d56be6926d43b67278c4e2ed40fba-98.jpg", "descriptions": "No One Can Stop Death...The lords of hell rage within the Black Soulstone, their souls screaming for vengeance and release. Before the artifact can be sealed away forever, Malthael-Angel of Deathmanifests in the mortal realms with a deadly new purpose: to steal the Black Soulstone and bendNo One Can Stop Death...The lords of hell rage within the Black Soulstone, their souls screaming for vengeance and release. Before the artifact can be sealed away forever, Malthael-Angel of Deathmanifests in the mortal realms with a deadly new purpose: to steal the Black Soulstone and bend its infernal power to his will.\r So begins the end of all things...… Expand"}, {"name": "Little King's Story", "details_link": "https://www.metacritic.com/game/wii/little-kings-story", "publisher": "XSEED Games", "release_date": "Jul 21 2009", "developers": ["Cing"], "platforms": ["PC", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Breeding/Constructing", "Fantasy", "General", "Fantasy"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/0efcc5988fa14e91cd3c9c1e4c8c4392-98.jpg", "descriptions": "Little King's Story begins with the story of young boy named Corobo. Shy, and without many friends, Corobo stumbles upon a mysterious, powerful crown while walking in the forest near his village. He soon discovers that the crown grants him the ability to charm any person, and make themLittle King's Story begins with the story of young boy named Corobo. Shy, and without many friends, Corobo stumbles upon a mysterious, powerful crown while walking in the forest near his village. He soon discovers that the crown grants him the ability to charm any person, and make them follow his orders. Suddenly, Howzer, the bull-knight, appears, informing Corobo that he is now King of the village, and he must not take this responsibility lightly. Returning to his sleepy village, as a King instead of a shy little boy, Corobo begins a quest to turn his small hamlet into a noble, fantastic kingdom. The storyline, visual look, and lyrical music of Little King's Story, work in concert to transport players to an interactive, enchanting, fairy tale world. By combining gameplay elements from life-simulation, real-time strategy, and adventure genres, the many aspects of creating a vast kingdom come to life! As King, players manage and involve their townspeople in the goals of creating this new territory; enlist them to dig for treasure, build new buildings and otherwise better their community. Of course, leadership is a two way street, so as King, players will try to conquer rival nations to create a single unified kingdom, as well as grant the requests of townspeople at whim. With the Wii Remote as a royal scepter, Little King’s Story allows players the chance to be the best king in the world. [XSEED Games]… Expand"}, {"name": "Pro Evolution Soccer 2017", "details_link": "https://www.metacritic.com/game/xbox-one/pro-evolution-soccer-2017", "publisher": "Konami", "release_date": "Sep 13 2016", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 87, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/9c561d3cddcff38b8f385450382edbd2-98.jpg", "descriptions": "In PES 2017, the 1st touch is calculated by player attributes, as well as the further inclusion of real ball physics directly controlled by the input ball touch. See how different players control the ball in unique and different ways based on where and how you control them, dictating theIn PES 2017, the 1st touch is calculated by player attributes, as well as the further inclusion of real ball physics directly controlled by the input ball touch. See how different players control the ball in unique and different ways based on where and how you control them, dictating the flow of the game based on how they react to the unpredictable movement of the ball. In addition, there is more control in how you receive passes, and depending on the pass, players can visually execute the exact play intended, from receiving a pass to sending the ball out again. [Konami]… Expand"}, {"name": "Pro Evolution Soccer 2016", "details_link": "https://www.metacritic.com/game/playstation-4/pro-evolution-soccer-2016", "publisher": "Konami", "release_date": "Sep 15 2015", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 87, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/adb11404e1bd7716ba8ab8363ee32472-98.jpg", "descriptions": "The upgraded feint moves allow for sudden directional changes that can cause defenders to lose their balance. But the developers have added a new system to the defenders arsenal. With Perfect Defence, players who time their tackles perfectly are able to powerfully shove their opponent out ofThe upgraded feint moves allow for sudden directional changes that can cause defenders to lose their balance. But the developers have added a new system to the defenders arsenal. With Perfect Defence, players who time their tackles perfectly are able to powerfully shove their opponent out of the way and instantly secure the ball, allowing to create direct turnarounds and counter opportunities.… Expand"}, {"name": "Titanfall 2", "details_link": "https://www.metacritic.com/game/xbox-one/titanfall-2", "publisher": "Electronic Arts", "release_date": "Oct 28 2016", "developers": ["Respawn Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/8ce66d6bf1274d3cd409a2c9b24b88f4-98.jpg", "descriptions": "In single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. StrandedIn single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. Stranded behind enemy lines and facing overwhelming odds, players must team up with a veteran Titan to uphold a mission they were never meant to carry out. In multiplayer, Respawn is continuing to evolve their gameplay to provide a more robust experience that delivers expanded depth and variety that includes six new Titans, deeper Pilot abilities, more customization options, and a robust progression system that is sure to satisfy fans. [Electronic Arts]… Expand"}, {"name": "Bionic Commando: Rearmed", "details_link": "https://www.metacritic.com/game/playstation-3/bionic-commando-rearmed", "publisher": "Capcom", "release_date": "Aug 14 2008", "developers": ["GRIN"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/3b87688bba6988363a07b144504f5195-98.jpg", "descriptions": "Bionic Commando Rearmed sees a return of the intense 2D side-scrolling, shooting, and grappling action from the much-loved 1988 Bionic Commando on the Nintendo Entertainment System. Bionic Commando Rearmed brings the amazing gameplay up to date with new visuals, new weapons, online rankings,Bionic Commando Rearmed sees a return of the intense 2D side-scrolling, shooting, and grappling action from the much-loved 1988 Bionic Commando on the Nintendo Entertainment System. Bionic Commando Rearmed brings the amazing gameplay up to date with new visuals, new weapons, online rankings, a reworked musical score, and the addition of a two-player co-op mode. Local multiplayer mode for up to four players. Total modern visual revamp, including dynamic shadows, particle effects, and environmental damage. Reworking of musical score. Cross-game interoperability - complete specific parts of Bionic Commando Rearmed to unlock new content and hints for the Bionic Commando sequel. In-game art designed by one of Capcom's most talented artists, Toshiaki Mori. [Capcom]… Expand"}, {"name": "Zero Escape: The Nonary Games", "details_link": "https://www.metacritic.com/game/playstation-4/zero-escape-the-nonary-games", "publisher": "Aksys Games", "release_date": "Mar 24 2017", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/2076b7b23b28ef6d3bfc3a181d585df7-98.jpg", "descriptions": "Two Nonary Games, two sets of nine unwilling participants kidnapped to an unfamiliar location. One set trapped on a sinking boat with nine hours to escape, the other locked in a facility and forced to either trust or betray each other. If they break the rules or fail to escape… they’ll die."}, {"name": "NASCAR 2005: Chase for the Cup", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-2005-chase-for-the-cup", "publisher": "EA Games", "release_date": "Aug 31 2004", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/ac4b2ba8ba4086887edd212d44495ff7-98.jpg", "descriptions": "NASCAR 2005: Chase for the Cup challenges you to battle through a groundbreaking new story mode to achieve NASCAR stardom. Start from humble beginnings by earning NASCAR Busch, Craftsman Truck and Featherlite Modified series rides before grabbing million-dollar purses in the NEXTEL CupNASCAR 2005: Chase for the Cup challenges you to battle through a groundbreaking new story mode to achieve NASCAR stardom. Start from humble beginnings by earning NASCAR Busch, Craftsman Truck and Featherlite Modified series rides before grabbing million-dollar purses in the NEXTEL Cup Series. Develop your racing skills and intimidate your rivals on the track with all-new controls. Off the track, force the action with post-race confrontations, and settle disputes by racing America?s top production cars through city streets. Fans react to the drama, idolizing both NASCAR heroes and villains, while owners and sponsors recognize talent and reward success. It's up to you to show 'em what you've got. [Electronic Arts]… Expand"}, {"name": "Metal Gear Solid 2: Substance", "details_link": "https://www.metacritic.com/game/xbox/metal-gear-solid-2-substance", "publisher": "Konami", "release_date": "Nov  4 2002", "developers": ["KCEJ"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/66eece657d99ad10abcd08aeedb179dc-98.jpg", "descriptions": "Solid Snake returns in Metal Gear Solid 2: Substance, the expanded edition of Metal Gear Solid 2: Sons of Liberty, with all-new game modes, hidden characters, and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknownSolid Snake returns in Metal Gear Solid 2: Substance, the expanded edition of Metal Gear Solid 2: Sons of Liberty, with all-new game modes, hidden characters, and storylines. Top-secret weapons technology is being mysteriously transported under cover of an oil tanker to an unknown destination. It's up to Snake to infiltrate the transport and keep this deadly weapon of mass destruction from falling into the wrong hands. You'll have plenty of ways to practice, as the game offers more than 350 virtual reality missions in addition to more than 15 alternate missions.… Expand"}, {"name": "NBA 2K3", "details_link": "https://www.metacritic.com/game/xbox/nba-2k3", "publisher": "Sega", "release_date": "Oct  9 2002", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/166ad3e00e81801c055f7321a637d3f0-98.jpg", "descriptions": "Sega Sports™ NBA 2K3 powers forward with the kind of improvements that only results from an off-season dedicated to perfection. Imagine jump shots so real players actually adjust their movement in mid-air, based on distance from the hoop and defensive pressure; a passing touch thatSega Sports™ NBA 2K3 powers forward with the kind of improvements that only results from an off-season dedicated to perfection. Imagine jump shots so real players actually adjust their movement in mid-air, based on distance from the hoop and defensive pressure; a passing touch that gives you the control to skirt a defender or air-out a fast break; dribble moves that let you jab left, rock right, crossover, and spin; and much more. It's all happening in NBA 2K3.… Expand"}, {"name": "Shogun: Total War Warlord Edition", "details_link": "https://www.metacritic.com/game/pc/shogun-total-war-warlord-edition", "publisher": "Electronic Arts", "release_date": "Aug 13 2001", "developers": ["Creative Assembly"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Real-Time", "Historic", "Historic", "General"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/c87b05ea38f77eea4adaefd19750f2a7-98.jpg", "descriptions": "This stand-alone package includes the original complete \"Shogun: Total War\" game and the \"Mongol Invasion\" expansion which includes Kublai Khan?s invasion of Mongol hordes that try to conquer Japan and three new Japanese campaigns."}, {"name": "Serious Sam: The First Encounter", "details_link": "https://www.metacritic.com/game/pc/serious-sam-the-first-encounter", "publisher": "Gathering", "release_date": "Mar 21 2001", "developers": ["Croteam"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/a185b558bf118106c46137d93287f7e8-98.jpg", "descriptions": "Sam \"Serious\" Stone, Earth?s stud warrior, is sent back to Egypt, 3000 B.C., to fight hordes of alien monsters in this acclaimed \"Doom\"-sytle, back-to-basics, first-person shooter out of Croatia which is listed, amazingly, at the bargain basement price of 20 bucks!"}, {"name": "Grand Prix 3", "details_link": "https://www.metacritic.com/game/pc/grand-prix-3", "publisher": "Hasbro Interactive", "release_date": "Aug 24 2000", "developers": ["Hasbro Interactive", "Atari"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 87, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/c231a664b6dc0dc4074feb13be5cbbae-98.jpg", "descriptions": "Created by Geoff Crammond, the genius behind the best sellers \"F1 Grand Prix\" and \"Grand Prix 2.\"  [Hasbro Interactive]"}, {"name": "Hi-Fi Rush", "details_link": "https://www.metacritic.com/game/xbox-series-x/hi-fi-rush", "publisher": "Bethesda Softworks", "release_date": "Jan 25 2023", "developers": ["Tango Gameworks"], "platforms": ["PC", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 87, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/2/b431f6813f74e69e15f6767e62867501-98.jpg", "descriptions": "Feel the beat as wannabe rockstar Chai and his ragtag team fight against an evil megacorp with raucous rhythm combat! From Tango Gameworks comes Hi-Fi RUSH, an all-new action game where the world syncs to the music."}, {"name": "MVP Baseball 2005", "details_link": "https://www.metacritic.com/game/playstation-2/mvp-baseball-2005", "publisher": "EA Sports", "release_date": "Feb 22 2005", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/e0ff43f8b4384febe1b55423a4338dc6-98.jpg", "descriptions": "Key features for MVP Baseball 2005 include the following: Own the Plate: Change your position in the box to adjust to where the pitcher is working you, or keep the defense honest with a bunt for a hit. Precision Pitching: Paint the corners or send a message with the new Precision PitchKey features for MVP Baseball 2005 include the following: Own the Plate: Change your position in the box to adjust to where the pitcher is working you, or keep the defense honest with a bunt for a hit. Precision Pitching: Paint the corners or send a message with the new Precision Pitch Meter, or catch runners napping with unparalleled pickoff control. Enhanced Big Play Control: Make an underhand toss to the pitcher as he sprints to cover first, slide around a tag at home, and make user-controlled stretches and dives. While leading off base, exercise your reflexes by beating pickoff throws with the all-new manual leadoff control. Control every aspect of your organization in all-new Owner Mode. Create your line-up based on player progression during Spring Training, or help build player attributes by competing in a variety of mini-games. All-New Create Ballpark: In Owner Mode, build a pitcher’s paradise or a hitter’s dream. Will you spend your earnings to upgrade your ballpark or to sign that key free agent who could bring you a championship? Expanded Minor Leagues: Advanced Single A squads and additional stadiums have been added to round out the list of teams available in the minor league system. [Electronic Arts]… Expand"}, {"name": "Rayman Origins", "details_link": "https://www.metacritic.com/game/playstation-3/rayman-origins", "publisher": "Ubisoft", "release_date": "Nov 15 2011", "developers": ["UBlart Montpellier"], "platforms": ["3DS", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Action", "Action Adventure", "Adventure", "General", "Platformer", "Fantasy", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/f409d236a3d33abc23bc636960170f4e-98.jpg", "descriptions": "Rayman's new adventure is a two-dimensional cooperative platformer with a colorful, whimsical art style."}, {"name": "MLB 12: The Show", "details_link": "https://www.metacritic.com/game/playstation-3/mlb-12-the-show", "publisher": "SCEA", "release_date": "Mar  6 2012", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/98b350ef090efe24de6856b2ec5ee5db-98.jpg", "descriptions": "MLB 12 The Show builds on what has been delivered in previous franchise releases, adding compelling features that bring unparalleled innovation."}, {"name": "Pokemon Black Version", "details_link": "https://www.metacritic.com/game/ds/pokemon-black-version", "publisher": "Nintendo", "release_date": "Mar  6 2011", "developers": ["Game Freak"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/e8c691aa9343bad46b1933bcea5b2d3b-98.jpg", "descriptions": "Pokémon Black Version and Pokémon White Version feature new Pokémon that players can catch, train and battle as they progress through the game, and some Pokémon can only be caught in one version of the game. For example, the Legendary Pokémon Reshiram canPokémon Black Version and Pokémon White Version feature new Pokémon that players can catch, train and battle as they progress through the game, and some Pokémon can only be caught in one version of the game. For example, the Legendary Pokémon Reshiram can only be caught in Pokémon Black Version, while the Legendary Pokémon Zekrom can only be caught in Pokémon White Version. Additionally, the two games feature different areas for the first time in the series, with the game world of Pokémon Black Version featuring a unique metropolitan area called Black City, and a lush, green area named White Forest only found in Pokémon White Version. Pokémon Black Version and Pokémon White Version also mark the first time in a Pokémon video game that the seasons will change in the game world. Certain Pokémon appear more frequently during different seasons, and players can only access some areas during a specific season.… Expand"}, {"name": "Death's Door", "details_link": "https://www.metacritic.com/game/xbox-series-x/deaths-door", "publisher": "Devolver Digital", "release_date": "Jul 20 2021", "developers": ["Acid Nerve"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/bdf5b16f3946e4dcd4a7a9e948968437-98.jpg", "descriptions": "Reaping souls of the dead and punching a clock might get monotonous but it's honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death - where creatures grow far past their expiry and overflow withReaping souls of the dead and punching a clock might get monotonous but it's honest work for a Crow. The job gets lively when your assigned soul is stolen and you must track down a desperate thief to a realm untouched by death - where creatures grow far past their expiry and overflow with greed and power. Talon Sharp Combat:  Utilise melee weapons, arrows and magic to overcome a fantastic array of beasts and demigods. Mistakes are punished and victory is rewarded. Gain an edge by customising your character stats and mastering the abilities and upgrades you obtain.\r A Beautifully Bleak World: Venture beyond the Doors and explore a land full of twisted inhabitants and countless secrets, bringing hope to the weird and wonderful characters you’ll meet along the way.\r A Dark Mystery to Unravel: Track down and defeat colossal tyrants with stories and motivations of their own. Experience a somber yet darkly comedic tale, uncovering the truths behind the flow of souls, the role of the Crows and the origin of the Doors.… Expand"}, {"name": "Mass Effect Legendary Edition", "details_link": "https://www.metacritic.com/game/playstation-4/mass-effect-legendary-edition", "publisher": "Electronic Arts", "release_date": "May 14 2021", "developers": ["BioWare"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 87, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/b7c8b6aa216f3877ffd0c36ee3e9a7a5-98.jpg", "descriptions": "For many months now, our team at BioWare has been hard at work updating the textures, shaders, models, effects and technical features of three enormous games. Our goal was not to remake or reimagine the original games, but to modernize the experience so that fans and new players canFor many months now, our team at BioWare has been hard at work updating the textures, shaders, models, effects and technical features of three enormous games. Our goal was not to remake or reimagine the original games, but to modernize the experience so that fans and new players can experience the original work in its best possible form. It's been amazing to see the adventures of Commander Shepard take on new life in super-sharp resolution, faster framerates, and beautiful visual enhancements. \r\rMass Effect Legendary Edition includes single-player base content and DLC from Mass Effect, Mass Effect 2, and Mass Effect 3, plus promo weapons, armors, and packs - all remastered and optimized for 4k Ultra HD. It will be available in Spring 2021 for Xbox One, PlayStation 4, and PC, with forward compatibility and targeted enhancements on Xbox Series X and PlayStation 5.… Expand"}, {"name": "Wolfenstein II: The New Colossus", "details_link": "https://www.metacritic.com/game/playstation-4/wolfenstein-ii-the-new-colossus", "publisher": "Bethesda Softworks", "release_date": "Oct 27 2017", "developers": ["MachineGames"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/b3c6bc64a3458dbfde65f18fb44500ff-98.jpg", "descriptions": "Wolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players toWolfenstein II: The New Colossus is the highly anticipated sequel to the critically acclaimed, Wolfenstein: The New Order developed by the award-winning studio MachineGames. An exhilarating adventure brought to life by the industry-leading id Tech 6, Wolfenstein II sends players to Nazi-controlled America on a mission to recruit the boldest resistance leaders left. Fight the Nazis in iconic American locations, equip an arsenal of badass guns, and unleash new abilities to blast your way through legions of Nazi soldiers in this definitive first-person shooter. America, 1961. The Nazis maintain their stranglehold on the world. You are BJ Blazkowicz, aka Terror-Billy, member of the Resistance, scourge of the Nazi empire, and humanitys last hope for liberty. Only you have the guts, guns, and gumption to return stateside, kill every Nazi in sight, and spark the second American Revolution.… Expand"}, {"name": "OlliOlli World", "details_link": "https://www.metacritic.com/game/switch/olliolli-world", "publisher": "Take-Two Interactive", "release_date": "Feb  8 2022", "developers": ["roll7"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/c77fd782c5b2c511f3636a26610b0dfa-98.jpg", "descriptions": "OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana.OlliOlli World is a bold new skateboarding action-platformer that’s bursting with personality. Flip and flow through the vivid and vibrant world of Radlandia, meeting colorful characters as you grind, trick, and air your way to discover the mystical skate gods on your quest for Gnarvana. Traverse a delightful and weird world as you take on missions, challenges, and make new friends along the way. Customize your character’s looks, tricks, and style while you experience explorable levels with multiple paths that provide an array of opportunities for player expression. Challenge the world in Leagues or dare a friend to beat your best tricks on one of millions of sharable levels. Experience the accessibility, depth, and player freedom as you dive into the signature flow state gameplay of OlliOlli World.\r OlliOlli World marks the third entry in the critically-acclaimed OlliOlli series from Roll7, the BAFTA and multi-award-winning independent studio.\r Key Features:\r • Welcome to Radlandia!: Take a trip across a lush skateboarding utopia that is filled to the brim with eccentric characters and vibrant locations that are begging to be explored. Find your grind in Inflatable Alley or blaze down Los Vulgas to discover new paths, fresh side quests, rad rewards, and epic trick opportunities. All perfectly complemented by a hand-picked compilation of IDM and Electronica tracks. \r\r• Play at your level: Super tight controls combine with highly refined gameplay to ensure a silky smooth ride. Not a Pro? Don’t worry – OlliOlli World welcomes you with open arms, allowing new players to tear down streets and pull off sick method grabs without fear of faceplanting the curb. Think you’ve got what it takes? Achieve mastery through millions of unique levels in sandbox mode or compete against rivals around the globe in leagues with a hugely deep combo system with over 100 moves to master and combine in your battle for the highest score.\r • Freedom of expression: Cruise through Radlandia's epic skate-haven and prove your skills to unlock special rewards that let you customize your character’s looks, tricks and style. Want to skate in your flip flops… go for it. Want to wear a bumble bee onesie …ok then… no judgement. In OlliOlli World as long as you’re on board anything goes!   \r… Expand"}, {"name": "Axiom Verge", "details_link": "https://www.metacritic.com/game/switch/axiom-verge", "publisher": "Tom Happ", "release_date": "Oct  5 2017", "developers": ["Tom Happ"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "", "Metroidvania"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/9757b92e1404f7311b6274b39e1a461f-98.jpg", "descriptions": "Life. Afterlife. Real. Virtual. Dream. Nightmare. It's a thin line.\r This is the action-adventure you've been waiting decades for. After a lab accident, a scientist awakens in a mysterious, alien world. Is this a distant planet? The far future? Or a complex virtual-reality computerLife. Afterlife. Real. Virtual. Dream. Nightmare. It's a thin line.\r This is the action-adventure you've been waiting decades for. After a lab accident, a scientist awakens in a mysterious, alien world. Is this a distant planet? The far future? Or a complex virtual-reality computer simulation?\r Plumb the recesses of a large, labyrinthine world in order to learn its secrets and uncover your role within it.\r Discover tons of weapons, items, and abilities, each with their own unique behaviors and usage. You'll need your wits to find them all.\r Combat bizarre biomechanoid constructs, the deadly fallout of an ancient war, and the demons of your own psyche.\r And finally, break the game itself by using glitches to corrupt foes and solve puzzles in the environment.\r Life. Afterlife. Real. Virtual. Dream. Nightmare. It's a thin line.\r It's Axiom Verge.… Expand"}, {"name": "Call of Duty: United Offensive", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-united-offensive", "publisher": "Activision", "release_date": "Sep 14 2004", "developers": ["Gray Matter"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/46e74fff53c5e7f41da224b7719fa0c1-98.jpg", "descriptions": "Call of Duty: United Offensive's single player campaign allows gamers to experience more of WWII's most crucial and legendary conflicts, including The Battle of the Bulge, The Battle of Kursk and the invasion of Sicily, as they fight through more than ten intense all-new maps.  The gameCall of Duty: United Offensive's single player campaign allows gamers to experience more of WWII's most crucial and legendary conflicts, including The Battle of the Bulge, The Battle of Kursk and the invasion of Sicily, as they fight through more than ten intense all-new maps.  The game features new weapons, character abilities, weather effects and explosions, adding even more realism to the chaotic battlefields. Additionally, Call of Duty:  United Offensive expands on the popular multiplayer experience of Call of Duty, offering new multiplayer maps that set the stage for tank combat, as well as tank-and-foot-soldier combined arms action, providing the ultimate battle of Axis vs. Allies.  Fans will also enjoy three new multiplayer gameplay modes, including Tank Battle, Capture the Flag and Domination - where squads must take control of key locations while preventing enemy troops from advancing. [Activision]… Expand"}, {"name": "Odin Sphere Leifthrasir", "details_link": "https://www.metacritic.com/game/playstation-4/odin-sphere-leifthrasir", "publisher": "Atlus", "release_date": "Jun  7 2016", "developers": ["Vanillaware"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/523651ab22e06912cabf570006596fcc-98.jpg", "descriptions": "The tale of Armageddon is about to be told... In the world of Erion, the magical kingdom of Valentine held an enormous power. The \"Cauldron\" -- the source of this great power-- Maintained the kingdom's prosperity. However, Valentine suffered a sudden, mysterious downfall. And soThe tale of Armageddon is about to be told... In the world of Erion, the magical kingdom of Valentine held an enormous power. The \"Cauldron\" -- the source of this great power-- Maintained the kingdom's prosperity. However, Valentine suffered a sudden, mysterious downfall. And so the neighboring kingdoms clashed over the now-masterless Cauldron.… Expand"}, {"name": "Theatrhythm Final Bar Line", "details_link": "https://www.metacritic.com/game/playstation-4/theatrhythm-final-bar-line", "publisher": "Square Enix", "release_date": "Feb 16 2023", "developers": ["indieszero"], "platforms": ["Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 87, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/e85e12ee4a371f34a164ac0f4c4940c8-98.jpg", "descriptions": "A rhythm action game packed with 385 carefully selected music tracks from across the whole FINAL FANTASY series.\r ♪ The music of FINAL FANTASY comes together here\r\nIncludes popular tracks from a total of 46 different games, featuring the latest music from FFI through to FFXV in the mainA rhythm action game packed with 385 carefully selected music tracks from across the whole FINAL FANTASY series.\r ♪ The music of FINAL FANTASY comes together here\rIncludes popular tracks from a total of 46 different games, featuring the latest music from FFI through to FFXV in the main series, as well as remakes, spin-offs and various different soundtrack CDs.\rRelive the thrilling battles and soaring emotions alongside beautiful music and video.\r ♪ Throw yourself into the rhythm\rPush the buttons in time with the music to match triggers moving across the screen on 3 different types of stage. With easy to learn controls and four different difficulty settings, anyone can jump in and have fun straight away.\rAlso supports controller sharing play using a Joy-Con™ controller.\r ♪ Online multiplayer for up to 8 players\rIntroducing riotous online Multi Battles where everyone plays together! Interfere with the other players plans and make clever use of your Burst abilities to turn the tables and grasp victory.\rDon’t forget to exchange ProfiCards once the battle is over!\r ♪Put together the party of your dreams with a total of 104 characters to choose from.\rMeet cute versions of many classic characters and monsters from the series as exciting RPG battles play out alongside the rhythm action. Gather and power up your team to beat the next stage.… Expand"}, {"name": "Wipeout HD", "details_link": "https://www.metacritic.com/game/playstation-3/wipeout-hd", "publisher": "SCEA", "release_date": "Sep 25 2008", "developers": ["Studio Liverpool"], "platforms": "PlayStation 3", "num_players": "8  Online", "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 87, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/25539f485e1f8dddd15720c4fe484374-98.jpg", "descriptions": "[Playstation Network]  Get ready to race at blazing speeds and experience adrenaline-filled, anti-gravity racing action in full-1080p High Definition running at60-frames-per-second on PS3. Featuring a selection of the best tracks taken from previous versions of the wipEout franchise, wipEout[Playstation Network]  Get ready to race at blazing speeds and experience adrenaline-filled, anti-gravity racing action in full-1080p High Definition running at60-frames-per-second on PS3. Featuring a selection of the best tracks taken from previous versions of the wipEout franchise, wipEout HD offers meticulously crafted and fully reworked tracks that showcase the processing power of PS3. And for the first time, players have the option to navigate their ships utilizing the SIXAXIS wireless controller’s motion sensing technology. Also new to the series, wipEout HD supports two-player split-screen racing offline so players can race with others in the same room. Additionally, players can take on the best competition from around the world in online multiplayer modes as up to eight players are able to compete against each other in a range of online races. Furthermore, wipEout HD includes trophy support on PS3, giving players the opportunity for further bragging rights. And to keep the adrenaline flowing, wipEout HD includes nine tracks from wipEout Pulse soundtrack, all remixed in 5.1 Dolby surround, including artists like Kraftwerk, Booka Shade and Noisia.  wipEout HD also supports custom soundtracks so players can race while listening to their own music collection stored on the PS3’s built-in hard drive. Featuring 12 racing teams, eight reversible tracks and five game modes, wipEout HD is aavailable exclusively for download on Playstation Store. [SCEA]… Expand"}, {"name": "Grindstone", "details_link": "https://www.metacritic.com/game/switch/grindstone", "publisher": "Capy Games", "release_date": "Dec 15 2020", "developers": ["Capy Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General", "Matching"], "meta_score": 87, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/2f79c6e6a7d8f622bd31c2032c2e1438-98.jpg", "descriptions": "Smash creeps to get huge combos and earn precious Grindstones in CAPY’s hit puzzle-battler. Cash in your grindstones to craft new gear and overcome devious enemies, obstacles, and boss encounters as you conquer Grindstone Mountain’s 200+ levels, and prove your prowess on the daily mode’sSmash creeps to get huge combos and earn precious Grindstones in CAPY’s hit puzzle-battler. Cash in your grindstones to craft new gear and overcome devious enemies, obstacles, and boss encounters as you conquer Grindstone Mountain’s 200+ levels, and prove your prowess on the daily mode’s leaderboards.\r Features:\r - Brutal Puzzle-Battle Action\r- 200+ Levels to conquer\r- Daily Challenges w/Leaderboards\r- Dozens of Weapons & Gear to Unlock\r- Award-Winning Soundtrack by Sam Webster… Expand"}, {"name": "Huntdown", "details_link": "https://www.metacritic.com/game/xbox-one/huntdown", "publisher": "Coffee Stain Studios", "release_date": "May 12 2020", "developers": ["Coffee Stain Studios", "Easy Trigger Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "2 ", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 87, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/83ffaa5681c54e95e7bdd9fcb2bad430-98.jpg", "descriptions": "Challenge yourselves in this hard-boiled co-op arcade shooter! Run, jump, and take cover in the mayhem-filled streets of the future. Kill the henchmen, take their guns, and Huntdown the leaders! Collect the bounty, level by level, and make a healthy living by making living unhealthy."}, {"name": "Divinity: Original Sin", "details_link": "https://www.metacritic.com/game/pc/divinity-original-sin", "publisher": "Larian Studios Games", "release_date": "Jan 17 2014", "developers": ["Larian Studios Games"], "platforms": "PC", "num_players": "2 ", "genres": ["Action RPG", "Role-Playing", "Action RPG", "Western-Style"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/5b2cc7043d5a7a30a26cdbc7decf663d-98.jpg", "descriptions": "Gather your party and get ready for a new, back-to-the-roots RPG adventure. Discuss your decisions with companions; fight foes in turn-based combat; explore an open world and interact with everything and everyone you see. Join up with a friend to play online in co-op and make your ownGather your party and get ready for a new, back-to-the-roots RPG adventure. Discuss your decisions with companions; fight foes in turn-based combat; explore an open world and interact with everything and everyone you see. Join up with a friend to play online in co-op and make your own adventures with the powerful RPG toolkit.… Expand"}, {"name": "Unavowed", "details_link": "https://www.metacritic.com/game/pc/unavowed", "publisher": "Wadjet Eye Games", "release_date": "Aug  8 2018", "developers": ["Wadjet Eye Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/1718925cfa4182cbdf0f85a0b00630e6-98.jpg", "descriptions": "A demon has possessed you and used your body to tear a swath of bloodshed through New York. You are now free, but life as you knew it is over. Your only path forward is joining the Unavowed - an ancient society dedicated to stopping evil. No matter what the cost."}, {"name": "Marvel's Spider-Man Remastered", "details_link": "https://www.metacritic.com/game/pc/marvels-spider-man-remastered", "publisher": "PlayStation Studios", "release_date": "Aug 12 2022", "developers": ["Nixxes Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 87, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/76424286902489f4d9639ac9b735c2b2-98.jpg", "descriptions": "Developed by my Insomniac Games teammates in collaboration with Marvel, Marvel's Spider-Man Remastered introduces you to an experienced Peter Parker who's fighting big crime and iconic villains in Marvel's New York. At the same time, he's struggling to balance his chaotic personal life andDeveloped by my Insomniac Games teammates in collaboration with Marvel, Marvel's Spider-Man Remastered introduces you to an experienced Peter Parker who's fighting big crime and iconic villains in Marvel's New York. At the same time, he's struggling to balance his chaotic personal life and career while the fate of Marvel's New York rests upon his shoulders.\r Marvel's Spider-Man Remastered on PC will include the full main story and its continued narrative in Marvel's Spider-Man: The City That Never Sleeps DLC, which features three accompanying story chapters in Peter Parker's journey along with additional missions and challenges for players to discover.… Expand"}, {"name": "Company of Heroes: Opposing Fronts", "details_link": "https://www.metacritic.com/game/pc/company-of-heroes-opposing-fronts", "publisher": "THQ", "release_date": "Sep 24 2007", "developers": ["Relic", "Relic Entertainment"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/7175282d2a9247b4d3604648759ba68b-98.jpg", "descriptions": "Company of Heroes: Opposing Fronts, the next chapter in the real-time strategy franchise from Relic Entertainment is powered by an upgraded version of Relic's proprietary Essence Engine with full Microsoft DirectX 10 support. Opposing Fronts features two unique armies with full lengthCompany of Heroes: Opposing Fronts, the next chapter in the real-time strategy franchise from Relic Entertainment is powered by an upgraded version of Relic's proprietary Essence Engine with full Microsoft DirectX 10 support. Opposing Fronts features two unique armies with full length campaigns. Players can fight as the tenacious British 2nd Army during the heroic World War II liberation of Caen, France, or command the German Panzer Elite as they struggle to repel the might of Operation Market Garden, the  largest airborne invasion in history. Players can battle online in exciting new multiplayer modes with these two all-new armies and utilize full compatibility with the original Company of Heroes for a total of four playable armies. [THQ]… Expand"}, {"name": "3D Out Run", "details_link": "https://www.metacritic.com/game/3ds/3d-out-run", "publisher": "Sega", "release_date": "Mar 12 2015", "developers": ["M2"], "platforms": ["Switch", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Automobile"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/d6f7d67fab565b5fc38b2b5aa34d1057-98.jpg", "descriptions": "The re-mastered version includes all of Out Run’s original content alongside two new songs, and runs at 60 frames per second which is twice the speed of the original game. 3D Out Run also features a built in Stage Select option that allows players to save and resume progress mid-game, hasThe re-mastered version includes all of Out Run’s original content alongside two new songs, and runs at 60 frames per second which is twice the speed of the original game. 3D Out Run also features a built in Stage Select option that allows players to save and resume progress mid-game, has adjustable difficulty settings, and includes unlockable car customization options that allow you to equip parts to improve your car. Additionally, players are able to choose from a number of real-life arcade cabinets wherein everything from the appearance to the environmental sounds of the specific cabinet.… Expand"}, {"name": "Katamari Damacy REROLL", "details_link": "https://www.metacritic.com/game/switch/katamari-damacy-reroll", "publisher": "Bandai Namco Games", "release_date": "Dec  7 2018", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/d59cecfc1c20f4ff094c45450c2d2339-98.jpg", "descriptions": "The stop-at-nothing pushing prince is back and ready to reroll. When the King of All Cosmos accidentally destroys all the stars in the sky, he orders you, his pint-sized princely son, to put the twinkle back in the heavens above. Join the King and Prince of Cosmos on their wacky adventure toThe stop-at-nothing pushing prince is back and ready to reroll. When the King of All Cosmos accidentally destroys all the stars in the sky, he orders you, his pint-sized princely son, to put the twinkle back in the heavens above. Join the King and Prince of Cosmos on their wacky adventure to restore the stars at home or on the go – now in full HD.… Expand"}, {"name": "Destiny 2", "details_link": "https://www.metacritic.com/game/xbox-one/destiny-2", "publisher": "Activision", "release_date": "Sep  6 2017", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/545393e533fe4ec4c665ef5f17e10272-98.jpg", "descriptions": "In Destiny 2, the last safe city on Earth has fallen and lays in ruins, occupied by a powerful new enemy and his elite army, the Red Legion. Every player creates his own character called a “Guardian,” humanity’s chosen protectors.  As a Guardian in Destiny 2, players must master newIn Destiny 2, the last safe city on Earth has fallen and lays in ruins, occupied by a powerful new enemy and his elite army, the Red Legion. Every player creates his own character called a “Guardian,” humanity’s chosen protectors.  As a Guardian in Destiny 2, players must master new abilities and weapons to reunite the city’s forces, stand together and fight back to reclaim their home. In Destiny 2 players embark on a fresh story filled with new destinations around our solar system to explore, and an expansive amount of activities to discover.  There is something for almost every type of gamer in Destiny 2, including gameplay for solo, cooperative and competitive players set within a vast, evolving and exciting universe. [Bungie]… Expand"}, {"name": "Bit.Trip Presents...Runner2: Future Legend of Rhythm Alien", "details_link": "https://www.metacritic.com/game/xbox-360/bittrip-presentsrunner2-future-legend-of-rhythm-alien", "publisher": "Aksys Games", "release_date": "Feb 27 2013", "developers": ["Gaijin Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/506516c8585cc0987e518d4ae5b520cd-98.jpg", "descriptions": "Runner 2 - Future Legend of Rhythm Alien is inspired by the Bit.Trip series originally released on Nintendo platforms."}, {"name": "Owlboy", "details_link": "https://www.metacritic.com/game/switch/owlboy", "publisher": "D-Pad Studio", "release_date": "Feb 13 2018", "developers": ["BlitWorks"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/82102b7e0667aba6f1a5a068f3898053-98.jpg", "descriptions": "Owlboy is a vertical platform adventure set in the sky, where the islands of the world have been spread apart after a great calamity. You play as Otus, among the last of the Owls, a renowned race that has produced many of the world's great wonders"}, {"name": "Dead Space", "details_link": "https://www.metacritic.com/game/pc/dead-space", "publisher": "Electronic Arts", "release_date": "Jan 27 2023", "developers": ["Electronic Arts", "Motive Studios"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/f17a47eb53585a8ba40aa6b862c46851-98.jpg", "descriptions": "Developed exclusively for next generation consoles and PC, raising the level of horror and immersion to unprecedented heights for the franchise through stunning visuals, audio and controls powered by the Frostbite game engine. Fans will experience an improved story, characters, gameplayDeveloped exclusively for next generation consoles and PC, raising the level of horror and immersion to unprecedented heights for the franchise through stunning visuals, audio and controls powered by the Frostbite game engine. Fans will experience an improved story, characters, gameplay mechanics and more as they fight to survive a living nightmare aboard the desolate mining starship, the USG Ishimura, all while uncovering the dreadful mystery of what happened to the slaughtered crew and ship. \r\rIn Dead Space, Isaac Clarke is an everyman engineer on a mission to repair a vast, sprawling starship, the USG Ishimura, only to discover something has gone horribly wrong. The ship's crew has been slaughtered and infected by some alien scourge...and Isaac's beloved partner, Nicole, is lost somewhere on board. Now Isaac is alone with only his tools and engineering skills as he attempts to uncover the nightmarish mystery of what happened aboard the Ishimura. Trapped with hostile creatures called \"necromorphs\", Isaac faces a battle for survival, not only against the escalating terrors of the ship, but his own crumbling sanity.… Expand"}, {"name": "Psychonauts", "details_link": "https://www.metacritic.com/game/pc/psychonauts", "publisher": "Majesco Games", "release_date": "Apr 19 2005", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 2", "PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 87, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/9269b1a85a7c3b4227a29c939cb1fffe-98.jpg", "descriptions": "Psychonauts is a wildly surreal action adventure game where personal paranormal powers are unlocked in order to plunge into the minds of bizarre characters. Journey deep into these crazy worlds of infinite possibility to thwart the secret plan of an evil madman and realize the ultimate dreamPsychonauts is a wildly surreal action adventure game where personal paranormal powers are unlocked in order to plunge into the minds of bizarre characters. Journey deep into these crazy worlds of infinite possibility to thwart the secret plan of an evil madman and realize the ultimate dream of joining an elite force of psychic superheroes, the Psychonauts. Delve into people's minds as Raz, a powerful young cadet at psychic summer camp. While working on his levitation merit badge, Raz discovers that someone is kidnapping psychic children and stealing their brains. In order to foil this evil plot and earn the title of Psychonaut, Raz must project himself into the minds of one bizarre character after another to battle their nightmares and mental demons. He does all this while continuing to earn his psychic merit badges in Telekinesis, Clairvoyance, Pyrokinesis and more.… Expand"}, {"name": "DiRT 2", "details_link": "https://www.metacritic.com/game/xbox-360/dirt-2", "publisher": "Codemasters", "release_date": "Sep  8 2009", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/54d1322a3ce2e492dd198643d698d597-98.jpg", "descriptions": "(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking players on an exhilarating World Tour, DiRT 2 delivers over 100 stunning events, including aggressive, multi-vehicle races and intense solo challenges, set in the most diverse and demanding real-world environments. From the muddy tracks of the Malaysian rainforest to spectator-packed stadiums in London and Los Angeles, racers compete in contemporary off-road race disciplines covering Rallycross, Trailblazer, Raid, Landrush, and Rally. Embracing the culture and new heroes of modern off-road racing, DiRT 2 features an exciting line-up of the best new rally drivers - including the multi medal-winning Subaru Rally Team USA driver Ken Block alongside Travis Pastrana, Dave Mirra, and Tanner Faust, who help players build their racing career. [Codemasters]… Expand"}, {"name": "Gears of War", "details_link": "https://www.metacritic.com/game/pc/gears-of-war", "publisher": "Microsoft Game Studios", "release_date": "Nov  6 2007", "developers": ["Epic Games"], "platforms": ["Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 87, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/0b15286b1436ad8366db0b36f92ffb24-98.jpg", "descriptions": "Gears of War thrusts gamers into a deep and harrowing story of humankind’s epic battle for survival against the Locust Horde, a nightmarish race of creatures that surface from the bowels of the planet. With Gears of War, Epic returns gamers to the massively scoped worlds, memorableGears of War thrusts gamers into a deep and harrowing story of humankind’s epic battle for survival against the Locust Horde, a nightmarish race of creatures that surface from the bowels of the planet. With Gears of War, Epic returns gamers to the massively scoped worlds, memorable characters, co-operative gameplay, and hyper-realistic combat that gamers have come to expect from the franchise, plus a few new surprises. Gears of War features locations that are unique to the franchise and the genre. Players encounter all of their favorite foes from the Xbox 360 version; however, these intense encounters take place in some new environments and allow players to manipulate the new game modes and technology found only in a Games for Windows title. Boasting three new multiplayer maps, a new multiplayer game type, game editor, five new campaign chapters, and DirectX 10support, Gears of War, challenges and pushes the limits of the PC gaming experience and provide an unparalleled visual presentation. [Microsoft]… Expand"}, {"name": "Rayman Origins", "details_link": "https://www.metacritic.com/game/xbox-360/rayman-origins", "publisher": "Ubisoft", "release_date": "Nov 15 2011", "developers": ["UBlart Montpellier"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Action Adventure", "Adventure", "General", "Platformer", "Fantasy", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/3f5377e9106a8436f9cd459955ebe838-98.jpg", "descriptions": "Rayman's new adventure is a two-dimensional cooperative platformer with a colorful, whimsical art style."}, {"name": "Sin & Punishment: Star Successor", "details_link": "https://www.metacritic.com/game/wii/sin-punishment-star-successor", "publisher": "Nintendo", "release_date": "Jun 27 2010", "developers": ["Treasure"], "platforms": "Wii", "genres": ["Action", "General", "Shooter", "Shooter", "Rail", "Rail"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/5815163aa243c45c0443470c021d277e-98.jpg", "descriptions": "Players engage in nonstop shooter action as they're propelled through this on-rails game. Isa and Kachi are being hunted. They go on the run and on the defensive. And they shoot everything. Sin & Punishment 2 is the long-awaited sequel to the Japanese Nintendo 64 cult-classic shooter. ItPlayers engage in nonstop shooter action as they're propelled through this on-rails game. Isa and Kachi are being hunted. They go on the run and on the defensive. And they shoot everything. Sin & Punishment 2 is the long-awaited sequel to the Japanese Nintendo 64 cult-classic shooter. It brings a frantic arcade sensibility to a post-apocalyptic world. Players can run on foot or take to the skies with a jetpack or hovering skateboard-like device to dodge enemy attacks or get a better lock on their targets. Players can fire at targets in the distance or switch to sword attacks for close-range targets. The Wii Remote controller's pointing ability is used to aim weapons, while the Nunchuk controller is used for positioning and maneuvering. Numerous beautifully rendered settings include gorgeous cityscapes and dramatic underwater tunnels, all populated by fierce enemies. It's all about the multiplier. The better a player's skills, the more points are earned, and the bigger the bonus. Players will want to play the game again and again to beat their personal best on each level. The better the performance, the bigger the multiplier and the higher the final score. [Nintendo]… Expand"}, {"name": "Forza Horizon 3: Blizzard Mountain", "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-3-blizzard-mountain", "publisher": "Microsoft Game Studios", "release_date": "Dec 13 2016", "developers": ["Playground Games"], "platforms": ["PC", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/759eaf614f3940479acbd71e51a6f425-98.jpg", "descriptions": "Blizzard Mountain invites players to the snowy elevations of a brand new playable area of Forza Horizon 3’s Australia. This is a place where speedy vehicles are welcome, ice and blizzard conditions are the norm, and snow tires are heartily recommended."}, {"name": "Out of the Park Baseball 4", "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-4", "publisher": "Out Of The Park Developments", "release_date": "Feb 28 2002", "developers": ["Out Of The Park Developments"], "platforms": "PC", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 87, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/105455c29437cc192835632fdc5dc01c-98.jpg", "descriptions": "A comprehensive baseball simulation that offers multiple play options, a career mode, an exhaustive financial model, an open-ended design allowing you to completely customize your gaming experience, and much more.  Try to build a dynasty with your favorite team through trading, acquiringA comprehensive baseball simulation that offers multiple play options, a career mode, an exhaustive financial model, an open-ended design allowing you to completely customize your gaming experience, and much more.  Try to build a dynasty with your favorite team through trading, acquiring free agents and making good selections in the amateur draft.  Play consecutive seasons and follow the careers of your players as they develop, age and retire.  Or, use Out of the Park Baseball's connectivity with The Baseball Archive to create your own \"season disks,\" and replay any single season in baseball history. You can even combine history and fantasy by creating a new career league that starts with a historical season from baseball's past, and moves forward through a future that you shape! [Out of the Park Developments]… Expand"}, {"name": "Super Monkey Ball", "details_link": "https://www.metacritic.com/game/gamecube/super-monkey-ball", "publisher": "Sega", "release_date": "Nov 17 2001", "developers": ["Amusement Vision"], "platforms": ["iPhone/iPad", "GameCube"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/6859480d7ced907caa5e1f7aabdbbb51-98.jpg", "descriptions": "Call your friends and warn your neighbors, it's time to have a ball! Go bananas with 90+ stages, multi-player madness, and 7 cool ways to play! Equal parts \"party\" and \"game\", Super Monkey Ball could be the most \"well-rounded\" game you've ever played!"}, {"name": "Tales of Arise", "details_link": "https://www.metacritic.com/game/xbox-series-x/tales-of-arise", "publisher": "Bandai Namco Games", "release_date": "Sep 10 2021", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/221234f813869f890fef694fe1b16ad1-98.jpg", "descriptions": "Challenge the Fate That Binds YouOn the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled overChallenge the Fate That Binds YouOn the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled over Dahna, pillaging the planet of its resources and stripping people of their dignity and freedom.Our tale begins with two people, born on different worlds, each looking to change their fate and create a new future. Featuring a new cast of characters, updated combat, and classic Tales of gameplay mechanics, experience the next chapter in the world-famous Tale of series, Tales of Arise.The Next ChapterExperience the next chapter in the Tales of series, brought to life in stunning HD powered by Unreal Engine 4Dynamic ActionDynamic Action RPG featuring an updated battle system that retains classic Tales of gameplayA New Tale AwaitsRich story featuring a vibrant world and new cast of charactersStunning VisualsHigh quality animation created by Ufotable… Expand"}, {"name": "Velocity", "details_link": "https://www.metacritic.com/game/psp/velocity", "publisher": "FuturLab", "release_date": "May  1 2012", "developers": ["FuturLab"], "platforms": "PSP", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 87, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/19d87c74b9d7794c33af7778c4bcef5a-98.jpg", "descriptions": "In 2212 the distant star Vilio exploded into a red giant, sending an electromagnetic pulse surging into our deep space mining ships, colony cruisers and Special Forces fighters, knocking out their primary power. Now the star is beginning to collapse into a black hole, pulling our strandedIn 2212 the distant star Vilio exploded into a red giant, sending an electromagnetic pulse surging into our deep space mining ships, colony cruisers and Special Forces fighters, knocking out their primary power. Now the star is beginning to collapse into a black hole, pulling our stranded fleets to their doom! To make things worse, our warring neighbors have seen reward in our misfortune and have deployed scavengers to prey upon our people. Only one craft is capable of a rescue mission, the Quarp Jet - a spacecraft capable of teleportation. Take control of the world's first quantum teleport craft in this innovative shooter, using a range of teleport controls to outsmart enemies, solve action based puzzles and rescue helpless survivors from their deep space hideaways! You must hurry; the black hole isn't getting any smaller... [FuturLab]… Expand"}, {"name": "Persona 3 Portable", "details_link": "https://www.metacritic.com/game/xbox-series-x/persona-3-portable", "publisher": "Sega", "release_date": "Jan 19 2023", "developers": ["Atlus"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 87, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/53542c6f31f264d92e49dab43a011c41-98.jpg", "descriptions": "Terrible creatures lurk in the dark, preying on those who wander into the hidden hour between one day and the next.  As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom.  Will you live to see the light of day?"}, {"name": "Teenage Mutant Ninja Turtles: Shredder's Revenge", "details_link": "https://www.metacritic.com/game/xbox-one/teenage-mutant-ninja-turtles-shredders-revenge", "publisher": "DotEmu", "release_date": "Jun 16 2022", "developers": ["Tribute Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/04ff938dec8167e692ca42352649a8e4-98.jpg", "descriptions": "With Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and ConeyWith Bebop and Rocksteady assaulting Channel 6 and stealing super gnarly devices to support Krang and Shredder's latest twisted plan, Teenage Mutant Ninja Turtles: Shredder's Revenge sees the Turtles battling across a righteous range of timeless TMNT locations. From Manhattan and Coney Island, to city rooftops and dank sewers, help the fearsome foursome trounce Foot Soldiers, Triceraton Warriors, and Rock Troops all the way to Dimension X! \r\rEnjoy stunning full-color pixel art graphics and a vintage TMNT vibe that will rock you straight back to the awesome 80s. Every character, vehicle, weapon, item, and background is directly inspired by the 1987 TV show, making you feel like you hopped into the television -- with a dope mix of killer humor and action-packed adventures!… Expand"}, {"name": "Chicory: A Colorful Tale", "details_link": "https://www.metacritic.com/game/playstation-5/chicory-a-colorful-tale", "publisher": "Finji", "release_date": "Jun 10 2021", "developers": ["Greg Lobanov"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 87, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/e0c8b190d32f19b9ba34ab39b8e6dff5-98.jpg", "descriptions": "A Painting Adventure: You're a dog wielding a magic paintbrush! Use the power of art to explore, solve puzzles, help your animal friends and restore color to the world in this top-down adventure game. \r\rExplore the Picnic Province, and draw on anything!\r  Manipulate the environmentA Painting Adventure: You're a dog wielding a magic paintbrush! Use the power of art to explore, solve puzzles, help your animal friends and restore color to the world in this top-down adventure game. \r\rExplore the Picnic Province, and draw on anything!\r  Manipulate the environment with your paint and solve puzzles!\r  Unlock new paint abilities and use them to reach new places!\r  Local co-op! Play with your friends and paint together!\r Along the way you'll meet many characters and make friends.\r Collect clothes, furniture and brush styles to unleash your creativity and dress yourself and the world as you see fit! … Expand"}, {"name": "Monster Hunter: World - Iceborne", "details_link": "https://www.metacritic.com/game/pc/monster-hunter-world---iceborne", "publisher": "Capcom", "release_date": "Jan  9 2020", "developers": ["Capcom"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/ea4380a9dcf9d5d6b2c185c575bf0adc-98.jpg", "descriptions": "Monster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivalsMonster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivals the gameplay volume from the original release and features a new icy setting, storyline, monsters, gameplay options, and more.\r The game's all-new story picks up after Monster Hunter: World and whisks hunters away to the newly discovered chilly locale that, once fully explored, becomes the largest region in World so far. The new locale is home to several new and returning monsters ready to challenge hunters throughout their expeditions and raises the stakes with the added higher difficulty Master Rank. Iceborne continues the skill-based progression and robust crafting system found in World and expands that with several new gameplay features that broaden the player's combat repertoire. All this leads to the ultimate hunter test against the mysterious new flagship monster, Velkhana.… Expand"}, {"name": "F1 2019", "details_link": "https://www.metacritic.com/game/pc/f1-2019", "publisher": "Codemasters", "release_date": "Jun 27 2019", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/e7c5cd94a918286c06c968129b344443-98.jpg", "descriptions": "The official videogame of the 2019 FIA Formula One World Championship, F1 2019 challenges you to Defeat your Rivals in the most ambitious F1 game in Codemasters' history. The game is released a full two months earlier during the Formula 1 myWorld Grosser Preis von Osterreich 2019 weekendThe official videogame of the 2019 FIA Formula One World Championship, F1 2019 challenges you to Defeat your Rivals in the most ambitious F1 game in Codemasters' history. The game is released a full two months earlier during the Formula 1 myWorld Grosser Preis von Osterreich 2019 weekend and, unlike previous iterations, ahead of the British, German and Hungarian races.F1 2019 features all the official teams, drivers and all 21 circuits from the 2019 season. This year sees the inclusion of F2 with players being able to complete the 2018 season with the likes of George Russell, Lando Norris and Alexander Albon. The 2019 F2 season content will be made available as a free digital update during the season.Having established itself as one of the highest rated racing franchises of all time, F1 2019 builds on the success of previous iterations and delivers an experience that rivals the quality and production values of its real-life race counterpart. With greater emphasis on graphical fidelity, the environments have been significantly enhanced, and the tracks come to life like never before. Night races have been completely overhauled creating vastly improved levels of realism and the upgraded F1 broadcast sound and visuals add further realism to all aspects of the race weekend.… Expand"}, {"name": "Pinball FX 2: Star Wars Pinball", "details_link": "https://www.metacritic.com/game/xbox-360/pinball-fx-2-star-wars-pinball", "publisher": "Microsoft Game Studios", "release_date": "Feb 27 2013", "developers": ["Zen Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 87, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/171a0dbbd802df3620047ca77c675eef-98.jpg", "descriptions": "Star Wars: The Clone Wars table embraces the artistic style and energy of the series and is a perfect fit for a high energy pinball table. The unique art, momentous light saber battles, and fast-moving action that makes the series so enjoyable translates naturally into an amazing pinballStar Wars: The Clone Wars table embraces the artistic style and energy of the series and is a perfect fit for a high energy pinball table. The unique art, momentous light saber battles, and fast-moving action that makes the series so enjoyable translates naturally into an amazing pinball experience. Set between the events of the Star Wars Episode II: Attack of the Clones and Star Wars Episode III: Revenge of the Sith, the Star Wars: The Clone Wars pinball table features Anakin Skywalker and his apprentice, Ahsoka Tano, both represented as 3D characters, as well as Asajj Ventress, Savage Opress and battle Droids. The table would not be complete without a Republic attack gunship, which is especially spectacular when the table is played in 3D. To start the main table missions, light the lamps on the center of the playfield that spell out “Citadel” by shooting the left and right ramps on the table. After spelling the words, the ramp’s right front side will lower, providing a path to the hole to activate the main missions. [Zen Studios]… Expand"}, {"name": "Spelunky", "details_link": "https://www.metacritic.com/game/xbox-360/spelunky", "publisher": "Microsoft Game Studios", "release_date": "Jul  4 2012", "developers": ["Mossmouth"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 87, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/789bafb94bf99500c8f2797a83c9bca5-98.jpg", "descriptions": "Spelunky is a platformer with randomized levels that offer a unique and challenging experience each time you engage it. Journey deep underground and explore fantastic places filled with monsters, traps, and treasure. Fully-destructible environments open up an array of strategies and make itSpelunky is a platformer with randomized levels that offer a unique and challenging experience each time you engage it. Journey deep underground and explore fantastic places filled with monsters, traps, and treasure. Fully-destructible environments open up an array of strategies and make it a blast to master the game's many secrets.… Expand"}, {"name": "Dark Souls II: Scholar of the First Sin", "details_link": "https://www.metacritic.com/game/playstation-4/dark-souls-ii-scholar-of-the-first-sin", "publisher": "Bandai Namco Games", "release_date": "Apr  7 2015", "developers": ["From Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/2d63bdf59528ea52e257f05547b2885e-98.jpg", "descriptions": "Dark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II ownersDark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II owners will receive a patch to implement these elements): Additional NPCs added for an enhanced story experience. Parameter adjustments for improved game balance. Augmented item descriptions. Improved online matchmaking functionality. [Bandai Namco]… Expand"}, {"name": "Resistance 2", "details_link": "https://www.metacritic.com/game/playstation-3/resistance-2", "publisher": "SCEA", "release_date": "Nov  4 2008", "developers": ["Insomniac Games"], "platforms": "PlayStation 3", "num_players": "Up to 60 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Modern", "Sci-Fi", "Arcade"], "meta_score": 87, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/6b2b9103092fbaf4a37845b763610e65-98.jpg", "descriptions": "After a valiant struggle to stop the Chimera invasion in Europe, mankind must make its last stand on the shores of the United States. Resistance 2 places players in the heroic role of Sgt. Nathan Hale as he struggles against overwhelming odds to defend mankind from the unstoppable Chimera.After a valiant struggle to stop the Chimera invasion in Europe, mankind must make its last stand on the shores of the United States. Resistance 2 places players in the heroic role of Sgt. Nathan Hale as he struggles against overwhelming odds to defend mankind from the unstoppable Chimera. While wrestling with this insidious war machine, Hale must also battle the virus raging inside of his own body that threatens to transform him into the very creatures he fights against. Powered by Insomniac Games' third-generation PS3 technology, Resistance 2 features a stand-alone eight-player, class-based online co-op campaign (up to 8 players) and 60-player online competitive multiplayer. An epic single-player campaign features a new weapons arsenal to combat giant boss encounters that increase the scale of the conflict to new heights. And players enjoy a new level of community support. [SCEA]… Expand"}, {"name": "INSIDE", "details_link": "https://www.metacritic.com/game/pc/inside", "publisher": "PLAYDEAD", "release_date": "Jul  7 2016", "developers": ["PLAYDEAD"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/1ff59ee60637d2081877c5782ad63cc8-98.jpg", "descriptions": "Hunted and alone, a boy finds himself drawn into the center of a dark project."}, {"name": "flower", "details_link": "https://www.metacritic.com/game/playstation-3/flower", "publisher": "SCEA", "release_date": "Feb 12 2009", "developers": ["ThatGameCompany"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "1 Player", "genres": ["Miscellaneous", "General", "General"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/66ba3eac99728f7a12dd3911d561be50-98.jpg", "descriptions": "[Playstation Network]  The pioneers that brought you the award-winning PlayStation Network title \"flOw\" are back with another concept that challenges traditional gaming conventions. Flower expands the team's tradition of delivering simple gameplay, accessible controls and a medium to explore[Playstation Network]  The pioneers that brought you the award-winning PlayStation Network title \"flOw\" are back with another concept that challenges traditional gaming conventions. Flower expands the team's tradition of delivering simple gameplay, accessible controls and a medium to explore emotional chords uncommon in video games. In Flower, the surrounding environment, most often pushed to the background in games, is pulled to the forefront and becomes the primary \"character.\" The player fades from an external and stressful world in the opening of this fresh and genuine game only for PS3, and journeys through beautifully vivid landscapes, changing the his surroundings and exploring nature along the way. Playing as the wind, the player guides and grows a swarm of pedals by interacting with other flowers and the surrounding environment. The goals and journey in each level vary, but all involve flight, exploration and interaction with the level. Using simple SIXAXIS wireless controls, the player guides the lead petal and accumulates a swarm of flower petals as he moves at his own pace within the environment, causing the on-screen world to change. Flower's gameplay offers different experiences, pacing and rhythm to all players. Along the way, the environment will pose challenges to the player’s progress. Both pastoral and at times chaotic, Flower is a visual, audio and interactive escape on PS3. Simple Gameplay Controls - Accessible controls appeal to both the casual and hardcore gamer and offer simplistic and relaxing gaming. Freely playing as the wind is as easy as titling the SIXAXIS wireless controller. Lush and Interactive Environment on PS3 - In Flower, over 200,000 blades of grass are simulated and animated simultaneously on-screen, creating an verdant environment not possible on any other platform. Dynamically Adjusting Experience - Players with differing skill levels and/or moods can intuitively customize their game experience and enjoy the game at their own pace. [SCEA]… Expand"}, {"name": "Europa Universalis IV", "details_link": "https://www.metacritic.com/game/pc/europa-universalis-iv", "publisher": "Paradox Interactive", "release_date": "Aug 13 2013", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/1ff5699e5d531b504a20be9ef6a02b8b-98.jpg", "descriptions": "Europa Universalis IV explores the world history in an experience crafted by Paradox Development Studio, the masters of Grand Strategy. The experiences of true exploration, trade, warfare and diplomacy will be brought to life in this epic title rife with rich strategic and tactical depth."}, {"name": "Diablo III", "details_link": "https://www.metacritic.com/game/xbox-360/diablo-iii", "publisher": "Blizzard Entertainment", "release_date": "Sep  3 2013", "developers": ["Blizzard Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 87, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/f6313f29b1c2693d32e3d0b5a411f518-98.jpg", "descriptions": "20 years have gone by since the Prime Evils were defeated and banished from the world of Sanctuary. Now, you must return to where it all began—the town of Tristram to investigate rumors of a fallen star, for this is an omen that the End Times have begun."}, {"name": "Persona 4 Golden", "details_link": "https://www.metacritic.com/game/pc/persona-4-golden", "publisher": "Sega", "release_date": "Jun 13 2020", "developers": ["Atlus"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 87, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/4/5ceddf3a476d417f4e2aac5e7aa1b4da-98.jpg", "descriptions": "Inaba—a quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden. A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confrontingInaba—a quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden. A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one’s self. Persona 4 Golden promises meaningful bonds and experiences shared together with friends. With an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.… Expand"}, {"name": "Halo Infinite", "details_link": "https://www.metacritic.com/game/xbox-series-x/halo-infinite", "publisher": "Xbox Game Studios", "release_date": "Dec  8 2021", "developers": ["343 Industries"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/2f478401a538d7adb4c9e031b7fd6432-98.jpg", "descriptions": "When all hope is lost and humanity’s fate hangs in the balance, the Master Chief is ready to confront the most ruthless foe he’s ever faced. Begin anew and step inside the armor of humanity’s greatest hero to experience an epic adventure and finally explore the scale of the Halo ring itself."}, {"name": "Velocity 2X", "details_link": "https://www.metacritic.com/game/switch/velocity-2x", "publisher": "FuturLab", "release_date": "Sep 20 2018", "developers": ["FuturLab"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/e1d944936f41d328f4cca921d736941d-98.jpg", "descriptions": "Velocity 2X is the highly anticipated sequel to Velocity Ultra that features amazing puzzle-platforming action alongside award-winning top-down shoot em-up gameplay!\r Engage the Quarp Drive teleport to outsmart the enemy in race-tuned space combat, then dock your ship, jump out and runVelocity 2X is the highly anticipated sequel to Velocity Ultra that features amazing puzzle-platforming action alongside award-winning top-down shoot em-up gameplay!\r Engage the Quarp Drive teleport to outsmart the enemy in race-tuned space combat, then dock your ship, jump out and run around on foot to infiltrate enemy bases. Once youve disabled internal defences, jump back into the Quarp Jet and continue your mission!\r Velocity 2X takes the same approach to great gameplay design that made Velocity Ultra so much fun, and applies it to a puzzle-platforming adventure too, making Velocity 2X twice the twitchy fun!… Expand"}, {"name": "Sonic Mania Plus", "details_link": "https://www.metacritic.com/game/playstation-4/sonic-mania-plus", "publisher": "Sega", "release_date": "Jul 17 2018", "developers": ["Sega"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/2e95365b2c8822f4a88654bef572771e-98.jpg", "descriptions": "Sonic Mania Plus is the definitive retail enhanced version of the original Sonic Mania's digital release, presented in a pristine collectible physical release. The encore pack is a $5 upgrade fee for owners of the original game."}, {"name": "Streets of Rage 4", "details_link": "https://www.metacritic.com/game/switch/streets-of-rage-4", "publisher": "DotEmu", "release_date": "Apr 30 2020", "developers": ["DotEmu", "Seaven Studio", "Guard Crush Games", "Lizardcube"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["General", "Action", "Beat-'Em-Up", "2D"], "meta_score": 87, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/82e9da1e55e311cafa0cad125859e8f1-98.jpg", "descriptions": "Amongst the best beat’em up series ever created, jammin’ ‘90s beats and over the top street beating, the iconic series Streets of Rage comes back with a masterful tribute to and revitalization of the classic action fans adore.\r The all-time classic Streets of Rage, known as Bare KnuckleAmongst the best beat’em up series ever created, jammin’ ‘90s beats and over the top street beating, the iconic series Streets of Rage comes back with a masterful tribute to and revitalization of the classic action fans adore.\r The all-time classic Streets of Rage, known as Bare Knuckle (ベア・ナックル Bea Nakkuru) in Japan, is a beat ‘em up series known for this timeless gameplay and electronic dance influenced music. Streets of Rage 4 builds upon the classic trilogy’s gameplay with new mechanics, beautiful hand-drawn visuals and a God tier soundtrack.\r Team up with iconic and brand-new characters\r Streets of Rage 4 got its iconic characters back: Axel, Blaze, and Adam teaming up with new brother and sister in arms Floyd Iraia and Cherry Hunter. With some brand-new moves and kickass tracks to take a listen, our heroes are ready to dish out beatdowns to a fledgling group of ill-advised criminals in full force.… Expand"}, {"name": "XCOM 2", "details_link": "https://www.metacritic.com/game/xbox-one/xcom-2", "publisher": "2K Games", "release_date": "Sep 27 2016", "developers": ["Firaxis Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/b39da50f15e510d93a69fb62145eca3b-98.jpg", "descriptions": "Earth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future forEarth has changed. Twenty years have passed since world leaders offered an unconditional surrender to alien forces. XCOM, the planet’s last line of defense, was left decimated and scattered. Now, in XCOM 2, the aliens rule Earth, building shining cities that promise a brilliant future for humanity on the surface, while concealing a sinister agenda and eliminating all who dissent from their new order. Only those who live at the edges of the world have a margin of freedom. Here, a force gathers once again to stand up for humanity. Always on the run, and facing impossible odds, the remnant XCOM forces must find a way to ignite a global resistance, and eliminate the alien threat once and for all.… Expand"}, {"name": "Psychonauts 2", "details_link": "https://www.metacritic.com/game/playstation-4/psychonauts-2", "publisher": "Starbreeze", "release_date": "Aug 25 2021", "developers": ["Double Fine Productions"], "platforms": ["PC", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Beat-'Em-Up", "Action", "Action Adventure", "Platformer", "Open-World", "3D"], "meta_score": 87, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/095703471ff4ce7f0e5954773299bdd3-98.jpg", "descriptions": "Razputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, andRazputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, and what's worse, there's a mole hiding in headquarters. Raz must use his powers to stop the mole before they execute their secret plan--to bring the murderous psychic villain, Maligula, back from the dead.… Expand"}, {"name": "Monster Hunter Rise", "details_link": "https://www.metacritic.com/game/xbox-series-x/monster-hunter-rise", "publisher": "Capcom", "release_date": "Jan 20 2023", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/6/3be230a97e5f72e21b3fcbfa0662fc3a-98.jpg", "descriptions": "Rise to the challenge and join the hunt!Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head andRise to the challenge and join the hunt!Set in the ninja-inspired land of Kamura Village, explore lush ecosystems and battle fearsome monsters to become the ultimate hunter. It's been half a century since the last calamity struck, but a terrifying new monster has reared its head and threatens to plunge the land into chaos once again.Hunt solo or in a party with friends to earn rewards that you can use to craft a huge variety of weapons and armor. Brand new gameplay systems such as the high-flying 'Wire Action' and your canine companion 'Palamute' will add exciting new layers to the already robust combat that Monster Hunter is known for.… Expand"}, {"name": "NBA 2K16", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k16", "publisher": "Take-Two Interactive", "release_date": "Sep 25 2015", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Action", "General", "Sports", "Team", "Basketball", "Sim"], "meta_score": 87, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/bfd89f8e33d35b3bc55e12397956d96b-98.jpg", "descriptions": "Be the Story. The NBA 2K franchise is back with a true-to-life NBA experience in NBA 2K16. Guide your MyPLAYER through the complete NBA journey, take control of an entire NBA franchise, or refine your skills online competing against gamers from around the globe. With animations that provideBe the Story. The NBA 2K franchise is back with a true-to-life NBA experience in NBA 2K16. Guide your MyPLAYER through the complete NBA journey, take control of an entire NBA franchise, or refine your skills online competing against gamers from around the globe. With animations that provide smoother movement and more realistic articulation, it promises to be the most authentic NBA gaming experience yet. [2K]\r … Expand"}, {"name": "Pikmin 3", "details_link": "https://www.metacritic.com/game/wii-u/pikmin-3", "publisher": "Nintendo", "release_date": "Aug  4 2013", "developers": ["Nintendo"], "platforms": "Wii U", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/3d403326432b96a6ff35727634de8504-98.jpg", "descriptions": "Pikmin 3 is a reimagined, mass-action strategy title from the critically acclaimed Pikmin series. Players take control of 3 explorers and an array of cute Pikmin in a struggle for survival. By exploiting the unique abilities of these little Pikmin creatures, players solve puzzles, battlePikmin 3 is a reimagined, mass-action strategy title from the critically acclaimed Pikmin series. Players take control of 3 explorers and an array of cute Pikmin in a struggle for survival. By exploiting the unique abilities of these little Pikmin creatures, players solve puzzles, battle dangerous predators and forage for food needed to save the explorers' home planet. … Expand"}, {"name": "Sunless Skies", "details_link": "https://www.metacritic.com/game/pc/sunless-skies", "publisher": "Failbetter Games", "release_date": "Jan 31 2019", "developers": ["Failbetter Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/71bcc5ca783863ba851bed3d9913116b-98.jpg", "descriptions": "SAIL THE STARS. BETRAY YOUR QUEEN. MURDER A SUN. Sunless Skies is a Gothic Horror roleplay game with a focus on exploration and exquisite storytelling for PC, Mac and Linux."}, {"name": "Total War: WARHAMMER II", "details_link": "https://www.metacritic.com/game/pc/total-war-warhammer-ii", "publisher": "Sega", "release_date": "Sep 28 2017", "developers": ["Creative Assembly"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/218db80201f6501e4760872a6adaf5e7-98.jpg", "descriptions": "Prince Tyrion, Defender of Ulthuan, guides the High Elves in their desperate efforts to stabilise the vortex as it roils above their home continent. Atop his palanquin-throne, the Slann Mage-Priest Mazdamundi directs his Lizardmen war-hosts as they surge northward from Lustria. He, too, isPrince Tyrion, Defender of Ulthuan, guides the High Elves in their desperate efforts to stabilise the vortex as it roils above their home continent. Atop his palanquin-throne, the Slann Mage-Priest Mazdamundi directs his Lizardmen war-hosts as they surge northward from Lustria. He, too, is intent on preventing cataclysm, though the methods of The Old Ones must prevail. The Witch King Malekith and his sadistic Dark Elf hordes spew forth from Naggaroth and their labyrinthine Black Arks. He tastes great weakness in the vortex -- and great opportunity in its demise. Meanwhile a fourth, secretive race stirs, their motives obscured by sinister plots and machinations. The time for revelation is nigh... The second in a trilogy and sequel to the award-winning Total War: WARHAMMER, Total War: WARHAMMER II brings players a breathtaking new narrative campaign, set across the vast continents of Lustria, Ulthuan, Naggaroth and the Southlands. The Great Vortex Campaign builds pace to culminate in a definitive and climactic endgame, an experience unlike any other Total War title to date. Playing as one of 8 Legendary Lords across 4 iconic races from the world of Warhammer Fantasy Battles, players must succeed in performing a series of powerful arcane rituals in order to stabilise or disrupt The Great Vortex, while foiling the progress of the other races. Each Legendary Lord has a unique geographical starting position, and each race offers a distinctive new playstyle with unique campaign mechanics, narrative, methods of war, armies, monsters, Lores of Magic, legendary characters, and staggering new battlefield bombardment abilities.… Expand"}, {"name": "NHL 2004", "details_link": "https://www.metacritic.com/game/pc/nhl-2004", "publisher": "EA Sports", "release_date": "Sep 22 2003", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 87, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/9c84033ca72a2eed3897bf91f8fea849-98.jpg", "descriptions": "It's more physical than ever before, with new Bruise Control, an all-new fighting system, more realistic player collisions, and powerful visuals such as popping helmets and breaking glass. Total Control on the Ice: Total player control allows you to direct 2-button touch sensitive passesIt's more physical than ever before, with new Bruise Control, an all-new fighting system, more realistic player collisions, and powerful visuals such as popping helmets and breaking glass. Total Control on the Ice: Total player control allows you to direct 2-button touch sensitive passes anywhere on the ice, call team strategies on the fly, and aggressively tie up opponents against the boards and in front of the net. Go Deep Into Dynasty Mode: Take on the role of GM for up to 20 seasons, drafting and trading players, negotiating contracts, and managing the financial bottom line of your franchise. Earn valuable experience points to upgrade your GM office and/or purchase improvements to staff and facilities, thus improving your team's on ice performance. All-New Elite Leagues: 39 new international teams from Germany's DEL, Sweden's Elitserien, and Finland's SM-Liga. Enhanced EA SPORTS Online: Compete in one-on-one or all-new on-line tournament games, and chat in-game with EA SPORTS Talk. New EA SPORTS Bio: Unlock special rewards in NHL 2004 by playing multiple titles, including Madden NFL 2004, NBA Live 2004, and much more. [Electronic Arts]… Expand"}, {"name": "SSX Tricky", "details_link": "https://www.metacritic.com/game/gamecube/ssx-tricky", "publisher": "EA Sports Big", "release_date": "Dec  2 2001", "developers": ["EA Sports Big"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 87, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/ba7954ed14cba2251bc012bc9594cef9-98.jpg", "descriptions": "SSX Tricky launches you into a world of monster air, intense tracks, and death-defying tricks. Six all-new competitors plus six riders from the original SSX make up the circuit. Compete in the World Circuit, go head-to-head in the Showoff versions of nine courses on the World Circuit, orSSX Tricky launches you into a world of monster air, intense tracks, and death-defying tricks. Six all-new competitors plus six riders from the original SSX make up the circuit. Compete in the World Circuit, go head-to-head in the Showoff versions of nine courses on the World Circuit, or just practice in Free Ride. With all-new Garibaldi and Valdez courses, you'll have plenty of huge cliff drops to catch big air and pull off Uber tricks.… Expand"}, {"name": "Zeus: Master of Olympus", "details_link": "https://www.metacritic.com/game/pc/zeus-master-of-olympus", "publisher": "Sierra Entertainment", "release_date": "Oct 22 2000", "developers": ["Impressions Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General", "Management", "Government"], "meta_score": 87, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/524a46fcbc2ee7ce656969f37113a596-98.jpg", "descriptions": "Recreate your favorite legends from Greek mythology as you build and rule beautiful city-states. Help Hercules defeat the Hydra, Odysseus win the Trojan War, or Jason retrieve the Golden Fleece. You'll make friends in high places, get involved in the affairs of immortals, and even meet ZeusRecreate your favorite legends from Greek mythology as you build and rule beautiful city-states. Help Hercules defeat the Hydra, Odysseus win the Trojan War, or Jason retrieve the Golden Fleece. You'll make friends in high places, get involved in the affairs of immortals, and even meet Zeus himself.  [Sierra Studios]… Expand"}, {"name": "Driver", "details_link": "https://www.metacritic.com/game/playstation/driver", "publisher": "GT Interactive", "release_date": "Jun 30 1999", "developers": ["Reflections Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/e7b3762823c2141b66da004a0dcd0e13-98.jpg", "descriptions": "In Driver, you are the wheelman in a series of Hollywood-style car-chases.  A great getaway driver is only as good as his equipment, which is why Driver has a selection of performance-packed muscle cars, complete with realistic handling, damage modeling, and real-world physics reactions.In Driver, you are the wheelman in a series of Hollywood-style car-chases.  A great getaway driver is only as good as his equipment, which is why Driver has a selection of performance-packed muscle cars, complete with realistic handling, damage modeling, and real-world physics reactions.  Driver also comes fully equipped with a replay/director mode that gives you all the necessary tools to \"film\" their own car chase and multiple views that allow you to look around when you're driving.  Put the pedal to the metal and be the best driver around.… Expand"}, {"name": "Tales of Arise", "details_link": "https://www.metacritic.com/game/playstation-5/tales-of-arise", "publisher": "Bandai Namco Games", "release_date": "Sep 10 2021", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/2f626a690293f8e2c59865c7cb7e337b-98.jpg", "descriptions": "Challenge the Fate That Binds You. On the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled overChallenge the Fate That Binds You. On the planet Dahna, reverence has always been given to Rena, the planet in the sky, as a land of the righteous and divine. Stories handed down for generations became truth and masked reality for the people of Dahna. For 300 years, Rena has ruled over Dahna, pillaging the planet of its resources and stripping people of their dignity and freedom.\r Our tale begins with two people, born on different worlds, each looking to change their fate and create a new future. Featuring a new cast of characters, updated combat, and classic Tales of gameplay mechanics, experience the next chapter in the world-famous Tale of series, Tales of Arise.\r The Next Chapter\rExperience the next chapter in the Tales of series, brought to life in stunning HD powered by Unreal Engine 4\r Dynamic Action\rDynamic Action RPG featuring an updated battle system that retains classic Tales of gameplay\r A New Tale Awaits\rRich story featuring a vibrant world and new cast of characters\r Stunning Visuals\rHigh quality animation created by Ufotable… Expand"}, {"name": "Spelunky 2", "details_link": "https://www.metacritic.com/game/playstation-4/spelunky-2", "publisher": "Mossmouth", "release_date": "Sep 15 2020", "developers": ["Mossmouth", "Bitworks"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/d031b7ec2b9f27297bd7d55bccc8e841-98.jpg", "descriptions": "Spelunky 2 builds upon the unique, randomized challenges that made the original a roguelike classic, offering a huge adventure designed to satisfy players old and new. Meet the next generation of explorers as they find themselves on the Moon, searching for treasure and missing family."}, {"name": "Fight Night Round 2", "details_link": "https://www.metacritic.com/game/gamecube/fight-night-round-2", "publisher": "EA Sports", "release_date": "Feb 28 2005", "developers": ["EA Sports"], "platforms": "GameCube", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 87, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/f9863c50ee90061e95004cb48769d543-98.jpg", "descriptions": "The sequel to EA Sports' Fight Night 2004 maintains the original's analog control scheme and introduces a variety of new features. Now you have access to even more punches, including a new \"haymaker\" punch that is just powerful enough to knock down your opponent. Every hit countsThe sequel to EA Sports' Fight Night 2004 maintains the original's analog control scheme and introduces a variety of new features. Now you have access to even more punches, including a new \"haymaker\" punch that is just powerful enough to knock down your opponent. Every hit counts in this game, as injuries reduce a fighter's ability to defend himself. Your cut man can tend to your injuries in between rounds to help you survive your opponent's devastating punches.… Expand"}, {"name": "Dark Souls II: Crown of the Ivory King", "details_link": "https://www.metacritic.com/game/playstation-3/dark-souls-ii-crown-of-the-ivory-king", "publisher": "Bandai Namco Games", "release_date": "Sep 30 2014", "developers": ["Namco Bandai Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/838de54d9b0d7f85a03560d6a48d4906-98.jpg", "descriptions": "'DARK SOULS II Crown of the Ivory King' is the third of 3 large-scale DLC additions to DARK SOULS II, and includes all-new stages, maps, boss characters, weapons & armor! In this third DLC, players will find themselves in a world shining bright with the glow of treacherous ice. Can you'DARK SOULS II Crown of the Ivory King' is the third of 3 large-scale DLC additions to DARK SOULS II, and includes all-new stages, maps, boss characters, weapons & armor! In this third DLC, players will find themselves in a world shining bright with the glow of treacherous ice. Can you find and recover the lost crown?… Expand"}, {"name": "Velocity Ultra", "details_link": "https://www.metacritic.com/game/playstation-vita/velocity-ultra", "publisher": "FuturLab", "release_date": "Jul  2 2013", "developers": ["FuturLab"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita"], "genres": ["Action", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/4377f9b7e3ba2ab55051217debc3c3f6-98.jpg", "descriptions": "Velocity Ultra is what Velocity should have been the first time around: a native PlayStation Vita title with deliciously sharp and stylish HD graphics, PSN trophies and online leader boards. [FuturLab]"}, {"name": "There is no game : Wrong dimension", "details_link": "https://www.metacritic.com/game/switch/there-is-no-game-wrong-dimension", "publisher": "Draw Me A Pixel", "release_date": "Apr 14 2021", "developers": ["Draw Me A Pixel"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 87, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/da60e633bbd7c02e473c83fd23c33f05-98.jpg", "descriptions": "There is no game. So don't go messing things up by clicking everywhere. You don’t want to be kicked out of your video game world, do you? Of course not! \"There Is No Game: Wrong Dimension\" is a Point&Click comedy adventure (and Point&Click only!) that will take you on a journey you neverThere is no game. So don't go messing things up by clicking everywhere. You don’t want to be kicked out of your video game world, do you? Of course not! \"There Is No Game: Wrong Dimension\" is a Point&Click comedy adventure (and Point&Click only!) that will take you on a journey you never asked to go on, through silly and unexpected video game universes. Will you be able to play along with the \"Game\" to find your way home? We sincerely think NOT.… Expand"}, {"name": "Puzzle Quest: Challenge of the Warlords", "details_link": "https://www.metacritic.com/game/xbox-360/puzzle-quest-challenge-of-the-warlords", "publisher": "Microsoft", "release_date": "Oct 10 2007", "developers": ["Infinite Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 87, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/9ea9da46a2e0c06ac4bd1fd3332a7a53-98.jpg", "descriptions": "[Xbox Live Arcade]  Designed specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a[Xbox Live Arcade]  Designed specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a puzzle board setting. Set in the Warlords universe, the game challenges players to create, develop and customize the ultimate hero in order to save the land of Etheria from evil Lord Bane. To advance their character, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinct gameplay modes: Single-player allows gamers to battle against the AI as they embark on over 150 challenging quests, Instant Action allows gamers to jump in and immediately play continuous battles to level-up characters without participating in quests, and Multiplayer allows gamers to battle live opponents. Victory will advance the player’s hero, magical arsenal, creature companions and more - ultimately rewarding gamers at nearly every turn and providing endless hours of replayability. [D3Publisher of America]… Expand"}, {"name": "Forza Horizon 3: Hot Wheels", "details_link": "https://www.metacritic.com/game/xbox-one/forza-horizon-3-hot-wheels", "publisher": "Microsoft Game Studios", "release_date": "May  9 2017", "developers": ["Playground Games"], "platforms": ["PC", "Xbox One"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 87, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/f75ef6d591e38e3a1e49247a985ce272-98.jpg", "descriptions": "Forza Horizon 3 Hot Wheels, the latest expansion for Forza Horizon 3, is now available exclusively on both Xbox One and Windows 10 PCs. Available either as part of the Forza Horizon 3 Expansion Pass, or as a standalone purchase, Forza Horizon 3 Hot Wheels transports you to a new AustralianForza Horizon 3 Hot Wheels, the latest expansion for Forza Horizon 3, is now available exclusively on both Xbox One and Windows 10 PCs. Available either as part of the Forza Horizon 3 Expansion Pass, or as a standalone purchase, Forza Horizon 3 Hot Wheels transports you to a new Australian locale, where orange tracks spiral and loop into the air and iconic Hot Wheels cars come to life. … Expand"}, {"name": "Hex: Shards of Fate", "details_link": "https://www.metacritic.com/game/pc/hex-shards-of-fate", "publisher": "Gameforge", "release_date": "Jan 26 2016", "developers": ["Cryptozoic Entertainment", "Hex Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Card Battle", "Strategy", "Turn-Based", "Card Battle"], "meta_score": 87, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/1e2acacb51fe425dfd83fd266aaf00d6-98.jpg", "descriptions": "A trading card MMO game."}, {"name": "World of Warcraft: Warlords of Draenor", "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-warlords-of-draenor", "publisher": "Blizzard Entertainment", "release_date": "Nov 13 2014", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Miscellaneous", "Massively Multiplayer Online", "Massively Multiplayer", "Board / Card Game", "Fantasy"], "meta_score": 87, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/55c4cabdc5dd66e36f30a2fe6cc8fd34-98.jpg", "descriptions": "To scrap with the greatest army Draenor has ever known, you will need your own forces and your own fortress. Build a mighty garrison: an enduring home base integrated seamlessly with the world, not a hiding place far from the tumult. Customize it with functional structures like farms,To scrap with the greatest army Draenor has ever known, you will need your own forces and your own fortress. Build a mighty garrison: an enduring home base integrated seamlessly with the world, not a hiding place far from the tumult. Customize it with functional structures like farms, stables, armories, workshops and more. Lay down trade routes and unlock new quests, gear and pets to support your war for Draenor. Recruit stalwart followers to man your base, and send them to loot dungeons, fulfill missions, and craft items, even if you’re offline. Tame a deadly realm, and build an unbreakable monument to victory.… Expand"}, {"name": "LittleBigPlanet", "details_link": "https://www.metacritic.com/game/psp/littlebigplanet", "publisher": "SCEA", "release_date": "Nov 17 2009", "developers": ["SCE/WWS", "Media Molecule"], "platforms": ["PlayStation 3", "PSP"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 87, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/da4dc98c4bb4dc53ba93e8eb724001aa-98.jpg", "descriptions": "Step into LittleBigPlanet and discover a world of endless possibilities, where imagination is everything. Whatever you can see, you can enhance. And whatever you don’t see, you can invent. All you need is curiosity, creativity and a thirst for fun: LittleBigPlanet provides the rest! Set offStep into LittleBigPlanet and discover a world of endless possibilities, where imagination is everything. Whatever you can see, you can enhance. And whatever you don’t see, you can invent. All you need is curiosity, creativity and a thirst for fun: LittleBigPlanet provides the rest! Set off with Sackboy to explore an incredible array of environments, where every object is ripe for investigation and interaction. Overcome all manner of bamboozling obstacles to gain the skills you need to build your own unique creations, then share them with the world. LittleBigPlanet brings the revolutionary PlayStation 3 hit to PSP in stunning style. Featuring the same iconic look and ground-breaking game design, with LittleBigPlanet for PSP, the power of play is in your hands. [SCEE]… Expand"}, {"name": "Okami HD", "details_link": "https://www.metacritic.com/game/xbox-one/okami-hd", "publisher": "Capcom", "release_date": "Dec 12 2017", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 87, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/c6a4d323290382930190eb2d478dbce2-98.jpg", "descriptions": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't.In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.… Expand"}]