[{"name": "Maglam Lord", "details_link": "https://www.metacritic.com/game/playstation-4/maglam-lord", "publisher": "PQube", "release_date": "Feb  4 2022", "developers": ["Felistella"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/1d527da8c542808b0b891ccd6330e5ca-98.jpg", "descriptions": "The Demon King is an endangered species Magic Sword Creation Action RPG!\n\nThe hero was making a name for himself as the worst demon king. When they wake up from a long sleep, they are designated as an \"endangered species\"!\n\nCraft a magic sword with your friends and fight for a completeThe Demon King is an endangered species Magic Sword Creation Action RPG!The hero was making a name for himself as the worst demon king. When they wake up from a long sleep, they are designated as an \"endangered species\"!Craft a magic sword with your friends and fight for a complete revival!In order to avoid extinction, it is possible to \"concatenate\" with heroes and cooperators ...?An exhilarating action RPG!… Expand"}, {"name": "Poison Control", "details_link": "https://www.metacritic.com/game/switch/poison-control", "publisher": "NIS America", "release_date": "Apr 13 2021", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/14ec9f32c3574508bb257584a5c0ab8a-98.jpg", "descriptions": "This shooter-meets-action title combines high-octane gameplay and a grim-yet-charming art style into one unforgettable adventure. Use Poisonette's powers to purify poison mires while blasting away enemies as her gunslinging vessel. You can also customize your gameplay experience by choosingThis shooter-meets-action title combines high-octane gameplay and a grim-yet-charming art style into one unforgettable adventure. Use Poisonette's powers to purify poison mires while blasting away enemies as her gunslinging vessel. You can also customize your gameplay experience by choosing between a male or female vessel, unlocking weapons and enhancements with each world you purify, and increasing certain stats of Poisonette through choice-based dialogue. A poisonous partnership: swap between the poison-absorbing Poisonette and her gun-wielding vessel, and combine firepower and zone control to destroy the creatures of the poison mires. Enigmatic encounters: uncover the mysterious circumstances that set Poisonette and her vessel on the poisonous path towards redemption. Corrupt and colorful: with an art style that's as grim as it is charming, this twisted tale practically jumps off the screen! From vivid stages to vibrant gameplay effects, this adventure is as much a visual experience as it is visceral. … Expand"}, {"name": "Seven Knights -Time Wanderer-", "details_link": "https://www.metacritic.com/game/switch/seven-knights--time-wanderer-", "publisher": "Netmarble Games Corp.", "release_date": "Nov  5 2020", "developers": ["Netmarble Games Corp."], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/c0cdc4527e58fe35b812b0c9c7b685a0-98.jpg", "descriptions": "Seven Knights - Time Wanderer - focuses on the story of the eighth member of the Seven Knights, Vanessa, and her ultimate magical equipment, a sentient hourglass known as Sandy, as she embarks on a journey to return safely home after falling into the twists of space and time."}, {"name": "Destiny 2: Warmind", "details_link": "https://www.metacritic.com/game/xbox-one/destiny-2-warmind", "publisher": "Activision", "release_date": "May  8 2018", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 61, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/2/930de73d7565e41d5a7e08af8917ed1a-98.jpg", "descriptions": "Destiny 2 Expansion II: Warmind continues your Guardian’s journey with an all-new story. Ana Bray, a Guardian long thought lost, searches for a connection to her past…one that could be lost forever on the polar ice caps of Mars. As Golden Age warsats begin slamming into the ice, the glaciersDestiny 2 Expansion II: Warmind continues your Guardian’s journey with an all-new story. Ana Bray, a Guardian long thought lost, searches for a connection to her past…one that could be lost forever on the polar ice caps of Mars. As Golden Age warsats begin slamming into the ice, the glaciers begin to thaw, revealing the core of the Warmind Rasputin – and an ancient Hive army bent on its destruction. Now free, the Hive swarm in service to their god Xol. Help Ana discover her past and destroy the Hive’s gargantuan worm-god before it is too late.… Expand"}, {"name": "Filthy Lucre", "details_link": "https://www.metacritic.com/game/playstation-4/filthy-lucre", "publisher": "Fabrik Games", "release_date": "Sep 16 2016", "developers": ["Fabrik Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 61, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/c553f9f0832ad2bdefe40e283503762f-98.jpg", "descriptions": "Filthy Lucre is a tactical stealth action game you can play single player and co-op, both split screen and online."}, {"name": "Redux: Dark Matters", "details_link": "https://www.metacritic.com/game/pc/redux-dark-matters", "publisher": "NG:DEV.TEAM", "release_date": "Dec 12 2014", "developers": ["NG:DEV.TEAM", "KTX Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Shooter", "Scrolling", "Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 61, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/cef42b81acf1479c162ea2aee99f95a0-98.jpg", "descriptions": "A fast-paced space shooting game with fresh scoring elements - a bastard-hard shooter."}, {"name": "Captain America: Super Soldier", "details_link": "https://www.metacritic.com/game/playstation-3/captain-america-super-soldier", "publisher": "Sega", "release_date": "Jul 19 2011", "developers": ["Next Level Games"], "platforms": ["3DS", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/639e4d0a22beabd01b1da79bed206178-98.jpg", "descriptions": "Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once,Captain America: Super Soldier combines a highly athletic combat system with fluid platforming and a highly tuned suite of shield attacks, as Cap explores a massive castle turned military installation. His shield can be employed in numerous ways: taking out multiple enemies at once, deflecting incoming fire back at enemies, solving puzzles, and scaling walls. Players will be able to launch shield-first into the fray with the superior force of the world's first Super-Soldier at their fingertips and they'll need every bit of that strength to overcome a castle that's both an acrobatic playground for the Captain's physical prowess and a house of mystery with enemies and danger at every turn.… Expand"}, {"name": "Blood Bowl", "details_link": "https://www.metacritic.com/game/xbox-360/blood-bowl", "publisher": "Focus Home Interactive", "release_date": "Jan 26 2010", "developers": ["Cyanide"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "genres": ["Sports", "Alternative", "Team", "Individual", "Football", "Other", "Other", "Arcade"], "meta_score": 61, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/c9e3154a01fbf50d830d2148b9059041-98.jpg", "descriptions": "A brutal team sport unfolding in a parallel fantasy world based on Warhammer and American football, Blood Bowl invites gamers to form a team of players from races including: Orcs, Elves, Humans, Dwarfs and many other fantasy creatures, and launch themselves into battle in the bloodiest ofA brutal team sport unfolding in a parallel fantasy world based on Warhammer and American football, Blood Bowl invites gamers to form a team of players from races including: Orcs, Elves, Humans, Dwarfs and many other fantasy creatures, and launch themselves into battle in the bloodiest of arenas. This strategy sports game combines a fine balance of tactics and bone crunching action! The game offers two game modes. The first, which is fully real time, offers spectacular gameplay with intense battles between blocking linemen and daring displays of agility of players leaping and dodging through opponents tackle zones, while powerful spells and dirty trick special plays are unleashed across the field. All this creates a highly charged atmosphere. Of course, since it is sometimes difficult to keep an eye on the entire field at once, the game's interface offers different tactical and strategic setups, while the AI is responsible for managing the players on the field. The second game mode, an actual turn-based game, is a treat for players of the original board game because it is an exact replica of Games Workshop's tabletop masterpiece. The original rules have been faithfully reproduced, and it contains all of the devices, strategies, play and rhythm of the original game. [Focus Home Interactive]… Expand"}, {"name": "Shadow Ops: Red Mercury", "details_link": "https://www.metacritic.com/game/xbox/shadow-ops-red-mercury", "publisher": "Atari", "release_date": "Jun 15 2004", "developers": ["Zombie"], "platforms": ["PC", "Xbox"], "num_players": "1-8 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/f1076792e1ed3318d5c908c9eb1fedb5-98.jpg", "descriptions": "It's a race against time as a member of the elite Delta Force. A terrorist overlord threatens the world with a nuclear device, and you, along with other elite fighting units, must hunt him down. From the hostile streets of the Middle East to the landmarks of a major European city, yourIt's a race against time as a member of the elite Delta Force. A terrorist overlord threatens the world with a nuclear device, and you, along with other elite fighting units, must hunt him down. From the hostile streets of the Middle East to the landmarks of a major European city, your missions require a mix of all-out assault with stealth infiltration. Prevent disaster in single-player mode or wreak havoc online in multiplayer modes.… Expand"}, {"name": "Cities XL 2012", "details_link": "https://www.metacritic.com/game/pc/cities-xl-2012", "publisher": "Focus Home Interactive", "release_date": "Oct 20 2011", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "genres": ["Strategy", "City Building", "Management", "Modern", "Modern", "Government"], "meta_score": 61, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/f2d9c56d2aaaed398312da16123ac151-98.jpg", "descriptions": "Cities XL 2012 is the newest version of the popular PC city-building simulation, which allows you to build, develop and then connect huge cities.\r Cities XL 2012 allows players to become real urban planners, balancing economic & energy developments of their cities while managingCities XL 2012 is the newest version of the popular PC city-building simulation, which allows you to build, develop and then connect huge cities.\r Cities XL 2012 allows players to become real urban planners, balancing economic & energy developments of their cities while managing transportation, housing, social services and recreational activities. Content is key to the new game, as Cities XL 2012 offers a staggering number of unique structures with over 1,000 in total.… Expand"}, {"name": "Acceleration of SUGURI X-Edition", "details_link": "https://www.metacritic.com/game/playstation-3/acceleration-of-suguri-x-edition", "publisher": "Sony Online Entertainment", "release_date": "Feb 15 2011", "developers": ["Rockin' Android"], "platforms": ["PC", "PlayStation 3"], "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "2D"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/8921abd2df4c58374c12674299f373d5-98.jpg", "descriptions": "In Acceleration of Suguri X Edition, players take on the role of a scorned robot to maneuver through arcade storylines and battle other robots."}, {"name": "Ashwalkers: A Survival Journey", "details_link": "https://www.metacritic.com/game/pc/ashwalkers-a-survival-journey", "publisher": "Dear Villagers", "release_date": "Apr 15 2021", "developers": ["Nameless XIII"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/dbd0d9ad7948e4f5ecb35a29807395a0-98.jpg", "descriptions": "From the co-founder of Dontnod (Life is Strange) Hervé Bonin's new studio Nameless XIII. Face the dark corners of your humanity and find out what lurks in the shadows. Set 200 years after the first geological disasters the earth is a post-apocalyptic wasteland. Survive the weather, the ashFrom the co-founder of Dontnod (Life is Strange) Hervé Bonin's new studio Nameless XIII. Face the dark corners of your humanity and find out what lurks in the shadows. Set 200 years after the first geological disasters the earth is a post-apocalyptic wasteland. Survive the weather, the ash storm, the grey blizzard and the acid rain. \r\rA survival journey through a harsh world without rules or judgement. Only your choices matters in the face of moral dilemmas. Manage your party, food & equipment in this non-linear narrative survival sim with 34 possible endings.… Expand"}, {"name": "Downward Spiral: Horus Station", "details_link": "https://www.metacritic.com/game/playstation-4/downward-spiral-horus-station", "publisher": "3rd Eye Studios Oy LTD", "release_date": "Sep 18 2018", "developers": ["3rd Eye Studios Oy LTD", "3rd Eye Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 61, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/3/ef7af0721c821f95f24480a346cf2482-98.jpg", "descriptions": "Downward Spiral: Horus Station is a mysterious and atmospheric zero gravity thriller set in the lost and forgotten Horus Station."}, {"name": "Frogger", "details_link": "https://www.metacritic.com/game/xbox-360/frogger", "publisher": "Konami", "release_date": "Jul 12 2006", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 4", "Switch", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 61, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/5/adae4586b9c79aeb3afd2512e451646e-98.jpg", "descriptions": "[Xbox Live Arcade]  Enjoy the classic game Frogger, revitalized and brand spanking new on your Xbox 360. Features enhanced artwork building on the original title's style, modernized sound and music, and all new play modes. Versus speed mode: Race a friend in split screen or Xbox Live action[Xbox Live Arcade]  Enjoy the classic game Frogger, revitalized and brand spanking new on your Xbox 360. Features enhanced artwork building on the original title's style, modernized sound and music, and all new play modes. Versus speed mode: Race a friend in split screen or Xbox Live action with this exciting new mode. Take as many frogs as you need to be the first to get five across the street for a new, intense competition. Co-op play: With a friend in the room, or on the other side of the world via Xbox Live, put your competitive nature aside and work together to push your frogs to the limit. All new bonuses: Rescue extra frogs, discover Frogger's friends, and search out tasty insect bonuses to push your score higher. There's an all time high score for this title, and someone's gonna have to beat it. [Microsoft]… Expand"}, {"name": "Wizardry: Labyrinth of Lost Souls", "details_link": "https://www.metacritic.com/game/pc/wizardry-labyrinth-of-lost-souls", "publisher": "XSEED Games", "release_date": "Jan 15 2020", "developers": ["Acquire"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/da44dc40039a55a66a4cad1096ea677b-98.jpg", "descriptions": "Following in the grand tradition of the Wizardry series is the very first version available for today's Next-Gen gamers; Wizardry: Labyrinth of Lost Souls features a deceptively simple game system complementing deep and involving dungeon designs.  Hardcore RPG fans will find an extensive andFollowing in the grand tradition of the Wizardry series is the very first version available for today's Next-Gen gamers; Wizardry: Labyrinth of Lost Souls features a deceptively simple game system complementing deep and involving dungeon designs.  Hardcore RPG fans will find an extensive and grueling 1st-person 3D grid-based dungeon crawl experience rendered in high-definition with hand-drawn characters and sprites by famous commercial artist Yuki Hayabusa. Players will develop a party of up to six members culled from a rich mix of five races and eight classes, and prepare to encounter over 120 different monsters.… Expand"}, {"name": "Reign of Fire", "details_link": "https://www.metacritic.com/game/game-boy-advance/reign-of-fire", "publisher": "Bam Entertainment", "release_date": "Oct 31 2002", "developers": ["Crawfish Interactive"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/fde3bf6650c48b3c79421cde25a1d771-98.jpg", "descriptions": "Based on the movie, Reign of Fire lets you play as either a human or a dragon in an epic battle. As a human, you'll take the role of a resistance fighter who's trying to defend the last remaining humans from attack. You must make your way to the site of the sole male dragon using a varietyBased on the movie, Reign of Fire lets you play as either a human or a dragon in an epic battle. As a human, you'll take the role of a resistance fighter who's trying to defend the last remaining humans from attack. You must make your way to the site of the sole male dragon using a variety of well-equipped vehicles and high-tech weaponry. As a dragon, you'll take the role of an infant, led by instinct to attack foes, and you'll attempt to eradicate the human race. With your natural fire-breathing and flying abilities, you can destroy everything on the ground or in the skies.… Expand"}, {"name": "Micro Machines V4", "details_link": "https://www.metacritic.com/game/psp/micro-machines-v4", "publisher": "Codemasters", "release_date": "Jun 27 2006", "developers": ["Supersonic Software"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/2bfccbf4ddcab42dcd17e39c27a6912d-98.jpg", "descriptions": "Mixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll beMixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll be racing your inch-long miniature motors on the wildest tracks where everyday household objects appear immense in size and can become lethal hazards. Sport cars, street racers, stock cars, 4x4s, beach buggies, lowriders and muscle cars are just some of the Micro Machines models you'll be taking out on the improvised tracks around the Micro Machines house, garden and - for the first time - beyond. Spin out around the breakfast table littered with cereal spills, tear through the kitchen but avoid literally burning tyre rubber on the blazing hot cooker, turbo boost around the pool table (while avoiding the treacherous pockets), or hit the gas as you drive around the rim of the bath, carefully negotiating the ferocious waters pouring over the edge of the bath (because someone left the tap running). [Codemasters]… Expand"}, {"name": "Shaun White Skateboarding", "details_link": "https://www.metacritic.com/game/xbox-360/shaun-white-skateboarding", "publisher": "Ubisoft", "release_date": "Oct 24 2010", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Sports", "Alternative", "Individual", "Other", "Other", "Skate / Skateboard"], "meta_score": 61, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/681f64cfb44f403243e6ed09dd5b6282-98.jpg", "descriptions": "Shaun White Skateboarding, a game that puts an innovative twist on the action-sports genre, is the latest offering in the award-winning franchise developed in collaboration with dual-sport super-athlete, Shaun White. The most ambitious installment yet, Shaun White Skateboarding brings allShaun White Skateboarding, a game that puts an innovative twist on the action-sports genre, is the latest offering in the award-winning franchise developed in collaboration with dual-sport super-athlete, Shaun White. The most ambitious installment yet, Shaun White Skateboarding brings all the sensations of skateboarding to a wide audience making skate dreams possible and allowing players to transform a dull, lifeless city into their own extraordinary skating utopia.\r As players skate, they add color, life and brilliance to the city by extending handrails into endless grinds, carving alleys into half pipes, morphing streets into ramps and much more. Players can skate their way, any way they want, to create their own customized skating world that can also be shared with friends. Shaun White Skateboarding empowers skaters to push the limits of what’s possible.… Expand"}, {"name": "Infini", "details_link": "https://www.metacritic.com/game/switch/infini", "publisher": "Nakana.io", "release_date": "Jul  3 2020", "developers": ["Barnaque"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 61, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/b946b754d291d1d67e52572b8fdac1e3-98.jpg", "descriptions": "As Hope drifts deeper into Infinity, Reality begins to suffer. There doesn’t seem to be any way out, and Hope is by nature doomed to carry on. Challenge your mind to help him out. Master the innovative camera manipulation mechanic to change your perspective and discover new mazes, abilitiesAs Hope drifts deeper into Infinity, Reality begins to suffer. There doesn’t seem to be any way out, and Hope is by nature doomed to carry on. Challenge your mind to help him out. Master the innovative camera manipulation mechanic to change your perspective and discover new mazes, abilities and characters such as Time, War, Fatality or Technology - who can be helpful allies or deceitful foes in this 8-hour long story-driven puzzle adventure.… Expand"}, {"name": "Dead by Daylight", "details_link": "https://www.metacritic.com/game/switch/dead-by-daylight", "publisher": "Behaviour Interactive", "release_date": "Sep 24 2019", "developers": ["505 Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/4/407f881148866796eaa23d4c87ff01ed-98.jpg", "descriptions": "Dead by Daylight is a multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught, tortured and killed.\r Survivors play in third-person and have the advantage ofDead by Daylight is a multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught, tortured and killed.\r Survivors play in third-person and have the advantage of better situational awareness. The Killer plays in first-person and is more focused on their prey.\r The Survivors' goal in each encounter is to escape the Killing Ground without getting caught by the Killer - something that sounds easier than it is, especially when the environment changes every time you play.\r Key Features:\r * Survive Together Or Not - Survivors can either cooperate with the others or be selfish. Your chance of survival will vary depending on whether you work together as a team or if you go at it alone. Will you be able to outwit the Killer and escape their Killing Ground?\r * Where Am I? - Each level is procedurally generated, so youll never know what to expect. Random spawn points mean you will never feel safe as the world and its danger change every time you play.\r * A Feast for Killers - Dead by Daylight draws from all corners of the horror world. As a Killer you can play as anything from a powerful Slasher to terrifying paranormal entities. Familiarize yourself with your Killing Grounds and master each Killers unique power to be able to hunt, catch and sacrifice your victims.\r * Deeper and Deeper - Each Killer and Survivor has their own deep progression system and plenty of unlockables that can be customized to fit your own personal strategy. Experience, skills and understanding of the environment are key to being able to hunt or outwit the Killer.\r * Real People, Real Fear - The procedural levels and real human reactions to pure horror makes each game session an unexpected scenario. You will never be able to tell how its going to turn out. Ambience, music, and chilling environments combine into a terrifying experience. With enough time, you might even discover whats hiding in the fog.… Expand"}, {"name": "Atomic Ninjas", "details_link": "https://www.metacritic.com/game/playstation-vita/atomic-ninjas", "publisher": "Grip Games", "release_date": "Oct  8 2013", "developers": ["Grip Games"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/36d062caf33401b90badf3e67c2c6c52-98.jpg", "descriptions": "Atomic Ninjas is a colorful and funny multiplayer action game, in which you control super-powered ninjas in frantic online matches against other players."}, {"name": "NCAA GameBreaker 2004", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-gamebreaker-2004", "publisher": "SCEA", "release_date": "Aug 27 2003", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/1959f1ae486fe451f4e1507108530700-98.jpg", "descriptions": "For the first time ever, NCAA GameBreaker 2004 will allow gamers to take their skills online and compete against other college football fans anytime, anywhere. NCAA GameBreaker 2004 further illustrates the realism of college football this year by using the new Practice Mode that givesFor the first time ever, NCAA GameBreaker 2004 will allow gamers to take their skills online and compete against other college football fans anytime, anywhere. NCAA GameBreaker 2004 further illustrates the realism of college football this year by using the new Practice Mode that gives players the option to sharpen their skills before playing an exhibition or entering season mode. Bringing back the true-to-life college football experience that gamers crave, legendary announcers Keith Jackson and Tim Brandt return to the microphone. With more than 50 new animated mascots, cheerleaders, and sideline personnel, gamers everywhere will feel the spirit and emotion of college football. [SCEA]… Expand"}, {"name": "Speed Kings", "details_link": "https://www.metacritic.com/game/playstation-2/speed-kings", "publisher": "Acclaim", "release_date": "May 28 2003", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 61, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/f28d8548eed106a69abaddcf4983cf41-98.jpg", "descriptions": "It will take nerves of steel and lightning fast reflexes to make your way through these crowded streets. Speed Kings is about the pure unadulterated adrenaline rush of the street motorcycle racing...the speed, the danger, the risk, the buzz and of course, the bikes! Power-down slideIt will take nerves of steel and lightning fast reflexes to make your way through these crowded streets. Speed Kings is about the pure unadulterated adrenaline rush of the street motorcycle racing...the speed, the danger, the risk, the buzz and of course, the bikes! Power-down slide underneath lorries, jump over road works, avoid major wipe-out crashes from the on-coming traffic and gain as many respect points as possible...make sure you look good when you cross the winning line! Features 22 bikes based on production and custom real world models, 3 single player modes and 5 multiplayer options, Arcade-style handling and control. [Acclaim]… Expand"}, {"name": "Bloody Roar Extreme", "details_link": "https://www.metacritic.com/game/xbox/bloody-roar-extreme", "publisher": "Konami", "release_date": "May 27 2003", "developers": ["Eighting/Raizing"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 61, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/d949960f12dd47027347fb653e8b39f4-98.jpg", "descriptions": "Punch, kick and smash your way to the top in the deadliest beast-warrior fighting tournament of all time! Choose one of 14 fierce fighters, and transform into its \"Hyper-Beast\" alter-ego to defeat all challengers. The action comes to life on the Xbox with high-resolution graphicsPunch, kick and smash your way to the top in the deadliest beast-warrior fighting tournament of all time! Choose one of 14 fierce fighters, and transform into its \"Hyper-Beast\" alter-ego to defeat all challengers. The action comes to life on the Xbox with high-resolution graphics and spectacular special effects running at a blazing 60 frames per second.… Expand"}, {"name": "CSI: Crime Scene Investigation", "details_link": "https://www.metacritic.com/game/pc/csi-crime-scene-investigation", "publisher": "Ubisoft", "release_date": "Mar 26 2003", "developers": ["369 Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/f577dd56424e19825f3e9278b518ebbf-98.jpg", "descriptions": "A murdered woman...a slain police officer...a mysterious arson case. What do these crimes have in common? Enter the gritty world of CSI and search for the truth with Grissom, Catherine, and the entire Crime Scene Investigation team. Armed with high-powered forensic equipment and razor-sharpA murdered woman...a slain police officer...a mysterious arson case. What do these crimes have in common? Enter the gritty world of CSI and search for the truth with Grissom, Catherine, and the entire Crime Scene Investigation team. Armed with high-powered forensic equipment and razor-sharp wits, delve deep into the mysteries of 5 baffling crime scenes to reveal the truth. Don't just watch the action. Live it!  [Ubi Soft]… Expand"}, {"name": "World War II: Panzer Claws", "details_link": "https://www.metacritic.com/game/pc/world-war-ii-panzer-claws", "publisher": "Eidos Interactive", "release_date": "Nov 12 2002", "developers": ["Zuxxez", "In Images"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Tactics"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/b489b31d860e54d0666f0d9d6e66f2ea-98.jpg", "descriptions": "Take control of the Allied, German, or Russian forces as you engage the enemy in the European theater of war from the German invasion of the USSR, to D-Day, to the last great German offensive in the Ardennes Forest. Utilize ground troops, a vast number of tanks and other motorized vehicles,Take control of the Allied, German, or Russian forces as you engage the enemy in the European theater of war from the German invasion of the USSR, to D-Day, to the last great German offensive in the Ardennes Forest. Utilize ground troops, a vast number of tanks and other motorized vehicles, as well as air reinforcements to crush the opposition and reach your ultimate objective... victory!  [Eidos Interactive]… Expand"}, {"name": "AirForce Delta Storm", "details_link": "https://www.metacritic.com/game/xbox/airforce-delta-storm", "publisher": "Konami", "release_date": "Nov 14 2001", "developers": ["KCE Studios"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/6b275ba9023a4489cbf8529b97fc21c1-98.jpg", "descriptions": "Strap into your cockpit and blast through the gut-wrenching world of flight combat. Your adrenaline pumps as machine gun fire pelts off your tail, you execute back-breaking barrel rolls and experience dog-fighting action. Take your pick of over 70 planes, including military fighters renderedStrap into your cockpit and blast through the gut-wrenching world of flight combat. Your adrenaline pumps as machine gun fire pelts off your tail, you execute back-breaking barrel rolls and experience dog-fighting action. Take your pick of over 70 planes, including military fighters rendered from actual aircraft. With a full range of extreme missions to numb your senses, AirForce Delta Storm pushes your Xbox to the sky!… Expand"}, {"name": "ESPN International Track & Field", "details_link": "https://www.metacritic.com/game/dreamcast/espn-international-track-field", "publisher": "Konami", "release_date": "Sep 26 2000", "developers": ["KCEO"], "platforms": ["PlayStation 2", "Dreamcast"], "genres": ["Sports", "Olympic Sports"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/ff8b365a1405dc40b3c07c314a88f5bd-98.jpg", "descriptions": "Go for the Gold!\r *Detailed ESPN Integration \r\n*Authentic ESPN Graphic overlays\r\n*Eye-popping statistical drop-ins\r\n*Broadcast quality replays\r\n*Over 750 authentic motion-captured animations featuring \"The World's Fastest Man,\" Maurice Greene, 3 time Olympian Ato Boldon, andGo for the Gold!\r *Detailed ESPN Integration \r*Authentic ESPN Graphic overlays\r*Eye-popping statistical drop-ins\r*Broadcast quality replays\r*Over 750 authentic motion-captured animations featuring \"The World's Fastest Man,\" Maurice Greene, 3 time Olympian Ato Boldon, and more.\r*12 international track & field events from the 100m dash to the Hammer Throw.\r*Compete with athletes from over 10 different countries around the world with up to 4 player capability… Expand"}, {"name": "Sonic the Hedgehog 4: Episode II", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-the-hedgehog-4-episode-ii", "publisher": "Sega", "release_date": "May 16 2012", "developers": ["Sega"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 61, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/09bbc1e5f23874df401217fec79c879b-98.jpg", "descriptions": "Sonic the Hedgehog 4 Episode II will expand the Sonic 4 storyline with new areas to speed through and new challenges to face."}, {"name": "Godfall", "details_link": "https://www.metacritic.com/game/playstation-5/godfall", "publisher": "Gearbox Publishing", "release_date": "Nov 12 2020", "developers": ["Counterplay Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/6b83d16e36cc30beb097e017516a439b-98.jpg", "descriptions": "Save Aperion. You are the last of the Valorian knights, masters of combat equipped with legendary armor called Valorplates. Ascend in Godfall, a first-of-its-kind, looter-slasher, melee action-RPG."}, {"name": "Green Lantern: Rise of the Manhunters", "details_link": "https://www.metacritic.com/game/playstation-3/green-lantern-rise-of-the-manhunters", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun  7 2011", "developers": ["Double Helix Games"], "platforms": ["3DS", "iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 61, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/c3ae3eeff346926036ce1dece1ddadd1-98.jpg", "descriptions": "Green Lantern: Rise of the Manhunters is inspired by the feature film, which brings the enduringly popular DC Comics super hero to the big screen for the first time and which stars Ryan Reynolds in the title role as Hal Jordan, the newest member of the Green Lantern Corps.  In the videogameGreen Lantern: Rise of the Manhunters is inspired by the feature film, which brings the enduringly popular DC Comics super hero to the big screen for the first time and which stars Ryan Reynolds in the title role as Hal Jordan, the newest member of the Green Lantern Corps.  In the videogame players will utilize over a dozen constructs and take flight across the deepest parts of the Universe to restore intergalactic order by wielding the ultimate weapon: the Green Lantern power ring.… Expand"}, {"name": "Mafia II: Joe's Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/mafia-ii-joes-adventures", "publisher": "2K Games", "release_date": "Nov 23 2010", "developers": ["2K Czech"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/97fa64e218e2c7e05d38713b3567f1e7-98.jpg", "descriptions": "Joe's Adventures offers an engaging narrative and allows players to explore new locations, including a train station, the cathouse, a boat yard, a seasonally changing lakefront and some never-before-seen buildings in Empire Bay. This exciting new chapter in the Mafia II saga includes newJoe's Adventures offers an engaging narrative and allows players to explore new locations, including a train station, the cathouse, a boat yard, a seasonally changing lakefront and some never-before-seen buildings in Empire Bay. This exciting new chapter in the Mafia II saga includes new clothing, collectibles and even more classic 40's and 50's music. In addition to the story-based missions, Joe's Adventures opens up a slew of optional city-based quests packed with arcade action gameplay and a points-based system that allows players to move up the ranks on the online leaderboard through combos and multiplier bonuses. Deadly executions by head shot or charged explosives rack up points, and precision-timed vehicular power slides, lofty jumps and feats of supercharged speed maintain the adrenaline-charged fun for extensive replayability.… Expand"}, {"name": "Sengoku Basara: Samurai Heroes", "details_link": "https://www.metacritic.com/game/playstation-3/sengoku-basara-samurai-heroes", "publisher": "Capcom", "release_date": "Oct 12 2010", "developers": ["Capcom"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 61, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/36a98381d714ae41f1da6237e8561814-98.jpg", "descriptions": "Featuring unique playable characters, as well as supporting generals who will make it easier to command and lead armies, players will see the battle from the perspective of each military commander with the ultimate goal of re-writing history to rule all of 16th century Japan. In the dynamicFeaturing unique playable characters, as well as supporting generals who will make it easier to command and lead armies, players will see the battle from the perspective of each military commander with the ultimate goal of re-writing history to rule all of 16th century Japan. In the dynamic new \"Hero's Story\" mode, the player's decisions impact history with a redesigned story mode. Based on choices made by the player, new drama unfolds as friends become enemies, enemies become friends, and a new Sengoku story unfolds. Adding a new strategic element to the game, forces can fight for control/taking over of camps and ultimately entire battlefields.… Expand"}, {"name": "Dual Blades", "details_link": "https://www.metacritic.com/game/game-boy-advance/dual-blades", "publisher": "Metro3D", "release_date": "Oct  7 2002", "developers": ["Metro3D"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/d5b7d29fb7344a69894cfc1ca06aaa09-98.jpg", "descriptions": "Dual Blades is better for those seeking vicarious thrills or a game that friends can play without hours of basic instruction."}, {"name": "Bee Simulator", "details_link": "https://www.metacritic.com/game/xbox-one/bee-simulator", "publisher": "Bigben Interactive", "release_date": "Nov 12 2019", "developers": ["Varsav Game Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "General", "Open-World"], "meta_score": 61, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/f6e65f6dfdfe75f54ba62491e808164c-98.jpg", "descriptions": "Experience life from the perspective of a Bee."}, {"name": "The Walking Dead Onslaught", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-onslaught", "publisher": "Survios", "release_date": "Sep 29 2020", "developers": ["Survios"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/65b241f6748c9db00e6ed59464151807-98.jpg", "descriptions": "There’s no rest when survival is on the line. Step into AMC’s The Walking Dead and prepare for an onslaught of walkers as you assume the roles of your favorite characters from the show, and confront the horrors and humanity of this apocalyptic new world."}, {"name": "Over the Hedge", "details_link": "https://www.metacritic.com/game/xbox/over-the-hedge", "publisher": "Activision", "release_date": "May  9 2006", "developers": ["Edge of Reality"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/b73729801301f6e6416b7673baed873a-98.jpg", "descriptions": "When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals,When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals, and save the forest (and your own hide) from the world's peskiest critter-man.… Expand"}, {"name": "Star Wars: Lethal Alliance", "details_link": "https://www.metacritic.com/game/psp/star-wars-lethal-alliance", "publisher": "Ubisoft", "release_date": "Dec  7 2006", "developers": ["Ubisoft Montreal"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/fecbe1193e17fe6ac91be7a14f9f5909-98.jpg", "descriptions": "Combine the elite weaponry and acrobatic skills of Rianna with the multifunctional defensive and slicing support of Zeeo to create a formidable team. Only by working together can you complete perilous missions and ultimately steal the plans for the Death Star. From the chaotic planet ofCombine the elite weaponry and acrobatic skills of Rianna with the multifunctional defensive and slicing support of Zeeo to create a formidable team. Only by working together can you complete perilous missions and ultimately steal the plans for the Death Star. From the chaotic planet of Coruscant to the dusty, dangerous alleys of Mos Eisley, Rianna and Zeeo must use an arsenal of tricks to complete their mission. Set up holographic disguises to fool Imperial guards, commandeer gun turrets, master death-defying flying escapes and battle carnivorous beasts. First original Star Wars game built exclusively for handhelds: Multiplayer modes enhance collaborative gameplay while taking advantage of the unique capabilities of both the PSP system and Nintendo DS. Your mission takes you to classic destinations such as the Death Star and Tatooine, and allows you to discover never-before-seen locations on Despayre, Danuta and Alderaan. Each new environment offers encounters with unforgettable Star Wars characters and species, including Boba Fett, Kyle Katarn, Princess Leia Organa, Darth Vader, Imperial officers, Rodians, Quarren and stormtroopers. [Ubisoft]… Expand"}, {"name": "Staxel", "details_link": "https://www.metacritic.com/game/switch/staxel", "publisher": "Plukit", "release_date": "Sep 23 2021", "developers": ["Plukit"], "platforms": ["PC", "Switch"], "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/23a812a63f6177ef12707229d5abc599-98.jpg", "descriptions": "Grow your farm, meet the villagers, and build your world. Welcome to Staxel, a quaint island full of charming characters, with bugs and fish to catch, fossils to excavate and quests to complete! Settle into your new home on the farm, fix it up, fill it with crops and animals, then change itGrow your farm, meet the villagers, and build your world. Welcome to Staxel, a quaint island full of charming characters, with bugs and fish to catch, fossils to excavate and quests to complete! Settle into your new home on the farm, fix it up, fill it with crops and animals, then change it up across the seasons of the year. When you’re not farming, take up a range of hobbies to earn some extra cash, or spend some time befriending the locals!\r Nurture Your Farm\rPut down roots in Staxel as you settle into your new life. It’s your job to fix up, improve and maintain your homestead. Work the fields, tend to your crops, and adopt a variety of adorable animals such as cows, sheep, cats, and dogs! Make sure to adapt with the changing seasons so you can enjoy the fruits (and vegetables!) of your labour all year round!\r Make The World Your Own\rWith an extensive supply of resources available and a tool catered to every job, you’re tasked with handling all construction in the Staxel world, from your own farm to your neighbours’ houses, the general store and even the town hall!. Will you grow the village while keeping it’s rustic charm, or take it in an entirely new direction? Perhaps you’d rather focus on your own projects? It’s all up to you, and your creativity is just the tool for the job!… Expand"}, {"name": "Sheltered", "details_link": "https://www.metacritic.com/game/switch/sheltered", "publisher": "Team17", "release_date": "Dec 18 2018", "developers": ["Unicube"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Defense"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/9ba63c479fdce2b2544dade614ad0eab-98.jpg", "descriptions": "Sheltered is a deep, emotional survival & post-apocalyptic disaster management game. On Nintendo Switch™, Sheltered includes the base game plus the Surrounded and Stasis additional content. After a global apocalypse, you take on the role of protecting four family members living in a desertedSheltered is a deep, emotional survival & post-apocalyptic disaster management game. On Nintendo Switch™, Sheltered includes the base game plus the Surrounded and Stasis additional content. After a global apocalypse, you take on the role of protecting four family members living in a deserted underground shelter. Their well-being and survival are your responsibility. One bad decision and a loved one is gone, forever. Combat claustrophobia, radiation and mental exhaustion as you try to turn the cold and cramped Shelter into a home. And as they cling desperately to life, you must defend your shelter from attack and send family members out into the dangerous, desolate wasteland to scavenge for vital supplies. You’ll come across abandoned towns, roaming factions and feral beasts as you fight for survival. How you handle the many moral choices could be the difference between the family living or dying. With all hope lost, how will you survive in this bleak new world?\r… Expand"}, {"name": "Deadbeat Heroes", "details_link": "https://www.metacritic.com/game/xbox-one/deadbeat-heroes", "publisher": "Square Enix", "release_date": "Oct 10 2017", "developers": ["Deadbeat Studios"], "platforms": ["PC", "Xbox One"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/5c4d40ec89d489dbe4251b222ff6d8a9-98.jpg", "descriptions": "London's Super Heroes have been vanquished. Only the Deadbeat Heroes can put an end to dastardly evil-doers and their rotten plans!Deadbeat Heroes is a movement based 3D brawler where you (and a friend) dodge bullets, steal super powers and crack wise. You play as the new wave of 'DeadbeatLondon's Super Heroes have been vanquished. Only the Deadbeat Heroes can put an end to dastardly evil-doers and their rotten plans!Deadbeat Heroes is a movement based 3D brawler where you (and a friend) dodge bullets, steal super powers and crack wise. You play as the new wave of 'Deadbeat Heroes'. Not born with their own powers, they are armed with a prototype super gauntlet - which has the ability to 'borrow' the powers of others. You will (both) vie to win the hearts of the public with your amazing daring do, while not getting shot, sliced, lasered, exploded, vaporized, eaten... Do you have what it takes to save London's streets?… Expand"}, {"name": "Midway Arcade Origins", "details_link": "https://www.metacritic.com/game/xbox-360/midway-arcade-origins", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov  6 2012", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/a92cf6b37482fd63023d2a22346c5da2-98.jpg", "descriptions": "Midway Arcade Origins is a compilation of more than 30 classic, genre-defining Midway titles from the golden age of arcades."}, {"name": "Scooby-Doo! Unmasked", "details_link": "https://www.metacritic.com/game/playstation-2/scooby-doo!-unmasked", "publisher": "THQ", "release_date": "Sep 12 2005", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/bdd3811eaa812984a53c5b5b912d02ae-98.jpg", "descriptions": "In this action adventure platform game, players assume the role of Scooby-Doo as he and the teenage sleuths of Mystery Inc. visit Fred's cousin Jed, a monster movie set designer.  They find Jed has disappeared and his animatronics are out of control, sending mechanical monsters haywire andIn this action adventure platform game, players assume the role of Scooby-Doo as he and the teenage sleuths of Mystery Inc. visit Fred's cousin Jed, a monster movie set designer.  They find Jed has disappeared and his animatronics are out of control, sending mechanical monsters haywire and making Jed the prime suspect.  Players must stop the creepy costumed characters, unmask the truth and prove Jed's innocence.  Scooby is able to don Kung Fu, bat and archer costumes so that he can karate chop, glide and aim plungers at monsters.  The game consists of three sprawling worlds that each feature multiple levels and mini games with numerous cut scenes and climactic boss battles.  Players recognize will the voice of the original Batman television series' Adam West as Winslow Stanton, the game's main villain, as well as authentic Scooby-Doo! cartoon voice actors.  In addition, effects from the original cartoon, such as canned laughter and classic catch phrases, have been incorporated into the game. [THQ]… Expand"}, {"name": "TMNT", "details_link": "https://www.metacritic.com/game/playstation-2/tmnt", "publisher": "Ubisoft", "release_date": "Mar 20 2007", "developers": ["Ubisoft Montreal"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/6e43e6f47ae0bab41d28ea6027582244-98.jpg", "descriptions": "Based on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they faceBased on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they face their most trying time both as heroes and as brothers. With the fate of the City and their family at stake, it's up to Leonardo with Zen Master Splinter to restore unity and ninja discipline to the Turtles. In this highly immersive experience, join the Ninja Turtles team and experience intense acrobatic navigation, collaborative combat and powerful fighting moves. Engage in over-the-top Ninja action to reunite the Turtles and save New York City. Leonardo, Raphael, Donatello and Michelangelo are playable, each with unique acrobatic moves, weapons and combat skills, such as Michelangelo’s fast nunchuk face slap and Raphael’s powerful Sai throw. [Ubisoft]… Expand"}, {"name": "Hunted: The Demon's Forge", "details_link": "https://www.metacritic.com/game/xbox-360/hunted-the-demons-forge", "publisher": "Bethesda Softworks", "release_date": "May 31 2011", "developers": ["InXile Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/a6e7731587931bf644b47df6e13fee1c-98.jpg", "descriptions": "Set in a dark fantasy world, Hunted: The Demon's Forge is an unforgettable cooperative action game, pitting you and your partner against waves of vicious enemies. Taking control of either E'lara, a ranged weapon expert, or Caddoc, a master swordsman, you must use a variety of weapons,Set in a dark fantasy world, Hunted: The Demon's Forge is an unforgettable cooperative action game, pitting you and your partner against waves of vicious enemies. Taking control of either E'lara, a ranged weapon expert, or Caddoc, a master swordsman, you must use a variety of weapons, powerful spells, and cover tactics to battle your way through menacing dungeons, overgrown ruins, and downtrodden towns. Discover secrets and complete co-op-based puzzles whilst exploring the sinister world to discover answers to the game’s deep, dark mysteries. The dark ages have become corrupted. Heinous creatures have emerged from underground. Townsfolk across the land are disappearing. Upon the promise of their fortune in gold, mercenaries E’lara and Caddoc take on the daunting task of discovering where the innocent villagers have been taken. Their journey will lead them on a dark and twisted path where they will encounter death, slavery, and sacrifice. Travel deep within the world of Kala Moor...and to the secrets of The Demon's Forge.… Expand"}, {"name": "Pac-Man World 3", "details_link": "https://www.metacritic.com/game/psp/pac-man-world-3", "publisher": "Namco", "release_date": "Dec  6 2005", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 61, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/e98dc2f72a7d799944c41274c6d3c39b-98.jpg", "descriptions": "In a mad search for power, evil genius Erwin creates a machine that can penetrate into the world of the Ghosts...the Spectral Realm! But now the Spectral Realm is collapsing into the real world, and this will bring about a massive catastrophe that will plunge the world into a state ofIn a mad search for power, evil genius Erwin creates a machine that can penetrate into the world of the Ghosts...the Spectral Realm! But now the Spectral Realm is collapsing into the real world, and this will bring about a massive catastrophe that will plunge the world into a state of devistation for years to come. After mysteriously having been transported out of Pac-Village and into this strange and different land, it is up to Pac-Man to uncover Erwin’s plot and save the world. Along the way, Pac-Man will meet a host of unexpected \"old friends,\" and in order to defeat the ultimate enemy, he might just have to turn his old foes into allies! While combining contemporary platform game mechanics with traditional Pac-Man play principles, Pac-Man World 3 features Pac-Man staples including Power Pellets, Pac-Dots, Pac-Chains and fruit while adding new elements such as a Pactrometer, power-up smoothies and several new special moves.  Players will even get to play as Pinky and Clyde, who each have distinctive special abilities. [Namco]… Expand"}, {"name": "Ninja Blade", "details_link": "https://www.metacritic.com/game/pc/ninja-blade", "publisher": "Noviy Disk", "release_date": "Oct 31 2009", "developers": ["From Software"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern", "Linear"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/1d5995cebd99ed33bfdbe2c07c7c844e-98.jpg", "descriptions": "Ninja Blade is an action adventure game set within modern day Tokyo. Parasites known as alpha-worms have mysteriously appeared, unleashing a wave of human destruction as they rapidly spread east, reaching the shores of Tokyo. With the future of humankind hanging in the balance, an exclusiveNinja Blade is an action adventure game set within modern day Tokyo. Parasites known as alpha-worms have mysteriously appeared, unleashing a wave of human destruction as they rapidly spread east, reaching the shores of Tokyo. With the future of humankind hanging in the balance, an exclusive and elite team possessing highly specialized skills is formed to eliminate the enemy onslaught, and ultimately save mankind from complete obliteration. Unique ninja abilities: Use your Ninja Vision to detect and analyze potential enemy weak points, secret paths, and hidden information within the environment, but be careful, as you are susceptible to extra damage while using your vision. And perform the todomé attack to destroy an enemy's core (heart), by dealing a fatal wound. Balanced and calculated use of both these abilities will be critical to progressing through the game. Variety of weapons, tools, and Ninjutsu: Specialized ninja powers offer an enticing array of options.… Expand"}, {"name": "Mini Ninjas", "details_link": "https://www.metacritic.com/game/ds/mini-ninjas", "publisher": "Eidos Interactive", "release_date": "Sep  8 2009", "developers": ["Magic Pockets"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 61, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/a0c9abb657d01bc38c4138308fe64598-98.jpg", "descriptions": "Prepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magicalPrepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magical army of evil Samurai. Harness the power of your Kuji magic and utilise the special skills of your Mini Ninja friends as you travel through a perilous world to reach the final confrontation with the Evil Samurai Warlord in his Fortress of Doom.… Expand"}, {"name": "Over the Hedge", "details_link": "https://www.metacritic.com/game/gamecube/over-the-hedge", "publisher": "Activision", "release_date": "May  9 2006", "developers": ["Edge of Reality"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/a9c3f3dd113680dac9c465b72ee53c51-98.jpg", "descriptions": "When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals,When a housing development intrudes on their woodland habitat and an opossum is kidnapped by an evil exterminator, three wise-cracking rodents and one very neurotic reptile invade the 'burbs in a quest to rescue their friend. Battle the exterminator and his army of mind-controlled mammals, and save the forest (and your own hide) from the world's peskiest critter-man.… Expand"}, {"name": "Ganryu 2: Hakuma Kojiro", "details_link": "https://www.metacritic.com/game/switch/ganryu-2-hakuma-kojiro", "publisher": "Pixelheart", "release_date": "Apr 22 2022", "developers": ["Storybird"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/fa1508ab1f6c062625cc64b719ad811d-98.jpg", "descriptions": "Ganryu 2 is a 2D platformer at its best! It is the sequel to the Ganryu game made by VISCO Corporation on NEOGEO back in 1999. The universe takes place in a feudal fantasy Japan which is strongly inspired by the story of Takezo Musashi, whose adventures are unfolded in a series of booksGanryu 2 is a 2D platformer at its best! It is the sequel to the Ganryu game made by VISCO Corporation on NEOGEO back in 1999. The universe takes place in a feudal fantasy Japan which is strongly inspired by the story of Takezo Musashi, whose adventures are unfolded in a series of books (mainly The Stone and the Sword). Play as Miyamoto Musashi and travel through a 17th century fantasy Japan, from north to south to the island of Ganryu-jima where everything happened between Musashi and Kojiro.… Expand"}, {"name": "Terminator: Resistance - Annihilation Line", "details_link": "https://www.metacritic.com/game/pc/terminator-resistance---annihilation-line", "publisher": "Reef Entertainment", "release_date": "Dec 10 2021", "developers": ["Teyon"], "platforms": ["PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 61, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/314c3c156075cd18d889a45582e2ce82-98.jpg", "descriptions": "Venture beyond the line of fire to complete an essential mission led by hero of the resistance Kyle Reese.ANNIHILATION LINE picks up mid-way through the main campaign story. The Resistance has just defeated their first Infiltrator, but for Jacob Rivers, there's no time to rest up. OrdersVenture beyond the line of fire to complete an essential mission led by hero of the resistance Kyle Reese.ANNIHILATION LINE picks up mid-way through the main campaign story. The Resistance has just defeated their first Infiltrator, but for Jacob Rivers, there's no time to rest up. Orders have come down from John Connor himself that he is to assist in the investigation of Northridge Outpost, a civilian settlement which has mysteriously gone silent.Why did no-one from Northridge attempt to radio in? Is this the work of Skynet? And are the civilians still alive? To find answers, Rivers and a small team of Resistance soldiers led by Connor's right-hand man Kyle Reese, must head into the most dangerous territory imaginable...the land beyond the Annihilation Line.… Expand"}, {"name": "Panorama Cotton", "details_link": "https://www.metacritic.com/game/switch/panorama-cotton", "publisher": "ININ Games", "release_date": "Oct 29 2021", "developers": ["Success", "ININ Games"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/0845eac9909ae12bbb17656d9e116c27-98.jpg", "descriptions": "Panorama Cotton is an addictive, pseudo-3D rail shooter, adding an intriguing new twist to the Cotton franchise. When a burnt willow suddenly appears in the Queen's garden, the behavior of her highness begins to get stranger and stranger. Cotton and Silk go on a journey to find the evilPanorama Cotton is an addictive, pseudo-3D rail shooter, adding an intriguing new twist to the Cotton franchise. When a burnt willow suddenly appears in the Queen's garden, the behavior of her highness begins to get stranger and stranger. Cotton and Silk go on a journey to find the evil willow burner and bring an end to the disaster. … Expand"}, {"name": "Island Time VR", "details_link": "https://www.metacritic.com/game/playstation-4/island-time-vr", "publisher": "Flight School Studio", "release_date": "Apr  3 2018", "developers": ["Flight School Studio"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 61, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/e742dc12ab77694801244339f8805a03-98.jpg", "descriptions": "After a journey at sea, you are shipwrecked on a tiny island. Using your wit, ingenuity, and the advice of Carl the Crab, you must find a way to keep yourself from starving and survive."}, {"name": "The Dark Eye: Demonicon", "details_link": "https://www.metacritic.com/game/pc/the-dark-eye-demonicon", "publisher": "Kalypso", "release_date": "Oct 24 2013", "developers": ["Noumena Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/6eeab65cfc7c96a16a4e2ded7dbcef80-98.jpg", "descriptions": "Demonicon tells the tragic story of a brother and sister who become pawns of sinister forces in a world of cruelty and depravity.  In this bleak yet magical world, their affection is both a blessing and a curse.  Both are constantly threatened by mortal danger and demonic temptation, andDemonicon tells the tragic story of a brother and sister who become pawns of sinister forces in a world of cruelty and depravity.  In this bleak yet magical world, their affection is both a blessing and a curse.  Both are constantly threatened by mortal danger and demonic temptation, and must find a way through their tortured lives by facing serious moral decisions.  Their common destiny will determine that of the entire continent, and will be decided by the choices they make.  Hordes of fiends block their way to freedom and peace, and only through battle and magic they will truly become free of the darkness. … Expand"}, {"name": "Unchained Blades", "details_link": "https://www.metacritic.com/game/psp/unchained-blades", "publisher": "XSEED Games", "release_date": "Jun 26 2012", "developers": ["FuRyu"], "platforms": ["3DS", "PSP"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/9b0bd1b8202aa49908e8af3e194f9c1f-98.jpg", "descriptions": "Though Fang is already renowned as the ruthless and feared Dragon Emperor, his lust for strength brings him to the doorsteps of the great Goddess Clunea.\r When he arrogantly demands that she find him a fitting opponent to defeat, the offended creator banishes him to crawl upon the groundThough Fang is already renowned as the ruthless and feared Dragon Emperor, his lust for strength brings him to the doorsteps of the great Goddess Clunea.\r When he arrogantly demands that she find him a fitting opponent to defeat, the offended creator banishes him to crawl upon the ground in a weakened state. Now Fang must traverse dangerous living temples of the Goddess' creation, known as Titans, in order to meet his maker once again and exact his revenge. But he cannot do it alone...… Expand"}, {"name": "Smash Cars", "details_link": "https://www.metacritic.com/game/playstation-3/smash-cars", "publisher": "Metro3D", "release_date": "Aug 20 2009", "developers": ["Creat Studios"], "platforms": ["PC", "PlayStation 3"], "num_players": "Up to 6 ", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 61, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/a411dc7648dbc935a7e13ca1c98144d6-98.jpg", "descriptions": "[Playstation Network]  Get behind the wheel of your own RC car and be the first to the finish or nail some crazy stunts. Take 13 awesome toy cars across 13 expansive living levels, move up the ranks, win upgrades and find hidden secrets and shortcuts. Watch out or you might get too close to[Playstation Network]  Get behind the wheel of your own RC car and be the first to the finish or nail some crazy stunts. Take 13 awesome toy cars across 13 expansive living levels, move up the ranks, win upgrades and find hidden secrets and shortcuts. Watch out or you might get too close to an unruly crocodile or a punk skateboarder. [SCEA]… Expand"}, {"name": "Dead to Rights: Retribution", "details_link": "https://www.metacritic.com/game/xbox-360/dead-to-rights-retribution", "publisher": "Namco Bandai Games America", "release_date": "Apr 27 2010", "developers": ["Volatile Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 61, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/6accbf6c25080ddb1f77c4b9f797d4e2-98.jpg", "descriptions": "Thrusting players into a mature neo-noir crime drama as a vice cop Jack Slate and his canine companion Shadow, the game introduces new gameplay elements that unify the third person shooting and brawling genres for a brutal and relentless new action-driven experience. Returning to Grant City,Thrusting players into a mature neo-noir crime drama as a vice cop Jack Slate and his canine companion Shadow, the game introduces new gameplay elements that unify the third person shooting and brawling genres for a brutal and relentless new action-driven experience. Returning to Grant City, a boom town gone bust that is falling to the worst excesses of crime, greed and corruption; Dead to Rights: Retribution follows vice cop Jack Slate as he fights to expose shadowy figures that stops at nothing to exert their deadly influence over the crumbling metropolis. Dead to Rights: Retribution forms an original story portraying key events that shape and define Jack Slate's character including how he and Shadow first come together as partners against those who would bring the once great city to its knees. Introducing an innovative new hybrid combat system, Dead to Rights: Retribution puts the full combat potential of a highly trained, highly agitated law-enforcement officer into players’ hands. Use your sidearm to pick off enemies from a distance, take cover and blind-fire with the game’s new ranged combat mechanics, or push the issue by taking human shields, stealing weapons with special disarm moves or dishing out Jack’s own brutal brand of justice with deadly takedown moves. Jack is equally lethal in close-quarters combat, offering players branching melee combos, counterattacks and disarms as they take the fight to the criminal element of Grant City. Jack encounters a variety of ruthless gangs in the filthy slums and menacing alleys of Grant City, each with their own unique abilities and fighting style that test his resolve to crush their murderous stranglehold. Deadly on their own, Jack and Shadow are even more formidable as they team up to defeat the threats they uncover.  Players take full control of not only Jack, but also Shadow at various points in the game to stalk enemies or reach areas of the environment that are not accessible by one or the other. Shadow’s heightened senses make him skilled in detecting new threats or flushing out enemies from cover so that Jack can easily dispense with them. [Namco Bandai Games]… Expand"}, {"name": "The Guild 2", "details_link": "https://www.metacritic.com/game/pc/the-guild-2", "publisher": "Aspyr", "release_date": "Oct 12 2006", "developers": ["4Head Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/2d2ee6b82e0e9c7a4681884e8d64de07-98.jpg", "descriptions": "Is it a life simulation? Yes, it is! Is it an RPG? An action game? Most definitely so. And the best thing is...you are the main character. Go back to the dark middle ages and found a new dynasty. Take care of yourself, because your opponents never sleep. Marry a beautiful wife and make newIs it a life simulation? Yes, it is! Is it an RPG? An action game? Most definitely so. And the best thing is...you are the main character. Go back to the dark middle ages and found a new dynasty. Take care of yourself, because your opponents never sleep. Marry a beautiful wife and make new friends...control your life. Hand down your skills and your descendants will greatly appreciate it. Live your life as preacher, thief, craftsman, outcast or aristocrat...it's up to you. Everything's realtime. Walk around the streets and accidentally watch an execution of a prisoner or a rich merchant being robbed by one of your opponents. Build your own character. State-of-the-art role playing features allow you to create your own unique character and play in a party of up to 3 members with different strengths and weaknesses.… Expand"}, {"name": "F1 2015", "details_link": "https://www.metacritic.com/game/pc/f1-2015", "publisher": "Codemasters", "release_date": "Jul  9 2015", "developers": ["Codemasters"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 61, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/2/f1dcb515829d126b55363ce92515db35-98.jpg", "descriptions": "Honda returns and once more forges an alliance with McLaren, which also welcomes back Fernando Alonso. Sebastien Vettel moves to Ferrari and, alongside a new generation of exciting young drivers on the grid, will attempt to halt the winning start Mercedes have made in the new era of FORMULAHonda returns and once more forges an alliance with McLaren, which also welcomes back Fernando Alonso. Sebastien Vettel moves to Ferrari and, alongside a new generation of exciting young drivers on the grid, will attempt to halt the winning start Mercedes have made in the new era of FORMULA 1. The race calendar for 2015 also features a new circuit, with a return to Mexico for the first time in over 20 years.… Expand"}, {"name": "Gretzky NHL", "details_link": "https://www.metacritic.com/game/psp/gretzky-nhl", "publisher": "SCEA", "release_date": "Mar 14 2005", "developers": ["Page 44 Studios"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim", "Sim"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/8cb42a21ab74c16b95a56e5b0d0bc187-98.jpg", "descriptions": "Officially licensed by the NHL and NHLPA, Gretzky NHL for the PSP features fast-paced skating, precision passing, bone-jarring checks and players that convey the power and emotion of their sport. The game offers the Gretzky Challenge with unlockable, playable Gretzkys from his days as anOfficially licensed by the NHL and NHLPA, Gretzky NHL for the PSP features fast-paced skating, precision passing, bone-jarring checks and players that convey the power and emotion of their sport. The game offers the Gretzky Challenge with unlockable, playable Gretzkys from his days as an Edmonton Oiler, Los Angeles King or New York Ranger. Additionally, hockey fans can play a quick game in either Quick Start or Exhibition Mode, act as owners in Season Mode, or compete locally against friends or other hockey fans in head-to-head play via wireless multiplayer connectivity. By combining authentic gameplay, intuitive play controls and an enhanced presentation with the fast, fluid, hard-hitting intensity of arcade style play, Gretzky NHL for the PSP delivers the look, feel and passion of hockey and provides gamers with a true-to-life simulation. [SCEA]… Expand"}, {"name": "The Hobbit", "details_link": "https://www.metacritic.com/game/gamecube/the-hobbit", "publisher": "Sierra Entertainment", "release_date": "Nov 11 2003", "developers": ["Inevitable Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 61, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/45a1203d3756c38e6a88eae9d5bd86cd-98.jpg", "descriptions": "Set in the mythical world of Middle-earth, The Hobbit is an introductory tale to the Lord of the Rings trilogy.  You control Bilbo Baggins as he travels from his peaceful Hobbit hole in Hobbiton into the dark and harrowing Mirkwood forest and finally to the Lonely Mountain, the home of SmaugSet in the mythical world of Middle-earth, The Hobbit is an introductory tale to the Lord of the Rings trilogy.  You control Bilbo Baggins as he travels from his peaceful Hobbit hole in Hobbiton into the dark and harrowing Mirkwood forest and finally to the Lonely Mountain, the home of Smaug the dragon.  During your journey, you will acquire items, knowledge, and courage to face the most terrifying of enemies.  Come face-to-face with elves, trolls, orcs, spiders, and wolves.  It's up to you to lead the quest that started it all.  … Expand"}, {"name": "Nexagon: Deathmatch", "details_link": "https://www.metacritic.com/game/pc/nexagon-deathmatch", "publisher": "Strategy First", "release_date": "Jul 23 2003", "developers": ["Strategy First"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/a36c38a939ca30e1e982ec2233e281e3-98.jpg", "descriptions": "Since the late 25th century, Earth's population has skyrocketed, and the face of our blue planet has been transformed into a complex grid of concrete, polymers and steel. Oxygen trickles into the atmosphere by virtue of precious biospheres that dot the skies in a suspended fragile meshSince the late 25th century, Earth's population has skyrocketed, and the face of our blue planet has been transformed into a complex grid of concrete, polymers and steel. Oxygen trickles into the atmosphere by virtue of precious biospheres that dot the skies in a suspended fragile mesh several miles above the surface. Humans toil and commute along side the masses of alien races that have since inhabited Earth's centres. Together they have concocted the most voluble and copious of environments known to mankind since the Garden of Eden. At the turn of the fourth millennium, pessimistic speculation led philosophers to believe that Earth was bound for troubled times and that great suffering would engulf the helpless inhabitants. As usual, they were wrong. In fact, in the years following the brutish skirmishes near the Orion Nebula, a strong feeling of general well being seemed to permeate even into the darkest corners of parliament, where a wild and daring decision concerning the treatment of prisoners was made; a chance for freedom that would supply the Galaxy with an extraordinary new form of entertainment ... THE PIT. [Strategy First]… Expand"}, {"name": "Soldier of Fortune II: Double Helix", "details_link": "https://www.metacritic.com/game/xbox/soldier-of-fortune-ii-double-helix", "publisher": "Activision", "release_date": "Jun 18 2003", "developers": ["Gratuitous Games"], "platforms": ["PC", "Xbox"], "num_players": "1-12 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 61, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/6b60350989d6798907a49fd9bb04a328-98.jpg", "descriptions": "Soldier of Fortune II: Double Helix plunges you into the secret and deadly world of the modern-day mercenary. You'll have 25 authentic military weapons, including machine guns, grenade launchers, and sniper rifles, at your disposal. Test them out against enemies that are scattered acrossSoldier of Fortune II: Double Helix plunges you into the secret and deadly world of the modern-day mercenary. You'll have 25 authentic military weapons, including machine guns, grenade launchers, and sniper rifles, at your disposal. Test them out against enemies that are scattered across real-world hotspots from the jungles of Colombia to the frozen wastelands of Kamchatka. Soldier of Fortune II: Double Helix provides 55 single-player maps and 20 multiplayer maps to keep your finger on the trigger.… Expand"}, {"name": "Whirl Tour", "details_link": "https://www.metacritic.com/game/gamecube/whirl-tour", "publisher": "VU Games", "release_date": "Nov 12 2002", "developers": ["Papaya Studios"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/6a14666a514ac0a3f13b8b87a4c60d25-98.jpg", "descriptions": "'Flipside' is giving a stunning performance at Castle Coliseum. Suddenly in the middle of the band's finale an audible power surge occurs, and lightning strikes each of the 6 band members. One after another they are vacuumed into the sky. The band's roadie shakes his head in disbelief.'Flipside' is giving a stunning performance at Castle Coliseum. Suddenly in the middle of the band's finale an audible power surge occurs, and lightning strikes each of the 6 band members. One after another they are vacuumed into the sky. The band's roadie shakes his head in disbelief. \"I have to find them!!!\" He jumps through a color-shifting portal, grabs his scooter and rides off to search for his idols.… Expand"}, {"name": "The Simpsons Road Rage", "details_link": "https://www.metacritic.com/game/xbox/the-simpsons-road-rage", "publisher": "Electronic Arts", "release_date": "Dec  1 2001", "developers": ["Fox Interactive"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 61, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/2e8b34e4e282766aa8abfe113735fb6c-98.jpg", "descriptions": "Mr.  Burns is up to his greedy ways in Simpsons Road Rage, purchasing Springfield's busses and jacking up the fares.  Now, Springfield residents must turn their cars into cabs and work the streets.  Hopefully, making enough money to buy back the busses before the clock runs out.  Choose fromMr.  Burns is up to his greedy ways in Simpsons Road Rage, purchasing Springfield's busses and jacking up the fares.  Now, Springfield residents must turn their cars into cabs and work the streets.  Hopefully, making enough money to buy back the busses before the clock runs out.  Choose from over 30 of your favorite Simpsons characters and brave the jam-packed streets of six huge levels, performing big-air and powerslide stunts.  Compete for passengers in two-player, split screen action.  Go on a road rage, Simpsons-style.  … Expand"}, {"name": "Disney's Tarzan Untamed", "details_link": "https://www.metacritic.com/game/gamecube/disneys-tarzan-untamed", "publisher": "Ubisoft", "release_date": "Nov 17 2001", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/8ef94eb60f20bdbc347d9899a809f3a4-98.jpg", "descriptions": "As the primal action hero Tarzan, use extreme athletic skills through the dense jungle to rescue your animal friends from vicious poachers."}, {"name": "Illbleed", "details_link": "https://www.metacritic.com/game/dreamcast/illbleed", "publisher": "AIA", "release_date": "Apr 16 2001", "developers": ["Crazy Games"], "platforms": "Dreamcast", "genres": ["Action Adventure", "Horror"], "meta_score": 61, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/b16a49d48cc9b1c9e838688e1a281021-98.jpg", "descriptions": "Imagine, if you will, a berserk B-movie horror film producer with a twisted sense of humor who puts up a million bucks (fictitious, of course!) to anyone who can survive his 7 movie-themed worlds. It's a bloody mess of mutant monsters, over 1000 traps and items, and abject terror fused withImagine, if you will, a berserk B-movie horror film producer with a twisted sense of humor who puts up a million bucks (fictitious, of course!) to anyone who can survive his 7 movie-themed worlds. It's a bloody mess of mutant monsters, over 1000 traps and items, and abject terror fused with B-movie humor. You must rely solely on the game's sensory feedback (eyesight, hearing, smell, sixth sense) and the hard-to-find \"Horror Monitor\" to survive the epic adventure! Illbleed delivers a badly needed transfusion to the \"been there, done that\" horror game genre.… Expand"}, {"name": "BANG! Gunship Elite", "details_link": "https://www.metacritic.com/game/dreamcast/bang!-gunship-elite", "publisher": "Red Storm Entertainment", "release_date": "Dec 18 2000", "developers": ["Rayland Interactive"], "platforms": ["PC", "Dreamcast"], "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 61, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/0d0632157283485b798c6b7a1a0eec7e-98.jpg", "descriptions": "You've never experienced anything like BANG! Gunship Elite. Incredible rendering techniques, a real-time 3-D universe, expansive galaxies, aliens, asteroids, mammoth vessels, aggressive fighters and powerful weapons make this the action game your universe is clamoring for!"}, {"name": "Jump Force", "details_link": "https://www.metacritic.com/game/xbox-one/jump-force", "publisher": "Bandai Namco Games", "release_date": "Feb 15 2019", "developers": ["Spike Chunsoft Co. Ltd.", "Spike Chunsoft"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "General", "Action", "Fighting", "3D"], "meta_score": 61, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/423bb959b0006d30edffe42dea222ec9-98.jpg", "descriptions": "For the first time ever, the most famous Manga heroes are thrown into a whole new battleground: our world. Uniting to fight the most dangerous threat, the Jump Force will bear the fate of the entire human kind. Celebrating the 50th Anniversary of the famous Weekly Jump Magazine, Jump ForceFor the first time ever, the most famous Manga heroes are thrown into a whole new battleground: our world. Uniting to fight the most dangerous threat, the Jump Force will bear the fate of the entire human kind. Celebrating the 50th Anniversary of the famous Weekly Jump Magazine, Jump Force is also making the most of latest technologies to bring characters to life in a never-seen-before realistic design. A unique setting, merging the Jump World and the Real World.  The Jump Force, an alliance of the most powerful Manga heroes from Dragon Ball, One Piece, Naruto and much more. Realistic graphics bring Manga characters to life like never before. [Bandai Namco]… Expand"}, {"name": "From Russia With Love", "details_link": "https://www.metacritic.com/game/psp/from-russia-with-love", "publisher": "Electronic Arts", "release_date": "Apr  3 2006", "developers": ["Rebellion"], "platforms": ["PlayStation 2", "PSP"], "num_players": "1-6 ", "genres": ["Action", "Action Adventure", "Shooter", "General", "Shooter", "Modern", "Third-Person", "Modern", "Arcade"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/59112bf692d58f5b1da86de07ef7e151-98.jpg", "descriptions": "Set in the original 60's Bond era, the game features movie-based missions as well as original, action-intensive sequences, a broad and deep variety of gameplay, fully-integrated vehicles, social multiplayer experiences, gorgeous women, and classic, upgradeable weapons and gadgetry withSet in the original 60's Bond era, the game features movie-based missions as well as original, action-intensive sequences, a broad and deep variety of gameplay, fully-integrated vehicles, social multiplayer experiences, gorgeous women, and classic, upgradeable weapons and gadgetry with modern mechanics. Players will create and manipulate Bond in a living world based on the timeless fiction of the classic James Bond movie. Invest in your character and customize the ultimate Bond for a whole new level of gameplay options. Sean Connery, the original Bond, reprises his role as the dapper Mi6 agent in this innovative, retro-styled and highly anticipated console title from the infamous Bond franchise.… Expand"}, {"name": "Fahrenheit: Indigo Prophecy Remastered", "details_link": "https://www.metacritic.com/game/pc/fahrenheit-indigo-prophecy-remastered", "publisher": "Aspyr", "release_date": "Jan 28 2015", "developers": ["Aspyr"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Adventure", "3D", "Third-Person"], "meta_score": 61, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/5c1cbdab8083bef112584ef040e6bb08-98.jpg", "descriptions": "With a multilayered narrative, innovative presentation, and a musical score by famed Hollywood composer Angelo Badalementi, Fahrenheit: Indigo Prophecy Remastered serves as the definitive version of the supernatural murder mystery and (re)introduces the title to old and new fans alike."}, {"name": "F1 Race Stars: Powered Up Edition", "details_link": "https://www.metacritic.com/game/wii-u/f1-race-stars-powered-up-edition", "publisher": "Codemasters", "release_date": "Jan 16 2014", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Formula One", "Formula One", "Automobile"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/db6b9ed9ca0994d6fd53508bbc484def-98.jpg", "descriptions": "F1 Race Stars is a fast-to-the-fun arcade racing game for all ages."}, {"name": "Wanted: Weapons of Fate", "details_link": "https://www.metacritic.com/game/playstation-3/wanted-weapons-of-fate", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar 24 2009", "developers": ["GRIN"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/425b457f9d1214af7bbe606f387e1551-98.jpg", "descriptions": "Based on Universal Pictures' action-thriller Wanted, this game promises to deliver the same fantastic visual style, in-your-face attitude and edge-of-your-seat action as the blockbuster motion picture. The game continues the story of hero Wesley Gibson, picking up the action where the filmBased on Universal Pictures' action-thriller Wanted, this game promises to deliver the same fantastic visual style, in-your-face attitude and edge-of-your-seat action as the blockbuster motion picture. The game continues the story of hero Wesley Gibson, picking up the action where the film leaves off and creating an entirely new chapter exploring both Wesley's journey to becoming an unmatched überassassin and the epic fiction of \"The Fraternity.\" Featuring intense third-person action, the Wanted video game will take combat to the next level with iconic moves -- such as \"Curving Bullets\" and \"Assassin Time\" -- drawn directly from the film, as well as an innovative, multi-layered cover mechanic.… Expand"}, {"name": "Root Beer Tapper", "details_link": "https://www.metacritic.com/game/xbox-360/root-beer-tapper", "publisher": "Midway", "release_date": "Feb  7 2007", "developers": ["Digital Eclipse"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/a764052a37e21940398041b295714967-98.jpg", "descriptions": "[Xbox Live Arcade]  Get ready to serve! Rediscover the classic arcade game Root Beer Tapper on Xbox Live. Take on a room full of thirsty folks and keep their mugs full as they belly up to the bar, but don't drop the empties if you want to win. Classic gameplay: Take on a bar full of thirsty[Xbox Live Arcade]  Get ready to serve! Rediscover the classic arcade game Root Beer Tapper on Xbox Live. Take on a room full of thirsty folks and keep their mugs full as they belly up to the bar, but don't drop the empties if you want to win. Classic gameplay: Take on a bar full of thirsty folks and see if you can keep their mugs full. Grab the empty mugs before they slide off the bar, and earn extra points by collecting tips. Bonus rounds: Locate and open the one can that has not been shaken-up and serve it up to waiting patrons in the bonus rounds. Play online in either co-op or versus modes and post scores on the Xbox Live leaderboards.  The best scores are kept for the current week and for all time for both co-op and versus matches. Score 12 achievements worth 200 gamerscore points. [Midway]… Expand"}, {"name": "JoJo's Bizarre Adventure: Eyes of Heaven", "details_link": "https://www.metacritic.com/game/playstation-4/jojos-bizarre-adventure-eyes-of-heaven", "publisher": "Bandai Namco Games", "release_date": "Jun 28 2016", "developers": ["CyberConnect2"], "platforms": "PlayStation 4", "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 61, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/e8e5ae53895bd874f68e0f48c01fe74e-98.jpg", "descriptions": "Featuring a new two-on-two battle system, larger arenas, more characters, all the DLC previously released in Japan, and a new scenario from Hirohiko Araki’s epic series, get ready to experience the House of Joestar like never before."}, {"name": "Metal Max Xeno", "details_link": "https://www.metacritic.com/game/playstation-4/metal-max-xeno", "publisher": "NIS America", "release_date": "Sep 25 2018", "developers": ["Cattle Call", "24Frame"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 61, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/d924faa782ef979a822df93723290514-98.jpg", "descriptions": "Metal Max Xeno is a post-apocalyptic RPG. Collect and customize tanks to battle mutated creatures and robotic enemies."}, {"name": "Lost Planet 3", "details_link": "https://www.metacritic.com/game/pc/lost-planet-3", "publisher": "Capcom", "release_date": "Aug 26 2013", "developers": ["Spark Unlimited"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/c838c1ca675a7f08b1f78b37cfa83439-98.jpg", "descriptions": "Lost Planet 3 is the third entry in the Lost Planet series. With a variety of multiplayer modes and a cinematic single player experience, Lost Planet 3 dives deeper into the Lost Planet universe, uncovering hidden truths within the unique environment of E.D.N. III."}, {"name": "Jeremy McGrath's Offroad", "details_link": "https://www.metacritic.com/game/playstation-3/jeremy-mcgraths-offroad", "publisher": "D3Publisher", "release_date": "Jun 26 2012", "developers": ["2XL Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/0426d26a99e7df888f4524a1cd1432f7-98.jpg", "descriptions": "In Jeremy McGrath's Offroad, players race four-wheeled, 800-horsepower off-road race trucks with tons of options."}, {"name": "Monster Jam Steel Titans 2", "details_link": "https://www.metacritic.com/game/playstation-4/monster-jam-steel-titans-2", "publisher": "THQ Nordic", "release_date": "Mar  2 2021", "developers": ["Rainbow Studios", "Feld Entertainment"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/699f9de63315d56ae579715f6bf2c0e0-98.jpg", "descriptions": "Monster Jam Steel Titans 2 features more fan-favorite trucks in brand new Monster Jam worlds. Brand new online multiplayer modes, 38 trucks to choose from and five new outdoor worlds! Drivers train at Camp Crushmore and compete in authentic stadiums to become the ultimate champion. TruckMonster Jam Steel Titans 2 features more fan-favorite trucks in brand new Monster Jam worlds. Brand new online multiplayer modes, 38 trucks to choose from and five new outdoor worlds! Drivers train at Camp Crushmore and compete in authentic stadiums to become the ultimate champion. Truck roster features 38 of the greatest trucks in Monster Jam history, including Higher Education, Sparkle Smash and Grave Digger. Five all-new Monster Jam Worlds that expand the Monster Jam universe! Explore and uncover Monster Jam secrets. Compete just like the pros in 12 authentic stadiums and game modes inspired by the real-world shows!\r Perform your favorite stunts! Bicycles, Stoppies, Moonwalks, Walk Its, Cyclones, Pogos, Power Outs and Back-Flips!\r Improved Gameplay! Enjoy a range of improvements in physics, career and exploration!\"… Expand"}, {"name": "The Crew", "details_link": "https://www.metacritic.com/game/playstation-4/the-crew", "publisher": "Ubisoft", "release_date": "Dec  2 2014", "developers": ["Ubisoft Reflections", "Ivory Tower"], "platforms": ["PC", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["GT / Street", "Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 61, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/141f4c4b2151ec1d6efc678ff672c5f7-98.jpg", "descriptions": "Strap in for a ride that will find you infiltrating and taking down the 510s, a gang that has grown up amidst Detroit's illicit street racing landscape. You must establish your reputation in the underground racing scene and subvert their activities city-by-city throughout a fully-open worldStrap in for a ride that will find you infiltrating and taking down the 510s, a gang that has grown up amidst Detroit's illicit street racing landscape. You must establish your reputation in the underground racing scene and subvert their activities city-by-city throughout a fully-open world United States. Maneuver through the bustling streets of New York City and Los Angeles, drive down to sun-drenched Miami Beach, or trek through the picturesque plateaus of Monument Valley. Each location comes with its own set of surprises and driving challenges to tackle. On your journey you will confront other driver on the road - all potentially worthy companions to team up with, or future rivals to take down.… Expand"}, {"name": "E.Y.E: Divine Cybermancy", "details_link": "https://www.metacritic.com/game/pc/eye-divine-cybermancy", "publisher": "Streum On Studio", "release_date": "Jul 29 2011", "developers": ["Streum On Studio"], "platforms": "PC", "genres": ["Role-Playing", "First-Person", "Western-Style"], "meta_score": 61, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/be69e443b91b3f18835e2276a501a5f3-98.jpg", "descriptions": "After unending war with metastreumonic Force, the powerful organisation Secreta Secretorum that you belong to is finally ready to undermine the head-strong federation, despite an intense struggle for power. A dark and mysterious universe (inspired by Blade Runner, Ghost in the shell andAfter unending war with metastreumonic Force, the powerful organisation Secreta Secretorum that you belong to is finally ready to undermine the head-strong federation, despite an intense struggle for power. A dark and mysterious universe (inspired by Blade Runner, Ghost in the shell and Warhammer 40K) for hours of original gameplay thanks to 10 physical and psychic skills, 14 cybernetic and upgradable implants, along with an integrated R&D system, all serving a delicate scenario where conspiracy, horror and treason rule.… Expand"}, {"name": "Class of Heroes", "details_link": "https://www.metacritic.com/game/psp/class-of-heroes", "publisher": "Atlus", "release_date": "Jun  9 2009", "developers": ["Zerodiv"], "platforms": "PSP", "genres": ["Role-Playing", "First-Person", "General", "Western-Style"], "meta_score": 61, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/9f0275055c8b9fb10ecae937ab85b28f-98.jpg", "descriptions": "Long ago, without reason or explanation, the mysterious labyrinths came to be, and the world was changed forever.  In a constant state of flux, they sprawl across the world like a web, connecting towns and villages, mountains, lakes, and deserts.  Many adventurers delved into theseLong ago, without reason or explanation, the mysterious labyrinths came to be, and the world was changed forever.  In a constant state of flux, they sprawl across the world like a web, connecting towns and villages, mountains, lakes, and deserts.  Many adventurers delved into these labyrinths dreaming of riches, and those fortunate enough to return did so with amazing stories and unimaginable treasures.  It was only natural that the children of the world began to look upon these heroes with unconditional admiration, eager to follow in their footsteps.  And so, academies for adventurers were born. Particus Academy may not be the first such school, but we certainly endeavor to be the best!  Here at Particus, we strive to equip young men and women with the tools they'll need to become full-fledged adventurers.  Bravery, spellcraft, swordplay, 101 ways to avoid dying a horrible death... These and many other lessons and skills await prospective students!  We hope your studies here are as enriching and productive as you've dreamed they would be. Over 500 character possibilities - 10 races, 2 genders, 3 alignments, and 15 majors add up to incredible opportunity to customize your party!  Change majors for further customization at higher levels. 80 hours of classic dungeon crawling - This is as classic as dungeon crawling gets in an ever-changing 3-D labyrinth containing more than 75 maps full of puzzles, traps, and treasure. Battle hundreds of monster types and uncover over 1300 item types. Flexible alchemy system - Offering more than 400 recipes, this system allows you to synthesize new items from random components found in the labyrinths, as well as customize your weapons' attributes, range, and strength. [Atlus USA]… Expand"}, {"name": "Disney's Kim Possible: Kimmunicator", "details_link": "https://www.metacritic.com/game/ds/disneys-kim-possible-kimmunicator", "publisher": "Buena Vista Games", "release_date": "Nov  9 2005", "developers": ["Artificial Mind and Movement"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 61, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/6375425c1cc5f3298c499f2d9574ec1c-98.jpg", "descriptions": "Kim Possible, everyone's favorite crime-fighting cheerleader,is back in her latest action-packed adventure Disney's Kim Possible: Kimmunicator! Join Kim in a multi-part adventure that combines non-stop action and tongue-in-cheek humor with numerous appearances and cameos by classic KimKim Possible, everyone's favorite crime-fighting cheerleader,is back in her latest action-packed adventure Disney's Kim Possible: Kimmunicator! Join Kim in a multi-part adventure that combines non-stop action and tongue-in-cheek humor with numerous appearances and cameos by classic Kim Possible villains. Drakken is back, and with a vengeance! He has actually managed to kidnap Wade, forcing him to develop Yet Another Doomsday Device and depriving Kim of a key resource in her fight against evil at the same time! Step in as Wade's replacement and help Kim (and Rufus the naked mole rat) go undercover to rescue Wade and foil Drakken's fiendish plans before it's too late! [Buena Vista Games]… Expand"}, {"name": "Sacred Citadel", "details_link": "https://www.metacritic.com/game/pc/sacred-citadel", "publisher": "Deep Silver", "release_date": "Apr 16 2013", "developers": ["Southend Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 3 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 61, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/06b99b4f039a87ac860569231d1ace8b-98.jpg", "descriptions": "Sacred Citadel lets you and your friends join the resistance in order to defeat the evil Ashen empire that has enslaved its population and is using the orc-like Grimmoc to wipe out the Seraphim, who swore to protect it."}, {"name": "Aqua", "details_link": "https://www.metacritic.com/game/xbox-360/aqua", "publisher": "Microsoft Game Studios", "release_date": "May 19 2010", "developers": ["Games Distillery"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Shoot-'Em-Up", "Tactical", "Top-Down", "Modern", "Modern"], "meta_score": 61, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/4f3203a5316b3183b638d52abbc6c3e2-98.jpg", "descriptions": "[Xbox Live Arcade]  Follow the story of captain Benjamin Grey and his trusted fellow engineer Polly Edison in Aqua, as they struggle to save the Aqua world from a treacherous conspiracy, pulling the strings behind a massive conflict of two rival naval empires. In this stylish naval action[Xbox Live Arcade]  Follow the story of captain Benjamin Grey and his trusted fellow engineer Polly Edison in Aqua, as they struggle to save the Aqua world from a treacherous conspiracy, pulling the strings behind a massive conflict of two rival naval empires. In this stylish naval action shooter with tactical elements, you must steer your ship into the middle of a raging naval war, where masses of enemies and allies engage in real-time operations over large, multi-screen maps, presented in a unique distinctive steampunk art style. Destroy enemies on, above, and below the water surface, and unlock new ship types, weapons, and upgrades to enhance your ship as you progress through an entertaining story-driven campaign accompanied by beautiful hand-drawn comic sequences. Choose your tactics and form your own special squadron to support you in battle, issuing offensive and defensive orders to overcome the enemy and their defensive installations. [Microsoft]… Expand"}, {"name": "Desperate Housewives: The Game", "details_link": "https://www.metacritic.com/game/pc/desperate-housewives-the-game", "publisher": "Buena Vista Games", "release_date": "Oct  6 2006", "developers": ["Liquid Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 61, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/cc34346d1699f3f0cefe8838376b48f0-98.jpg", "descriptions": "A lifestyle simulation game for Windows based on the hit ABC show, \"Desperate Housewives\" lets you become the newest housewife on Wisteria Lane, extending the experience from the TV series through new storylines. As a new housewife, you must uncover delicious scandals and reveal someA lifestyle simulation game for Windows based on the hit ABC show, \"Desperate Housewives\" lets you become the newest housewife on Wisteria Lane, extending the experience from the TV series through new storylines. As a new housewife, you must uncover delicious scandals and reveal some shocking secrets of your own. The gameplay is a story-driven adventure, in which each episode contains unique plot points and secrets for you to uncover. [Buena Vista Games]… Expand"}, {"name": "LifeSigns: Surgical Unit", "details_link": "https://www.metacritic.com/game/ds/lifesigns-surgical-unit", "publisher": "DreamCatcher Interactive", "release_date": "Nov  6 2007", "developers": ["Spike"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Adventure", "Puzzle", "Puzzle", "General", "Puzzle", "Virtual", "Visual Novel", "General", "Career"], "meta_score": 61, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/977501be104a7a10f7656733f58b1798-98.jpg", "descriptions": "(Known as \"LifeSigns: Hospital Affairs\" in the UK/EU)  Live the exciting life of a young, motivated doctor in this simulation game where you will find out what it is like to examine, diagnose and operate on patients. With the unique features of the DS, you will use authentic medical(Known as \"LifeSigns: Hospital Affairs\" in the UK/EU)  Live the exciting life of a young, motivated doctor in this simulation game where you will find out what it is like to examine, diagnose and operate on patients. With the unique features of the DS, you will use authentic medical techniques and instruments to take pulse rates, make incisions and much more. [DreamCatcher Interactive]… Expand"}, {"name": "Stacked with Daniel Negreanu", "details_link": "https://www.metacritic.com/game/xbox/stacked-with-daniel-negreanu", "publisher": "Myelin Media", "release_date": "May 30 2006", "developers": ["5000ft"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "10  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/05c14992e62104d008ee87c5d8326f5f-98.jpg", "descriptions": "Stacked with Daniel Negreanu is a 3D poker simulation that provides both instruction and challenging AI competition. With video and in-game instructional features, the game helps you hone your No-Limit Hold 'Em skills. Computer opponents are equipped with a dynamic AI that allows them toStacked with Daniel Negreanu is a 3D poker simulation that provides both instruction and challenging AI competition. With video and in-game instructional features, the game helps you hone your No-Limit Hold 'Em skills. Computer opponents are equipped with a dynamic AI that allows them to take on specific personalities and adjust their play during the game. In Career mode, you can create your own character and take him or her up the ranks, eventually playing in larger tournaments and earning the respect of poker pros. The game also supports online play for small or large tournaments against other players. … Expand"}, {"name": ".hack//G.U. vol. 2//Reminisce", "details_link": "https://www.metacritic.com/game/playstation-2/hackgu-vol-2reminisce", "publisher": "Namco Bandai Games America", "release_date": "May  8 2007", "developers": ["CyberConnect2"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 61, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/36fb32b1453c5227dc89f0f13b88277c-98.jpg", "descriptions": "Taking place after  \".hack//G.U. Vol. 1: Rebirth,\" .hack//G.U. Vol. 2: Reminisce has players returning to the fictitious Massive Multiplayer Online (MMO) setting called \"The World\" to continue Haseo's journey as he and his friends look to escape from what has become a digital trap. After theTaking place after  \".hack//G.U. Vol. 1: Rebirth,\" .hack//G.U. Vol. 2: Reminisce has players returning to the fictitious Massive Multiplayer Online (MMO) setting called \"The World\" to continue Haseo's journey as he and his friends look to escape from what has become a digital trap. After the massive battle with Tri-Edge at the conclusion of \"Rebirth\" Haseo and friends learn they are incapable of logging out of \"The World\". As the life of one of their own hangs in the balance, Haseo’s party begins a race against time to purge game servers of corrupted data. Players will enjoy a fully upgraded battle system including new fighting styles and in-depth party and steam bike customization. Unique to Reminisce, a new mini card game called Crimson VS provides players with the opportunity to collect cards, compile the ultimate deck and compete against others in Crimson VS tournaments throughout \"The World.\" [Namco Bandai Games]… Expand"}, {"name": "PaRappa the Rapper Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/parappa-the-rapper-remastered", "publisher": "Sony Interactive Entertainment", "release_date": "Apr  4 2017", "developers": ["NanaOn-Sha", "Sony Interactive Entertainment"], "platforms": "PlayStation 4", "genres": ["Action", "Rhythm", "Music"], "meta_score": 61, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/62e0df540563eeaacf95f74e561d77c7-98.jpg", "descriptions": "Parappa returns to win over another generation of fans with all new PSP exclusive features. Players can once again join Parappa in his quest to win the heart of Sunny Funny and learn from their favorite Rap Masters like- Chop Chop Master Onion, Instructor Mooselini, and Cheap Cheap TheParappa returns to win over another generation of fans with all new PSP exclusive features. Players can once again join Parappa in his quest to win the heart of Sunny Funny and learn from their favorite Rap Masters like- Chop Chop Master Onion, Instructor Mooselini, and Cheap Cheap The Cooking Chicken. Complete with all the music and addictive gameplay that made it an instant classic, Parappa the Rapper is sure to please fans both old and new. Play all the songs and funky characters from the original game.… Expand"}, {"name": "Dynasty Warriors 9 Empires", "details_link": "https://www.metacritic.com/game/playstation-5/dynasty-warriors-9-empires", "publisher": "Koei Tecmo Games", "release_date": "Feb 15 2022", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 61, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/386a7c5ccab154cc249764de56c2573c-98.jpg", "descriptions": "Empires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areasEmpires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areas around castles become battlefields, evolving into “Storming the Castle” instances. Employ strategic Secret Plans and balance Army Affinity to break through the enemy's gate. Defeat the enemy commander in Decisive Battle mode to claim victory of the castle. The Empires series' signature domestic system is back. With a high degree of flexibility, set long and mid term kingdom goals, recruit new officers, procure logistics, and execute a variety of military, economic and diplomatic commands to strive to unify China.… Expand"}, {"name": "Skully", "details_link": "https://www.metacritic.com/game/pc/skully", "publisher": "Modus Games", "release_date": "Aug  4 2020", "developers": ["Finish Line Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 61, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/344d1fd95bc692e0c200453969c8afe8-98.jpg", "descriptions": "On a mysterious remote island, a skull washes up on shore and is reawakened by an enigmatic deity. Dubbed Skully, the newly reanimated being has been summoned to intervene in a war between the deity’s three siblings, whose quarrel jeopardizes the island they call home."}, {"name": "Monkey King: Hero is Back", "details_link": "https://www.metacritic.com/game/playstation-4/monkey-king-hero-is-back", "publisher": "Oasis Games", "release_date": "Oct 17 2019", "developers": ["HexaDrive", "Oasis Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/4dfba512ae9e82c0089c74153b07c318-98.jpg", "descriptions": "A new chapter in the Chinese legend of Journey to the West is about to unfold! Based on the animated film Monkey King: Hero Is Back, this adaptation pits the Great Sage himself, Sun Wukong, newly freed after 500 years of imprisonment, with Liuer, a young boy who looks up to the Monkey KingA new chapter in the Chinese legend of Journey to the West is about to unfold! Based on the animated film Monkey King: Hero Is Back, this adaptation pits the Great Sage himself, Sun Wukong, newly freed after 500 years of imprisonment, with Liuer, a young boy who looks up to the Monkey King in a journey that brings them close together.… Expand"}, {"name": "Detective Gallo", "details_link": "https://www.metacritic.com/game/switch/detective-gallo", "publisher": "Adventure Productions", "release_date": "Aug 17 2018", "developers": ["Footprints Games"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 61, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/92eec2d5e9b64ccd7b4c63bcc2e8aad0-98.jpg", "descriptions": "Detective Gallo is a point-and-click comic-noir adventure that is entirely hand-illustrated and hand-animated, and whose protagonist is a feathered and grumpy private eye."}, {"name": "Earthfall", "details_link": "https://www.metacritic.com/game/pc/earthfall", "publisher": "Holospark", "release_date": "Jul 12 2018", "developers": ["Holospark"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 61, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/d4673a47b56f69bfc5d402d2356b3be9-98.jpg", "descriptions": "Earthfall is a co-operative shooter for up to four players. Using team-based tactics to fortify holdouts and complete objectives, players must work together to survive."}, {"name": "Destiny 2: Curse of Osiris", "details_link": "https://www.metacritic.com/game/pc/destiny-2-curse-of-osiris", "publisher": "Activision", "release_date": "Dec  5 2017", "developers": ["Bungie"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 61, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/1/5ffe1e563049be0bcb3ae31869da5956-98.jpg", "descriptions": "Destiny 2 Expansion I: Curse of Osiris continues your Guardian’s journey with all-new story missions and adventures set in a new destination, Mercury. Journey through time and space to learn the secrets of Osiris, avert a dark future, and rebuild the ties between the legendary Warlock andDestiny 2 Expansion I: Curse of Osiris continues your Guardian’s journey with all-new story missions and adventures set in a new destination, Mercury. Journey through time and space to learn the secrets of Osiris, avert a dark future, and rebuild the ties between the legendary Warlock and his greatest student - Ikora Rey.… Expand"}, {"name": "Ninja Shodown", "details_link": "https://www.metacritic.com/game/switch/ninja-shodown", "publisher": "Rising Star Games", "release_date": "Oct  5 2017", "developers": ["Bitmap Bureau"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 61, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/a77c5258d6e5bf516a3a223306e71592-98.jpg", "descriptions": "Retrieve the Jade Katana at all costs. It's every ninja for themselves in the ultimate battle for the Jade Katana! Fight alone, team up or take on friends in brutal arena-based combat where the mighty prevail and the weak pay the ultimate price: death and dishonour. The year is 199X and theRetrieve the Jade Katana at all costs. It's every ninja for themselves in the ultimate battle for the Jade Katana! Fight alone, team up or take on friends in brutal arena-based combat where the mighty prevail and the weak pay the ultimate price: death and dishonour. The year is 199X and the world teeters on the brink of total destruction. The mystical Jade Katana, stolen! Its power, so lethal! In the wrong hands, humanity will fall! And so the Viper Clan, sworn guardians of the Jade Katana, prepare to embark on their most perilous mission yet: retrieve the sword at all costs! Use katanas, shurikens, bombs, machine guns, shotguns, bazookas and more as you battle your way through a variety of locations to become the ultimate ninja and fulfill the ancient vow of the Viper Clan. [Nintendo]… Expand"}, {"name": "Has-Been Heroes", "details_link": "https://www.metacritic.com/game/playstation-4/has-been-heroes", "publisher": "GameTrust", "release_date": "Mar 28 2017", "developers": ["Frozenbyte", "Inc.", "GameTrust"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 61, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/ceb73b0dd016da43906701dace29ef24-98.jpg", "descriptions": "Embark on an epic journey with the Has-Been Heroes, a group of legendary champions once celebrated throughout the kingdom - almost forgotten until the King has one more quest, the most epic of them all:\r TO TAKE THE TWIN PRINCESSES TO SCHOOL!\r\n\r\nKey features:\r\n\r\n* Meet the epic band ofEmbark on an epic journey with the Has-Been Heroes, a group of legendary champions once celebrated throughout the kingdom - almost forgotten until the King has one more quest, the most epic of them all:\r TO TAKE THE TWIN PRINCESSES TO SCHOOL!\r Key features:\r * Meet the epic band of heroes as the young and eager Rogue, joining the company of the wise monk Metacles, the giant-wrestling warrior Crux... wait until you meet the others, incl. the Anthropologist turned Mexican Wrestler, the ever-vigilant and paranoid Bodyguard, and many more!\r * Unlock and collect hundreds of game-changing items and spells, boosting the heroes' powers and making each run unique!\r * Combine spells for devastating effects, learning the power of magic as you gain more elements.\r * Face countless monsters, each bigger and more menacing than the next. Can you wipe out the army of evil led by the Great Ghoul?\r * In roguelike fashion, die and try again - choose your heroes wisely and prepare for battle!… Expand"}, {"name": "Armikrog", "details_link": "https://www.metacritic.com/game/xbox-one/armikrog", "publisher": "Versus Evil", "release_date": "Aug 23 2016", "developers": ["Versus Evil", "Pencil Test Studios"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 61, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/f989af6ba580c7dba70e368719289509-98.jpg", "descriptions": "Armikrog is a point and click adventure game from indie developer studio Pencil Test."}, {"name": "Batman: Arkham Knight - A Matter of Family", "details_link": "https://www.metacritic.com/game/playstation-4/batman-arkham-knight---a-matter-of-family", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jul 14 2015", "developers": ["Rocksteady Studios", "WB Games Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Open-World"], "meta_score": 61, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/a021b0a7b2dcb096c6942f96bf76e829-98.jpg", "descriptions": "When The Joker kidnaps Commissioner Gordon and holds him hostage at the Seagate Amusement Park, Batgirl and Robin will fight against the odds to save him and avoid falling prey to The Joker’s sinister plan. Trained by Batman, Batgirl’s combat combines with unrivaled hacking abilities toWhen The Joker kidnaps Commissioner Gordon and holds him hostage at the Seagate Amusement Park, Batgirl and Robin will fight against the odds to save him and avoid falling prey to The Joker’s sinister plan. Trained by Batman, Batgirl’s combat combines with unrivaled hacking abilities to defeat enemies, control objects and solve puzzles. … Expand"}]