[{"name": "Darwinia", "details_link": "https://www.metacritic.com/game/pc/darwinia", "publisher": "Cinemaware", "release_date": "Jul 14 2005", "developers": ["Introversion"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/d63318a3d7277abcf21109ea13b46b8e-98.jpg", "descriptions": "Combining fast paced action with strategic battle planning, the game features a novel and intuitive control mechanism, a graphical style ripped from 80's retro classics, and a story concerning a tribe of video game sprites trapped in a modern 3d game world. [Introversion]"}, {"name": "Unpacking", "details_link": "https://www.metacritic.com/game/pc/unpacking", "publisher": "Witch Beam", "release_date": "Nov  2 2021", "developers": ["Witch Beam"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/f69391acb6a6afaf4692e5c4f77b01db-98.jpg", "descriptions": "Unpacking is a zen puzzle game about the familiar experience of pulling possessions out of boxes and fitting them into a new home. Part block-fitting puzzle, part home decoration, you are invited to create a satisfying living space while learning clues about the life you’re unpacking."}, {"name": "WWE SmackDown! vs. Raw 2006", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-smackdown!-vs-raw-2006", "publisher": "THQ", "release_date": "Nov 14 2005", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 84, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/f3a4aa9b9120b38ff8c618a419ac2e04-98.jpg", "descriptions": "An amazing 100 different match types to challenge your wrestling skill and from the halls of immortality, a new roster of celebrated WWE Legends. Lace up your boots for the definitive wrestling experience that is WWE SmackDown! vs RAW 2006. New high-resolution textures and integratedAn amazing 100 different match types to challenge your wrestling skill and from the halls of immortality, a new roster of celebrated WWE Legends. Lace up your boots for the definitive wrestling experience that is WWE SmackDown! vs RAW 2006. New high-resolution textures and integrated motion-capture technology brings WWE programming to life like never before. Revolutionary momentum system adds increased depth with less complexity, while the all-new stamina system brings a new level of realism and strategy to matches. Challenge players online to gain prestige in a virtual WWE Championship \rImproved cut-scenes and 2 full seasons to play without story repetition. Buried-Alive Match, Bar Brawl backstage area, a special surprise for the WWE divas and others. Fully customizable 3D locker room (first time ever in 3D), 3 levels of blood and other \"fan favorite\" first time additions. A new roster of some of your favorite legends of all time. [THQ]… Expand"}, {"name": "Super Meat Boy", "details_link": "https://www.metacritic.com/game/switch/super-meat-boy", "publisher": "Team Meat", "release_date": "Jan 11 2018", "developers": ["Team Meat"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/24fc661833a0df084a9f332468ce6e84-98.jpg", "descriptions": "Super Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux.\r Our meaty hero will leap from walls, over seas of buzz saws, through crumbling cavesSuper Meat Boy is a tough as nails platformer where you play as an animated cube of meat who's trying to save his girlfriend (who happens to be made of bandages) from an evil fetus in a jar wearing a tux.\r Our meaty hero will leap from walls, over seas of buzz saws, through crumbling caves and pools of old needles. Sacrificing his own well being to save his damsel in distress. Super Meat Boy brings the old school difficulty of classic NES titles like Mega Man 2, Ghost and Goblins and Super Mario Bros. 2 (The Japanese one) and stream lines them down to the essential no BS straight forward twitch reflex platforming.\r Ramping up in difficulty from hard to soul crushing SMB will drag Meat boy though haunted hospitals, salt factories and even hell itself. And if 300+ single player levels weren't enough SMB also throws in epic boss fights, a level editor and tons of unlock able secrets, warp zones and hidden characters.… Expand"}, {"name": "F1 2010", "details_link": "https://www.metacritic.com/game/xbox-360/f1-2010", "publisher": "Codemasters", "release_date": "Sep 22 2010", "developers": ["Codemasters Birmingham"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/999fe2ada237f1fa358e55c9b8d2cbe3-98.jpg", "descriptions": "In F1 2010 gamers will take on the full, expanded grid in a variety of game modes including Grand Prix, Championship, Time Trial and an extensive, innovative Career mode. F1 2010 will also feature a highly advanced damage model, fully dynamic weather system and extensive competitiveIn F1 2010 gamers will take on the full, expanded grid in a variety of game modes including Grand Prix, Championship, Time Trial and an extensive, innovative Career mode. F1 2010 will also feature a highly advanced damage model, fully dynamic weather system and extensive competitive multiplayer options.… Expand"}, {"name": "Puzzle Quest: Challenge of the Warlords", "details_link": "https://www.metacritic.com/game/psp/puzzle-quest-challenge-of-the-warlords", "publisher": "D3Publisher", "release_date": "Mar 20 2007", "developers": ["Vicious Cycle", "Infinite Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "PSP"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/444e03c4522eaa0ed5d6d8447750c199-98.jpg", "descriptions": "Set in the Warlords universe, Puzzle Quest challenges gamers to create, develop and customize the ultimate hero to save the land of Etheria from the evil Lord Bane. In order to advance, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinctSet in the Warlords universe, Puzzle Quest challenges gamers to create, develop and customize the ultimate hero to save the land of Etheria from the evil Lord Bane. In order to advance, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinct gameplay modes: Single-player allows gamers to battle against the computer AI as they embark on over 150 challenging quests, Instant Action allows gamers to jump in and immediately play continuous battles to level-up characters without participating in quests, and Multiplayer allows gamers to battle live opponents via wireless connectivity. Victory will advance the player’s hero, magical arsenal, creature companions and more - ultimately rewarding gamers at nearly every turn and providing endless hours of replayablity. [D3Publisher of America]… Expand"}, {"name": "Prodeus", "details_link": "https://www.metacritic.com/game/pc/prodeus", "publisher": "Bounding Box Games", "release_date": "Sep 23 2022", "developers": ["Mike and Jason", "Bounding Box Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/9006d60896ff4077bebae7df7e0cd65c-98.jpg", "descriptions": "Prodeus is the first person shooter of old, re-imagined using modern rendering techniques. It reaches the quality you expect from a AAA experience while adhering to some of the aesthetic technical limits of older hardware."}, {"name": "Ghost of Tsushima: Iki Island", "details_link": "https://www.metacritic.com/game/playstation-5/ghost-of-tsushima-iki-island", "publisher": "PlayStation Studios", "release_date": "Aug 20 2021", "developers": ["Sucker Punch"], "platforms": ["PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 84, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/ae64c84191121ea0c7d1bb2f3264f504-98.jpg", "descriptions": "If you’re a history buff, you may know that in addition to Tsushima, the neighboring island of Iki was also invaded during this time period. This island serves as the setting for a whole new chapter in Jin’s journey. In this new story, Jin travels to the island to investigate rumors of aIf you’re a history buff, you may know that in addition to Tsushima, the neighboring island of Iki was also invaded during this time period. This island serves as the setting for a whole new chapter in Jin’s journey. In this new story, Jin travels to the island to investigate rumors of a Mongol presence. But soon, he finds himself caught up in events with deeply personal stakes that will force him to relive some traumatic moments from his past. [Sony]… Expand"}, {"name": "Genshin Impact", "details_link": "https://www.metacritic.com/game/pc/genshin-impact", "publisher": "miHoYo", "release_date": "Sep 28 2020", "developers": ["miHoYo"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/6/60b816b79caf79eca805308ec89f8c0c-98.jpg", "descriptions": "Welcome to the beautiful fantasy world of Teyvat. Step into a huge open-world of adventure and mystery, where heroic quests await. As a traveller from another world, you must find your lost sibling and unravel Teyvat's many secrets. Joined by Paimon, a kind-hearted sprite guide, your missionWelcome to the beautiful fantasy world of Teyvat. Step into a huge open-world of adventure and mystery, where heroic quests await. As a traveller from another world, you must find your lost sibling and unravel Teyvat's many secrets. Joined by Paimon, a kind-hearted sprite guide, your mission takes you through beautiful forests, bustling towns, and treacherous dungeons. And while your journey may put you into the path of merciless foes and fiendish puzzles you can count on numerous playable allies to join your custom party of four, harnessing the power of the elements to overcome all obstacles. \r\rKey Features: \r\rExplore Teyvat however you want\rFly across the open-world, swim in a massive sea, climb mountains, and stray off the beaten path. Whether you decide to follow the storyline or just enjoy the gorgeous environment, Teyvat is yours to discover. \r\rAdd up to four party members\rChoose who fights by your side, with over 30 characters to meet and create your party witheach possessing different abilities, personalities, and combat styles. Will you pick Jean, the acting grand master of the knights? Or Lisa, a witch harnessing the raw force of lightning?\r Master the seven elements\rControl and combine Pyro, Hydro, Electro, Anemo, Dendro, Cryo, and Geo to solve challenging puzzles and unleash powerful attacks.\r Travel alone or hunt together\rCharge head-on into battles by yourself, or invite your friends to join the fight against dangerous monsters, and discover the secrets of this vast world together.… Expand"}, {"name": "Ni no Kuni: Wrath of the White Witch", "details_link": "https://www.metacritic.com/game/switch/ni-no-kuni-wrath-of-the-white-witch", "publisher": "Bandai Namco Games", "release_date": "Sep 20 2019", "developers": ["Level 5", "Engine Software"], "platforms": ["PlayStation 3", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/7cf5ff894e59410751de07187b1612e2-98.jpg", "descriptions": "Ni no Kuni: Wrath of the White Witch Remastered. Journey back to the other world in Ni no Kuni: Wrath of the White Witch. LEVEL-5's classic tale returns better than ever. Join Oliver as he embarks on an adventure through a world inhabited by new friends and ferocious foes alike in the hopesNi no Kuni: Wrath of the White Witch Remastered. Journey back to the other world in Ni no Kuni: Wrath of the White Witch. LEVEL-5's classic tale returns better than ever. Join Oliver as he embarks on an adventure through a world inhabited by new friends and ferocious foes alike in the hopes of bringing back his mother after a tragic incident. With a copy of the Wizard's Companion in his hand and his trusty friend Drippy by his side, he will travel across this rich fantasy world to tame familiars, take on enemies, and overcome the countless challenges that stand between him and his mother's salvation.\r Features:\r This charming tale unfolds through the use of animation storyboarded and created by the legendary Studio Ghibli and music composed by the renowned Joe Hisaishi. Ni no Kuni: Wrath of the White Witch combines beautiful animated visuals, masterful storytelling, and a sweeping score to create an epic role-playing adventure like no other.\r * TAKE THE OTHER WORLD WITH YOU - Take Ni no Kuni: Wrath of the White Witch wherever you go on Nintendo Switch\r* ALL-STAR PRODUCTION - LEVEL-5's mastery of the RPG genre is combined with Studio Ghibli's world-class animation and\rmusic composed by the renowned Joe Hisaishi\r* CAPTIVATING STORY - A charming yet tragic tale unfolds through the use of animation storyboarded and created by Studio\rGhibli with English and Japanese voice-overs\r* ROLE-PLAYING MASTERY - A rich mixture of familiar RPG elements, expertly crafted and designed, and featuring dozens of\rlocations to explore, hundreds of creatures to battle, and a wealth of quests and secrets to uncover\r* DYNAMIC COMBAT - Switch freely between characters and familiars in an exciting battle system that combines real-time and\rturn-based tactical elements… Expand"}, {"name": "Yoku's Island Express", "details_link": "https://www.metacritic.com/game/pc/yokus-island-express", "publisher": "Villa Gorilla", "release_date": "May 29 2018", "developers": ["Villa Gorilla"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/e5f288608d4e8fd0ee2f643be6ce82a2-98.jpg", "descriptions": "Yoku’s Island Express is an open world/metroidvania-style pinball adventure, Seamlessly blending platform navigation with pinball mechanics across a large open world."}, {"name": "Dark Souls Remastered", "details_link": "https://www.metacritic.com/game/pc/dark-souls-remastered", "publisher": "Namco Bandai Games", "release_date": "May 23 2018", "developers": ["From Software"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/ffafe526a0ae262f299f565fc9736e81-98.jpg", "descriptions": "Embark upon an epic dark fantasy in a universe stricken by decline and the Curse. Explore its intricate world design - full of hidden passages, dungeons and secrets - and uncover its deeply rooted lore."}, {"name": "World of Goo", "details_link": "https://www.metacritic.com/game/switch/world-of-goo", "publisher": "Tomorrow Corporation", "release_date": "Mar 16 2017", "developers": ["Tomorrow Corporation"], "platforms": ["iPhone/iPad", "PC", "Switch"], "genres": ["Puzzle", "Action"], "meta_score": 84, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/9cf48f361c0032948ba8a93e4b73cb2e-98.jpg", "descriptions": "The millions of Goo Balls who live in the World of Goo are curious to explore - but they don't know that they are in a game, or that they are extremely delicious. Mysterious Levels - Each level is strange and dangerously beautiful, introducing new puzzles, areas, and the creatures that liveThe millions of Goo Balls who live in the World of Goo are curious to explore - but they don't know that they are in a game, or that they are extremely delicious. Mysterious Levels - Each level is strange and dangerously beautiful, introducing new puzzles, areas, and the creatures that live in them. World of Goo Balls - Along the way, undiscovered new species of Goo Ball, each with unique abilities, come together to ooze through reluctant tales of discovery, love, conspiracy, beauty, electric power, and the third dimension. The Sign Painter - Someone is watching you. World of Goo Corporation - Congratulations! World of Goo Corporation is the Global Leader in Goo and Goo Related Product, including World of Goo Corporation Trademark Brand Soft Drink Beverage and World of Goo Corporation Trademark Brand Facial Exfoliating Lotion. Succulent! Massive Online Competition - Human players around the world compete in a living leaderboard to build the tallest towers of goo in World of Goo Corporation's mysterious sandbox. World of Goo Corporation is contractually obligated to state that everyone is a winner and is enthusiastic to celebrate everyone's tower building opportunities equally.… Expand"}, {"name": "Final Fantasy X / X-2 HD Remaster", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-x-x-2-hd-remaster", "publisher": "Square Enix", "release_date": "May 12 2015", "developers": ["Virtuos"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/f1e08a0d3a2dd9f826997c3e69961caf-98.jpg", "descriptions": "Two RPGs - Now in High Definition. Over 200 hours of gameplay, including the International version content never before released in North America. Relive the fateful journey with fully remastered HD visuals and rearranged music."}, {"name": "Ultimate General: Gettysburg", "details_link": "https://www.metacritic.com/game/pc/ultimate-general-gettysburg", "publisher": "Game-Labs", "release_date": "Oct 16 2014", "developers": ["Game-Labs"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Strategy", "Real-Time", "General", "Military"], "meta_score": 84, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/ca1b7794359904960aa417e5db842899-98.jpg", "descriptions": "Ultimate General: Gettysburg is a Tactical Battle Simulator that allows you to lead thousands of soldiers in the famous Battle of Gettysburg as commander of either the Union or Confederate army. The game features the most accurately created map, detailed order of battle, complex morale, andUltimate General: Gettysburg is a Tactical Battle Simulator that allows you to lead thousands of soldiers in the famous Battle of Gettysburg as commander of either the Union or Confederate army. The game features the most accurately created map, detailed order of battle, complex morale, and innovative control mechanics. … Expand"}, {"name": "Trine 2: Complete Story", "details_link": "https://www.metacritic.com/game/playstation-4/trine-2-complete-story", "publisher": "Frozenbyte, Inc.", "release_date": "Nov 15 2013", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 3 ", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/48a62a78434a22b90065f6711005d3b7-98.jpg", "descriptions": "Trine 2 is a sidescrolling game of action, puzzles and platforming where you play as one of Three Heroes who make their way through dangers untold in a fantastical fairytale world. Join Amadeus the Wizard, Pontius the Knight and Zoya the Thief in their adventure full of friendship, magic andTrine 2 is a sidescrolling game of action, puzzles and platforming where you play as one of Three Heroes who make their way through dangers untold in a fantastical fairytale world. Join Amadeus the Wizard, Pontius the Knight and Zoya the Thief in their adventure full of friendship, magic and betrayal. … Expand"}, {"name": "NHL 13", "details_link": "https://www.metacritic.com/game/playstation-3/nhl-13", "publisher": "Electronic Arts", "release_date": "Sep 11 2012", "developers": ["Electronic Arts"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 84, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/b87c1591416c533dae9ac5a451ddaff1-98.jpg", "descriptions": "NHL 13 is EA Sports' hockey game with core gameplay innovation, connected experiences, and a deep feature set."}, {"name": "Sound Shapes", "details_link": "https://www.metacritic.com/game/playstation-3/sound-shapes", "publisher": "SCEA", "release_date": "Aug  7 2012", "developers": ["SCEA"], "platforms": ["PlayStation 4", "PlayStation Vita", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music Maker", "Music Maker", "Music"], "meta_score": 84, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/049277cdf06d3403bbde7f8c045854b6-98.jpg", "descriptions": "[=> Please see the Vita page for additional Sound Shapes reviews - the game is available on both platforms.] Play, Compose and Share in a unique take on the classic sidescrolling platformer where your actions make the music. With equal parts musical instrument and game, Sound Shapes gives  [=> Please see the Vita page for additional Sound Shapes reviews - the game is available on both platforms.] Play, Compose and Share in a unique take on the classic sidescrolling platformer where your actions make the music. With equal parts musical instrument and game, Sound Shapes gives everyone the ability to make music. Set different shapes into the world to make musical notes and trigger sounds through your actions. Upload your levels for others to download and remix on their own. Sound Shapes creates an ever-changing musical community for everyone to enjoy on the go. … Expand"}, {"name": "Space Invaders Extreme", "details_link": "https://www.metacritic.com/game/psp/space-invaders-extreme", "publisher": "Square Enix", "release_date": "Jun 17 2008", "developers": ["Taito Corporation"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 84, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/cbea1514f9edf7fe51d1b3f6e57445e0-98.jpg", "descriptions": "New Look: The classic design of the original SPACE INVADERS, now with revamped graphics and new background movies that add to the game’s excitement. New Music: Get in the groove with up-beat techno tunes that are synched to gameplay. New Mini-Games: Experience varied gameplay with mini-gamesNew Look: The classic design of the original SPACE INVADERS, now with revamped graphics and new background movies that add to the game’s excitement. New Music: Get in the groove with up-beat techno tunes that are synched to gameplay. New Mini-Games: Experience varied gameplay with mini-games (Rounds) that are launched mid-game – they add to the fun, and are a good way to rack up points. New Twists: Discover exciting twists to the classic game that provide swift, fast-paced game play. New Multiplayer Element: Battle against a friend with the all-new multiplayer element, available on both platforms. [Taito]… Expand"}, {"name": "Jak 3", "details_link": "https://www.metacritic.com/game/playstation-2/jak-3", "publisher": "SCEA", "release_date": "Nov  9 2004", "developers": ["Naughty Dog"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 84, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/5558e23ca7b836d1ee46a1e75eb5e14c-98.jpg", "descriptions": "One year has passed since Jak and Daxter saved Haven City from Kor and the attacking Metal Heads, yet Haven City is still immersed in deadly chaos as three groups fight for control of the streets. The people of Haven City have grown to distrust Jak's dark powers, and as rumors boil of Jak'sOne year has passed since Jak and Daxter saved Haven City from Kor and the attacking Metal Heads, yet Haven City is still immersed in deadly chaos as three groups fight for control of the streets. The people of Haven City have grown to distrust Jak's dark powers, and as rumors boil of Jak's ties with Krew and Kor, the city blames Jak for its current woeful circumstances. When the palace is destroyed by a surprise Metal Head attack, even Ashelin cannot protect Jak as the High Council's power broker, Count Veger, forces Jak into banishment to the desolate Wasteland. Jak is flown to the harsh island and dumped. With Daxter and Pecker bravely by his side, the three begin their next adventure where the battle for the city has just begun. Five times the size of Haven City, the Wasteland is a desert environment with multiple areas including mines and a volcano. Given the enormity and variance in terrain, vehicles play a large role as off-road transportation is introduced, fueled by a true-to-life physics engine. With a rugged new look and suited with armor, Jak is also equipped with an arsenal of new weapons with upgradeable mods that enable players to increase their firepower and enjoy the freedom to strategize and activate their arsenal at any time. As Jak has been exposed to Light Eco, players can now experience Jak's magnificent transformation to Light Jak. With a glowing electric blue aura and a massive wing span, Light Jak introduces new move sets, including the ability to glide great distances, emit an energy to block enemy attack, and power up at anytime, all of which provide the player with a sense of being invincible. Dark Jak also returns with more capabilities, forcing Jak to find a balance between light and dark. [SCEA]… Expand"}, {"name": "Psi-Ops: The Mindgate Conspiracy", "details_link": "https://www.metacritic.com/game/xbox/psi-ops-the-mindgate-conspiracy", "publisher": "Midway", "release_date": "Jun 14 2004", "developers": ["Midway"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 84, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/ec90de80881327cf0c721c259ebab70d-98.jpg", "descriptions": "Your most powerful weapon is your mind in Psi-Ops: The Mindgate Conspiracy, an action adventure game that combines Psi powers with weapons combat. A terrorist movement prepares to overthrow world order, you, an elite American Psi-operative soldier, must combat them. Practice powers ofYour most powerful weapon is your mind in Psi-Ops: The Mindgate Conspiracy, an action adventure game that combines Psi powers with weapons combat. A terrorist movement prepares to overthrow world order, you, an elite American Psi-operative soldier, must combat them. Practice powers of Telekinesis, Mind Control, Pyrokinesis, Mind Drain, Aura View, and Remote Viewing to win mind games against an army of brainwashed terrorists and powerful Psi agents. Fight through eight levels using your Psi powers, an arsenal of traditional weapons, and puzzle-solving skills. … Expand"}, {"name": "James Bond 007: Everything or Nothing", "details_link": "https://www.metacritic.com/game/playstation-2/james-bond-007-everything-or-nothing", "publisher": "EA Games", "release_date": "Feb 17 2004", "developers": ["EA Redwood Shores"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 84, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/99630b2481e81f2e5ed5a9e6e4d3ac13-98.jpg", "descriptions": "Think like Bond as never before, using espionage, tactical skills, and Q-Lab gadgets to analyze every situation. Act like Bond, using your stylish physical skills, clever disguises, and bold personality to once again save the world. With every Bond moment played out before you in an all-new,Think like Bond as never before, using espionage, tactical skills, and Q-Lab gadgets to analyze every situation. Act like Bond, using your stylish physical skills, clever disguises, and bold personality to once again save the world. With every Bond moment played out before you in an all-new, third-person cinematic perspective, this action-packed adventure could only come from the world of James Bond. What would Bond do? What will you do? [Electronic Arts]… Expand"}, {"name": "The Sims", "details_link": "https://www.metacritic.com/game/xbox/the-sims", "publisher": "EA Games", "release_date": "Mar 24 2003", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 84, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/8559dc23bda4b649f0b50f86ba8b9961-98.jpg", "descriptions": "Build, buy, and live.  The Sims give you the chance to create simulated people and build their homes, then help your Sims pursue careers, earn money, make friends, and find romance--or totally mess up their lives.  Keep your Sims happy by decorating your home with over 150 objects in theBuild, buy, and live.  The Sims give you the chance to create simulated people and build their homes, then help your Sims pursue careers, earn money, make friends, and find romance--or totally mess up their lives.  Keep your Sims happy by decorating your home with over 150 objects in the game and downloadable ones from TheSims.com.  Test your \"people skills\" as you deal with family, friends, careers, and chaos.  There is no right or wrong way to play the game.  … Expand"}, {"name": "Onimusha 2: Samurai's Destiny", "details_link": "https://www.metacritic.com/game/playstation-2/onimusha-2-samurais-destiny", "publisher": "Capcom", "release_date": "Aug 28 2002", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/b5e6536a064bedfed72cf4dee371497d-98.jpg", "descriptions": "Return to the magical days of feudal Japan and join Jubei, a young warrior, as he launches an epic, magical quest, only to reveal his ultimate destiny! [Capcom]"}, {"name": "Spy Hunter", "details_link": "https://www.metacritic.com/game/playstation-2/spy-hunter", "publisher": "Midway", "release_date": "Sep 24 2001", "developers": ["Paradigm Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 84, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/983f765b333a99e649113675521e2e99-98.jpg", "descriptions": "Based on the arcade classic, Spy Hunter combines explosive combat, action-racing, and mission-based game play as you drive the G-6155 Interceptor, capable of morphing on-the-fly into a jet-powered speed boat, jet watercraft, or motorcycle to escape and evade enemy fire.  [Midway]"}, {"name": "Resident Evil Code: Veronica X", "details_link": "https://www.metacritic.com/game/playstation-2/resident-evil-code-veronica-x", "publisher": "Capcom", "release_date": "Aug 21 2001", "developers": ["Capcom"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 84, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/a2ddb32b11ddb73cf45cb51ff96f10fd-98.jpg", "descriptions": "In this fourth game of the \"Resident Evil\" series, Claire Redfield attempts to track down her brother Chris, who went missing during his investigation of the Umbrella Corp., which is responsible for those pesky zombie outbreaks throughout the series. It also comes complete with a playableIn this fourth game of the \"Resident Evil\" series, Claire Redfield attempts to track down her brother Chris, who went missing during his investigation of the Umbrella Corp., which is responsible for those pesky zombie outbreaks throughout the series. It also comes complete with a playable demo of Capcom's next big thing, \"Devil May Cry.\"… Expand"}, {"name": "ChuChu Rocket!", "details_link": "https://www.metacritic.com/game/game-boy-advance/chuchu-rocket!", "publisher": "Sega", "release_date": "Jun 10 2001", "developers": ["Sonic Team"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 84, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/0b8307f1135af00a48ef99ee14eca373-98.jpg", "descriptions": "It'll take you a little while to get used to the controls, but once you do, you'll find that ChuChu Rocket offers a lot of value and a lot of fun for moments or hours at a time, for one to four players."}, {"name": "Ecco the Dolphin: Defender of the Future", "details_link": "https://www.metacritic.com/game/dreamcast/ecco-the-dolphin-defender-of-the-future", "publisher": "Sega", "release_date": "Sep 10 2000", "developers": ["Appaloosa Interactive"], "platforms": ["PlayStation 2", "Dreamcast"], "genres": ["Action Adventure", "Fantasy"], "meta_score": 84, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/2dd0442c1dede237856bc6d7ee433364-98.jpg", "descriptions": "Plunge into the tropical waters of the Isle of Tranquility. As Ecco, an anergetic young dolphin you will explore mysterious locations that span four alternate timelines. Seek the majestic city of Atlantis, monument to the civilisation built by humans and dolphins. Encounter sea creatures andPlunge into the tropical waters of the Isle of Tranquility. As Ecco, an anergetic young dolphin you will explore mysterious locations that span four alternate timelines. Seek the majestic city of Atlantis, monument to the civilisation built by humans and dolphins. Encounter sea creatures and come face to face with alien forces as you seek to defend the Earth and history itself!… Expand"}, {"name": "Bulletstorm", "details_link": "https://www.metacritic.com/game/playstation-3/bulletstorm", "publisher": "Electronic Arts", "release_date": "Feb 22 2011", "developers": ["Epic Games", "People Can Fly"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/335b53e459b39b9b6a13ddcd82c2ff9b-98.jpg", "descriptions": "Bulletstorm's array of distinct skillshots produces unprecedented levels of frantic gameplay. The skillshot system rewards players for laying waste to enemies in the most imaginative way possible. The more insane the skillshot, the more points players collect to upgrade and unlock weapons,Bulletstorm's array of distinct skillshots produces unprecedented levels of frantic gameplay. The skillshot system rewards players for laying waste to enemies in the most imaginative way possible. The more insane the skillshot, the more points players collect to upgrade and unlock weapons, which in turn allows them to execute even more inventive moves and exaggerated skillshots. … Expand"}, {"name": "Prince of Persia: Warrior Within", "details_link": "https://www.metacritic.com/game/playstation-2/prince-of-persia-warrior-within", "publisher": "Ubisoft", "release_date": "Nov 30 2004", "developers": ["Ubisoft Montreal"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/c55792b8d87e8a84a8d85ceb712bf034-98.jpg", "descriptions": "The Prince has to embark upon a path of both carnage and mystery to defy his preordained death. His journey leads to the infernal core of a cursed island stronghold harboring mankind's greatest fears. Only through grim resolve, bitter defiance and the mastery of deadly new combat arts canThe Prince has to embark upon a path of both carnage and mystery to defy his preordained death. His journey leads to the infernal core of a cursed island stronghold harboring mankind's greatest fears. Only through grim resolve, bitter defiance and the mastery of deadly new combat arts can the Prince rise to a new level of warriorship - and emerge from this ultimate trial with his life. In order to accomplish his mission, the Prince benefits from a brand new free-form fighting system that allows gamers to channel his anger as they wage battle without boundaries. Each game fan will find his or her own unique fighting style as they manipulate their environment and control the Ravages of Time. You can dig into an arsenal of weapons that, when used in combination, create advanced arm attacks that verge on fatal artistry! Prince of Persia: Warrior Within promises that game fans will fight harder, and play longer, emerging from the experience as deadly-capable skilled masters of their own unique combat art form. [Ubisoft]… Expand"}, {"name": "Just Shapes & Beats", "details_link": "https://www.metacritic.com/game/switch/just-shapes-beats", "publisher": "Berzerk Studio", "release_date": "May 31 2018", "developers": ["Berzerk Studio"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/822fe1c43bb569fa8af4209170193725-98.jpg", "descriptions": "A game about shapes, and about beats.\"Just Shapes & Beats\" is a chaotic co-op musical bullet-hell based on three simple things: avoid Shapes, move to the rad Beats, and die, repeatedly. It's a new spin on SHMUPs, adding a layer of coop that's at the core of the game: 'cause everything isA game about shapes, and about beats.\"Just Shapes & Beats\" is a chaotic co-op musical bullet-hell based on three simple things: avoid Shapes, move to the rad Beats, and die, repeatedly. It's a new spin on SHMUPs, adding a layer of coop that's at the core of the game: 'cause everything is better with friends.Play alone or with up to four players, local or online, through the game's Story Mode or Challenge Runs.MUSIC TO YOUR EARS, AND HANDSYou like music? SO. DO. WE. That's why we have 35 hand crafted stages with licensed tracks from over 20 chiptune and EDM artists.Hits like a ton of brick straight into your eardrums and your eyeballs; BAMEVERYTHING IS BETTER WITH FRIENDSGather up your squad and play up to 4 player co-op, drop-in drop-out, either all on your couch for a house party, or an online party!Don't have/like your friends? WE GOTCHU MY DUDES, make new or BETTER friends by playing a few quick online challenge runs. Let us pick your new best buds for the next hours; strangers are just friends you haven't met yet.Kind of a lone wolf, back hurts from carrying people, would rather play with yourself? Do it, the game is just as fun, just a different experience waiting for you; ain't nobody judging here yo.SOMETHING FOR EVERYONEWe have many different game experiences to offer! Story mode helps you learn the ropes with our intermediate-ish tracks and the optional Casual mode. When you think you're ready, Challenge Runs is where you get to prove yourself: get judged on your skills by playing through randomly picked tracks.Need some kind of training montage to get better? Rip off your sleeves and practice the tracks you're struggling to master in the Playlist.PARTYYYYYLiterally the soundtrack for your party! Let the game play in Party Mode and let it light up your social gatherings, + you can even still have people playing this if they like, WE'VE THOUGHT ABOUT EVERYTHING.So yea, go ahead and throw the most epic party of your life thanks to us, you are welcome.… Expand"}, {"name": "Assassin's Creed Origins: The Curse of the Pharaohs", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-origins-the-curse-of-the-pharaohs", "publisher": "Ubisoft", "release_date": "Mar 13 2018", "developers": ["Ubisoft Sofia"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "Action Adventure", "Edutainment", "Open-World"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/8904550e23b74915b726d7dd7d1cd2c9-98.jpg", "descriptions": "Curse of the Pharaohs, the third major expansion for Assassin's Creed Origins, takes Bayek to find a mysterious artifact in Thebes, where he immediately runs into much more than he bargained for. Instead of the mortal and deceitful Order of the Ancients, he finds undead pharaohsCurse of the Pharaohs, the third major expansion for Assassin's Creed Origins, takes Bayek to find a mysterious artifact in Thebes, where he immediately runs into much more than he bargained for. Instead of the mortal and deceitful Order of the Ancients, he finds undead pharaohs materializing in the streets and slaughtering civilians. The Pharaoh's Curse, as the locals call it, likely has something to do with all the grave robbers treating the Valley of the Kings like a strip mine for antiquities, forcing Bayek to hunt down key artifacts linked to each pharaoh in order to put them to rest.… Expand"}, {"name": "Yakuza: Like a Dragon", "details_link": "https://www.metacritic.com/game/xbox-series-x/yakuza-like-a-dragon", "publisher": "Sega", "release_date": "Nov 10 2020", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/7baec1a2b4df4335ffc25f95dd023687-98.jpg", "descriptions": "Become Ichiban Kasuga, a low-ranking yakuza grunt left on the brink of death by the man he trusted most. Take up your legendary bat and get ready to crack some underworld skulls in dynamic RPG combat set against the backdrop of modern-day Japan."}, {"name": "Borderlands 2: Mr. Torgue's Campaign of Carnage", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-2-mr-torgues-campaign-of-carnage", "publisher": "2K Games", "release_date": "Nov 20 2012", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/599137a2e3422310b741f65c7ff7819e-98.jpg", "descriptions": "Come into Mr. Torgue’s Campaign of Carnage and see if you have what it takes to become champion of this brand new storyline in Borderlands 2. Fight for the Big Loot against some of the baddest baddies in Pandora, including hordes of Biker Bandits. Also, take special quests from Tiny Tina,Come into Mr. Torgue’s Campaign of Carnage and see if you have what it takes to become champion of this brand new storyline in Borderlands 2. Fight for the Big Loot against some of the baddest baddies in Pandora, including hordes of Biker Bandits. Also, take special quests from Tiny Tina, Moxxi and others for extra rewards.  And don’t forget to bring your friends -- those higher levels get rather tough.   … Expand"}, {"name": "Final Fantasy XV", "details_link": "https://www.metacritic.com/game/xbox-one/final-fantasy-xv", "publisher": "Square Enix", "release_date": "Nov 29 2016", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/31b326779f782c53cb210996105b308f-98.jpg", "descriptions": "Harmony is realized in this alternate tale of Final Fantasy, developed by Square Enix. Not a sequel nor a prequel to the popular series, Final Fantasy Versus XIII unfolds a wholly independent story in another part of the universe with different characters. Set in a futuristic fantasy worldHarmony is realized in this alternate tale of Final Fantasy, developed by Square Enix. Not a sequel nor a prequel to the popular series, Final Fantasy Versus XIII unfolds a wholly independent story in another part of the universe with different characters. Set in a futuristic fantasy world resembling elements of modern day Japanese cities, Final Fantasy Versus XIII revolves around a prince, the last remaining member of a royal family, which controls the last crystal in existence. With two warring nations battling each other for dominance and the last crystal held by the kingdom, you must ensure it remains in the right hands.… Expand"}, {"name": "VA-11 Hall-A: Cyberpunk Bartender Action", "details_link": "https://www.metacritic.com/game/switch/va-11-hall-a-cyberpunk-bartender-action", "publisher": "Ysbryd Games", "release_date": "May  2 2019", "developers": ["Sukeban Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/ce93812f92412bf9aa6933885eb82711-98.jpg", "descriptions": "Welcome to VA-11 Hall-A!\r In this world, corporations reign supreme, all human life is infected with nanomachines designed to oppress them, and the terrifying White Knights ensure that everyone obeys the laws.\r\n\r\nBut, this story is not about those people.\r\n\r\nYou are a bartender at VA-11Welcome to VA-11 Hall-A!\r In this world, corporations reign supreme, all human life is infected with nanomachines designed to oppress them, and the terrifying White Knights ensure that everyone obeys the laws.\r But, this story is not about those people.\r You are a bartender at VA-11 Hall-A, affectionately nicknamed \"Valhalla.\" Although it is just a small bar in downtown Glitch City, it attracts the most fascinating people this side of dystopia. Keep your clients lubricated and you will be made privy to the most interesting stories.… Expand"}, {"name": "Final Fantasy XI: Treasures of Aht Urhgan", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xi-treasures-of-aht-urhgan", "publisher": "Square Enix", "release_date": "Apr 18 2006", "developers": ["Square Enix"], "platforms": ["PlayStation 2", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/b5b576b9172cffb946a9b82f259d049f-98.jpg", "descriptions": "Final Fantasy XI is the first cross-platform, cross-continent massively multi-player online role-playing game in the world. With the release of this third expansion, players will uncover the legends surrounding the Aht Urghan Empire. With new jobs, including the highly requested Blue MageFinal Fantasy XI is the first cross-platform, cross-continent massively multi-player online role-playing game in the world. With the release of this third expansion, players will uncover the legends surrounding the Aht Urghan Empire. With new jobs, including the highly requested Blue Mage and Corsair, additional areas to explore, and powerful new monsters, Treasures of Aht Urhgan expands the world of Vana'diel making it an even livelier place to visit. [Square Enix]… Expand"}, {"name": "Two Point Hospital", "details_link": "https://www.metacritic.com/game/pc/two-point-hospital", "publisher": "Sega", "release_date": "Aug 29 2018", "developers": ["Two Point Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Management", "Virtual", "Career", "Business / Tycoon"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/100188bda99ec2834452afc1fc391f75-98.jpg", "descriptions": "Design stunning hospitals, cure peculiar illnesses and manage troublesome staff as you spread your budding healthcare organisation across Two Point County."}, {"name": "Castlevania Advance Collection", "details_link": "https://www.metacritic.com/game/switch/castlevania-advance-collection", "publisher": "Konami", "release_date": "Sep 23 2021", "developers": ["Konami", "M2"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/ec6866e6cb78de9c5592c0ef310c7037-98.jpg", "descriptions": "Count Dracula is once more back from the dead... Join the fight against Evil in the Castlevania Advance Collection, a compilation of timeless action-exploration masterpieces. In addition to the three legendary Castlevania games that were first released on Game Boy™ Advance, this collectionCount Dracula is once more back from the dead... Join the fight against Evil in the Castlevania Advance Collection, a compilation of timeless action-exploration masterpieces. In addition to the three legendary Castlevania games that were first released on Game Boy™ Advance, this collection also includes Castlevania: Dracula X and some never-before-seen sketches and artwork from the games!\r All four games are enhanced with newly added modern features such as Rewind, Save/Load and Replay, making this the best way possible to experience these classics or discover them for the first time! This collection also boasts a handy Encyclopedia, a Music Player with all soundtracks and you can even change the ROM Region to play all games in different versions.… Expand"}, {"name": "Lumines Remastered", "details_link": "https://www.metacritic.com/game/switch/lumines-remastered", "publisher": "Enhance Games", "release_date": "Jun 26 2018", "developers": ["Enhance Games", "Resonair"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/19580e2cfe67c8ff66b655bd281ae4b5-98.jpg", "descriptions": "The acclaimed puzzle game produced by legendary creator Tetsuya Mizuguchi arrives on the Nintendo Switch console. An HD remaster of the original game, LUMINES REMASTERED beautifully marries the elements of sound, light and puzzle-action into one addictive, yet easy-to-play game. You're atThe acclaimed puzzle game produced by legendary creator Tetsuya Mizuguchi arrives on the Nintendo Switch console. An HD remaster of the original game, LUMINES REMASTERED beautifully marries the elements of sound, light and puzzle-action into one addictive, yet easy-to-play game. You're at the center of the high-energy, block-dropping action while you groove to awesome house, trance and techno beats! Play LUMINES REMASTERED on-the-go in Handheld mode or at home in TV and Tabletop modes. Features a colorful array of skins: No two skins (levels) are the same! Unlock all 40 skins, each with a cool stylized theme and matching thumping beats. Mode variety: In addition to the basic Challenge Mode, test your skills in other modes including Skin Edit, Time Attack, Puzzle, Mission, VS CPU and also play against in friend in VS 2-Player mode (local only). The HD Rumble effect: Feel the rhythm and blocks dropping from the dynamic HD Rumble feedback of the Joy-Con™ controllers! It's up to you what you want to feel – only the blocks or both rhythm and blocks. Trance Vibration: Ready for some real fun? Send rhythm feedback to multiple sets of controllers – placed in your pockets or around your hips – with the Trance Vibration setting and feel the game beyond your hands. [Nintendo]… Expand"}, {"name": "Fortnite", "details_link": "https://www.metacritic.com/game/switch/fortnite", "publisher": "Epic Games", "release_date": "Jun 12 2018", "developers": ["Epic Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "Xbox 360", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Massively Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 83, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/56ffbf02c47f89ca1ca8299fbbd58c2f-98.jpg", "descriptions": "Jump in to be the last one standing in the free 100-player Battle Royale. Build huge forts. Outwit your opponents. Earn your Victory. Squad up together online with friends in the same room or around the world. BUILD & DESTROY - Shape the battlefield by building your own cover. OpponentJump in to be the last one standing in the free 100-player Battle Royale. Build huge forts. Outwit your opponents. Earn your Victory. Squad up together online with friends in the same room or around the world. BUILD & DESTROY - Shape the battlefield by building your own cover. Opponent hiding behind a wall? Take out their cover to get the edge. GEAR UP - Board the battle bus and drop in on your favorite zone. Gather resources, collect gear, and battle your opponents. SQUAD UP WITH FRIENDS - Team up online with your friends around the world or in the same room. WEEKLY UPDATES & EVENTS - Updates constantly fuel the fun with new gameplay modes, outfits, weapons and items. [Nintendo]\r… Expand"}, {"name": "SUPERHOT VR", "details_link": "https://www.metacritic.com/game/pc/superhot-vr", "publisher": "SUPERHOT", "release_date": "Dec  5 2016", "developers": ["SUPERHOT"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/8a1a8067df262d57ed07aa7df4c1ac7f-98.jpg", "descriptions": "After years of experiments and iterations, the team behind the critically acclaimed, violently beautiful time-bending shooter SUPERHOT is ready to unveil it’s newest creation. SUPERHOT VR is a title reimagined and redesigned from the ground up for VR and hand tracking controllers."}, {"name": "DmC: Devil May Cry Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/dmc-devil-may-cry-definitive-edition", "publisher": "Capcom", "release_date": "Mar 10 2015", "developers": ["Ninja Theory", "QLOC"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General", "Linear"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/664c0dc9287e34c48d25882a2f6e636f-98.jpg", "descriptions": "The definitive edition of this action game arrives with enhanced 1080p graphics at 60fps, new features and all the original DLC included. Chain together stylish combos with up to 8 unique weapons. Traverse the demonic world of Limbo as you join Dante and Vergil in the legendary rebirth ofThe definitive edition of this action game arrives with enhanced 1080p graphics at 60fps, new features and all the original DLC included. Chain together stylish combos with up to 8 unique weapons. Traverse the demonic world of Limbo as you join Dante and Vergil in the legendary rebirth of the Devil May Cry franchise. … Expand"}, {"name": "Chicken Police - Paint it RED!", "details_link": "https://www.metacritic.com/game/xbox-one/chicken-police---paint-it-red!", "publisher": "HandyGames", "release_date": "Nov  5 2020", "developers": ["The Wild Gentlemen"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 83, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/a11f9fd1c4dcc10b7406ccd6f688d986-98.jpg", "descriptions": "Sonny Featherland and Marty MacChicken were once legendary detective partners in Clawville PD. Predatory division, nicknamed as the Chicken Police. But that was a decade ago and time had passed them by... Sonny is a semi-alcoholic wreck of a bird on paid leave, while Marty still hides behindSonny Featherland and Marty MacChicken were once legendary detective partners in Clawville PD. Predatory division, nicknamed as the Chicken Police. But that was a decade ago and time had passed them by... Sonny is a semi-alcoholic wreck of a bird on paid leave, while Marty still hides behind the facade of a star-detective.\r On the night of New Year's Eve, a mysterious woman visits Sonny with an errand which goes back to a dark corner of his past. Now, Sonny and Marty are back together again on a case stranger than anything they've ever encountered before!\r Chicken Police is an \"Orwellesque Buddycop Noir Adventure\", with a carefully crafted world, a gritty, dark story, and absurd humor. The game mixes elements of story-rich adventures with visual novel style dialogue-heavy storytelling, complete with a complex interrogation system, detective gameplay, and an ever-changing city.… Expand"}, {"name": "Disgaea 1 Complete", "details_link": "https://www.metacritic.com/game/playstation-4/disgaea-1-complete", "publisher": "NIS America", "release_date": "Oct  9 2018", "developers": ["Nippon Ichi Software"], "platforms": ["iPhone/iPad", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/8d6331b4ea4d240cfe6d34615af616ab-98.jpg", "descriptions": "The Overlord is dead. The Netherworld is in turmoil. Time to kick some ass! Netherworld Prince Laharl awakens to fight for his throne and it's up to him and some unlikely allies to defend what is rightfully his. Together with his devious vassal Etna, the angel trainee Flonne, and a wholeThe Overlord is dead. The Netherworld is in turmoil. Time to kick some ass! Netherworld Prince Laharl awakens to fight for his throne and it's up to him and some unlikely allies to defend what is rightfully his. Together with his devious vassal Etna, the angel trainee Flonne, and a whole cavalcade of explosive characters, Laharl will slash, shoot, and punch his way to the top. Build your squad to level 9999 and unleash crazy special skills, team attacks, and spells to deal millions of points of damage in this zany high-definition remake of an RPG classic.… Expand"}, {"name": "Pro Evolution Soccer 2018", "details_link": "https://www.metacritic.com/game/playstation-4/pro-evolution-soccer-2018", "publisher": "Konami", "release_date": "Sep 12 2017", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/8bd86f40c78665ec026a06516ca5ea4b-98.jpg", "descriptions": "Real Touch+ adds a new dimension to ball control, with full body touch allowing various parts of the body to control the ball based on the unpredictability of the ball movement. Set pieces have been reworked with a new Free Kick and Penalty Kick system, alongside the option to choose the newReal Touch+ adds a new dimension to ball control, with full body touch allowing various parts of the body to control the ball based on the unpredictability of the ball movement. Set pieces have been reworked with a new Free Kick and Penalty Kick system, alongside the option to choose the new one player kick off. A new mode dedicated to 2v2 and 3v3 co-op play, with support for local guests. Play together with friends, take your team to the top or simply have some fun via one-off casual matches. Compete in PES League in new modes including myClub, Random Selection Match and Online co-op. [Konami]… Expand"}, {"name": "Grim Dawn", "details_link": "https://www.metacritic.com/game/pc/grim-dawn", "publisher": "Crate Entertainment", "release_date": "Feb 25 2016", "developers": ["Crate Entertainment"], "platforms": "PC", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/f221af394a8188ee9f5c3b2403145c91-98.jpg", "descriptions": "Players are thrust into the dark, war-torn world of Cairn where a once proud empire has been brought to ruin and the human race driven to the edge of extinction. Cairn has become ground zero of an eternal war between two otherworldly powers, one seeking to use human bodies as a resource, thePlayers are thrust into the dark, war-torn world of Cairn where a once proud empire has been brought to ruin and the human race driven to the edge of extinction. Cairn has become ground zero of an eternal war between two otherworldly powers, one seeking to use human bodies as a resource, the other intent upon destroying the human race before that can happen. This cataclysmic war has not only decimated human civilization but is warping the very fabric of reality and, in its wake, giving life to new horrors. … Expand"}, {"name": "Subnautica: Below Zero", "details_link": "https://www.metacritic.com/game/xbox-series-x/subnautica-below-zero", "publisher": "Bandai Namco Games", "release_date": "May 14 2021", "developers": ["Unknown Worlds Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Action Adventure", "Sandbox"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/a97b0f352a61e653b263664960a0dc00-98.jpg", "descriptions": "Below Zero is an underwater adventure game set on an alien ocean world. It is a new chapter in the Subnautica universe and developed by Unknown Worlds. Return to planet 4546B. Dive into a freezing underwater adventure. Below Zero is set in an arctic region of planet 4546B. As a scientistBelow Zero is an underwater adventure game set on an alien ocean world. It is a new chapter in the Subnautica universe and developed by Unknown Worlds. Return to planet 4546B. Dive into a freezing underwater adventure. Below Zero is set in an arctic region of planet 4546B. As a scientist posted to a research station on the planet's surface, you are tasked with studying alien artifacts...\r The Vesper space station orbits high above you, sending supplies, instructions, and receiving samples you launch from the surface.When disaster strikes the research station, you must improvise to survive: Construct habitats, scavenge for resources, hunt for food, and craft equipment.… Expand"}, {"name": "Call of Duty: Black Ops 4", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-black-ops-4", "publisher": "Activision", "release_date": "Oct 12 2018", "developers": ["Treyarch"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 83, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/4/d6eaeed2b4f06004b74f6773cfdcb347-98.jpg", "descriptions": "Black Ops returns - in your face. Featuring gritty, grounded, fluid Multiplayer combat, a massive Zombies offering with 3 full undead adventures at launch, and Blackout, where the universe of Black Ops comes to life in one huge battle royale experience featuring the largest map in Call ofBlack Ops returns - in your face. Featuring gritty, grounded, fluid Multiplayer combat, a massive Zombies offering with 3 full undead adventures at launch, and Blackout, where the universe of Black Ops comes to life in one huge battle royale experience featuring the largest map in Call of Duty history, signature Black Ops combat, characters, locations and weapons from the entire Black Ops series. Soldier up for all-out combat – tailor made for the Black Ops community. [Treyarch]… Expand"}, {"name": "Super Puzzle Fighter II Turbo", "details_link": "https://www.metacritic.com/game/playstation/super-puzzle-fighter-ii-turbo", "publisher": "Capcom", "release_date": "Nov 30 1996", "developers": ["Capcom"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/c94549c18584ffeb363c303480e6b247-98.jpg", "descriptions": "Burst right into the feverish puzzle action that combines irresistible, addictive fun with famous Capcom characters. Beat your opponent to the punch by stacking block after block in strategic patterns and color combinations. Be the first to fill the opponent's screen with blocks and K.O. youBurst right into the feverish puzzle action that combines irresistible, addictive fun with famous Capcom characters. Beat your opponent to the punch by stacking block after block in strategic patterns and color combinations. Be the first to fill the opponent's screen with blocks and K.O. you win! But get ready for more, because you can't play just once.… Expand"}, {"name": "NieR Replicant ver.1.22474487139...", "details_link": "https://www.metacritic.com/game/xbox-one/nier-replicant-ver122474487139", "publisher": "Square Enix", "release_date": "Apr 23 2021", "developers": ["Toylogic Inc.", "Toylogic"], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/d762ea6a2843cb380be4687ad0d373b9-98.jpg", "descriptions": "Get ready to experience where the NieR series all began - NieR Replicant ver.1.22474487139...Set in a post-apocalyptic world, NieR Replicant ver.1.22474487139 is puts you in the role of the titular Nier, a young man on a quest to cure his sister Yonah of a deadly disease. What they discoverGet ready to experience where the NieR series all began - NieR Replicant ver.1.22474487139...Set in a post-apocalyptic world, NieR Replicant ver.1.22474487139 is puts you in the role of the titular Nier, a young man on a quest to cure his sister Yonah of a deadly disease. What they discover will make them question everything they thought they knew The original NieR release has an interesting history. In Japan, there were two versions of the game: NieR Replicant and NieR Gestalt. NieR Replicant focused on Brother Nier and his sister Yonah. In NieR Gestalt, the main character was Father Nier, and Yonah his daughter. Only NieR Gestalt released in the West (under the name NIER) - so excitingly, this will be the first time many people will have played the Replicant version of the game.… Expand"}, {"name": "Battlefield 1943", "details_link": "https://www.metacritic.com/game/xbox-360/battlefield-1943", "publisher": "Electronic Arts", "release_date": "Jul  8 2009", "developers": ["DICE Stockholm"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "24  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/44a5f6ced82090bd75167c7270b2e963-98.jpg", "descriptions": "[Xbox Live Arcade]  Using the Frostbite engine, Battlefield 1943 takes players back to WWII. The game offers hours of 24 player multiplayer action over three classic and tropic locations; Wake Island, Guadalcanal and Iwo Jima. Delivering the award-winning through-the-gun and vehicle warfare[Xbox Live Arcade]  Using the Frostbite engine, Battlefield 1943 takes players back to WWII. The game offers hours of 24 player multiplayer action over three classic and tropic locations; Wake Island, Guadalcanal and Iwo Jima. Delivering the award-winning through-the-gun and vehicle warfare online experience DICE is best recognized for, Battlefield 1943 has players battling in ruthless aerial dog fights and intense trench combat. [Electronic Arts]… Expand"}, {"name": "BlazBlue: Chrono Phantasma", "details_link": "https://www.metacritic.com/game/playstation-3/blazblue-chrono-phantasma", "publisher": "Aksys Games", "release_date": "Mar 25 2014", "developers": ["Arc System Works"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Fighting", "2D", "Action", "Fighting", "2D"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/e32ba94179f8467b1ec3873bb51b3a28-98.jpg", "descriptions": "With the Cauldron shattered and the cycle broken, Ragna begins his final mission: Hunt down the villainous Terumi. Noel's life and the fate of the entire world hang in the balance as Ragna the Bloodedge marches toward one last confrontation. BlazBlue: Chrono Phantasma introduces a newWith the Cauldron shattered and the cycle broken, Ragna begins his final mission: Hunt down the villainous Terumi. Noel's life and the fate of the entire world hang in the balance as Ragna the Bloodedge marches toward one last confrontation. BlazBlue: Chrono Phantasma introduces a new fighting system called \"Overdrive.\" With this, characters can become more powerful, possibly enough to turn the tide of battle. The fighting has also been sped up, meaning faster, more enjoyable play.… Expand"}, {"name": "Dungeons & Dragons: Chronicles of Mystara", "details_link": "https://www.metacritic.com/game/playstation-3/dungeons-dragons-chronicles-of-mystara", "publisher": "Capcom", "release_date": "Jun 18 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Beat-'Em-Up", "Compilation", "Compilation"], "meta_score": 83, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/5db95bee2e712eacf0ab7a647a448d56-98.jpg", "descriptions": "As the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titlesAs the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titles are now being re-released with updated HD graphics and a wealth of other enhancements as a definitive double pack entitled Dungeons & Dragons: Chronicles of Mystara.… Expand"}, {"name": "Ghost of Tsushima", "details_link": "https://www.metacritic.com/game/playstation-4/ghost-of-tsushima", "publisher": "Sony Interactive Entertainment", "release_date": "Jul 17 2020", "developers": ["Sucker Punch"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Open-World"], "meta_score": 83, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/0/260ef84455c9c9e47a0cdd2df24622bb-98.jpg", "descriptions": "The year is 1274. Samurai warriors are the legendary defenders of Japan -- until the fearsome Mongol Empire invades the island of Tsushima, wreaking havoc and conquering the local population. As one of the last surviving samurai, you rise from the ashes to fight back. But, honorable tacticsThe year is 1274. Samurai warriors are the legendary defenders of Japan -- until the fearsome Mongol Empire invades the island of Tsushima, wreaking havoc and conquering the local population. As one of the last surviving samurai, you rise from the ashes to fight back. But, honorable tactics won't lead you to victory. You must move beyond your samurai traditions to forge a new way of fighting -- the way of the Ghost -- as you wage an unconventional war for the freedom of Japan.… Expand"}, {"name": "Tetris 99", "details_link": "https://www.metacritic.com/game/switch/tetris-99", "publisher": "Nintendo", "release_date": "Feb 13 2019", "developers": ["Arika", "Nintendo"], "platforms": "Switch", "num_players": "Up to more than 64 ", "genres": ["Puzzle", "Stacking"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/a0ba1f4ff5e45bb22941d02a65a96522-98.jpg", "descriptions": "The free to download online software, Tetris® 99, is available as a special offer for Nintendo Switch Online members. In large-scale, 99-player battles, it'll take speed, skill, and strategy to knock out the competition and become the last player standing. You can target opponents by sendingThe free to download online software, Tetris® 99, is available as a special offer for Nintendo Switch Online members. In large-scale, 99-player battles, it'll take speed, skill, and strategy to knock out the competition and become the last player standing. You can target opponents by sending them Garbage Blocks, but be careful…your rivals can target you back! Defeat opponents to acquire KO badges that may give you the advantage on future attacks. Survive the onslaught and look forward to upcoming online events.… Expand"}, {"name": "Final Fantasy XII: The Zodiac Age", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xii-the-zodiac-age", "publisher": "Square Enix", "release_date": "Feb  1 2018", "developers": ["Square Enix"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/d93b9f1c85c969f8283c5e0d5b25c8ac-98.jpg", "descriptions": "Enter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country. Vaan, a young man who lost hisEnter an era of war within the world of Ivalice. The small kingdom of Dalmasca, conquered by the Archadian Empire, is left in ruin and uncertainty. Princess Ashe, the one and only heir to the throne, devotes herself to the resistance to liberate her country. Vaan, a young man who lost his family in the war, dreams of flying freely in the skies. In a fight for freedom and fallen royalty, join these unlikely allies and their companions as they embark on a heroic adventure to free their homeland.\r Final Fantasy XII: The Zodiac Age improves upon the 2006 classic Final Fantasy XII, now more beautiful and easier to play than ever. The high-definition remaster introduces several modern advancements, including reconstructed battle design and a revamped job system. With newly implemented trophies and share functions, as well as stark visual and sound improvements in true HD for the first time, players both returning and new to the game will experience a grand adventure that spans the world of Ivalice in an entirely fresh and improved way.… Expand"}, {"name": "Marvel Pinball", "details_link": "https://www.metacritic.com/game/playstation-3/marvel-pinball", "publisher": "Zen Studios", "release_date": "Dec 14 2010", "developers": ["Zen Studios"], "platforms": "PlayStation 3", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/b5454ee2fd8398991285fb4a68a2ef8d-98.jpg", "descriptions": "Marvel Pinball will include tables for Wolverine, Spider-Man, Iron Man, and Blade."}, {"name": "NBA Live 2005", "details_link": "https://www.metacritic.com/game/gamecube/nba-live-2005", "publisher": "EA Sports", "release_date": "Sep 28 2004", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/ca2575ab5fd45d45feb99e7e4e098999-98.jpg", "descriptions": "Elevate your game on both ends of the court with NBA Live 2005. Create new dribble moves, flashy dunks, and tenacious defensive plays that express your individual style--all with a touch of the right analog stick. The new 10-man Freestyle implementation enhances individual player movementsElevate your game on both ends of the court with NBA Live 2005. Create new dribble moves, flashy dunks, and tenacious defensive plays that express your individual style--all with a touch of the right analog stick. The new 10-man Freestyle implementation enhances individual player movements and floor spacing, putting you in the middle of the action. Enhanced player graphics reproduce NBA players with realistic faces, hairstyles, jerseys, and shoes. NBA Live 2005 also offers a deeper Dynasty mode, where you can watch your franchise flourish for 25 seasons.… Expand"}, {"name": "Resident Evil 0", "details_link": "https://www.metacritic.com/game/gamecube/resident-evil-0", "publisher": "Capcom", "release_date": "Nov 10 2002", "developers": ["Flagship"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/59791d7fcaf834345a9158183c68dcbf-98.jpg", "descriptions": "Before the events of Resident Evil, the residents of Raccoon City lived their lives unaware of the dark fate that surrounded them. Now, along with your S.T.A.R.S. Bravo Team, you're sent in to investigate a series of grisly murders in the area. As Rebecca Chambers, a rookie cop, or BillyBefore the events of Resident Evil, the residents of Raccoon City lived their lives unaware of the dark fate that surrounded them. Now, along with your S.T.A.R.S. Bravo Team, you're sent in to investigate a series of grisly murders in the area. As Rebecca Chambers, a rookie cop, or Billy Cowen, an escaped convict, you'll fight zombies, solve challenging puzzles, and slowly uncover the truth behind the murders. A new Partner Zapping System lets you quickly switch between each character.… Expand"}, {"name": "Virtua Tennis", "details_link": "https://www.metacritic.com/game/game-boy-advance/virtua-tennis", "publisher": "THQ", "release_date": "Oct  8 2002", "developers": ["Altron"], "platforms": ["PC", "Game Boy Advance"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/627a6eaa9c05483273520d6001813ebc-98.jpg", "descriptions": "Virtua Tennis more than lives up to its namesake and does an ample job of compacting Sega's Tennis 2K2 into a portable format."}, {"name": "Sega Sports Tennis", "details_link": "https://www.metacritic.com/game/playstation-2/sega-sports-tennis", "publisher": "Sega", "release_date": "Jul 31 2002", "developers": ["Hitmaker"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/a80ba48101f102da6f230a40925d3b5c-98.jpg", "descriptions": "Choose from 16 internationally ranked men's and women's tennis players including: Venus Williams, Serena Williams, Lindsay Davenport, Magnus Norman, Patrick Rafter, Yevgeny Kafelnikov, Mary Pierce, Ai Sugiyama, Aranxta Sanchez-Vicario, Alexandra Stevenson, Carlos Moya, Tim Henman, CedricChoose from 16 internationally ranked men's and women's tennis players including: Venus Williams, Serena Williams, Lindsay Davenport, Magnus Norman, Patrick Rafter, Yevgeny Kafelnikov, Mary Pierce, Ai Sugiyama, Aranxta Sanchez-Vicario, Alexandra Stevenson, Carlos Moya, Tim Henman, Cedric Pioline, Tommy Haas, Thomas Enqvist, and Monica Seles. The revamped World Tour Mode lets you create and train your players, sign unique doubles partners, and enter a host of prestigious tournaments. [Sega]… Expand"}, {"name": "MDK2", "details_link": "https://www.metacritic.com/game/pc/mdk2", "publisher": "Interplay", "release_date": "May 31 2000", "developers": ["BioWare"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/3921e1f1f98c4b012ca264c9d552a821-98.jpg", "descriptions": "Kurt Hectic is back to save the universe. This time, he is teamed with the genius Dr. Hawkins and the six-legged, gun-totin' robotic dog Max. Save the world with unique gadgets and weaponry, like the Black Hole Grenade and the Sniper shield.  [Interplay]"}, {"name": "Kid Icarus: Uprising", "details_link": "https://www.metacritic.com/game/3ds/kid-icarus-uprising", "publisher": "Nintendo", "release_date": "Mar 23 2012", "developers": ["Opus", "Project Sora"], "platforms": "3DS", "num_players": "Up to 6 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/93f986842d237c733563f044ad6ad1a9-98.jpg", "descriptions": "Kid Icarus: Uprising is the long-awaited franchise follow-up to the NES classic."}, {"name": "Tales of Vesperia: Definitive Edition", "details_link": "https://www.metacritic.com/game/switch/tales-of-vesperia-definitive-edition", "publisher": "Bandai Namco Games", "release_date": "Jan 11 2019", "developers": ["Bandai Namco Games", "QLOC"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/9a8bd1b8f693e2e6e0413c5f9d58e004-98.jpg", "descriptions": "Tales of Vesperia: Definitive Edition celebrates the 10th anniversary of this RPG with new fully playable characters, events and other additional content never released outside of Japan. Follow Yuri Lowell, a former Imperial Knight, as he befriends a colorful cast of characters throughoutTales of Vesperia: Definitive Edition celebrates the 10th anniversary of this RPG with new fully playable characters, events and other additional content never released outside of Japan. Follow Yuri Lowell, a former Imperial Knight, as he befriends a colorful cast of characters throughout the world of Terca Lumireis and finds himself in the middle of a nefarious plot that threatens the destruction of the entire planet.… Expand"}, {"name": "Gunpoint", "details_link": "https://www.metacritic.com/game/pc/gunpoint", "publisher": "Tom Francis", "release_date": "Jun  3 2013", "developers": ["Tom Francis"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/d5a8fc30b0777e4b71d1462d67fcfd9f-98.jpg", "descriptions": "Gunpoint is a stealth puzzle game that lets you rewire its levels to trick people.\r You're a freelance spy, infiltrating high security buildings with subterfuge, face-punching, and an unusual type of electronic sabotage. You can cross-link things like light switches and doors so that theGunpoint is a stealth puzzle game that lets you rewire its levels to trick people.\r You're a freelance spy, infiltrating high security buildings with subterfuge, face-punching, and an unusual type of electronic sabotage. You can cross-link things like light switches and doors so that the guards unwittingly take out their own security systems, their colleagues, and even themselves. It's pretty funny.… Expand"}, {"name": "EVERSPACE 2", "details_link": "https://www.metacritic.com/game/pc/everspace-2", "publisher": "ROCKFISH Games", "release_date": "Apr  6 2023", "developers": ["ROCKFISH Games"], "platforms": "PC", "num_players": "", "genres": ["Action Adventure", "Open-World"], "meta_score": 83, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/c0c4a1d5dc5ebc4db1c68ea28addb992-98.jpg", "descriptions": "EVERSPACE™ 2 is a fast-paced single-player spaceship shooter with deep exploration in space and on planets, tons of loot, RPG elements, mining, and crafting. Experience a thoughtful story, set in a vivid, handcrafted open world full of secrets, puzzles, and perils."}, {"name": "Detention", "details_link": "https://www.metacritic.com/game/pc/detention", "publisher": "Red Candle Games", "release_date": "Jan 12 2017", "developers": ["Red Candle Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/001a954640c964b28a395d61ee1d85f3-98.jpg", "descriptions": "Detention is a survival horror game set in 1960s Taiwan under martial law. Incorporated religious elements based in Taiwanese/Chinese culture and mythology, the game provided players with unique graphics and gaming experience."}, {"name": "Sly 3: Honor Among Thieves", "details_link": "https://www.metacritic.com/game/playstation-2/sly-3-honor-among-thieves", "publisher": "SCEA", "release_date": "Sep 26 2005", "developers": ["Sucker Punch"], "platforms": ["PlayStation 3", "PlayStation 3", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 83, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/2/5bd016b6ea8277b57019bcb599c1fe3d-98.jpg", "descriptions": "Sly 3: Honor Among Thieves entices a broad range of players with multiple tiers of gameplay to reach both the hard core and gaming novice, drawing players immediately into the devious adventures of Sly and his crew by offering a unique cast of playable characters, a challenging dual analogSly 3: Honor Among Thieves entices a broad range of players with multiple tiers of gameplay to reach both the hard core and gaming novice, drawing players immediately into the devious adventures of Sly and his crew by offering a unique cast of playable characters, a challenging dual analog stick multiplayer mode, new vehicles, mini-games, disguises, enhanced combat move sets and much more. Players hungry for a more in-depth gameplay experience have the opportunity to replay missions by utilizing the time machine feature, thus providing an opportunity to sneak around an environment again using alternative moves and disguises in order to achieve even higher Master Thief ratings. In the new multiplayer mode, players play head-to-head and experience cooperative missions or replay mini-games together. The story line for Sly 3: Honor Among Thieves begins with Sly and his crew in disarray and struggling some setbacks. Bentley was crippled in the final battle with Clockwerk at the end of \"Sly 2: Band of Thieves\" and confined to a wheelchair, and Murray, feeling responsible for Bentley's tragic accident, has quit the team and chosen a path of non-violence and solace. Meanwhile, Sly learns of a secret family fortress that houses the amassed Cooper family fortune. Upon arriving at this hidden location, Sly discovers another enemy group attempting to steal the Cooper fortune. Sly and Bentley quickly realize they will need considerable help to defeat this new rival. Their recruiting starts with Murray, and once back on-board, Sly, Murray and Bentley set out to enlist some new and familiar faces in an effort to pull off a World Class heist. [SCEA]… Expand"}, {"name": "Bloodstained: Ritual of the Night", "details_link": "https://www.metacritic.com/game/pc/bloodstained-ritual-of-the-night", "publisher": "505 Games", "release_date": "Jun 18 2019", "developers": ["ArtPlay"], "platforms": ["iPhone/iPad", "PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "2D", "", "Metroidvania"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/d2176a8a49d274f99213a130aadacaae-98.jpg", "descriptions": "You are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you exploreYou are Miriam, an orphan scarred by an alchemist curse which slowly crystallizes your skin. You must battle your way through a demon-filled castle summoned by Gebel, your old friend whose body has become more crystal than flesh.\r * Exploration: Bloodstained's story unfolds as you explore Gebel's hellish castle; a sprawling structure that features a variety of locations. As you explore the massive castle you'll find warp gates that will allow you to travel quickly without having to backtrack too much.\r* RPG Elements: It's not an Igavania without leveling, and Bloodstained will be no exception. In addition to the classic elements everyones come to expect, enemies in Bloodstained will drop a wide variety of items, materials, and magi-crystals necessary to create the items that will get you safely through Gebels castle.\r* Crafting: As you explore, fight enemies, and complete quests you will gain experience and become more powerful, acquiring a variety of weapons along the way. Enemies will also drop materials you can use to craft new weapons and abilities using Miriam's training in alchemy.… Expand"}, {"name": "Hakuoki: Kyoto Winds", "details_link": "https://www.metacritic.com/game/playstation-vita/hakuoki-kyoto-winds", "publisher": "Idea Factory", "release_date": "May 16 2017", "developers": ["Idea Factory", "Otomate"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/4e61546587e5c48d6f2cf399dfc32b91-98.jpg", "descriptions": "The remastered telling of the visual novel Hakuoki focuses on the story set in Kyoto. The young Chizuru, determined to find her father, will romance the famous samurai of Shinsengumi through a series of engaging stories in this historical fantasy adventure."}, {"name": "NHL 2K6", "details_link": "https://www.metacritic.com/game/xbox/nhl-2k6", "publisher": "2K Sports", "release_date": "Sep  6 2005", "developers": ["2K Sports"], "platforms": ["PlayStation 2", "Xbox 360", "Xbox"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/5f1b3a998d2e63eaa4a227691063b1f9-98.jpg", "descriptions": "NHL 2K6 is a realistic hockey simulation in which you must take part in all aspects of running a franchise, from scheduling workouts to hitting a slap shot. The game includes revamped animations and more realistic player movement. NHL 2K6 also includes on-the-fly coaching that lets you makeNHL 2K6 is a realistic hockey simulation in which you must take part in all aspects of running a franchise, from scheduling workouts to hitting a slap shot. The game includes revamped animations and more realistic player movement. NHL 2K6 also includes on-the-fly coaching that lets you make decisions during the game to affect your teams strategy and execution. You can even go online to challenge other gamers, track stats, or join a league.… Expand"}, {"name": "Beyond Good & Evil", "details_link": "https://www.metacritic.com/game/pc/beyond-good-evil", "publisher": "Ubisoft", "release_date": "Nov 19 2003", "developers": ["Ubisoft Montpellier"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/5/b453f58c7d58b523e0248188eddd06bd-98.jpg", "descriptions": "The planet of Hyllis has fallen under siege by a ruthless alien race. Despite the assurances of the Alpha Section defense squad, the war drags on, terrorizing the once-beautiful planet and crushing the faith of the people. From the rubble of a tiny island rises Jade - a rebellious youngThe planet of Hyllis has fallen under siege by a ruthless alien race. Despite the assurances of the Alpha Section defense squad, the war drags on, terrorizing the once-beautiful planet and crushing the faith of the people. From the rubble of a tiny island rises Jade - a rebellious young action reporter left traumatized by a brutal attack. When Jade is hired by the rebel organization IRIS, she learns that the Alpha Sections are secretly trafficking humans to the enemy. Still wary of who to believe, she sets out to expose the gruesome conspiracy and bring proof to her people. Armed with her camera, dai-jo staff, and unflinching resolve, Jade plunges into a sinister web to untangle the truth and restore justice to her planet. But as she earns the trust of her beleaguered people, Jade discovers that sometimes, in order to find the truth, you must look beyond good and evil. [Ubi Soft]… Expand"}, {"name": "LocoRoco", "details_link": "https://www.metacritic.com/game/psp/locoroco", "publisher": "SCEA", "release_date": "Sep  5 2006", "developers": ["SCE Japan Studio"], "platforms": ["PlayStation 4", "PSP"], "num_players": "1-16 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/15652ae6c73f9c1380c49d710037bca5-98.jpg", "descriptions": "LocoRoco is an innovative 2D platform/action game available exclusively for the PSP. Featuring unique controls utilizing the \"L\" and \"R\" shoulder buttons, players are tasked with controlling via \"tilting or bumping\" the landscape of the LocoRoco in order to help them navigate through theLocoRoco is an innovative 2D platform/action game available exclusively for the PSP. Featuring unique controls utilizing the \"L\" and \"R\" shoulder buttons, players are tasked with controlling via \"tilting or bumping\" the landscape of the LocoRoco in order to help them navigate through the level and keep them out of harm's way. With more than 40 stages, players control and guide the LocoRoco through vibrant, thriving and lush worlds filled with slippery slopes, swing ropes , and more. Featuring six different types of LocoRoco that include their own voices and actions, players will be enchanted by captivating music that communicates the joyous world of these LocoRoco. In addition, LocoRoco features the rewarding LocoHouse, three mini-games , and wireless features. The peaceful world of the LocoRoco are under attack by the not-so-nice Moja Corps. These evil outer space creatures want nothing but to capture the blissful LocoRoco and take them from their land of blowing flowers, lively creatures and pastel scenery. As the planet where the LocoRoco inhabit, players must tilt, roll and bounce the LocoRoco to safety. [SCEA]… Expand"}, {"name": "Everhood", "details_link": "https://www.metacritic.com/game/pc/everhood", "publisher": "Surefire.Games", "release_date": "Mar  4 2021", "developers": ["Chris Nordgren", "Foreign Gnomes"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a71edad93307e4d6295f7097b87710de-98.jpg", "descriptions": "An UNCONVENTIONAL ADVENTURE RPG that takes place in an inexpressible world filled with amusing musical battles and strange delightful encounters. To put it simply: You are in for a ride."}, {"name": "The Pedestrian", "details_link": "https://www.metacritic.com/game/playstation-5/the-pedestrian", "publisher": "Skookum Arts LLC", "release_date": "Jan 29 2021", "developers": ["Skookum Arts LLC", "Skookum Arts"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/459d6d34b3ae3ac094354577e440ed06-98.jpg", "descriptions": "The Pedestrian is a 2.5D puzzle platformer themed around the public sign system. You play as a 2D character moving through signs in a dynamic 3D world. You progress through the game by rearranging and connecting public signs to explore and advance through each environment."}, {"name": "MLB 06: The Show", "details_link": "https://www.metacritic.com/game/psp/mlb-06-the-show", "publisher": "SCEA", "release_date": "Feb 28 2006", "developers": ["SCEA San Diego Studios"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/51f6f3d5bb8d85ad1191397ad8adead8-98.jpg", "descriptions": "MLB '06: The Show for the PSP suits up for the season with the all-new Career Mode for gamers to create a player and take them out to play anytime, anywhere, and a Season Mode that now offers multiple seasons. Users can choose their favorite team, play the regular season, advance to theMLB '06: The Show for the PSP suits up for the season with the all-new Career Mode for gamers to create a player and take them out to play anytime, anywhere, and a Season Mode that now offers multiple seasons. Users can choose their favorite team, play the regular season, advance to the playoffs, be crowned the World Series Champion and even create their own dynasty. With the new Historical Greats option, nostalgic fans of America's Pastime players can go up against baseball legends. For gamers on the go, MLB '06: The Show offers multiplayer gameplay, either locally via Ad Hoc Mode or across the nation via Infrastructure Mode. Additionally, sports fanatics can utilize the new online news service to get the latest MLB news feeds online or save them to the Memory Stick Duo and review them offline at their convenience. [SCEA]… Expand"}, {"name": "Anno 2070", "details_link": "https://www.metacritic.com/game/pc/anno-2070", "publisher": "Ubisoft", "release_date": "Nov 17 2011", "developers": ["Blue Byte", "Related Designs"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Management", "Sci-Fi", "Sci-Fi", "General", "Government"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/720d768eddc9405545d33aabc00bc3d6-98.jpg", "descriptions": "Developed by Related Designs in collaboration with Blue Byte, Anno 2070 takes place in a near-future environment where climate change has forced humanity to adapt to rising sea levels that have left stretches of once-fertile land completely inhospitable. Players need to master newDeveloped by Related Designs in collaboration with Blue Byte, Anno 2070 takes place in a near-future environment where climate change has forced humanity to adapt to rising sea levels that have left stretches of once-fertile land completely inhospitable. Players need to master new technologies while facing numerous ecological challenges to build their empires. Anno 2070 offers players the ability to be architects of the future and create the world of tomorrow.… Expand"}, {"name": "The Yakuza Remastered Collection", "details_link": "https://www.metacritic.com/game/playstation-4/the-yakuza-remastered-collection", "publisher": "Sega", "release_date": "Aug 20 2019", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/28f71c3ec2ed3ccc4dacd36108a6ab26-98.jpg", "descriptions": "Complete The Dragon of Dojima's JourneyCelebrate Kazuma Kiryu's saga with the beautifully remastered Yakuza 3, 4, and 5. With restored content and updated localization in 1080p and 60fps, experience the complete Yakuza collection on one console for the first time in history."}, {"name": "SMITE", "details_link": "https://www.metacritic.com/game/pc/smite", "publisher": "Hi-Rez Studios", "release_date": "Mar 25 2014", "developers": ["Hi-Rez Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Role-Playing", "Strategy", "Real-Time", "Massively Multiplayer Online", "Fantasy", "MOBA", "MOBA"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/12d3799b715b3c25c326759b346e21c2-98.jpg", "descriptions": "Players choose from a selection of mythical gods, join session-based arena combat, and use custom powers and team tactics against other player-controlled gods and non-player controlled minions."}, {"name": "Life is Strange 2: Episode 5 - Wolves", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-2-episode-5---wolves", "publisher": "Square Enix", "release_date": "Dec  3 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 83, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/5a17914ae1b9cb71aa37a1e1ffa4992f-98.jpg", "descriptions": "After a tragic incident, brothers Sean and Daniel Diaz run away from home. Fearing the police, and dealing with Daniel’s new telekinetic power, the boys head to Mexico. Each stop on their journey brings new friends and new challenges."}, {"name": "Astro's Playroom", "details_link": "https://www.metacritic.com/game/playstation-5/astros-playroom", "publisher": "Sony Interactive Entertainment", "release_date": "Nov 12 2020", "developers": ["JapanStudio", "Team Asobi"], "platforms": "PlayStation 5", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 83, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/3/6f79c670d0720dcd3bed9c10dfc3195e-98.jpg", "descriptions": "Astro and his crew lead you on a magical introduction through PS5 in this fun platformer that comes pre-loaded on PS5. Explore four worlds, each based on PS5’s console components. Each area showcases innovative gameplay that taps into the new features of the PS5’s DualSense wireless controller."}, {"name": "Alien: Isolation", "details_link": "https://www.metacritic.com/game/switch/alien-isolation", "publisher": "Sega", "release_date": "Dec  5 2019", "developers": ["Creative Assembly", "Feral Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/652504c6461f4228242753c2227f0384-98.jpg", "descriptions": "HOW WILL YOU SURVIVE? \r\rDiscover the true meaning of fear in Alien: Isolation, a survival horror set in an atmosphere of constant dread and mortal danger. Fifteen years after the events of Alien, Ellen Ripleys daughter, Amanda enters a desperate battle for survival, on a mission to unravelHOW WILL YOU SURVIVE? \r\rDiscover the true meaning of fear in Alien: Isolation, a survival horror set in an atmosphere of constant dread and mortal danger. Fifteen years after the events of Alien, Ellen Ripleys daughter, Amanda enters a desperate battle for survival, on a mission to unravel the truth behind her mother's disappearance. \r\rAs Amanda, you will navigate through an increasingly volatile world as you find yourself confronted on all sides by a panicked, desperate population and an unpredictable, ruthless Alien. \r\rUnderpowered and underprepared, you must scavenge resources, improvise solutions and use your wits, not just to succeed in your mission, but to simply stay alive. \r\rOvercome an ever-present deadly threat  Experience persistent fear as a truly dynamic and reactive Alien uses its senses to hunt you down and respond to your every move. \r\rImprovise to survive  Hack systems, scavenge for vital resources and craft items to deal with each situation. Will you evade your enemies, distract them or face them head on? \r\rExplore a world of mystery and betrayal  Immerse yourself in the detailed setting of Sevastopol, a decommissioned trading station on the fringes of space. Encounter a rich cast of inhabitants in a world scarred by fear and mistrust. \r\rWhen she left Earth, Ellen Ripley promised her daughter Amanda she would return home for her 11th birthday. Amanda never saw her again. \r\rFifteen years later, Amanda, now a Weyland-Yutani employee, hears that the flight recorder of her mothers ship, the Nostromo, has been recovered at the remote trading station Sevastopol. The temptation for her to finally understand what happened is too much to resist. When the crew arrive at Sevastopol, they find something is desperately wrong. It all seems to be connected to an unknown menace, stalking and killing deep in the shadows. \r\rIn order to uncover the truth about her mother, Amanda is forced to confront the same terrifying thing that separated them.… Expand"}, {"name": "Donkey Kong Country Returns 3D", "details_link": "https://www.metacritic.com/game/3ds/donkey-kong-country-returns-3d", "publisher": "Nintendo", "release_date": "May 24 2013", "developers": ["Monster Games Inc."], "platforms": "3DS", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/31e91b0a87c864d8ddf4072876ba8267-98.jpg", "descriptions": "Donkey Kong Country Returns 3D is a portable 3D makeover of the smash-hit Wii game."}, {"name": "Persona 5 Strikers", "details_link": "https://www.metacritic.com/game/playstation-4/persona-5-strikers", "publisher": "Sega", "release_date": "Feb 19 2021", "developers": ["Omega Force"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/def13b51b544932df29e8fb253e23645-98.jpg", "descriptions": "The sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gatherThe sequel to the international smash-hit Persona 5 (3.2 million copies world-wide) is now available as the series' first action RPG! Featuring an all-new story set up half a year after the events of P5! \r\rTravel Japan! \rFollowing the events of P5, the Phantom Thieves of Hearts gather once more during their summer break to solve the mystery behind new change of heart cases that are occurring all over Japan! \r\rPersona 5 is now an action RPG!\rThe new action battle system makes hitting enemy weak points to activate a 1 More or All-Out Attack, which fans have come to love, even easier!\r You can even use Baton Pass to play as other characters!\rIn the newly introduced Jails, you can switch controls between characters at any time! Clear the game with style by using different characters in unique situations!\r \rNew character! \rWho is this new mysterious girl you meet in the Shibuya of the other world? Find out as she fights alongside you as the newest member of the Phantom Thieves of Hearts!… Expand"}, {"name": "Guacamelee! 2", "details_link": "https://www.metacritic.com/game/playstation-4/guacamelee!-2", "publisher": "DrinkBox Studios", "release_date": "Aug 21 2018", "developers": ["DrinkBox Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/0af6af92d84b94b3f7b44c4b923a3080-98.jpg", "descriptions": "Head back to the Mexiverse in this sequel to Guacamelee! Uppercut your way to victory across stunning new hand-crafted levels. Featuring full 4-player co-op, fancy new wrestling moves, sassy new bosses, twice the enemies, and 300% more chickens."}, {"name": "Unreal Championship", "details_link": "https://www.metacritic.com/game/xbox/unreal-championship", "publisher": "Atari", "release_date": "Sep 24 2002", "developers": ["Digital Extremes"], "platforms": "Xbox", "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/9e3ba88a0d4d0346d5f271cea94a42e0-98.jpg", "descriptions": "The latest edition to the Unreal universe immerses you in adrenaline-packed multiplayer and single-player frag-fests.  Designed specifically for Xbox and the Xbox controller, the game incorporates console-specific features such as joypad-activated special moves, double jump, power-ups,The latest edition to the Unreal universe immerses you in adrenaline-packed multiplayer and single-player frag-fests.  Designed specifically for Xbox and the Xbox controller, the game incorporates console-specific features such as joypad-activated special moves, double jump, power-ups, unlockable features, and more to keep gamers glued to their couches with knuckle-whitened tension.  You have the choice to either fight through a series of matches in the single-player mode against computer-controlled opponents or play online against human-controlled adversaries.… Expand"}, {"name": "Halo: Combat Evolved", "details_link": "https://www.metacritic.com/game/pc/halo-combat-evolved", "publisher": "Microsoft Game Studios", "release_date": "Sep 30 2003", "developers": ["Gearbox Software"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/06c931e31b3cc26d5e617897a58d6c9d-98.jpg", "descriptions": "In a desperate attempt to keep a conquering alien race called the Covenant from finding Earth, you--a cybernteically enhanced soldier representing the peak of human military evolution--and a ragtag group of Marines flee to a distant uncharted system where you unexpectedly stumble acrossIn a desperate attempt to keep a conquering alien race called the Covenant from finding Earth, you--a cybernteically enhanced soldier representing the peak of human military evolution--and a ragtag group of Marines flee to a distant uncharted system where you unexpectedly stumble across Halo, an enormous alien artifact in orbit between a gas giant and its moon. Your objective: Uncover Halo's horrible secret, and destroy mankind's nemesis - the Covenant. [Microsoft]… Expand"}, {"name": "Ultra Street Fighter IV", "details_link": "https://www.metacritic.com/game/playstation-3/ultra-street-fighter-iv", "publisher": "Capcom", "release_date": "Jun  3 2014", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "PlayStation 3"], "num_players": "", "genres": ["Fighting", "3D", "Action", "Fighting", "2D", "3D"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/af4dcddbe0eaac0d573376c9f6f13ba3-98.jpg", "descriptions": "The series evolves to a whole new level with Ultra Street Fighter IV for PlayStation 3, Xbox 360, and PC. Continuing the tradition of excellence the series is known for, five new characters and six new stages have been added for even more fighting mayhem, with rebalanced gameplay andThe series evolves to a whole new level with Ultra Street Fighter IV for PlayStation 3, Xbox 360, and PC. Continuing the tradition of excellence the series is known for, five new characters and six new stages have been added for even more fighting mayhem, with rebalanced gameplay and original modes topping off this offering.… Expand"}, {"name": "ESPN NBA 2K5", "details_link": "https://www.metacritic.com/game/playstation-2/espn-nba-2k5", "publisher": "Sega", "release_date": "Sep 30 2004", "developers": ["Visual Concepts"], "platforms": "PlayStation 2", "num_players": "10  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/4835f3c47c7e4dd7c182465dc4708043-98.jpg", "descriptions": "A new momentum based gameplay system that gives gamers a complete difference in control between various types of players. Now a player’s ability and physical makeup will determine how fast they can run up the court on a fast break, how well they can cut to the basket off theirA new momentum based gameplay system that gives gamers a complete difference in control between various types of players. Now a player’s ability and physical makeup will determine how fast they can run up the court on a fast break, how well they can cut to the basket off their opponent, and more, creating a new level of realism and natural team movement. Pioneering a new standard in artificial intelligence, computer-controlled players now have the ability to decide independently how they can best help their team and realistically react based on each human players’ actions. CPU players determine the best way they can help win in accordance with each team’s philosophy and distinct play sets. Beyond the Next Movement, IsoMotion2 improves upon the exciting dribble system of last year. Deftly perform spins, crossovers, and fakes outside the perimeter and now, in the post. Use enhanced IsoMotion2 on the defensive side to contain overaggressive ball-handlers and force turnovers. One of the most innovative features in sports games gets twice as big with over 100 new items, new timed mini games, and multi-player games. New respect level determines which player will answer your call for 24/7 games. [ESPN]… Expand"}, {"name": "Darksiders II", "details_link": "https://www.metacritic.com/game/xbox-360/darksiders-ii", "publisher": "THQ", "release_date": "Aug 14 2012", "developers": ["Vigil Games"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Fantasy", "Fantasy", "Open-World"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/c74c33e3c9dc995a569e77cbfc0cfc38-98.jpg", "descriptions": "Awakened by the End of Days, Death, the most feared of the legendary Four Horsemen, embarks on a journey to redeem his brother's name. Become the terrifying force which everyone fears but nothing can escape."}, {"name": "Nobody Saves the World", "details_link": "https://www.metacritic.com/game/switch/nobody-saves-the-world", "publisher": "DrinkBox Studios", "release_date": "Apr 14 2022", "developers": ["DrinkBox Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/a746fa2b984dc7e685c8ac6a64b4dae1-98.jpg", "descriptions": "When the ancient Calamity re-awakens, who can save the world? Nobody! (That's you, you're Nobody.) Master the art of transformation to become a Slug, Ghost, Dragon, and more in this new take on Action RPGs from the creators of Guacamelee!Complete quests to discover and swap between 15+When the ancient Calamity re-awakens, who can save the world? Nobody! (That's you, you're Nobody.) Master the art of transformation to become a Slug, Ghost, Dragon, and more in this new take on Action RPGs from the creators of Guacamelee!Complete quests to discover and swap between 15+ varied and distinct Forms. Mix and match abilities in unexpected ways to unlock and complete even MORE challenging quests. Explore a vast overworld - on your own or with a friend online - while clearing shape-shifting dungeons in an effort to stop The Calamity and save the world!… Expand"}, {"name": "Crusader Kings III", "details_link": "https://www.metacritic.com/game/xbox-series-x/crusader-kings-iii", "publisher": "Paradox Interactive", "release_date": "Mar 29 2022", "developers": ["Lab42"], "platforms": ["PC", "PlayStation 5", "Xbox Series X"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 83, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/80a71416982b743418c57f7d25e8e69e-98.jpg", "descriptions": "Paradox Development Studio brings you the sequel to one of the most popular strategy games ever made. Crusader Kings III is the heir to a long legacy of historical grand strategy experiences and arrives with a host of new ways to ensure the success of your royal house."}, {"name": "Final Fantasy IV Pixel Remaster", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-iv-pixel-remaster", "publisher": "Square Enix", "release_date": "Sep  8 2021", "developers": ["Square Enix", "TOSE"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/8cc2fae6aeaa2ad9a032e49713aaa6fd-98.jpg", "descriptions": "FINAL FANTASY IV delivers one of the richest and most powerful stories in the series. It's filled with characters and scenarios that fans continue to love to this day.It focuses on the dark knight Cecil, who finds himself stripped of his position and rank when he questions his king'sFINAL FANTASY IV delivers one of the richest and most powerful stories in the series. It's filled with characters and scenarios that fans continue to love to this day.It focuses on the dark knight Cecil, who finds himself stripped of his position and rank when he questions his king's increasingly troubling orders. When he's sent on a simple delivery mission with his friend Kain, the shocking events that follow send him and a group of allies on an incredible journey of betrayal, love and redemption.This is the first game to feature the Active Time Battle (ATB) system, which combines turn-based and real-time elements to create fast-paced and strategic combat.… Expand"}, {"name": "Metro Exodus: Complete Edition", "details_link": "https://www.metacritic.com/game/playstation-5/metro-exodus-complete-edition", "publisher": "Deep Silver", "release_date": "Jun 18 2021", "developers": ["4A Games"], "platforms": ["PC", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/51ca7fdf33d97a42723dc3793ecc04da-98.jpg", "descriptions": "The year is 2036.A quarter-century after nuclear war devastated the earth, a few thousand survivors still cling to existence beneath the ruins of Moscow, in the tunnels of the Metro.\n\nThey have struggled against the poisoned elements, fought mutated beasts and paranormal horrors, andThe year is 2036.A quarter-century after nuclear war devastated the earth, a few thousand survivors still cling to existence beneath the ruins of Moscow, in the tunnels of the Metro.They have struggled against the poisoned elements, fought mutated beasts and paranormal horrors, and suffered the flames of civil war.But now, as Artyom, you must flee the Metro and lead a band of Spartan Rangers on an incredible, continent-spanning journey across post-apocalyptic Russia in search of a new life in the East.Metro Exodus is an epic, story-driven first person shooter from 4A Games that blends deadly combat and stealth with exploration and survival horror in one of the most immersive game worlds ever created.Explore the Russian wilderness across vast, non-linear levels and follow a thrilling story-line that spans an entire year through spring, summer and autumn to the depths of nuclear winter.Inspired by the novels of Dmitry Glukhovsky, Metro Exodus continues Artyom's story in the greatest Metro adventure yet.Features:* Embark on an incredible journey - board the Aurora, a heavily modified steam locomotive, and join a handful of survivors as they search for a new life in the East* Experience Sandbox Survival - a gripping story links together classic Metro gameplay with new huge, non-linear levels* A beautiful, hostile world - discover the post-apocalyptic Russian wilderness, brought to life with stunning day / night cycles and dynamic weather* Deadly combat and stealth scavenge and craft in the field to customize your arsenal of hand-made weaponry, and engage human and mutant foes in thrilling tactical combat* Your choices determine your comrades' fate - not all your companions will survive the journey; your decisions have consequence in a gripping storyline that offers massive re-playability* The ultimate in atmosphere and immersion - a flickering candle in the darkness; a ragged gasp as your gasmask frosts over; the howl of a mutant on the night wind - Metro will immerse and terrify you like no other game… Expand"}, {"name": "FAR: Lone Sails", "details_link": "https://www.metacritic.com/game/playstation-4/far-lone-sails", "publisher": "Okomotive", "release_date": "Apr  2 2019", "developers": ["Okomotive"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "2D"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/f099af5c9bd8849cd97a20b90468b0b8-98.jpg", "descriptions": "Traverse a desiccated seabed littered with the remains of a decaying civilization. Keep your vessel going, overcome obstacles, and withstand hazardous weather conditions. Where will this journey take you? Are you the last of your kind?"}, {"name": "Valkyria Chronicles 4", "details_link": "https://www.metacritic.com/game/pc/valkyria-chronicles-4", "publisher": "Sega", "release_date": "Sep 25 2018", "developers": ["Sega"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/76d842623d42679fd837d962c60a3f7a-98.jpg", "descriptions": "A Continent Engulfed in the Bitter Flames of War. Commander Claude Wallace and his childhood friends set out to fight in a desperate war, but bone-chilling blizzards, waves of imperial soldiers, and the godlike powers of the Valkyria stand between them and victory."}, {"name": "Overcooked! 2", "details_link": "https://www.metacritic.com/game/xbox-one/overcooked!-2", "publisher": "Team17", "release_date": "Aug  7 2018", "developers": ["Ghost Town Games Ltd."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Arcade"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/968c117bd93069a721e58d4ed4a10878-98.jpg", "descriptions": "Overcooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:\n\n* Online/LocalOvercooked returns with a brand-new helping of chaotic cooking action! Journey back to the Onion Kingdom and assemble your team of chefs in classic couch co-op or online play for up to four players. Hold onto your aprons... it's time to save the world (again!)FEATURES:* Online/Local Multiplayer Madness - You'll knead to work together to get the highest score in chaotic local and online multiplayer.* Feast Your Eyes On This - Cook in new kitchens ranging from sushi restaurants, magic schools and mines!* Romaine Calm! - Travel through teleporters, across moving platforms and save time by throwing ingredients across dynamic kitchens that shift and evolve.* Whet Your Appetite! - Cook up a range of new recipes including sushi, cakes, burgers and pizzas.… Expand"}, {"name": "Mega Man Legacy Collection", "details_link": "https://www.metacritic.com/game/switch/mega-man-legacy-collection", "publisher": "Capcom", "release_date": "May 22 2018", "developers": ["Capcom"], "platforms": ["3DS", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/cdcbdeb8a7c3fe4632b701ccb6f9435f-98.jpg", "descriptions": "Mega Man Legacy Collection is a celebration of the 8-bit history of Capcoms iconic Blue Bomber. Featuring faithful reproductions of the series origins with the original six Mega Man games, the Legacy Collection will remind long-time fans and introduce newcomers to what made Mega Man such aMega Man Legacy Collection is a celebration of the 8-bit history of Capcoms iconic Blue Bomber. Featuring faithful reproductions of the series origins with the original six Mega Man games, the Legacy Collection will remind long-time fans and introduce newcomers to what made Mega Man such a popular and iconic character. Mega Man Legacy Collection will feature all six games and more!\r In addition to the six Mega Man games, Mega Man Legacy Collection features new ways to experience the classic games with the Museum Mode and new Challenge Mode. Challenge Mode remixes gameplay segments from all six games, with plenty of scaling difficulty objectives for experienced players to conquer yet serving as a good starting point for new players, too. Museum Mode contains a comprehensive collection of history, high-res art and original concept pieces  a mega treat for any fan of Mega Man and video game history.\r FEATURES\r * Six classic games in one  Play a piece of video game history with the original six Mega Man games and experience the origins of the classic series.\r * 8-bit style with HD flair  The games retain their retro 8-bit style with an added HD finish, giving a crisp, clean look to the charming, classic sprites.\r * Challenge remix mode for new and veteran players  The robust new Challenge Mode remixes gameplay from all six games for a new type of challenge. It provides both increasingly difficult trials for experienced players and also teaches newcomers to become familiar with the style of the games and tackle some of the trickier areas.\r * Museum of the era  The Museum Mode features a massive repository of history and art collected from the era of the games in this collection. Take a look back at the history of Mega Man with loads of information, high-res art, concept pieces, sketches and more in the Museum.\r * Developed with an all-new engine  Using the newly developed Eclipse Engine, Capcom and Digital Eclipse are able to archive these six pieces of video game history with faithful reproductions of the originals for a new generation of gamers.\r * Leaderboards and video replays  Fans will be able to watch video replays of the top players on the leaderboards, showcasing a whole new generation of Mega Man talent!… Expand"}, {"name": "FIFA 18", "details_link": "https://www.metacritic.com/game/xbox-one/fifa-18", "publisher": "Electronic Arts", "release_date": "Sep 26 2017", "developers": ["EA Vancouver"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 83, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/8/5f73deac69e76bf7db03713e829fc4f9-98.jpg", "descriptions": "Score incredible goals in FIFA 18 as new movement and finishing animations unlock more fluid striking and heading of the ball. All-new crossing controls bring greater options to how you send it into the box. Whipped to the spot, arching deliveries, and pinged crosses to the back-stick willScore incredible goals in FIFA 18 as new movement and finishing animations unlock more fluid striking and heading of the ball. All-new crossing controls bring greater options to how you send it into the box. Whipped to the spot, arching deliveries, and pinged crosses to the back-stick will shake up your attacks in the final third. The biggest step in gameplay, FIFA 18 introduces Real Player Motion Technology, an all-new animation system that unlocks the next level of responsiveness and player personality. Now Cristiano Ronaldo and other top players feel and move exactly like they do on the real pitch. From tiki-taka to high press, new Team Styles put the most recognised tactics of the world's best clubs on the pitch in FIFA 18. Enjoy more time and space to read the play through New Player Positioning, while improved tactics give players greater options on the ball as teammates exploit space and make new attacking runs. [Electronic Arts]… Expand"}]