[{"name": "Tiny Racer", "details_link": "https://www.metacritic.com/game/switch/tiny-racer", "publisher": "IceTorch Interactive", "release_date": "Jul 31 2020", "developers": ["IceTorch Interactive"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 29, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/773a20a004df650228476b03639dd9fa-98.jpg", "descriptions": "Pick your tiny car, push the gas down and start the great race. Try not to fall on Monkey Bridge. Hold on tight and be careful on the ramps in Forest Jumper. Watch out for sharp turns and be the first in Rock Heaven. Don’t let the messy kitchen beat you in Cooking Madness. Speed throughPick your tiny car, push the gas down and start the great race. Try not to fall on Monkey Bridge. Hold on tight and be careful on the ramps in Forest Jumper. Watch out for sharp turns and be the first in Rock Heaven. Don’t let the messy kitchen beat you in Cooking Madness. Speed through sunbeds and surfboards right to the finish line in Beach Party. Play alone or have fun together with your friends, kids or parents. Everything thanks to a well balanced and easy to change difficulty settings and local multiplayer.\r Start a tournament to unlock new maps. Be the fastest and become the champion. Improve your skills with the time trial. Race on your favorite tracks in arcade mode.\r Pick a wacky car, choose the absurd track and let the race begin!!! 3… 2… 1… START… Expand"}, {"name": "Game Party 2", "details_link": "https://www.metacritic.com/game/wii/game-party-2", "publisher": "Midway", "release_date": "Oct  6 2008", "developers": ["Midway"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation", "Party", "Party", "Party / Minigame"], "meta_score": 29, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/62e1886e015bcf8f5010a851c6250632-98.jpg", "descriptions": "[Also known as \"More Game Party\" in the UK/EU]  With 11 games in all, Game Party 2 for the Nintendo Wii includes fun to play games that will provide hours of enjoyment with friends and family. Game Party 2 features new games like Bean Bags, Horseshoes, Lawn Darts, Puck Bowling and more. Each[Also known as \"More Game Party\" in the UK/EU]  With 11 games in all, Game Party 2 for the Nintendo Wii includes fun to play games that will provide hours of enjoyment with friends and family. Game Party 2 features new games like Bean Bags, Horseshoes, Lawn Darts, Puck Bowling and more. Each game, including classics like Skill Ball, Darts and Hoop Shoot has exciting new features like four player mode, customizable characters and tournament play, making Game Party 2 the ultimate party game for all ages and skill levels. [Midway]… Expand"}, {"name": "Rogue Warrior", "details_link": "https://www.metacritic.com/game/pc/rogue-warrior", "publisher": "Bethesda Softworks", "release_date": "Dec  1 2009", "developers": ["Rebellion"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Arcade", "Modern", "Modern"], "meta_score": 29, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/5/b794a8b88ada9460710b1d4e5d00262b-98.jpg", "descriptions": "Rogue Warrior is a character-driven, first-person-shooter, featuring Richard \"Demo Dick\" Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat. Playing as Richard \"Demo Dick\" Marcinko, you go behind the iron curtain to disrupt a suspectedRogue Warrior is a character-driven, first-person-shooter, featuring Richard \"Demo Dick\" Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat. Playing as Richard \"Demo Dick\" Marcinko, you go behind the iron curtain to disrupt a suspected North Korean ballistic missile program. Soon into the mission, you uncover a conspiracy that could turn the tides of the Cold War in the communists' favor. You must then take the mission into your own hands as you enter into the bowels of the USSR to destroy a technology that could change the balance of geopolitical power, leaving a trail of destruction in your wake! [Bethesda Softworks]… Expand"}, {"name": "Jumper: Griffin's Story", "details_link": "https://www.metacritic.com/game/xbox-360/jumper-griffins-story", "publisher": "Brash Entertainment", "release_date": "Feb 12 2008", "developers": ["Red Tribe"], "platforms": "Xbox 360", "genres": ["Action", "Beat-'Em-Up", "General", "Fighting", "3D"], "meta_score": 29, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/6/a66700a24c7f87561a0e47a76f6c8351-98.jpg", "descriptions": "Jumpers, people with a genetic anomaly that enables them to teleport themselves instantaneously to anywhere on the globe, have existed for centuries. An age-old battle rages between the Jumpers and the Paladins, a clandestine organization set on eliminating them from the planet. The JumperJumpers, people with a genetic anomaly that enables them to teleport themselves instantaneously to anywhere on the globe, have existed for centuries. An age-old battle rages between the Jumpers and the Paladins, a clandestine organization set on eliminating them from the planet. The Jumper game extends the film's storyline, following Griffin, a battle-hardened Jumper determined to avenge the death of his parents at the hands of the Paladins. Griffin's quest to find the killer spans exotic locales around the world. Jump Ability - Use your teleportation skills to \"Jump\" within hand-to-hand combat range of an enemy to start dishing out devastating blows. Combos - Exciting and intense layered combo fighting system. Finishing Moves - Instantly teleport enemies to exotic perilous locations to finish them. Enemy classes - Deeply ranked hierarchy of Paladin enemy types. Exotic Locales - 5 combat arenas set all around the world – Colosseum, Griffin's Desert Lair, Nepal, Tokyo Streets and Experimental Lab Facility. Unlockable abilities - Unlockable skills and combos through gameplay. [Brash Entertainment]… Expand"}, {"name": "Batman: Dark Tomorrow", "details_link": "https://www.metacritic.com/game/gamecube/batman-dark-tomorrow", "publisher": "Kemco", "release_date": "Mar 25 2003", "developers": ["Kemco"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 29, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/1/f15c62236f3819bbe720e70e06104815-98.jpg", "descriptions": "Batman, the Dark Knight detective of Gotham City, is back in an all-new adventure. In Batman: Dark Tomorrow, it's up to Batman to solve the mystery and save the day. The legendary Caped Crusader must use all his mental and physical skills, batglider capabilities, devices from his utilityBatman, the Dark Knight detective of Gotham City, is back in an all-new adventure. In Batman: Dark Tomorrow, it's up to Batman to solve the mystery and save the day. The legendary Caped Crusader must use all his mental and physical skills, batglider capabilities, devices from his utility belt, and sleuthing prowess to fight crime and defeat enemies. You must battle both new and familiar enemies, including Mr. Freeze, Poison Ivy, and the Joker. But in some missions, stealth is just as important as brute force.… Expand"}, {"name": "Duke Nukem: Critical Mass", "details_link": "https://www.metacritic.com/game/ds/duke-nukem-critical-mass", "publisher": "Deep Silver", "release_date": "Jun  6 2011", "developers": ["Apogee Software", "Ltd."], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 29, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/d4dd3b5d07a4239ef51257a846f7a6db-98.jpg", "descriptions": "Duke Nukem Critical Mass is the first installment of the Duke Trilogy. Duke is back in action and better than ever on your handheld."}, {"name": "Wild West Online", "details_link": "https://www.metacritic.com/game/pc/wild-west-online", "release_date": "May 10 2018", "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 29, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/8/252242c38f0be3d444d2ef3f1c5236a9-98.jpg", "descriptions": "Welcome to the emergent open world, Wild West-themed action MMO featuring world exploration, resource gathering, PvP combat, PvE missions and much, much more."}, {"name": "Ping Pals", "details_link": "https://www.metacritic.com/game/ds/ping-pals", "publisher": "THQ", "release_date": "Dec  8 2004", "developers": ["WayForward"], "platforms": "DS", "num_players": "8  Online", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 28, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/0/9ed5ef9cbb61684b0d4a39b22f1a6c1b-98.jpg", "descriptions": "Create your very own Ping Pal based on your own individual style by choosing from thousands of different options. Then, trade, play games, discover secret code words, and share your Ping Pal with your friends to earn Coins and unlock cool new items that make your Ping Pal really zing. FindCreate your very own Ping Pal based on your own individual style by choosing from thousands of different options. Then, trade, play games, discover secret code words, and share your Ping Pal with your friends to earn Coins and unlock cool new items that make your Ping Pal really zing. Find and collect all the hottest gear for your Ping Pal. Only one Ping Pals game is needed to start playing and chatting. Play games and chat with up to 16 of your friends at the same time. Thousands of different items to customize your Ping Pal. Swap and trade gear with your friends to collect the coolest stuff for your Ping Pal. Play mini-games (like Hot Potato, Doodle, Top Ten, Pick a Number and Solo Chat), solo or with up to 16 of your friends, to earn valuable Coins that you can use to unlock new items. [THQ]… Expand"}, {"name": "Godzilla Unleashed: Double Smash", "details_link": "https://www.metacritic.com/game/ds/godzilla-unleashed-double-smash", "publisher": "Atari", "release_date": "Nov 20 2007", "developers": ["Santa Cruz Games"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 28, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/68f0c60b361bf5fcebf3492138b1df5d-98.jpg", "descriptions": "Godzilla: Unleashed Double Smash is a fighting game on a giant scale. The game stars the legendary Godzilla and a slew of the most renowned monsters of all-time. Gamers are challenged to ultimately save the planet from mayhem and destruction. Set in urban arenas, Godzilla: Unleashed'sGodzilla: Unleashed Double Smash is a fighting game on a giant scale. The game stars the legendary Godzilla and a slew of the most renowned monsters of all-time. Gamers are challenged to ultimately save the planet from mayhem and destruction. Set in urban arenas, Godzilla: Unleashed's interactive 3D cityscapes, big destructible buildings, soaring skyscrapers and towering alien formations provide the backdrop to epic worldwide destruction. Players claw, kick, stomp, throw and blast their way through the streets of major world cities in order to claim the ultimate, beastly title: King of the Monsters. In addition to a fully reinvented combat system, Godzilla: Unleashed features an innovative non-linear storyline which allows players to influence how the story unfolds through their choices within battles. [Atari]… Expand"}, {"name": "The Quiet Man", "details_link": "https://www.metacritic.com/game/playstation-4/the-quiet-man", "publisher": "Square Enix", "release_date": "Nov  1 2018", "developers": ["Square Enix", "Human Head Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 28, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/7/05a28a73d54faa3db30184a766adf6f7-98.jpg", "descriptions": "The Quiet Man is an immersive story driven cinematic action experience that seamlessly blends high-production live action, realistic CG and pulse-pounding action gameplay that can be completed in one sitting. [Square Enix]"}, {"name": "Rambo: The Video Game", "details_link": "https://www.metacritic.com/game/xbox-360/rambo-the-video-game", "publisher": "Reef Entertainment", "release_date": "Feb 21 2014", "developers": ["Teyon"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General"], "meta_score": 28, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/2/c894eefacdcdc67f303cbd5972ae64ff-98.jpg", "descriptions": "RAMBO The Vidoegame puts players in Rambo’s combat boots and takes them on an action-packed adventure through the iconic action- sequences and story-arcs of FIRST BLOOD, RAMBO: FIRST BLOOD PART II  & RAMBO III. The game features the original movie voice-tracks of John Rambo and Col. SamuelRAMBO The Vidoegame puts players in Rambo’s combat boots and takes them on an action-packed adventure through the iconic action- sequences and story-arcs of FIRST BLOOD, RAMBO: FIRST BLOOD PART II  & RAMBO III. The game features the original movie voice-tracks of John Rambo and Col. Samuel Trautman as well as selected music from the original Rambo Trilogy. … Expand"}, {"name": "Rogue Warrior", "details_link": "https://www.metacritic.com/game/xbox-360/rogue-warrior", "publisher": "Bethesda Softworks", "release_date": "Dec  1 2009", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Arcade", "Modern", "Modern"], "meta_score": 28, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/3/9151ffb9ced6a449b9587e8bf0ebb9fe-98.jpg", "descriptions": "Rogue Warrior is a character-driven, first-person-shooter, featuring Richard \"Demo Dick\" Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat. Playing as Richard \"Demo Dick\" Marcinko, you go behind the iron curtain to disrupt a suspectedRogue Warrior is a character-driven, first-person-shooter, featuring Richard \"Demo Dick\" Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat. Playing as Richard \"Demo Dick\" Marcinko, you go behind the iron curtain to disrupt a suspected North Korean ballistic missile program. Soon into the mission, you uncover a conspiracy that could turn the tides of the Cold War in the communists' favor. You must then take the mission into your own hands as you enter into the bowels of the USSR to destroy a technology that could change the balance of geopolitical power, leaving a trail of destruction in your wake! [Bethesda Softworks]… Expand"}, {"name": "Sneakers", "details_link": "https://www.metacritic.com/game/xbox/sneakers", "publisher": "Microsoft Game Studios", "release_date": "Oct 22 2002", "developers": ["Media.Vision"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 28, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/7/b012030a941feef9e8ce85b77bfcc91f-98.jpg", "descriptions": "Get ready for a fun adventure filled with cartoon combat. In Sneakers, you play Apollo, a mouse who must lead his friends through a human-sized town to battle the enemy. You must protect your troops by directing their actions and throwing wind-up punches and flying kicks. While your smallGet ready for a fun adventure filled with cartoon combat. In Sneakers, you play Apollo, a mouse who must lead his friends through a human-sized town to battle the enemy. You must protect your troops by directing their actions and throwing wind-up punches and flying kicks. While your small size lets you take shortcuts through small holes in the wall, it also makes a rolling apple as dangerous as a tumbling boulder. Only those with cunning and quick minds can leave victoriously.… Expand"}, {"name": "Thundercats", "details_link": "https://www.metacritic.com/game/ds/thundercats", "publisher": "Namco Bandai Games", "release_date": "Oct 30 2012", "developers": ["Aspect"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 28, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/1/dc839107418674d3a571c239f2fb4dc8-98.jpg", "descriptions": "The animated high-action series claws its way onto the Nintendo DS. Become Lion-O and battle Mumm-Ra and his evil forces as you run, jump, and slash your way through action ripped straight from the new animated series. Wield the incredible power of the Sword of Omens in this side-scrollingThe animated high-action series claws its way onto the Nintendo DS. Become Lion-O and battle Mumm-Ra and his evil forces as you run, jump, and slash your way through action ripped straight from the new animated series. Wield the incredible power of the Sword of Omens in this side-scrolling adventure.… Expand"}, {"name": "American McGee Presents Bad Day LA", "details_link": "https://www.metacritic.com/game/pc/american-mcgee-presents-bad-day-la", "publisher": "Aspyr", "release_date": "Sep  6 2006", "developers": ["Enlight Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 28, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/70d4f09eb1b65a14f908d7ac9d95afaa-98.jpg", "descriptions": "From the demented and brilliant mind of American McGee, renowned for his artistically extraordinary vision embodied by \"American McGee's Alice\", comes American McGee Presents: Bad Day L.A., a third-person action/adventure game with a tongue-in-cheek comedic twist. Set in modern day LosFrom the demented and brilliant mind of American McGee, renowned for his artistically extraordinary vision embodied by \"American McGee's Alice\", comes American McGee Presents: Bad Day L.A., a third-person action/adventure game with a tongue-in-cheek comedic twist. Set in modern day Los Angeles, Bad Day L.A. combines a fantastical art style, groundbreaking collaborative gameplay elements and a heavy dose of dark satire to create a truly unforgettable experience. In Bad Day L.A., players are thrust behind the shopping cart of a homeless man turned city-saving crusader, Anthony Williams, a reluctant hero who left behind the privileged life of a successful Hollywood agent after losing his self-respect. Anthony survives in his cocoon of destitution and isolation until Los Angeles comes under attack from zombies, terrorists, earthquakes and other untold disasters. Facing complete annihilation, Anthony is reluctantly forced to begin a cynical quest for salvation. Using only his street smarts and the environment to stay alive, he must save the very city and its citizens he despises, and, in the end, escape what has become a very Bad Day in L.A. [Enlight Software]… Expand"}, {"name": "Mortal Kombat: Special Forces", "details_link": "https://www.metacritic.com/game/playstation/mortal-kombat-special-forces", "publisher": "Midway", "release_date": "Jun 30 2000", "developers": ["Midway"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 28, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/5/0af16bbcd806bdff21cd2ca89f43bfe2-98.jpg", "descriptions": "Explore the world of Mortal Kombat! Play as the battle-hardened Jax in his search for his arch-enemy: the supercriminal Kano. Uncover the pieces to this mysterious story as you battle through complex levels using special moves, combos and weaponry to force the final showdown!"}, {"name": "Dragon Ball: Evolution", "details_link": "https://www.metacritic.com/game/psp/dragon-ball-evolution", "publisher": "Namco Bandai Games America", "release_date": "Apr  8 2009", "developers": ["Dimps Corporation"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Fighting", "3D"], "meta_score": 28, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/7/a91d8a410377a344b40ff3df4ab1c4fd-98.jpg", "descriptions": "In Dragon Ball: Evolution for the PSP system, ultimate powers collide as players match up against their favorite characters from the film release and battle for control of the seven sacred Dragon Balls that have the power to grant any wish. Dragon Ball: Evolution employs an easy-to-learn yetIn Dragon Ball: Evolution for the PSP system, ultimate powers collide as players match up against their favorite characters from the film release and battle for control of the seven sacred Dragon Balls that have the power to grant any wish. Dragon Ball: Evolution employs an easy-to-learn yet difficult to master fighting system which provides everyone the power to pull off stylish and dynamic attacks. Ki (energy) management is essential to gain the upper hand and unleash a devastating attack on their unsuspecting opponents. Participating in intense battles, gamers are invited to follow the path of Goku to his predestined fight against the evil Lord Piccolo in Story mode. Players can also battle against a number of opponents in Arcade mode, accept challenges in Mission mode or hone their technique in Training mode. Dragon Ball: Evolution also lets players challenge friends to online feats of strength in Network Battle mode for infinite replay value. [Namco Bandai Games]… Expand"}, {"name": "Raven's Cry", "details_link": "https://www.metacritic.com/game/pc/ravens-cry", "publisher": "TopWare Interactive", "release_date": "Jan 30 2015", "developers": ["Reality Pump"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Historic", "Historic", "Strategy", "Action Adventure", "Real-Time", "Open-World", "General"], "meta_score": 27, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/0/d09d3744ed4c72c31da9c523a29cc571-98.jpg", "descriptions": "Raven's Cry thrusts you into the dark heart of the Caribbean with the story of Christopher Raven and his quest for revenge against the pirates who killed his family."}, {"name": "Chicken Shoot", "details_link": "https://www.metacritic.com/game/wii/chicken-shoot", "publisher": "DSI Games", "release_date": "Jul  5 2007", "developers": ["Destination Software"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Light Gun"], "meta_score": 27, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/0b7a3482c03e358fcc598fa4afa0f147-98.jpg", "descriptions": "Climb behind the trigger and help our distressed farmer friend obliterate hordes of no good cluckers! Great comic sound effects, and catchy original songs to fashion a world where hunting fowl is a blast! Brilliant animation takes you through forests and villages, through deserts andClimb behind the trigger and help our distressed farmer friend obliterate hordes of no good cluckers! Great comic sound effects, and catchy original songs to fashion a world where hunting fowl is a blast! Brilliant animation takes you through forests and villages, through deserts and mountains, winging winged adversaries and piling up points. [DSI Games]… Expand"}, {"name": "Basement Crawl", "details_link": "https://www.metacritic.com/game/playstation-4/basement-crawl", "publisher": "Bloober Team", "release_date": "Feb 25 2014", "developers": ["Bloober Team"], "platforms": "PlayStation 4", "num_players": "Up to 8 ", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 27, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/4/e4672bad084726fc00e73557f0f0bb58-98.jpg", "descriptions": "Enter the basement, explore dark, sinister arenas and be at one with the insanity. Bomberman inspired mechanics bring party games to the next generation level. Staying alive won't be easy. The only way to survive is to become death itself, crushing all opponents. Fight with, or against yourEnter the basement, explore dark, sinister arenas and be at one with the insanity. Bomberman inspired mechanics bring party games to the next generation level. Staying alive won't be easy. The only way to survive is to become death itself, crushing all opponents. Fight with, or against your friends in a intensive, packed with action online and offline game modes. And remember, because of the horror-based graphics and themes, it's best if you don't play this game alone in the dark. You never know what might be hiding behind you.\r -Dynamic action game that can be played even by four players on one PlayStation4 system at the same time.\r-Up to 8 players online on the battleground.\r-Dozens of traps and skills make lots of different ways to slaughter your opponents\r-Pick from four characters, take advantage of their skills and play it in your own style\r-Video output in Full HD 1080p requires 1080p native display.… Expand"}, {"name": "Looney Tunes: Acme Arsenal", "details_link": "https://www.metacritic.com/game/wii/looney-tunes-acme-arsenal", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct  9 2007", "developers": ["Red Tribe"], "platforms": ["PlayStation 2", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Action", "Action Adventure", "Fantasy", "Platformer", "Fantasy", "3D"], "meta_score": 27, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/3327750c6a0428d14c4c3ebd8d633382-98.jpg", "descriptions": "Looney Tunes: Acme Arsenal is an action-adventure game featuring seven playable Looney Tunes characters, including Bugs Bunny, Daffy Duck, Tazmanian Devil, Foghorn Leghorn, Marvin the Martian, Gossamer and a special secret character, all rendered in high-definition, next-generation graphics.Looney Tunes: Acme Arsenal is an action-adventure game featuring seven playable Looney Tunes characters, including Bugs Bunny, Daffy Duck, Tazmanian Devil, Foghorn Leghorn, Marvin the Martian, Gossamer and a special secret character, all rendered in high-definition, next-generation graphics. Engaging in one or two player cooperative gameplay, gamers find themselves immersed in fast-paced combat, puzzle solving challenges and vehicle-based action in rich environments inspired by the popular, outlandish cartoon tales. Players command an arsenal of ACME melee and projectile weapons in outrageous battles and travel to various locations such as Camelot, Ancient Egypt, Mars, the Wild West, the trenches of World War II and more. Players can take full advantage of the gesture controls in fighting, spin attacks, smash attacks and driving on the Wii version. [Warner Bros. Interactive]… Expand"}, {"name": "Aquaman: Battle for Atlantis", "details_link": "https://www.metacritic.com/game/gamecube/aquaman-battle-for-atlantis", "publisher": "TDK Mediactive", "release_date": "Jul 23 2003", "developers": ["TDK Mediactive"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 27, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/4/53a30121bcbeca83e77da60dcf047075-98.jpg", "descriptions": "Here's your chance to wield the power of Aquaman, the DC Comics superhero, as he defends the deep-sea city of Atlantis against such enemies as Ocean Master, Black Manta, and the Lava Lord of the Fire Trolls. You must fight to save the lost city by using Aquaman's super powers, telepathy, andHere's your chance to wield the power of Aquaman, the DC Comics superhero, as he defends the deep-sea city of Atlantis against such enemies as Ocean Master, Black Manta, and the Lava Lord of the Fire Trolls. You must fight to save the lost city by using Aquaman's super powers, telepathy, and hook-hand. While the game features plenty of intense underwater battles, you can also bombard your enemies from an attack sub in first-person mode.… Expand"}, {"name": "GoDai: Elemental Force", "details_link": "https://www.metacritic.com/game/playstation-2/godai-elemental-force", "publisher": "3DO", "release_date": "Jan 21 2002", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 27, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/3/647e28f5e71a8f3cd71a36af86f31a95-98.jpg", "descriptions": "The time has finally come for Hiro to avenge his family and face the forces of darkness alone. His mastery of the four elements is strong, but not yet powerful enough to face the fifth element: the Void. Now Hiro must become a Master of the Elements and complete the Trials of Earth, Wind,The time has finally come for Hiro to avenge his family and face the forces of darkness alone. His mastery of the four elements is strong, but not yet powerful enough to face the fifth element: the Void. Now Hiro must become a Master of the Elements and complete the Trials of Earth, Wind, Water and Fire. Only then will he be ready to face the powers of darkness in the realm of the final element . . . the Void awaits. [3DO]… Expand"}, {"name": "Rogue Warrior", "details_link": "https://www.metacritic.com/game/playstation-3/rogue-warrior", "publisher": "Bethesda Softworks", "release_date": "Dec  1 2009", "developers": ["Rebellion"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Arcade", "Modern", "Modern"], "meta_score": 27, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/4/59493adf88c64e6bd83a086ceb93fe45-98.jpg", "descriptions": "Rogue Warrior is a character-driven, first-person-shooter, featuring Richard \"Demo Dick\" Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat. Playing as Richard \"Demo Dick\" Marcinko, you go behind the iron curtain to disrupt a suspectedRogue Warrior is a character-driven, first-person-shooter, featuring Richard \"Demo Dick\" Marcinko's explosive personality in an action-packed single player campaign, and intense multiplayer combat. Playing as Richard \"Demo Dick\" Marcinko, you go behind the iron curtain to disrupt a suspected North Korean ballistic missile program. Soon into the mission, you uncover a conspiracy that could turn the tides of the Cold War in the communists' favor. You must then take the mission into your own hands as you enter into the bowels of the USSR to destroy a technology that could change the balance of geopolitical power, leaving a trail of destruction in your wake! [Bethesda Softworks]… Expand"}, {"name": "Fray", "details_link": "https://www.metacritic.com/game/pc/fray", "publisher": "Brain Candy", "release_date": "Feb  8 2012", "developers": ["Brain Candy"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 27, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/0/4bd2477e90a3561c7d7e0ff3264de7f3-98.jpg", "descriptions": "Fray is a gritty sci-fi game set in 2098, a world where civil society is on the brink of collapse."}, {"name": "Druuna: Morbus Gravis", "details_link": "https://www.metacritic.com/game/pc/druuna-morbus-gravis", "publisher": "Microids", "release_date": "Nov 27 2001", "developers": ["Artematica"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Adventure", "General", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 26, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/ee7f8e7b3356c0f751b3c7da1263e6e4-98.jpg", "descriptions": "Condemned to an eternal vegetative state, the very sexy Druuna is waiting for someone to free her from her sick, claustrophobic and dilapidated world, inhabited by people suffering from a terrible virus that transforms them into bloodthirsty beasts.\rA symbiotic computer directly linked toCondemned to an eternal vegetative state, the very sexy Druuna is waiting for someone to free her from her sick, claustrophobic and dilapidated world, inhabited by people suffering from a terrible virus that transforms them into bloodthirsty beasts.\rA symbiotic computer directly linked to Druuna's brain is the only thing that can help you to capture and to relive the situations that have reduced her to a state of \"cold sleep\". You must try to avoid the unscrupulous individuals that live in her mind and face the traps hidden along this uncertain road leading finally to salvation. [Microids]… Expand"}, {"name": "Road Rage", "details_link": "https://www.metacritic.com/game/playstation-4/road-rage", "publisher": "Maximum Games", "release_date": "Nov 14 2017", "developers": ["Maximum Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 26, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/4/40bced41c40342cc87867cbbd375b6f7-98.jpg", "descriptions": "Road Rage is an over-the-top, knock-down-drag-out motorcycle combat game that tests your skill on a range of badass bikes. Race, fight, and hustle your way through the ranks of an insane outlaw motorcycle gang."}, {"name": "Mucha Lucha! Mascaritas of the Lost Code", "details_link": "https://www.metacritic.com/game/game-boy-advance/mucha-lucha!-mascaritas-of-the-lost-code", "publisher": "Ubisoft", "release_date": "Nov 18 2003", "developers": ["Digital Eclipse"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 26, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/8/cac790e339613618f08b3ab3c0ba2757-98.jpg", "descriptions": "Mucha Lucha! Mascaritas of the Lost Code is a game so utterly devoid of challenge that actually calling it a game almost seems too generous."}, {"name": "Stake: Fortune Fighters", "details_link": "https://www.metacritic.com/game/xbox/stake-fortune-fighters", "publisher": "Metro3D", "release_date": "May  6 2003", "developers": ["Gameness Art Software"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 26, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/0/5d070034564e02fa89852d29c497ba4e-98.jpg", "descriptions": "Stake - the ultimate combat event! It's winner-take-all as the world's best brawl for supremacy. More than the coveted Stake Emblem is on the line in the wildest competition ever for riches, fame and respect. Enter the arena. Face your foe."}, {"name": "HBO Boxing", "details_link": "https://www.metacritic.com/game/playstation/hbo-boxing", "publisher": "Acclaim", "release_date": "Nov 20 2000", "developers": ["Osiris Studios"], "platforms": "PlayStation", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 26, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/8/23fb979e754394240c3e1c7036c19cfd-98.jpg", "descriptions": "HBO Boxing is another disappointing boxing game that fails to even come close to re-creating the look and feel of the sport in the ring."}, {"name": "Charlie and the Chocolate Factory", "details_link": "https://www.metacritic.com/game/pc/charlie-and-the-chocolate-factory", "publisher": "Global Star Software", "release_date": "Jul 12 2005", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 26, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/2/a628202d5b365600c4a1dad369e76a1b-98.jpg", "descriptions": "Step inside the magical world of Willy Wonka's famous chocolate factory. Based on the feature film directed by Tim Burton and the classic Roald Dahl book, the game allows players to explore deep inside the factory and play the beloved story as Charlie Bucket. Find a Golden Ticket and, alongStep inside the magical world of Willy Wonka's famous chocolate factory. Based on the feature film directed by Tim Burton and the classic Roald Dahl book, the game allows players to explore deep inside the factory and play the beloved story as Charlie Bucket. Find a Golden Ticket and, along with four other children, win a personal tour of Willy Wonka's factory guided by the notorious and reclusive candy-maker himself. Embark on a fantastic adventure exploring the many extraordinary environments of the factory, including some from the book that do not appear in the film. Discover what happens after the other children, greed-driven and unrestrained, wreak havoc throughout the factory. Then save the chocolate factory from their destruction by solving mystifying puzzles and using inventive candy powers. By helping the Oompa-Loompas and restoring order to the factory, Charlie can earn the respect of Willy Wonka and win an unexpected prize. Acquire incredible abilities by using fantastic new candies in order to save the factory. Stop the \"rotten\" children from causing chaos and destruction throughout the candy factory. Repair huge, bizarre candy-making machines by solving puzzles and enlisting the help of the Oompa-Loompas. Explore numerous rooms and environments inside Willy Wonka's chocolate factory. [Global Star]… Expand"}, {"name": "R.I.P.D. The Game", "details_link": "https://www.metacritic.com/game/pc/ripd-the-game", "publisher": "Atlus", "release_date": "Jul 16 2013", "developers": ["Old School Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Sci-Fi", "Arcade"], "meta_score": 26, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/2/dd2e436ca79f1fe746148912e4a42a59-98.jpg", "descriptions": "Based on the 3D supernatural action-adventure film, R.I.P.D., you and your partner strap on the holsters of two lawmen assigned to the otherworld to protect and serve the living from an increasingly destructive array of souls who refuse to move peacefully to the other side. Top-notchBased on the 3D supernatural action-adventure film, R.I.P.D., you and your partner strap on the holsters of two lawmen assigned to the otherworld to protect and serve the living from an increasingly destructive array of souls who refuse to move peacefully to the other side. Top-notch teamwork and an arsenal of badass weapons are the keys to defeating your enemies and bringing order back to the world.… Expand"}, {"name": "KISS Pinball", "details_link": "https://www.metacritic.com/game/playstation/kiss-pinball", "publisher": "Take-Two Interactive", "release_date": "Apr 25 2001", "developers": ["Wildfire Studios"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 26, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/2/f466fe53fe1ddc3ea6ea30ab34d18884-98.jpg", "descriptions": "KISS fans will be disappointed by the distinct lack of KISS, and pinball fans will be disappointed by the distinct lack of pinball."}, {"name": "Deca Sports Freedom", "details_link": "https://www.metacritic.com/game/xbox-360/deca-sports-freedom", "publisher": "Hudson Entertainment", "release_date": "Nov 18 2010", "developers": ["Hudson", "AI"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Sports", "General", "General", "Individual", "Athletics"], "meta_score": 26, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/5/261ee5d37c54a29606711e1200a50d0c-98.jpg", "descriptions": "DECA SPORTS FREEDOM will take sports gaming to the next level and to the XBox 360 console for the first time with 10 new sporting events designed especially for Kinect.  Players will compete in Tennis, Boxing, Archery, Paintball, Beach Volleyball, Dodge Ball, Kendo, Mogul Skiing, SnowboardDECA SPORTS FREEDOM will take sports gaming to the next level and to the XBox 360 console for the first time with 10 new sporting events designed especially for Kinect.  Players will compete in Tennis, Boxing, Archery, Paintball, Beach Volleyball, Dodge Ball, Kendo, Mogul Skiing, Snowboard Cross and even Figure Skating.  DECA SPORTS FREEDOM takes advantage of Kinect for Xbox 360's advanced technology and allows gamers to compete controller-free against friends and family, and even online against \"DECAthletes\" around the world through Xbox LIVE online entertainment network.  Players' movements are mirrored by their avatars, which appear in the game as the athletes.  DECA SPORTS FREEDOM will deliver the experience of the original \"Everybody Sports Game\" with exciting next-generation gameplay.… Expand"}, {"name": "Tenkai Knights: Brave Battle", "details_link": "https://www.metacritic.com/game/3ds/tenkai-knights-brave-battle", "publisher": "Bandai Namco Games", "release_date": "Oct  7 2014", "developers": ["Bandai Namco Games"], "platforms": "3DS", "genres": ["Action", "General"], "meta_score": 26, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/4/f4c9dafc6bef9d6ef9b14bc66e797864-98.jpg", "descriptions": "Fight evil robots as the heroes of the animated TV series in Tenkai Knights: Brave Battle on Nintendo 3DS and 2DS.\r Experience the rush of robotic power in shape-shifting action game Tenkai Knights: Brave Battle on Nintendo 3DS and 2DS! Based on the animated TV series, prepare to bring theFight evil robots as the heroes of the animated TV series in Tenkai Knights: Brave Battle on Nintendo 3DS and 2DS.\r Experience the rush of robotic power in shape-shifting action game Tenkai Knights: Brave Battle on Nintendo 3DS and 2DS! Based on the animated TV series, prepare to bring the big guns - and swords! - into play against the villainous Vilius and his Corrupted Army. Can you stop him before he annihilates two entire planets?!\r When teenagers Guren, Ceylan, Chooki and Toxsa discover a rip in time and space, they arrive on planet Quarton, transformed into shape-shifting hero robots known as the Tenkai Knights! As Bravenwolf, Tributon, Lydendor and Valorn, their legendary prowess is put to the test when the rogue robot Vilius sets his sights on destroying both Earth and Quarton.\r Through explosive 2D, side-scrolling action, battle hordes of transforming mechanoids using each heros unique skillsets. There are stacks of strategies to employ, like Bravenwolfs nifty slides and slash attacks, or you can get to grips with Tributons deadly crossbow - perfect for picking off distant enemies! Better yet, Valorn can mash foes near and far, while Lydendor takes down bots with high-speed strikes. Robofusion Mode lets you combine with an ally to boost your powers, as you fight side-by-side for a set time.\r As you carve and blast a path to victory, youll get to use parts from defeated enemies to forge new equipment. With over a hundred customisation parts to discover, customise your character to improve statistics such as Dash, Range and Boost, and tweak them to fit your play style. Exploit enemy weaknesses or adapt to different terrains across the stages, then engage Titan Mode to beat the big bad boss, one-on-one!\r In addition to Story Mode, you can get together with up to three mates in VS Mode via Local Play to bash the bricks off each other in robo-tastic rumbles. So shape-shift into action and prepare to save not one but two worlds in Tenkai Knights: Brave Battle on Nintendo 3DS and 2DS!\r -Play as your favourite characters from the animated TV series to save the world from Vilius robotic wrath!\r-Take parts from downed enemies to create unique equipment to suit your play style\r-Experience the action alone or with an ally - fight through story missions, then battle your mates in VS Mode!\r-Use the Touch Screen to track your enemies and use items… Expand"}, {"name": "Aquaman: Battle for Atlantis", "details_link": "https://www.metacritic.com/game/xbox/aquaman-battle-for-atlantis", "publisher": "TDK Mediactive", "release_date": "Jul 30 2003", "developers": ["Lucky Chicken"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 26, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/3/362b35188faa1cf868abd9456c9b9a37-98.jpg", "descriptions": "Here's your chance to wield the power of Aquaman, the DC Comics superhero, as he defends the deep-sea city of Atlantis against such enemies as Ocean Master, Black Manta, and the Lava Lord of the Fire Trolls. You must fight to save the lost city by using Aquaman's super powers, telepathy, andHere's your chance to wield the power of Aquaman, the DC Comics superhero, as he defends the deep-sea city of Atlantis against such enemies as Ocean Master, Black Manta, and the Lava Lord of the Fire Trolls. You must fight to save the lost city by using Aquaman's super powers, telepathy, and hook-hand. While the game features plenty of intense underwater battles, you can also bombard your enemies from an attack sub in first-person mode.… Expand"}, {"name": "Survivor (2001)", "details_link": "https://www.metacritic.com/game/pc/survivor-2001", "publisher": "Atari", "release_date": "Nov 12 2001", "developers": ["Magic Lantern"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Adventure", "General", "General"], "meta_score": 26, "users_score": 2.3, "image": "https://static.metacritic.com/images/products/games/2/8c0c1bbb4ff1d04c523f6972eede6ed1-98.jpg", "descriptions": "Play as any of the actual Pulau Tiga and Australian Outback cast members or create your own character. See if you have what it takes to become the Ultimate Survivor. [Infogrames]"}, {"name": "Jenga World Tour", "details_link": "https://www.metacritic.com/game/wii/jenga-world-tour", "publisher": "Atari", "release_date": "Dec  7 2007", "developers": ["Atomic Planet Entertainment"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 26, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/7/d479e0ca0fc937c6803b14f0494839d6-98.jpg", "descriptions": "Jenga is based on the world famous wooden block tower building game. Designed to make the most of the innovative control systems on the Wii and DS, the game offers unpredictable, quick- paced, tactical play that combines suspense and risk-taking, where mounting anticipation comes to aJenga is based on the world famous wooden block tower building game. Designed to make the most of the innovative control systems on the Wii and DS, the game offers unpredictable, quick- paced, tactical play that combines suspense and risk-taking, where mounting anticipation comes to a crashing climax. Players of the Wii version can get physical with the Wii Remote and Nunchuk controllers as they battle to keep the Jenga tower from falling, while on the DS the touch screen provides equally intuitive control of the fast-paced action. Players experience sophisticated physics, and a multitude of game-play options (single and multiplayer). The game contains all the fun, intensity and challenge of the original boxed game with a wealth of exciting new enhancements, power-ups and twists that are possible only in the videogame world. [Atari]… Expand"}, {"name": "World War II Combat: Iwo Jima", "details_link": "https://www.metacritic.com/game/pc/world-war-ii-combat-iwo-jima", "publisher": "Groove Games", "release_date": "Jul 25 2006", "developers": ["Direct Action Games"], "platforms": "PC", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 26, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/0/83c0eb3b40fddb5c6563fd72bceb2f92-98.jpg", "descriptions": "Relive the storied Marine assault that landed foreign troops on Japanese soil for the first time in 5000 years. Scenarios and missions are drawn from actual events. 10 levels of single player campaigns that are full of ambient events such as mortar explosions, overhead aircraft and warningRelive the storied Marine assault that landed foreign troops on Japanese soil for the first time in 5000 years. Scenarios and missions are drawn from actual events. 10 levels of single player campaigns that are full of ambient events such as mortar explosions, overhead aircraft and warning sirens that create a truly immersive experience. Use authentic WWII weaponry including KA-BAR Fighting Utility Knife, M1911 .45 Colt, M1 Garand, M1903A4 Springfield, Browning Automatic Rifle (BAR), M1 Thompson Submachine gun (\"Tommy\" Gun), Mk2 Pineapple Grenade and the M2-2 Flamethrower. Multiplayer Action with up to 16 players on Xbox Live, system link or Internet (PC), and 4 player split screen. 10 Expansive Multiplayer Maps. 6 Game types including Deathmatch, Team Deathmatch, King of the Hill, Capture the Flag, VIP Escort, & Last Man Standing. Fully featured bots with adjustable difficulty levels for online, multiplayer and training modes. [Groove Games]… Expand"}, {"name": "Leisure Suit Larry: Box Office Bust", "details_link": "https://www.metacritic.com/game/xbox-360/leisure-suit-larry-box-office-bust", "publisher": "Funsta", "release_date": "Mar 31 2009", "developers": ["Team17"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Third-Person", "Open-World", "Modern", "Modern"], "meta_score": 25, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/8/1652bce38a28db8eb24ccde362851ea2-98.jpg", "descriptions": "The Leisure Suit Larry: Box Office Bust video game gives gamers an all-access pass to the glitz, glamour and gorgeous women of Tinseltown. In this 3rd person adventure game, Larry takes a summer job working on his uncle Larry’s movie lot doing odd jobs and trying to uncover a mole fromThe Leisure Suit Larry: Box Office Bust video game gives gamers an all-access pass to the glitz, glamour and gorgeous women of Tinseltown. In this 3rd person adventure game, Larry takes a summer job working on his uncle Larry’s movie lot doing odd jobs and trying to uncover a mole from another studio who threatens to air the studio's dirty laundry in the tabloids. Leisure Suit Larry: Box Office Bust is a rollicking, innuendo-laden lampoon of Hollywood that features open world sand box game play that includes exploration, platforming, racing and puzzle-solving to complete missions.  Additionally, the game features an all-new Directors Game that allows the player to create their very own \"Larry Feature.\" True to form, Leisure Suit Larry Box Office Bust features sophomoric comedy and bombshell babes thanks to the writing talents of Allen Covert and an All-Star cast of actors and actresses, including Jay Mohr, Dave Attell, Shannon Elizabeth, Carmen Elektra, Patrick Warburton, Jeffrey Tambor, Nikki Cox, Peter Graves, Jane Lynch and Josh Keaton as the voice of Larry Loveage. [Sierra Entertainment]… Expand"}, {"name": "Game Party", "details_link": "https://www.metacritic.com/game/wii/game-party", "publisher": "Midway", "release_date": "Nov 27 2007", "developers": ["Midway"], "platforms": "Wii", "genres": ["Miscellaneous", "Compilation", "Party", "Party", "Party / Minigame"], "meta_score": 25, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/0/a4a303d2148cc4db4d9730a7c6fc4387-98.jpg", "descriptions": "Game Party for the Wii is a collection of classic skill games from around the world, from American sports venues to European gathering spots. Using the Wii’s unique control interface, you can play classics such as darts; modern favorites such as table hockey and hoop shoot, or participate inGame Party for the Wii is a collection of classic skill games from around the world, from American sports venues to European gathering spots. Using the Wii’s unique control interface, you can play classics such as darts; modern favorites such as table hockey and hoop shoot, or participate in multiplayer trivia contests. More than a half dozen games are available. [Midway]… Expand"}, {"name": "AMY", "details_link": "https://www.metacritic.com/game/xbox-360/amy", "publisher": "Lexis Numerique", "release_date": "Jan 11 2012", "developers": ["VectorCell"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 25, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/4/3fe4789eea2ff308d2714629c23c97ed-98.jpg", "descriptions": "Due for release on PSN in June, AMY is a survival horror/action adventure game, where players must protect, and escort the eponymous Amy - an enigmatic eight-year-old autistic girl with curious powers - as they try to get her out of a city overrun with wild creatures and dangerous enemies.Due for release on PSN in June, AMY is a survival horror/action adventure game, where players must protect, and escort the eponymous Amy - an enigmatic eight-year-old autistic girl with curious powers - as they try to get her out of a city overrun with wild creatures and dangerous enemies. The story follows Amy and the player character Lana, a woman who is trying to protect and save her in the disease-ridden town. They must work together to fight or flee from the aberrations, demons, and the military, in the hope of saving not only each other, but also the future of humanity itself.… Expand"}, {"name": "Dragon Ball Z: Ultimate Battle 22", "details_link": "https://www.metacritic.com/game/playstation/dragon-ball-z-ultimate-battle-22", "publisher": "Atari", "release_date": "Mar 25 2003", "developers": ["Bandai"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 25, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/13c41fa96cfffd80f76bcf4b540db7a3-98.jpg", "descriptions": "The Japanese blockbuster is here! An international smash hit, this vintage Dragon Ball Z® fighter features 22 famed DBZ® warriors for you to recreate epic, one-on-one Dragon Ball Z® battles. Easy to play but tough to master, this long-awaited classic offers matchups from theThe Japanese blockbuster is here! An international smash hit, this vintage Dragon Ball Z® fighter features 22 famed DBZ® warriors for you to recreate epic, one-on-one Dragon Ball Z® battles. Easy to play but tough to master, this long-awaited classic offers matchups from the Buu™, Frieza® and Android Sagas. Experience the DBZ® game that has thrilled fans all over the world!… Expand"}, {"name": "eFootball 2022", "details_link": "https://www.metacritic.com/game/pc/efootball-2022", "publisher": "Konami", "release_date": "Sep 30 2021", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 25, "users_score": 1.3, "image": "https://static.metacritic.com/images/products/games/3/d16fea2b01fed95e76b14309ebd5a367-98.jpg", "descriptions": "From \"PES\" to \"eFootball™ It all began with the implacable determination to create a revolutionary soccer platform. Our ambition was to recreate the perfect soccer environment, from the grass on the field, to the players' movement, all the way to the crowds in the stadium. To this end, weFrom \"PES\" to \"eFootball™ It all began with the implacable determination to create a revolutionary soccer platform. Our ambition was to recreate the perfect soccer environment, from the grass on the field, to the players' movement, all the way to the crowds in the stadium. To this end, we decided to create a new soccer engine with a newly built animation system and revamped game commands.\rThe final result was even more impressive than we had originally conceived.\rWe went beyond the border of PES, into a new realm of virtual soccer.\rTo signal this new era, we have decided to part ways with our beloved PES brand and rename it \"eFootball™\"!\rNow we hope that you can enjoy this brand-new soccer experience that eFootball™ has to offer. [Konami]… Expand"}, {"name": "Call for Heroes: Pompolic Wars", "details_link": "https://www.metacritic.com/game/pc/call-for-heroes-pompolic-wars", "publisher": "Strategy First", "release_date": "Jun 26 2007", "developers": ["Quotix Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "General", "General"], "meta_score": 25, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/3/3deb30648a0255b38f1c5aca5bb79ae6-98.jpg", "descriptions": "Many years ago, a dimensional portal to the Outer Worlds was suddenly opened, and an enemy from the darkness encroached upon our world. Led by Pompolic, these armies of demonic hordes quickly overran most (but not all) of the planet.The origin of Pompolic is not known, but it is sure thatMany years ago, a dimensional portal to the Outer Worlds was suddenly opened, and an enemy from the darkness encroached upon our world. Led by Pompolic, these armies of demonic hordes quickly overran most (but not all) of the planet.The origin of Pompolic is not known, but it is sure that this malevolent spiritual being possesses supernatural power, and his desire is obvious, possess the people and turn them into fellows of his dark army. The evil is spreading its power via his servants; the Dark Souls. These Dark Souls - protected by a horde of monsters - are poisoning the minds of his victims and making them slaves of evil. The denizens of this world are on the edge of total annihilation. However, a little hope still exists in the heart of the remaining citizens. They believe that there are brave hearts who can save the world from the source of the evil power. If the Dark Souls were to be captured, the onslaught would stop, and Pompolic would be defeated; the call for heroes is made...The game is placed in a fantasy world and divided into 12 maps. The player can choose between 2 characters. Each character has unique weapons and different abilities. There are 18 types of monsters, and at the end of the game the chief monster awaits the player. During the journey, the player gains experience which will help him to upgrade his strength, armour and health. [Quotix Software]… Expand"}, {"name": "Batman: Dark Tomorrow", "details_link": "https://www.metacritic.com/game/xbox/batman-dark-tomorrow", "publisher": "Kemco", "release_date": "Mar 18 2003", "developers": ["HotGen"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 25, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/8/17bf7a5e06dbb63868dc1c3616aa29a9-98.jpg", "descriptions": "Batman, the Dark Knight detective of Gotham City, is back in an all-new adventure. In Batman: Dark Tomorrow, it's up to Batman to solve the mystery and save the day. The legendary Caped Crusader must use all his mental and physical skills, batglider capabilities, devices from his utilityBatman, the Dark Knight detective of Gotham City, is back in an all-new adventure. In Batman: Dark Tomorrow, it's up to Batman to solve the mystery and save the day. The legendary Caped Crusader must use all his mental and physical skills, batglider capabilities, devices from his utility belt, and sleuthing prowess to fight crime and defeat enemies. You must battle both new and familiar enemies, including Mr. Freeze, Poison Ivy, and the Joker. But in some missions, stealth is just as important as brute force.… Expand"}, {"name": "Stalin vs. Martians", "details_link": "https://www.metacritic.com/game/pc/stalin-vs-martians", "publisher": "Mezmer Games", "release_date": "Apr 29 2009", "developers": ["N-Game Studios", "Black Wing Foundation"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Military", "General"], "meta_score": 25, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/8/774603285a9619be4220e10703b52eea-98.jpg", "descriptions": "Stalin vs. Martians, as the name suggests, is a game both absolutely ridiculous and over-the-top. Fun and accessible, it takes a simple arcade-like approach to the genre of real-time strategy. The player controls the Red Army as it defends Earth from the Martian Invasion of 1942, the highlyStalin vs. Martians, as the name suggests, is a game both absolutely ridiculous and over-the-top. Fun and accessible, it takes a simple arcade-like approach to the genre of real-time strategy. The player controls the Red Army as it defends Earth from the Martian Invasion of 1942, the highly classified military operation which even today remains a closely guarded state secret. Stalin himself conducts the mission briefings, and later even becomes a playable unit. The bold leader is duly serious even as he faces the most ridiculous threat the world has ever known. The game itself is far from standard RTS fare; this is not a realistic and deeply strategic war simulation, but a straightforward, fun and light-hearted arcade-style game complete with power-ups falling from conquered foes in the form of bright shiny coins. [Mezmer Games]… Expand"}, {"name": "NBA Unrivaled", "details_link": "https://www.metacritic.com/game/xbox-360/nba-unrivaled", "publisher": "Tecmo", "release_date": "Nov 11 2009", "developers": ["A.C.R.O.N.Y.M. Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Basketball", "Arcade", "Arcade"], "meta_score": 25, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/dbdda6f34cff9fed6eae82f26cd2da90-98.jpg", "descriptions": "[Xbox Live Arcade]  Paying homage to the old school look and feel of the arcade classics, NBA Unrivaled brings back all of the intensity and pulse pounding action - AMPLIFIED! Hit the hardwood with the 2009-2010 NBA season's team and player rosters with current stats, logos and jerseys. Ball[Xbox Live Arcade]  Paying homage to the old school look and feel of the arcade classics, NBA Unrivaled brings back all of the intensity and pulse pounding action - AMPLIFIED! Hit the hardwood with the 2009-2010 NBA season's team and player rosters with current stats, logos and jerseys. Ball your way up to the top of the league with unthinkable slams and outrageous plays to get the crowd pumped for momentum on your side! Momentum mania! As you play for points, you will also play to fill up your Momentum Gauge. Once the Momentum gauge is maxed out, the team goes into Momentum Mania, which boosts offensive and defensive abilities, allowing for flashier, bigger plays. Non-stop action: Experience electrifying effects, outrageous dunks, and fast paced action where no other basketball game has gone before. Authentic rosters: Boasting all 30 NBA teams and the top players from the latest 2009-2010 Rosters, choose your team to compete in full five-on-five team arcade-style gameplay. Multiple modes: Grab a friend to play in online or offline multiplayer mode -- player vs. player, or two players vs. CPU. [Tecmo]… Expand"}, {"name": "Cruis'n", "details_link": "https://www.metacritic.com/game/wii/cruisn", "publisher": "Midway", "release_date": "Nov 27 2007", "developers": ["Midway Studios - San Diego"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 25, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/9/39181e932b66e08e428188b1166bb5f2-98.jpg", "descriptions": "An all new version of the classic Midway arcade racer, Cruis’n has come exclusively to the Wii. Choose your ride from an impressive lineup of licensed cars and experience a rush of adrenaline as you race opponents through twelve different street circuits using the Wii Remote to steer andAn all new version of the classic Midway arcade racer, Cruis’n has come exclusively to the Wii. Choose your ride from an impressive lineup of licensed cars and experience a rush of adrenaline as you race opponents through twelve different street circuits using the Wii Remote to steer and perform outrageous stunts. Win races and earn upgrades including: turbos, body kits, neon and nitrous, allowing you to create the ultimate ride. [Midway]… Expand"}, {"name": "NBA Unrivaled", "details_link": "https://www.metacritic.com/game/playstation-3/nba-unrivaled", "publisher": "Tecmo", "release_date": "Nov 12 2009", "developers": ["A.C.R.O.N.Y.M. Games"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Basketball", "Arcade", "Arcade"], "meta_score": 24, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/1/a1b8b3865e88b565e8900b2e94acafc5-98.jpg", "descriptions": "[Playstation Network]  Paying homage to the old school look and feel of the arcade classics, NBA Unrivaled brings back all of the intensity and pulse pounding action - AMPLIFIED! Hit the hardwood with the 2009-2010 NBA season's team and player rosters with current stats, logos and jerseys.[Playstation Network]  Paying homage to the old school look and feel of the arcade classics, NBA Unrivaled brings back all of the intensity and pulse pounding action - AMPLIFIED! Hit the hardwood with the 2009-2010 NBA season's team and player rosters with current stats, logos and jerseys. Ball your way up to the top of the league with unthinkable slams and outrageous plays to get the crowd pumped for momentum on your side! Momentum mania! As you play for points, you will also play to fill up your Momentum Gauge. Once the Momentum gauge is maxed out, the team goes into Momentum Mania, which boosts offensive and defensive abilities, allowing for flashier, bigger plays. Non-stop action: Experience electrifying effects, outrageous dunks, and fast paced action where no other basketball game has gone before. Authentic rosters: Boasting all 30 NBA teams and the top players from the latest 2009-2010 Rosters, choose your team to compete in full five-on-five team arcade-style gameplay. Multiple modes: Grab a friend to play in online or offline multiplayer mode -- player vs. player, or two players vs. CPU. [Tecmo]… Expand"}, {"name": "Terrawars: New York Invasion", "details_link": "https://www.metacritic.com/game/pc/terrawars-new-york-invasion", "publisher": "Tri Synergy", "release_date": "Jul  6 2006", "developers": ["Ladyluck Digital Media"], "platforms": "PC", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 24, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/6/51437d7015794b6063ddd916266f3d6e-98.jpg", "descriptions": "Without warning, the world is overrun by an alien invasion. The Earth is in chaos. You are John Armstrong, a medical student drafted in to the National Guard. On a critical mission that may help turn the tide, your team is wiped out. Now success depends on you. Will you rise up to theWithout warning, the world is overrun by an alien invasion. The Earth is in chaos. You are John Armstrong, a medical student drafted in to the National Guard. On a critical mission that may help turn the tide, your team is wiped out. Now success depends on you. Will you rise up to the challenge? [Tri Synergy]… Expand"}, {"name": "Gravity Games Bike: Street Vert Dirt", "details_link": "https://www.metacritic.com/game/playstation-2/gravity-games-bike-street-vert-dirt", "publisher": "Midway", "release_date": "Jun 27 2002", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 24, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/9/747b37342611f28096f2e3c9d2c3a0b9-98.jpg", "descriptions": "Gravity Games Bike: Street. Vert. Dirt. delivers the most extreme BMX action available for the next-generation systems. It takes the hottest action-sport to the next level with 21 skilled riders, 10 huge Street, Vert and Dirt courses, and more than 1,500 wicked tricks. Control one of sevenGravity Games Bike: Street. Vert. Dirt. delivers the most extreme BMX action available for the next-generation systems. It takes the hottest action-sport to the next level with 21 skilled riders, 10 huge Street, Vert and Dirt courses, and more than 1,500 wicked tricks. Control one of seven professional bike riders, including Fuzzy Hall, Dennis McCoy, Jamie Bestwick, Andre Ellison, Leigh Ramsdell, Reuel Erickson, and Matt Beringer. If you're good enough to handle these intense challenges, you'll get the Gravity Games Gold Medal in the Street, Vert, or Dirt competitions...and if you're really good, you'll get the Gold in all three. [Midway]… Expand"}, {"name": "Postal III", "details_link": "https://www.metacritic.com/game/pc/postal-iii", "publisher": "Running With Scissors", "release_date": "Dec 21 2011", "developers": ["Running With Scissors"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["First-Person", "Modern", "Action", "Shooter", "Shooter", "Third-Person", "Modern", "Arcade"], "meta_score": 24, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/6/c878ebd48f8bfb0a258738e1853a0b42-98.jpg", "descriptions": "The Postal series continues in this third installment, using the Source Engine from Valve."}, {"name": "Game Party Champions", "details_link": "https://www.metacritic.com/game/wii-u/game-party-champions", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 18 2012", "developers": ["Phosphor Games Studio", "LLC"], "platforms": "Wii U", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 24, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/8/b5770ab07f75caa951413935221ec5d7-98.jpg", "descriptions": "Game Party Champions is the fifth and latest installment of the Game Party franchise and available exclusively for Wii U. The game’s pick-up and play style promises to appeal to experienced and new gamers alike. Using the system’s innovative new GamePad, players tilt, turn and touch theGame Party Champions is the fifth and latest installment of the Game Party franchise and available exclusively for Wii U. The game’s pick-up and play style promises to appeal to experienced and new gamers alike. Using the system’s innovative new GamePad, players tilt, turn and touch the controller to play arcade, sports and party games in entirely new ways.… Expand"}, {"name": "Legends of Wrestling II", "details_link": "https://www.metacritic.com/game/game-boy-advance/legends-of-wrestling-ii", "publisher": "Acclaim", "release_date": "Nov 25 2002", "developers": ["Powerhead Games"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 24, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/8/a59b4fd6b1f9a4f52db7091cb2dda2c8-98.jpg", "descriptions": "Legends of Wrestling II takes you through the wrestling hall of fame with the top grapplers that are battling for squared-circle supremacy. Play as your favorite wrestler--including Hulk Hogan, Andre \"The Giant,\" and Bret \"Hitman\" Hart--each with signature entrances,Legends of Wrestling II takes you through the wrestling hall of fame with the top grapplers that are battling for squared-circle supremacy. Play as your favorite wrestler--including Hulk Hogan, Andre \"The Giant,\" and Bret \"Hitman\" Hart--each with signature entrances, taunts, and moves. A new storyline and career mode let you battle for the respect of promoters and fans while fighting for the heavyweight championship crown. The game also features tag-team tournaments, a $15,000 Body Slam Challenge, and a variety of match types.… Expand"}, {"name": "Pulse Racer", "details_link": "https://www.metacritic.com/game/xbox/pulse-racer", "publisher": "Jaleco Entertainment", "release_date": "Jan  2 2003", "developers": ["Jaleco Entertainment"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 24, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/1/fc1c18b0e1a42f663bb8bd039375a73b-98.jpg", "descriptions": "Pulse Racer takes you to a future where racers careen toward the clouds in sleek vehicles to gain an advantage over the competition. As a racer, you'll need a risk-taking mentality; but more importantly, you'll need a vehicle that suits your driving style and a driver who matches yourPulse Racer takes you to a future where racers careen toward the clouds in sleek vehicles to gain an advantage over the competition. As a racer, you'll need a risk-taking mentality; but more importantly, you'll need a vehicle that suits your driving style and a driver who matches your technique. Linked directly to your vehicle, your body will be pushed to the limit in a variety of high-speed tracks. Harass your opponents with missiles, mines, or direct plasma beams and slingshot around tight turns.… Expand"}, {"name": "Fighter Within", "details_link": "https://www.metacritic.com/game/xbox-one/fighter-within", "publisher": "Ubisoft", "release_date": "Nov 19 2013", "developers": ["Ubisoft"], "platforms": "Xbox One", "genres": ["Sports", "General", "General"], "meta_score": 23, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/6/ee853e354954b653b3ec20faabcc77ea-98.jpg", "descriptions": "Unleash your inner fighter to beat your friends with your bare knuckles. Discover Fighter Within, the next-gen game that provides you with the excitement of a real fight, throwing you into a total-body combat experience. Test your real fighting skills thanks to the next gen of motionUnleash your inner fighter to beat your friends with your bare knuckles. Discover Fighter Within, the next-gen game that provides you with the excitement of a real fight, throwing you into a total-body combat experience. Test your real fighting skills thanks to the next gen of motion recognition. Kinect for Xbox One arms the game with realistic fighting moves using 1:1 precision movement tracking. Enter a brutal, physical, and liberating world: Next-gen graphics, real-time wounds, sweat, and facial impacts in extreme arena environments and primal animations… Kinect allows you to dive into a realistic experience and really feel the fight. Enter a world of sweat, timing, and training.… Expand"}, {"name": "FlatOut 3: Chaos & Destruction", "details_link": "https://www.metacritic.com/game/pc/flatout-3-chaos-destruction", "publisher": "Strategy First", "release_date": "Dec 13 2011", "developers": ["Team6 Game Studios", "Team 6 Games Studio"], "platforms": "PC", "genres": ["Driving", "Racing", "Demolition Derby", "Arcade", "Automobile"], "meta_score": 23, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/2/c577ee256f710fd177dd8dabc66622df-98.jpg", "descriptions": "FlatOut 3: Chaos & Destruction brings a new dimension to high speed destruction racing.\r Feel the adrenaline pulse through your veins as you barrel through insane race tracks against monster trucks, race cars, off road vehicles and much more.\r\n\r\nFlatOut 3: Chaos & Destruction is demolitionFlatOut 3: Chaos & Destruction brings a new dimension to high speed destruction racing.\r Feel the adrenaline pulse through your veins as you barrel through insane race tracks against monster trucks, race cars, off road vehicles and much more.\r FlatOut 3: Chaos & Destruction is demolition racing at its extreme. Real world physics with 9 different game modes, and over 47 different vehicles available. Players may choose to race, smash and destroy their opponents in a wide variety of online and offline options.\r Lay waste to farm houses, fences, and then wreak havoc in a Detroit suburb, race up the walls in giant waste disposal sewers. Let the chaos begin as you race through over 60 different tracks, narrowly avoiding wrecking balls, Double Decker buses and much more.\r Create as much destruction in the all new monster tuck mode.\r Choose from 20 different playable characters, select your weapon from the 47 available vehicles! Create as much Chaos & Destruction! In stuntman mode anarchy rules create havoc with some rag doll fun.\r FlatOut 3: Chaos & Destruction offers more vehicles, game modes and different ways to demolish your opponents before crossing the finish line.… Expand"}, {"name": "Homie Rollerz", "details_link": "https://www.metacritic.com/game/ds/homie-rollerz", "publisher": "Destineer", "release_date": "Mar  5 2008", "developers": ["Webfoot Technologies"], "platforms": "DS", "num_players": "8  Online", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart"], "meta_score": 23, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/3/b7a6370c4de7aadaea3c8d94398822d6-98.jpg", "descriptions": "Homie Rollerz is a fast-paced, mayhem-laden kart racer where players can pick one of the 10 most popular Homies, customize their slick rides, then trick, hop, and battle through courses with settings, shortcuts, and secrets as unique as the Homies themselves. Trick Out and Roll Out: EarnHomie Rollerz is a fast-paced, mayhem-laden kart racer where players can pick one of the 10 most popular Homies, customize their slick rides, then trick, hop, and battle through courses with settings, shortcuts, and secrets as unique as the Homies themselves. Trick Out and Roll Out: Earn respect points by doing stunts and winning races, then cash them in to trick out your car. Use the stylus to paint and mod your ride, fit your car with a better engine and exhaust system for more speed, beef up your suspension and hydraulic systems for better turning and cooler tricks when racing. Rivalries and Respect: Challenge your fellow Homies on their turf. Beat Jokawild under the big top in the Homie Circus or drag race down Venice Beach against Big Loco. To win, you’ve got to learn the hoods, find the shortcuts, earn respect, and show your Homies who owns the street. Multiplayer: Is one of your friends challenging your street cred? Show them who owns the hood with up to 8 players via Local Wireless or four players via Nintendo® Wi-Fi Connection. Homie Rollerz also supports Download Play, so you and another Homie can play a trial version using only one cart! Get to Know the Homies: Play as one of 10 slick Homies and enter the “Wizard Circuit,” a mysterious racing series through which the winner is granted a single wish by the wise and legendary Homie known as Wizard. Each character has a unique vehicle that can be upgraded in the garage for improved stats. Learn what’s motivating each of your Homies: Why is Alien Ese stuck on Earth and how can he get back home? How did Zombie become undead and will he ever return to the land of the living? [Destineer]… Expand"}, {"name": "Charlie's Angels", "details_link": "https://www.metacritic.com/game/gamecube/charlies-angels", "publisher": "Ubisoft", "release_date": "Jul  9 2003", "developers": ["Neko Entertainment"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 23, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/a950052d9c5a6a954f4c7f09c5cc61b7-98.jpg", "descriptions": "Join Natalie, Dylan, and Alex for an intense adventure based on the Charlie's Angels movies. You'll need various disguises, clever tactics, and acrobatic martial arts moves to ensure a successful mission. Master the different styles of all three Angels as you battle 32 different types ofJoin Natalie, Dylan, and Alex for an intense adventure based on the Charlie's Angels movies. You'll need various disguises, clever tactics, and acrobatic martial arts moves to ensure a successful mission. Master the different styles of all three Angels as you battle 32 different types of enemies across the globe. You can switch between characters at anytime during the game. Charlie's Angel's movie stars--Cameron Diaz, Lucy Liu, Drew Barrymore, and Bernie Mac--supply the voices.… Expand"}, {"name": "Rambo: The Video Game", "details_link": "https://www.metacritic.com/game/playstation-3/rambo-the-video-game", "publisher": "Reef Entertainment", "release_date": "Apr 29 2014", "developers": ["Teyon"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "General"], "meta_score": 23, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/5/b2c3b54151c012dffdae6c95aa32058e-98.jpg", "descriptions": "RAMBO The Vidoegame puts players in Rambo’s combat boots and takes them on an action-packed adventure through the iconic action- sequences and story-arcs of FIRST BLOOD, RAMBO: FIRST BLOOD PART II  & RAMBO III. The game features the original movie voice-tracks of John Rambo and Col. SamuelRAMBO The Vidoegame puts players in Rambo’s combat boots and takes them on an action-packed adventure through the iconic action- sequences and story-arcs of FIRST BLOOD, RAMBO: FIRST BLOOD PART II  & RAMBO III. The game features the original movie voice-tracks of John Rambo and Col. Samuel Trautman as well as selected music from the original Rambo Trilogy. … Expand"}, {"name": "Fast & Furious: Showdown", "details_link": "https://www.metacritic.com/game/xbox-360/fast-furious-showdown", "publisher": "Activision", "release_date": "May 21 2013", "developers": ["Activision", "Firebrand Games"], "platforms": ["3DS", "PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "GT / Street", "GT / Street", "Automobile"], "meta_score": 22, "users_score": 1.3, "image": "https://static.metacritic.com/images/products/games/7/cc5b773b45c765825dff6bf7f4568c7e-98.jpg", "descriptions": "Fast & Furious: Showdown takes some of the franchise’s iconic characters on a high-stakes adventure around the globe that delivers takedowns, heists, hijacks and havoc. Players can switch roles with their AI partners or team up with a friend for two-person local co-op. Completed objectivesFast & Furious: Showdown takes some of the franchise’s iconic characters on a high-stakes adventure around the globe that delivers takedowns, heists, hijacks and havoc. Players can switch roles with their AI partners or team up with a friend for two-person local co-op. Completed objectives unlock new vehicle performance and customization options to make each player’s ride unique. A bonus Challenge Mode and online leaderboards let players pit their strength, speed and skills against competition from all around the world.… Expand"}, {"name": "Drake of the 99 Dragons", "details_link": "https://www.metacritic.com/game/xbox/drake-of-the-99-dragons", "publisher": "Majesco Games", "release_date": "Nov  3 2003", "developers": ["Idol FX"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 22, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/5/bafc58e481dbbe5a40deb3ae7464f475-98.jpg", "descriptions": "Drake is out for revenge in a supernatural Hong Kong world. You'll join Drake in 25 intense missions, as he battles ruthless villains and female assassins with an array of firearms, short and long blade weapons, and thrown melee weapons. Use Drake's power and agility to slow down the action,Drake is out for revenge in a supernatural Hong Kong world. You'll join Drake in 25 intense missions, as he battles ruthless villains and female assassins with an array of firearms, short and long blade weapons, and thrown melee weapons. Use Drake's power and agility to slow down the action, fire guns in any direction, and run and backflip off of walls. When you become injured, you can feed on the souls of the dead to replenish your health.… Expand"}, {"name": "Afro Samurai 2: Revenge of Kuma Volume One", "details_link": "https://www.metacritic.com/game/playstation-4/afro-samurai-2-revenge-of-kuma-volume-one", "publisher": "Versus Evil", "release_date": "Sep 22 2015", "developers": ["Versus Evil"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Beat-'Em-Up", "2D", "3D"], "meta_score": 21, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/4/1b20b1b6e60c90f61cbd2757fd9130b4-98.jpg", "descriptions": "Head out on a journey of redemption, driven by bitter-sweet revenge. The saga of Afro Samurai continues but this time follows the path of Kuma, one of Afro’s closest childhood friends."}, {"name": "Infestation: Survivor Stories (The War Z)", "details_link": "https://www.metacritic.com/game/pc/infestation-survivor-stories-the-war-z", "publisher": "Arktos Entertainment", "release_date": "Oct 15 2012", "developers": ["Hammerpoint Interactive"], "platforms": "PC", "genres": ["Massively Multiplayer Online", "Modern", "Role-Playing", "Massively Multiplayer"], "meta_score": 20, "users_score": 1.7, "image": "https://static.metacritic.com/images/products/games/3/d91612502d1427c0025fb4358fa48736-98.jpg", "descriptions": "(Formerly known as \"The War Z\") It has been 5 years since the outbreak, giving rise to a post-apocalyptic nightmare with 95% of the human race wiped out. To survive, you'll require food, weapons, and other supplies. Some of you will scavenge as you negotiate the terrain, others will be(Formerly known as \"The War Z\") It has been 5 years since the outbreak, giving rise to a post-apocalyptic nightmare with 95% of the human race wiped out. To survive, you'll require food, weapons, and other supplies. Some of you will scavenge as you negotiate the terrain, others will be forced to fight for survival as they encounter zombies and other players. Every decision has an effect on whether you live or how quickly you meet your death.… Expand"}, {"name": "Leisure Suit Larry: Box Office Bust", "details_link": "https://www.metacritic.com/game/pc/leisure-suit-larry-box-office-bust", "publisher": "Funsta", "release_date": "Mar 31 2009", "developers": ["Team17"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Third-Person", "Open-World", "Modern", "Modern"], "meta_score": 20, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/6/5d2aa89cc8418c8d283ae8ba939a43fe-98.jpg", "descriptions": "The Leisure Suit Larry: Box Office Bust video game gives gamers an all-access pass to the glitz, glamour and gorgeous women of Tinseltown. In this 3rd person adventure game, Larry takes a summer job working on his uncle Larry’s movie lot doing odd jobs and trying to uncover a mole fromThe Leisure Suit Larry: Box Office Bust video game gives gamers an all-access pass to the glitz, glamour and gorgeous women of Tinseltown. In this 3rd person adventure game, Larry takes a summer job working on his uncle Larry’s movie lot doing odd jobs and trying to uncover a mole from another studio who threatens to air the studio's dirty laundry in the tabloids. Leisure Suit Larry: Box Office Bust is a rollicking, innuendo-laden lampoon of Hollywood that features open world sand box game play that includes exploration, platforming, racing and puzzle-solving to complete missions.  Additionally, the game features an all-new Directors Game that allows the player to create their very own \"Larry Feature.\" True to form, Leisure Suit Larry Box Office Bust features sophomoric comedy and bombshell babes thanks to the writing talents of Allen Covert and an All-Star cast of actors and actresses, including Jay Mohr, Dave Attell, Shannon Elizabeth, Carmen Elektra, Patrick Warburton, Jeffrey Tambor, Nikki Cox, Peter Graves, Jane Lynch and Josh Keaton as the voice of Larry Loveage. [Sierra Entertainment]… Expand"}, {"name": "Deal or No Deal", "details_link": "https://www.metacritic.com/game/ds/deal-or-no-deal", "publisher": "Destination Software", "release_date": "Jul 23 2007", "developers": ["Artefacts Studio"], "platforms": ["PC", "DS"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 20, "users_score": 2.1, "image": "https://static.metacritic.com/images/products/games/4/c770adc60c2e0a15554d4b45b1134c06-98.jpg", "descriptions": "The hit TV show is coming to your favorite video game system! The premise is simple: You have 26 briefcases in front of you. Each one contains a different amount of money. Open each case one by one, and try to find the briefcase with the biggest amount of money. Deal Or No Deal?"}, {"name": "Alone in the Dark: Illumination", "details_link": "https://www.metacritic.com/game/pc/alone-in-the-dark-illumination", "publisher": "Atari", "release_date": "Jun 11 2015", "developers": ["Pure FPS"], "platforms": "PC", "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 19, "users_score": 1.3, "image": "https://static.metacritic.com/images/products/games/9/a48a7bdea26c68305506c4f999b03dc6-98.jpg", "descriptions": "A dire curse has shrouded the town of Lorwich in an unnatural darkness, as monstrous hordes emerge from beyond the realm of nightmares to sow chaos on the land.  As one of four heroes, you must battle the minions of Cthulhu with the force of arms and the power of illumination."}, {"name": "Ride to Hell: Retribution", "details_link": "https://www.metacritic.com/game/xbox-360/ride-to-hell-retribution", "publisher": "Deep Silver", "release_date": "Jun 25 2013", "developers": ["Eutechnyx", "Deep Silver"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Action Adventure", "Modern", "Racing", "General", "Modern", "Motorcycle", "Motocross"], "meta_score": 19, "users_score": 1.3, "image": "https://static.metacritic.com/images/products/games/9/531fd76361f02136296c55f4b9da3c49-98.jpg", "descriptions": "The game is set in the last years of the roaring 1960s, a time of sex, drugs and rock 'n' roll. The biker movement, rock music and the hippie counterculture all add to the fascinating atmosphere to be experienced in Ride to Hell. Action-loaded from the very start with free roamingThe game is set in the last years of the roaring 1960s, a time of sex, drugs and rock 'n' roll. The biker movement, rock music and the hippie counterculture all add to the fascinating atmosphere to be experienced in Ride to Hell. Action-loaded from the very start with free roaming environments, players can immerse themselves in the liberty and freedom of riding full throttle with their gang on a multitude of different vehicles through the dusty flats of Western America. Protecting their turf, their brothers and their machines from rival gangs is just a taste of what this epic game involves. Ride to Hell is not for the faint-hearted; it's aimed heavily at the player who wants to become fully involved in the original West Coast biker culture. With its hard drinking, bare-knuckle environment, this is as close to the action as you can get. [Deep Silver]… Expand"}, {"name": "SPOGS Racing", "details_link": "https://www.metacritic.com/game/wii/spogs-racing", "publisher": "D2C Games", "release_date": "Jul  7 2008", "developers": ["Pronto Games"], "platforms": "Wii", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 18, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/02ae964b3324730ce1097b4ec5e59b3e-98.jpg", "descriptions": "[WiiWare]  Race along in distinctively unique SPOGS Racers that can be personalized, customized and modified with in-game images and vehicle parts. Gamers control their SPOGS as they try their best to smash into their opponents to steal upgraded parts on-the-fly in the title's innovative[WiiWare]  Race along in distinctively unique SPOGS Racers that can be personalized, customized and modified with in-game images and vehicle parts. Gamers control their SPOGS as they try their best to smash into their opponents to steal upgraded parts on-the-fly in the title's innovative Crash 'N Grab gameplay. Featuring several game modes, a variety of track types including outrageous stunt tracks with loops and jumps, multiple difficultly modes and control schemes, racing power-ups, weapons, and head-to-head multiplayer, SPOGS Racing offers plenty of fun for gamers of all ages and experiences. [D2C Games]… Expand"}, {"name": "Double Dragon II: Wander of the Dragons", "details_link": "https://www.metacritic.com/game/xbox-360/double-dragon-ii-wander-of-the-dragons", "publisher": "CFK", "release_date": "Apr  5 2013", "developers": ["Gravity Corporation", "Gravity"], "platforms": "Xbox 360", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 17, "users_score": 1.6, "image": "https://static.metacritic.com/images/products/games/2/35bd1b9dcd51a4296ab4318b84b304d5-98.jpg", "descriptions": "A remake the 80's Double Dragon II game. Team up and take control of Jimmy and Billy, whose looks and actions are modernized. Battle through the newly drawn 3D stages, which hide their own secrets and surprises."}, {"name": "Vroom in the Night Sky", "details_link": "https://www.metacritic.com/game/switch/vroom-in-the-night-sky", "publisher": "Poisoft", "release_date": "Apr  5 2017", "developers": ["Poisoft"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Biking"], "meta_score": 17, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/4/5344fca7a2c260b551d135f992ef43fb-98.jpg", "descriptions": "Vroom in the night sky is a magical bike action game.\r There are various night skies in this world, and it is the work of Magical Girls to collect Stardusts there.\r\n\r\nYou become the Magical Girl Luna, ride a magical bike, fly around the night sky and collect Stardusts!\r\n\r\nThe Magical GateVroom in the night sky is a magical bike action game.\r There are various night skies in this world, and it is the work of Magical Girls to collect Stardusts there.\r You become the Magical Girl Luna, ride a magical bike, fly around the night sky and collect Stardusts!\r The Magical Gate is floating in the night sky. In order to open the gate, you need to collect the necessary number of Keystars floating in the night sky.\r By collecting Keystars faster and entering the gate, you can get more Stardusts. Besides, by manipulating the motorcycle more technically, the number of Stardusts will be increased.\r By using the collected Stardusts, you will be able to get a new magical bike. If you get a powerful magical bike, you will be able to more easily collect Stardusts!… Expand"}, {"name": "Leisure Suit Larry: Box Office Bust", "details_link": "https://www.metacritic.com/game/playstation-3/leisure-suit-larry-box-office-bust", "publisher": "Funsta", "release_date": "May  5 2009", "developers": ["Team17"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Third-Person", "Open-World", "Modern", "Modern"], "meta_score": 17, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/7/65dbd7f8f7f87ffd22db81a377c86d1c-98.jpg", "descriptions": "The Leisure Suit Larry: Box Office Bust video game gives gamers an all-access pass to the glitz, glamour and gorgeous women of Tinseltown. In this 3rd person adventure game, Larry takes a summer job working on his uncle Larry’s movie lot doing odd jobs and trying to uncover a mole fromThe Leisure Suit Larry: Box Office Bust video game gives gamers an all-access pass to the glitz, glamour and gorgeous women of Tinseltown. In this 3rd person adventure game, Larry takes a summer job working on his uncle Larry’s movie lot doing odd jobs and trying to uncover a mole from another studio who threatens to air the studio's dirty laundry in the tabloids. Leisure Suit Larry: Box Office Bust is a rollicking, innuendo-laden lampoon of Hollywood that features open world sand box game play that includes exploration, platforming, racing and puzzle-solving to complete missions.  Additionally, the game features an all-new Directors Game that allows the player to create their very own \"Larry Feature.\" True to form, Leisure Suit Larry Box Office Bust features sophomoric comedy and bombshell babes thanks to the writing talents of Allen Covert and an All-Star cast of actors and actresses, including Jay Mohr, Dave Attell, Shannon Elizabeth, Carmen Elektra, Patrick Warburton, Jeffrey Tambor, Nikki Cox, Peter Graves, Jane Lynch and Josh Keaton as the voice of Larry Loveage. [Sierra Entertainment]… Expand"}, {"name": "Yaris", "details_link": "https://www.metacritic.com/game/xbox-360/yaris", "publisher": "Backbone Entertainment", "release_date": "Oct 10 2007", "developers": ["Backbone Entertainment"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 17, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/5/df403b12f37ed5bcf9bf2d468b316092-98.jpg", "descriptions": "[Xbox Live Arcade]  Hop into a Toyota Yaris and drive it on crazy tracks loaded with stubborn obstacles, cool powerups, and intense enemy action. The relentlessly twisted courses in Yaris might have loops or even be tube-shaped, but the Yaris never has to worry about sliding off track, as it[Xbox Live Arcade]  Hop into a Toyota Yaris and drive it on crazy tracks loaded with stubborn obstacles, cool powerups, and intense enemy action. The relentlessly twisted courses in Yaris might have loops or even be tube-shaped, but the Yaris never has to worry about sliding off track, as it defies gravity by scaling side-walls and going all topsy-turvy. Equip your Yaris with an arsenal of weapons to take out your adversaries, but be careful to avoid enemy fire, because once your shields are depleted, so is the game. Customizable cars: Drive either a Yaris Sedan, Sports Sedan, or the Liftback. Collect coins on the track and outfit your Yaris with weapons, shields, and tire configurations. Game modes: Race and take out your enemies in either single player or player vs. player game mode. Wild tracks: Drive on eight different tracks of progressive difficulty. FREE download: Yaris is a free Xbox Live Arcade game. Play it today. Gallery feature: Browse through the game's cast of characters, including all the Yaris cars. Twelve new achievements and new Leaderboard: Twelve new achievements to unlock, and a new Xbox LIVE Arcade leaderboard for you to dominate. [Microsoft]… Expand"}, {"name": "Ride to Hell: Retribution", "details_link": "https://www.metacritic.com/game/pc/ride-to-hell-retribution", "publisher": "Deep Silver", "release_date": "Jun 24 2013", "developers": ["Eutechnyx", "Deep Silver"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Modern", "Racing", "Motorcycle", "Motocross", "Modern", "Action Adventure", "General"], "meta_score": 16, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/7/afe36327bfd436b1d4df0c45b6df4d3f-98.jpg", "descriptions": "The game is set in the last years of the roaring 1960s, a time of sex, drugs and rock 'n' roll. The biker movement, rock music and the hippie counterculture all add to the fascinating atmosphere to be experienced in Ride to Hell. Action-loaded from the very start with free roamingThe game is set in the last years of the roaring 1960s, a time of sex, drugs and rock 'n' roll. The biker movement, rock music and the hippie counterculture all add to the fascinating atmosphere to be experienced in Ride to Hell. Action-loaded from the very start with free roaming environments, players can immerse themselves in the liberty and freedom of riding full throttle with their gang on a multitude of different vehicles through the dusty flats of Western America. Protecting their turf, their brothers and their machines from rival gangs is just a taste of what this epic game involves. Ride to Hell is not for the faint-hearted; it's aimed heavily at the player who wants to become fully involved in the original West Coast biker culture. With its hard drinking, bare-knuckle environment, this is as close to the action as you can get. [Deep Silver]… Expand"}, {"name": "Family Party: 30 Great Games Obstacle Arcade", "details_link": "https://www.metacritic.com/game/wii-u/family-party-30-great-games-obstacle-arcade", "publisher": "D3Publisher", "release_date": "Dec  4 2012", "developers": ["Art Co.", "Ltd."], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 11, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/4/8a730cd39427ddca22c9c1b210f18158-98.jpg", "descriptions": "Family Party: 30 Great Games Obstacle Arcade brings home wacky and wild competitions for kids of all ages."}]