[
  {
    "name": "Emperor: Battle for Dune",
    "details_link": "https://www.metacritic.com/game/pc/emperor-battle-for-dune",
    "publisher": "EA Games",
    "release_date": "Jun 12 2001",
    "developers": [
      "Westwood Studios"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/4adae59b3ef6608268520c0d0d734638-98.jpg",
    "descriptions": "Based on the universe created in the Frank Herbert novels and in David Lynch's 1984 movie, this long-awaited sequel to the early '90s game \"Dune II\" -- the granddaddy of the real-time strategy genre -- puts you in command of a military faction fighting for control of the desert planetBased on the universe created in the Frank Herbert novels and in David Lynch's 1984 movie, this long-awaited sequel to the early '90s game \"Dune II\" -- the granddaddy of the real-time strategy genre -- puts you in command of a military faction fighting for control of the desert planet Arrakis and its critical resources.… Expand"
  },
  {
    "name": "Rowan's Battle of Britain",
    "details_link": "https://www.metacritic.com/game/pc/rowans-battle-of-britain",
    "publisher": "Empire Interactive",
    "release_date": "Jan 31 2001",
    "developers": [
      "Rowan Software Ltd."
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Simulation",
      "Flight",
      "WWII",
      "Combat"
    ],
    "meta_score": 79,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/6/5ecda33daffc7123712cf4bf5da52726-98.jpg",
    "descriptions": "A real-time combat flight simulation depicting the Luftwaffe's raids over British skies. With over 800 square miles of sky and over 1,000 attacking aircraft, gamers finally have the chance to experience the amazing scope of one of the largest air raids ever.  [Empire Interactive]"
  },
  {
    "name": "echochrome",
    "details_link": "https://www.metacritic.com/game/psp/echochrome",
    "publisher": "SCEA",
    "release_date": "May  1 2008",
    "developers": [
      "SCE/WWS",
      "SCE Japan Studio"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 5",
      "PSP"
    ],
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/8e3da750b179eef7bad8586910e9abf4-98.jpg",
    "descriptions": "Featuring an elegant black and white art design inspired by the works of M.C. Escher, echochrome is a puzzle game unlike any other. With gameplay based on optical illusions, players must utilize five simple laws of perspective to join walkways, hide dangers, and create new paths to reach theFeaturing an elegant black and white art design inspired by the works of M.C. Escher, echochrome is a puzzle game unlike any other. With gameplay based on optical illusions, players must utilize five simple laws of perspective to join walkways, hide dangers, and create new paths to reach the \"echos,\" or shadow guides. Once you've mastered the five laws, use them to create your own mind-bending levels to play and share with friends using the custom level editor. [Sony]… Expand"
  },
  {
    "name": "Ken Follett's The Pillars of the Earth",
    "details_link": "https://www.metacritic.com/game/switch/ken-folletts-the-pillars-of-the-earth",
    "publisher": "Daedalic Entertainment",
    "release_date": "Mar  1 2023",
    "developers": [
      "Daedalic Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 79,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/0/0c1028d79bc642baa8df2b7ad63b6f46-98.jpg",
    "descriptions": "Based on Ken Follett's world-bestseller, 'The Pillars of the Earth' retells the story of the village of Kingsbridge in a whole new interactive way. Play as Jack, Aliena and Philip and change the events of the book through exploration, decision-making and dialogues. This interactive novel isBased on Ken Follett's world-bestseller, 'The Pillars of the Earth' retells the story of the village of Kingsbridge in a whole new interactive way. Play as Jack, Aliena and Philip and change the events of the book through exploration, decision-making and dialogues. This interactive novel is released in three 'books', containing 7 chapters each. The physical retail version includes access to all three books, bringing the entire saga together into one thrilling package.… Expand"
  },
  {
    "name": "Five Dates",
    "details_link": "https://www.metacritic.com/game/playstation-4/five-dates",
    "publisher": "Wales Interactive",
    "release_date": "Nov 17 2020",
    "developers": [
      "Good Gate Media"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 79,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/3/c1e45c59bfd4447becc75aedc4145d0c-98.jpg",
    "descriptions": "Five Dates is a completely live-action, interactive romantic comedy. The plot follows Vinny, a millennial from London, joins a dating app for the first time while living in lockdown. From a choice of five interested women, the player can control who Vinny video dates and how he interactsFive Dates is a completely live-action, interactive romantic comedy. The plot follows Vinny, a millennial from London, joins a dating app for the first time while living in lockdown. From a choice of five interested women, the player can control who Vinny video dates and how he interacts with their very different personalities. The interactive story unfolds in a multitude of different directions, each exploring whether compatibility, chemistry and connection are still possible in a world where physical touch is no longer an option. Five Dates is a fast-turnaround rom-com project that has been conceptualized and developed during lockdown. Mandip Gill, who played Doctor Who’s companion in the last two series of the long-running UK show, is joined by Georgia Hirst (Vikings), Marisa Abela (who is a lead in Lena Dunham’s upcoming BBC project Industry), Taheen Modak (co-lead in Maisie Williams’ new Sky show Two Weeks To Live), and Sinead Harnett (UK singer/influencer) in the cast.… Expand"
  },
  {
    "name": "EarthNight",
    "details_link": "https://www.metacritic.com/game/playstation-4/earthnight",
    "publisher": "cleaversoft",
    "release_date": "Jan 23 2020",
    "developers": [
      "cleaversoft"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/6201e6a70c5bdd3bf6e523fee09c3df1-98.jpg",
    "descriptions": "EarthNight is a hand-painted roguelike runner about the dragon apocalypse. Dragons have taken over the Earth and exiled the decimated human population to outer space. Our outraged heroes Stanley and Sydney decide to skydive to the planet’s surface, taking out as many dragons as they can onEarthNight is a hand-painted roguelike runner about the dragon apocalypse. Dragons have taken over the Earth and exiled the decimated human population to outer space. Our outraged heroes Stanley and Sydney decide to skydive to the planet’s surface, taking out as many dragons as they can on their way. In terms of gameplay, Stanley is a good pick for beginners given his simpler control scheme. Sydney is for experts, with a less intuitive — but ultimately more rewarding — control scheme.… Expand"
  },
  {
    "name": "Stories Untold",
    "details_link": "https://www.metacritic.com/game/switch/stories-untold",
    "publisher": "Devolver Digital",
    "release_date": "Jan 16 2020",
    "developers": [
      "No Code"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Text"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/857389191e7f92801756e930de65bcf4-98.jpg",
    "descriptions": "Stories Untold is a compilation tape of four experimental text adventures, including a remaster of the original episode The House Abandon."
  },
  {
    "name": "Gravity Ghost: Deluxe Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/gravity-ghost-deluxe-edition",
    "publisher": "Ivy Games LLC",
    "release_date": "Aug  6 2019",
    "developers": [
      "Ivy Games LLC"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 79,
    "users_score": 3.2,
    "image": "https://static.metacritic.com/images/products/games/1/9dc452b0305c69c955615fb999169f85-98.jpg",
    "descriptions": "Surf the night sky. Careen through the cosmos. Find the fox. When a ghost girl’s best friend goes missing, she’ll turn the whole universe upside down to find him. Gravity Ghost is a planetary platformer where orbiting is an art form. In over 100 dizzying levels, put your aerial skills to theSurf the night sky. Careen through the cosmos. Find the fox. When a ghost girl’s best friend goes missing, she’ll turn the whole universe upside down to find him. Gravity Ghost is a planetary platformer where orbiting is an art form. In over 100 dizzying levels, put your aerial skills to the test against planets that bounce, break, splash, and more. … Expand"
  },
  {
    "name": "Splasher",
    "details_link": "https://www.metacritic.com/game/pc/splasher",
    "publisher": "The Sidekicks",
    "release_date": "Feb  7 2017",
    "developers": [
      "Splashteam"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/9/6aae15439091fc0177dca90f37b1fb74-98.jpg",
    "descriptions": "Splasher is a 2D platformer with unique arcade/action gameplay. It offers gamers challenges that require agility, speed and fast reflexes, and is set in a crazy cartoon universe."
  },
  {
    "name": "Steredenn",
    "details_link": "https://www.metacritic.com/game/xbox-one/steredenn",
    "publisher": "Plug In Digital",
    "release_date": "Apr  1 2016",
    "developers": [
      "Pixelnest Studio"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shoot-'Em-Up",
      "Horizontal"
    ],
    "meta_score": 79,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/8/32da7202018ab63c69fb3ba4cda33323-98.jpg",
    "descriptions": "Steredenn is a frenetic and chaotic space shooter, carved in big beautiful pixels, with insane boss battles. Embark in your ship and engage the fight against dreadful space pirates in a never-ending combat for your survival."
  },
  {
    "name": "The Evil Within",
    "details_link": "https://www.metacritic.com/game/xbox-one/the-evil-within",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct 14 2014",
    "developers": [
      "Tango Gameworks"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Horror",
      "Action Adventure",
      "Horror",
      "Survival"
    ],
    "meta_score": 79,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/7/ec05ced646073630fec2892fcf268899-98.jpg",
    "descriptions": "While investigating the scene of a gruesome mass murder, Detective Sebastian Castellanos and his partners encounter a menacing and powerful force. After witnessing the slaughter of fellow officers, Sebastian is ambushed and knocked unconscious. When he awakens, he finds himself in a derangedWhile investigating the scene of a gruesome mass murder, Detective Sebastian Castellanos and his partners encounter a menacing and powerful force. After witnessing the slaughter of fellow officers, Sebastian is ambushed and knocked unconscious. When he awakens, he finds himself in a deranged world where hideous creatures wander among the dead. Facing unimaginable terror, and fighting for survival, Sebastian embarks on a daunting journey to unravel that which is behind this evil force.… Expand"
  },
  {
    "name": "Cart Life (2013)",
    "details_link": "https://www.metacritic.com/game/pc/cart-life-2013",
    "publisher": "Richard Hofmeier",
    "release_date": "Jul 29 2010",
    "developers": [
      "Richard Hofmeier"
    ],
    "platforms": "PC",
    "genres": [
      "Simulation",
      "General",
      "General"
    ],
    "meta_score": 79,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/3/ee7e274d1b62b33705d9c9a7fae8c330-98.jpg",
    "descriptions": "Cart Life is a retail simulation for windows which portrays the lives of street vendors."
  },
  {
    "name": "Mega Man 10",
    "details_link": "https://www.metacritic.com/game/xbox-360/mega-man-10",
    "publisher": "Capcom",
    "release_date": "Mar 31 2010",
    "developers": [
      "Inti Creates"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/4/403564603d965816cd8815cbba6bb14c-98.jpg",
    "descriptions": "[Xbox Live Arcade]  The original 2-D classic Mega Man returns in the all new Mega Man 10! Mega Man 10 continues to bring the series back to its old-school roots, with retro platforming action and classic 8-bit graphics and sound. Rediscover Mega Man with new, classically-inspired boss[Xbox Live Arcade]  The original 2-D classic Mega Man returns in the all new Mega Man 10! Mega Man 10 continues to bring the series back to its old-school roots, with retro platforming action and classic 8-bit graphics and sound. Rediscover Mega Man with new, classically-inspired boss characters, each with unique weapons and vulnerabilities. The year is 20XX and Robotenza - the Robot Flu - has spread like wildfire, incapacitating robots everywhere. One month after the outbreak, the situation worsens. Infected robots have gone out of control and have destroyed the city! It's up to Mega Man to get to the bottom of this viral mystery.… Expand"
  },
  {
    "name": "Sword of the Stars: Born of Blood",
    "details_link": "https://www.metacritic.com/game/pc/sword-of-the-stars-born-of-blood",
    "publisher": "Lighthouse Interactive",
    "release_date": "Jun  5 2007",
    "developers": [
      "Kerberos Productions"
    ],
    "platforms": "PC",
    "num_players": "8  Online",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Sci-Fi",
      "Sci-Fi"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/915a857afc68fb7b59dcc50a51a1004e-98.jpg",
    "descriptions": "Forged in the fires of advanced biotechnology, a new race has emerged from the shadows to threaten the SotS universe. Born of blood, driven by hunger and launched on a relentless search for the Gods that made them, these brutal warriors will stop at nothing to find \"The Great Masters.\" AsForged in the fires of advanced biotechnology, a new race has emerged from the shadows to threaten the SotS universe. Born of blood, driven by hunger and launched on a relentless search for the Gods that made them, these brutal warriors will stop at nothing to find \"The Great Masters.\" As they tear the galaxy apart, a dark new chapter in the annals of interstellar conquest will begin. Bringing with it new strategies, new weapons, and a new view of \"resources.\" They call themselves The Zuul. And they have uses for you. [GamersGate]… Expand"
  },
  {
    "name": "Gun",
    "details_link": "https://www.metacritic.com/game/xbox/gun",
    "publisher": "Activision",
    "release_date": "Nov  8 2005",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Historic"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/0/4c5f49107669fd513db2edc4dc35462b-98.jpg",
    "descriptions": "You can experience the lawless Wild West as gunslinger Colton White in the action title Gun. Traverse an expansive world where you'll encounter outlaws, Native Americans, corrupt lawmen, and army psychopaths. You can assault a fort, hunt for bounties, and upgrade your equipment as you battleYou can experience the lawless Wild West as gunslinger Colton White in the action title Gun. Traverse an expansive world where you'll encounter outlaws, Native Americans, corrupt lawmen, and army psychopaths. You can assault a fort, hunt for bounties, and upgrade your equipment as you battle through a variety of gameplay styles. Gun also features a story written by Hollywood script writer Randall Jahnson.… Expand"
  },
  {
    "name": "Scott Pilgrim vs. the World: The Game - Complete Edition",
    "details_link": "https://www.metacritic.com/game/switch/scott-pilgrim-vs-the-world-the-game---complete-edition",
    "publisher": "Ubisoft",
    "release_date": "Jan 14 2021",
    "developers": [
      "Ubisoft",
      "Engine Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/3/e8cebe259c7a93a3aae415fa4dbb5f46-98.jpg",
    "descriptions": "Play as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesomePlay as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesome mini-games to see who ends up on top! Can you defeat Ramona's League of Evil Exes as you try to win her heart? Epic battles with Lucas Lee, Gideon Graves, and more await Scott Pilgrim and his friends. Zombie hordes? Dodgeball? Battle Royale? Just a few of the things you'll find playing through this Complete Edition. Compete in sub-space mini-games, experience a killer soundtrack, and much more as you re-live the beloved story of Scott Pilgrim vs. the World.… Expand"
  },
  {
    "name": "Sonic's Ultimate Genesis Collection",
    "details_link": "https://www.metacritic.com/game/xbox-360/sonics-ultimate-genesis-collection",
    "publisher": "Sega",
    "release_date": "Feb 10 2009",
    "developers": [
      "Backbone Entertainment"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation",
      "Compilation"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/5/6f871797210d6dd5f9a06831a6281c9f-98.jpg",
    "descriptions": "Take a trip back in time with over 40 titles from the SEGA Genesis era, including your Sonic The Hedgehog favorites. In classic single-player and multiplayer battles, you’ll take down a huge variety of enemies, including Sonic’s nemesis Dr. Eggman (AKA Dr. Robotnik), shuriken-flingingTake a trip back in time with over 40 titles from the SEGA Genesis era, including your Sonic The Hedgehog favorites. In classic single-player and multiplayer battles, you’ll take down a huge variety of enemies, including Sonic’s nemesis Dr. Eggman (AKA Dr. Robotnik), shuriken-flinging ninjas, hordes of altered beasts and the world’s greatest fighting champions. [Sega]… Expand"
  },
  {
    "name": "SoulCalibur",
    "details_link": "https://www.metacritic.com/game/xbox-360/soulcalibur",
    "publisher": "Namco Bandai Games",
    "release_date": "Jul  2 2008",
    "developers": [
      "Namco Bandai Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/596dc06e65e6a148ab6aa3c0bb1c9d29-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Soulcalibur, the highest Metascoring game on the Dreamcast, has returned to the next generation. Sharpen your blades as you relive old grudges against classic adversaries in new high definition graphics. Prove your mettle against the world with a variety of leaderboards[Xbox Live Arcade]  Soulcalibur, the highest Metascoring game on the Dreamcast, has returned to the next generation. Sharpen your blades as you relive old grudges against classic adversaries in new high definition graphics. Prove your mettle against the world with a variety of leaderboards spanning every character and mode, or challenge a friend in local-play Versus mode. Nineteen playable characters: All of your favorite fighters are back including Kilik, Ivy, Siegfried, Edge Master, Nightmare, and many more. Eight modes of play: Try the different game modes including Story, Versus, and even Museum Mode that allows players to view artwork, character models, and animations. Leaderboards galore: Compare stats in sixty leaderboards spanning across each character and mode. High definition support: Soulcalibur has been given a whole new coat of beautiful paint to support HD resolutions up to 1080p. [Namco Bandai Games]… Expand"
  },
  {
    "name": "Kaze and the Wild Masks",
    "details_link": "https://www.metacritic.com/game/switch/kaze-and-the-wild-masks",
    "publisher": "Soedesco",
    "release_date": "Mar 26 2021",
    "developers": [
      "PixelHive"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/95e1a63e9d70798c0a9de4d475f43a28-98.jpg",
    "descriptions": "Unleash the skills of the Wild Masks to get powers from the tiger, eagle, lizard and shark. Uncover the secrets of the Crystal Islands in 30+ levels with over 50 bonus levels. Relive your childhood memories of classic platformer with high quality frame by frame pixel art. Pave your wayUnleash the skills of the Wild Masks to get powers from the tiger, eagle, lizard and shark. Uncover the secrets of the Crystal Islands in 30+ levels with over 50 bonus levels. Relive your childhood memories of classic platformer with high quality frame by frame pixel art. Pave your way through a satisfyingly smooth, but challenging platformer.\r… Expand"
  },
  {
    "name": "Counter-Strike: Global Offensive",
    "details_link": "https://www.metacritic.com/game/xbox-360/counter-strike-global-offensive",
    "publisher": "Valve Software",
    "release_date": "Aug 22 2012",
    "developers": [
      "Valve Software",
      "Hidden Path Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Tactical",
      "Modern"
    ],
    "meta_score": 79,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/5/1a4a8a21003b1de105186ff8e3b5809c-98.jpg",
    "descriptions": "Counter-Strike: Global Offensive features new maps, characters, and weapons and delivers updated versions of the classic CS content."
  },
  {
    "name": "X-Men Legends",
    "details_link": "https://www.metacritic.com/game/playstation-2/x-men-legends",
    "publisher": "Activision",
    "release_date": "Sep 21 2004",
    "developers": [
      "Raven Software"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/b312c7ca2aad63cfde3e67734c0d7363-98.jpg",
    "descriptions": "X-Men: Legends is the first game to capture the complete essence of the X-Men by allowing players to control multiple characters that fight together as a team. The game blends the best parts of the movies, comic books in a fantastic new adventure that allows the you to develop yourX-Men: Legends is the first game to capture the complete essence of the X-Men by allowing players to control multiple characters that fight together as a team. The game blends the best parts of the movies, comic books in a fantastic new adventure that allows the you to develop your specialized powers as you succeed through your missions. Penned by Man of Action, a studio of comic industry veterans, X-Men: Legends begins with the rescue of a young mutant and takes players through an engrossing plot that could unite mutant-kind, yet destroy the human race in the process. Along the way, players will be able to assemble their ideal X-Men crew from over 15 of the most popular characters from the last 40 years, including Wolverine™, Cyclops™, Storm™, Nightcrawler™, Colossus™, Gambit™ and Beast™, to name a few. However, before players load-up their squad with heavy hitters, they will have to take their foes' abilities into consideration as certain situations may benefit from the abilities of specific X-Men. While Cyclops' optic blasts and Colossus' immense strength are great for clearing a path through hordes of enemies, players can opt to bring Wolverine and Nightcrawler along on a stealth intensive mission to help circumvent detection devices. Once the action begins, players can take control of any member of their squad and even execute multi-character combinations such as the famous Wolverine/Colossus Fastball Special. As they progress through the game, characters will gain experience points that players can use to upgrade the X-Men's abilities and even learn new fighting styles. [Activision]… Expand"
  },
  {
    "name": "WindJammers 2",
    "details_link": "https://www.metacritic.com/game/pc/windjammers-2",
    "publisher": "DotEmu",
    "release_date": "Jan 20 2022",
    "developers": [
      "DotEmu"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "2 ",
    "genres": [
      "Sports",
      "Individual",
      "Other"
    ],
    "meta_score": 79,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/3/2c0e683dfa7f833196fe5f5f4b196470-98.jpg",
    "descriptions": "The best flying disc game of all time is back! With amazing hand-drawn graphics, crazy new moves, gameplay mechanics and awesome new characters and stages, Windjammers 2 is the sequel you've been dreaming of."
  },
  {
    "name": "Worms Reloaded",
    "details_link": "https://www.metacritic.com/game/pc/worms-reloaded",
    "publisher": "Team17",
    "release_date": "Aug 26 2010",
    "developers": [
      "Team17"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Wargame",
      "General",
      "Fantasy",
      "Artillery"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/66e663f603e44f30f75bc9c948156c2b-98.jpg",
    "descriptions": "Indeed, while the most celebrated features of the series are present and correct, Worms Reloaded also sports a large amount of new additions to almost every facet of the gameplay experience. Over 60 single-player missions (including new Warzone Campaign and Bodycount Mode), a fully featuredIndeed, while the most celebrated features of the series are present and correct, Worms Reloaded also sports a large amount of new additions to almost every facet of the gameplay experience. Over 60 single-player missions (including new Warzone Campaign and Bodycount Mode), a fully featured landscape creator, 45+ plus weapons spanning the entire Worms series and a huge currency based customization system - all wrapped up in HD quality visuals - means that Worms Reloaded will  be a highly enjoyable experience, whether playing alone or with friends. … Expand"
  },
  {
    "name": "The Quarry",
    "details_link": "https://www.metacritic.com/game/pc/the-quarry",
    "publisher": "2K Games",
    "release_date": "Jun 10 2022",
    "developers": [
      "Supermassive Games"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 79,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/2/6f9d302946a546adb0e7265e28ab5919-98.jpg",
    "descriptions": "As the sun sets on the last day of summer camp, the teenage counselors of Hackett's Quarry throw a party to celebrate. No kids. No adults. No rules. Things quickly take a turn for the worse. Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel intoAs the sun sets on the last day of summer camp, the teenage counselors of Hackett's Quarry throw a party to celebrate. No kids. No adults. No rules. Things quickly take a turn for the worse. Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel into an unpredictable night of horror. Friendly banter and flirtations give way to life-or-death decisions, as relationships build or break under the strain of unimaginable choices.\r Play as each of the nine camp counselors in a thrilling cinematic tale, where every decision shapes your unique story from a tangled web of possibilities. Any character can be the star of the showor die before daylight comes.\r How will your story unfold?\r YOUR STORY, THEIR FATE\rWill you dare to check what's behind that trap door? Will you investigate the screams echoing from within the forest? Will you save your friends or desperately run for your life? Every choice, big or small, shapes your story and determines who lives to tell the tale.\r A STUNNING CINEMATIC EXPERIENCE\rCutting edge facial capture and filmic lighting techniques, combined with incredible performances from an iconic ensemble cast of Hollywood talent, bring the horrors of Hackett's Quarry to life in a pulse-pounding, cinematic thrill ride.\r ENJOY THE FRIGHT WITH FRIENDS\rPlace your faith in up to 7 friends in online play, where invited players watch along and vote on key decisions, creating a story shaped by the whole group! Or, play together in a party horror couch co-op experience where each player picks a counselor and controls their actions.\r CUSTOMIZE YOUR EXPERIENCE\rAdjustable difficulty for all gameplay elements let players of any skill level enjoy the horror. And if you prefer to watch rather than play, Movie Mode lets you enjoy The Quarry as a binge-worthy cinematic thriller. Select how you want the story to unfold, kick back, and munch on some popcorn in between all the screams!\r STARRING:\rDavid Arquette as Chris\rAriel Winter as Abigail\rBrenda Song as Kaitlyn\rEvan Evagora as Nick\rHalston Sage as Emma\rJustice Smith as Ryan\rMiles Robbins as Dylan\rSiobhan Williams as Laura\rSkyler Gisondo as Max\rZach Tinker as Jacob\rEthan Suplee as Bobby\rGrace Zabriskie as Eliza\rLance Henriksen as Jedediah\rLin Shaye as Constance\rTed Raimi as Travis… Expand"
  },
  {
    "name": "Immortals Fenyx Rising",
    "details_link": "https://www.metacritic.com/game/pc/immortals-fenyx-rising",
    "publisher": "Ubisoft",
    "release_date": "Dec  3 2020",
    "developers": [
      "Ubisoft Quebec"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/6/5ca1c1a873aeecc27c7fc676adee50f2-98.jpg",
    "descriptions": "[Formerly titled 'Gods & Monsters'] Play as Fenyx, a new winged demigod, on a quest to save the Greek gods and their home from a dark curse. Take on mythological beasts, master the legendary powers of the gods, and defeat Typhon, the deadliest Titan in Greek mythology, in an epic fight for the ages."
  },
  {
    "name": "Warhammer: End Times - Vermintide",
    "details_link": "https://www.metacritic.com/game/pc/warhammer-end-times---vermintide",
    "publisher": "Fatshark AB",
    "release_date": "Oct 23 2015",
    "developers": [
      "Fatshark AB",
      "Fatshark"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/2ebcb0c6a9ad8cde250837bf5d136094-98.jpg",
    "descriptions": "Vermintide is an epic co-operative action combat adventure set in the End Times of the iconic Warhammer Fantasy world."
  },
  {
    "name": "South Park: The Fractured But Whole",
    "details_link": "https://www.metacritic.com/game/playstation-4/south-park-the-fractured-but-whole",
    "publisher": "Ubisoft",
    "release_date": "Oct 17 2017",
    "developers": [
      "Ubisoft San Francisco"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/1/cf55d656001bfb181a6c5c88f8108ed0-98.jpg",
    "descriptions": "South Park: The Fractured but Whole empowers players to delve into the tender, crime-ridden underbelly of South Park with Coon and Friends. This dedicated group of crime fighters was formed by Eric Cartman, whose superhero alter ego, The Coon, is half man, half raccoon. As The New Kid,South Park: The Fractured but Whole empowers players to delve into the tender, crime-ridden underbelly of South Park with Coon and Friends. This dedicated group of crime fighters was formed by Eric Cartman, whose superhero alter ego, The Coon, is half man, half raccoon. As The New Kid, players join Mysterion, Toolshed, Human Kite, Mosquito, Mint Berry Crunch and a group of others to battle the forces of evil while Coon strives to make his team some of the most beloved superheroes in history. Creators Matt Stone and Trey Parker were involved in every step of the development of the game. [Ubisoft]… Expand"
  },
  {
    "name": "LEGO Batman 2: DC Super Heroes",
    "details_link": "https://www.metacritic.com/game/xbox-360/lego-batman-2-dc-super-heroes",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Jun 19 2012",
    "developers": [
      "TT Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Wii U",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/7/c38a8370bfc948c6f6e7aa2c903e1e04-98.jpg",
    "descriptions": "Lego Batman 2: DC Super Heroes is a sequel to Lego Batman: The Videogame and includes appearances from the likes of Wonder Woman, Superman, and The Green Lantern."
  },
  {
    "name": "Monday Night Combat",
    "details_link": "https://www.metacritic.com/game/xbox-360/monday-night-combat",
    "publisher": "Microsoft Game Studios",
    "release_date": "Aug 11 2010",
    "developers": [
      "Uber Entertainment"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/8/c7815efef4975f62be6c335e61783f87-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Monday Night Combat is a class-based, third-person shooter ... and the most popular lethal sport of the future! It blends intense combat, finishing moves, and gameshow-like challenges and rewards to produce an action experience unlike any other. Why fight for \"honor\" or[Xbox Live Arcade]  Monday Night Combat is a class-based, third-person shooter ... and the most popular lethal sport of the future! It blends intense combat, finishing moves, and gameshow-like challenges and rewards to produce an action experience unlike any other. Why fight for \"honor\" or \"duty\" when you can fight for the real American dream - cash, fame and endorsements?… Expand"
  },
  {
    "name": "Shin-chan: Me and the Professor on Summer Vacation - The Endless Seven-Day Journey",
    "details_link": "https://www.metacritic.com/game/switch/shin-chan-me-and-the-professor-on-summer-vacation---the-endless-seven-day-journey",
    "publisher": "Neos",
    "release_date": "Aug 11 2022",
    "developers": [
      "Millennium Kitchen"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 79,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/7/b75798e483b1f1e6ba049e47d6a9aca3-98.jpg",
    "descriptions": "Join Shin-chan and his family on a 7-day summer vacation in Kyushu. Before the start of your adventure, you'll receive a strange camera from an Evil Professor that serves as your daily companion in recording all of your discoveries and moments during your venture. Enjoy doing other stuffJoin Shin-chan and his family on a 7-day summer vacation in Kyushu. Before the start of your adventure, you'll receive a strange camera from an Evil Professor that serves as your daily companion in recording all of your discoveries and moments during your venture. Enjoy doing other stuff like catching various insects and fishes to fill up your wildlife journal. So, be sure to get your camera and bug-catching net ready as you explore the wonderful land of Kyushu.However, things get a little bit tricky upon realizing that your friends in Kyushu look exactly the same as your friends' way back home. Plus, things get even darker upon your encounter with a giant creature and a strange man.What kind of experience awaits you in Crayon Shin-chan: Ora to Hakase no Natsuyasumi - Owaranai Nanokakan no Tabi?… Expand"
  },
  {
    "name": "Final Fantasy I & II: Dawn of Souls",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/final-fantasy-i-ii-dawn-of-souls",
    "publisher": "Nintendo",
    "release_date": "Nov 29 2004",
    "developers": [
      "Tose Software"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 79,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/dc031105c28a69b5b067eb8a3b14c784-98.jpg",
    "descriptions": "Relive the first two chapters in the Final Fantasy saga--this time with all-new story elements and gameplay. Now you can experience new dungeons, storylines, and characters. Furthermore, you can master the enhanced control systems, and you can save your game at anytime. In Final Fantasy, youRelive the first two chapters in the Final Fantasy saga--this time with all-new story elements and gameplay. Now you can experience new dungeons, storylines, and characters. Furthermore, you can master the enhanced control systems, and you can save your game at anytime. In Final Fantasy, you control a group of heroes on a mission to save a kingdom in turmoil. The sequel lets you swap out members of your parties during the game, allowing you to experience the adventure with more characters.… Expand"
  },
  {
    "name": "DNF Duel",
    "details_link": "https://www.metacritic.com/game/pc/dnf-duel",
    "publisher": "Nexon",
    "release_date": "Jun 28 2022",
    "developers": [
      "Arc System Works",
      "Eighting"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "PC"
    ],
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/0/255c7f9ce493076087058b18eec1b16c-98.jpg",
    "descriptions": "Action fighting to the extreme. Enter the new beat ’em up world of Arad as your favorite character from the esteemed Dungeon and Fighter franchise. One of the most popular and widely played RPGs in the world, Dungeon and Fighter is now back as a 2.5D action fighting game. Choose from 10Action fighting to the extreme. Enter the new beat ’em up world of Arad as your favorite character from the esteemed Dungeon and Fighter franchise. One of the most popular and widely played RPGs in the world, Dungeon and Fighter is now back as a 2.5D action fighting game. Choose from 10 charming characters, each with their own distinct skills and personalities. Outsmart, outplay, or downright beat up your opponents and become the master of the Ultimate Will.… Expand"
  },
  {
    "name": "MX vs. ATV Unleashed",
    "details_link": "https://www.metacritic.com/game/playstation-2/mx-vs-atv-unleashed",
    "publisher": "THQ",
    "release_date": "Mar 16 2005",
    "developers": [
      "Rainbow Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "6  Online",
    "genres": [
      "Driving",
      "Racing",
      "Rally / Offroad"
    ],
    "meta_score": 79,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/1d27d4c319fddc8fd98d76d895a20dc1-98.jpg",
    "descriptions": "In MX vs. ATV Unleashed, players power through all-new environments and event types, choosing from a variety of new vehicles. A redesigned monster truck, powerful sand-rail and raised 4x4 golf karts meet ATVs, dirt bikes and bi-planes to compete in massive free-world environments featuringIn MX vs. ATV Unleashed, players power through all-new environments and event types, choosing from a variety of new vehicles. A redesigned monster truck, powerful sand-rail and raised 4x4 golf karts meet ATVs, dirt bikes and bi-planes to compete in massive free-world environments featuring hill climbs, machine challenges and short track races. The game's career mode allows gamers to choose from the top professional ATV and Motocross riders. [THQ]… Expand"
  },
  {
    "name": "The Touryst",
    "details_link": "https://www.metacritic.com/game/switch/the-touryst",
    "publisher": "Shin'en",
    "release_date": "Nov 21 2019",
    "developers": [
      "Shin'en"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General",
      "Sandbox"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/8/917d7d3800c1615372ccdeb9a1db0248-98.jpg",
    "descriptions": "You are just arriving at the Monument Islands. Want to go swimming? Or rather take a dive into the deep sea? Or do you want to visit the amusement arcade, do some shopping, dance at the beach party? Fancy some surfing? Or will you talk with the strange old tourist and listen what he has toYou are just arriving at the Monument Islands. Want to go swimming? Or rather take a dive into the deep sea? Or do you want to visit the amusement arcade, do some shopping, dance at the beach party? Fancy some surfing? Or will you talk with the strange old tourist and listen what he has to say about these ancient mysterious monuments..… Expand"
  },
  {
    "name": "Tropico 3",
    "details_link": "https://www.metacritic.com/game/pc/tropico-3",
    "publisher": "Kalypso",
    "release_date": "Oct 20 2009",
    "developers": [
      "Haemimont",
      "Haemimont Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Tycoon",
      "Management",
      "Tycoon",
      "Government"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/2d210e6f8023cf5b50c9bb40e6e2a221-98.jpg",
    "descriptions": "As in the original Tropico, the player again is able to play the role of \"El Presidente\" taking over the control of a tropical island. You decide whether you want to use your army to secure your power base in the best traditions of corrupt, unscrupulous tyrants everywhere, or alternativelyAs in the original Tropico, the player again is able to play the role of \"El Presidente\" taking over the control of a tropical island. You decide whether you want to use your army to secure your power base in the best traditions of corrupt, unscrupulous tyrants everywhere, or alternatively to lead your people to prosperity in your role as generous elder statesman. Danger lurks on every corner. There are militant rebels planning a Coup d'Etat for a communistic Junta, while in the background there are two lurking superpowers, the USA and the Soviet Union, who would perhaps prefer a more pliable president in the strategically important island of Tropico! [Kalypso]… Expand"
  },
  {
    "name": "Rollerdrome",
    "details_link": "https://www.metacritic.com/game/playstation-5/rollerdrome",
    "publisher": "Private Division",
    "release_date": "Aug 16 2022",
    "developers": [
      "roll7"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/7031798948cc993a2dc3f5b45f401a6a-98.jpg",
    "descriptions": "The year is 2030, and you are a competitor in a brutal new bloodsport – Rollerdrome. Combine stylish skate tricks with devastating slow-mo kills, picking your weapons with care to land the killing blow and make it to the end of the round… and maybe, with enough skill and hard work, to theThe year is 2030, and you are a competitor in a brutal new bloodsport – Rollerdrome. Combine stylish skate tricks with devastating slow-mo kills, picking your weapons with care to land the killing blow and make it to the end of the round… and maybe, with enough skill and hard work, to the end of the Championship. [Roll7]… Expand"
  },
  {
    "name": "Kirby's Extra Epic Yarn",
    "details_link": "https://www.metacritic.com/game/3ds/kirbys-extra-epic-yarn",
    "publisher": "Nintendo",
    "release_date": "Mar  8 2019",
    "developers": [
      "Good-Feel"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/9/9cf9da6500fb2a2406fc1b8587ebfc27-98.jpg",
    "descriptions": "Kirby can transform into knitted wonders like tanks and flying saucers. Plus, his new ravel abilities mimic his classic copy abilities, adding something new to every stage of this action-adventure game. Ravel abilities allow Kirby to drop buttons like bombs or wield a wire like a sword. AndKirby can transform into knitted wonders like tanks and flying saucers. Plus, his new ravel abilities mimic his classic copy abilities, adding something new to every stage of this action-adventure game. Ravel abilities allow Kirby to drop buttons like bombs or wield a wire like a sword. And that’s just the beginning of all the makeshift magic. Dead end? Unzip a secret passage. Too dark? Unbutton the night to shed some light. Boss blocking your way? Unravel its face! As you play, you’ll collect decorative treasures for Kirby’s Pad. Show yours off with the StreetPassTM feature. If story mode isn’t tough enough, see if you can earn more collectibles in Devilish Mode. In this harder mode, you must survive without invincibility as devils obstruct your path through each stage. There are also all-new minigames starring Meta Knight and King Dedede.… Expand"
  },
  {
    "name": "Wilson's Heart",
    "details_link": "https://www.metacritic.com/game/pc/wilsons-heart",
    "publisher": "Twisted Pixel Games",
    "release_date": "Apr 21 2017",
    "developers": [
      "Twisted Pixel Games"
    ],
    "platforms": "PC",
    "genres": [
      "Action Adventure",
      "Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/3/f92d133d3c139f292b4ea4bf28aa04b4-98.jpg",
    "descriptions": "Wilson's Heart is an immersive first-person psychological thriller set in a 1940's hospital that has undergone a haunting transformation. In this original VR adventure, you become Robert Wilson, a patient who awakens to the shocking discovery that his heart has been replaced with aWilson's Heart is an immersive first-person psychological thriller set in a 1940's hospital that has undergone a haunting transformation. In this original VR adventure, you become Robert Wilson, a patient who awakens to the shocking discovery that his heart has been replaced with a mysterious device. As the hospital hauntings intensify, you and your fellow patients must traverse increasingly maddening corridors, overcome frightening environmental hazards and work together to defeat the sinister inhabitants in your pursuit to reveal who stole your heart... and why. Wilson's Heart leverages an eccentric cast of characters, compelling narrative, striking visuals, and the immersive nature of Touch to bring you into an interactive adventure of mystery unlike any other game. [Twisted Pixel]… Expand"
  },
  {
    "name": "Shantae and the Pirate's Curse",
    "details_link": "https://www.metacritic.com/game/xbox-one/shantae-and-the-pirates-curse",
    "publisher": "WayForward",
    "release_date": "Mar 16 2016",
    "developers": [
      "WayForward"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Wii U",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/8/30363a4c126e37e6443aa4779beb16e6-98.jpg",
    "descriptions": "Embark on a brand new adventure which teams Shantae with her arch nemesis, Risky Boots! When a curse falls upon Sequin Land, Risky Boots and Shantae must join forces to battle unimaginable evil. Shantae must give up her job as Scuttle Towns \"Guardian Genie\" and become a pirate ifEmbark on a brand new adventure which teams Shantae with her arch nemesis, Risky Boots! When a curse falls upon Sequin Land, Risky Boots and Shantae must join forces to battle unimaginable evil. Shantae must give up her job as Scuttle Towns \"Guardian Genie\" and become a pirate if she hopes to get her magic back and save the day. As a pirate, Shantae gains new weapons and tools to advance her quest and power through monsters!\r *    Flintlock Pistol (blast enemies and switches from afar)\r*    Pirate Hat (glide on the wind using this enormous headwear)\r*    Risky's Boots (run at super speeds! Chain your attacks as you dash through enemies & over lava)\r*    Cannon (blast yourself into the air on a belch of black powder)\r Core Gameplay Components:\r *    Whipping! Destroy monsters, topple bosses, and solve puzzles with your hair\r*    Platforming! Run and jump through deviously designed levels\r*    Exploring! Navigate a world of interconnected levels and Labyrinths\r*    Belly Dancing! Dance with your Magic Lamp to suck up magic and items\r*    Customizing! Earn new abilities, unlock stat-boosting artifacts, magic & costumes\r*    Storytelling! Flirtatious characters and wonderfully off-beat humor… Expand"
  },
  {
    "name": "Else Heart.Break()",
    "details_link": "https://www.metacritic.com/game/pc/else-heartbreak()",
    "publisher": "Erik Svedang",
    "release_date": "Sep 24 2015",
    "developers": [
      "Erik Svedang"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/7/e5a6bd5452667d8a4fd106f2f0c1b514-98.jpg",
    "descriptions": "A game about friendship, love and technology in a place where bits have replaced atoms."
  },
  {
    "name": "NHL 2K10",
    "details_link": "https://www.metacritic.com/game/wii/nhl-2k10",
    "publisher": "Take-Two Interactive",
    "release_date": "Sep 15 2009",
    "developers": [
      "Take-Two Interactive"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/0/43a806de96336680ced1c6710e6ecf78-98.jpg",
    "descriptions": "New Control Scheme - Choose between fun, easy-to-use Wii Remote and Nunchuk controls and Sideways Wii Remote support, or plug in a Wii Classic Controller for three ways to play. Full Online Modes - For the first time, enjoy full online support for Wii, including multiplayer and multi-consoleNew Control Scheme - Choose between fun, easy-to-use Wii Remote and Nunchuk controls and Sideways Wii Remote support, or plug in a Wii Classic Controller for three ways to play. Full Online Modes - For the first time, enjoy full online support for Wii, including multiplayer and multi-console match-ups, downloadable rosters, online leagues, tournaments, leaderboards and Team Up mode featuring persistent created teams and regular Pick-Up Games. WiiMotion Plus and WiiSpeak Support - Enjoy online voice chat capabilities via WiiSpeak and precise one-to-one control with WiiMotion Plus. [2K Sports]… Expand"
  },
  {
    "name": "GrimGrimoire",
    "details_link": "https://www.metacritic.com/game/playstation-2/grimgrimoire",
    "publisher": "NIS America",
    "release_date": "Jun 26 2007",
    "developers": [
      "Vanilla Ware"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/4/e29484df3fe842429c61a74e21b5878c-98.jpg",
    "descriptions": "Lillet Blan was very excited. Her heart had been racing since the moment she heard Lillet had been invited to enroll into a Magic Academy where only talented youths were personally sought out by the greatest wizards. The school was lead by the famous wizard, Gammel Dore, who had onceLillet Blan was very excited. Her heart had been racing since the moment she heard Lillet had been invited to enroll into a Magic Academy where only talented youths were personally sought out by the greatest wizards. The school was lead by the famous wizard, Gammel Dore, who had once defeated the Archmage. And the campus on which they study, the Silver Star tower, was once the destroyed Archmage's castle. The tower was full of unsolved mysteries and dangers, and this attracted many who had their own personal reasons in mind. Lilet had opened her first grimoire, and began her studies. But only five days later, a terrifying disaster threatens the academy, and all lives are lost. All except she, who had traveled back throgh time without knowing why...Can Lillet come closer to the truth by repeating days? Can she end the nightmare at the end of those five days? [NIS America]… Expand"
  },
  {
    "name": "Trauma Center: Under the Knife 2",
    "details_link": "https://www.metacritic.com/game/ds/trauma-center-under-the-knife-2",
    "publisher": "Atlus",
    "release_date": "Jul  2 2008",
    "developers": [
      "Vanguard"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Simulation",
      "General",
      "General",
      "Virtual",
      "Career"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/d1f2652e8b9d57eea1452690c1a33062-98.jpg",
    "descriptions": "GUILT is no more. Dr. Derek Stiles and Nurse Angie Thompson faced humanity's greatest threat and triumphed. Now, in the aftermath, they find themselves in unknown territory, forced to deal with the disastrous consequences of the killer virus. Join them as they scramble to address questionsGUILT is no more. Dr. Derek Stiles and Nurse Angie Thompson faced humanity's greatest threat and triumphed. Now, in the aftermath, they find themselves in unknown territory, forced to deal with the disastrous consequences of the killer virus. Join them as they scramble to address questions left unanswered and put an end to the mystery behind the disease. Caduceus' preeminent surgical team returns to confront the aftermath of the devastating GUILT epidemic in a brand new story. With a new easy-play mode, improved tool utility, and clearer directions, playing doctor has never been so much fun. [Atlus USA]… Expand"
  },
  {
    "name": "Little Nightmares: Complete Edition",
    "details_link": "https://www.metacritic.com/game/switch/little-nightmares-complete-edition",
    "publisher": "Bandai Namco Games",
    "release_date": "May 18 2018",
    "developers": [
      "Tarsier Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 79,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/9/f557c23de1bfef9651188c00919d1946-98.jpg",
    "descriptions": "INCLUDES\r- Little Nightmares\r- Little Nightmares: Secret of The Maw\r\n\r\nImmerse yourself in Little Nightmares, a dark whimsical tale that will confront you with your childhood fears! Help Six escape The Maw  a vast, mysterious vessel inhabited by corrupted souls looking for their next meal.INCLUDES\r- Little Nightmares\r- Little Nightmares: Secret of The Maw\r Immerse yourself in Little Nightmares, a dark whimsical tale that will confront you with your childhood fears! Help Six escape The Maw  a vast, mysterious vessel inhabited by corrupted souls looking for their next meal.\r Unveil all the secrets in a parallel escape story where you play as the Runaway Kid, another prisoner looking for a way out of this place of misfortune. On his journey, The Kid will explore hidden parts of The Maw offering a different perspective on Sixs adventures.… Expand"
  },
  {
    "name": "Cities: Skylines - After Dark",
    "details_link": "https://www.metacritic.com/game/pc/cities-skylines---after-dark",
    "publisher": "Paradox Interactive",
    "release_date": "Sep 24 2015",
    "developers": [
      "Colossal Order"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Management",
      "Government"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/8/e92a10fa7759f4f81c939856e7060c69-98.jpg",
    "descriptions": "An expansion for Cities: Skylines that adds a day/night cycle, visual enhancements, new buildings, policies, and district specializations."
  },
  {
    "name": "Runaway: A Twist of Fate",
    "details_link": "https://www.metacritic.com/game/pc/runaway-a-twist-of-fate",
    "publisher": "Focus Home Interactive",
    "release_date": "Apr 21 2011",
    "developers": [
      "Pendulo Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "Point-and-Click",
      "Modern",
      "Third-Person"
    ],
    "meta_score": 79,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/3/17012ef37cd4e12c04ea4e7530b44fe7-98.jpg",
    "descriptions": "Play as Brian and Gina in their last runaway adventure in A Twist of Fate."
  },
  {
    "name": "Monster Hunter 3 Ultimate",
    "details_link": "https://www.metacritic.com/game/3ds/monster-hunter-3-ultimate",
    "publisher": "Capcom",
    "release_date": "Mar 19 2013",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "Wii U",
      "3DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/6dfd25cffd42da0407e8776474c49b7d-98.jpg",
    "descriptions": "Engage larger-than-larger-than-life monsters in battle. Create a myriad of weapons and armor. Discover the epic world of Monster Hunter as you wade through more than two hundred quests. Why hunt alone? Hunt with your 2 AI companions in single player quests or team up with up to three playersEngage larger-than-larger-than-life monsters in battle. Create a myriad of weapons and armor. Discover the epic world of Monster Hunter as you wade through more than two hundred quests. Why hunt alone? Hunt with your 2 AI companions in single player quests or team up with up to three players through your local connection. A fully customizable touch screen allows you to personalize your hunting experience and local Nintendo 3DS search feature helps you find other hunters near you location. Nintendo StreetPass provides you the ability to share you guild card with your fellow hunters.… Expand"
  },
  {
    "name": "Hatsune Miku: Project Diva MegaMix",
    "details_link": "https://www.metacritic.com/game/switch/hatsune-miku-project-diva-megamix",
    "publisher": "Sega",
    "release_date": "May 15 2020",
    "developers": [
      "Sega AM2"
    ],
    "platforms": [
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Rhythm",
      "Music"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/2ab51c1fc487257a4d845dcaf5f59b60-98.jpg",
    "descriptions": "[Also known as \"Hatsune Miku Project Diva Mega39\"] Based on the popular Hatsune Miku: Project DIVA Future Tone, Hatsune Miku: Project DIVA Mega Mix takes the series to a new dimension on the Nintendo Switch, giving both new fans and Project DIVA veterans ways to play at home or on the go.[Also known as \"Hatsune Miku Project Diva Mega39\"] Based on the popular Hatsune Miku: Project DIVA Future Tone, Hatsune Miku: Project DIVA Mega Mix takes the series to a new dimension on the Nintendo Switch, giving both new fans and Project DIVA veterans ways to play at home or on the go. Rhythm game modes features both traditional button controls, as well as a new game mode exclusive to the unique functions of the Nintendo Switch.… Expand"
  },
  {
    "name": "La Pucelle: Tactics",
    "details_link": "https://www.metacritic.com/game/playstation-2/la-pucelle-tactics",
    "publisher": "Mastiff",
    "release_date": "May  4 2004",
    "developers": [
      "Nippon Ichi Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/7/5fd25b13d859ac7b073e2d262e1d52d1-98.jpg",
    "descriptions": "La Pucelle: Tactics is the tactical RPG from Nippon Ichi, creators of \"Disgaea.\" La Pucelle: Tactics is a tale of betrayal and double cross, monsters in human form and humans in monster form, set in an alternate medieval Europe. The unlikely hero is a smart mouthed and undisciplined sixteenLa Pucelle: Tactics is the tactical RPG from Nippon Ichi, creators of \"Disgaea.\" La Pucelle: Tactics is a tale of betrayal and double cross, monsters in human form and humans in monster form, set in an alternate medieval Europe. The unlikely hero is a smart mouthed and undisciplined sixteen year old who just passed her exorcism exams and her comrades in La Pucelle, a demon hunting squad. Features Dark Portals and Purification: Brand new to the RPG world, use your powers to purify defiled ground and enemies. If pulled off right the effect is like having a super-giant combo. Damage multiple enemies at once, stop new enemies from appearing, strengthen items in real time. Fast leveling system: Items, characters and skills can increase every round of battle for well earned instant gratification. Carry up to 149 items and use them to learn special magic. Turn enemies to allies. Bring up to 8 units into battle. Seize the high ground! Battlefield terrain will vary in height: attacking down is way better than being attacked from above. [Mastiff]… Expand"
  },
  {
    "name": "Quarrel",
    "details_link": "https://www.metacritic.com/game/xbox-360/quarrel",
    "publisher": "UTV Ignition Games",
    "release_date": "Jan 25 2012",
    "developers": [
      "Denki"
    ],
    "platforms": "Xbox 360",
    "num_players": "1-4 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Logic",
      "Puzzle",
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/eb26b34f662c3173675eec8abbb7bcdb-98.jpg",
    "descriptions": "A war of words, combining anagram action with simple strategy, all wrapped up in a distinctive, friendly style. Quarrel features characters of varying abilities to play against, each with their own unique vocabularies. Quarrel provides a range of fun, from simple casual play to fiendishA war of words, combining anagram action with simple strategy, all wrapped up in a distinctive, friendly style. Quarrel features characters of varying abilities to play against, each with their own unique vocabularies. Quarrel provides a range of fun, from simple casual play to fiendish challenges against the most verbally-dextrous anagram minds in the world. [Ignition]… Expand"
  },
  {
    "name": "Tales of Monkey Island Chapter 1: Launch of the Screaming Narwhal",
    "details_link": "https://www.metacritic.com/game/pc/tales-of-monkey-island-chapter-1-launch-of-the-screaming-narwhal",
    "publisher": "Telltale Games",
    "release_date": "Jul  7 2009",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC"
    ],
    "genres": [
      "Adventure",
      "General",
      "3D",
      "Fantasy",
      "Third-Person",
      "Fantasy"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/b4ad03376c2be8ebedeec75debd8f443-98.jpg",
    "descriptions": "While explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat Pirate HunterWhile explosively stripping the evil pirate LeChuck of his demonic mojo, Guybrush Threepwood inadvertently infects the entire Caribbean with the arch-fiend's expelled voodoo, which threatens to transform buccaneers into unruly pirate monsters. Pursued by a notorious cut-throat Pirate Hunter and a creepy French Physician who believes that Guybrush's eerily-infected hand holds the secret of eternal life, Threepwood sails the seven seas in search of La Esponja Grande, a legendary sea sponge with unparalleled voodoo exfoliating abilities. But little does Guybrush know, his quest is part of a larger, more sinister plot, and good and evil are not always as they seem. [Telltale Games]… Expand"
  },
  {
    "name": "Wo Long: Fallen Dynasty",
    "details_link": "https://www.metacritic.com/game/pc/wo-long-fallen-dynasty",
    "publisher": "Koei Tecmo Games",
    "release_date": "Mar  3 2023",
    "developers": [
      "Team Ninja"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Linear",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 79,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/4/6ae14769116af7d37c5f1ff2871cb7cb-98.jpg",
    "descriptions": "Wo Long: Fallen Dynasty follows the dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms. Players fight off deadly creatures and enemy soldiers using swordplay based on theWo Long: Fallen Dynasty follows the dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms. Players fight off deadly creatures and enemy soldiers using swordplay based on the Chinese martial arts, attempting to overcome the odds by awakening the true power from within.… Expand"
  },
  {
    "name": "Arena of Valor",
    "details_link": "https://www.metacritic.com/game/switch/arena-of-valor",
    "publisher": "Tencent",
    "release_date": "Sep 25 2018",
    "developers": [
      "Tencent",
      "Tencent Games",
      "TiMi Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "MOBA"
    ],
    "meta_score": 79,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/3/e9b08668b7a8053938a7ec20947ba09a-98.jpg",
    "descriptions": "Arena of Valor is a Multiplayer Online Battle Arena game designed by the experts at Tencent Games for Nintendo Switch. Explore and command a roster of over 35 fearless heroes, with roles including Tanks, Assassins, Mages, Support, Warriors, and Marksmen. Build the ultimate team with yourArena of Valor is a Multiplayer Online Battle Arena game designed by the experts at Tencent Games for Nintendo Switch. Explore and command a roster of over 35 fearless heroes, with roles including Tanks, Assassins, Mages, Support, Warriors, and Marksmen. Build the ultimate team with your friends to crush your opponents in real-time online battles.… Expand"
  },
  {
    "name": "Flipping Death",
    "details_link": "https://www.metacritic.com/game/xbox-one/flipping-death",
    "publisher": "Zoink!",
    "release_date": "Aug  7 2018",
    "developers": [
      "Zoink!"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/5/ab7e8ab18b3702893f8272159951a645-98.jpg",
    "descriptions": "Welcome to Flatwood Peaks, a small whimsical town with a problem -- Death is on vacation. Play as Penny and help trapped ghosts with your trusted scythe. Flip the entire world around to solve puzzles on both the living and the dead side and slowly uncover the mystery surrounding your own demise."
  },
  {
    "name": "Jotun",
    "details_link": "https://www.metacritic.com/game/pc/jotun",
    "publisher": "Thunder Lotus Games",
    "release_date": "Sep 29 2015",
    "developers": [
      "Thunder Lotus Games"
    ],
    "platforms": [
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Wii U",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/2444198628cad48e134f0b3d97026431-98.jpg",
    "descriptions": "Jotun is a hand-drawn action-exploration game set in Norse mythology. In Jotun, you play Thora, a Viking warrior who died an inglorious death and must prove herself to the Gods to enter Valhalla. Impress the Gods."
  },
  {
    "name": "Bloodline Champions",
    "details_link": "https://www.metacritic.com/game/pc/bloodline-champions",
    "publisher": "Funcom",
    "release_date": "Jan 13 2011",
    "developers": [
      "Stunlock Studios"
    ],
    "platforms": "PC",
    "genres": [
      "Action",
      "Strategy",
      "General",
      "Real-Time",
      "MOBA",
      "MOBA"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/7/3698088b19a4c56503682af18286fbb5-98.jpg",
    "descriptions": "Bloodline Champions is a PVP game with short, intense matches for up to ten players divided into two teams. Chance is not a factor, spells and abilities do a set amount of damage. Random elements such as critical hits and passive abilities do not exist. Every spell is aimed and can beBloodline Champions is a PVP game with short, intense matches for up to ten players divided into two teams. Chance is not a factor, spells and abilities do a set amount of damage. Random elements such as critical hits and passive abilities do not exist. Every spell is aimed and can be avoided by enemy players, making every ability dependent on individual player skill. Without mana and creeps, the game has almost zero downtime and is instead based on short cooldowns, this coupled with the absence of elements such as grind and farming ensures that every match is full of action.… Expand"
  },
  {
    "name": "Transformers: Fall of Cybertron",
    "details_link": "https://www.metacritic.com/game/xbox-360/transformers-fall-of-cybertron",
    "publisher": "Activision",
    "release_date": "Aug 21 2012",
    "developers": [
      "High Moon Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "General",
      "Action",
      "General",
      "Shooter",
      "Third-Person",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/8/1fe98bbd9afc43b5207a6954e7706b7c-98.jpg",
    "descriptions": "After experiencing the game’s story campaign, players can take their skills online in competitive multiplayer.  Fall of Cybertron promises the most in-depth, advanced customization ever seen in the franchise, allowing fans to choose their head, shoulders, arms, legs, wheels, wings, vehicles,After experiencing the game’s story campaign, players can take their skills online in competitive multiplayer.  Fall of Cybertron promises the most in-depth, advanced customization ever seen in the franchise, allowing fans to choose their head, shoulders, arms, legs, wheels, wings, vehicles, weapons, colors and much more to create the TRANSFORMERS character they’ve always dreamt of.  Players can then take their personalized characters straight into blistering AUTOBOT vs. DECEPTICON multiplayer matches in a variety of game modes to prove their dominance.  Additionally, fans can assume the role of their favorite named TRANSFORMERS characters in the four-player co-op Escalation mode.  Teamwork is vital as they defeat increasing waves of enemies and band their resources together to purchase weapons and explore new areas.… Expand"
  },
  {
    "name": "Mortal Kombat: Deadly Alliance",
    "details_link": "https://www.metacritic.com/game/playstation-2/mortal-kombat-deadly-alliance",
    "publisher": "Midway",
    "release_date": "Nov 16 2002",
    "developers": [
      "Midway"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/2/d704bda5578ed09a643ff69e8b13687c-98.jpg",
    "descriptions": "Deadly Alliance features a completely new fighting system. Each warrior has three unique fighting styles including hand-to-hand and deadly-weapon combat adding a whole new strategy to Mortal Kombat fighting. Full 3D movement with extremely realistic fighting effects are included, with rippedDeadly Alliance features a completely new fighting system. Each warrior has three unique fighting styles including hand-to-hand and deadly-weapon combat adding a whole new strategy to Mortal Kombat fighting. Full 3D movement with extremely realistic fighting effects are included, with ripped clothing, bruises, sweat-dripping and blood. Brutal Fatalities are back with gruesome and bloody detail first time seen on next-generation systems. Character-specific \"special attacks\" such as Scorpion's deadly spear move are also here. Over 20 new and old favorite characters . Returning: Johnny Cage, Kung Lao, Raiden, Sonya, Scorpion and more. New: Female Sub-Zero, Moloch, Mavado and more. [Midway]… Expand"
  },
  {
    "name": "Pokken Tournament DX",
    "details_link": "https://www.metacritic.com/game/switch/pokken-tournament-dx",
    "publisher": "Nintendo",
    "release_date": "Sep 22 2017",
    "developers": [
      "Bandai Namco Games"
    ],
    "platforms": "Switch",
    "num_players": "2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/4/32e8445ec9c2add43e9c4a50df58c80c-98.jpg",
    "descriptions": "The popular Pokemon fighting game comes to Nintendo Switch with added Pokemon fighters and new ways to battle other players. Take direct control of one of over 20 prized Pokemon fighters to defeat other Pokemon in action-packed arena fights. With Nintendo Switch, you can battle at home or onThe popular Pokemon fighting game comes to Nintendo Switch with added Pokemon fighters and new ways to battle other players. Take direct control of one of over 20 prized Pokemon fighters to defeat other Pokemon in action-packed arena fights. With Nintendo Switch, you can battle at home or on the go to become the Ferrum League champion. Master the new fighting styles of Croagunk, Scizor, Empoleon, Darkrai, and the newly added Decidueye. New modes give you the ability to challenge your friends in intense competition. Duke it out with your favorite Pokemon Fighters in Team Battle. Then record and upload your favorite fights with the new replay feature. Take the battle on the road with the portable Nintendo Switch system or find competition online in the new Group Match Mode. Do you have what it takes to claim the title of Pokken Tournament DX champion? There's only one way to find out, and that's by stepping into the battle arena.\r *    Fight as Decidueye, Darkrai , Scizor, Empoleon, Croagunk, and more\r*    Stunning Pokemon battles come to life like never before\r*    Execute powerful Pokemon moves with simple button combinations\r*    Enjoy an intuitive fighting system for all skill levels… Expand"
  },
  {
    "name": "Subsurface Circular",
    "details_link": "https://www.metacritic.com/game/switch/subsurface-circular",
    "publisher": "Mike Bithell",
    "release_date": "Mar  1 2018",
    "developers": [
      "Mike Bithell"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "Visual Novel"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/8/b8640abc2d55b6c253fe9fb780f0f24f-98.jpg",
    "descriptions": "A detective stationed on the Subsurface Circular investigates a series of disappearances among the city’s robotic working class. Collect words and phrases, then use them in dialogue puzzles to uncover the world's secrets and determine its future. Inspired by classic adventure games and A detective stationed on the Subsurface Circular investigates a series of disappearances among the city’s robotic working class. Collect words and phrases, then use them in dialogue puzzles to uncover the world's secrets and determine its future. Inspired by classic adventure games and modern dialogue systems, Bithell Games has created a single session story which respects your time and your intelligence. [Nintendo]… Expand"
  },
  {
    "name": "Wipeout 2048",
    "details_link": "https://www.metacritic.com/game/playstation-vita/wipeout-2048",
    "publisher": "SCEA",
    "release_date": "Feb 15 2012",
    "developers": [
      "Studio Liverpool"
    ],
    "platforms": "PlayStation Vita",
    "num_players": "Up to 8 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Futuristic",
      "Futuristic"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/a57fcf1dd3c573a8a2e34bd3a98d9d1b-98.jpg",
    "descriptions": "Experience the speed of anti-gravity racing with PlayStation Vita's enhanced controls - including front touch, rear touch, and six-axis motion sensors. Optimized for 23rd century racing, you can compete with up to 8 other players on 10 new tracks. It’s a visceral battle to stay atop theExperience the speed of anti-gravity racing with PlayStation Vita's enhanced controls - including front touch, rear touch, and six-axis motion sensors. Optimized for 23rd century racing, you can compete with up to 8 other players on 10 new tracks. It’s a visceral battle to stay atop the online leaderboards. [Sony]… Expand"
  },
  {
    "name": "Carto",
    "details_link": "https://www.metacritic.com/game/switch/carto",
    "publisher": "Humble Bundle",
    "release_date": "Oct 27 2020",
    "developers": [
      "Sunhead Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/0/b4dda0ac3920c6cb9203a4cf28e4cb24-98.jpg",
    "descriptions": "Carto is a chill adventure game wrapped around a unique, world-shifting puzzle mechanic. Use this power to explore mysterious lands, help a quirky cast of new friends, and guide Carto on her journey home."
  },
  {
    "name": "Project Warlock",
    "details_link": "https://www.metacritic.com/game/xbox-one/project-warlock",
    "publisher": "Crunching Koalas",
    "release_date": "Jun 12 2020",
    "developers": [
      "Crunching Koalas"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/3/7f1d38b79ec6af5ca9180105b1413511-98.jpg",
    "descriptions": "One man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hoursOne man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hours of super fun carnage. Let’s rock and roll! Explore 60 vast levels in five settings, from frozen Antarctic base to the sands of Egypt to the medieval castles’ courts and graveyards. Find keys to unlock passages, reveal secret caches with ammo and gold, use lifts and hidden buttons to access new areas. Finally descend to hell to face the ultimate challenge and emerge victorious. Combat tons of enemies from flying demons to five-storeys robots, splashing walls and floors with their blood and chunks. Dodge bullets and projectiles, figure out strategies and weapons that work best against each of the nasty villains. Learn their moves and stay one step ahead to survive through the levels. Face megabosses in vast final arenas to complete each world. Expand your arsenal with new weapons found along your way. From powerful blades to massive guns, collect and develop your favourite gear and master the craft of carnage. Reach into vast arsenal of 38 types of weapons and learn their secret tricks to deliver maximum damage, fast! Grab ammo and spit out series of bullets, walls of flames, and bursts of magic shots to bring down enemies foolish enough to stand in your way. Develop your hero the way you like, by assigning upgrade points and perks to the favourite skills between each level. Develop and upgrade spells and weapons to create your unique character through the game, and use their powers to master the game in higher difficulty modes.… Expand"
  },
  {
    "name": "Pirates Outlaws",
    "details_link": "https://www.metacritic.com/game/pc/pirates-outlaws",
    "publisher": "Fabled Game",
    "release_date": "Apr 13 2020",
    "developers": [
      "Fabled Game"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Card Battle"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/511c9cef19a06cac7a853e802eee6a23-98.jpg",
    "descriptions": "Pirates Outlaws is an easy-to-play roguelike card game. Build your deck and combos to become a reputed pirate."
  },
  {
    "name": "Crystal Crisis",
    "details_link": "https://www.metacritic.com/game/switch/crystal-crisis",
    "publisher": "Nicalis",
    "release_date": "May 28 2019",
    "developers": [
      "Nicalis"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Stacking"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/9/55a27dbf3b764615b4d8a8a8d3e481b4-98.jpg",
    "descriptions": "An all-star cast of heroes has gathered to test their mettle in Crystal Crisis, a cute and chaotic new color-matching combat game for Nintendo Switch. Crystal Crisis is presented like a one-on-one fighting game, but instead of pressing buttons to kick and punch, players arrange falling gems An all-star cast of heroes has gathered to test their mettle in Crystal Crisis, a cute and chaotic new color-matching combat game for Nintendo Switch. Crystal Crisis is presented like a one-on-one fighting game, but instead of pressing buttons to kick and punch, players arrange falling gems into matching colors to clear them from the screen and inflict damage on their opponents. It’s the ultimate puzzle battle throw down.… Expand"
  },
  {
    "name": "The Council - Episode 1: The Mad Ones",
    "details_link": "https://www.metacritic.com/game/xbox-one/the-council---episode-1-the-mad-ones",
    "publisher": "Focus Home Interactive",
    "release_date": "Mar 13 2018",
    "developers": [
      "Big Bad Wolf"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/2/9f8628d1919c11ed0aad4608f003fd8a-98.jpg",
    "descriptions": "The Council is a unique episodic game. Delivering a fresh take on the narrative adventure, your choices and character growth truly matter."
  },
  {
    "name": "Skylanders Swap Force",
    "details_link": "https://www.metacritic.com/game/playstation-4/skylanders-swap-force",
    "publisher": "Activision",
    "release_date": "Nov 15 2013",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "3DS",
      "PlayStation 3",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "3D",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/2/3249ca87f9a26e2aa117cc535b8a36ff-98.jpg",
    "descriptions": "Embark on an exciting new adventure with the Skylanders and the SWAP Force. For generations, the SWAP Force protected the volcano that replenishes Skylands magic. That is until an epic battle caught them in an eruption that blasted them apart, sent them to Earth and gave them the ability toEmbark on an exciting new adventure with the Skylanders and the SWAP Force. For generations, the SWAP Force protected the volcano that replenishes Skylands magic. That is until an epic battle caught them in an eruption that blasted them apart, sent them to Earth and gave them the ability to swap powers. Only you can mix and match their tops and bottoms, put them on the new Portal of Power and save Skylands.… Expand"
  },
  {
    "name": "The Legend of Heroes: Trails in the Sky",
    "details_link": "https://www.metacritic.com/game/psp/the-legend-of-heroes-trails-in-the-sky",
    "publisher": "XSEED Games",
    "release_date": "Mar 28 2011",
    "developers": [
      "Falcom"
    ],
    "platforms": [
      "PC",
      "PSP"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/7/cb09470c07d0cf9f38668e360d5ee1f0-98.jpg",
    "descriptions": "The Legend of Heroes: Trails in the Sky is the first of a new trilogy in the established The Legend of Heroes RPG series"
  },
  {
    "name": "Legends of War: Patton's Campaign",
    "details_link": "https://www.metacritic.com/game/psp/legends-of-war-pattons-campaign",
    "publisher": "Enigma Software Productions",
    "release_date": "Jan  3 2011",
    "developers": [
      "Enigma Software Productions"
    ],
    "platforms": "PSP",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "General",
      "General"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/2b35247114195bdceac4760497bfeaf6-98.jpg",
    "descriptions": "Relive the thrilling battles that raged across the European landscape. Assume the role of General Patton, commanding the Third U.S. Army from the beaches of Normandy, to the capital of the Third Reich, Berlin."
  },
  {
    "name": "NHL Hitz Pro",
    "details_link": "https://www.metacritic.com/game/playstation-2/nhl-hitz-pro",
    "publisher": "Midway",
    "release_date": "Sep 25 2003",
    "developers": [
      "Next Level Games"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/6/8a5f17530db7c7078199b67cbeeed93f-98.jpg",
    "descriptions": "Think you know NHL Hitz? Think again. NHL Hitz Pro unleashes an exclusive, proprietary blend of NHL Authenticity and adrenaline-style gameplay with real 5-on-5 NHL hockey featuring; big hits, rocket goals and ferocious ONLINE gameplay. NHL Hitz has been reinvented, without leaving behind theThink you know NHL Hitz? Think again. NHL Hitz Pro unleashes an exclusive, proprietary blend of NHL Authenticity and adrenaline-style gameplay with real 5-on-5 NHL hockey featuring; big hits, rocket goals and ferocious ONLINE gameplay. NHL Hitz has been reinvented, without leaving behind the edginess that has made Midway Sports the leader and only year-on-year successful publisher of extreme-style league licensed sports videogames. NHL Hitz Pro will showcase authentic 5-on-5 gameplay with realistic rules, features and online play, while still providing its proprietary blend of lightning-fast adrenaline-style hockey action. [Midway]… Expand"
  },
  {
    "name": "Chessmaster",
    "details_link": "https://www.metacritic.com/game/playstation-2/chessmaster",
    "publisher": "Ubisoft",
    "release_date": "May 28 2003",
    "developers": [
      "Ubisoft Romania"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Board Games"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/7/bb080bf09d3d13f55373399576b089bd-98.jpg",
    "descriptions": "Test your chess skills against live opponents online or improve your game immediately at chess school. The game includes a variety of chess modes, such as Quick Game, Rated Play, Handicap, Set-up Position, and Puzzle. Along with the most powerful chess engine available on the console,Test your chess skills against live opponents online or improve your game immediately at chess school. The game includes a variety of chess modes, such as Quick Game, Rated Play, Handicap, Set-up Position, and Puzzle. Along with the most powerful chess engine available on the console, Chessmaster also includes features just for fun. Josh Waitzkin gives advice and easy-to-understand instructions for improving your game. [Ubi Soft]… Expand"
  },
  {
    "name": "The Sims: Superstar",
    "details_link": "https://www.metacritic.com/game/pc/the-sims-superstar",
    "publisher": "EA Games",
    "release_date": "May 12 2003",
    "developers": [
      "Maxis"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/5/131cdb4d3a270f515f4ecacf1950731f-98.jpg",
    "descriptions": "Brace Yourself. Your Sims are Famous! Experience the lifestyles of the rich and famous in The Sims Superstar Expansion Pack. Make a name for yourself as a movie star, rock star, or fashion model, and then spend your hard-earned cash on a selection of extravagant new items for your home. YouBrace Yourself. Your Sims are Famous! Experience the lifestyles of the rich and famous in The Sims Superstar Expansion Pack. Make a name for yourself as a movie star, rock star, or fashion model, and then spend your hard-earned cash on a selection of extravagant new items for your home. You can cruise around the all-new Studio Town or kick back and relax with a lavish spa treatment. Will your Sims skyrocket to fame or fade into obscurity? [Electronic Arts]… Expand"
  },
  {
    "name": "Bust-A-Move 4",
    "details_link": "https://www.metacritic.com/game/dreamcast/bust-a-move-4",
    "publisher": "Acclaim",
    "release_date": "May 31 2000",
    "developers": [
      "Taito Corporation"
    ],
    "platforms": [
      "PC",
      "Dreamcast"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Matching"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/637e1aca1a5df0cc0167b4179b2ece15-98.jpg",
    "descriptions": "With intense multiplayer competition, all new graphics, and create a level mode, you've never busted bubbles like these! And with 16 mysterious characters to save, you'll be bustin' like crazy!"
  },
  {
    "name": "Minit",
    "details_link": "https://www.metacritic.com/game/pc/minit",
    "publisher": "Devolver Digital",
    "release_date": "Apr  3 2018",
    "developers": [
      "Devolver Digital"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/1/d93b58ea2671a78a79ec4653ab2eec02-98.jpg",
    "descriptions": "Minit is a peculiar little adventure played sixty seconds at a time. Journey outside the comfort of your home to help unusual folk, uncover countless secrets, and overcome dangerous foes, all in hopes of lifting a rather unfortunate curse that ends each day after just one minute. Minit is aMinit is a peculiar little adventure played sixty seconds at a time. Journey outside the comfort of your home to help unusual folk, uncover countless secrets, and overcome dangerous foes, all in hopes of lifting a rather unfortunate curse that ends each day after just one minute. Minit is a collaboration between Kitty Calis, Jan Willem Nijman, Jukio Kallio & Dominik Johann.… Expand"
  },
  {
    "name": "Cuboid",
    "details_link": "https://www.metacritic.com/game/playstation-3/cuboid",
    "publisher": "Creat Studios",
    "release_date": "Jan  8 2009",
    "developers": [
      "Creat Studios"
    ],
    "platforms": "PlayStation 3",
    "num_players": "1 Player",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/4/4b5c106806fcbfcdfafa22ef11e9500c-98.jpg",
    "descriptions": "[Playstation Network]  A 3D puzzle game in which players navigate ancient ruins and lush environments, maneuvering a rectangular block through mystical exits. Cuboid’s 66 twisted levels will bend your mind with their addictive puzzles, and engage the senses with amazing graphics and soothing[Playstation Network]  A 3D puzzle game in which players navigate ancient ruins and lush environments, maneuvering a rectangular block through mystical exits. Cuboid’s 66 twisted levels will bend your mind with their addictive puzzles, and engage the senses with amazing graphics and soothing music, immersing you in a surrealistic puzzle world. [SCEA]… Expand"
  },
  {
    "name": "NBA Live 2005",
    "details_link": "https://www.metacritic.com/game/pc/nba-live-2005",
    "publisher": "EA Sports",
    "release_date": "Oct 26 2004",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Sim",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/e6db3922b965cb3da3fcb6ccde54cf23-98.jpg",
    "descriptions": "The EA Sports Freestyle Control continues to revolutionize your ability to play simulation basketball?and, now more than ever, it's about expressing your game in flight with Freestyle Air. In addition to all-new dunks, alley-oops, and adjustable jump shots in mid-air, new user-controlledThe EA Sports Freestyle Control continues to revolutionize your ability to play simulation basketball?and, now more than ever, it's about expressing your game in flight with Freestyle Air. In addition to all-new dunks, alley-oops, and adjustable jump shots in mid-air, new user-controlled put-back and tip-in technologies reward players who box out, wipe the glass, and go back up for a quick bucket. On defense, take more control over shot blocking to own the paint. Freestyle Air elevates NBA Live 2005 above the rim in the all-new NBA All-Star Weekend mode by allowing users to take complete control and create jaw-dropping, customized dunks in the Slam Dunk Contest. With thousands of unique dunk scenarios?from bouncing the ball off the backboard, to jumping from the free throw line, to going between your legs in mid flight?Freestyle Air lets you express your game on the court, and above it. Also featuring the 3-Point Shootout, the Rookie Challenge, and the NBA All-Star Game, All-Star Weekend is available as a stand-alone game mode as well as within Dynasty Mode. Be the architect of your own unstoppable dynasty, and watch your franchise flourish for 25 seasons. Jump into games with simulation intervention and use the customizable PDA to stay updated with important league news, team information, and other announcements. New free agency logic allows users to negotiate contracts and manage the salary cap using real dollars for the first time. [Electronic Arts]… Expand"
  },
  {
    "name": "Orcs Must Die!",
    "details_link": "https://www.metacritic.com/game/xbox-360/orcs-must-die!",
    "publisher": "Robot Entertainment",
    "release_date": "Oct  5 2011",
    "developers": [
      "Robot Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Strategy",
      "General",
      "Real-Time",
      "General",
      "Defense"
    ],
    "meta_score": 79,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/05ace6fce74a5fd227d98e1a82755720-98.jpg",
    "descriptions": "With a wide variety of traps and weapons to choose from, Orcs Must Die! dares players to find the best ways to hack, launch, flatten, gibletize, and incinerate an endless army of filthy orcs and their vile allies. Orcs Must Die! features a vibrant look, addictive gameplay, and a blatantWith a wide variety of traps and weapons to choose from, Orcs Must Die! dares players to find the best ways to hack, launch, flatten, gibletize, and incinerate an endless army of filthy orcs and their vile allies. Orcs Must Die! features a vibrant look, addictive gameplay, and a blatant disregard for the welfare of orcs.… Expand"
  },
  {
    "name": "You, Me, and the Cubes",
    "details_link": "https://www.metacritic.com/game/wii/you-me-and-the-cubes",
    "publisher": "Nintendo",
    "release_date": "Sep 21 2009",
    "developers": [
      "fyto"
    ],
    "platforms": "Wii",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "Puzzle",
      "Action"
    ],
    "meta_score": 79,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/9fc207edbe19bc742d4666e65a447248-98.jpg",
    "descriptions": "[WiiWare]  Experience a unique combination of strategy and skill as you maintain a level playing field in the physics-based action puzzler You, Me, and the Cubes. The action centers around Fallos, mysterious creatures that resemble humans and have an ability to balance on a playing field of[WiiWare]  Experience a unique combination of strategy and skill as you maintain a level playing field in the physics-based action puzzler You, Me, and the Cubes. The action centers around Fallos, mysterious creatures that resemble humans and have an ability to balance on a playing field of 3-D cubes. First, create a pair of Fallos inside your Wii Remote™ controller by shaking it up and down. Next, determine suitable places for the Fallos to land, then fling them to the selected cube with a swinging motion. After that, the Fallos are on their own. If your placement is sound, the Fallos will remain stable and you'll clear the stage after tossing a required number onto the cubes. But if the weight or locations of Fallos causes the cubes to tilt and sway too much, the Fallos will lose their balance and fall off. Adding to the challenge, you'll find that some cubes have different properties, making tosses tricky and further threatening the stability of the Fallos. Guide Fallos through dozens of single-player stages or invite family and friends to join you in two-player cooperative mode. [Nintendo]… Expand"
  },
  {
    "name": "SSX On Tour",
    "details_link": "https://www.metacritic.com/game/psp/ssx-on-tour",
    "publisher": "EA Sports Big",
    "release_date": "Oct 11 2005",
    "developers": [
      "EA Montreal"
    ],
    "platforms": "PSP",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Sports",
      "Alternative",
      "Individual",
      "Snowboarding",
      "Snowboarding",
      "Ski / Snowboard"
    ],
    "meta_score": 79,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/1b0ac61a0c3b16c463292045272624d0-98.jpg",
    "descriptions": "SSX On Tour is a completely fresh take on the SSX franchise. Building on the core speed and trick gameplay that has been so successful in the past, players can now choose their way to become black diamond fiends. SSX On Tour allows players to create their own boarder or skier and take themSSX On Tour is a completely fresh take on the SSX franchise. Building on the core speed and trick gameplay that has been so successful in the past, players can now choose their way to become black diamond fiends. SSX On Tour allows players to create their own boarder or skier and take them from a wannabe to a mountain rockstar. Players can get noticed in all-new shred challenges where they earn an invitation to The Tour where they'll face the best racers in the SSX cast. Fly down the all-new tracks, and master the new monster tricks for both boarding and skiing to make it to the top of The Charts. [Electronic Arts]… Expand"
  },
  {
    "name": "Call of Duty: Warzone 2.0",
    "details_link": "https://www.metacritic.com/game/playstation-5/call-of-duty-warzone-20",
    "publisher": "Activision",
    "release_date": "Nov 14 2022",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "Up to more than 64 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 79,
    "users_score": 3.1,
    "image": "https://static.metacritic.com/images/products/games/1/bc0b6a47a5801a8600a2c1f37b3d356a-98.jpg",
    "descriptions": "As shown at Call of Duty: Next, Call of Duty: Warzone 2.0, the sequel to the seminal Battle Royale experience over 125 million players dropped in to play, is set to arrive this November 16, as part of Modern Warfare II's Season One.\r This massive, free-to-play offering leverages newAs shown at Call of Duty: Next, Call of Duty: Warzone 2.0, the sequel to the seminal Battle Royale experience over 125 million players dropped in to play, is set to arrive this November 16, as part of Modern Warfare II's Season One.\r This massive, free-to-play offering leverages new technology shared with Modern Warfare II, introduces a host of new innovations, and continues the new era of Call of Duty coming this Fall, starting with Modern Warfare II's launch on October 28.… Expand"
  },
  {
    "name": "Oxenfree",
    "details_link": "https://www.metacritic.com/game/playstation-4/oxenfree",
    "publisher": "Night School Studio",
    "release_date": "May 31 2016",
    "developers": [
      "Night School Studio"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "Adventure",
      "General"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/6/8fd4efb7e76aa56ec3160f85e75ee0b1-98.jpg",
    "descriptions": "Oxenfree is a supernatural thriller about a group of friends who unwittingly open a ghostly rift. You assume the role of Alex, and you’ve just brought your new stepbrother Jonas to an overnight island party gone horribly wrong."
  },
  {
    "name": "Dark Souls II: Scholar of the First Sin",
    "details_link": "https://www.metacritic.com/game/pc/dark-souls-ii-scholar-of-the-first-sin",
    "publisher": "Bandai Namco Games",
    "release_date": "Apr  1 2015",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 79,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/95fe3865a84fc73b1d5eef30250bac8a-98.jpg",
    "descriptions": "Dark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II ownersDark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II owners will receive a patch to implement these elements): Additional NPCs added for an enhanced story experience. Parameter adjustments for improved game balance. Augmented item descriptions. Improved online matchmaking functionality. [Bandai Namco]… Expand"
  },
  {
    "name": "MLB 10: The Show",
    "details_link": "https://www.metacritic.com/game/psp/mlb-10-the-show",
    "publisher": "SCEA",
    "release_date": "Mar  1 2010",
    "developers": [
      "SCEA"
    ],
    "platforms": [
      "PlayStation 3",
      "PSP"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Baseball",
      "Sim",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/5/65091ec49dd6dfb4427c69b4e250eb55-98.jpg",
    "descriptions": "New Personalized batting stances. Play against friends on the go in Ad-Hoc mode. Find your way to the top in Road to the Show. Updated rosters and new stadiums. [SCEA]"
  },
  {
    "name": "Street Fighter Alpha Anthology",
    "details_link": "https://www.metacritic.com/game/playstation-2/street-fighter-alpha-anthology",
    "publisher": "Capcom",
    "release_date": "Jun 13 2006",
    "developers": [
      "Capcom"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 79,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/0/bcf2f1950c4fc63b8a9d1d1db295acb0-98.jpg",
    "descriptions": "The collection features direct arcade conversions of Street Fighter Alpha, Street Fighter Alpha 2, Street Fighter Alpha2 Gold and Street Fighter Alpha 3 which have never before been available together in one package. As an added bonus, the \"pint-sized\" Super Gem Fighter Mini Mix (alsoThe collection features direct arcade conversions of Street Fighter Alpha, Street Fighter Alpha 2, Street Fighter Alpha2 Gold and Street Fighter Alpha 3 which have never before been available together in one package. As an added bonus, the \"pint-sized\" Super Gem Fighter Mini Mix (also released on consoles as Pocket Fighter), is included which brings the total to five action packed games on one disc. All titles in the collection feature three core gameplay options. Arcade mode pits competitors against a series of CPU controlled opponents in order to beat the game. Versus mode allows two players to choose among the cast of characters for intense head-to-head battles. Fighters can practice special moves and combos to hone their skills in the training mode. Additionally, all four Alpha titles feature survival mode as well as a dramatic battle mode which allows 2-on-1 tag team matches. Street Fighter Alpha brings together a cast of 13 characters from the collective Street Fighter universe. The series’ inaugural title introduces super combos and alpha counters to add a new dimension to fighting. Street Fighter Alpha 2 ups the ante with 18 fighters and several new options including high and low Alpha counters as well as more moves and combos for each character. In addition, the second title launches the Custom Combo system which lets players use up a super meter to perform devastating multi-hit combos. [Capcom]… Expand"
  },
  {
    "name": "Prey",
    "details_link": "https://www.metacritic.com/game/playstation-4/prey",
    "publisher": "Bethesda Softworks",
    "release_date": "May  5 2017",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "General",
      "Action",
      "Role-Playing",
      "Shooter",
      "Action RPG",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/7/8b7b8e773375ec6c4fb6c5c52182c6eb-98.jpg",
    "descriptions": "You awaken aboard Talos I, a space station orbiting the moon in the year 2032. You are the key subject in an experiment meant to change humanity forever – but things have gone terribly wrong. The space station has been overrun by hostile aliens and you are now being hunted. As you delve intoYou awaken aboard Talos I, a space station orbiting the moon in the year 2032. You are the key subject in an experiment meant to change humanity forever – but things have gone terribly wrong. The space station has been overrun by hostile aliens and you are now being hunted. As you delve into the dark secrets of Talos I and your own past, you have to survive using the tools found on the station, your wits, weapons, and mind-bending abilities. [Bethesda Softworks]… Expand"
  },
  {
    "name": "NBA Live 06",
    "details_link": "https://www.metacritic.com/game/xbox/nba-live-06",
    "publisher": "EA Sports",
    "release_date": "Sep 26 2005",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "8  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 79,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/0/f790a5408d550b470d1702f1ca492c47-98.jpg",
    "descriptions": "NBA Live 06 continues the NBA live franchise and boasts a set of new features. Improved transition play captures the speed and feel of a NBA fast break, and increased attention to interior defense delivers the physicality of an NBA game. NBA Live 06 allows you to play as players in the NBANBA Live 06 continues the NBA live franchise and boasts a set of new features. Improved transition play captures the speed and feel of a NBA fast break, and increased attention to interior defense delivers the physicality of an NBA game. NBA Live 06 allows you to play as players in the NBA who can exhibit superstar styles like 'Playmaker' or 'Stopper'. These stars have their own controls and visual modes allowing them to dominate lesser players. NBA Live 06 for the PS2 also sports a new graphics engine, and includes a full copy of NBA Live 95.… Expand"
  },
  {
    "name": "Call of Duty: Modern Warfare II",
    "details_link": "https://www.metacritic.com/game/pc/call-of-duty-modern-warfare-ii",
    "publisher": "Activision",
    "release_date": "Oct 28 2022",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Up to 64 ",
    "genres": [
      "Arcade",
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 79,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/6/daf8056d34faf7ebc9a11cd22957765f-98.jpg",
    "descriptions": "A global squad of iconic veterans and new legends of yet untold clandestine missions, these Operators are set to deliver a new era of Call of Duty when Modern Warfare II releases on October 28, 2022.\r Initial asset intel brings revelations about key members of Task Force 141, includingA global squad of iconic veterans and new legends of yet untold clandestine missions, these Operators are set to deliver a new era of Call of Duty when Modern Warfare II releases on October 28, 2022.\r Initial asset intel brings revelations about key members of Task Force 141, including Team leader Captain John Price, Sergeant Kyle \"Gaz\" Garrick, Sergeant \"Soap\" MacTavish, lone-wolf Simon \"Ghost\" Riley, and Colonel Alejandro Vargas of the Mexican Special Forces.… Expand"
  },
  {
    "name": "When The Past Was Around",
    "details_link": "https://www.metacritic.com/game/switch/when-the-past-was-around",
    "publisher": "Chorus Worldwide",
    "release_date": "Dec 15 2020",
    "developers": [
      "Mojiken Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 79,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/2/27c9528da2e8166d162c768c512e1c06-98.jpg",
    "descriptions": "When the Past was Around is an adventure point-and-click puzzle game about love, moving on, letting go, and the joy and pain of everything in between.\r This is the story of Eda, a girl in her early 20s.\r\nLike anyone in her age, she’s lost.\r\nShe lost her way in the journey to achieve herWhen the Past was Around is an adventure point-and-click puzzle game about love, moving on, letting go, and the joy and pain of everything in between.\r This is the story of Eda, a girl in her early 20s.\rLike anyone in her age, she’s lost.\rShe lost her way in the journey to achieve her dreams.\rShe lost her way in the journey to find love.\r That until she met The Owl.\r The man that would help her burn her passion,\rthe man that would help her find the spark in a relationship,\rand also the man that would teach her about heartbreak.\r The game tells a bittersweet tale between a girl and her lover in a surreal world consisting of disjointed rooms from memories and time. With each gathered clue, solved puzzles, and unlocked door, the girl will find her way, unraveling the secrets between her and her lover, the secrets which she used to know.… Expand"
  },
  {
    "name": "Runbow",
    "details_link": "https://www.metacritic.com/game/switch/runbow",
    "publisher": "Headup Games",
    "release_date": "Jul  3 2018",
    "developers": [
      "13AM Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 4",
      "Wii U",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 9 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/5ecd00d89fb3058e2fc4b8ae2a1c2779-98.jpg",
    "descriptions": "Runbow Pocket takes all the fun colorful chaos of Runbow on Wii U and brings it to New Nintendo 3DS. Master Adventure, Bowhemoth, and Satura's Space Adventure on your own, or play head to head with friends over local ad hoc networking. Players can also create StreetPass cards to share funRunbow Pocket takes all the fun colorful chaos of Runbow on Wii U and brings it to New Nintendo 3DS. Master Adventure, Bowhemoth, and Satura's Space Adventure on your own, or play head to head with friends over local ad hoc networking. Players can also create StreetPass cards to share fun stats with friends.\r Key Gameplay Features:\r -The world changes with each swipe of color so players have to think fast to beat hundreds of platforming challenges.\r-Tons of unlockable costumes and content, as well as 19 guest characters from other developers.\r-Brand new Guest Character, Shantae, from WayForward's Shantae series. Shantae will also be available in the Wii U version of Runbow.\r-All the content of Runbow, hundreds of levels, right in the palm of your hand.\r-Create a StreetPass card to share stats, titles, and your personal best times with anyone else playing Runbow Pocket.… Expand"
  },
  {
    "name": "Valiant Hearts: The Great War",
    "details_link": "https://www.metacritic.com/game/pc/valiant-hearts-the-great-war",
    "publisher": "Ubisoft",
    "release_date": "Jun 25 2014",
    "developers": [
      "Ubisoft Montpellier"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Platformer",
      "2D",
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 79,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/f8e9471f3cf13626b23125b63bc045ef-98.jpg",
    "descriptions": "The story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course ofThe story of crossed destinies and a broken love in a world torn apart. All of them will try to survive the horror of the trenches following their faithful canine companion. In Valiant Hearts: The Great War, the lives of all these characters are inextricably drawn together over the course of the game. Friendship, love, sacrifice, and tragedy befall each one as they help each other to retain their humanity against the horrors of war. … Expand"
  },
  {
    "name": "Payday 2",
    "details_link": "https://www.metacritic.com/game/pc/payday-2",
    "publisher": "505 Games",
    "release_date": "Aug 13 2013",
    "developers": [
      "Overkill Software"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Fantasy",
      "General",
      "Fantasy",
      "Arcade"
    ],
    "meta_score": 79,
    "users_score": 3.9,
    "image": "https://static.metacritic.com/images/products/games/0/62c232c36d01024b999eaddc5186dcec-98.jpg",
    "descriptions": "PAYDAY 2 is a four-player co-op shooter that has you sporting the masks of the original PAYDAY gang – Dallas, Hoxton, Wolf and Chains – as they hit on Washington D.C. for an epic crime rampage. The new CRIMENET network offers a vast array of dynamic contracts - choose anything fromPAYDAY 2 is a four-player co-op shooter that has you sporting the masks of the original PAYDAY gang – Dallas, Hoxton, Wolf and Chains – as they hit on Washington D.C. for an epic crime rampage. The new CRIMENET network offers a vast array of dynamic contracts - choose anything from small-time store rips, cyber-crime or major bank vaults for that lucrative PAYDAY. … Expand"
  },
  {
    "name": "Virtua Tennis 3",
    "details_link": "https://www.metacritic.com/game/psp/virtua-tennis-3",
    "publisher": "Sega",
    "release_date": "Mar 26 2007",
    "developers": [
      "Sumo Digital"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PSP"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Tennis",
      "Tennis"
    ],
    "meta_score": 79,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/d26b66044e06d44f24d6f52d17594cb5-98.jpg",
    "descriptions": "With ultra-realistic graphics and precise player control, gamers will hit the court and play as or against today's tennis elite including Federer, Sharapova, Roddick, Nadal, and Williams. A new multiplayer mode allows up to 8 friends to battle it out on 23 courts around the world. As theyWith ultra-realistic graphics and precise player control, gamers will hit the court and play as or against today's tennis elite including Federer, Sharapova, Roddick, Nadal, and Williams. A new multiplayer mode allows up to 8 friends to battle it out on 23 courts around the world. As they serve up their best in a mix of exhibitions, tournaments and competitions, players will rise through the ranks and battle for the top spot. [Sega]… Expand"
  },
  {
    "name": "Spider-Man: The Movie",
    "details_link": "https://www.metacritic.com/game/xbox/spider-man-the-movie",
    "publisher": "Activision",
    "release_date": "Apr 15 2002",
    "developers": [
      "Treyarch"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Beat-'Em-Up"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/8/b2c28600db9cfa85e198137e185426c6-98.jpg",
    "descriptions": "Spider bites can sometimes turn you into a superhero, as in the case of Peter Parker in Spider-Man: The Movie.  Assume the role of Peter, a good-hearted teenager bitten by a genetically engineered spider, which gives him muscles, incredible strength, and spider-like abilities.  You'll haveSpider bites can sometimes turn you into a superhero, as in the case of Peter Parker in Spider-Man: The Movie.  Assume the role of Peter, a good-hearted teenager bitten by a genetically engineered spider, which gives him muscles, incredible strength, and spider-like abilities.  You'll have to learn how to control your powers including Spider Sense, web-slinging, and wall crawling, and the all-new aerial combat moves.  The world's toughest villains, including Shocker, Vulture, and the Green Goblin will all be after you.  Are you up for the challenge?… Expand"
  },
  {
    "name": "Dead Rising 2: Case Zero",
    "details_link": "https://www.metacritic.com/game/xbox-360/dead-rising-2-case-zero",
    "publisher": "Capcom",
    "release_date": "Aug 31 2010",
    "developers": [
      "Blue Castle Games"
    ],
    "platforms": "Xbox 360",
    "genres": [
      "Action Adventure",
      "Horror",
      "Survival"
    ],
    "meta_score": 79,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/efceebe8141b983135e49a7203ffcebd-98.jpg",
    "descriptions": "Dead Rising 2: Case Zero, will introduce main protagonist and former motocross champion Chuck Greene and provide a link between the original game and the events that await players in the gambling paradise of Fortune City."
  },
  {
    "name": "Until Dawn",
    "details_link": "https://www.metacritic.com/game/playstation-4/until-dawn",
    "publisher": "SCEA",
    "release_date": "Aug 25 2015",
    "developers": [
      "Supermassive Games"
    ],
    "platforms": "PlayStation 4",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Survival",
      "Adventure",
      "3D",
      "Third-Person"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/15a3aa7ff1d5bfbcbcbf73af0dc5bfbd-98.jpg",
    "descriptions": "When 8 friends become trapped on a remote mountain getaway gone wrong, things quickly turn sinister and they start to suspect they aren’t alone. Gripped by fear and with tensions in the group running high, you’ll be forced to make snap decisions that could mean life or death for everyoneWhen 8 friends become trapped on a remote mountain getaway gone wrong, things quickly turn sinister and they start to suspect they aren’t alone. Gripped by fear and with tensions in the group running high, you’ll be forced to make snap decisions that could mean life or death for everyone involved. Every choice you make while playing as each of the eight friends – even the seemingly trivial ones – will carve out your own unique story.… Expand"
  },
  {
    "name": "Castlevania: Lament of Innocence",
    "details_link": "https://www.metacritic.com/game/playstation-2/castlevania-lament-of-innocence",
    "publisher": "Konami",
    "release_date": "Oct 21 2003",
    "developers": [
      "KCET"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 79,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/23a1359608f92d855876b25cf7ada5e8-98.jpg",
    "descriptions": "Set in the 11th Century, Castlevania: Lament of Innocence thrusts players ten centuries into the past and casts them in the role of Leon Belmont, the forefather of the legendary Belmont. Leon is a nobleman about to be engaged to his beloved Sara. However, when his young lover disappears oneSet in the 11th Century, Castlevania: Lament of Innocence thrusts players ten centuries into the past and casts them in the role of Leon Belmont, the forefather of the legendary Belmont. Leon is a nobleman about to be engaged to his beloved Sara. However, when his young lover disappears one fateful evening, Leon sets out to rescue her. Armed with only a dagger, it is not until an unexpected ally, an alchemist, offers him a protective whip that Leon is ready to begin his hunt. The rich story of Castlevania: Lament of Innocence follows Leon through the perilous forest and into Dracula's foreboding gothic Castle. Upon entering the castle, players will step into an ethereal world that is guarded by blood thirsty guards and ruled by Dracula's wicked whimsy. Players will face five doors - each one leading into a dark area of the castle - the Cathedral, the Theatre, the Garden, the Alchemist Laboratory and the Dungeon. Trekking through hundreds of rooms, players will battle over 35 different kinds of enemies before facing the final boss. Fighting tooth and nail in each monster battle, Leon must combine his whip and five sub-weapons (Holy Water, Dagger, Cross, Axe and Crystal) to defeat the monsters. Additionally, seven orbs can be combined with 10 action relics in order to create powerful attacks and stunning special effects. Featuring a fixed camera and intuitive controls, Castlevania: Lament of Innocence delivers a groundbreaking action/adventure experience that is designed to satisfy core Castlevania fans as well as players that are new to the series.… Expand"
  },
  {
    "name": "Midnight Club: LA Remix",
    "details_link": "https://www.metacritic.com/game/psp/midnight-club-la-remix",
    "publisher": "Rockstar Games",
    "release_date": "Oct 20 2008",
    "developers": [
      "Rockstar London"
    ],
    "platforms": "PSP",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 79,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/18b3d8eb9faab318c38a8c0109ece2c0-98.jpg",
    "descriptions": "Midnight Club: L.A. Remix has been optimized for portable gameplay with faster races and reduced load times. Customize your ride with body kits, paint styles, rims and vinyls that let you put your inimitable style on display and intimidate the competition. Realistic damage modeling shows theMidnight Club: L.A. Remix has been optimized for portable gameplay with faster races and reduced load times. Customize your ride with body kits, paint styles, rims and vinyls that let you put your inimitable style on display and intimidate the competition. Realistic damage modeling shows the effects of crashes and smashes. Experience L.A. in stunning realism as you race to the tune of an all-star soundtrack featuring pulse-pounding songs. Take control and rule the streets in this portable racing powerhouse.… Expand"
  },
  {
    "name": "Dungeons of Dredmor",
    "details_link": "https://www.metacritic.com/game/pc/dungeons-of-dredmor",
    "publisher": "Gaslamp Games",
    "release_date": "Jul 13 2011",
    "developers": [
      "Gaslamp Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "General",
      "Roguelike"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/2/9cddafc1b08248f4f54b60f26a37d365-98.jpg",
    "descriptions": "Long ago, the Dark Lord Dredmor was bound in the darkest dungeons beneath the earth by great and mighty heroes. Centuries later, the magical bonds that hold him in place are loosening and his power grows ever stronger. The land cries out for a new hero, a powerful warrior or a mystic wizardLong ago, the Dark Lord Dredmor was bound in the darkest dungeons beneath the earth by great and mighty heroes. Centuries later, the magical bonds that hold him in place are loosening and his power grows ever stronger. The land cries out for a new hero, a powerful warrior or a mystic wizard like those spoken of in the prophecies of yore.… Expand"
  },
  {
    "name": "Tekken 6",
    "details_link": "https://www.metacritic.com/game/playstation-3/tekken-6",
    "publisher": "Namco Bandai Games America",
    "release_date": "Oct 27 2009",
    "developers": [
      "Namco Bandai Games"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "3D"
    ],
    "meta_score": 79,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/d51a72cc373be16c02f43e62cd33a8d3-98.jpg",
    "descriptions": "Spanning over a 14 year legacy, Tekken is among the most popular and well-known gaming brands in the world with the entire franchise selling more than 32 million units to date. Displayed in HD detail, a new era begins in the sixth King of the Iron Fist Tournament complete with intenseSpanning over a 14 year legacy, Tekken is among the most popular and well-known gaming brands in the world with the entire franchise selling more than 32 million units to date. Displayed in HD detail, a new era begins in the sixth King of the Iron Fist Tournament complete with intense gameplay modes as well as new features and environments. TEKKEN 6 sees the return of many familiar faces as well as new characters to create the largest line-up the series has ever seen.  With a growing roster of fighters, each equipped with their own deadly techniques, moves and attack combinations, TEKKEN 6 will be the best King of Iron Fist Tournament yet.  Adding to the already rich gaming experience, a deeper character customization feature will only further enhance the incredible fighting intensity as players go mano-y-mano.  Players can also take the battle online for classic match-ups and to compete for world domination. [Namco Bandai Games]… Expand"
  },
  {
    "name": "New Pokemon Snap",
    "details_link": "https://www.metacritic.com/game/switch/new-pokemon-snap",
    "publisher": "Nintendo",
    "release_date": "Apr 30 2021",
    "developers": [
      "Bandai Namco Games",
      "The Pokemon Company"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Rail"
    ],
    "meta_score": 79,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/5/53e541f1e66794c2da68520b025812e1-98.jpg",
    "descriptions": "Photograph Pokémon in their natural habitats as you adventure through unknown islands. Seek out and take in-game pictures of Pokémon in their native environments in the New Pokémon Snap game, only for the Nintendo Switch system! You'll even discover behaviors and expressions you've neverPhotograph Pokémon in their natural habitats as you adventure through unknown islands. Seek out and take in-game pictures of Pokémon in their native environments in the New Pokémon Snap game, only for the Nintendo Switch system! You'll even discover behaviors and expressions you've never seen before when you encounter and research lively wild Pokémon. Explore environments, take in-game pictures and fill your Pokémon Photodex. Travel to unknown islands with beautiful scenery like lush jungles and sandy beaches. The Pokémon pictures you take there will be used to build your very own Pokémon Photodex. This brand-new game brings the gameplay of the 1999 Pokémon Snap game for the Nintendo 64 system to life on the Nintendo Switch system with unknown islands to discover and different Pokémon to see. Photograph lively wild Pokémon in their natural habitats as you research and explore unknown islands. Journey through a variety of environments such as beaches and jungles to capture previously-unseen Pokémon behaviors. The photos you take can also be used to fill out your very own Pokémon Photodex.\r * See a different side of Pokémon in a new photo-snapping adventure, only on Nintendo Switch\r* Research various Pokémon in their natural habitats and capture Pokémon behaviors that you've never seen before\r* Explore unknown islands with scenery like lush jungles and tropical beaches throughout your journey\r* Take in-game photos to make your very own Pokémon Photodex… Expand"
  }
]