[
  {
    "name": "World Soccer Winning Eleven 8 International",
    "details_link": "https://www.metacritic.com/game/playstation-2/world-soccer-winning-eleven-8-international",
    "publisher": "Konami",
    "release_date": "Feb  1 2005",
    "developers": [
      "KCET"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Soccer",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/83f9614f21e1fc97878a1de8ce709caa-98.jpg",
    "descriptions": "Winning Eleven 8 once again raises the bar with in-depth gameplay, improved realism and increased control. The game now features all the teams from the Italian, Spanish and Dutch leagues under the official license. Featuring 136 club teams and 57 national teams, Winning Eleven 8 offersWinning Eleven 8 once again raises the bar with in-depth gameplay, improved realism and increased control. The game now features all the teams from the Italian, Spanish and Dutch leagues under the official license. Featuring 136 club teams and 57 national teams, Winning Eleven 8 offers gamers control of up to 4,500 of the world's greatest soccer players. The game introduces a wealth of new moves and tricks including new free kick and penalty kick techniques, an innovative indirect free kick move and a new dribbling system that offers more control as gamers go one-on-one and try to pass opposing players. Also featured is the first-ever on-screen referee in the history of the series. Boasting an enhanced ref AI, the referee will run up and down the field reacting realistically and instinctively to fouls, giving advantage for minor infringements and even stepping in to calm things down when the action gets heated. Winning Eleven 8 also features improvements to the popular Master League, which now has more strategy through player development and injury, and a new 'My Best Eleven' option so fans can save their greatest teams. [Konami]… Expand"
  },
  {
    "name": "SteamWorld Heist: Ultimate Edition",
    "details_link": "https://www.metacritic.com/game/switch/steamworld-heist-ultimate-edition",
    "publisher": "Image & Form",
    "release_date": "Dec 28 2017",
    "developers": [
      "Image & Form"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Stadia",
      "Wii U",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General"
    ],
    "meta_score": 91,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/a567680ef0b22c6a5c1e57765b3b1bed-98.jpg",
    "descriptions": "Join Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier byJoin Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier by upgrading your robots with unique abilities, weapons – and even stylish hats!… Expand"
  },
  {
    "name": "The Legend of Zelda: A Link Between Worlds",
    "details_link": "https://www.metacritic.com/game/3ds/the-legend-of-zelda-a-link-between-worlds",
    "publisher": "Nintendo",
    "release_date": "Nov 22 2013",
    "developers": [
      "Nintendo"
    ],
    "platforms": "3DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action Adventure",
      "General",
      "Action RPG",
      "Open-World"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/5/65736a8ac310d01c49484d0c71b8cfb2-98.jpg",
    "descriptions": "The Legend of Zelda: A Link Between Worlds is a new game with a new storyline set in world of the Super NES classic The Legend of Zelda: A Link to the Past."
  },
  {
    "name": "NieR: Automata - Game of the YoRHa Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/nier-automata---game-of-the-yorha-edition",
    "publisher": "Square Enix",
    "release_date": "Feb 26 2019",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 91,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/5/2ac66c0e4df312700c6744ce932d98dc-98.jpg",
    "descriptions": "Humanity has been driven from the Earth by mechanical beings from another world. In a final effort to take back the planet, the human resistance sends a force of android soldiers to destroy the invaders. Now, a war between machines and androids rages on... A war that could soon unveil aHumanity has been driven from the Earth by mechanical beings from another world. In a final effort to take back the planet, the human resistance sends a force of android soldiers to destroy the invaders. Now, a war between machines and androids rages on... A war that could soon unveil a long-forgotten truth of the world.… Expand"
  },
  {
    "name": "Dark Souls II",
    "details_link": "https://www.metacritic.com/game/pc/dark-souls-ii",
    "publisher": "Bandai Namco Games",
    "release_date": "Apr 25 2014",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 91,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/4/6247a9a855916a7a58ebee939ac5a0d5-98.jpg",
    "descriptions": "Dark Souls II brings the franchise’s renowned difficulty & gripping gameplay innovations to both single and multiplayer experiences."
  },
  {
    "name": "Castlevania: Circle of the Moon",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/castlevania-circle-of-the-moon",
    "publisher": "Konami",
    "release_date": "Jun 10 2001",
    "developers": [
      "KCEK"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/0/b210a4d48ce9190a216233a157b26e6a-98.jpg",
    "descriptions": "Count Dracula has been resurrected and evil will reign supreme unless he is stopped. As Nathan Graves, you'll hunt down the count and use your whip and a variety of special items to destroy his minions. Battle your way through Dracula's castle and rid the world of evil once and for all!"
  },
  {
    "name": "Resident Evil 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-2",
    "publisher": "Capcom",
    "release_date": "Jan 25 2019",
    "developers": [
      "Capcom R&D Division 1"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Survival"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/6/fb1f200c3315a838e3ae1aa4f1f77045-98.jpg",
    "descriptions": "In Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City thatIn Resident Evil 2, the classic action, tense exploration, and puzzle solving gameplay that defined the Resident Evil series returns. Players join rookie police officer Leon Kennedy and college student Claire Redfield, who are thrust together by a disastrous outbreak in Raccoon City that transformed its population into deadly zombies. Both Leon and Claire have their own separate playable campaigns, allowing players to see the story from both characters’ perspectives. The fate of these two fan favorite characters is in players hands as they work together to survive and get to the bottom of what is behind the terrifying attack on the city. Will they make it out alive?… Expand"
  },
  {
    "name": "Spelunky 2",
    "details_link": "https://www.metacritic.com/game/pc/spelunky-2",
    "publisher": "Mossmouth",
    "release_date": "Sep 29 2020",
    "developers": [
      "Mossmouth",
      "Bitworks"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/2/a7c375ac03aea0543fca2f2a900eb5a9-98.jpg",
    "descriptions": "Spelunky 2 builds upon the unique, randomized challenges that made the original a roguelike classic, offering a huge adventure designed to satisfy players old and new. Meet the next generation of explorers as they find themselves on the Moon, searching for treasure and missing family."
  },
  {
    "name": "Far Cry 3",
    "details_link": "https://www.metacritic.com/game/xbox-360/far-cry-3",
    "publisher": "Ubisoft",
    "release_date": "Dec  4 2012",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox One",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/f96819c5aaab03257d689a58bd95760b-98.jpg",
    "descriptions": "In Far Cry 3, players assume the role of Jason Brody, a figure alone at the edge of the world, stranded on a mysterious tropical island. In this savage paradise where anarchy and violence are the only sure thing, players dictate how the story unfolds, from the battles they elect to fight toIn Far Cry 3, players assume the role of Jason Brody, a figure alone at the edge of the world, stranded on a mysterious tropical island. In this savage paradise where anarchy and violence are the only sure thing, players dictate how the story unfolds, from the battles they elect to fight to the allies or enemies they make along the way. As Jason Brody, players slash, sneak, detonate and shoot their way across the island in a world that has lost its understanding of what's right and wrong.… Expand"
  },
  {
    "name": "Dark Souls II",
    "details_link": "https://www.metacritic.com/game/playstation-3/dark-souls-ii",
    "publisher": "Namco Bandai Games",
    "release_date": "Mar 11 2014",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 91,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/709fe6cf20bf9e83e8f55c3bd56848f5-98.jpg",
    "descriptions": "Prepare to die... Again. Dare yourself to engage against intense gameplay in a vast world powered by a new engine. Immerse yourself into mind-bending environments filled with new twisted monsters and deadly bosses. A vast array of threats will prey on human senses & phobias - auditoryPrepare to die... Again. Dare yourself to engage against intense gameplay in a vast world powered by a new engine. Immerse yourself into mind-bending environments filled with new twisted monsters and deadly bosses. A vast array of threats will prey on human senses & phobias - auditory hallucinations, vertigo, acrophobia, etc. More intricate customization options provide weapons and armor tailoring to player style. [Namco Bandai Games]… Expand"
  },
  {
    "name": "Shovel Knight: Treasure Trove",
    "details_link": "https://www.metacritic.com/game/switch/shovel-knight-treasure-trove",
    "publisher": "Yacht Club Games",
    "release_date": "Mar  3 2017",
    "developers": [
      "Yacht Club Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 91,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/2/8f0aa6ca9fc5eb75cf3077824bd5737c-98.jpg",
    "descriptions": "Shovel Knight: Treasure Trove is the full and complete edition of Shovel Knight, a sweeping classic action adventure game series with awesome gameplay, memorable characters, and an 8-bit retro aesthetic! Become Shovel Knight, wielder of the Shovel Blade, as he runs, jumps, and battles in aShovel Knight: Treasure Trove is the full and complete edition of Shovel Knight, a sweeping classic action adventure game series with awesome gameplay, memorable characters, and an 8-bit retro aesthetic! Become Shovel Knight, wielder of the Shovel Blade, as he runs, jumps, and battles in a quest for his lost beloved. Take down the nefarious knights of the Order of No Quarter and their menacing leader, The Enchantress.\r But that's not everything! Shovel Knight: Treasure Trove also features three additional campaigns that are games all unto themselves! Take control of Plague Knight, Specter Knight, and King Knight on adventures of their own! Together, they form a grand and sweeping saga!\r With a fully cooperative campaign, a full-featured challenge mode, a 4 player battle mode, and body swap mode, you'll be digging for a long time. With Shovel Knight: Treasure Trove, you get it all. Uphold the virtues of Shovelry, earn relics and riches, and discover the true meaning of shovel justice!… Expand"
  },
  {
    "name": "Dragon Quest XI S: Echoes of an Elusive Age - Definitive Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/dragon-quest-xi-s-echoes-of-an-elusive-age---definitive-edition",
    "publisher": "Square Enix",
    "release_date": "Dec  4 2020",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "Stadia",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 91,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/0a61aadae1aac489efe541389c7cffee-98.jpg",
    "descriptions": "The Definitive Edition includes all the content from the original release of the acclaimed DRAGON QUEST XI, and adds extra character-specific scenarios, the choice of playing with the original soundtrack or a grand orchestral version of the music, the ability to switch between 2D and 3DThe Definitive Edition includes all the content from the original release of the acclaimed DRAGON QUEST XI, and adds extra character-specific scenarios, the choice of playing with the original soundtrack or a grand orchestral version of the music, the ability to switch between 2D and 3D graphic modes, a Japanese voice-acting option, and much more. … Expand"
  },
  {
    "name": "flower",
    "details_link": "https://www.metacritic.com/game/playstation-4/flower",
    "publisher": "SCEA",
    "release_date": "Nov 15 2013",
    "developers": [
      "Bluepoint Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "PlayStation 4"
    ],
    "num_players": "1 Player",
    "genres": [
      "General",
      "Miscellaneous",
      "General"
    ],
    "meta_score": 91,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/0/8d46b88cfce157badeff5d905341985c-98.jpg",
    "descriptions": "The pioneers that brought you the PLAYSTATION Network title flOw are back with another concept that challenges traditional gaming conventions. Flower expands the team's tradition of delivering simple gameplay, accessible controls and a medium to explore emotional chords uncommon in videoThe pioneers that brought you the PLAYSTATION Network title flOw are back with another concept that challenges traditional gaming conventions. Flower expands the team's tradition of delivering simple gameplay, accessible controls and a medium to explore emotional chords uncommon in video games. In Flower, the surrounding environment, most often pushed to the background in games, is pulled to the forefront and becomes the primary \"character.\" The player fades from an external and stressful world in the opening of this fresh and genuine game only for PS3, and journeys through beautifully vivid landscapes, changing the his surroundings and exploring nature along the way.… Expand"
  },
  {
    "name": "Mario Kart DS",
    "details_link": "https://www.metacritic.com/game/ds/mario-kart-ds",
    "publisher": "Nintendo",
    "release_date": "Nov 14 2005",
    "developers": [
      "Nintendo"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Kart",
      "Kart",
      "Automobile"
    ],
    "meta_score": 91,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/7/9c03b746fa35291c61ac1ed7feab3890-98.jpg",
    "descriptions": "Race and battle with up to eight karts at once, regardless of whether or not everyone has a Game Card. The all–star cast includes Mario, Luigi, Peach, Yoshi, Donkey Kong, Wario, Bowser, and Toad. With courses drawn from every Mario Kart game - Super Mario Kart, Mario Kart 64, Mario Kart:Race and battle with up to eight karts at once, regardless of whether or not everyone has a Game Card. The all–star cast includes Mario, Luigi, Peach, Yoshi, Donkey Kong, Wario, Bowser, and Toad. With courses drawn from every Mario Kart game - Super Mario Kart, Mario Kart 64, Mario Kart: Super Circuit, Mario Kart: Double Dash - players may tour many of their favorites as well as all-new tracks and battle arenas. The game has a new dimension of fun, since players can battle others around the world by connecting to Nintendo's new wireless gaming service, Nintendo Wi-Fi Connection, via Wi-Fi. With over 30 courses and all the crazy items and frantic speed players would expect, this game is a Mario Kart fan's dream. [Nintendo]… Expand"
  },
  {
    "name": "Call of Duty",
    "details_link": "https://www.metacritic.com/game/pc/call-of-duty",
    "publisher": "Activision",
    "release_date": "Oct 29 2003",
    "developers": [
      "Infinity Ward"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "1-32 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Third-Person",
      "Historic",
      "Tactical",
      "Historic",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/b1fb7d0529dc6a2ef9ab48be7054ecbf-98.jpg",
    "descriptions": "Call of Duty delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history. Play through the chaosCall of Duty delivers the gritty realism and cinematic intensity of World War II's epic battlefield moments like never before - through the eyes of citizen soldiers and unsung heroes from an alliance of countries who together helped shape the course of modern history. Play through the chaos of battle as part of a well-trained squad, that lays down covering fire and pulls its wounded to safety. In addition to authentic squad movements and tactics, each soldier's distinct personality and training comes out on the battlefield. No one soldier or nation single-handedly won the war. For the first time, Call of Duty captures the war from multiple perspectives, through the eyes of American, British and Russian soldiers. Battle through 24 missions spanning 4 interconnected historical campaigns. Take on mission objectives ranging from sabotage and all-out assault to stealth, vehicle combat and rescue. Authentic weapons, locations, vehicles and sounds of war all contribute to the realism. [Activision]… Expand"
  },
  {
    "name": "Madden NFL 2004",
    "details_link": "https://www.metacritic.com/game/pc/madden-nfl-2004",
    "publisher": "EA Sports",
    "release_date": "Aug 12 2003",
    "developers": [
      "EA Tiburon"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Football",
      "Sim",
      "Sim"
    ],
    "meta_score": 91,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/1/518832e35051f33645df490ba36d1fa5-98.jpg",
    "descriptions": "Key Features for 2004 include New Playmaker Control - Make pre-snap adjustments to your receiver routes, direct receiver routes during a scramble, direct blocking down field during a run, or read and react to the offense to deliver a crushing tackle; New Owner Mode - Hire your own staff, setKey Features for 2004 include New Playmaker Control - Make pre-snap adjustments to your receiver routes, direct receiver routes during a scramble, direct blocking down field during a run, or read and react to the offense to deliver a crushing tackle; New Owner Mode - Hire your own staff, set your team's ticket prices, build your own stadium, reward key players with signing bonuses and boost player attributes in Mini-Camp drills; Most Realistic NFL Playbooks Ever -  Tons of new trick plays, multiple formation variations, and the deepest NFL playbooks from all 32 officially licensed Coaches Club Head Coaches; New Animations and Enhancements - New QB scramble transitions to improve throwing on the run, stumbles, open field blocks, whirlwind defensive reaction moves, sideline wrap tackles, and out of bound pushes. [Electronic Arts]… Expand"
  },
  {
    "name": "Mario Golf",
    "details_link": "https://www.metacritic.com/game/nintendo-64/mario-golf",
    "publisher": "Nintendo",
    "release_date": "Jun 30 1999",
    "developers": [
      "Camelot Software Planning"
    ],
    "platforms": "Nintendo 64",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Arcade"
    ],
    "meta_score": 91,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/4ffd29eaba4d092dcff42db7e915f321-98.jpg",
    "descriptions": "Forget buying expensive golf gear--Mario brings the game to you.  Mario Golf features four complete 18-hole courses, 11 golfers, and precise play control.  Create your own golfer and build up his or her experience and skill levels by competing in various tournaments and head-to-head matches.Forget buying expensive golf gear--Mario brings the game to you.  Mario Golf features four complete 18-hole courses, 11 golfers, and precise play control.  Create your own golfer and build up his or her experience and skill levels by competing in various tournaments and head-to-head matches.  The more you play, the stronger and more accurate your golfer becomes.  There are many different modes of play in Mario Golf, including a wide variety of minigames designed to challenge even the most level-headed swingers.  … Expand"
  },
  {
    "name": "Crash Bandicoot 3: Warped",
    "details_link": "https://www.metacritic.com/game/playstation/crash-bandicoot-3-warped",
    "publisher": "SCEA",
    "release_date": "Oct 31 1998",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 91,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/6/344f2962e959ec376b8988f8c0b0f832-98.jpg",
    "descriptions": "This time the game takes place across a great expanse of time and space, making for greatly diverse level designs, which in turn keep the game fresh."
  },
  {
    "name": "Assassin's Creed II",
    "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-ii",
    "publisher": "Ubisoft",
    "release_date": "Nov 17 2009",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/6/f16df0b294fef41e82147ff0329ead91-98.jpg",
    "descriptions": "Assassin's Creed II is the product of over two years of intensive development by the original creative team behind the Assassin's Creed brand. In a vast open world environment, the game invites players to incarnate Ezio, a privileged young noble in Renaissance Italy who's been betrayed byAssassin's Creed II is the product of over two years of intensive development by the original creative team behind the Assassin's Creed brand. In a vast open world environment, the game invites players to incarnate Ezio, a privileged young noble in Renaissance Italy who's been betrayed by the rival ruling families of Italy. Ezio's subsequent quest for vengeance plunges players into an epic story that offers more variety in missions, surprising and engaging new gameplay elements, diverse weapons and a profound character progression that appeal to fans of the original Assassin's Creed as well as entice players new to the brand. [Ubisoft]… Expand"
  },
  {
    "name": "Project Gotham Racing 2",
    "details_link": "https://www.metacritic.com/game/xbox/project-gotham-racing-2",
    "publisher": "Microsoft Game Studios",
    "release_date": "Nov 17 2003",
    "developers": [
      "Bizarre Creations"
    ],
    "platforms": "Xbox",
    "num_players": "8  Online",
    "genres": [
      "Driving",
      "Racing",
      "GT / Street"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/6/1a25344cced669eebfa87ca461c17eb4-98.jpg",
    "descriptions": "Project Gotham Racing 2 is a true test of racing skill, style, and daring that rewards you not only for how fast you drive, but also for how you drive fast.  Earn Kudos and gain recognition for cornering on two wheels around the Sears Tower in Chicago; power-sliding through the ancientProject Gotham Racing 2 is a true test of racing skill, style, and daring that rewards you not only for how fast you drive, but also for how you drive fast.  Earn Kudos and gain recognition for cornering on two wheels around the Sears Tower in Chicago; power-sliding through the ancient streets of Florence, Italy; or maneuvering along the racing line through the slick streets of Edinburgh, Scotland--all while racing some of the most exotic high-performance vehicles available.  You can even challenge other gamers online, using Xbox Live, or take on your friends in a multiplayer race via System Link.… Expand"
  },
  {
    "name": "NBA 2K12",
    "details_link": "https://www.metacritic.com/game/playstation-3/nba-2k12",
    "publisher": "2K Sports",
    "release_date": "Oct  4 2011",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 10 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Basketball",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/8/1f9e1a98bb5af783ffe799e21fc06c97-98.jpg",
    "descriptions": "The NBA 2k Franchise is back with NBA 2K12."
  },
  {
    "name": "Animal Crossing: New Horizons",
    "details_link": "https://www.metacritic.com/game/switch/animal-crossing-new-horizons",
    "publisher": "Nintendo",
    "release_date": "Mar 20 2020",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Switch",
    "num_players": "Up to 8 ",
    "genres": [
      "Simulation",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 90,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/5/3a9359329fd2b8b0022bc57246aca1c8-98.jpg",
    "descriptions": "If the hustle and bustle of modern life’s got you down, Tom Nook has a new business venture up his sleeve that he knows you’ll adore: the Nook Inc. Deserted Island Getaway Package. Sure, you’ve crossed paths with colorful characters near and far. Had a grand time as one of the city folk.If the hustle and bustle of modern life’s got you down, Tom Nook has a new business venture up his sleeve that he knows you’ll adore: the Nook Inc. Deserted Island Getaway Package. Sure, you’ve crossed paths with colorful characters near and far. Had a grand time as one of the city folk. May’ve even turned over a new leaf and dedicated yourself to public service. But deep down, isn’t there a part of you that longs for…freedom? Then perhaps a long walk on the beach of a deserted island, where a rich wealth of untouched nature awaits, is just what the doctor ordered. Peaceful creativity and charm await as you roll up your sleeves and make your new life whatever you want it to be. Collect resources and craft everything from creature comforts to handy tools. Embrace your green thumb as you interact with flowers and trees in new ways. Set up a homestead where the rules of what goes indoors and out no longer apply. Make friends with new arrivals, enjoy the seasons, pole-vault across rivers as you explore, and more.… Expand"
  },
  {
    "name": "The Sims 2",
    "details_link": "https://www.metacritic.com/game/pc/the-sims-2",
    "publisher": "EA Games",
    "release_date": "Sep 14 2004",
    "developers": [
      "Maxis"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/9cd43b7e4504758adc435b40d27f1e80-98.jpg",
    "descriptions": "The Sims 2 is the first entirely-new generation of The Sims, the ground-breaking game that allowed players to create and control people. The Sims 2 challenges you to direct the journey of your Sims' lives as they grow from infancy through childhood, teenage life and adulthood. Starting withThe Sims 2 is the first entirely-new generation of The Sims, the ground-breaking game that allowed players to create and control people. The Sims 2 challenges you to direct the journey of your Sims' lives as they grow from infancy through childhood, teenage life and adulthood. Starting with a personality that you give them (or that they inherit from their parents), your Sims will develop in unique ways based on your choices and influence. As they progress through life, your Sims will collect memories which shape who they are, what options they have and how they behave. These experiences can have a short or long-term effect on relationships between family members and friends. Experiences between Sims when they are children can affect their relationships as teens and adults. Your Sims can have casual friendships or make life-long enemies. [Electronic Arts]… Expand"
  },
  {
    "name": "Final Fantasy XIV: Shadowbringers",
    "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xiv-shadowbringers",
    "publisher": "Square Enix",
    "release_date": "Jul  2 2019",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PlayStation 4",
      "PC"
    ],
    "genres": [
      "Role-Playing",
      "Massively Multiplayer"
    ],
    "meta_score": 90,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/7/8830ae69544b05764fe2d5bc4d5a8d6a-98.jpg",
    "descriptions": "Take part in the next saga of FINAL FANTASY® XIV Online with the next legendary expansion pack—SHADOWBRINGERS.\r New jobs: Gunbreaker and Dancer\r\nNew races: Viera and Hrothgar\r\nLevel cap increased: 70 to 80\r\nNew cities: The Crystarium and Eulmore\r\nJourney through expansive new areas, suchTake part in the next saga of FINAL FANTASY® XIV Online with the next legendary expansion pack—SHADOWBRINGERS.\r New jobs: Gunbreaker and Dancer\rNew races: Viera and Hrothgar\rLevel cap increased: 70 to 80\rNew cities: The Crystarium and Eulmore\rJourney through expansive new areas, such as the Rak’tika Greatwood, Amh Araeng, Il Mheg and Lakeland.\rNew trails, including harrowing encounters with Titania and Innocence.\rNew beast tribes: pixies, Nu Mou, and dwarves\rNew 8-player raid: Eden\rAn exciting new series of alliance raids YoRHa:Dark Apocalypse\rThe Restoration of the Holy See of Ishgard - In the aftermath of the Dragonsong War, Disciples of the Hand and Land work together to rebuild Ishgard… Expand"
  },
  {
    "name": "World of Warcraft: Cataclysm",
    "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-cataclysm",
    "publisher": "Blizzard Entertainment",
    "release_date": "Dec  7 2010",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Miscellaneous",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Board / Card Game",
      "Fantasy",
      "Fantasy"
    ],
    "meta_score": 90,
    "users_score": 5.7,
    "image": "https://static.metacritic.com/images/products/games/5/5b3de8802c0744cba2d423a9696e478a-98.jpg",
    "descriptions": "In Cataclysm, players witness the face of Azeroth being altered forever, as the corrupted Dragon Aspect Deathwing awakens from his subterranean slumber and erupts onto the surface, leaving ruin and destruction in his wake. As the Horde and Alliance race to the epicenter of the cataclysm, theIn Cataclysm, players witness the face of Azeroth being altered forever, as the corrupted Dragon Aspect Deathwing awakens from his subterranean slumber and erupts onto the surface, leaving ruin and destruction in his wake. As the Horde and Alliance race to the epicenter of the cataclysm, the kingdoms of Azeroth will witness seismic shifts in power, the kindling of a war of the elements, and the emergence of unlikely heroes who will rise up to protect their scarred and broken world from utter devastation. New features in the game's third expansion include: Two New Playable Races: Adventure as the cursed worgen with the Alliance or the resourceful goblins with the Horde. Increased Level Cap: Advance to level 85 and earn new abilities, tap into new talents, and progress through the path system, a new way for players to customize characters. Classic Zones Remade: Quest to level 60 as you never have before. Familiar zones across the original continents of Kalimdor and the Eastern Kingdoms have been reforged by the cataclysm and updated with new quests and content. Flying Mounts in Azeroth: Explore Kalimdor and the Eastern Kingdoms from a whole new perspective. Guild Advancement: Progress as a guild to earn guild levels and guild achievements. New High-Level Content: Explore newly opened parts of the world, including Uldum, Grim Batol, and the great sunken city of Vashj'ir beneath the sea, and enjoy even more high-level raid content than in previous expansions. New PvP Zone & Rated Battlegrounds: Take on PvP objectives and daily quests on Tol Barad Island, a new Wintergrasp-like zone, and wage war in all-new rated Battlegrounds. Archaeology: Master a new secondary profession to unearth valuable artifacts and earn unique rewards. New Race and Class Combinations: Explore Azeroth as a gnome priest, blood elf warrior, or one of the other never-before-available race and class combinations. [Blizzard Entertainment]… Expand"
  },
  {
    "name": "Half-Life 2",
    "details_link": "https://www.metacritic.com/game/xbox/half-life-2",
    "publisher": "Electronic Arts",
    "release_date": "Nov 15 2005",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PC",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/0/c56b63f160a42c63df486cb77f189f01-98.jpg",
    "descriptions": "The follow-up to Half-Life continues the intense action and immersive storytelling from the original and adds more realism and responsiveness.  Once again, you play the role of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, itsThe follow-up to Half-Life continues the intense action and immersive storytelling from the original and adds more realism and responsiveness.  Once again, you play the role of research scientist Gordon Freeman, who finds himself on an alien-infested Earth being picked to the bone, its resources depleted, and its populace dwindling.  With your trusty crowbar and a variety of other weapons at your disposal, Freeman must rescue the world from the wrong he unleashed at Black Mesa.… Expand"
  },
  {
    "name": "Persona 4 Golden",
    "details_link": "https://www.metacritic.com/game/switch/persona-4-golden",
    "publisher": "Sega",
    "release_date": "Jan 19 2023",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/4/26e732897ec90f2a45aff3ac0f34b94a-98.jpg",
    "descriptions": "Strange rumors of the Midnight Channel slowly spread through the rural town of Inaba, the protagonist's new home, just as a chain of mysterious murders begin. As the protagonist and his teammates chase after the truth, they find themselves opening the door to another world. \r\rInaba, aStrange rumors of the Midnight Channel slowly spread through the rural town of Inaba, the protagonist's new home, just as a chain of mysterious murders begin. As the protagonist and his teammates chase after the truth, they find themselves opening the door to another world. \r\rInaba, a quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden.\r A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one's self. \r\rWith an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.\r Key Features include:\r * Enjoy gameplay with variable framerates\r* Experience the world of Persona on Xbox in Full HD\r* Achievements \r* Choose between Japanese and English VO… Expand"
  },
  {
    "name": "NCAA Football 2003",
    "details_link": "https://www.metacritic.com/game/xbox/ncaa-football-2003",
    "publisher": "EA Sports",
    "release_date": "Jul 20 2002",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/4/56869a7a67f02eecf1d163f89900921d-98.jpg",
    "descriptions": "NCAA Football 2003 delivers the tradition and spirit of college football's storied programs with intense rivalries, authentic stadium atmospheres, and realistic gameplay. You'll choose from 117 Division 1-A and 27 Division 1-AA schools across the country, or create your own, and then coachNCAA Football 2003 delivers the tradition and spirit of college football's storied programs with intense rivalries, authentic stadium atmospheres, and realistic gameplay. You'll choose from 117 Division 1-A and 27 Division 1-AA schools across the country, or create your own, and then coach your school through a variety of game modes. In Dynasty mode, you can recruit the best athletes, redshirt your developing players, and use TV exposure to gain status as you build a dominating force in the NCAA. NCAA Football 2003 also features a variety of new moves--including play fakes, spins, and one-foot toe drag--which you must master in order to reach the championship. … Expand"
  },
  {
    "name": "Rayman 2: The Great Escape",
    "details_link": "https://www.metacritic.com/game/nintendo-64/rayman-2-the-great-escape",
    "publisher": "Ubisoft",
    "release_date": "Oct 31 1999",
    "developers": [
      "Ubisoft Montpellier"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "Nintendo 64"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/9/06fb9ad9ff0431ae89a91fcde8595623-98.jpg",
    "descriptions": "Enter a massive 3-D action adventure of amazing beauty and challenge. The pirate terror has enslaved the world and only Rayman's speed, agility, and magical powers can save all. Race and battle across 45 intricately designed areas - rainforests, jungles, narrow canyon passes, even into theEnter a massive 3-D action adventure of amazing beauty and challenge. The pirate terror has enslaved the world and only Rayman's speed, agility, and magical powers can save all. Race and battle across 45 intricately designed areas - rainforests, jungles, narrow canyon passes, even into the mighty pirate ship itself.… Expand"
  },
  {
    "name": "Bayonetta",
    "details_link": "https://www.metacritic.com/game/xbox-360/bayonetta",
    "publisher": "Sega",
    "release_date": "Jan  5 2010",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Wii U",
      "Xbox One",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Beat-'Em-Up",
      "Fantasy",
      "Beat-'Em-Up",
      "Linear"
    ],
    "meta_score": 90,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/4/d9e90e750823b9f59a2643e5fef33402-98.jpg",
    "descriptions": "Bayonetta is a stylish and cinematic action game directed by creator Hideki Kamiya. A member of an ancient witch clan and possessing powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless ethereal enemies, many reaching epic proportions, in a game of 100%Bayonetta is a stylish and cinematic action game directed by creator Hideki Kamiya. A member of an ancient witch clan and possessing powers beyond the comprehension of mere mortals, Bayonetta faces-off against countless ethereal enemies, many reaching epic proportions, in a game of 100% pure, unadulterated all-out action. Outlandish finishing moves are performed with balletic grace as Bayonetta flows from one fight to another. With over-the-top action taking place in stages that are a veritable theme park of exciting attractions, Bayonetta pushes the limits of the action genre, bringing to life its fast-paced, dynamic climax combat. [Sega]… Expand"
  },
  {
    "name": "Diablo III: Ultimate Evil Edition",
    "details_link": "https://www.metacritic.com/game/playstation-4/diablo-iii-ultimate-evil-edition",
    "publisher": "Blizzard Entertainment",
    "release_date": "Aug 19 2014",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action RPG",
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/1092744fa790bc2fa0cd1a0cd59d201b-98.jpg",
    "descriptions": "PlayStation 4 players can now experience the full adventure of Blizzard’s epic action RPG, Diablo III, and the upcoming expansion, Reaper of Souls all from the comfort of their couch in Diablo III: Ultimate Evil Edition! Take on the role of one of six powerful character class Barbarian,PlayStation 4 players can now experience the full adventure of Blizzard’s epic action RPG, Diablo III, and the upcoming expansion, Reaper of Souls all from the comfort of their couch in Diablo III: Ultimate Evil Edition! Take on the role of one of six powerful character class Barbarian, Demon Hunter, Monk, Witch Doctor, Wizard, or the all-new Crusader and embark on a dark journey through Acts I-V to save the world of Sanctuary from ancient and sinister forces. With the new DUALSHOCK 4 wireless controller and a custom-designed console interface, players will be outfitted with touch pad functionality and new social features as they engage in pulse-pounding combat with hordes of monsters and acquire items of incredible power.… Expand"
  },
  {
    "name": "Overwatch",
    "details_link": "https://www.metacritic.com/game/playstation-4/overwatch",
    "publisher": "Blizzard Entertainment",
    "release_date": "May 23 2016",
    "developers": [
      "Blizzard Entertainment"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 90,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/6/038c915512e6003710577e71905696aa-98.jpg",
    "descriptions": "Overwatch is a highly stylized team-based shooter set on earth in the near future. Every match is an intense multiplayer showdown pitting a diverse cast of soldiers, mercenaries, scientists, adventurers, and oddities against each other in an epic, globe-spanning conflict."
  },
  {
    "name": "Far Cry 3",
    "details_link": "https://www.metacritic.com/game/playstation-3/far-cry-3",
    "publisher": "Ubisoft",
    "release_date": "Dec  4 2012",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/7/e72036b13591cd3834ff759b19497a7f-98.jpg",
    "descriptions": "With Far Cry 3, players step into the shoes of Jason Brody, a man alone at the edge of the world, stranded on a mysterious tropical island. In this savage paradise where lawlessness and violence are the only sure thing, players dictate how the story unfolds, from the battles they choose toWith Far Cry 3, players step into the shoes of Jason Brody, a man alone at the edge of the world, stranded on a mysterious tropical island. In this savage paradise where lawlessness and violence are the only sure thing, players dictate how the story unfolds, from the battles they choose to fight to the allies or enemies they make along the way. As Jason Brody, players will slash, sneak, detonate and shoot their way across the island in a world that has lost all sense of right and wrong.… Expand"
  },
  {
    "name": "ICO",
    "details_link": "https://www.metacritic.com/game/playstation-2/ico",
    "publisher": "SCEA",
    "release_date": "Sep 24 2001",
    "developers": [
      "SCE Japan Studio"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/0/1000065207a5267b9ad0733532fcceaf-98.jpg",
    "descriptions": "Assume the role of Ico, a courageous young boy born with horns who has been delivered to a mysterious castle to be sacrificed so that, according to legend, the community will be saved.  Attempt to escape the grounds and save a princess through a variety of mazes, brainteasers, and other puzzles."
  },
  {
    "name": "Tom Clancy's Ghost Recon Advanced Warfighter",
    "details_link": "https://www.metacritic.com/game/xbox-360/tom-clancys-ghost-recon-advanced-warfighter",
    "publisher": "Ubisoft",
    "release_date": "Mar  9 2006",
    "developers": [
      "Ubisoft Paris"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "1-16 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Tactical",
      "Modern",
      "Modern"
    ],
    "meta_score": 90,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/561b897d84e1bc6292fcc6e2c2efbdc3-98.jpg",
    "descriptions": "In 2013, the U.S. Army will implement the Integrated Warfighter System (IWS), evolving what we know as the modern soldier. IWS combines advanced weapon systems, satellite communication devices and enhanced survivability into one fully integrated combat system. The IWS program has beenIn 2013, the U.S. Army will implement the Integrated Warfighter System (IWS), evolving what we know as the modern soldier. IWS combines advanced weapon systems, satellite communication devices and enhanced survivability into one fully integrated combat system. The IWS program has been developed to meet these new threats head on. Now, it can be tested on the battlefield. Following an insurgence in the heart of Mexico City, the U.S. Army's most elite Special Forces team is deployed to the center of the conflict to regain control of the city. Greatly outnumbered but fully equipped with the IWS, this elite team is the first and last line of defense on the battlefield. They are the \"Quiet\" professionals. They are the Ghosts. Gain access to the future of military technology. Using a fully integrated combat system with cutting-edge weapons and revolutionary communication systems, gamers embody the soldier of the future. Based on actual U.S. Army research, the Ghosts give gamers a realistic view of how war will be fought in the next decade. Use the revolutionary Cross-Com, a communication device powered by satellite technology. Attached to the soldier's monocle, the Cross-Com provides full situational awareness and command of the battlefield. Command the Ghost squad and remote allied forces and drones, and direct artillery and air strikes. See what the squad sees and receive visual and auditory intel from allied forces and unmanned drones. [Ubisoft]… Expand"
  },
  {
    "name": "FIFA Soccer 12",
    "details_link": "https://www.metacritic.com/game/playstation-3/fifa-soccer-12",
    "publisher": "Electronic Arts",
    "release_date": "Sep 27 2011",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/1/f9067e325ac9b5ee6788ad7e6885512b-98.jpg",
    "descriptions": "FIFA Soccer 12 brings a new physics engine into the soccer gameplay."
  },
  {
    "name": "World of Goo",
    "details_link": "https://www.metacritic.com/game/pc/world-of-goo",
    "publisher": "Take-Two Interactive",
    "release_date": "Oct 12 2008",
    "developers": [
      "2D Boy"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Action",
      "Puzzle",
      "General",
      "Puzzle",
      "General"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/a9e5ec3ba895d2dff7823ec82318f989-98.jpg",
    "descriptions": "World of Goo is a physics based puzzle / construction game. The millions of Goo Balls that live in the beautiful World of Goo don't know that they are in a game, or that they are extremely delicious. [2D Boy]"
  },
  {
    "name": "Mario & Luigi: Superstar Saga",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/mario-luigi-superstar-saga",
    "publisher": "Nintendo",
    "release_date": "Nov 17 2003",
    "developers": [
      "Alphadream Corporation"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1-4 ",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 90,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/9/edb2ab719902bb5b2b8f8bdcc3c25051-98.jpg",
    "descriptions": "An evil witch has replaced Princess Peach's fair speech with explosives!  Mario and Luigi must once again come to her rescue, but this time they employ the help of Bowser, their sworn enemy.  Mario and Luigi must learn new moves and combine powers to fight off enemies and move closer to theAn evil witch has replaced Princess Peach's fair speech with explosives!  Mario and Luigi must once again come to her rescue, but this time they employ the help of Bowser, their sworn enemy.  Mario and Luigi must learn new moves and combine powers to fight off enemies and move closer to the witch's castle.  Guide this unlikely bunch through an abundance of minigames such as Border Jump and Mystery Carts.  Combine the powers of Mario and Luigi to pull off special tag-team moves. Immerse yourself in this bright, cartoonish, and humorous world, complete with hit music featured in previous Mario games.… Expand"
  },
  {
    "name": "Shovel Knight",
    "details_link": "https://www.metacritic.com/game/playstation-4/shovel-knight",
    "publisher": "Yacht Club Games",
    "release_date": "Apr 21 2015",
    "developers": [
      "Yacht Club Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Wii U",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/3/4dd79ee1b7200558c3c43c9a03f362c1-98.jpg",
    "descriptions": "Shovel Knight is a sweeping classic action adventure game with awesome gameplay, memorable characters, and an 8-bit retro aesthetic. It's a hot mashup of new and old! You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this land with twoShovel Knight is a sweeping classic action adventure game with awesome gameplay, memorable characters, and an 8-bit retro aesthetic. It's a hot mashup of new and old! You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this land with two goals: to defeat the evil Enchantress and quest for his lost beloved. He wields a Shovel Blade: a multipurpose weapon whose techniques have now been lost to the ages. Always honest and helpful, Shovel Knight is a shining example of the code of Shovelry: Slash Mercilessly and Dig Tirelessly!\r But, between Shovel Knight and his beloved stands a cadre of villainous knights. These terrible foes, known as The Order of No Quarter, have been dispatched to prevent Shovel Knight from reaching the Enchantress, and will pursue their mission at any cost. If you love games with perfect platforming, beautiful art, infectious music, crazy bosses, humor and levity, and real heart... Shovel Knight is for you!… Expand"
  },
  {
    "name": "Rogue Legacy 2",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/rogue-legacy-2",
    "publisher": "Cellar Door Games",
    "release_date": "Apr 28 2022",
    "developers": [
      "Cellar Door Games"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Role-Playing",
      "Platformer",
      "Roguelike",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/2930c5ae92dbae22983e8dcc42b0961f-98.jpg",
    "descriptions": "Rogue Legacy 2 is what you'd get if you mashed Rogue Legacy and a sequel together. Every time you die, your children will succeed you, and each child is unique. Your daughter might be a Colourblind Archer, and your son could be a Pacifistic Chef. Either way, one of them is getting conscripted."
  },
  {
    "name": "Tony Hawk's Underground",
    "details_link": "https://www.metacritic.com/game/playstation-2/tony-hawks-underground",
    "publisher": "Activision",
    "release_date": "Oct 27 2003",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/1/45a84fef32b9f43ad718674c128df859-98.jpg",
    "descriptions": "Get ready for a totally new breed of the Tony Hawk experience. Play as yourself, not a pro skater, and make your way through a plot-twisting, true-to-life story that takes you from unknown local skate punk to fame and fortune as a superstar skater. For the first time ever, you'll be able toGet ready for a totally new breed of the Tony Hawk experience. Play as yourself, not a pro skater, and make your way through a plot-twisting, true-to-life story that takes you from unknown local skate punk to fame and fortune as a superstar skater. For the first time ever, you'll be able to get off your board and explore 9 expansive levels on foot or by vehicle. Enjoy unprecedented customization by designing and naming your own original tricks through the all-new Create-a-Trick. Or create bigger parks and include your own goals in the expanded Skate Park Editor. After you're done, share your tricks and parks online with your friends. You can even download your own face into the game! And, with all-new online play - new games, stats, and online rankings - you'll have infinite expansion through downloadable content. You're the star...you own the Underground! [Activision]… Expand"
  },
  {
    "name": "Marvel vs. Capcom 2",
    "details_link": "https://www.metacritic.com/game/dreamcast/marvel-vs-capcom-2",
    "publisher": "Capcom",
    "release_date": "Jun 29 2000",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Dreamcast"
    ],
    "genres": [
      "Action",
      "Fighting",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/71aca6c092db4d7eb63ccdbdb379f59e-98.jpg",
    "descriptions": "The world's most insane tag-team fantasy fighter is bigger than ever!  An unprecedented 56 characters include the debut of Jill from Resident Evil, Servbots from Mega Man and Cable from Marvel Comics fame.  Experience arcade perfect fighting with 3 on 3 tag-team battles, unbelievable controlThe world's most insane tag-team fantasy fighter is bigger than ever!  An unprecedented 56 characters include the debut of Jill from Resident Evil, Servbots from Mega Man and Cable from Marvel Comics fame.  Experience arcade perfect fighting with 3 on 3 tag-team battles, unbelievable control and hyper-fast animation.  Pick a fight with legendary Capcom characters and Super Heroes from the Marvel Universe and prepare to be amazed.… Expand"
  },
  {
    "name": "Ape Escape",
    "details_link": "https://www.metacritic.com/game/playstation/ape-escape",
    "publisher": "SCEA",
    "release_date": "May 31 1999",
    "developers": [
      "SCEI"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/4e3dda991c987e478ae990eb7a0bb5f1-98.jpg",
    "descriptions": "A boisterous band of baboons carry out a daring zoo escape. It's ape anarchy and it's up to you to stop the chimps before they make chumps out of the human race! Use both analog sticks to operate great gadgets including a Tank, a Remote Control Car, a Stun Club, and a Time Net in your questA boisterous band of baboons carry out a daring zoo escape. It's ape anarchy and it's up to you to stop the chimps before they make chumps out of the human race! Use both analog sticks to operate great gadgets including a Tank, a Remote Control Car, a Stun Club, and a Time Net in your quest to hunt down over 200 apes!… Expand"
  },
  {
    "name": "Syphon Filter",
    "details_link": "https://www.metacritic.com/game/playstation/syphon-filter",
    "publisher": "989 Studios",
    "release_date": "Jan 31 1999",
    "developers": [
      "Eidetic"
    ],
    "platforms": "PlayStation",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/8/8798f89d56da3807d1e7dfd4da28a894-98.jpg",
    "descriptions": "While it may not be an original concept, the game is truly greater than the sum of its many parts."
  },
  {
    "name": "Mario & Luigi: Bowser's Inside Story",
    "details_link": "https://www.metacritic.com/game/ds/mario-luigi-bowsers-inside-story",
    "publisher": "Nintendo",
    "release_date": "Sep 14 2009",
    "developers": [
      "Alphadream Corporation"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Console-style RPG",
      "Console-style RPG",
      "Japanese-Style"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/2/5d234ecf970abf360bb3db836a70232b-98.jpg",
    "descriptions": "In his evil plot to take over the Mushroom Kingdom, Fawful tricks Bowser into eating a magic mushroom. The mushroom causes Bowser to begin inhaling everything around him, including Mario, Luigi and Princess Peach! Do the Mario Bros. have the guts to rescue Peach and escape? Players are inIn his evil plot to take over the Mushroom Kingdom, Fawful tricks Bowser into eating a magic mushroom. The mushroom causes Bowser to begin inhaling everything around him, including Mario, Luigi and Princess Peach! Do the Mario Bros. have the guts to rescue Peach and escape? Players are in control of two separate storylines. One features Bowser and his efforts to stop an arch-villain from taking over his castle. Meanwhile, inside Bowser, the microbe-sized Mario & Luigi must muscle their way through challenges and keep their nerve if they want to find a way out. They take action to control Bowser from the inside - but without his knowledge. Players can switch between storylines at will. What happens inside Bowser affects what he’s doing on the outside. Sometimes Mario & Luigi must solve puzzles and challenges behind the scenes to help Bowser overcome various obstacles and advance the plot. Players must make well-timed button presses to enhance their performance during battles and challenges. In some battles, Bowser grows so large that players must turn their Nintendo DS or Nintendo DSi system sideways, blow into the microphone or tap on the touch screen with the stylus to keep up with the action. The game features the same hilarious dialogue that has been the hallmark of the Mario & Luigi series. [Nintendo]… Expand"
  },
  {
    "name": "Trials Evolution",
    "details_link": "https://www.metacritic.com/game/xbox-360/trials-evolution",
    "publisher": "Microsoft Game Studios",
    "release_date": "Apr 18 2012",
    "developers": [
      "Ubisoft",
      "RedLynx"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Motorcycle",
      "Automobile",
      "Street",
      "Street"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/0/6d52865e8ee2749b4dab023fd374a6c4-98.jpg",
    "descriptions": "The follow-up to Trials HD brings the bike-racing action back to the Xbox 360. Ride in real-time multiplayer with two to four players, either locally or through XBLA. Take part in single player career with 50 tracks, challenging unlocks, and tricky achievements. A massive, track editor letsThe follow-up to Trials HD brings the bike-racing action back to the Xbox 360. Ride in real-time multiplayer with two to four players, either locally or through XBLA. Take part in single player career with 50 tracks, challenging unlocks, and tricky achievements. A massive, track editor lets you build the track of your choosing and share it with the world. Or simply download highly-rated tracks from around the globe using Track Central.… Expand"
  },
  {
    "name": "Grand Theft Auto IV: The Lost and Damned",
    "details_link": "https://www.metacritic.com/game/xbox-360/grand-theft-auto-iv-the-lost-and-damned",
    "publisher": "Rockstar Games",
    "release_date": "Feb 17 2009",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/13faa91c0351c367ceed5f7ad3871488-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Johnny is a veteran member of The Lost, a notorious biker gang. Johnny has been creating business opportunities for The Lost in Liberty City, but his first loyalty must be to the patch he wears on his back and to Billy Grey, the club's President. However, when Billy[Xbox Live Arcade]  Johnny is a veteran member of The Lost, a notorious biker gang. Johnny has been creating business opportunities for The Lost in Liberty City, but his first loyalty must be to the patch he wears on his back and to Billy Grey, the club's President. However, when Billy returns from rehab hell-bent on bloodshed and debauchery, Johnny finds himself in the middle of a vicious turf war with rival gangs for control of a city torn apart by violence and corruption. Can the brotherhood survive? Developed by series creator Rockstar North and set in Liberty City, Grand Theft Auto IV: The Lost and Damned features a new main character, Johnny Klebitz, and plot that intersects with the storyline of Grand Theft Auto IV; new missions that offer an entirely fresh way to explore Liberty City with new multiplayer modes, weapons and vehicles; and a diverse soundtrack with additional music - all with the incredible production values that are the trademarks of Grand Theft Auto. All-new missions and a new storyline that interweaves with the original story arc of Grand Theft Auto IV. Play as Johnny, a member of The Lost Motorcycle Club. Experience Liberty City now with the perspective and lifestyle of a member of a biker gang. Added range of weapons - including the all-new grenade launcher and sawed-off shotgun. New weapons will be available for use in single-player and in all new multiplayer modes. New vehicles - featuring a collection of bikes that include Johnny's own customized heavy-duty chopper. New and improved bike handling and physics. Set of new action-packed multiplayer modes - details coming soon. All-new in-game TV, internet and radio content featuring new radio shows and original music. Plus new side-missions and Xbox 360 Achievement. [Rockstar Games]… Expand"
  },
  {
    "name": "FIFA Soccer 12",
    "details_link": "https://www.metacritic.com/game/xbox-360/fifa-soccer-12",
    "publisher": "Electronic Arts",
    "release_date": "Sep 27 2011",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": [
      "3DS",
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/0/28891e739ecf88e46b2a3aaf13b9daab-98.jpg",
    "descriptions": "FIFA Soccer 12 brings a new physics engine into the soccer gameplay."
  },
  {
    "name": "Monster Hunter: World - Iceborne",
    "details_link": "https://www.metacritic.com/game/xbox-one/monster-hunter-world---iceborne",
    "publisher": "Capcom",
    "release_date": "Sep  6 2019",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/1/a42bd2f0338dd5871fdb5c4e2c1fbc84-98.jpg",
    "descriptions": "Monster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivalsMonster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivals the gameplay volume from the original release and features a new icy setting, storyline, monsters, gameplay options, and more.The game's all-new story picks up after Monster Hunter: World and whisks hunters away to the newly discovered chilly locale that, once fully explored, becomes the largest region in World so far. The new locale is home to several new and returning monsters ready to challenge hunters throughout their expeditions and raises the stakes with the added higher difficulty Master Rank. Iceborne continues the skill-based progression and robust crafting system found in World and expands that with several new gameplay features that broaden the player's combat repertoire. All this leads to the ultimate hunter test against the mysterious new flagship monster, Velkhana.… Expand"
  },
  {
    "name": "Factorio",
    "details_link": "https://www.metacritic.com/game/pc/factorio",
    "publisher": "Wube Software LTD.",
    "release_date": "Aug 14 2020",
    "developers": [
      "Wube Software LTD."
    ],
    "platforms": [
      "Switch",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Strategy",
      "Management",
      "Business / Tycoon"
    ],
    "meta_score": 90,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/a54f03031853fd0879c1dc2e02fc27c4-98.jpg",
    "descriptions": "Factorio is a game about building and creating automated factories to produce items of increasing complexity, within an infinite 2D world. Use your imagination to design your factory, combine simple elements into ingenious structures, and finally protect it from the creatures who don'tFactorio is a game about building and creating automated factories to produce items of increasing complexity, within an infinite 2D world. Use your imagination to design your factory, combine simple elements into ingenious structures, and finally protect it from the creatures who don't really like you. … Expand"
  },
  {
    "name": "Spelunky",
    "details_link": "https://www.metacritic.com/game/pc/spelunky",
    "publisher": "Mossmouth",
    "release_date": "Aug  8 2013",
    "developers": [
      "Derek Yu",
      "Mossmouth"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/0/041c0dbe5b3c490680c191f0b733e91e-98.jpg",
    "descriptions": "Spelunky is a unique platformer with randomized levels that offer a new and challenging experience each time you play."
  },
  {
    "name": "FIFA Soccer 10",
    "details_link": "https://www.metacritic.com/game/xbox-360/fifa-soccer-10",
    "publisher": "Electronic Arts",
    "release_date": "Oct 20 2009",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 20 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/46dea74e84c35a5205441284e58e19b7-98.jpg",
    "descriptions": "On the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. OnOn the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. On attack, players analyze space more effectively, curve their runs in an attempt to stay onside, create passing lanes naturally, and drive for more variety in attacking options. On defense, new concepts like position priority enable defenders to multitask so dangerous spaces left open by teammates out of position are covered. Plus, slide tackle targeting, press marking, and better-urgency clearance logic provide new options that make defending a tactical skill in FIFA Soccer 10. In goal, a myriad of improvements and refinements to goalkeeper intelligence result in a more responsive and powerful rushing system and ultra-realistic saves. Better balance on lofted through balls, improved goalkeeper intelligence, more realistic shooting mechanics with less shots hitting the goal posts, a practice arena to perfect skills, and a more immersive soccer experience through continuous play and quick free kicks are just a few of the issues raised by fans and addressed in FIFA Soccer 10. Three new innovations revealed today at E3 have been developed to change the player control experience in FIFA Soccer 10. The first-ever true 360 degree dribbling system gives players finer control of the ball, enabling them to find spaces between defenders that previously were not possible. Using an all-new animation technology, skilled dribblers now have the ability to face the defender and use highly responsive lateral dribbling to skip past him. An innovative concept called Freedom in Physical Play enables players to perform wider dribble touches and new collision sharing creates a varied, less predictable, and extended fight for possession between the dribbler and a defender.\rFIFA Soccer 10 also features a deeper iteration of the ever-popular Manager Mode with more than 50 major improvements, including new match realism, realistic player transfers based on multiple decision points, and true-to-life player growth curves. [Electronic Arts]… Expand"
  },
  {
    "name": "Ratchet & Clank: Going Commando",
    "details_link": "https://www.metacritic.com/game/playstation-2/ratchet-clank-going-commando",
    "publisher": "SCEA",
    "release_date": "Nov 11 2003",
    "developers": [
      "Insomniac Games"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/7/8d64a7b594fe122a5f2627d614d99ac8-98.jpg",
    "descriptions": "From the creators of the critically acclaimed smash hit Ratchet & Clank, Insomniac Games, comes the next installment of the most exciting sci-fi action adventure ever. Ratchet & Clank: Going Commando features an enhanced health damage system and weapons upgrade system, beautiful diverseFrom the creators of the critically acclaimed smash hit Ratchet & Clank, Insomniac Games, comes the next installment of the most exciting sci-fi action adventure ever. Ratchet & Clank: Going Commando features an enhanced health damage system and weapons upgrade system, beautiful diverse environments, a compelling storyline and a unique arsenal of the coolest new weapons and hi-tech gadgets ever imagined. The more $#@& you blow up, the stronger Ratchet gets and the bigger and badder the weapons you?ll have! Show off in gladiator arenas. Pick off enemies in space combat. Leave competitors to eatin? your dust in hoverbike races. And, run around spherical worlds. [SCEA]… Expand"
  },
  {
    "name": "NBA Street Vol. 2",
    "details_link": "https://www.metacritic.com/game/playstation-2/nba-street-vol-2",
    "publisher": "Electronic Arts",
    "release_date": "Apr 28 2003",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/2/4b0f2c7952e74dd4b3ffc59d9bdd12cc-98.jpg",
    "descriptions": "25 NBA legends scrap, battle and brawl for ultimate bragging rights. Play as Dr. J, Bird, Wilt, Moses, and more! Seven authentic urban courts including Soul in the Hole in NYC, Mosswood in Oakland, and more. All-new electrifying moves, passes and alley-oops. Play against the CPU or with up25 NBA legends scrap, battle and brawl for ultimate bragging rights. Play as Dr. J, Bird, Wilt, Moses, and more! Seven authentic urban courts including Soul in the Hole in NYC, Mosswood in Oakland, and more. All-new electrifying moves, passes and alley-oops. Play against the CPU or with up to four ballers. Customize the rules and players to your liking. [Electronic Arts]… Expand"
  },
  {
    "name": "Tennis 2K2",
    "details_link": "https://www.metacritic.com/game/dreamcast/tennis-2k2",
    "publisher": "Sega",
    "release_date": "Oct 24 2001",
    "developers": [
      "Hitmaker"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Sports",
      "Traditional",
      "Tennis"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/2794b4a9b48b3476d55530ec2da2ab28-98.jpg",
    "descriptions": "The top seed is back. Take to the courts of Virtua Tennis 2 as you compete to become the world No1. Serve, smash and lob your way through 16 internationally top-ranked male and female players as you go head to head in singles matches or compete with up to 4 players in doubles and mixedThe top seed is back. Take to the courts of Virtua Tennis 2 as you compete to become the world No1. Serve, smash and lob your way through 16 internationally top-ranked male and female players as you go head to head in singles matches or compete with up to 4 players in doubles and mixed doubles matches. With revamped Tournament, Exhibition and World Tour modes its game set and match Virtua Tennis 2.… Expand"
  },
  {
    "name": "Black & White",
    "details_link": "https://www.metacritic.com/game/pc/black-white",
    "publisher": "EA Games",
    "release_date": "Mar 26 2001",
    "developers": [
      "Lionhead Studios"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "General",
      "Fantasy"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/da4c1ac972d39e99d7d718a16835a555-98.jpg",
    "descriptions": "Peter Molyneux's highly anticipated \"god game,\" a blend of the genres including strategy, sim, RPG, and puzzle, features the player as a new god in the lands of Eden who must reign with the help of uniquely evolving animals in either a benign or evil fashion."
  },
  {
    "name": "Fallout 3",
    "details_link": "https://www.metacritic.com/game/playstation-3/fallout-3",
    "publisher": "Bethesda Softworks",
    "release_date": "Oct 28 2008",
    "developers": [
      "Bethesda Game Studios"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 90,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/52f24025efc3048207d5f2ed66f2c71a-98.jpg",
    "descriptions": "Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamicVault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters. Every minute is a fight for survival against the terrors of the outside world – radiation, Super Mutants, and hostile mutated creatures. From Vault-Tec, America's First Choice in Post Nuclear Simulation. Vault 101 - Jewel of the Wastes. For 200 years, Vault 101 has faithfully served the surviving residents of Washington DC and its environs, now known as the Capital Wasteland. Though the global atomic war of 2077 left the US all but destroyed, the residents of Vault 101 enjoy a life free from the constant stress of the outside world. Giant Insects, Raiders, Slavers, and yes, even Super Mutants are all no match for superior Vault-Tec engineering. Yet one fateful morning, you awake to find that your father has defied the Overseer and left the comfort and security afforded by Vault 101 for reasons unknown. Leaving the only home you've ever known, you emerge from the Vault into the harsh Wasteland sun to search for your father, and the truth. [Bethesda Softworks]… Expand"
  },
  {
    "name": "The Legend of Zelda: The Wind Waker HD",
    "details_link": "https://www.metacritic.com/game/wii-u/the-legend-of-zelda-the-wind-waker-hd",
    "publisher": "Nintendo",
    "release_date": "Sep 20 2013",
    "developers": [
      "Nintendo",
      "HexaDrive"
    ],
    "platforms": "Wii U",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/6/016c07e7f038420da60792f9e254e889-98.jpg",
    "descriptions": "As the purported definitive version of the game, The Legend of Zelda: The Wind Waker HD is remastered and presented in 1080p graphics. Gamers can experience high-definition cell-shaded presentation on their TVs or entirely on the Wii U GamePad controller. The streamlined interface letsAs the purported definitive version of the game, The Legend of Zelda: The Wind Waker HD is remastered and presented in 1080p graphics. Gamers can experience high-definition cell-shaded presentation on their TVs or entirely on the Wii U GamePad controller. The streamlined interface lets gamers easily manage your inventory—simply slide an item onto any button. Instantly view maps and zoom in on the GamePad controller's touch screen. Enjoy a breezy cruise with the original sail, or switch to the brand-new Swift Sail that lets you gather the wind and speed across the waves. With the new Tingle Bottle feature, you can connect with others over Miiverse. Comments or screenshots others have posted on Miiverse may wash up on the shore or appear in other locations, tucked into bottles. Whenever you want, move around the world in first-person mode, using the GamePad gyroscope to look around you and aim your bow, hookshot, Picto Box, or telescope. You can store more pictographs with your improved Picto Box—handy for creating figurines—and share them with other players on Miiverse. Your pictures, game tips, and messages may also appear in another player's game. Take the adventure to new levels with Hero Mode, available from the moment you start the game. In this mode, you only regain health when you earn a new heart piece or container, use a red potion, or visit a fairy fountain. Also, your enemies do double the damage. [Nintendo]… Expand"
  },
  {
    "name": "Ori and the Blind Forest: Definitive Edition",
    "details_link": "https://www.metacritic.com/game/switch/ori-and-the-blind-forest-definitive-edition",
    "publisher": "Xbox Game Studios",
    "release_date": "Sep 27 2019",
    "developers": [
      "Moon Studios"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/5/c118637e30f53df411fbd34dc8931064-98.jpg",
    "descriptions": "Ori and the Blind Forest: Definitive Edition delivers a multitude of new areas, difficulty options, and gameplay upgrades that should appeal to both new and seasoned Ori players."
  },
  {
    "name": "ESPN NFL 2K5",
    "details_link": "https://www.metacritic.com/game/playstation-2/espn-nfl-2k5",
    "publisher": "Sega",
    "release_date": "Jul 20 2004",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/f80d05c6487a8f832f5528f71d76a2a8-98.jpg",
    "descriptions": "ESPN NFL 2K5 is uniting fans with a coupling of the most responsive and intense gameplay and the richest multi-player gaming experience possible. Maximum Tackling brings unique on-field control allowing gamers to go for the wrap-up tackle or deliver the big highlight hit. The addition of theESPN NFL 2K5 is uniting fans with a coupling of the most responsive and intense gameplay and the richest multi-player gaming experience possible. Maximum Tackling brings unique on-field control allowing gamers to go for the wrap-up tackle or deliver the big highlight hit. The addition of the V.I.P. System? allows gamers to play friends, even if they're not there! Players are invited to show off their coaching skills in Franchise mode and utilize Weekly Prep to fully plan the training schedule, intensity, and regimen each week. Full online leagues and tournament play with living rosters rounds out the most complete online experience. [Sega]… Expand"
  },
  {
    "name": "Portal",
    "details_link": "https://www.metacritic.com/game/pc/portal",
    "publisher": "Electronic Arts",
    "release_date": "Oct 10 2007",
    "developers": [
      "Valve Software"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/7/ed6cef600ce7386aeb5734178cae0e16-98.jpg",
    "descriptions": "Portal is a new single player game from Valve. Set in the mysterious Aperture Science Laboratories, Portal has been called one of the most innovative new games on the horizon and offers gamers hours of unique gameplay. The game is designed to change the way players approach, manipulate, andPortal is a new single player game from Valve. Set in the mysterious Aperture Science Laboratories, Portal has been called one of the most innovative new games on the horizon and offers gamers hours of unique gameplay. The game is designed to change the way players approach, manipulate, and surmise the possibilities in a given environment; similar to how Half-Life 2's Gravity Gun innovated new ways to leverage an object in any given situation. Players must solve physical puzzles and challenges by opening portals to maneuvering objects, and themselves, through space. [Valve]… Expand"
  },
  {
    "name": "Tetris Effect",
    "details_link": "https://www.metacritic.com/game/pc/tetris-effect",
    "publisher": "Enhance Games",
    "release_date": "Jul 23 2019",
    "developers": [
      "Enhance Games"
    ],
    "platforms": [
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Stacking"
    ],
    "meta_score": 90,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/3/fc757ac97e8d8d4c1a77cdcaa7b9ecce-98.jpg",
    "descriptions": "Named after a real-world phenomenon where players' brains are so engrossed that images of the iconic falling Tetrimino blocks (i.e. the Tetris playing pieces) linger in their vision, thoughts, and even dreams, Tetris Effect amplifies this magical feeling of total immersion by surrounding youNamed after a real-world phenomenon where players' brains are so engrossed that images of the iconic falling Tetrimino blocks (i.e. the Tetris playing pieces) linger in their vision, thoughts, and even dreams, Tetris Effect amplifies this magical feeling of total immersion by surrounding you with fantastic, fully three-dimensional worlds that react and evolve based on how you play. Music, backgrounds, sounds, special effects -- everything, down to the Tetris pieces themselves, pulse, dance, shimmer, and explode in perfect sync with how you're playing.\r From deep beneath the ocean to the furthest reaches of outer space and everywhere between, Tetris Effect's 30-plus stages take players on a wondrous, emotional journey through the universe. The core of the game is still Tetris -- one of the most popular puzzle games of all time -- but like you've never seen it, or heard it, or felt it before.… Expand"
  },
  {
    "name": "The Legend of Zelda: Phantom Hourglass",
    "details_link": "https://www.metacritic.com/game/ds/the-legend-of-zelda-phantom-hourglass",
    "publisher": "Nintendo",
    "release_date": "Oct  1 2007",
    "developers": [
      "Nintendo"
    ],
    "platforms": "DS",
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Fantasy",
      "Fantasy",
      "Open-World"
    ],
    "meta_score": 90,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/8a2532bf73c3e4afa69f34f3cbe98b74-98.jpg",
    "descriptions": "[Metacritic's 2007 DS Game of the Year]  Many months have passed since the events of The Legend of Zelda: The Wind Waker, and Link, Tetra and Tetra’s band of pirates have set sail in search of new lands. They come across a patch of ocean covered in a dense fog, in which they discover an[Metacritic's 2007 DS Game of the Year]  Many months have passed since the events of The Legend of Zelda: The Wind Waker, and Link, Tetra and Tetra’s band of pirates have set sail in search of new lands. They come across a patch of ocean covered in a dense fog, in which they discover an abandoned ship. Tetra falls into danger when she explores the ship alone, and Link falls into the ocean when he attempts to rescue her. When he washes up unconscious on the shores of a mysterious island, he is awakened by the sound of a fairy’s voice. With the aid of this fairy, he sets off to find Tetra – and his way back to the seas he once knew. The stylus makes controlling Link easier than ever. Tap on the screen to make Link move, or sweep the stylus around him to swing the sword. Players can even draw a path for his boomerang and send it flying into hard-to-reach targets. Players can stash the map on the top screen for quick reference or drop it to the touch screen to make notes, study enemies, or chart a path for their boat to follow while they man the cannons. Compete with a friend over a local wireless connection: Guide Link through special dungeons to capture the Triforce or command the forces that oppose him. [Nintendo]… Expand"
  },
  {
    "name": "MVP Baseball 2004",
    "details_link": "https://www.metacritic.com/game/playstation-2/mvp-baseball-2004",
    "publisher": "EA Sports",
    "release_date": "Mar  9 2004",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/46e77de140489ab496bac158cef87561-98.jpg",
    "descriptions": "Step up to the plate with MVP Baseball 2004. The fundamentals of hitting, pitching, fielding, and base running have been reproduced like never before to give you complete control over every aspect of the game. From swinging for the fences or protecting the plate when you have a two-strikeStep up to the plate with MVP Baseball 2004. The fundamentals of hitting, pitching, fielding, and base running have been reproduced like never before to give you complete control over every aspect of the game. From swinging for the fences or protecting the plate when you have a two-strike count, the all-new batting model provides unprecedented command of each type of swing in every situation. With great gameplay and many additional features such as Pitching Challenge and Dynasty Mode, MVP Baseball 2004 wins the pennant as the most innovative and realistic baseball experience ever created. Groundbreaking Hitting Control: From hitting to the opposite field to pulling the ball down the line to swinging for the fences, every swing type is included. You Control the Field: Leap over the wall and rob home runs, hook slide to avoid tags, and take out the catcher at home with all-new player control. Pick Your Park: With all-new crowd chants, the addition of classic stadiums, and new lighting to signify various start times for your biggest games, MVP Baseball 2004 puts you in the best seat in the house. Your Dynasty Begins Now: Take full control of your franchise on all the levels -- from the minors to the pros. Play, sim, or manage each game all the way to the World Series. Swing for the Fences Online: Go yard against players across the country in one-on-one or Tournament games, while talking up your game with EA SPORTS? Talk [Electronic Arts]… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 3",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/tony-hawks-pro-skater-3",
    "publisher": "Activision",
    "release_date": "Mar  4 2002",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Game Boy Advance"
    ],
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 90,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/0/ed0744630dc137073ebc175f885442f4-98.jpg",
    "descriptions": "You may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, andYou may not be able to live like the legend, but now you can skate like him.  Skate as the legendary Tony Hawk or choose from a dream team of 12 top pro skaters, including old favorites like Lasek, Thomas, Muska, and Steamer, as well as new talent like Gilfberg, Caballero, Koston, and Mullen.  Or enjoy full customization abilities with the enhanced Create-a-Skater (now including female skaters) and the Skatepark Editor.  Travel from L.A. to Tokyo, Suburbia to Skater's Island performing challenges and meeting goals.  New moves include the Revert, which allows you to link vert tricks, and flatland tricks such as Caspers, the Primo, and Handstand Manual.  If you're good, you can even unlock hidden pro footage.… Expand"
  },
  {
    "name": "Dance Dance Revolution",
    "details_link": "https://www.metacritic.com/game/playstation/dance-dance-revolution",
    "publisher": "Konami",
    "release_date": "May  9 2001",
    "developers": [
      "Konami"
    ],
    "platforms": [
      "PC",
      "PlayStation"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Rhythm",
      "Dancing"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/3628b376a154317ae808921794aeded0-98.jpg",
    "descriptions": "Dance Dance Revolution brings the dance floor to the home floor. Straight from the arcades, the hottest dancing game lets you step into the spotlight and show your moves on the PlayStation® game console. Heat up the dance floor and put your skills to the test as you move to the groove.Dance Dance Revolution brings the dance floor to the home floor. Straight from the arcades, the hottest dancing game lets you step into the spotlight and show your moves on the PlayStation® game console. Heat up the dance floor and put your skills to the test as you move to the groove. Let the pulsating music and colorful graphics excite your senses while you become a star.… Expand"
  },
  {
    "name": "NHL 2001",
    "details_link": "https://www.metacritic.com/game/pc/nhl-2001",
    "publisher": "EA Sports",
    "release_date": "Sep 28 2000",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Ice Hockey",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/0/5f2eafa43055019a5bbabac3b5be0af7-98.jpg",
    "descriptions": "High-flyin', hard hittin', intense powerplay hockey is back with EA Sports' NHL 2001, bringing gamers out of the stands and onto the ice. Lace up the skates and play with or against all 30 National Hockey League teams, including the expansion Columbus Blue Jackets and Minnesota Wild.High-flyin', hard hittin', intense powerplay hockey is back with EA Sports' NHL 2001, bringing gamers out of the stands and onto the ice. Lace up the skates and play with or against all 30 National Hockey League teams, including the expansion Columbus Blue Jackets and Minnesota Wild.  [Electronic Arts]… Expand"
  },
  {
    "name": "Advance Wars: Dual Strike",
    "details_link": "https://www.metacritic.com/game/ds/advance-wars-dual-strike",
    "publisher": "Nintendo",
    "release_date": "Aug 22 2005",
    "developers": [
      "Intelligent Systems"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Modern",
      "Modern",
      "Tactics"
    ],
    "meta_score": 90,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/5/163db61246451900247d84fc1188cccb-98.jpg",
    "descriptions": "Players lead their new Commanding Officers to fend off the Black Hole Army’s latest invasion. With massive battles that sweep across both of the DS screens, Advance Wars: Dual Strike will change the face of war forever. Use the top screen for quick-reference battle intel, or take control inPlayers lead their new Commanding Officers to fend off the Black Hole Army’s latest invasion. With massive battles that sweep across both of the DS screens, Advance Wars: Dual Strike will change the face of war forever. Use the top screen for quick-reference battle intel, or take control in battles that rage across both screens. Command a fleet of fighters high in the skies while troops clash with the enemy on the ground far below. New COs, new Tag-Team battles: Choose from new Commanding Officers, and combine their powers for incredible attacks that can turn the tide of battles. Real-time Combat mode: For a battle with a twist, players lead soldiers into a fast-paced, action-oriented battle against a storm of enemies. Easy-to-use map editor: Just grab a stylus and draw maps right on the touch screen, then send the maps to friends wirelessly. [Nintendo]… Expand"
  },
  {
    "name": "Rayman Legends",
    "details_link": "https://www.metacritic.com/game/playstation-4/rayman-legends",
    "publisher": "Ubisoft",
    "release_date": "Feb 18 2014",
    "developers": [
      "Ubisoft Montpellier"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Stadia",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Platformer",
      "2D",
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/0d1b9de3d1d0c1413aa5170cbd0a9d39-98.jpg",
    "descriptions": "There are several differences and new features in this PS4 version. In this version the textures of the game are more compressed, so you can see that the game’s graphics are clearer and more detailed than before. You will also see that there is no loading time when you enter or exit a level,There are several differences and new features in this PS4 version. In this version the textures of the game are more compressed, so you can see that the game’s graphics are clearer and more detailed than before. You will also see that there is no loading time when you enter or exit a level, which makes the navigation even faster and more enjoyable. Ubisoft has also integrated a new Camera Mode on PS4. By pressing the touchpad of the PS4 joystick, you pause the game and enter this mode, and by moving your fingers on the touchpad, you zoom in and out on the image and drag the image frame; and finally, by pressing the Share button, you can take a photo and share it with everyone. This Camera Mode is a great way to observe in detail all the characters and settings of the game, and a great way of expression to create wacky images with the elements found in the game. On PS4, you can also use the touchpad to scrape the famous Lucky Tickets, then you will really feel like you’re scraping lottery tickets (with the sound of scraping straight from the PS4 joystick). Finally, in this PS4 version, you’ll also find new playable heroes: Assassin Ray (a character inspired by Edward Kenway, the hero of Assassin’s Creed IV: Black Flag), Funky Ray (a delusional character that you can unlock by using Uplay points), and Champion Ray (a character who will be offered to the best players of the community and those who live in this community; this character correspond to the new VIP status, visible in the rankings of online challenges). [Playstation Blog]… Expand"
  },
  {
    "name": "MLB 11: The Show",
    "details_link": "https://www.metacritic.com/game/playstation-3/mlb-11-the-show",
    "publisher": "SCEA",
    "release_date": "Mar  8 2011",
    "developers": [
      "SCEA San Diego Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Baseball",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/5/020afe424e50a6d79cd5f7386283c379-98.jpg",
    "descriptions": "The #1 selling, highest rated baseball franchise is back in MLB® The Show '11. Experience new ways to play The Show with the NEW PURE Analog controls. Team up in ALL NEW CO-OP play, get called up to the Big Leagues with new and improved Road to the Show features and compete for realThe #1 selling, highest rated baseball franchise is back in MLB® The Show '11. Experience new ways to play The Show with the NEW PURE Analog controls. Team up in ALL NEW CO-OP play, get called up to the Big Leagues with new and improved Road to the Show features and compete for real world prizes in MLB® The Show's ALL NEW Challenge of the Week.… Expand"
  },
  {
    "name": "NieR: Automata - Become as Gods Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/nier-automata---become-as-gods-edition",
    "publisher": "Square Enix",
    "release_date": "Jun 26 2018",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "PC",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 9.1,
    "image": "https://static.metacritic.com/images/products/games/5/3eb7cdf2f8fa540522cccd9e9e99d7c8-98.jpg",
    "descriptions": "NieR: Automata is an action RPG set in a post-apocalyptic world overrun by machine lifeforms and abandoned by mankind. As part of an android army created by humans to reclaim the planet, players will fight their way through the mechanical horde using a collective of close-combat weapons andNieR: Automata is an action RPG set in a post-apocalyptic world overrun by machine lifeforms and abandoned by mankind. As part of an android army created by humans to reclaim the planet, players will fight their way through the mechanical horde using a collective of close-combat weapons and ranged attacks.… Expand"
  },
  {
    "name": "Jak and Daxter: The Precursor Legacy",
    "details_link": "https://www.metacritic.com/game/playstation-2/jak-and-daxter-the-precursor-legacy",
    "publisher": "SCEA",
    "release_date": "Dec  3 2001",
    "developers": [
      "Naughty Dog"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/8/e416bb54db9105830f0764326d5720fc-98.jpg",
    "descriptions": "Jak and Daxter are quite a comic duo! Jak's the strong, silent type of hero, while Daxter's the obnoxious comic nut! The adventure takes place across a massive piece of continuous coastline - you can explore freely, with no loading screens and no waiting time.  All characters andJak and Daxter are quite a comic duo! Jak's the strong, silent type of hero, while Daxter's the obnoxious comic nut! The adventure takes place across a massive piece of continuous coastline - you can explore freely, with no loading screens and no waiting time.  All characters and environmental elements exist in real time and have incredibly smart A.I.; you can't ignore or hide from enemies, they will follow you everywhere. (\"Which is supposed to be a good thing?\") [Sony]… Expand"
  },
  {
    "name": "Star Wars Rogue Leader: Rogue Squadron II",
    "details_link": "https://www.metacritic.com/game/gamecube/star-wars-rogue-leader-rogue-squadron-ii",
    "publisher": "LucasArts",
    "release_date": "Nov  9 2001",
    "developers": [
      "Factor 5"
    ],
    "platforms": "GameCube",
    "num_players": "1 Player",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Small Spaceship"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/03229a89cdf8260b0f0dbb5cbbefca90-98.jpg",
    "descriptions": "Think you've got what it takes to lead the elite Rogue Squadron?  Now's your chance to jump into the cockpit of an X-wing and find out.  Join Luke Skywalker and the Star Wars galaxy's most daring pilots as they return to face off against the Empire.  As in the original hit game for N64,Think you've got what it takes to lead the elite Rogue Squadron?  Now's your chance to jump into the cockpit of an X-wing and find out.  Join Luke Skywalker and the Star Wars galaxy's most daring pilots as they return to face off against the Empire.  As in the original hit game for N64, you'll relive favorite Star Wars battles including the perilous Death Star trench run, a daring space attack on a Star Destroyer, and the legendary battle on the ice planet Hoth.  Aerial conflict takes place in a variety of craft such as the legendary X-wing, A-wing, and B-wing.  Rogue Leader immerses players in an intense action arcade experience.… Expand"
  },
  {
    "name": "Microsoft Flight Simulator",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/microsoft-flight-simulator",
    "publisher": "Microsoft Game Studios",
    "release_date": "Jul 27 2021",
    "developers": [
      "Asobo Studio"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Simulation",
      "Flight",
      "Civilian"
    ],
    "meta_score": 90,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/1cc2e1878b4f5e9252f9f3b740e99125-98.jpg",
    "descriptions": "From light planes to wide-body jets, fly highly detailed and accurate aircraft in the next generation of Microsoft Flight Simulator. Test your piloting skills against the challenges of night flying, real-time atmospheric simulation and live weather in a dynamic and living world."
  },
  {
    "name": "Bastion",
    "details_link": "https://www.metacritic.com/game/switch/bastion",
    "publisher": "Supergiant Games",
    "release_date": "Sep 13 2018",
    "developers": [
      "Supergiant Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Xbox 360",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/b7d5c23a22bc842bdcb97401649856a8-98.jpg",
    "descriptions": "Bastion is an original action role-playing game featuring a reactive narrator who marks your every move, lush hand-painted 2D artwork, and tight responsive gameplay that rewards playing with finesse. The game is designed to be simple to pick up and start playing, while offering a lot of richBastion is an original action role-playing game featuring a reactive narrator who marks your every move, lush hand-painted 2D artwork, and tight responsive gameplay that rewards playing with finesse. The game is designed to be simple to pick up and start playing, while offering a lot of rich choices around character customization as well as a deep story and gameworld you can lose yourself in.… Expand"
  },
  {
    "name": "Monster Hunter: World",
    "details_link": "https://www.metacritic.com/game/xbox-one/monster-hunter-world",
    "publisher": "Capcom",
    "release_date": "Jan 26 2018",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 90,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/389146338b6fb19854c933c8cf407455-98.jpg",
    "descriptions": "In Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environmentIn Monster Hunter: World you assume the role of a hunter venturing to a new continent where you track down and slay ferocious beasts in heart-pounding battles. This new land and its diverse inhabitants play a critical role in each quest as you strategically use the surrounding environment including terrain, vegetation and wildlife to your advantage in battle or become hindered by the hazards they present. As a hunter, you must use your cunning and expertise to track and maneuver your targets throughout the intense, evolving battles. [Capcom]… Expand"
  },
  {
    "name": "Stephen's Sausage Roll",
    "details_link": "https://www.metacritic.com/game/pc/stephens-sausage-roll",
    "publisher": "increpare",
    "release_date": "Apr 18 2016",
    "developers": [
      "increpare"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Action",
      "General"
    ],
    "meta_score": 90,
    "users_score": 5.5,
    "image": "https://static.metacritic.com/images/products/games/8/f28bf9b7dd8fc14321b104cc64fc664c-98.jpg",
    "descriptions": "The focus of Stephen's Sausage Roll involves nudging sausages around to fully cook them."
  },
  {
    "name": "Velocity 2X",
    "details_link": "https://www.metacritic.com/game/playstation-vita/velocity-2x",
    "publisher": "FuturLab",
    "release_date": "Sep  2 2014",
    "developers": [
      "FuturLab"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PlayStation Vita"
    ],
    "genres": [
      "Shooter",
      "Scrolling",
      "Action",
      "General",
      "Shooter",
      "Scrolling",
      "Shoot-'Em-Up",
      "Top-Down",
      "Vertical"
    ],
    "meta_score": 90,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/5/e4c3f93c1df6ab5fdbf092a4131c4ba8-98.jpg",
    "descriptions": "Velocity 2X features puzzle-platforming action alongside top-down shoot 'em-up gameplay."
  },
  {
    "name": "Burnout Revenge",
    "details_link": "https://www.metacritic.com/game/playstation-2/burnout-revenge",
    "publisher": "Electronic Arts",
    "release_date": "Sep 13 2005",
    "developers": [
      "Criterion Games"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "6  Online",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/1/62d68571115b8b149358ab71367d3655-98.jpg",
    "descriptions": "Burnout Revenge lets gamers rip through rush hour traffic and lay waste to scores of rubbernecking roadhogs in an over-the-top scene of vehicular mayhem. In addition to tricked out new race, crash and road rage modes, Burnout Revenge takes the series' blistering speed and spectacularBurnout Revenge lets gamers rip through rush hour traffic and lay waste to scores of rubbernecking roadhogs in an over-the-top scene of vehicular mayhem. In addition to tricked out new race, crash and road rage modes, Burnout Revenge takes the series' blistering speed and spectacular destruction to dizzying new heights with an all-new Revenge mode, challenging gamers to battle the clock and unleash their frustrations on rush hour traffic. [Electronic Arts]… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 3",
    "details_link": "https://www.metacritic.com/game/pc/tony-hawks-pro-skater-3",
    "publisher": "Activision",
    "release_date": "Mar 28 2002",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Sports",
      "Alternative",
      "Individual",
      "Skateboarding",
      "Skateboarding",
      "Skate / Skateboard"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/6/ffbc36110bc702b20df31eb5fd2bfc26-98.jpg",
    "descriptions": "Featuring eight massive levels filled with people, traffic, and other interactive elements, the game's environments are brought to life with richer graphics and advanced special effects optimized for today's PC video cards.  Smoother life-like animations and significantly improved tricksFeaturing eight massive levels filled with people, traffic, and other interactive elements, the game's environments are brought to life with richer graphics and advanced special effects optimized for today's PC video cards.  Smoother life-like animations and significantly improved tricks capture the style of the world's best skateboarding pros. Further improving on the franchise's intuitive control scheme, the game allows players to perform tricks and combos in some of the world's most popular skate locations including Los Angeles, Canada and Tokyo. The enhanced skate park editor allows gamers to create the ultimate park up to twice the size of parks in Tony Hawk's Pro Skater 2.  The Create-A-Skater features a new female skater model, and the ability to modify almost every aspect of their appearance, from accessories to clothing to hair color. [Activision]… Expand"
  },
  {
    "name": "NBA 2K2",
    "details_link": "https://www.metacritic.com/game/gamecube/nba-2k2",
    "publisher": "Sega",
    "release_date": "Mar 20 2002",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/6/6e637d5916f83ad5632f0e66dfbb9ecf-98.jpg",
    "descriptions": "Prepare to post MVP numbers as you light it up with Rim-Rattling dunks then shut it down with Smothering D. NBA 2K2 brings the skills to elevate your team to the next level and the smarts to keep 'em on top."
  },
  {
    "name": "NCAA Football 2002",
    "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-football-2002",
    "publisher": "EA Sports",
    "release_date": "Jul 23 2001",
    "developers": [
      "EA Sports"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/8/48d95e14f9f3356fc8dcaf19eb08761c-98.jpg",
    "descriptions": "Gamers can select from any of 117 Division 1-A or 27 Division 1-AA teams. Play-by-play and color commentary are provided by ESPN's Brad Nessler, Lee Corso and Kirk Herbstreit.  Brand-new team-specific playbooks emulate actual college plays run by 117 Division 1-A teams.  [EA Sports]"
  },
  {
    "name": "Unreal Tournament",
    "details_link": "https://www.metacritic.com/game/dreamcast/unreal-tournament",
    "publisher": "Infogrames",
    "release_date": "Mar 13 2001",
    "developers": [
      "Secret Level"
    ],
    "platforms": [
      "PlayStation 2",
      "Dreamcast"
    ],
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 90,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/5/3307d42941ce07b8c8e1092462f62d47-98.jpg",
    "descriptions": "From the creators of Unreal comes Unreal Tournament, a competition that tests your reflexes and competitive spirit in deadly arenas. Battle 15 of your friends or customizable bots in over 30 different levels, such as pirate ships, waterfronts, speeding trains, and floating castles.From the creators of Unreal comes Unreal Tournament, a competition that tests your reflexes and competitive spirit in deadly arenas. Battle 15 of your friends or customizable bots in over 30 different levels, such as pirate ships, waterfronts, speeding trains, and floating castles. Multiplayer modes include Capture the Flag, Assault, Domination, and new Deathmatch variations. With enhanced weapons--including the Impact hammer, which squashes your opponent to mush, and the Redeemer, a rocket-powered nuke--expect the body count to be high. … Expand"
  },
  {
    "name": "Deus Ex",
    "details_link": "https://www.metacritic.com/game/pc/deus-ex",
    "publisher": "Eidos Interactive",
    "release_date": "Jun 23 2000",
    "developers": [
      "Ion Storm"
    ],
    "platforms": "PC",
    "num_players": "Up to 16 ",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 90,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/6/0b0d347832eccdd1de8d5f65ccf9ee46-98.jpg",
    "descriptions": "The game that incorporates RPG, action, adventure, and 1st-person shooter genres into a chaotic blend of real-world conspiracies, cliffhangers, and plot twists. A richly simulated world of unparalleled interactivity, engineered to react logically to your every action. The decisions andThe game that incorporates RPG, action, adventure, and 1st-person shooter genres into a chaotic blend of real-world conspiracies, cliffhangers, and plot twists. A richly simulated world of unparalleled interactivity, engineered to react logically to your every action. The decisions and consequences are yours. [Eidos Interactive]… Expand"
  },
  {
    "name": "Donkey Kong 64",
    "details_link": "https://www.metacritic.com/game/nintendo-64/donkey-kong-64",
    "publisher": "Rare Ltd.",
    "release_date": "Oct 31 1999",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/6/6d1421798824b90d8bb007016e05f39a-98.jpg",
    "descriptions": "K. Rool has kidnapped the Kongs! Can Donkey Kong rescue his friends, reclaim the Golden Bananas and save his homeland from certain doom? Take out some Kremlings with Chunky's Pineapple Launcher or Lanky's Trombone. Float through the air using Tiny's Ponytail Twirl. Even rocket to the skyK. Rool has kidnapped the Kongs! Can Donkey Kong rescue his friends, reclaim the Golden Bananas and save his homeland from certain doom? Take out some Kremlings with Chunky's Pineapple Launcher or Lanky's Trombone. Float through the air using Tiny's Ponytail Twirl. Even rocket to the sky with Diddy's Jetbarrel!… Expand"
  },
  {
    "name": "Panzer Dragoon Orta",
    "details_link": "https://www.metacritic.com/game/xbox/panzer-dragoon-orta",
    "publisher": "Sega",
    "release_date": "Jan 12 2003",
    "developers": [
      "Smilebit"
    ],
    "platforms": "Xbox",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Rail"
    ],
    "meta_score": 90,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/7/9187af83002beb1c05bd78e7c0f767c0-98.jpg",
    "descriptions": "The dragon rises to power once again in Panzer Dragoon: Orta. Dragons, creatures that once ruled the skies, are now mankind's only hope against a dark empire. With humanity at war and on the brink of extinction, it's up to you and your dragon to take to the skies and assist in the rebellion.The dragon rises to power once again in Panzer Dragoon: Orta. Dragons, creatures that once ruled the skies, are now mankind's only hope against a dark empire. With humanity at war and on the brink of extinction, it's up to you and your dragon to take to the skies and assist in the rebellion. On the back of your flying friend, you'll become part of intense chases and battles with powerful enemies. In order to defeat the evil empire, you must master multiple weapons, dragon powers, and advanced attacks. … Expand"
  },
  {
    "name": "Portal: Still Alive",
    "details_link": "https://www.metacritic.com/game/xbox-360/portal-still-alive",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 22 2008",
    "developers": [
      "Valve Software"
    ],
    "platforms": "Xbox 360",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/3/e634bc1e87c54cca6e53267efbb62365-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Portal: Still Alive features the full award-winning Portal single player game from Valve, plus a new challenge mode. Designed to change the way you approach, manipulate, and surmise the possibilities in any given environment, Portal has earned over 70 industry honors for[Xbox Live Arcade]  Portal: Still Alive features the full award-winning Portal single player game from Valve, plus a new challenge mode. Designed to change the way you approach, manipulate, and surmise the possibilities in any given environment, Portal has earned over 70 industry honors for its innovative gameplay, with more than 30 \"Game of the Year\" awards. Break the laws of physics using \"portal\" technology to solve puzzles and survive in this darkly comic story weaving adventure with brain-bending puzzles. Experience the first first-person puzzle-action-adventure game with hours of single player gaming. The game includes fourteen brand new bonus puzzles to challenge even the most skilled test subjects. And, get a glimpse into the making of Portal: Still Alive with commentary from the developers. [Valve]… Expand"
  },
  {
    "name": "Half-Life 2: Episode Two",
    "details_link": "https://www.metacritic.com/game/pc/half-life-2-episode-two",
    "publisher": "Valve Software",
    "release_date": "Oct 10 2007",
    "developers": [
      "Valve Software"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 9.2,
    "image": "https://static.metacritic.com/images/products/games/3/77c63b381ce82d9e125e09de3193ff66-98.jpg",
    "descriptions": "Half-Life 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life adventure. As Dr. Gordon Freeman, you were last seen exiting City 17 with Alyx Vance as the Citadel erupted amidst a storm of unknown proportions. InHalf-Life 2: Episode Two is the second in a trilogy of new games created by Valve that extends the award-winning and best-selling Half-Life adventure. As Dr. Gordon Freeman, you were last seen exiting City 17 with Alyx Vance as the Citadel erupted amidst a storm of unknown proportions. In Episode Two, you must battle and race against Combine forces as you traverse the White Forest to deliver a crucial information packet stolen from the Citadel to an enclave of fellow resistance scientists. Episode Two extends the award-winning Half-Life gameplay with unique weapons, vehicles, and newly-spawned creatures. [Valve]… Expand"
  },
  {
    "name": "Fez",
    "details_link": "https://www.metacritic.com/game/playstation-4/fez",
    "publisher": "Polytron Corp.",
    "release_date": "Mar 25 2014",
    "developers": [
      "Polytron Corp.",
      "BlitWorks"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Switch",
      "Xbox 360",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/8/018c842f7529a75fa3d579f37abf3b71-98.jpg",
    "descriptions": "Gomez is a 2D man on a voyage of discovery into the mysterious 3rd dimension. Change your perspective and look at the world in a different way."
  },
  {
    "name": "Braid",
    "details_link": "https://www.metacritic.com/game/pc/braid",
    "publisher": "MumboJumbo",
    "release_date": "Apr 10 2009",
    "developers": [
      "Number None Inc.",
      "Knockout Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/2/4c434948b157b6eb36a58fff456be011-98.jpg",
    "descriptions": "Braid is a puzzle-platformer, drawn in a painterly style, where the player manipulates the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a different power to affectBraid is a puzzle-platformer, drawn in a painterly style, where the player manipulates the flow of time in strange and unusual ways. From a house in the city, journey to a series of worlds and solve puzzles to rescue an abducted princess. In each world, you have a different power to affect the way time behaves, and it is time's strangeness that creates the puzzles. The time behaviors include: the ability to rewind, objects that are immune to being rewound, time that is tied to space, parallel realities, time dilation, and perhaps more. Braid treats your time and attention as precious; there is no filler in this game. Every puzzle shows you something new and interesting about the game world. Braid is a 2-D platform game where you can never die and never lose.… Expand"
  },
  {
    "name": "The Chronicles of Riddick: Escape From Butcher Bay - Developer's Cut",
    "details_link": "https://www.metacritic.com/game/pc/the-chronicles-of-riddick-escape-from-butcher-bay---developers-cut",
    "publisher": "VU Games",
    "release_date": "Dec  8 2004",
    "developers": [
      "Starbreeze"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 90,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/de11ad1978515aa9147cfb6ae55ba90d-98.jpg",
    "descriptions": "Set before the events of both Universal Pictures' \"The Chronicles of Riddick,\" starring Vin Diesel, and the 2000 cult classic \"Pitch Black,\" which first introduced Diesel as enigmatic anti-hero Riddick, the game tells the story of Riddick's dramatic escape from the previously inescapableSet before the events of both Universal Pictures' \"The Chronicles of Riddick,\" starring Vin Diesel, and the 2000 cult classic \"Pitch Black,\" which first introduced Diesel as enigmatic anti-hero Riddick, the game tells the story of Riddick's dramatic escape from the previously inescapable triple max security slam Butcher Bay, home to the most violent prisoners in the galaxy. The Chronicles Riddick: Escape From Butcher Bay will blend action and stealth elements, as players navigate Riddick through the harsh environments of the slam - dank tunnels, dimly lit corridors, and other hazardous areas filled with guards, savage inmates and deadly creatures that prowl the darkness. [Vivendi Universal]… Expand"
  },
  {
    "name": "Shin Megami Tensei: Persona 4",
    "details_link": "https://www.metacritic.com/game/playstation-2/shin-megami-tensei-persona-4",
    "publisher": "Atlus Co.",
    "release_date": "Dec  8 2008",
    "developers": [
      "Atlus Co."
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/0/09e8b7be7da58315192b057ce47c583c-98.jpg",
    "descriptions": "[Metacritic's 2008 PS2 Game of the Year]  Shortly after an urban youth begins a year-long stay in the countryside town of Inaba, the rural town's peace is shattered by a horrific murder that leaves no clues or suspects. As the lone incident develops into a series of bizarre crimes, he[Metacritic's 2008 PS2 Game of the Year]  Shortly after an urban youth begins a year-long stay in the countryside town of Inaba, the rural town's peace is shattered by a horrific murder that leaves no clues or suspects. As the lone incident develops into a series of bizarre crimes, he discovers that only he and his friends have the power to solve the baffling case, bring those responsible to justice, and restore harmony to his new home. Balance your double life – Beyond intense battles, Persona fusion, and new weapon creation exists a normal high school life of friends, classes, and part-time jobs. The way you manage and integrate your activities within each day will determine how you progress through the game. Unprecedented team control – With a greater emphasis on developing bonds in the fight to solve the mysterious murders, strong friendships are key to your success. Directly control teammates in battle, earn greater party support for combat, and master individual Social Links to unlock your party's true potential. Find the true ending – 60+ hours of gameplay thrusts you into a deep mystery where midnight television leads to serial killings. You must investigate murders, rescue those who can be rescued, and unmask the culprit behind it all—or risk being forever shrouded in the fog of doubt. [Atlus USA]… Expand"
  },
  {
    "name": "Hollow Knight",
    "details_link": "https://www.metacritic.com/game/switch/hollow-knight",
    "publisher": "Team Cherry",
    "release_date": "Jun 12 2018",
    "developers": [
      "Team Cherry"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Platformer",
      "",
      "Metroidvania"
    ],
    "meta_score": 90,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/0/2fc23c77021a84e4ee938a346a077e10-98.jpg",
    "descriptions": "Hollow Knight is a 2D action-adventure game with an emphasis on traditional 2D animation and skillful gameplay. Journey to Hallownest, a vast and ancient underground kingdom inhabited by a bizarre collection of insects and monsters. Players will forge their own path as they explore ruinedHollow Knight is a 2D action-adventure game with an emphasis on traditional 2D animation and skillful gameplay. Journey to Hallownest, a vast and ancient underground kingdom inhabited by a bizarre collection of insects and monsters. Players will forge their own path as they explore ruined cities, forests of fungus, temples of bone and other fantastic lands, all on their way to uncovering an ancient mystery.… Expand"
  },
  {
    "name": "MLB 09: The Show",
    "details_link": "https://www.metacritic.com/game/playstation-3/mlb-09-the-show",
    "publisher": "SCEA",
    "release_date": "Mar  3 2009",
    "developers": [
      "SCEA San Diego Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3"
    ],
    "num_players": "2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Baseball",
      "Sim",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/8/a910fc1a7d8b52442c3bd0b05daff733-98.jpg",
    "descriptions": "Road to the Show 3.0. Now includes interactive training, new settings, a new steal/ lead-off system, presentations and coach interactions. Interactive training will consist of a set of mini-games designed to improve a player’s ability and performance in various areas of baseball. FranchiseRoad to the Show 3.0. Now includes interactive training, new settings, a new steal/ lead-off system, presentations and coach interactions. Interactive training will consist of a set of mini-games designed to improve a player’s ability and performance in various areas of baseball. Franchise Mode 2.0. Improvements include the long awaited 40-man roster! The latest Franchise Mode improvements will also offer Salary Arbitration, Waiver Transactions and September call-ups. Training/Practice Drills. In MLB 09 users will have the ability to choose from a number of different Training/Practice drills. The drills will be of various concentrations of the game. These drills are a perfect way to polish and improve your baseball skills in The Show. Details & Subtleties. Details and subtleties play a huge role in legitimizing a game and helping you lose yourself in the suspension of disbelief. MLB 09 The Show sinks it's teeth into the details with realistic stadiums and signage, wear and tear on field, dusk to night lighting transitions, stadium Jumbotron animations and even crowd atmosphere - reaching up for foul balls out of play and home runs in addition to crowd rivalries and weather appropriate clothing. [SCEA]… Expand"
  },
  {
    "name": "Blast Corps",
    "details_link": "https://www.metacritic.com/game/nintendo-64/blast-corps",
    "publisher": "Nintendo",
    "release_date": "Feb 28 1997",
    "developers": [
      "Rare Ltd."
    ],
    "platforms": "Nintendo 64",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/2/2eb1112a52b94f4ff908e2d49d86bfdd-98.jpg",
    "descriptions": "A pair of defective nuclear missiles, en route to a safe detonation site, has begun to leak. Badly damaged, the carrier automatically locks onto the most direct route. Clear a path to help the carrier arrive safely. Tons of vehicles are at your disposal. Leave nothing standing or theA pair of defective nuclear missiles, en route to a safe detonation site, has begun to leak. Badly damaged, the carrier automatically locks onto the most direct route. Clear a path to help the carrier arrive safely. Tons of vehicles are at your disposal. Leave nothing standing or the adventure will end in an earth-shattering explosion! Find the hidden technicians to ensure a safe detonation. Strap on your seat belt, it's going to be a bumpy ride. … Expand"
  },
  {
    "name": "Shovel Knight",
    "details_link": "https://www.metacritic.com/game/3ds/shovel-knight",
    "publisher": "Yacht Club Games",
    "release_date": "Jun 26 2014",
    "developers": [
      "Yacht Club Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Wii U",
      "Xbox One",
      "3DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Platformer",
      "2D",
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/7399ade23b51461b20e89ebbc38f92f3-98.jpg",
    "descriptions": "Shovel Knight is a sweeping classic action adventure game with memorable characters and an 8-bit retro aesthetic created by Yacht Club Games. You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this valley with two goals: to defeat the evilShovel Knight is a sweeping classic action adventure game with memorable characters and an 8-bit retro aesthetic created by Yacht Club Games. You play as the eponymous Shovel Knight, a small knight with a huge quest. Shovel Knight has come to this valley with two goals: to defeat the evil Enchantress and save his lost beloved. He wields a ShovelBlade; a multipurpose weapon whose techniques have now been lost to the ages. Always honest and helpful, Shovel Knight is a shining example of the code of Shovelry: Slash Mercilessly and Dig Tirelessly. However, between Shovel Knight and his beloved stands a cadre of villainous knights. These terrible foes, known as The Order of No Quarter, have been dispatched to prevent Shovel Knight from reaching the Enchantress at any cost.… Expand"
  },
  {
    "name": "Ori and the Will of the Wisps",
    "details_link": "https://www.metacritic.com/game/xbox-one/ori-and-the-will-of-the-wisps",
    "publisher": "Microsoft Game Studios",
    "release_date": "Mar 11 2020",
    "developers": [
      "Moon Studios"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox Series X",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 90,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/9/219ace008faa25de2f1fa5c37a0d6486-98.jpg",
    "descriptions": "The little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and theThe little spirit Ori is no stranger to peril, but when a fateful flight puts the owlet Ku in harm’s way, it will take more than bravery to bring a family back together, heal a broken land, and discover Ori’s true destiny. From the creators of the acclaimed action-platformer Ori and the Blind Forest comes the highly anticipated sequel. Embark on an all-new adventure in a vast world filled with new friends and foes that come to life in stunning, hand-painted artwork. Set to a fully orchestrated original score, Ori and the Will of the Wisps continues the Moon Studios tradition of tightly crafted platforming action and deeply emotional storytelling.… Expand"
  },
  {
    "name": "MVP Baseball 2004",
    "details_link": "https://www.metacritic.com/game/xbox/mvp-baseball-2004",
    "publisher": "EA Sports",
    "release_date": "Mar  9 2004",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Sim"
    ],
    "meta_score": 90,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/0/e5e31c4a3fc21bca7a80f24d9122b539-98.jpg",
    "descriptions": "Step up to the plate with MVP Baseball 2004.  The fundamentals of hitting, pitching, fielding, and base-running have been reproduced realistically to give you complete control over every aspect of the game.  From swinging for the fences or protecting the plate when you have a two-strikeStep up to the plate with MVP Baseball 2004.  The fundamentals of hitting, pitching, fielding, and base-running have been reproduced realistically to give you complete control over every aspect of the game.  From swinging for the fences or protecting the plate when you have a two-strike count, the all-new batting model provides unprecedented command of each type of swing in every situation.  With solid gameplay and many additional features such as Pitching Challenge and Dynasty Mode, MVP Baseball 2004 allows you to experience the game like never before.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 4",
    "details_link": "https://www.metacritic.com/game/xbox/tony-hawks-pro-skater-4",
    "publisher": "Activision",
    "release_date": "Oct 23 2002",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": "Xbox",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 90,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/0/3530c48a3a767db77384e26192591d3f-98.jpg",
    "descriptions": "Drop into the ultimate challenge.  In the next chapter in the Tony Hawk series, pros challenge you to make your mark in huge free-roaming levels, taking on 190 progressively harder goals with no time limits to hold you back.  Decide when you're ready to take on your Pro Challenge and moveDrop into the ultimate challenge.  In the next chapter in the Tony Hawk series, pros challenge you to make your mark in huge free-roaming levels, taking on 190 progressively harder goals with no time limits to hold you back.  Decide when you're ready to take on your Pro Challenge and move into the pro ranks, where it's a whole new game.  Build your skills, perform all-new tricks, play up to eight players online, and show that you've got what it takes to go Pro.  … Expand"
  },
  {
    "name": "Sid Meier's Civilization III",
    "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-iii",
    "publisher": "Infogrames",
    "release_date": "Oct 30 2001",
    "developers": [
      "Firaxis Games"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Historic",
      "Historic",
      "4X"
    ],
    "meta_score": 90,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/d9a4e1db1a821699c6b62169057f9974-98.jpg",
    "descriptions": "In Civilization III, you'll find new pathways to explore and strategies to employ, greatly expanded diplomacy, more powerful combat, a new trade system, new technologies, more powerful tools to build and manage your empire, and the most detailed and beautiful art, animations and sound everIn Civilization III, you'll find new pathways to explore and strategies to employ, greatly expanded diplomacy, more powerful combat, a new trade system, new technologies, more powerful tools to build and manage your empire, and the most detailed and beautiful art, animations and sound ever found in the genre. [Infogrames]… Expand"
  }
]