[
  {
    "name": "Monster Hunter: World - Iceborne",
    "details_link": "https://www.metacritic.com/game/playstation-4/monster-hunter-world---iceborne",
    "publisher": "Capcom",
    "release_date": "Sep  6 2019",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/a620e8f4249dde4c64ec0ff2828672f6-98.jpg",
    "descriptions": "Monster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivalsMonster Hunter World: Iceborne is the highly anticipated massive expansion to Monster Hunter: World, the best-selling Capcom title of all time with more than 12 million units shipped worldwide adding to the series total of more than 53 million units to date. This gargantuan follow-up rivals the gameplay volume from the original release and features a new icy setting, storyline, monsters, gameplay options, and more.\r The game's all-new story picks up after Monster Hunter: World and whisks hunters away to the newly discovered chilly locale that, once fully explored, becomes the largest region in World so far. The new locale is home to several new and returning monsters ready to challenge hunters throughout their expeditions and raises the stakes with the added higher difficulty Master Rank. Iceborne continues the skill-based progression and robust crafting system found in World and expands that with several new gameplay features that broaden the player's combat repertoire. All this leads to the ultimate hunter test against the mysterious new flagship monster, Velkhana.… Expand"
  },
  {
    "name": "Plants vs. Zombies",
    "details_link": "https://www.metacritic.com/game/xbox-360/plants-vs-zombies",
    "publisher": "PopCap",
    "release_date": "Sep  8 2010",
    "developers": [
      "PopCap"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox 360"
    ],
    "genres": [
      "Strategy",
      "Real-Time",
      "General",
      "General",
      "Fantasy",
      "Defense"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/5/d6dd2d924b94b201cf0083177baea084-98.jpg",
    "descriptions": "Zombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like aZombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like a setting sun, creeping fog and a swimming pool add to the challenge, and with five game modes to dig into, the fun never dies!… Expand"
  },
  {
    "name": "Deathloop",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/deathloop",
    "publisher": "Bethesda Softworks",
    "release_date": "Sep 20 2022",
    "developers": [
      "Arkane Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Xbox Series X"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/5/23c3dd8a2ce855f1fd4caaaa3e79a280-98.jpg",
    "descriptions": "If at first you don't succeed Die, Die AgainFrom the team at Arkane Lyon comes an innovative take on first-person action. \"DEATHLOOP\" transports players to the lawless island of Blackreef in an eternal struggle between two extraordinary assassins. Explore stunning environments andIf at first you don't succeed Die, Die AgainFrom the team at Arkane Lyon comes an innovative take on first-person action. \"DEATHLOOP\" transports players to the lawless island of Blackreef in an eternal struggle between two extraordinary assassins. Explore stunning environments and meticulously designed levels in an immersive gameplay experience that lets you approach every situation any way you like. Hunt down targets all over the island in an effort to put an end to the cycle once and for all, and remember, if at first you don't succeed die, die again.… Expand"
  },
  {
    "name": "Dead Cells",
    "details_link": "https://www.metacritic.com/game/switch/dead-cells",
    "publisher": "Motion Twin",
    "release_date": "Aug  7 2018",
    "developers": [
      "Motion Twin"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/b02ca05bec07e5fa45eee36942fb6d22-98.jpg",
    "descriptions": "Dead Cells is a rogue-lite, metroidvania action-platformer. You'll explore a sprawling, everchanging castle... assuming you're able to fight your way past its keepers in 2D souls-lite combat. No checkpoints. Kill, die, learn, repeat. RogueVania: The progressive exploration of anDead Cells is a rogue-lite, metroidvania action-platformer. You'll explore a sprawling, everchanging castle... assuming you're able to fight your way past its keepers in 2D souls-lite combat. No checkpoints. Kill, die, learn, repeat. RogueVania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath. 2D Souls-lite Action: Tough but fair combat, more than fifty weapons and spells with unique gameplay, and of course, the emergency panic roll to get you out of trouble. Nonlinear progression: Sewers, Ossuary or Remparts? Once unlocked, special permanent abilities allow you to access new paths to reach your objective. Opt for the path that suits your current build, your play style or just your mood. Exploration: Secret rooms, hidden passages, charming landscapes. Take a moment to stroll the towers and breath in that fresh sea mist infused air...\r … Expand"
  },
  {
    "name": "Dark Souls III",
    "details_link": "https://www.metacritic.com/game/pc/dark-souls-iii",
    "publisher": "Bandai Namco Games",
    "release_date": "Apr 11 2016",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 6 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/5/6ae465c0460b6b9f071e9a34b3530398-98.jpg",
    "descriptions": "Developed by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge andDeveloped by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge and deep RPG gameplay as they search for a way to survive the coming apocalypse.… Expand"
  },
  {
    "name": "Rez HD",
    "details_link": "https://www.metacritic.com/game/xbox-360/rez-hd",
    "publisher": "Microsoft Game Studios",
    "release_date": "Jan 30 2008",
    "developers": [
      "HexaDrive"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Rail",
      "Rail"
    ],
    "meta_score": 89,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/1/42c216dce113f5802c2dad91916c8419-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Set in a cyberworld, the legendary fast-paced action-shooter Rez HD, created by Tetsuya Mizuguchi, provides the ultimate audiovisual experience as the player targets the enemies and hacks the system while creating their own beats. Rez opens your senses ... let's go to[Xbox Live Arcade]  Set in a cyberworld, the legendary fast-paced action-shooter Rez HD, created by Tetsuya Mizuguchi, provides the ultimate audiovisual experience as the player targets the enemies and hacks the system while creating their own beats. Rez opens your senses ... let's go to synaesthesia was the watchword when Rez released in 2001 to become a fan favorite. The dynamic, total integration of visual presentation, sound and player input provides the ultimate audiovisual experience. Old-school vector style graphics, sensory response, and beat synchronization sets the title apart and is recreated in this port for Xbox LIVE Arcade in high-definition and 5.1 surround sound. Rez consists of five different levels, each with its own unique visual theme and style, musical track and a boss battle at the end. The game also features several different modes and lots of unlockable elements, giving it plenty of replay value. Play through the five areas in regular or Score Attack mode. Go to the Beyond mode and try Direct Assault, Lost Mode, the free play Trance Mission, or take on all the bosses consecutively in Boss Rush. Feel the rhythm: To further enhance the Rez experience, artists including Coldcut, Adam Freeland, Joujouka, Ken Ishii and Keiichi Sugiyama (SEGA's Wave Master) contributed tracks to the game. [Q Entertainment]… Expand"
  },
  {
    "name": "NBA Street V3",
    "details_link": "https://www.metacritic.com/game/playstation-2/nba-street-v3",
    "publisher": "EA Sports Big",
    "release_date": "Feb  8 2005",
    "developers": [
      "EA Canada"
    ],
    "platforms": "PlayStation 2",
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/3/d7fb16ebd5c9308d7bd792459ef7382f-98.jpg",
    "descriptions": "The third chapter in the multi-platinum-selling NBA Street series rises above the rim and expands on the customization and variety of game modes and gameplay. Gamers can build their reputation as they create the future of street basketball with all-new jaw-dropping, ankle-breaking,The third chapter in the multi-platinum-selling NBA Street series rises above the rim and expands on the customization and variety of game modes and gameplay. Gamers can build their reputation as they create the future of street basketball with all-new jaw-dropping, ankle-breaking, rim-shaking moves in visually stimulating environments, from favorite courts like \"The Cage\" and \"Rucker Park\" to the next generation of streetball sanctuaries, like \"Venice Beach\". It all adds up to give V3 a revolutionary style all its own. Featuring NBA legends, today's top stars, and original characters from past editions, NBA Street V3 reaches new heights by making over-the-top, larger-than-life moves even bigger in this action-packed, arcade-style game. Customize your baller, build courts from the ground up, throw one down in an all-new dunk contest and go online to put your reputation to the test. [Electronic Arts]… Expand"
  },
  {
    "name": "Demon's Souls",
    "details_link": "https://www.metacritic.com/game/playstation-3/demons-souls",
    "publisher": "Atlus",
    "release_date": "Oct  6 2009",
    "developers": [
      "From Software"
    ],
    "platforms": "PlayStation 3",
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/bb93ef0dcc85a2f3e71a497242879724-98.jpg",
    "descriptions": "Demon's Souls promises to be the hardcore action RPG experience PS3 owners have been waiting for since the platform's launch. Revolutionary online features support your adventure like never before, presenting seamless interconnectivity that serves in every instance to enhance theDemon's Souls promises to be the hardcore action RPG experience PS3 owners have been waiting for since the platform's launch. Revolutionary online features support your adventure like never before, presenting seamless interconnectivity that serves in every instance to enhance the single-player game. Team up with two other players in simultaneous cooperative play, working together to topple some of the game's colossal bosses, or force your way into the games of skilled players and challenge them to PvP battle.  Leave hints and clues for those who will follow in your footsteps; either intentionally or through your own inadvertent demise, your bloodstains will allow your successors to view a replay of your death, hinting at how to avoid your gruesome fate. [Atlus USA]… Expand"
  },
  {
    "name": "Pillars of Eternity",
    "details_link": "https://www.metacritic.com/game/pc/pillars-of-eternity",
    "publisher": "Paradox Interactive",
    "release_date": "Mar 26 2015",
    "developers": [
      "Obsidian Entertainment"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "PC-style RPG",
      "Third-Person",
      "PC-style RPG",
      "Role-Playing",
      "Western-Style"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/7/d2b7b0524b11a97fed7ee051ac34a046-98.jpg",
    "descriptions": "Eternity aims to recapture the magic, imagination, depth, and nostalgia of classic RPG's that Obsidian enjoyed making - and playing. Eternity takes the central hero, memorable companions and the epic exploration of Baldur’s Gate, adds in the fun, intense combat and dungeon diving of IcewindEternity aims to recapture the magic, imagination, depth, and nostalgia of classic RPG's that Obsidian enjoyed making - and playing. Eternity takes the central hero, memorable companions and the epic exploration of Baldur’s Gate, adds in the fun, intense combat and dungeon diving of Icewind Dale, and ties it all together with the emotional writing and mature thematic exploration of Planescape: Torment. Choose to play as one of the six playable races: Human, Aumaua, Dwarf, Elf, Godlike, and Orlan. Whether you're playing a stout Dwarf, a towering Aumaua, or one of the otherworldly Godlike, Eternity's plethora of playable races scratch every role-playing itch you may have and allow for deep character customization. [Obsidian]… Expand"
  },
  {
    "name": "The Elder Scrolls III: Morrowind",
    "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-iii-morrowind",
    "publisher": "Bethesda Softworks",
    "release_date": "May  1 2002",
    "developers": [
      "Bethesda Softworks"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "Western-Style"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/0/04fe3548574c9162a46ac4ff5f428862-98.jpg",
    "descriptions": "An epic, open-ended single-player game where you create and play any kind of character you can imagine. Be the noble hero embarking on an epic quest, or an insidious thief rising to leadership of his guild. Be a malevolent sorcerer developing the ultimate spell of destruction, or a reverentAn epic, open-ended single-player game where you create and play any kind of character you can imagine. Be the noble hero embarking on an epic quest, or an insidious thief rising to leadership of his guild. Be a malevolent sorcerer developing the ultimate spell of destruction, or a reverent healer searching for the cure to a plague. Your actions define your character, and your gameplay changes and evolves in response to your actions. Confront the assassins' guild, and they take out a contract on you. Impress them, and they try to recruit you instead. No two sagas are the same in the world of Morrowind. [Bethesda Softworks]… Expand"
  },
  {
    "name": "Castlevania: Symphony of the Night",
    "details_link": "https://www.metacritic.com/game/xbox-360/castlevania-symphony-of-the-night",
    "publisher": "Konami",
    "release_date": "Mar 21 2007",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Role-Playing",
      "Platformer",
      "Platformer",
      "Action RPG",
      "2D",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/4/8199028c4f57dddaf82461df12833dbb-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Dracula's castle has risen again and it's up to the mysterious Alucard to face Dracula and save the world from his nocturnal embrace. Uncover the riddle behind why the castle has returned and what became of the world's last hero, Richer Belmont. Upgrade your weapons,[Xbox Live Arcade]  Dracula's castle has risen again and it's up to the mysterious Alucard to face Dracula and save the world from his nocturnal embrace. Uncover the riddle behind why the castle has returned and what became of the world's last hero, Richer Belmont. Upgrade your weapons, armor, and stats by defeating the castle's defenders. Encounter allies and enemies throughout the castle who help you uncover the real story of both Castlevania and Alucard's personal demons. With non-linear gameplay and multiple endings, its up to you to guide Alucard through the castle as you see fit. Achievements, to challenge players to completely conquer Dracula's castle. Leaderboards, so you can vie for position with other players to become the undisputed worldwide master of Symphony of the Night. Enhanced background visuals that take advantage of the HD graphics capabilities of the Xbox 360. All of the original PlayStation music, sprites, and gameplay content. Ported controls let you experience every battle and boss fight as originally envisioned. Gamer themes and picture packs coming soon to let you customize your Xbox 360 in the Castlevania style. [Konami]… Expand"
  },
  {
    "name": "Into the Breach",
    "details_link": "https://www.metacritic.com/game/switch/into-the-breach",
    "publisher": "Subset Games",
    "release_date": "Aug 28 2018",
    "developers": [
      "Subset Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Stadia",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 89,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/8/ba48a4d1b55c42a4fcc5c9ce518833b9-98.jpg",
    "descriptions": "Control powerful mechs from the future to defeat an alien threat. Each attempt to save the world presents a new randomly generated challenge in this turn-based strategy game."
  },
  {
    "name": "F1 2019",
    "details_link": "https://www.metacritic.com/game/xbox-one/f1-2019",
    "publisher": "Codemasters",
    "release_date": "Jun 25 2019",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "Up to 20 ",
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 89,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/2/87ca7080375e36227e25293ef45aea09-98.jpg",
    "descriptions": "The official videogame of the 2019 FIA Formula One World Championship, F1 2019 challenges you to Defeat your Rivals in the most ambitious F1 game in Codemasters' history. The game is released a full two months earlier during the Formula 1 myWorld Grosser Preis von Osterreich 2019 weekendThe official videogame of the 2019 FIA Formula One World Championship, F1 2019 challenges you to Defeat your Rivals in the most ambitious F1 game in Codemasters' history. The game is released a full two months earlier during the Formula 1 myWorld Grosser Preis von Osterreich 2019 weekend and, unlike previous iterations, ahead of the British, German and Hungarian races.\r F1 2019 features all the official teams, drivers and all 21 circuits from the 2019 season. This year sees the inclusion of F2 with players being able to complete the 2018 season with the likes of George Russell, Lando Norris and Alexander Albon. The 2019 F2 season content will be made available as a free digital update during the season.\r Having established itself as one of the highest rated racing franchises of all time, F1 2019 builds on the success of previous iterations and delivers an experience that rivals the quality and production values of its real-life race counterpart. With greater emphasis on graphical fidelity, the environments have been significantly enhanced, and the tracks come to life like never before. Night races have been completely overhauled creating vastly improved levels of realism and the upgraded F1 broadcast sound and visuals add further realism to all aspects of the race weekend.… Expand"
  },
  {
    "name": "It Takes Two",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/it-takes-two",
    "publisher": "Electronic Arts",
    "release_date": "Mar 26 2021",
    "developers": [
      "Hazelight"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/5/493910838aade8bb8e70ef915409d9bf-98.jpg",
    "descriptions": "From Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the criticallyFrom Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the critically acclaimed A Way Out and Brothers: A Tale of Two Sons.\r Something out of the ordinary\rBring your favorite co-op partner and together step into the shoes of May and Cody. As the couple is going through a divorce, through unknown means their minds are transported into two dolls which their daughter, Rose, made to represent them. Now they must reluctantly find a way to get back into their bodies, a quest which takes them through the most wild, unexpected and fantastical journey imaginable.… Expand"
  },
  {
    "name": "Fable II",
    "details_link": "https://www.metacritic.com/game/xbox-360/fable-ii",
    "publisher": "Microsoft Game Studios",
    "release_date": "Oct 21 2008",
    "developers": [
      "Lionhead Studios"
    ],
    "platforms": "Xbox 360",
    "num_players": "2 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/2/aa131bbebbb43cd29a64464e48190378-98.jpg",
    "descriptions": "Set 500 years after the original, Fable II provides gamers with an epic story and innovative real-time gameplay, including a massive amount of freedom and choice to explore a vast collection of dungeons, catacombs and caves in the world of Albion. Fable II expands upon the scope and depth ofSet 500 years after the original, Fable II provides gamers with an epic story and innovative real-time gameplay, including a massive amount of freedom and choice to explore a vast collection of dungeons, catacombs and caves in the world of Albion. Fable II expands upon the scope and depth of the Xbox classic by adding incredible new features and creating a wider, more complex kingdom of limitless choices and consequences. Players have the option to play as a man or woman, get married, have children, and live a life of their own design. Revisit the sprawling world of Albion more than 500 years after the events of the original Fable, where you are free to explore the landscape and openly roam the countryside. For the right price every house, hut, dungeon and castle is for sale. Players can witness how the world grows and changes in response to their decisions in incredible and unique ways as they rediscover Albion as if for the first time. Fable II pioneers a new combat system designed to allow players to truly master hand weapons such as swords and maces, ranged combat weapons such as cross-bows and guns, and an entirely new magic system. These three disciplines, while very accessible, are also amazingly deep, and allow players to mix combat styles and become everything from master swordsman to skilled ranger to evil magic welder, utilizing a single button on the Xbox 360 controller. [Lionhead]… Expand"
  },
  {
    "name": "Rez Infinite",
    "details_link": "https://www.metacritic.com/game/playstation-4/rez-infinite",
    "publisher": "Enhance Games",
    "release_date": "Oct 13 2016",
    "developers": [
      "Q Entertainment",
      "Monstars Inc.",
      "Enhance Games",
      "Resonair"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "PlayStation 4"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Rail"
    ],
    "meta_score": 89,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/0/0067fb9d1735f7203cacee646bda856a-98.jpg",
    "descriptions": "To resolve the world's rising crime rates, a new system called Project-K was created. However, Eden, the core of Project-K, has fallen into a vegetative state. Now it's up to you, a hacker, to travel through a cyberspace filled with firewalls, viruses, and other obstacles, and jump-start theTo resolve the world's rising crime rates, a new system called Project-K was created. However, Eden, the core of Project-K, has fallen into a vegetative state. Now it's up to you, a hacker, to travel through a cyberspace filled with firewalls, viruses, and other obstacles, and jump-start the system's artificial intelligence. Scattered throughout the levels are evolution spheres, which let you transform into more powerful humanoid forms. The game features a pounding soundtrack and unique vector worlds.… Expand"
  },
  {
    "name": "Rocksmith 2014 Edition",
    "details_link": "https://www.metacritic.com/game/pc/rocksmith-2014-edition",
    "publisher": "Ubisoft",
    "release_date": "Oct 22 2013",
    "developers": [
      "Ubisoft"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 89,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/ad0042007e0f80138898e38720883bd5-98.jpg",
    "descriptions": "Rocksmith 2014 Edition lets players plug in any electric guitar or bass directly into your system and begin learning guitar with the Rocksmith Method."
  },
  {
    "name": "NHL 2K3",
    "details_link": "https://www.metacritic.com/game/playstation-2/nhl-2k3",
    "publisher": "Sega",
    "release_date": "Nov 10 2002",
    "developers": [
      "Treyarch"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/7/c2cf07b65eed38d457795208d5f5eb11-98.jpg",
    "descriptions": "More than just familiar faces and numbers, Sega Sports NHL 2K3 delivers player realism down to size, skill, and behavior, resulting in individuals that exhibit accurate styles of play. Now grinders battle for pucks in the corners, elite players see the ice and create opportunities, and fastMore than just familiar faces and numbers, Sega Sports NHL 2K3 delivers player realism down to size, skill, and behavior, resulting in individuals that exhibit accurate styles of play. Now grinders battle for pucks in the corners, elite players see the ice and create opportunities, and fast skaters exploit their speed. The all-new Franchise Mode lets you capitalize on player accuracy to develop a team that plays your brand of hockey. Now you can draft hotshot rookies, trade for players who compliment your team, compensate for injured players, and more. Then put that precision to work on the ice by anchoring lines with key players and rotating those lines to create the match-ups you want. Bringing it all together is a new ESPN broadcast system where scores, highlights, and more are presented in the network's famous style. [Sega]… Expand"
  },
  {
    "name": "Final Fantasy Chronicles",
    "details_link": "https://www.metacritic.com/game/playstation/final-fantasy-chronicles",
    "publisher": "Square EA",
    "release_date": "Jun 29 2001",
    "developers": [
      "TOSE"
    ],
    "platforms": "PlayStation",
    "num_players": "1-2 ",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/9/21fb832e5b208ab43cdbf7fd02ecce65-98.jpg",
    "descriptions": "When these games came out, they defined what adventures should be. Since then, they have become the most popular and sought-after titles in history. Now you can experience the re-release of two complete, classic games, enhanced with all-new cinemas and features never before seen in the U.S.When these games came out, they defined what adventures should be. Since then, they have become the most popular and sought-after titles in history. Now you can experience the re-release of two complete, classic games, enhanced with all-new cinemas and features never before seen in the U.S. Final Fantasy IV was previously released as Final Fantasy II, but has been completely restored with new magic, monsters, items, CG cinemas, and added features. Chrono Trigger is a re-release of the original game. This time-traveling prequel to Chrono Cross is enhanced with all-new animated scenes.… Expand"
  },
  {
    "name": "Fallout",
    "details_link": "https://www.metacritic.com/game/pc/fallout",
    "publisher": "Interplay",
    "release_date": "Oct  9 1997",
    "developers": [
      "Black Isle Studios"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "First-Person",
      "First-Person",
      "PC-style RPG",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/3/ce84a8789501e0ab0c259ac072446267-98.jpg",
    "descriptions": "Set in the aftermath of a world-wide nuclear war, Fallout will challenge you to survive in an unknown and dangerous world. You will take the role of a Vault-dweller, a person who has grown up in a secluded, underground survival Vault. Circumstances arise that force you to go Outside -- to aSet in the aftermath of a world-wide nuclear war, Fallout will challenge you to survive in an unknown and dangerous world. You will take the role of a Vault-dweller, a person who has grown up in a secluded, underground survival Vault. Circumstances arise that force you to go Outside -- to a strange world 80 years after the end of the modern civilization. A world of mutants, radiation, gangs and violence. Your immediate task is to find a replacement for the broken water purification controller chip. Without that chip, your fellow Vault dwellers are doomed to dehydration or be forced to leave the safety of the Vault for the Outside. [Interplay]… Expand"
  },
  {
    "name": "The Beatles: Rock Band",
    "details_link": "https://www.metacritic.com/game/wii/the-beatles-rock-band",
    "publisher": "MTV Games",
    "release_date": "Sep  9 2009",
    "developers": [
      "Harmonix Music Systems"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 89,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/9/222b29d80979301abcccbda4b80044fc-98.jpg",
    "descriptions": "The game represents the first time fans will be able to experience The Beatles’ musical career for themselves. From the early touring days in 1963 Liverpool to the immortal, final performance on the Apple Corps rooftop, fans can follow in the band’s footsteps as they traverse the globeThe game represents the first time fans will be able to experience The Beatles’ musical career for themselves. From the early touring days in 1963 Liverpool to the immortal, final performance on the Apple Corps rooftop, fans can follow in the band’s footsteps as they traverse the globe during the height of Beatlemania. Adding to the experience is the introduction of three-part vocal harmonies to game play, allowing gamers to revel in the unparalleled vocal stylings of the Fab Four. Beatles fans will also be thrilled to hear previously unreleased authentic voice recordings from John, Paul, George and Ringo chatting between takes during studio sessions recorded at Abbey Road more than four decades ago. The game begins during the band's earliest days at The Cavern Club in Liverpool, England. Gamers then travel across the Atlantic to experience the band's unforgettable 1964 performance on The Ed Sullivan Show, the sold-out concert at New York’s Shea Stadium in 1965, and conclude at The Beatles’ memorable concert at Budokan in Tokyo, Japan in 1966. The Beatles' studio years come to life in legendary Studio 2 at Abbey Road Studios. Highlighting the studio years are inspired artistic visual expressions known as Dreamscapes, intended to transport players to imaginative environments that capture the essence of The Beatles’ genre-busting musical and fashion transformations during their later years. The game follows The Beatles to 1969 where story mode culminates with their final performance on the rooftop of the Apple Corps Headquarters. The Beatles: Rock Band offers a new set of hardware representing the instruments made famous by John, Paul, George and Ringo. Featured in the set are the Rickenbacker 325 and Gretsch Duo Jet guitars - hailed as two of the celebrated, signature instruments played by John Lennon and George Harrison throughout their careers. Also included is a Höfner bass controller - a large-scale version of the bass famously used by Sir Paul McCartney. Rounding out the set is a Ringo Starr inspired, Ludwig-branded Rock Band 2 drum set with a classic pearl finish and vintage remake of a Beatles kick drum head. [MTV Games]… Expand"
  },
  {
    "name": "Assassin's Creed: Brotherhood",
    "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-brotherhood",
    "publisher": "Ubisoft",
    "release_date": "Nov 16 2010",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action Adventure",
      "Historic",
      "Historic",
      "Open-World"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/8a7567e4a2d8e68bff001493d80b4d13-98.jpg",
    "descriptions": "The critically acclaimed single-player experience of Assassin's Creed is back and better than ever as Ezio returns in an epic struggle against the powerful Templar Order. Now a legendary Master Assassin, he must journey into Italy's greatest city, Rome, center of power, greed and corruptionThe critically acclaimed single-player experience of Assassin's Creed is back and better than ever as Ezio returns in an epic struggle against the powerful Templar Order. Now a legendary Master Assassin, he must journey into Italy's greatest city, Rome, center of power, greed and corruption to strike at the heart of the enemy. Defeating the corrupt tyrants entrenched there will require not only strength, but leadership, as Ezio commands an entire Brotherhood that will rally to his side. Only by working together can the Assassins defeat their mortal enemies.… Expand"
  },
  {
    "name": "Left 4 Dead 2",
    "details_link": "https://www.metacritic.com/game/xbox-360/left-4-dead-2",
    "publisher": "Electronic Arts",
    "release_date": "Nov 17 2009",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Tactical"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/ef4ae972063212dc84acef02c41ca14e-98.jpg",
    "descriptions": "Set in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead. This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansiveSet in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead. This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansive campaigns. Play as one of four new survivors armed with a wide and devastating array of classic and upgraded weapons. In addition to firearms, you'll also get a chance to take out some aggression on infected with a variety of carnage-creating melee weapons, from chainsaws to axes and even the deadly frying pan. You'll be putting these weapons to the test against (or playing as in Versus) three horrific and formidable new Special Infected. You’ll also encounter five new \"uncommon\" common infected, including the terrifying Mudmen. Helping to take L4D's frantic, action-packed gameplay to the next level is AI Director 2.0. This improved Director has the ability to procedurally change the weather you’ll fight through and the pathways you'll take, in addition to tailoring the enemy population, effects, and sounds to match your performance. L4D2 promises a satisfying and uniquely challenging experience every time the game is played, custom-fitted to your style of play. [Valve]… Expand"
  },
  {
    "name": "World Soccer Winning Eleven 9",
    "details_link": "https://www.metacritic.com/game/pc/world-soccer-winning-eleven-9",
    "publisher": "Konami",
    "release_date": "Apr 28 2006",
    "developers": [
      "KCET"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/1/21c196e85b9755d7010a2a980c87f663-98.jpg",
    "descriptions": "Arsenal's Thierry Henry and Chelsea's John Terry stare out from the box of Pro Evolution Soccer 5, both men at the top of their game in the Premiership, and both are die-hard fans of the PES series. The retuned controls in the 2005 edition give players more control over weighted passes,Arsenal's Thierry Henry and Chelsea's John Terry stare out from the box of Pro Evolution Soccer 5, both men at the top of their game in the Premiership, and both are die-hard fans of the PES series. The retuned controls in the 2005 edition give players more control over weighted passes, one-twos, and so on. This ties in with the improved animation, which not only looks more realistic, but requires you to time kicks and shots perfectly for maximum power - you're more likely to scuff the ball and make weak, inaccurate shots if you attempt to play them while off balance or out of step. In order for you to enjoy the full benefit of the updated controls, Training Mode is extended - rewarding efforts with points used to unlock secrets within the game. The new licensed clubs are all meticulously detailed, including the authentic representation of names and numbers on their backs. Increased detail in all players has been transferred to the Player Design mode, which has been hugely expanded to include more factors determining skill and ability. Master League, in which you guide a lowly team to glory, now allows player-managers to monitor individual players and see when their health declines and includes European teams. In all games, weather conditions can be set to 'variable', leading to patchy rain or snow. The new weather conditions further enhance the realism and unpredictable nature of PES matches. Rain or shine, PES 5 will be the greatest console football you've ever experienced. [Konami Europe]… Expand"
  },
  {
    "name": "Worldwide Soccer Manager 2005",
    "details_link": "https://www.metacritic.com/game/pc/worldwide-soccer-manager-2005",
    "publisher": "Sega",
    "release_date": "Dec  7 2004",
    "developers": [
      "Sports Interactive"
    ],
    "platforms": "PC",
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Management",
      "Management"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/033091d6a36d375dac8f75a5df2218a4-98.jpg",
    "descriptions": "(Also known as \"WorldWide Soccer Manager 2005\")  Sports Interactive have crafted a superbly detailed masterpiece in Football Manager 2005. Manager Mind games: With Football Manager, mind games can play a key part in every game. Put your fellow managers under the strain with a few white lies(Also known as \"WorldWide Soccer Manager 2005\")  Sports Interactive have crafted a superbly detailed masterpiece in Football Manager 2005. Manager Mind games: With Football Manager, mind games can play a key part in every game. Put your fellow managers under the strain with a few white lies and then turn the screw with a damning criticism of your rivals’ title chances. Just be wary of reaction and retaliation! Agents:  Slicked back hair, mobile phones and a bad cockney accent! Bring on the agents - attempting to whittle you out of a few more million on a possible signing. You just have to decide whether they’re trying to flog you the next big thing or a complete donkey. The Back Room Boys:  If you don’t want to don the tracksuit and sweat it out on the training field, then why not hire some help? From assistant managers to the best physios, they’ll do the legwork and keep you informed on your players, helping you sort the men from the boys. The Big Match: Tired of watching player’s use the same old moves that couldn’t take the ball round a lamppost?  Football Manager 2005 has 30 extra fields for player data including ‘preferred moves’, allowing you to witness your stars perform their signature tricks. With feedback from the fans, Sports Interactive have further refined their award winning games engine to give you what you want from a management game. Football Today: Still have Smith playing for Leeds? That’s SO last season! With more leagues, players and championships than any other football management sim, Football Manager 2005 will also have the latest squads and transfers right up to the end of the summer transfer window, guaranteeing you’ll be on the ball. [Sports Interactive]… Expand"
  },
  {
    "name": "Dead Cells",
    "details_link": "https://www.metacritic.com/game/pc/dead-cells",
    "publisher": "Motion Twin",
    "release_date": "Aug  7 2018",
    "developers": [
      "Motion Twin"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 89,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/0/e23859c679aa2682b4fec2492c356cb2-98.jpg",
    "descriptions": "Dead Cells is a rogue-lite, metroidvania action-platformer. You'll explore a sprawling, ever-changing castle... assuming you’re able to fight your way past its keepers in 2D souls-lite combat. No checkpoints. Kill, die, learn, repeat."
  },
  {
    "name": "There is no game : Wrong dimension",
    "details_link": "https://www.metacritic.com/game/pc/there-is-no-game-wrong-dimension",
    "publisher": "Draw Me A Pixel",
    "release_date": "Aug  6 2020",
    "developers": [
      "Draw Me A Pixel"
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/ab91c1f09289d78826ff5cfd0856412d-98.jpg",
    "descriptions": "There is no game. So don't go messing things up by clicking everywhere. You don’t want to be kicked out of your video game world, do you? Of course not!"
  },
  {
    "name": "Axiom Verge",
    "details_link": "https://www.metacritic.com/game/wii-u/axiom-verge",
    "publisher": "Tom Happ",
    "release_date": "Sep  1 2016",
    "developers": [
      "Tom Happ"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "Wii U"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Platformer",
      "",
      "Metroidvania"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/6/023f973a042187ab7a7af72614e4eef4-98.jpg",
    "descriptions": "Plumb the recesses of a large, labyrinthine world in order to learn its secrets and uncover your role within it. Discover tons of weapons, items, and abilities, each with their own unique behaviors and usage. You'll need your wits to find them all. Combat bizarre biomechanoid constructs, thePlumb the recesses of a large, labyrinthine world in order to learn its secrets and uncover your role within it. Discover tons of weapons, items, and abilities, each with their own unique behaviors and usage. You'll need your wits to find them all. Combat bizarre biomechanoid constructs, the deadly fallout of an ancient war, and the demons of your own psyche. And finally, break the game itself by using glitches to corrupt foes and solve puzzles in the environment. [Nintendo.com]… Expand"
  },
  {
    "name": "Slay the Spire",
    "details_link": "https://www.metacritic.com/game/pc/slay-the-spire",
    "publisher": "Mega Crit Games",
    "release_date": "Jan 23 2019",
    "developers": [
      "Mega Crit Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Card Battle"
    ],
    "meta_score": 89,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/6/80ab836f6f931ad476af37364a68b708-98.jpg",
    "descriptions": "We fused card games and roguelikes together to make the best single player deckbuilder we could. Craft a unique deck, encounter bizarre creatures, discover relics of immense power, and Slay the Spire!"
  },
  {
    "name": "Left 4 Dead",
    "details_link": "https://www.metacritic.com/game/xbox-360/left-4-dead",
    "publisher": "Electronic Arts",
    "release_date": "Nov 17 2008",
    "developers": [
      "Certain Affinity"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/9/b9f3a65c5bcc4ed17cc75f89f56099d1-98.jpg",
    "descriptions": "Fight together...or die alone. A new and highly virulent strain of the rabies virus emerges and spreads through the human population with frightening speed. The pandemic's victims become grotesquely disfigured, wildly violent psychopaths, attacking the uninfected on sight. One of the \"lucky\"Fight together...or die alone. A new and highly virulent strain of the rabies virus emerges and spreads through the human population with frightening speed. The pandemic's victims become grotesquely disfigured, wildly violent psychopaths, attacking the uninfected on sight. One of the \"lucky\" few apparently immune to the sickness, you, unfortunately, are also trapped in a city crawling with thousands of the bloodthirsty Infacted. Together with a handful of fellow Survivors, you must fight your way to safety or die alone. A co-operative multiplayer action game from the makers of \"Counter-Strike,\" Left 4 Dead is built atop the most advanced version of the Source Engine and introduces version 2 of Turtle Rock's artificial intelligence (A.I.) technology. [Turtle Rock Studios]… Expand"
  },
  {
    "name": "Left 4 Dead",
    "details_link": "https://www.metacritic.com/game/pc/left-4-dead",
    "publisher": "Electronic Arts",
    "release_date": "Nov 17 2008",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/8/8eff5a71a5f9f1befd965ecf4ac60138-98.jpg",
    "descriptions": "Fight together...or die alone. A new and highly virulent strain of the rabies virus emerges and spreads through the human population with frightening speed. The pandemic's victims become grotesquely disfigured, wildly violent psychopaths, attacking the uninfected on sight. One of the \"lucky\"Fight together...or die alone. A new and highly virulent strain of the rabies virus emerges and spreads through the human population with frightening speed. The pandemic's victims become grotesquely disfigured, wildly violent psychopaths, attacking the uninfected on sight. One of the \"lucky\" few apparently immune to the sickness, you, unfortunately, are also trapped in a city crawling with thousands of the bloodthirsty Infacted. Together with a handful of fellow Survivors, you must fight your way to safety or die alone. A co-operative multiplayer action game from the makers of \"Counter-Strike,\" Left 4 Dead is built atop the most advanced version of the Source Engine and introduces version 2 of Turtle Rock's artificial intelligence (A.I.) technology. [Turtle Rock Studios]… Expand"
  },
  {
    "name": "Left 4 Dead 2",
    "details_link": "https://www.metacritic.com/game/pc/left-4-dead-2",
    "publisher": "Electronic Arts",
    "release_date": "Nov 16 2009",
    "developers": [
      "Valve Software"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Tactical"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/6092c69b62c2093639f9d728c1439425-98.jpg",
    "descriptions": "Set in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead. This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansiveSet in the zombie apocalypse, Left 4 Dead 2 (L4D2) is the highly anticipated sequel to the award-winning Left 4 Dead. This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansive campaigns. Play as one of four new survivors armed with a wide and devastating array of classic and upgraded weapons. In addition to firearms, you'll also get a chance to take out some aggression on infected with a variety of carnage-creating melee weapons, from chainsaws to axes and even the deadly frying pan. You'll be putting these weapons to the test against (or playing as in Versus) three horrific and formidable new Special Infected. You’ll also encounter five new \"uncommon\" common infected, including the terrifying Mudmen. Helping to take L4D's frantic, action-packed gameplay to the next level is AI Director 2.0. This improved Director has the ability to procedurally change the weather you’ll fight through and the pathways you'll take, in addition to tailoring the enemy population, effects, and sounds to match your performance. L4D2 promises a satisfying and uniquely challenging experience every time the game is played, custom-fitted to your style of play. [Valve]… Expand"
  },
  {
    "name": "Titanfall 2",
    "details_link": "https://www.metacritic.com/game/playstation-4/titanfall-2",
    "publisher": "Electronic Arts",
    "release_date": "Oct 28 2016",
    "developers": [
      "Respawn Entertainment"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/2/fae7cd4043af9a7f170bf9c93d26f501-98.jpg",
    "descriptions": "In single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. StrandedIn single player, Titanfall 2 delivers a crafted experience that explores the unique bond between man and machine. Playable offline, the single player campaign in Titanfall 2 lets fans step out onto The Frontier as a Militia rifleman with aspirations of becoming an elite Pilot. Stranded behind enemy lines and facing overwhelming odds, players must team up with a veteran Titan to uphold a mission they were never meant to carry out. In multiplayer, Respawn is continuing to evolve their gameplay to provide a more robust experience that delivers expanded depth and variety that includes six new Titans, deeper Pilot abilities, more customization options, and a robust progression system that is sure to satisfy fans. [Electronic Arts]… Expand"
  },
  {
    "name": "F1 2017",
    "details_link": "https://www.metacritic.com/game/pc/f1-2017",
    "publisher": "Codemasters",
    "release_date": "Aug 24 2017",
    "developers": [
      "Codemasters"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Racing",
      "Simulation",
      "Automobile"
    ],
    "meta_score": 89,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/5/95e3de36025aa0e050c5495e31c622f1-98.jpg",
    "descriptions": "Win the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both onlineWin the 2017 World Championship, break every record in the fastest ever F1 cars, and race some of the most iconic F1 cars of the last 30 years. The game sports an even deeper ten year Career, more varied gameplay in the new ‘Championships’ mode, and a host of other new features, both online and offline.… Expand"
  },
  {
    "name": "Dark Souls III",
    "details_link": "https://www.metacritic.com/game/playstation-4/dark-souls-iii",
    "publisher": "Bandai Namco Games",
    "release_date": "Apr 12 2016",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 6 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/4/ff728f9a503208cfe52254e6224be46a-98.jpg",
    "descriptions": "Developed by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge andDeveloped by Japanese developer FromSoftware, DARK SOULS III is the latest chapter in the DARK SOULS series with its trademark sword and sorcery combat and rewarding action RPG gameplay. Players travel across a wide variety of locations in an interconnected world of unrelenting challenge and deep RPG gameplay as they search for a way to survive the coming apocalypse.… Expand"
  },
  {
    "name": "3D Gunstar Heroes",
    "details_link": "https://www.metacritic.com/game/3ds/3d-gunstar-heroes",
    "publisher": "Sega",
    "release_date": "Aug 20 2015",
    "developers": [
      "M2"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "3DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Shooter",
      "2D",
      "Shoot-'Em-Up",
      "Horizontal"
    ],
    "meta_score": 89,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/3/94a107f0bf4ae16c65b91905f7492f80-98.jpg",
    "descriptions": "The Gunstar 9 planet was peaceful for many years until the vicious dictator Colonel Red kidnapped the Gunstar twins' older brother and used mind control to make him his slave. Now, face many different enemies and bosses in Gunstar Heroes, as you battle to stop the dictator from unleashingThe Gunstar 9 planet was peaceful for many years until the vicious dictator Colonel Red kidnapped the Gunstar twins' older brother and used mind control to make him his slave. Now, face many different enemies and bosses in Gunstar Heroes, as you battle to stop the dictator from unleashing \"Golden Silver the Destructor\" with apocalyptic consequences!… Expand"
  },
  {
    "name": "Jade Empire",
    "details_link": "https://www.metacritic.com/game/xbox/jade-empire",
    "publisher": "Microsoft Game Studios",
    "release_date": "Apr 12 2005",
    "developers": [
      "BioWare"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/4/fa2427b1aa0a80ee5267d438b6a2f01c-98.jpg",
    "descriptions": "Set in an ancient world inspired by mythical China, Jade Empire lets you train under your master's watchful eye as you learn powerful martial arts and mystical powers. When danger threatens, you'll travel across the world, from the harsh mountains of the Land of Howling Spirits to the lushSet in an ancient world inspired by mythical China, Jade Empire lets you train under your master's watchful eye as you learn powerful martial arts and mystical powers. When danger threatens, you'll travel across the world, from the harsh mountains of the Land of Howling Spirits to the lush gardens of the Imperial City. In your adventures, you must face powerful human and supernatural foes, learn the exotic and magical martial arts, and discover the darkest secrets of the world. Practice the greatest fighting styles and defeat the most powerful enemies to become a master of martial arts.… Expand"
  },
  {
    "name": "Tony Hawk's Underground",
    "details_link": "https://www.metacritic.com/game/gamecube/tony-hawks-underground",
    "publisher": "Activision",
    "release_date": "Oct 27 2003",
    "developers": [
      "Neversoft Entertainment"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Skateboarding"
    ],
    "meta_score": 89,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/8/d9129a915784367421a6fc129898df6d-98.jpg",
    "descriptions": "Get ready for a major new step for the Tony Hawk series.  Tony Hawk's Underground tweaks the gameplay of previous installments to include a plot-twisting story, customizable tricks and decks, online play, and the ability to include your own mug shot on your custom player.  Of course, you canGet ready for a major new step for the Tony Hawk series.  Tony Hawk's Underground tweaks the gameplay of previous installments to include a plot-twisting story, customizable tricks and decks, online play, and the ability to include your own mug shot on your custom player.  Of course, you can also play as any one of pro skating's biggest stars including Tony Hawk, Bob Burnquist, and Elissa Steamer.  Ride, walk, or drive through nine expansive levels then test your skills against other gamers online.  Become a star of the Underground.… Expand"
  },
  {
    "name": "NHL 2K3",
    "details_link": "https://www.metacritic.com/game/xbox/nhl-2k3",
    "publisher": "Sega",
    "release_date": "Nov 19 2002",
    "developers": [
      "Treyarch"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/5/35b759228e8e55e9c76d1584ec66ddcd-98.jpg",
    "descriptions": "More than just familiar faces and numbers, Sega Sports NHL 2K3 delivers player realism down to size, skill, and behavior, resulting in individuals that exhibit accurate styles of play. Grinders battle for pucks in the corners, elite players see the ice and create opportunities, and fastMore than just familiar faces and numbers, Sega Sports NHL 2K3 delivers player realism down to size, skill, and behavior, resulting in individuals that exhibit accurate styles of play. Grinders battle for pucks in the corners, elite players see the ice and create opportunities, and fast skaters exploit their speed. The all-new Franchise Mode lets you capitalize on player accuracy to develop a team that plays your brand of hockey.… Expand"
  },
  {
    "name": "NBA 2K3",
    "details_link": "https://www.metacritic.com/game/playstation-2/nba-2k3",
    "publisher": "Sega",
    "release_date": "Oct  8 2002",
    "developers": [
      "Visual Concepts"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-8 ",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/0/9ecf3a92720a50365573ab9d62f2cb79-98.jpg",
    "descriptions": "Imagine jump shots so real players actually adjust their movement in mid-air based on distance from the hoop and defensive pressure; a passing touch that gives you the control to skirt a defender or start a fast break; and dribble moves that let you jab left, rock right, crossover, spin andImagine jump shots so real players actually adjust their movement in mid-air based on distance from the hoop and defensive pressure; a passing touch that gives you the control to skirt a defender or start a fast break; and dribble moves that let you jab left, rock right, crossover, spin and much more. It's all happening in NBA 2K3. No other game delivers the physical element of basketball like this. Accurate impact from collisions, especially hard fouls and authoritative dunks; shot blocking with emphasis on precise hand-to-ball contact; and the ability to lunge for the loose ball, even if it means ending up on some celebrity's lap. With commentators that analyze strategy, cutscenes portraying lifelike player interaction, uniforms that move like real fabric, and a brand new ESPN broadcast system that wraps it all together, NBA 2K3 provides the complete NBA experience. [Sega]… Expand"
  },
  {
    "name": "NASCAR Racing 2002 Season",
    "details_link": "https://www.metacritic.com/game/pc/nascar-racing-2002-season",
    "publisher": "Sierra Entertainment",
    "release_date": "Feb 14 2002",
    "developers": [
      "Papyrus"
    ],
    "platforms": "PC",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Stock Car",
      "Stock Car",
      "Automobile"
    ],
    "meta_score": 89,
    "users_score": 5.6,
    "image": "https://static.metacritic.com/images/products/games/5/4558649259b7f59b7bd11de339f32cb2-98.jpg",
    "descriptions": "Race Against Jeff Gordon, Kevin Harvick, Dale Earnhardt Jr., Dale Jarrett, and more in the 2002 Season! Get behind the wheel of a 750 horsepower stock car and battle for the championship on real-life tracks. Get under the hood to fine-tune your car or just jump in and race against the bestRace Against Jeff Gordon, Kevin Harvick, Dale Earnhardt Jr., Dale Jarrett, and more in the 2002 Season! Get behind the wheel of a 750 horsepower stock car and battle for the championship on real-life tracks. Get under the hood to fine-tune your car or just jump in and race against the best in Arcade Mode. Feel car vibrations, hear the roar of the engines, and sweat it out racing fender to fender at 180 miles per hour. [Sierra]… Expand"
  },
  {
    "name": "Phantasy Star Online",
    "details_link": "https://www.metacritic.com/game/dreamcast/phantasy-star-online",
    "publisher": "Sega",
    "release_date": "Jan 29 2001",
    "developers": [
      "Sonic Team"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/4/6ed395036b98a8d92fd31b85abb39c47-98.jpg",
    "descriptions": "Pioneer 2 finally completed it's long voyage to the new home world.  But as the ship entered orbit, an enormous explosion shook the entire planet, and all contact with the thousands of people already there was lost.  Now, in the first worldwide online console RPG, players from around thePioneer 2 finally completed it's long voyage to the new home world.  But as the ship entered orbit, an enormous explosion shook the entire planet, and all contact with the thousands of people already there was lost.  Now, in the first worldwide online console RPG, players from around the globe must unite to discover what has happened.  Phantasy Star Online continues in the tradition of one of the most popular series of all time, and becomes a revolutionary and truly global gaming experience in an online, persistent world.… Expand"
  },
  {
    "name": "Resident Evil 2",
    "details_link": "https://www.metacritic.com/game/nintendo-64/resident-evil-2",
    "publisher": "Capcom",
    "release_date": "Oct 31 1999",
    "developers": [
      "Angel Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "Nintendo 64"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Horror"
    ],
    "meta_score": 89,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/3/987c4e162ea68d266a91cc136371100c-98.jpg",
    "descriptions": "Ready or not, the terror of Resident Evil 2 is here.  In chapter one, the case of the disastrous T-virus outbreak--a mutagenic toxin designed for biological weapons--was eventually closed but the experiments were far from over.  Control the destiny of Leon Kennedy or Claire Redfield as theirReady or not, the terror of Resident Evil 2 is here.  In chapter one, the case of the disastrous T-virus outbreak--a mutagenic toxin designed for biological weapons--was eventually closed but the experiments were far from over.  Control the destiny of Leon Kennedy or Claire Redfield as their nightmare begins when a biotech terror runs rampant in Raccoon City.  Relentless zombies and hideous monsters are all out for a taste of your blood.  If the suspense doesn't kill you, something else will.… Expand"
  },
  {
    "name": "Tekken 2",
    "details_link": "https://www.metacritic.com/game/playstation/tekken-2",
    "publisher": "Namco",
    "release_date": "Aug 25 1996",
    "developers": [
      "Namco"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "PlayStation"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/9/e3b1cf4c8dba115df64690f602a880f6-98.jpg",
    "descriptions": "More than a sequel. The undisputed #1 fighting game on the planet."
  },
  {
    "name": "Need for Speed: Hot Pursuit",
    "details_link": "https://www.metacritic.com/game/playstation-3/need-for-speed-hot-pursuit",
    "publisher": "Electronic Arts",
    "release_date": "Nov 16 2010",
    "developers": [
      "Criterion Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 89,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/9/8cc0f3b056327065660e46612cc4d0d8-98.jpg",
    "descriptions": "Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog.Need for Speed Hot Pursuit players will experience the thrill of the chase and the rush of the escape as they play through full careers as both a cop and a racer – solo or connected. The blistering speeds, brutal busts and heart-stopping getaways are all connected via Need for Speed Autolog. This network not only connects friends for epic head-to head pursuits and races, but also enables players to compare performances and stats, thereby setting the stage for the ultimate in friendly competition.… Expand"
  },
  {
    "name": "F-Zero GX",
    "details_link": "https://www.metacritic.com/game/gamecube/f-zero-gx",
    "publisher": "Nintendo",
    "release_date": "Aug 26 2003",
    "developers": [
      "Amusement Vision"
    ],
    "platforms": "GameCube",
    "num_players": "1-4 ",
    "genres": [
      "Driving",
      "Racing",
      "Futuristic"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/6/65f9176f74aa0a9cef4ffa0f5c92f945-98.jpg",
    "descriptions": "F-Zero GX puts you in a futuristic race where fearless pilots would risk everything to claim the title of the top speedster in the universe. Grand Prix mode lets you face off against 29 opponents in three courses while Vs. Battle mode lets two to four players compete in split-screen races.F-Zero GX puts you in a futuristic race where fearless pilots would risk everything to claim the title of the top speedster in the universe. Grand Prix mode lets you face off against 29 opponents in three courses while Vs. Battle mode lets two to four players compete in split-screen races. In Time Attack mode, you'll try to beat the best times and top speeds for each course. And now, in the new Story mode, you can follow Captain Falcon as he races through missions and completes a wide array of challenges.… Expand"
  },
  {
    "name": "Mass Effect",
    "details_link": "https://www.metacritic.com/game/pc/mass-effect",
    "publisher": "Electronic Arts",
    "release_date": "May 28 2008",
    "developers": [
      "BioWare",
      "Demiurge Studios"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Console-style RPG",
      "Japanese-Style",
      "Western-Style"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/ebcba5f7c2b43b785cbefd839514bc72-98.jpg",
    "descriptions": "As the first human on the galactic stage, you must uncover the greatest threat to civilization. Your job is complicated by the very fact of your humanity, as no one trusts you and you need to find a way to convince everyone of the grave threat. You will travel across an expansive universe toAs the first human on the galactic stage, you must uncover the greatest threat to civilization. Your job is complicated by the very fact of your humanity, as no one trusts you and you need to find a way to convince everyone of the grave threat. You will travel across an expansive universe to piece the mystery together. As you discover and explore the uncharted edges of the galaxy, you come closer to an overwhelming truth - learning that the placid and serene universe you know is about to come to a violent end and that you may be the only person who can stop it! In addition to the main story arc of the game, players are be able to visit a large number of uncharted, unexplored planets which are side quests independent from the main story. At any time during the campaign, a player can choose to explore one of these planets and have an opportunity to discover new alien life, resources, ruined civilizations and powerful technologies. Talents and abilities are upgradeable and advanced talent options become available at higher levels. Weapons and vehicles are customizable to include various effects, abilities and upgrades using the \"X-Mod\" system. Each character class have unique talents and abilities which increase in power as the player progresses through the game. Optimized controls have been designed specifically for the PC. Fully customizable controls â?? PC gamers can re-map the control scheme any way they like. Run & Gun Control â?? Players can assign biotic powers or skills to â??hot keysâ?? allowing them to play Mass Effect with a heavier focus on action. New decryption mini-game. New inventory screen GUI and functionality â?? The enhanced inventory system makes it easier for players to equip and modify their weapons and armor. [Microsoft]… Expand"
  },
  {
    "name": "Super Mario 3D World + Bowser's Fury",
    "details_link": "https://www.metacritic.com/game/switch/super-mario-3d-world-+-bowsers-fury",
    "publisher": "Nintendo",
    "release_date": "Feb 12 2021",
    "developers": [
      "Nintendo"
    ],
    "platforms": "Switch",
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/5/3aabc951f24c35d7351085a71ae61067-98.jpg",
    "descriptions": "The cat's out of the bag, Super Mario 3D World is on to the Nintendo Switch system. Pounce and climb through dozens of colorful stages! Mario (and his friends) can use power-ups like the Super Bell, which grants catlike abilities, like climbing and scratching. Work together locally or onlineThe cat's out of the bag, Super Mario 3D World is on to the Nintendo Switch system. Pounce and climb through dozens of colorful stages! Mario (and his friends) can use power-ups like the Super Bell, which grants catlike abilities, like climbing and scratching. Work together locally or online with up to three other players to reach the goaland to see who can get a high score. The Super Mario 3D World + Bowser's Fury game features the same great co-op gameplay, creative levels and power-ups as the original game, but also so much more.… Expand"
  },
  {
    "name": "Hi-Fi Rush",
    "details_link": "https://www.metacritic.com/game/pc/hi-fi-rush",
    "publisher": "Bethesda Softworks",
    "release_date": "Jan 25 2023",
    "developers": [
      "Tango Gameworks"
    ],
    "platforms": [
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/4/06b1c932115f8e917578c3f555adf4e4-98.jpg",
    "descriptions": "Feel the beat as wannabe rockstar Chai and his ragtag team fight against an evil megacorp with raucous rhythm combat! From Tango Gameworks comes Hi-Fi RUSH, an all-new action game where the world syncs to the music."
  },
  {
    "name": "Dark Souls",
    "details_link": "https://www.metacritic.com/game/xbox-360/dark-souls",
    "publisher": "Namco Bandai Games",
    "release_date": "Oct  4 2011",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/9/ed7503a56df6c9c6a4eb9ce571ac8221-98.jpg",
    "descriptions": "Project Dark (Working Title) is a brand new dark fantasy RPG designed to completely embrace the concepts of tension in dungeon exploration, fear in encountering enemies, the joy of new discoveries, and a high sense of achievement in progressing. The game is set in a dark fantasy world filledProject Dark (Working Title) is a brand new dark fantasy RPG designed to completely embrace the concepts of tension in dungeon exploration, fear in encountering enemies, the joy of new discoveries, and a high sense of achievement in progressing. The game is set in a dark fantasy world filled with decadent atmosphere, with a heavy emphasis on player freedom in discovering various tactics and strategies to use in weapon based combat.… Expand"
  },
  {
    "name": "NBA Street V3",
    "details_link": "https://www.metacritic.com/game/xbox/nba-street-v3",
    "publisher": "EA Sports Big",
    "release_date": "Feb  8 2005",
    "developers": [
      "EA Canada"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/1/1419fdba1bb7e321427bea733c42e076-98.jpg",
    "descriptions": "The third installment of NBA Street advances the series by adding more customization, different game modes, and new gameplay features. Now you can build both your reputation and show-stopping Gamebreakers on the streets by performing all-new flashy dunks, dribble tricks, and combos. StepThe third installment of NBA Street advances the series by adding more customization, different game modes, and new gameplay features. Now you can build both your reputation and show-stopping Gamebreakers on the streets by performing all-new flashy dunks, dribble tricks, and combos. Step into the shoes of NBA legends, current basketball stars, and original characters from previous games. Play in familiar courts, such as The Cage and Rucker Park, or create your own court from the ground up. NBA Street V3 also features a new dunk contest and online multiplayer modes.… Expand"
  },
  {
    "name": "Need for Speed: Hot Pursuit 2",
    "details_link": "https://www.metacritic.com/game/playstation-2/need-for-speed-hot-pursuit-2",
    "publisher": "Electronic Arts",
    "release_date": "Oct  1 2002",
    "developers": [
      "Black Box"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/8/a41af0b7d45f11e7bbd8c546de95d7ed-98.jpg",
    "descriptions": "Become the \"Champion Road Racer\" by conquering numerous racing events, all carrying rewards such as: cars, tracks and high performance upgrades. The game challenges the driver to dodge traffic, police and natural elements in high speed and high style... true NFS style! Evade any copsBecome the \"Champion Road Racer\" by conquering numerous racing events, all carrying rewards such as: cars, tracks and high performance upgrades. The game challenges the driver to dodge traffic, police and natural elements in high speed and high style... true NFS style! Evade any cops encountered, as getting busted just might end your career. [Electronic Arts]… Expand"
  },
  {
    "name": "Grand Theft Auto IV: The Ballad of Gay Tony",
    "details_link": "https://www.metacritic.com/game/xbox-360/grand-theft-auto-iv-the-ballad-of-gay-tony",
    "publisher": "Rockstar Games",
    "release_date": "Oct 29 2009",
    "developers": [
      "Rockstar North"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "genres": [
      "Action Adventure",
      "Modern",
      "Modern",
      "Open-World"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/e9bf6f23feae988a2d84a2aaad706479-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Grand Theft Auto IV's second downloadable episode, The Ballad of Gay Tony injects Liberty City with an overdose of guns, glitz, and grime. As Luis Lopez, part-time hoodlum and full-time assistant to legendary nightclub impresario Tony Prince (aka \"Gay Tony\"), players will[Xbox Live Arcade]  Grand Theft Auto IV's second downloadable episode, The Ballad of Gay Tony injects Liberty City with an overdose of guns, glitz, and grime. As Luis Lopez, part-time hoodlum and full-time assistant to legendary nightclub impresario Tony Prince (aka \"Gay Tony\"), players will struggle with the competing loyalties of family and friends, and with the uncertainty about who is real and who is fake in a world in which everyone has a price. [Rockstar Games]… Expand"
  },
  {
    "name": "Psychonauts 2",
    "details_link": "https://www.metacritic.com/game/pc/psychonauts-2",
    "publisher": "Starbreeze",
    "release_date": "Aug 25 2021",
    "developers": [
      "Double Fine Productions"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Beat-'Em-Up",
      "Action",
      "Action Adventure",
      "Platformer",
      "Open-World",
      "3D"
    ],
    "meta_score": 89,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/1/2bfbd036de5aac8d4edb094a041ab179-98.jpg",
    "descriptions": "Razputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, andRazputin Aquato, trained acrobat and powerful young psychic, has realized his life long dream of joining the international psychic espionage organization known as the Psychonauts! But these psychic super spies are in trouble. Their leader hasn't been the same since he was kidnapped, and what's worse, there's a mole hiding in headquarters. Raz must use his powers to stop the mole before they execute their secret plan--to bring the murderous psychic villain, Maligula, back from the dead.… Expand"
  },
  {
    "name": "The Legend of Zelda: The Minish Cap",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/the-legend-of-zelda-the-minish-cap",
    "publisher": "Nintendo",
    "release_date": "Jan 10 2005",
    "developers": [
      "Flagship"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 89,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/2/3107883edee342b059c38eb20833ff59-98.jpg",
    "descriptions": "Link returns in an all-new Game Boy Advance adventure. When the sorcerer Vaati turns Princess Zelda to stone, the king of Hyrule sends Link on a quest that takes him to all-new locations. Using the power of a mystical hat called the Minish Cap, Link must travel through a fantastic world rifeLink returns in an all-new Game Boy Advance adventure. When the sorcerer Vaati turns Princess Zelda to stone, the king of Hyrule sends Link on a quest that takes him to all-new locations. Using the power of a mystical hat called the Minish Cap, Link must travel through a fantastic world rife with new items, puzzles, and bosses. As Link, you can shrink down to either battle large enemies from within or find secret items. You can also unlock items and solve puzzles by fusing together magic relics.… Expand"
  },
  {
    "name": "NCAA Football 2005",
    "details_link": "https://www.metacritic.com/game/xbox/ncaa-football-2005",
    "publisher": "EA Sports",
    "release_date": "Jul 15 2004",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/391fd078b9eb76d3111942a3d2b72e0f-98.jpg",
    "descriptions": "Kick off the football season with NCAA Football 2005, a game that brings you closer to the players, stadiums, and atmosphere of college football. For the first time in the series, the game-day atmosphere directly affects players' on-field performance. Create mismatches with the new Match-UpKick off the football season with NCAA Football 2005, a game that brings you closer to the players, stadiums, and atmosphere of college football. For the first time in the series, the game-day atmosphere directly affects players' on-field performance. Create mismatches with the new Match-Up Stick, and then celebrate big plays with new fan celebrations, like the Gator Chomp and the Texas Hook 'Em Horns. NCAA Football 2005 also features online tournaments, a deeper Dynasty mode, and a host of other gameplay enhancements.… Expand"
  },
  {
    "name": "NCAA Football 2004",
    "details_link": "https://www.metacritic.com/game/gamecube/ncaa-football-2004",
    "publisher": "EA Sports",
    "release_date": "Jul 16 2003",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Football",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/3/7bafeb2b53332a9d2af914c0c414d1e7-98.jpg",
    "descriptions": "Experience the spirit, atmosphere, and emotion of college football like NCAA Football 2004.  Whether you play as the one of the 36 new 1-AA teams or 20 classic teams from the last two decades, the game lets you celebrate the history of college football.  Feel the tradition of collegeExperience the spirit, atmosphere, and emotion of college football like NCAA Football 2004.  Whether you play as the one of the 36 new 1-AA teams or 20 classic teams from the last two decades, the game lets you celebrate the history of college football.  Feel the tradition of college football Saturdays with all-new pre-game introductions and experience the pageantry with new mascots, flag-waving cheerleaders, and cannons.  Other key features this season include improved college gameplay, EA Sports Online competition for the PlayStation 2, deeper Dynasty mode, and over 15 new teams and the all-new EA Sports Bio.  … Expand"
  },
  {
    "name": "Combat Mission: Barbarossa to Berlin",
    "details_link": "https://www.metacritic.com/game/pc/combat-mission-barbarossa-to-berlin",
    "publisher": "Battlefront.com",
    "release_date": "Oct 29 2002",
    "developers": [
      "Big Time Software"
    ],
    "platforms": "PC",
    "num_players": "1-2 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Wargame",
      "Real-Time",
      "General"
    ],
    "meta_score": 89,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/7/25ecc2c41972740fe32e8c81beee5796-98.jpg",
    "descriptions": "CMBB is the sequel to the award winning \"Combat Mission: Beyond Overlord\" game. CMBB is a 1 or 2 player, hybrid turn-based/realtime 3D simulation of WWII tactical warfare on the Eastern Front, from June 1941 through May 1945. It combines unparalleled game depth, stunning graphics and soundCMBB is the sequel to the award winning \"Combat Mission: Beyond Overlord\" game. CMBB is a 1 or 2 player, hybrid turn-based/realtime 3D simulation of WWII tactical warfare on the Eastern Front, from June 1941 through May 1945. It combines unparalleled game depth, stunning graphics and sound with a proven and easy to use interface in a true 3D environment. [Battlefront.com]… Expand"
  },
  {
    "name": "NHL 2002",
    "details_link": "https://www.metacritic.com/game/xbox/nhl-2002",
    "publisher": "EA Sports",
    "release_date": "Dec 10 2001",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Ice Hockey",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/8/b55fc20c3d321cd5a9c0a9bc2a0ce4f7-98.jpg",
    "descriptions": "Be the Hero with NHL® 2002! Rush the net in pursuit of the game-winning goal, guard the crease with your life to shut out the opposition, and watch it all from the player's point of view. New features include the \"Breakaway Camera\", \"EA GameStory\" which recognizes andBe the Hero with NHL® 2002! Rush the net in pursuit of the game-winning goal, guard the crease with your life to shut out the opposition, and watch it all from the player's point of view. New features include the \"Breakaway Camera\", \"EA GameStory\" which recognizes and rewards outstanding performance, and \"Create-a-Player\" so you can really put yourself in the game. Whether you're an intense power forward or bruising defenseman, you'll feel pure adrenaline as you take the ice -- but don't take our word for it, experience it for yourself.… Expand"
  },
  {
    "name": "Homeworld: Cataclysm",
    "details_link": "https://www.metacritic.com/game/pc/homeworld-cataclysm",
    "publisher": "Sierra Entertainment",
    "release_date": "Sep  7 2000",
    "developers": [
      "Barking Dog"
    ],
    "platforms": "PC",
    "num_players": "1-4 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/3/ea96590b4f81b762621fbb8606462310-98.jpg",
    "descriptions": "Homeworld: Cataclysm boasts 18 all-new ships, 25 new technologies, 17 single-player missions, and fantastic multiplay, while improving on the interface and technology that earned Homeworld 1999's highest accolades. [Sierra Studios]"
  },
  {
    "name": "Tetris Effect",
    "details_link": "https://www.metacritic.com/game/playstation-4/tetris-effect",
    "publisher": "Sony Interactive Entertainment",
    "release_date": "Nov  9 2018",
    "developers": [
      "Enhance Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "Stacking"
    ],
    "meta_score": 89,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/19fb7c752a424e72a87156fd248f87d7-98.jpg",
    "descriptions": "From deep beneath the ocean to the furthest reaches of outer space, Tetris Effect’s 30-plus stages are more than just backdrops; together with music, characters, and animations tailor-made for each level and triggered by your actions, they’re all meant to make you feel something — to conveyFrom deep beneath the ocean to the furthest reaches of outer space, Tetris Effect’s 30-plus stages are more than just backdrops; together with music, characters, and animations tailor-made for each level and triggered by your actions, they’re all meant to make you feel something — to convey a mood, or even provoke an emotional response. [Enhance, Inc.]… Expand"
  },
  {
    "name": "Fez",
    "details_link": "https://www.metacritic.com/game/xbox-360/fez",
    "publisher": "Polytron Corp.",
    "release_date": "Apr 13 2012",
    "developers": [
      "Polytron Corp."
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox 360"
    ],
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 89,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/9/c470bb51e9bc36b64564d10d9ec05439-98.jpg",
    "descriptions": "This quirky platformer stars a little white creature with a bright red fez. Gomez is a 2D being living in a 2D world. Or is he? When the existence of a mysterious 3rd dimension is unveiled, Gomez embarks on a journey that will usher him to the very end of time and space. Utilize your abilityThis quirky platformer stars a little white creature with a bright red fez. Gomez is a 2D being living in a 2D world. Or is he? When the existence of a mysterious 3rd dimension is unveiled, Gomez embarks on a journey that will usher him to the very end of time and space. Utilize your ability to navigate 3D structures from 4 distinct 2D perspectives. Explore an open-ended world full of secrets, puzzles and hidden treasures. Re-open the mysteries of the past and discover the truth about reality and perception. Alter your perspective and see the world in a different way.… Expand"
  },
  {
    "name": "Cave Story",
    "details_link": "https://www.metacritic.com/game/wii/cave-story",
    "publisher": "Nicalis",
    "release_date": "Mar 22 2010",
    "developers": [
      "Nicalis"
    ],
    "platforms": [
      "3DS",
      "PC",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D",
      "",
      "Metroidvania"
    ],
    "meta_score": 89,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/8/791b02e3aae9b06e0c3361a01c55c179-98.jpg",
    "descriptions": "[WiiWare]  Cave Story takes you into a rare world where a curious race of innocent, rabbit-like creatures called Mimiga run free. You wake up in a dark cave with no memory of who you are, where you came from or why you're in such a place. Uncovering Mimiga Village, you discover that the[WiiWare]  Cave Story takes you into a rare world where a curious race of innocent, rabbit-like creatures called Mimiga run free. You wake up in a dark cave with no memory of who you are, where you came from or why you're in such a place. Uncovering Mimiga Village, you discover that the once-carefree Mimiga are in danger at the hands of a maniacal scientist. Their only hope rests squarely on the shoulders of a quiet, amnesiac boy who can't remember his own name. Take control, learn the origins of this world's power, stop the delusional villain and save the Mimiga.… Expand"
  },
  {
    "name": "Dark Souls II: Scholar of the First Sin",
    "details_link": "https://www.metacritic.com/game/xbox-one/dark-souls-ii-scholar-of-the-first-sin",
    "publisher": "Bandai Namco Games",
    "release_date": "Apr  7 2015",
    "developers": [
      "From Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "Up to 6 ",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/1/d77105c24162e419f6359fad4e8a3885-98.jpg",
    "descriptions": "Dark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II ownersDark Souls II: Scholar of the First Sin includes the 3 previously released DLC packs  - Crown of the Sunken King, Crown of the Old Iron King, and Crown of the ivory King - along with additional features. All versions of the game include the following features (Existing Dark Souls II owners will receive a patch to implement these elements): Additional NPCs added for an enhanced story experience. Parameter adjustments for improved game balance. Augmented item descriptions. Improved online matchmaking functionality. [Bandai Namco]… Expand"
  },
  {
    "name": "The Walking Dead: Episode 5 - No Time Left",
    "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-episode-5---no-time-left",
    "publisher": "Telltale Games",
    "release_date": "Nov 21 2012",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "genres": [
      "Miscellaneous",
      "Adventure",
      "General",
      "Compilation",
      "Point-and-Click"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/5/b16686f4f85035168fc7cc8c4f9cc8b1-98.jpg",
    "descriptions": "Assume the role of Lee Everett, a convicted criminal, who has been given a second chance at life in a world infested with the undead. With corpses returning to life and survivors stopping at nothing to maintain their own safety, protecting an orphaned girl named Clementine may offer himAssume the role of Lee Everett, a convicted criminal, who has been given a second chance at life in a world infested with the undead. With corpses returning to life and survivors stopping at nothing to maintain their own safety, protecting an orphaned girl named Clementine may offer him redemption in a world gone to hell.… Expand"
  },
  {
    "name": "Guild Wars",
    "details_link": "https://www.metacritic.com/game/pc/guild-wars",
    "publisher": "NCSOFT",
    "release_date": "Apr 26 2005",
    "developers": [
      "ArenaNet"
    ],
    "platforms": "PC",
    "num_players": "64+ ",
    "genres": [
      "Role-Playing",
      "Miscellaneous",
      "General",
      "General",
      "Compilation",
      "Massively Multiplayer"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/eaa3a13b4d572bb4ebc633528b41b4ee-98.jpg",
    "descriptions": "Guild Wars takes the best elements of today's massively multiplayer online games and combines them with a new mission-based design that eliminates the tedium of those games. You can meet new friends in towns or outposts, form a party, and then go tackle a quest together. Your party alwaysGuild Wars takes the best elements of today's massively multiplayer online games and combines them with a new mission-based design that eliminates the tedium of those games. You can meet new friends in towns or outposts, form a party, and then go tackle a quest together. Your party always has its own unique copy of the quest map, so camping, kill-stealing, and long lines to complete quests are all things of the past. Within a quest you have unprecedented freedom and power to manipulate the world around you: your magic can build bridges and open up new pathways, or it can burn down forests and tear the ground asunder. You don't have to spend countless hours on a leveling treadmill to get to the interesting parts of the game, because combat is designed to be strategically interesting and challenging right from the beginning. You don't have to spend hours running around the world to prepare for a quest, because Guild Wars allows you to instantly travel to the beginning of any quest that you've previously unlocked. You'll never spend days playing only to discover that choices you made early on have left you with a permanently uncompetitive character, because the unique skill system in Guild Wars allows infinite experimentation but doesn't allow bad decisions to ruin a character. And you'll never meet new players only to discover that you can't play with them or compete against them because their characters are on a different server than yours; in Guild Wars, all characters live in one seamless world. [NCsoft]… Expand"
  },
  {
    "name": "Atari 50: The Anniversary Celebration",
    "details_link": "https://www.metacritic.com/game/switch/atari-50-the-anniversary-celebration",
    "publisher": "Atari",
    "release_date": "Nov 11 2022",
    "developers": [
      "Digital Eclipse"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 89,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/e8e58990952f0184e5c933b45ebb53f9-98.jpg",
    "descriptions": "It has been five decades since a small team in Silicon Valley first combined their creativity, curiosity and passion into making video games and hardware. The result of their efforts was Atari, one of the most recognizable and enduring entertainment and pop culture brands in the world.It has been five decades since a small team in Silicon Valley first combined their creativity, curiosity and passion into making video games and hardware. The result of their efforts was Atari, one of the most recognizable and enduring entertainment and pop culture brands in the world.Atari 50: The Anniversary Celebration takes players on an interactive journey through 50 years of video games via interviews with designers, developers and industry leaders, documentary footage, product design documents, high-resolution original artwork, and a specially-curated list of more than 90 playable games.… Expand"
  },
  {
    "name": "Borderlands 2",
    "details_link": "https://www.metacritic.com/game/pc/borderlands-2",
    "publisher": "2K Games",
    "release_date": "Sep 17 2012",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/83a854e88e731ec780ae2d8e2e3659f7-98.jpg",
    "descriptions": "Borderlands 2 advances the distinct blending of FPS and role-playing genres to create an evolution of the Role Playing Shooter. Team up with up to 3 other players for 4-player online goodness or go old-school with 2-player split-screen couch sharing mayhem as you spend hours leveling up yourBorderlands 2 advances the distinct blending of FPS and role-playing genres to create an evolution of the Role Playing Shooter. Team up with up to 3 other players for 4-player online goodness or go old-school with 2-player split-screen couch sharing mayhem as you spend hours leveling up your character and equipping them with one of the millions of badass weapons. Borderlands 2 features a new array of procedurally generated guns, shields, grenades, artifacts, enemies and more. Choose one of the 4 new character classes to be taken through a carefully crafted and connected story to all new and surprising environments across the living planet of Pandora. Make new friends, arm them to the teeth and fight alongside them on your relentless quest for revenge and redemption.… Expand"
  },
  {
    "name": "World Soccer Winning Eleven 9",
    "details_link": "https://www.metacritic.com/game/xbox/world-soccer-winning-eleven-9",
    "publisher": "Konami",
    "release_date": "Feb  7 2006",
    "developers": [
      "KCET"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "2  Online",
    "genres": [
      "Sports",
      "Traditional",
      "Soccer",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/1/6bb9ed066d2d59e07d48bdcd1a13d7e6-98.jpg",
    "descriptions": "World Soccer Winning Eleven 9 is the latest version of Konami's soccer simulator series. Added this year are more clubs from the Italian Series A, Spanish La Liga, and Dutch Eredivisie Leagues, as well as a number of other individual clubs. One hundred thirty-six clubs in six differentWorld Soccer Winning Eleven 9 is the latest version of Konami's soccer simulator series. Added this year are more clubs from the Italian Series A, Spanish La Liga, and Dutch Eredivisie Leagues, as well as a number of other individual clubs. One hundred thirty-six clubs in six different leagues are available for play to get to the various cups featured in the game. Incrementally improved graphics and AI are also included. The game is online compatible, so you can play out rivalries across the globe.… Expand"
  },
  {
    "name": "Xenoblade Chronicles 3",
    "details_link": "https://www.metacritic.com/game/switch/xenoblade-chronicles-3",
    "publisher": "Nintendo",
    "release_date": "Jul 29 2022",
    "developers": [
      "Monolith Soft"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/1/554e5c12df59c112748102f6f0fa7b6b-98.jpg",
    "descriptions": "\"Fighting to liveand living to fight\" - A brand new RPG adventure awaits in Xenoblade Chronicles 3. Bringing together the futures of Xenoblade Chronicles and Xenoblade Chronicles 2, this title will take players to the world of Aionios, home to two hostile nations.  Keves: a nation where\"Fighting to liveand living to fight\" - A brand new RPG adventure awaits in Xenoblade Chronicles 3. Bringing together the futures of Xenoblade Chronicles and Xenoblade Chronicles 2, this title will take players to the world of Aionios, home to two hostile nations.  Keves: a nation where mechanical technology was developed. Their armies are composed of units consisting mainly of combat vehicles. They use units of small, mobile weapons operated by soldiers riding them. \r\rAgnus: a nation strong in ether, a magical technology. Their forces are built around units that specialise in ether combat, and they fight with small, mobile, autonomous weapons that use ether technology. \r\rSix soldiers hailing from these nations, will take part in a grand tale with life as its central theme. \r\rNoah: One of the protagonists of Xenoblade Chronicles 3 and a solider of Keves. Noah is also an \"off-seer\" who mourns for soldiers who've lost their lives on the battlefield. \r\rLanz: An ally of Noah's who wields a great sword that doubles as a shield. \r\rEunie: A childhood friend of Noah and Lanz who has a sharp tongue and rough personality. She specialises in healing her allies in battle. \r\rMio: The other protagonist of this story, Mio is a soldier of Agnus and an off-seer like Noah. \r\rTaion: A tactician who fights alongside Mio using his smarts and insight. \r\rSena: This soldier is an ally of Mio and Taion. Despite her petite figure, Sena wields immense physical strength!… Expand"
  },
  {
    "name": "Guitar Hero 5",
    "details_link": "https://www.metacritic.com/game/wii/guitar-hero-5",
    "publisher": "Activision",
    "release_date": "Sep  1 2009",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music",
      "Music"
    ],
    "meta_score": 89,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/8/14f8b887fb1a8278baba1f829a712901-98.jpg",
    "descriptions": "For the first time ever, players can customize the make-up of their band by rocking with any combination of instruments in-game: whether it be two guitars and two drums, or three guitars and a microphone, any combination is possible, allowing players to experience music their own way. BrandFor the first time ever, players can customize the make-up of their band by rocking with any combination of instruments in-game: whether it be two guitars and two drums, or three guitars and a microphone, any combination is possible, allowing players to experience music their own way. Brand new, innovative, easy-to-use gameplay modes like Party Play and RockFest put fun, competition and control at center stage as fans tailor the Guitar Hero experience to match their personal style and interests. For extended hours of entertainment, downloadable content from Guitar Hero World Tour is compatible with the game and can automatically be updated to include all of the upgrades and enhancements of Guitar Hero 5. Guitar Hero 5 features the strongest, most varied set list to-date comprised of master tracks from 85 of the hottest bands of today and the biggest classic acts including; Kings of Leon, The Rolling Stones, The White Stripes, Santana, Vampire Weekend, Tom Petty, Johnny Cash, Bob Dylan, plus more than 25 artists from a variety of music genres that are making their music video game debut. Among the first-time-ever features of Guitar Hero 5 are: Party Play, where players can jump in or drop out of gameplay seamlessly; RockFest, a comprehensive competitive experience available featuring five new head-to-head modes playable online or in your living room; and the ability to play the entire set-list from the first time the game is turned on. Guitar Hero 5 refines the player experience, enhances the art style and redesigns core features such as GHMusic StudioSM, making it the most accessible, fun-to-play and authentic experience for seasoned music gamers as well as first-time players. New innovations such as Band Moments, where bands are rewarded for hitting special note streams together and song challenges where gamers are tasked to play through a song a specific way, add a new competitive layer of excitement and accomplishment to the music rhythm genre. [Activision]… Expand"
  },
  {
    "name": "Ace Combat 04: Shattered Skies",
    "details_link": "https://www.metacritic.com/game/playstation-2/ace-combat-04-shattered-skies",
    "publisher": "Namco",
    "release_date": "Nov  1 2001",
    "developers": [
      "Namco"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Simulation",
      "Flight",
      "Modern Jet"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/6/06163e4546e5a8c3797942b0a497dc9b-98.jpg",
    "descriptions": "The Ace Combat series soars once again. Experience aerial combat like never before. A brand new gripping storyline and 18 fabulous missions will keep pilots-to-be on the edge of their seats. Released as \"Distant Thunder\" in UK & Europe. [Namco]"
  },
  {
    "name": "Max Payne",
    "details_link": "https://www.metacritic.com/game/pc/max-payne",
    "publisher": "Gathering",
    "release_date": "Jul 23 2001",
    "developers": [
      "Remedy Entertainment"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 4",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Modern",
      "Modern",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 9.0,
    "image": "https://static.metacritic.com/images/products/games/4/3e5d0af3f77db06317f9b81f00475ed7-98.jpg",
    "descriptions": "A story-driven third-person shooter with a realistic weapon setup including over a dozen real-life guns, all fitting the crime-story setting like a bullet in the head. The action is surrounded with more than 80 hand-painted comic-screens that enhance the game's gritty atmosphere andA story-driven third-person shooter with a realistic weapon setup including over a dozen real-life guns, all fitting the crime-story setting like a bullet in the head. The action is surrounded with more than 80 hand-painted comic-screens that enhance the game's gritty atmosphere and attitude, introduce the game's murderous cast of characters, and carry the plot from one location to the next.  [Gathering of Developers]… Expand"
  },
  {
    "name": "Final Fantasy VII Remake Intergrade",
    "details_link": "https://www.metacritic.com/game/playstation-5/final-fantasy-vii-remake-intergrade",
    "publisher": "Square Enix",
    "release_date": "Jun 10 2021",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/6/2b1c1c378846d0571fad0cd13ff0d718-98.jpg",
    "descriptions": "FINAL FANTASY VII REMAKE expands upon and reimagines the spectacular world of the original PlayStation game. It covers up through the escape from Midgar and is the first game in the FINAL FANTASY VII REMAKE project. INTERGRADE is a bundle that includes both REMAKE and the new episodeFINAL FANTASY VII REMAKE expands upon and reimagines the spectacular world of the original PlayStation game. It covers up through the escape from Midgar and is the first game in the FINAL FANTASY VII REMAKE project. INTERGRADE is a bundle that includes both REMAKE and the new episode featuring Yuffie. In her episode, play as the spirited ninja after she arrives in Midgar. There, she and another Wutaian operative are to rendezvous with Avalanche HQ, infiltrate the Shinra Building, and steal the conglomerate's most powerful materia. FINAL FANTASY VII REMAKE INTERGRADE takes advantage of the latest generation hardware and includes a wealth of graphical, gameplay and system enhancements for the PS5: \r\rImmerse yourself in the city of Midgar like never before, with improved textures, lighting, and background environments. Players can switch between two game modes:\r  \"Graphics Mode\" prioritizes 4K high-resolution graphics\r  \"Performance Mode\" prioritizes smooth action at 60 frames per second\r  Capture and share your memorable moments from the game with a fully customizable “Photo Mode”\r  Enjoy immersive battles by using the DualSense wireless controller, with its haptic feedback integration, and enjoy dynamic bike racing with its adaptive triggers.\r  New difficulty settings for ‘Classic Mode’ provide new ways to play\r  Jump into the action faster with optimized loading times\r… Expand"
  },
  {
    "name": "Persona 4 Golden",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/persona-4-golden",
    "publisher": "Sega",
    "release_date": "Jan 19 2023",
    "developers": [
      "Atlus"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 89,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/8/c3a016d0ed98fb9d8e8c6c56e18ebe4a-98.jpg",
    "descriptions": "Inabaa quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden.\r A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confrontingInabaa quiet town in rural Japan sets the scene for budding adolescence in Persona 4 Golden.\r A coming of age story that sets the protagonist and his friends on a journey kickstarted by a chain of serial murders. Explore meeting kindred spirits, feelings of belonging, and even confronting the darker sides of one's self. \r\rWith an overall Metacritic score of 93 and a multitude of awards, fan-adored Persona 4 Golden stands as one of the finest RPGs ever made, delivering on enthralling storytelling and quintessential Persona gameplay.\r Key Features include:\r * Enjoy gameplay with variable framerates\r* Experience the world of Persona on PC in Full HD\r* Steam Achievements and Trading Cards\r* Choose between Japanese and English VO… Expand"
  },
  {
    "name": "Hollow Knight: Voidheart Edition",
    "details_link": "https://www.metacritic.com/game/xbox-one/hollow-knight-voidheart-edition",
    "publisher": "Team Cherry",
    "release_date": "Sep 25 2018",
    "developers": [
      "Team Cherry"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "Platformer",
      "",
      "Metroidvania"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/0/d2baac910717bacf2285b1e32428fe1a-98.jpg",
    "descriptions": "Descend into the world of Hollow Knight, the award-winning action adventure of insects and heroes. Explore twisting caverns, ancient cities and deadly wastes. Battle tainted creatures and befriend bizarre bugs."
  },
  {
    "name": "3D Streets of Rage II",
    "details_link": "https://www.metacritic.com/game/3ds/3d-streets-of-rage-ii",
    "publisher": "Sega",
    "release_date": "Jul 23 2015",
    "developers": [
      "M2"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "3DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "2D"
    ],
    "meta_score": 89,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/2/e5093fc17f02e0c6dea3688bea9a9ff8-98.jpg",
    "descriptions": "Original rumblers Axel and Blaze slam the asphalt with bigger, better, totally devastating attacks! Skull-crushing ex-wrestler Max Thunder joins up with earth-shattering body slams and spinning fist attacks. New thrasher Skate slices punks with high speed in-line skate attacks and spinningOriginal rumblers Axel and Blaze slam the asphalt with bigger, better, totally devastating attacks! Skull-crushing ex-wrestler Max Thunder joins up with earth-shattering body slams and spinning fist attacks. New thrasher Skate slices punks with high speed in-line skate attacks and spinning jump kicks. Go maniac with jaw-shattering, bone-busting punches, head-cracking jump kicks and secret weapons. Gangs of dirt bikers dive into you from every side. Smash 'em with a pipe as they speed by. 16 gigantic megs of compound fractures! All new moves, and more of 'em! Bust knuckles with a friend in an all-new 2-player head-to-head mode!… Expand"
  },
  {
    "name": "Out of the Park Baseball 15",
    "details_link": "https://www.metacritic.com/game/pc/out-of-the-park-baseball-15",
    "publisher": "Out Of The Park Developments",
    "release_date": "Apr 21 2014",
    "platforms": "PC",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Baseball",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/0/399fc56221669e8ba696ad48f161b10d-98.jpg",
    "descriptions": "In OOTP 15 you guide your team to glory. Set up your roster, trade players, draft the next superstar, negotiate with free agents, discover talent in the rule-5 draft, keep an eye on your minor leaguers, scout foreign countries or other leagues, it's all here. On top of the GM features, OOTPIn OOTP 15 you guide your team to glory. Set up your roster, trade players, draft the next superstar, negotiate with free agents, discover talent in the rule-5 draft, keep an eye on your minor leaguers, scout foreign countries or other leagues, it's all here. On top of the GM features, OOTP sports a great baseball simulation engine with stunning statistical accuracy and extensive play-by-play. It is widely regarded as the most realistic baseball game available, by far! You call all the shots from the dugout and see the game unfold before your eyes.… Expand"
  },
  {
    "name": "MVP Baseball 2004",
    "details_link": "https://www.metacritic.com/game/gamecube/mvp-baseball-2004",
    "publisher": "EA Sports",
    "release_date": "Mar  9 2004",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/9/6f1603c819b08b5c44904dd4ff2a5b66-98.jpg",
    "descriptions": "Step up to the plate with MVP Baseball 2004.  The fundamentals of hitting, pitching, fielding, and base-running have been reproduced realistically to give you complete control over every aspect of the game.  From swinging for the fences or protecting the plate when you have a two-strikeStep up to the plate with MVP Baseball 2004.  The fundamentals of hitting, pitching, fielding, and base-running have been reproduced realistically to give you complete control over every aspect of the game.  From swinging for the fences or protecting the plate when you have a two-strike count, the all-new batting model provides unprecedented command of each type of swing in every situation.  With solid gameplay and many additional features such as Pitching Challenge and Dynasty Mode, MVP Baseball 2004 allows you to experience the game like never before.… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 2004",
    "details_link": "https://www.metacritic.com/game/gamecube/tiger-woods-pga-tour-2004",
    "publisher": "EA Sports",
    "release_date": "Sep 22 2003",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "GameCube"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Golf",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/4/8f20908075a65d85f1db901d83caf43f-98.jpg",
    "descriptions": "While professional golfer Tiger Woods has no equal on the PGA Tour, you now have the chance to build a golfer that's even better. Take your custom golfer through the trials and tribulations of all the courses in Tiger Woods PGA Tour 2004, earning cash to spend on new digs and advancedWhile professional golfer Tiger Woods has no equal on the PGA Tour, you now have the chance to build a golfer that's even better. Take your custom golfer through the trials and tribulations of all the courses in Tiger Woods PGA Tour 2004, earning cash to spend on new digs and advanced equipment. Use the analog stick to shape any shot type such as the flop or punch. Go head-to-head against the computer, a friend, or an online player with PS2's network adapter. With all the top competition on some of the most famous fairways and greens ever, this is the one of the most complete golf experiences yet. … Expand"
  },
  {
    "name": "Tom Clancy's Splinter Cell",
    "details_link": "https://www.metacritic.com/game/playstation-2/tom-clancys-splinter-cell",
    "publisher": "Ubisoft",
    "release_date": "Apr  8 2003",
    "developers": [
      "Ubisoft Shanghai"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "PlayStation 2"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Modern"
    ],
    "meta_score": 89,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/9/8f18c9c0dcc9a9cb64a56a23748e0c8b-98.jpg",
    "descriptions": "Infiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! You are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyberInfiltrate terrorists' positions, acquire critical intelligence by any means necessary, execute with extreme prejudice, and exit without a trace! You are Sam Fisher, a highly trained secret operative of the NSA's secret arm: Third Echelon. The world balance is in your hands, as cyber terrorism and international tensions are about to explode into WWIII. [Ubi Soft]… Expand"
  },
  {
    "name": "Max Payne",
    "details_link": "https://www.metacritic.com/game/xbox/max-payne",
    "publisher": "Rockstar Games",
    "release_date": "Dec 12 2001",
    "developers": [
      "neo Software"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "PlayStation 4",
      "Xbox"
    ],
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 89,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/8/5bfc7c178e20b8c14e7d3286a74d0131-98.jpg",
    "descriptions": "Max Payne is a man with nothing to lose--a fugitive undercover cop framed for murder, and now hunted by the cops and the mob.  As Payne, you'll uncover plot twists, engage in dramatic \"bullet-time\" firefights with thugs, and fight your way through an unforgiving New York blizzard.Max Payne is a man with nothing to lose--a fugitive undercover cop framed for murder, and now hunted by the cops and the mob.  As Payne, you'll uncover plot twists, engage in dramatic \"bullet-time\" firefights with thugs, and fight your way through an unforgiving New York blizzard.  Max can wield a variety of weapons including pistols, submachine guns, shotguns, sniper rifles, grenades, and Molotov cocktails.  Prepare yourself for an involving story combined with slick action.  … Expand"
  },
  {
    "name": "Fire Emblem: Three Houses",
    "details_link": "https://www.metacritic.com/game/switch/fire-emblem-three-houses",
    "publisher": "Nintendo",
    "release_date": "Jul 26 2019",
    "developers": [
      "Intelligent Systems",
      "Koei Tecmo Games"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/6/4ebedfcfe4cdedc50b6c60dd0ff81b24-98.jpg",
    "descriptions": "War is coming to the continent of Fódlan. Here, order is maintained by the Church of Seiros, which hosts the prestigious Officer's Academy within its headquarters. You are invited to teach one of its three mighty houses, each comprised of students brimming with personality and represented byWar is coming to the continent of Fódlan. Here, order is maintained by the Church of Seiros, which hosts the prestigious Officer's Academy within its headquarters. You are invited to teach one of its three mighty houses, each comprised of students brimming with personality and represented by a royal from one of three territories. As their professor, you must lead your students in their academic lives and in turn-based, tactical RPG battles wrought with strategic, new twists to overcome. Which house, and which path, will you choose?… Expand"
  },
  {
    "name": "Cuphead in the Delicious Last Course",
    "details_link": "https://www.metacritic.com/game/pc/cuphead-in-the-delicious-last-course",
    "publisher": "Studio MDHR",
    "release_date": "Jun 30 2022",
    "developers": [
      "Studio MDHR"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/8/c0cccba66ac10d9cfd53033095f21808-98.jpg",
    "descriptions": "Another helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, andAnother helping of classic Cuphead action awaits you in Cuphead - The Delicious Last Course! Brothers Cuphead and Mugman are joined by the clever, adventurous Ms. Chalice for a rollicking adventure on a previously undiscovered Inkwell Isle! With the aid of new weapons, magical charms, and Ms. Chalice’s unique abilities, players will take on a new cast of fearsome, larger than life bosses to assist the jolly Chef Saltbaker in Cuphead’s final challenging quest! … Expand"
  },
  {
    "name": "World in Conflict",
    "details_link": "https://www.metacritic.com/game/pc/world-in-conflict",
    "publisher": "Sierra Entertainment",
    "release_date": "Sep 18 2007",
    "developers": [
      "Massive Entertainment"
    ],
    "platforms": "PC",
    "num_players": "16  Online",
    "genres": [
      "Strategy",
      "Real-Time",
      "Modern",
      "General"
    ],
    "meta_score": 89,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/0/76a78ae4364aaa34d01b00d6cbd1b359-98.jpg",
    "descriptions": "War is Coming Home. West Germany, 1989. To avoid certain collapse, the Soviet army boldly advances into Europe. NATO responds only to be met on a second front -- a diversionary attack on the American homeland. You are a field commander, leading the era’s most powerful military machines inWar is Coming Home. West Germany, 1989. To avoid certain collapse, the Soviet army boldly advances into Europe. NATO responds only to be met on a second front -- a diversionary attack on the American homeland. You are a field commander, leading the era’s most powerful military machines in the campaign to retake America’s cities and suburbs. Superpowered Warfare - Unleash the arsenals of the great military superpowers in the gripping single-player story created by best-selling author and Cold War authority, Larry Bond. MassTech Engine - The latest version of Massive’s proprietary engine allows for a full 360° range of camera control, allowing you to get right down into the midst of battle. Demolish Everything - Destroy every object in the game – crush cars, destroy buildings, burn forests! Drop-in Multiplayer - Join on-going games and immediately help your team take control of the map. [Sierra]… Expand"
  },
  {
    "name": "Burnout Revenge",
    "details_link": "https://www.metacritic.com/game/xbox-360/burnout-revenge",
    "publisher": "Electronic Arts",
    "release_date": "Mar  7 2006",
    "developers": [
      "Criterion Games"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox 360"
    ],
    "num_players": "Up to 6 ",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Arcade",
      "Automobile"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/4/a7f8e8fc33a407223ed2a4bf920a398e-98.jpg",
    "descriptions": "Burnout Revenge lets gamers rip through rush hour traffic and lay waste to scores of rubbernecking roadhogs in an over-the-top scene of vehicular mayhem. In addition to tricked out new race, crash and road rage modes, Burnout Revenge takes the series' blistering speed and spectacularBurnout Revenge lets gamers rip through rush hour traffic and lay waste to scores of rubbernecking roadhogs in an over-the-top scene of vehicular mayhem. In addition to tricked out new race, crash and road rage modes, Burnout Revenge takes the series' blistering speed and spectacular destruction to dizzying new heights with an all-new Revenge mode, challenging gamers to battle the clock and unleash their frustrations on rush hour traffic. [Electronic Arts]… Expand"
  },
  {
    "name": "FIFA Soccer 11",
    "details_link": "https://www.metacritic.com/game/playstation-3/fifa-soccer-11",
    "publisher": "Electronic Arts",
    "release_date": "Sep 28 2010",
    "developers": [
      "EA Sports"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 22 ",
    "genres": [
      "Sports",
      "Traditional",
      "Team",
      "Soccer",
      "Sim",
      "Sim"
    ],
    "meta_score": 89,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/2/19cd963da830a8568150843c55cfa49e-98.jpg",
    "descriptions": "EA returns to the field with another installment in its long-running soccer series."
  },
  {
    "name": "NieR: Automata - The End of YoRHa Edition",
    "details_link": "https://www.metacritic.com/game/switch/nier-automata---the-end-of-yorha-edition",
    "publisher": "Square Enix",
    "release_date": "Oct  6 2022",
    "developers": [
      "Virtuos",
      "PlatinumGames"
    ],
    "platforms": "Switch",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Action RPG"
    ],
    "meta_score": 89,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/4/76851a66ee2c21d65e5d047a3ac8b04a-98.jpg",
    "descriptions": "NieR:Automata The End of YoRHa Edition is the Nintendo Switch™ version of NieR:Automata, an award-winning post-apocalyptic action RPG that has achieved deep-rooted popularity around the world. The distant future… Invaders from another world attack without warning, unleashing a new type ofNieR:Automata The End of YoRHa Edition is the Nintendo Switch™ version of NieR:Automata, an award-winning post-apocalyptic action RPG that has achieved deep-rooted popularity around the world. The distant future… Invaders from another world attack without warning, unleashing a new type of threat: weapons known as “machine lifeforms.” In the face of this insurmountable threat, mankind is driven from Earth and takes refuge on the Moon. As 2B, a member of the newly organized android military force YoRHa, players will immerse themselves in a ferocious battle to take back the planet.\r Experience a captivating story that goes beyond simple entertainment, inspiring a wide array of emotions as it unfolds through genre blending action in a beautifully desolate open world.\r This product includes the content of the \"3C3C1D119440927\" DLC.*\rThree types of colosseums are included, and three types of costumes based on characters from the related title, NieR Replicant, can be obtained as rewards.\r *To enjoy this content you will need to have progressed a certain way into the main story of the game. There are also some scenes during the progression of the main game scenario in which this content cannot be accessed.… Expand"
  },
  {
    "name": "Final Fantasy XIV: Stormblood",
    "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-xiv-stormblood",
    "publisher": "Square Enix",
    "release_date": "Jun 20 2017",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "PlayStation 4"
    ],
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer"
    ],
    "meta_score": 89,
    "users_score": 8.8,
    "image": "https://static.metacritic.com/images/products/games/8/ab19338149682bf32a2378575586652e-98.jpg",
    "descriptions": "Dive into the next chapter of the Final Fantasy XIV Online with its next expansion pack - Stormblood. Explore vast, new lands, including Ala Mhigo, and challenge new Primal threats across Eorzea as you embark on hundreds of new quests as the Warrior of Light. \r\rFEATURES\r\r\n* Level capDive into the next chapter of the Final Fantasy XIV Online with its next expansion pack - Stormblood. Explore vast, new lands, including Ala Mhigo, and challenge new Primal threats across Eorzea as you embark on hundreds of new quests as the Warrior of Light. \r\rFEATURES\r * Level cap increased from 60 -> 70\r* New jobs, including red mage\r* New exploration with swimming and diving\r* New areas to explore\r* A new primal  Lakshmi\r* New dungeons\r* New High-level Raid The Bend of Time  Omega\r* New alliance raid Return to Ivalice\r* The Forbidden Land of Eureka\r* New gear and crafting recipes\r* A fourth residential district\r* Expanded item inventory and changes to the battle system… Expand"
  },
  {
    "name": "Deus Ex: Human Revolution",
    "details_link": "https://www.metacritic.com/game/playstation-3/deus-ex-human-revolution",
    "publisher": "Square Enix",
    "release_date": "Aug 23 2011",
    "developers": [
      "Eidos Montreal"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "Sci-Fi",
      "Sci-Fi",
      "General",
      "First-Person",
      "Sci-Fi"
    ],
    "meta_score": 89,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/5/1eeb6ec9edb4432c31b57b80aa3bd3bf-98.jpg",
    "descriptions": "In Deus Ex: Human Revolution you play Adam Jensen, a security specialist, handpicked to oversee the defense of one of America's most experimental biotechnology firms. But when a black ops team breaks in and kills the scientists you were hired to protect, everything you thought you knew aboutIn Deus Ex: Human Revolution you play Adam Jensen, a security specialist, handpicked to oversee the defense of one of America's most experimental biotechnology firms. But when a black ops team breaks in and kills the scientists you were hired to protect, everything you thought you knew about your job changes. At a time when scientific advancements are routinely turning athletes, soldiers and spies into super-enhanced beings, someone is working very hard to ensure mankind's evolution follows a particular path. You need to discover why - because the decisions you take and the choices you make will be the only things that can determine mankind's future.… Expand"
  },
  {
    "name": "Stardew Valley",
    "details_link": "https://www.metacritic.com/game/xbox-one/stardew-valley",
    "publisher": "Chucklefish",
    "release_date": "Dec 14 2016",
    "developers": [
      "Sickhead Games",
      "LLC",
      "Eric Barone",
      "Sickhead Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General"
    ],
    "meta_score": 89,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/4/c950466e06b155009de1f0dc84bc951f-98.jpg",
    "descriptions": "You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation cameYou've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness!\r Features:\r *    Turn your overgrown field into a lively farm! Raise animals, grow crops, start an orchard, craft useful machines, and more! You'll have plenty of space to create the farm of your dreams.\r *    Improve your skills over time. As you make your way from a struggling greenhorn to a master farmer, you'll level up in 5 different areas: farming, mining, combat, fishing, and foraging. As you progress, you'll learn new cooking and crafting recipes, unlock new areas to explore, and customize your skills by choosing from a variety of professions.\r *    Become part of the local community. With over 30 unique characters living in Stardew Valley, you won't have a problem finding new friends! Each person has their own daily schedule, birthday, unique mini-cutscenes, and new things to say throughout the week and year. As you make friends with them, they will open up to you, ask you for help with their personal troubles, or tell you their secrets! Take part in seasonal festivals such as the luau, haunted maze, and feast of the winter star.\r *    Explore a vast, mysterious cave. As you travel deeper underground, you'll encounter new and dangerous monsters, powerful weapons, new environments, valuable gemstones, raw materials for crafting and upgrading tools, and mysteries to be uncovered.\r *    Breathe new life into the valley. Since JojaMart opened, the old way of life in Stardew Valley has changed. Much of the town's infrastructure has fallen into disrepair. Help restore Stardew Valley to it's former glory by repairing the old community center, or take the alternate route and join forces with Joja Corporation.\r *    Court and marry a partner to share your life on the farm with. There are 10 available bachelors and bachelorettes to woo, each with unique character progression cutscenes. Once married, your partner will live on the farm with you. Who knows, maybe you'll have kids and start a family?\r *    Spend a relaxing afternoon at one of the local fishing spots. The waters are teeming with seasonal varieties of delicious fish. Craft bait, bobbers, and crab pots to help you in your journey toward catching every fish and becoming a local legend!\r *    Donate artifacts and minerals to the local museum.\r *    Cook delicious meals and craft useful items to help you out. With over 100 cooking and crafting recipes, you'll have a wide variety of items to create. Some dishes you cook will even give you temporary boosts to skills, running speed, or combat prowess. Craft useful objects like scarecrows, oil makers, furnaces, or even the rare and expensive crystalarium.\r *    Customize the appearance of your character and house. With hundreds of decorative items to choose from, you'll have no trouble creating the home of your dreams!\r *    Xbox controller support (with rumble)! (Keyboard still required for text input)\r *    Over two hours of original music.… Expand"
  },
  {
    "name": "Castlevania: Dawn of Sorrow",
    "details_link": "https://www.metacritic.com/game/ds/castlevania-dawn-of-sorrow",
    "publisher": "Konami",
    "release_date": "Oct  4 2005",
    "developers": [
      "Konami"
    ],
    "platforms": "DS",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Role-Playing",
      "Platformer",
      "Platformer",
      "Action RPG",
      "2D",
      "2D",
      ""
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/2/9c772ee4eab23fb7873b8584596dee61-98.jpg",
    "descriptions": "The year is 2036, one year after the events of \"Castlevania: Aria of Sorrow.\" Soma Cruz finds himself at the center of a mysterious cult's plan to resurrect their evil lord and master Dracula. In order to save himself and protect the lives of those he loves, Soma must infiltrate the enemy'sThe year is 2036, one year after the events of \"Castlevania: Aria of Sorrow.\" Soma Cruz finds himself at the center of a mysterious cult's plan to resurrect their evil lord and master Dracula. In order to save himself and protect the lives of those he loves, Soma must infiltrate the enemy's home base, a towering replica of Dracula's castle that is teaming with monstrous creatures. Defeat foes with the \"Magic Seal\" system using the touch screen. Exchange souls with other players via the DS wireless connection. Features an incredible musical score, next-gen graphics & stunning special effects. [Konami]… Expand"
  },
  {
    "name": "NBA Street Vol. 2",
    "details_link": "https://www.metacritic.com/game/xbox/nba-street-vol-2",
    "publisher": "Electronic Arts",
    "release_date": "Apr 28 2003",
    "developers": [
      "Electronic Arts"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Basketball",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/0/1283b80f82d7ac954e7a09805c0576bd-98.jpg",
    "descriptions": "Basketball returns to the streets in NBA Street Vol. 2, featuring more players, electrifying moves, and online multiplayer battles.  Defeat the best players in the game today and even bring legends such as Dr. J, Magic, Bird, Wilt, and Moses out of retirement for some on-court brawling.  NBABasketball returns to the streets in NBA Street Vol. 2, featuring more players, electrifying moves, and online multiplayer battles.  Defeat the best players in the game today and even bring legends such as Dr. J, Magic, Bird, Wilt, and Moses out of retirement for some on-court brawling.  NBA Street Vol. 2 features all-new spectacular dunks, dribbles, and passes that'll take show-stopping Gamebreakers to the next level.  You can take your game against computer opponents or friends, or play with up to three other players online.  Are you good enough to rule the streets?… Expand"
  },
  {
    "name": "Sonic Adventure 2",
    "details_link": "https://www.metacritic.com/game/dreamcast/sonic-adventure-2",
    "publisher": "Sega",
    "release_date": "Jun 18 2001",
    "developers": [
      "Sonic Team"
    ],
    "platforms": "Dreamcast",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 89,
    "users_score": 8.5,
    "image": "https://static.metacritic.com/images/products/games/3/22bd968d826b8d1ba532731b6b241ae9-98.jpg",
    "descriptions": "The world can be a confusing and dangerous place, especially when there are two of you! Sonic must face the new, villainous Shadow but you choose how the story unfolds - you can be a hero, or make friends with the dark-side! In the most thrilling Sonic Adventure ever created there are 6The world can be a confusing and dangerous place, especially when there are two of you! Sonic must face the new, villainous Shadow but you choose how the story unfolds - you can be a hero, or make friends with the dark-side! In the most thrilling Sonic Adventure ever created there are 6 playable characters, new moves to master, over 30 challenging stages and 3 different 2 player games - will you save the world or conquer it? … Expand"
  },
  {
    "name": "NASCAR Racing 4",
    "details_link": "https://www.metacritic.com/game/pc/nascar-racing-4",
    "publisher": "Sierra Entertainment",
    "release_date": "Feb  6 2001",
    "developers": [
      "Papyrus"
    ],
    "platforms": "PC",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Stock Car",
      "Stock Car",
      "Automobile"
    ],
    "meta_score": 89,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/2/33cc0efa22c3201dfd477ee49f242e3c-98.jpg",
    "descriptions": "Puts you in the driver's seat of a 750-hp NASCAR Winston Cup car that responds to your every move and leaves your heart pounding! Papyrus originated the NASCAR sim and consistently sets the standard in racing games. [Sierra]"
  },
  {
    "name": "Duke Nukem 3D",
    "details_link": "https://www.metacritic.com/game/pc/duke-nukem-3d",
    "publisher": "GT Interactive",
    "release_date": "Jan 29 1996",
    "developers": [
      "3D Realms"
    ],
    "platforms": [
      "iPhone/iPad",
      "Xbox 360",
      "PC"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 89,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/3/c890ed05c7b7e74cddead28b61e53fb4-98.jpg",
    "descriptions": "Prepare yourself for the ultimate 3D Slugfest. Murderous aliens have landed in futuristic Los Angeles, and the humans suddenly find themselves atop the endangered species list. The odds are a million-to-one. Just the way Duke likes it. Dive into realistic 3D scenarios, with 28 totallyPrepare yourself for the ultimate 3D Slugfest. Murderous aliens have landed in futuristic Los Angeles, and the humans suddenly find themselves atop the endangered species list. The odds are a million-to-one. Just the way Duke likes it. Dive into realistic 3D scenarios, with 28 totally realistic levels, as you drive the sinister aliens through the streets of LA, out to an orbiting station, and onto the surface of the moon itself! An you'll be armed to the teeth with 10 hi-tech weapons. Clear crowds with the pump action Assault Shotgun, blast through enemies and walls with the Rocket Propelled Grenade, splat enemies under foot after blasting them with the Shrinker, cut through trouble with the 3-barel Ripper machine gun, set DukeMatch traps with the wall-mounted Laser Mine, watch enemies shatter after cooling them off with the Freeze Cannon, and 4 more! [FormGen]… Expand"
  },
  {
    "name": "L.A. Noire",
    "details_link": "https://www.metacritic.com/game/playstation-3/la-noire",
    "publisher": "Rockstar Games",
    "release_date": "May 17 2011",
    "developers": [
      "Team Bondi"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One",
      "PlayStation 3"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Adventure",
      "First-Person",
      "3D",
      "Open-World",
      "Modern",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 89,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/70086a8d0a8ed234d67e2569413b6845-98.jpg",
    "descriptions": "L.A. Noire is a next generation crime thriller developed by Team Bondi, a new Australian based studio founded by Brendan McNamara, of \"The Getaway.\" L.A Noire is an interactive detective story set in the classic noir period of the late 1940's. It blends action, detection and complexL.A. Noire is a next generation crime thriller developed by Team Bondi, a new Australian based studio founded by Brendan McNamara, of \"The Getaway.\" L.A Noire is an interactive detective story set in the classic noir period of the late 1940's. It blends action, detection and complex storytelling and draws players into an open-ended challenge to solve a series of gruesome murders. Set in a perfectly recreated Los Angeles before freeways, with a post-war backdrop of corruption, drugs and jazz, L.A. Noire truly blends cinema and gaming. [Rockstar Games]… Expand"
  },
  {
    "name": "It Takes Two",
    "details_link": "https://www.metacritic.com/game/playstation-4/it-takes-two",
    "publisher": "Electronic Arts",
    "release_date": "Mar 26 2021",
    "developers": [
      "Hazelight"
    ],
    "platforms": [
      "PC",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Action Adventure",
      "Linear"
    ],
    "meta_score": 89,
    "users_score": 8.9,
    "image": "https://static.metacritic.com/images/products/games/3/5ac52fd4a9a2b9d739064798db8ad20f-98.jpg",
    "descriptions": "From Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the criticallyFrom Hazelight comes It Takes Two an innovative co-op adventure where uniquely varied gameplay and emotional storytelling intertwine in a fantastical journey. Founded to push the creative boundaries of what's possible in games, Hazelight is the award-winning studio behind the critically acclaimed A Way Out and Brothers: A Tale of Two Sons.\r Something out of the ordinary\rBring your favorite co-op partner and together step into the shoes of May and Cody. As the couple is going through a divorce, through unknown means their minds are transported into two dolls which their daughter, Rose, made to represent them. Now they must reluctantly find a way to get back into their bodies, a quest which takes them through the most wild, unexpected and fantastical journey imaginable.… Expand"
  },
  {
    "name": "Tony Hawk's Pro Skater 1 + 2",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/tony-hawks-pro-skater-1-+-2",
    "publisher": "Activision",
    "release_date": "Mar 26 2021",
    "developers": [
      "Vicarious Visions"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Sports",
      "Individual",
      "Skate / Skateboard"
    ],
    "meta_score": 89,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/3/7ecda64cab2372ec7fcdf0fdc1917859-98.jpg",
    "descriptions": "Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk's Pro Skater & Tony Hawk's Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more."
  },
  {
    "name": "Okami HD",
    "details_link": "https://www.metacritic.com/game/switch/okami-hd",
    "publisher": "Capcom",
    "release_date": "Aug  9 2018",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 89,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/3/2c53d63d8d42a4dc74fd09e420e08940-98.jpg",
    "descriptions": "In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't.In Okami, the player takes the role of the mythical sun goddess Amaterasu, in the form of a wolf. Her task is to restore color (or 'life') to the world by destroying the monsters who have stolen it. Since Amaterasu is a diety, there are naturally people who worship her and people who don't. The more people who worship her (as a result of her restoring color and doing other good deeds for them), the more powerful she becomes.… Expand"
  }
]