[{"name": "Harry Potter and the Half-Blood Prince", "details_link": "https://www.metacritic.com/game/wii/harry-potter-and-the-half-blood-prince", "publisher": "EA Games", "release_date": "Jun 30 2009", "developers": ["EA Bright Light"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 60, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/88e668256b785758fc0eb96122e7c6ab-98.jpg", "descriptions": "In Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the finalIn Harry Potter and the Half-Blood Prince, Voldemort is tightening his grip on both the Muggle and wizarding worlds and Hogwarts is no longer the safe haven it once was. Harry suspects that dangers may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle that he knows is fast approaching. Together they work to find the key to unlock Voldemort's defenses and, to this end, Dumbledore recruits his old friend and colleague, the well-connected and unsuspecting bon vivant Professor Horace Slughorn, whom he believes holds crucial information. Meanwhile, the students are under attack from a very different adversary as teenage hormones rage across the ramparts. Harry finds himself more and more drawn to Ginny, but so is Dean Thomas. And Lavender Brown has decided that Ron is the one for her, only she hadn't counted on Romilda Vane's chocolates! And then there's Hermione, simmering with jealously but determined not to show her feelings. As romance blossoms, one student remains aloof. He is determined to make his mark, albeit a dark one. Love is in the air, but tragedy lies ahead and Hogwarts may never be the same again. In the game, players return to Hogwarts to help Harry survive a fraught sixth year. They also have a chance to engage in exciting wizard duels, mix and brew magical ingredients in Potions class and take to the air to lead the Gryffindor Quidditch team to victory. Players may even get sidetracked by Ron's romantic entanglements as they journey towards a dramatic climax and discover the identity of the Half-Blood Prince. [Electronic Arts]… Expand"}, {"name": "Harvey Birdman: Attorney at Law", "details_link": "https://www.metacritic.com/game/wii/harvey-birdman-attorney-at-law", "publisher": "Capcom", "release_date": "Jan  8 2008", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/ba43ef06a838b8c73cfe9c08120cc43f-98.jpg", "descriptions": "Harvey Birdman: Attorney at Law is a fully animated interactive adventure game that merges the fun and mayhem of the popular Adult Swim TV show with Capcom's unique style of gameplay. Players step into the shiny wingtips of Harvey Birdman, a third-rate superhero turned third-rate defenseHarvey Birdman: Attorney at Law is a fully animated interactive adventure game that merges the fun and mayhem of the popular Adult Swim TV show with Capcom's unique style of gameplay. Players step into the shiny wingtips of Harvey Birdman, a third-rate superhero turned third-rate defense attorney charged with exonerating parodied classic cartoon characters. Over the course of the game, players must guide Harvey through a series of odd and comical cases. Each of the game's five interactive stories takes the winged crusader of justice to familiar locations from the TV show. In order to prove his client's innocence, Harvey must peruse the scene of the crime, gather evidence, talk with other cartoon characters, occasionally have drinks with opposing council, and of course, tear holes – no matter how ridiculous – in the testimony provided by the witness for the prosecution. Harvey must bring the whole story together to defend his client in a court where anything can happen... including a confrontation with the prosecution who brandishes a Shrink Ray Gun. [Capcom]… Expand"}, {"name": "Gigantosaurus: The Game", "details_link": "https://www.metacritic.com/game/switch/gigantosaurus-the-game", "publisher": "Outright Games", "release_date": "Mar 27 2020", "developers": ["Cyber Group Studios"], "platforms": ["PC", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/d91a163dc0eeb6705d1ad09f7867d60e-98.jpg", "descriptions": "Explore and race across the prehistoric world of Gigantosaurus. This Disney dino tale is part saving the world, part super race, and all giant fun. Rocky, Tiny, Mazu and Bill have scary problems – like the meteor that’s blocked up Giganto’s volcano! Only you and your dino friends can dare toExplore and race across the prehistoric world of Gigantosaurus. This Disney dino tale is part saving the world, part super race, and all giant fun. Rocky, Tiny, Mazu and Bill have scary problems – like the meteor that’s blocked up Giganto’s volcano! Only you and your dino friends can dare to solve puzzles and save the day – but you might need Giganto’s powers too! And the end of each story is the start of a super rally to the next zone. Will you be the most roarsome adventurer or the fastest racer?… Expand"}, {"name": "Achtung! Cthulhu Tactics", "details_link": "https://www.metacritic.com/game/xbox-one/achtung!-cthulhu-tactics", "publisher": "Ripstone", "release_date": "Nov 23 2018", "developers": ["Auroch Digital"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/10b176e18371e42fa5b1fd8bc1e48a6d-98.jpg", "descriptions": "Explore the Lovecraft-meets-WW2 universe of Achtung! Cthulhu Tactics, a turn-based tactical strategy game set in the award-winning Achtung! Cthulhu universe."}, {"name": "Avatar: The Last Airbender", "details_link": "https://www.metacritic.com/game/gamecube/avatar-the-last-airbender", "publisher": "THQ", "release_date": "Oct 10 2006", "developers": ["AWE Games"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/6a0dbfdcefeddee58864b8ed4dc2fcce-98.jpg", "descriptions": "Water. Earth. Fire. Air.\r Are you ready to face your destiny?\r\n\r\nJourney through 6 exotic locations filled with adventure to help Aang fulfill his destiny to master the bending arts and become the Avatar - for only the Avatar can stop the ruthless might of the Fire Nation! Defeat hordes ofWater. Earth. Fire. Air.\r Are you ready to face your destiny?\r Journey through 6 exotic locations filled with adventure to help Aang fulfill his destiny to master the bending arts and become the Avatar - for only the Avatar can stop the ruthless might of the Fire Nation! Defeat hordes of bizarre enemies and perform noble deeds on your quest to save the world.… Expand"}, {"name": "Speed Kings", "details_link": "https://www.metacritic.com/game/xbox/speed-kings", "publisher": "Acclaim", "release_date": "Jun  3 2003", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 60, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/53a225fce0b4b7a4c90e60c9a4da8ba1-98.jpg", "descriptions": "It will take nerves of steel and lightning-fast reflexes to make your way through the crowded streets of Speed Kings. In the world of street motorcycle racing, you'll weave through traffic, pull off flashy stunts, run from police, and race to the finish line. Your high-performanceIt will take nerves of steel and lightning-fast reflexes to make your way through the crowded streets of Speed Kings. In the world of street motorcycle racing, you'll weave through traffic, pull off flashy stunts, run from police, and race to the finish line. Your high-performance bikes--including sport, road, touring, and custom models--each have their own type of handling and top speeds. Perform jumps, power-downs, skids, wheelies, and stoppies, but be careful--failed attempts at these tricks result in real-time damage to both bike and rider.… Expand"}, {"name": "NFL GameDay 2003", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-gameday-2003", "publisher": "SCEA", "release_date": "Aug 12 2002", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/ca68e1ba4b4670e5d2cc839858ffde59-98.jpg", "descriptions": "New Online Mode: Challenge an opponent from anywhere in the country. Create your own buddy list and chat online while battling out on the gridiron. \"AWOL\" mode means a computer will take over for an unattended controller during an online matchup. New, 60 frames per second gameplay puts theNew Online Mode: Challenge an opponent from anywhere in the country. Create your own buddy list and chat online while battling out on the gridiron. \"AWOL\" mode means a computer will take over for an unattended controller during an online matchup. New, 60 frames per second gameplay puts the power and athleticism of the NFL in the palm of your hand. Feel the most responsive control over extremely detailed and fluid animations including 200 new tackles, catches and blocks. Over 70 new \"break tackle\" animations mean the outcome of each and every play will be different to ensure the highest replay value ever. Revamped catching, blocking and passing systems put you on the field and simulate the action of a real NFL game. Put any offensive skilled player in motion with the press of a button to keep the defense guessing.… Expand"}, {"name": "Wanted: Dead", "details_link": "https://www.metacritic.com/game/xbox-series-x/wanted-dead", "publisher": "110 Industries", "release_date": "Feb 14 2023", "developers": ["110 Industries", "Soleil Ltd."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/6fe22eb953020b98b6d95290a332d2ca-98.jpg", "descriptions": "Wanted: Dead is a new hybrid slasher/shooter from the makers of Ninja Gaiden and Dead or Alive. The game follows a week in life of the Zombie Unit, an elite Hong Kong police squad on a mission to uncover a major corporate conspiracy. \r\rPlay as Lt. Hannah Stone, a hardboiled Hong Kong cop,Wanted: Dead is a new hybrid slasher/shooter from the makers of Ninja Gaiden and Dead or Alive. The game follows a week in life of the Zombie Unit, an elite Hong Kong police squad on a mission to uncover a major corporate conspiracy. \r\rPlay as Lt. Hannah Stone, a hardboiled Hong Kong cop, and plow through mercenaries, gang members and private military contractors in a spectacular cyberpunk adventure.… Expand"}, {"name": "IL-2 Sturmovik: Cliffs of Dover", "details_link": "https://www.metacritic.com/game/pc/il-2-sturmovik-cliffs-of-dover", "publisher": "Ubisoft", "release_date": "Apr 26 2011", "developers": ["1C: Maddox Games"], "platforms": "PC", "num_players": "64+  Online", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/92e717ae479d146decbe0ff31734f4a1-98.jpg", "descriptions": "IL-2 Sturmovik: Cliffs of Dover takes place in 1940 during the pivotal aerial battle for the skies over Britain between the British, the German and the Italian air forces."}, {"name": "Pac-Man & Galaga Dimensions", "details_link": "https://www.metacritic.com/game/3ds/pac-man-galaga-dimensions", "publisher": "Namco Bandai Games", "release_date": "Jul 26 2011", "developers": ["Namco Bandai Games"], "platforms": "3DS", "genres": ["Action", "Miscellaneous", "General", "General", "Compilation"], "meta_score": 60, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/2925f5ff16e49f7fa6a2e914d80c9208-98.jpg", "descriptions": "Pac-Man's world has been unhinged in Pac-Man Tilt.  Take control of Pac-Man in twisting 2D platforming levels filled with perilous obstacles, power pellets and wandering ghosts.  Using the accelerometer capabilities of the Nintendo 3DS system, players will be able to literally tilt Pac-Man'sPac-Man's world has been unhinged in Pac-Man Tilt.  Take control of Pac-Man in twisting 2D platforming levels filled with perilous obstacles, power pellets and wandering ghosts.  Using the accelerometer capabilities of the Nintendo 3DS system, players will be able to literally tilt Pac-Man's world from side to side in order to solve devious environmental puzzles and sneak past roaming enemies.  Pac-Man can also use pinball flippers, spring boards and other objects placed throughout each level to help him reach each level's goal.  Tilting the screen when Pac-Man has a running start will cause him to roll into a ball, giving him an extra boost of speed and access to narrow tunnels.  Strategically using all of Pac-Man's abilities will be the only way to complete this all-new and exciting adventure.\r Galaga 3D Impact immerses players into the role of a gunner on a space ship against an all-out war with the dreaded Galaga aliens.  Using the Nintendo 3DS system's gyroscopic and 3D technology, players are able to maneuver their perspective within the seat of the turret to aim and shoot enemies as they try to lay siege against the human race.  The player’s real-life movements correspond to the action represented on-screen in an impressive mash-up of arcade shooter and virtual reality.… Expand"}, {"name": "Mega Man X Legacy Collection 2", "details_link": "https://www.metacritic.com/game/switch/mega-man-x-legacy-collection-2", "publisher": "Capcom", "release_date": "Jul 24 2018", "developers": ["Capcom", "Digital Works Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 60, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/93dd27e5eb3c02090423b076c365c6fc-98.jpg", "descriptions": "Mega Man X Legacy Collection 2 includes Mega Man X5, X6, X7, and X8."}, {"name": "TMNT", "details_link": "https://www.metacritic.com/game/wii/tmnt", "publisher": "Ubisoft", "release_date": "Mar 20 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 60, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/1884c757796e1006ed5ad6f61cd7c7ca-98.jpg", "descriptions": "Based on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they faceBased on the all-new CGI TMNT movie, Ubisoft's TMNT video game takes place in New York City, a city plagued with fast-moving shadows and attacks from strange creatures. Could the wealthy and mysterious Max Winters be involved? New York City needs the Turtles now more than ever but they face their most trying time both as heroes and as brothers. With the fate of the City and their family at stake, it's up to Leonardo with Zen Master Splinter to restore unity and ninja discipline to the Turtles. In this highly immersive experience, join the Ninja Turtles team and experience intense acrobatic navigation, collaborative combat and powerful fighting moves. Engage in over-the-top Ninja action to reunite the Turtles and save New York City. Leonardo, Raphael, Donatello and Michelangelo are playable, each with unique acrobatic moves, weapons and combat skills, such as Michelangelo’s fast nunchuk face slap and Raphael’s powerful Sai throw. [Ubisoft]… Expand"}, {"name": "Assassin's Creed III Remastered", "details_link": "https://www.metacritic.com/game/switch/assassins-creed-iii-remastered", "publisher": "Ubisoft", "release_date": "May 21 2019", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/d8664832f346024e0ec5647903a255af-98.jpg", "descriptions": "Relive the American Revolution or experience it for the first time in Assassin's Creed® III Remastered, with enhanced graphics and improved gameplay mechanics. Plus, Assassin's Creed Liberation Remastered and all solo DLC content are included."}, {"name": "Warriors Orochi 4", "details_link": "https://www.metacritic.com/game/switch/warriors-orochi-4", "publisher": "Koei Tecmo Games", "release_date": "Oct 16 2018", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/a12985d9f9a8d8d07326f6743cbb41fd-98.jpg", "descriptions": "A collaboration starring heroes from DYNASTY WARRIORS and SAMURAI WARRIORS. A roster of 170 playable characters! Five new characters - Zeus, Athena, Ares, Perseus, and Odin join the battle. Introducing \"Magic\" to the series, you can now experience even more thrilling and intense Musou Action."}, {"name": "BlackSite: Area 51", "details_link": "https://www.metacritic.com/game/pc/blacksite-area-51", "publisher": "Midway", "release_date": "Nov 12 2007", "developers": ["Midway Studios - Austin"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "10  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 60, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/3d132f202054645a55e0578db1107ed9-98.jpg", "descriptions": "Featuring a powerful single-player campaign, along with multiple online multiplayer modes,\rBlackSite: Area 51 delivers vicious combat action, next generation graphics and A.I., and a plethora of powerful weapons and vehicles.  Set in present day, players take the role of a decoratedFeaturing a powerful single-player campaign, along with multiple online multiplayer modes,\rBlackSite: Area 51 delivers vicious combat action, next generation graphics and A.I., and a plethora of powerful weapons and vehicles.  Set in present day, players take the role of a decorated military veteran charged by the government to lead a squadron of \"secret soldiers,\" each with his/her own specialty skill set, into the Rachel, Nevada area to fight off the invasion of unidentified enemy races. The player’s modern-day emotions and fears are driven into a world charged with grave responsibility affecting lives hanging in the balance and eventually finding himself torn between his professional orders and his own ethical standards.  In the end, only the actions of the player and his squad can shape the outcome of BlackSite: Area 51 during this potentially pivotal moment in history. [Midway]… Expand"}, {"name": "Metal Gear Survive", "details_link": "https://www.metacritic.com/game/playstation-4/metal-gear-survive", "publisher": "Konami", "release_date": "Feb 20 2018", "developers": ["Konami"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 60, "users_score": 1.4, "image": "https://static.metacritic.com/images/products/games/5/960bdb8d4d62d9408c95c08cf72efbd9-98.jpg", "descriptions": "Metal Gear Survive picks up from the ending of METAL GEAR SOLID V: GROUND ZEROES, to an alternate timeline caused by unexplained wormholes forming in the sky."}, {"name": "Super Neptunia RPG", "details_link": "https://www.metacritic.com/game/playstation-4/super-neptunia-rpg", "publisher": "Idea Factory", "release_date": "Jun 25 2019", "developers": ["Artisan Studios"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 60, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/8/027d29c87c73e46462ced4dddd2954e1-98.jpg", "descriptions": "There was once a primitive form of entertainment software that ruled the world: 2D games.In one of infinite dimensions, the world of Gamindustri exists...\na world where 2D games reign supreme.\n\nAn organization fiercely devoted to these games rules over this vibrant world.\nThey are known asThere was once a primitive form of entertainment software that ruled the world: 2D games.In one of infinite dimensions, the world of Gamindustri exists...a world where 2D games reign supreme.An organization fiercely devoted to these games rules over this vibrant world.They are known as Bombyx Mori and their devotion comes with a heavy price.Citizens of Gamindustri are forced to offer 2D games to Bombyx Mori as taxes.Those who dare to use new technologies or create games that don't meettheir standards risk being banished to the Trial Grounds.It is in this Gamindustri, a dark world with no real future in sight, that a girl wakes from her sleep.Her name is Neptune, and with a strange book in hand, she sets off on the journey of a Hero.… Expand"}, {"name": "SiNG Party", "details_link": "https://www.metacritic.com/game/wii-u/sing-party", "publisher": "Nintendo", "release_date": "Nov 18 2012", "developers": ["FreeStyleGames"], "platforms": "Wii U", "num_players": "1-5 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 60, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/c1435b3186ad2303160dc7959cfc9726-98.jpg", "descriptions": "An new singing and dancing franchise for the Wii U makes for an instant party in your house. All can join in together and contribute to the game, choosing from fifty songs from most genres. Face your friends in the room and put on your best show. While the performer uses the GamePad and micAn new singing and dancing franchise for the Wii U makes for an instant party in your house. All can join in together and contribute to the game, choosing from fifty songs from most genres. Face your friends in the room and put on your best show. While the performer uses the GamePad and mic to sing, everybody else in the room becomes embroiled using cues from the screen.… Expand"}, {"name": "Karateka", "details_link": "https://www.metacritic.com/game/xbox-360/karateka", "publisher": "D3Publisher", "release_date": "Nov  7 2012", "developers": ["Liquid Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General", "Fighting", "2D"], "meta_score": 60, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/855465a4a378d38d96588a5b31e2dcdb-98.jpg", "descriptions": "Jordan Mechner returns to game development for the first time since Prince of Persia: Sands of Time with a downloadable remake of his Apple II action hit from 1984."}, {"name": "The Technomancer", "details_link": "https://www.metacritic.com/game/playstation-4/the-technomancer", "publisher": "Focus Home Interactive", "release_date": "Jun 28 2016", "developers": ["Spiders"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 60, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/9c52ea20967836dd78d81bbc080caa0d-98.jpg", "descriptions": "Spiders are back with The Technomancer, a new post-apocalyptic RPG set in a cyberpunk world for PlayStation 4, Xbox One and PC set on Mars during the War of Water, where an aspiring Technomancer faces a myriad of questions as his future grows threatened by the secrets of his past."}, {"name": "Asphalt: Urban GT", "details_link": "https://www.metacritic.com/game/ds/asphalt-urban-gt", "publisher": "Ubisoft", "release_date": "Nov 17 2004", "developers": ["Gameloft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 60, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/b7875c62678749bfb4dc66e4a1242d99-98.jpg", "descriptions": "Asphalt Urban GT combines simulation realism and arcade action for the Nintendo DS. Jump in a wide range of licensed high-performance cars and hit tracks from all over the world. Win races, collect prize money, and purchase new rides and tweak current ones. Watch your progress turn-by-turnAsphalt Urban GT combines simulation realism and arcade action for the Nintendo DS. Jump in a wide range of licensed high-performance cars and hit tracks from all over the world. Win races, collect prize money, and purchase new rides and tweak current ones. Watch your progress turn-by-turn on the bottom display of the Nintendo DS. Spy on opponents and gauge when to take risks and when to proceed with caution. Asphalt Urban GT features more than thirty options for tuning, engine maintenance and bodywork. Players can race against each other through each twisting turn. Single Race allows up to four players to race head-to-head, while Championship mode allows up to four players to hit some of the championship tracks from the solo Evolution mode. Cop Chase is a two-player cat and mouse mode in which the cops attempt to capture and ?lock on? their opponent for five seconds to claim victory. [Nintendo]… Expand"}, {"name": "Worms Forts: Under Siege", "details_link": "https://www.metacritic.com/game/pc/worms-forts-under-siege", "publisher": "Sega", "release_date": "Nov 24 2004", "developers": ["Team17"], "platforms": "PC", "num_players": "4  Online", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Artillery"], "meta_score": 60, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/47e7a1b2a49e1a46d5dbfe35503fd753-98.jpg", "descriptions": "Worms Forts: Under Siege! puts players in command of a crack team of up to four fort-dwelling worms. Set in the cartoon environments that will be very familiar to Worms fans, players direct their worm garrison to construct defenses to maximize strategic advantages, expand castles, seizeWorms Forts: Under Siege! puts players in command of a crack team of up to four fort-dwelling worms. Set in the cartoon environments that will be very familiar to Worms fans, players direct their worm garrison to construct defenses to maximize strategic advantages, expand castles, seize valuable victory locations and of course, build massively destructive weapons to eliminate their opponents' fortifications. Players can test their mettle in a single-player game by battling through the 20 missions, or they can take on up to four friends in the frenzy of destruction that is Fort vs. Fort mode. Massive weapons and massive destruction, including catapults, cannons, giant crossbows, bows and arrows, rocket launchers, air strikes, napalm... even nuclear strikes; For the first time in the history of the series, players can build their own castle, including towers, walls, citadels and keeps. Each building will offer unique special powers and weapons, and poor choices may leave players lagging in the arms race. [Acclaim]… Expand"}, {"name": "Growlanser: Heritage of War", "details_link": "https://www.metacritic.com/game/playstation-2/growlanser-heritage-of-war", "publisher": "Atlus Co.", "release_date": "Sep 18 2007", "developers": ["Career Soft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "General"], "meta_score": 60, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/8912b5f2028aad3a58f142e17d81feba-98.jpg", "descriptions": "On an island continent shrouded in darkness and bounded on every shore by an impassable veil, war rages among desperate inhabitants fighting for survival. A mysterious famine has ravaged the land, leaving its denizens to struggle over what little fertile land remains. There is no safe haven;On an island continent shrouded in darkness and bounded on every shore by an impassable veil, war rages among desperate inhabitants fighting for survival. A mysterious famine has ravaged the land, leaving its denizens to struggle over what little fertile land remains. There is no safe haven; land that war has left untouched is still threatened by the Screapers, fierce and powerful monsters steadily encroaching on the cities of men. Hope is fading - who will rise to save this dying land? Growlanser: Heritage of War features a sweeping story arc spanning 5 chapters, with additional chapters to unlock. The story unfolds through hand-drawn animation and character portraits by artist Satoshi Urushihara. Strategic Party-based Combat: Use an advanced troop command system to give orders to your allies – smart tactics are the key to victory. Manage Your Character's Ability Tree: Change your character's abilities based on the needs of the situation. As your character levels, so too do your Ability Plates. With the Friendship and Personality Rating System, your personality can either limit or enhance your interactions with others; the outcome of your encounters depends entirely on your behavior. Mold a protagonist as ill-tempered or good-natured as you desire. And if you're brave enough, reveal your true feelings to a companion; if they come to feel the same way about you, you'll be rewarded with a bonus hand-drawn character-specific ending animation that puts the icing on the cake. [Atlus USA]… Expand"}, {"name": "Pokemon Mystery Dungeon: Explorers of Time", "details_link": "https://www.metacritic.com/game/ds/pokemon-mystery-dungeon-explorers-of-time", "publisher": "Nintendo", "release_date": "Apr 20 2008", "developers": ["ChunSoft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Roguelike"], "meta_score": 60, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/88f1b5d31218c84de44cf74122293502-98.jpg", "descriptions": "In this pair of action-packed adventures, players journey as actual Pokemon through a fantastic land untouched by humans. Before the game starts, players take a test to help them figure out which of 16 Pokemon best represents their personalities. Players then experience their adventureIn this pair of action-packed adventures, players journey as actual Pokemon through a fantastic land untouched by humans. Before the game starts, players take a test to help them figure out which of 16 Pokemon best represents their personalities. Players then experience their adventure through the eyes of a Pokemon as they explore the land and embark on an epic journey through time and darkness. They talk and team up with other Pokemon to set out on an epic voyage while navigating an endless array of randomly generated dungeons. More than 490 Pokemon populate these new games, guaranteeing strategic, intense battles and infinite possibilities, no matter which Pokemon players become. To widen their circle of Pokemon friends, Nintendo Wi-Fi Connection lets users engage in wireless rescue operations and send alerts to their friends via e-mail or mobile text message. [Nintendo]… Expand"}, {"name": "Zombie Driver: Immortal Edition", "details_link": "https://www.metacritic.com/game/switch/zombie-driver-immortal-edition", "publisher": "EXOR Studios", "release_date": "Jul 25 2019", "developers": ["EXOR Studios"], "platforms": ["Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "General", "Vehicle", "Combat"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f0a2570e26805a3848773bb29c97dd3e-98.jpg", "descriptions": "New and specially improved version of the zombie smashing hit, exclusively for the Xbox One. Insane mix of cars, speed, explosions, blood and zombies! Fight through an epic narrative campaign or test yourself in the Slaughter and Blood Race modes. Engage huge bosses, save survivors, driveNew and specially improved version of the zombie smashing hit, exclusively for the Xbox One. Insane mix of cars, speed, explosions, blood and zombies! Fight through an epic narrative campaign or test yourself in the Slaughter and Blood Race modes. Engage huge bosses, save survivors, drive crazy vehicles such as a bulldozer, fire truck or even a tank and smash everything in your way. Take part in the Blood Race tournament - chase other cars and take them down without mercy on brutal racing tracks. Jump into the Slaughter mode and survive as long as possible on specially crafted arenas. Experience super smooth gameplay at 60 frames per second and extra crisp visuals. Zombie Driver Ultimate Edition includes all DLC content that was ever created for the game.… Expand"}, {"name": "All-Star Fruit Racing", "details_link": "https://www.metacritic.com/game/playstation-4/all-star-fruit-racing", "publisher": "PQube", "release_date": "Aug 21 2018", "developers": ["3DClouds.it", "3DClouds"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 60, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/9/c1fc7080dc5b3db7621b7c2fb3f2eb62-98.jpg", "descriptions": "Go bananas for a lightning-fast kart racer for all ages and abilities. All-Star Fruit Racing propels players into vibrant worlds filled with fast action."}, {"name": "Deadpool", "details_link": "https://www.metacritic.com/game/playstation-4/deadpool", "publisher": "Activision", "release_date": "Nov 17 2015", "developers": ["High Moon Studios", "Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Beat-'Em-Up", "Linear", "Third-Person", "3D", "Arcade"], "meta_score": 60, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/287210b86634f36e77a65e16cf27f986-98.jpg", "descriptions": "Some of you may know me as the Merc with the Mouth. And it's time to get mouthy. Prepare to get Deadpooled. Couple things I'd like to get off my chest: I'm a mercenary for hire with an accelerated healing factor. I like to run my mouth. Some say I'm unstable but I'm very stable. (What aboutSome of you may know me as the Merc with the Mouth. And it's time to get mouthy. Prepare to get Deadpooled. Couple things I'd like to get off my chest: I'm a mercenary for hire with an accelerated healing factor. I like to run my mouth. Some say I'm unstable but I'm very stable. (What about that time we beat the dude with his own arms?) (That doesn't count) And if you want to know what gets me going in the mornings, it's chimichangas! (Mmmmm Chimichangas) WHOA, I feel better now. All right. I'm gonna battle for the safety of humans (and bewbs!) and mutants. (and bewbs!) That's right, $#*! just got real!… Expand"}, {"name": "Tarr Chronicles", "details_link": "https://www.metacritic.com/game/pc/tarr-chronicles", "publisher": "cdv Software", "release_date": "Sep 18 2007", "developers": ["Akella", "Quasar"], "platforms": "PC", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/5e9c68969036a6078e8ff7f94992957a-98.jpg", "descriptions": "Lost in space and deep behind enemy lines, the player must don an elite fighter pilot's uniform and defend the galaxy's last hope in Tarr Chronicles, an arcade-style space combat simulation. At your disposal are dozens of detailed high-tech fighters bristling with cannons and rocketLost in space and deep behind enemy lines, the player must don an elite fighter pilot's uniform and defend the galaxy's last hope in Tarr Chronicles, an arcade-style space combat simulation. At your disposal are dozens of detailed high-tech fighters bristling with cannons and rocket launchers, yours to fly against an unstoppable alien menace - the De'Khete. Intelligent squad mates with unique personalities will assist you in frenzied white-knuckle space battles between vast fleets of fighters and massive capital ships. From fully-customizable equipment to collectible badges and fast-action combat encounters, Tarr Chronicles will keep you pinned to your seat.… Expand"}, {"name": "Generation of Chaos", "details_link": "https://www.metacritic.com/game/psp/generation-of-chaos", "publisher": "NIS America", "release_date": "Feb 28 2006", "developers": ["Idea Factory"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/2f6fa10edba3bfcd1b35ac1be3a53af1-98.jpg", "descriptions": "Battles for world domination have been dragging on for generations.  Now Allen of Zodia rises to end all wars and bring peace to the world.  After the opening story, the player uses the strategy mode to build and strengthen the kingdom.  In the beginning, the kingdom is small and weak.Battles for world domination have been dragging on for generations.  Now Allen of Zodia rises to end all wars and bring peace to the world.  After the opening story, the player uses the strategy mode to build and strengthen the kingdom.  In the beginning, the kingdom is small and weak.  However, as you progress through the game, the player can conquer neighboring kingdoms and stretch its ruling powers throughout the land of Duke.  Unlike other RPGs for the PSP(TM), Generation of Chaos features massive, sixty-character battles as well as sneaky espionage tactics. Other features include: Massive 30 vs. 30 real time army battles; Customizable troops and commanders; Freedom to fight with or against neighboring kingdoms. [NIS America]… Expand"}, {"name": "Resistance: Burning Skies", "details_link": "https://www.metacritic.com/game/playstation-vita/resistance-burning-skies", "publisher": "SCEA", "release_date": "May 29 2012", "developers": ["Nihilistic"], "platforms": "PlayStation Vita", "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 60, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/1e26a6ceeb91b3d60f6400b2f788ef9d-98.jpg", "descriptions": "As New Jersey fire fighter and National Guardsman Tom Riley, you come face to face with the brutal Chimeran invasion force in this shooter built from the ground up for Vita. This latest installment in the franchise focuses on a new mission that parallels and complements the existingAs New Jersey fire fighter and National Guardsman Tom Riley, you come face to face with the brutal Chimeran invasion force in this shooter built from the ground up for Vita. This latest installment in the franchise focuses on a new mission that parallels and complements the existing Resistance storyline.… Expand"}, {"name": "Kandagawa Jet Girls", "details_link": "https://www.metacritic.com/game/playstation-4/kandagawa-jet-girls", "publisher": "XSEED Games", "release_date": "Aug 18 2020", "developers": ["Honey Parade Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Racing", "Arcade", "Other"], "meta_score": 60, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/9b982d53b07e0c6b2d10dcb0509ee14b-98.jpg", "descriptions": "There is more to racing than increase your speed. A story of girls devoting their youth to jet races, with character designs by Hanaharu Naruko. The girls make friends and form bonds through their shared love of jet racing in this ensemble coming-of-age story. Jet races are contested byThere is more to racing than increase your speed. A story of girls devoting their youth to jet races, with character designs by Hanaharu Naruko. The girls make friends and form bonds through their shared love of jet racing in this ensemble coming-of-age story. Jet races are contested by teams of two, offering accessible strategic action that anyone can enjoy! A range of weapons and jet machines is at your disposal in these exhilarating races through a fictional near-future Tokyo. In a world where jet racing has become a major sport, teams of Jetters and Shooters know how to make a splash. The Jetter pilots the jet machine, while the offensive Shooter attacks opponents with water guns. Enter Rin Namiki, a young lady whose mother was once a legendary Jetter. She dreams of becoming a jet racer herself, leaving her home island and setting out to Asakusa, Tokyo. She encounters the aloof and beautiful Misa Aoi, and the two become partners. Little by little, the two deepen their bond as they race against their rivals.\r… Expand"}, {"name": "Shaun White Snowboarding", "details_link": "https://www.metacritic.com/game/pc/shaun-white-snowboarding", "publisher": "Ubisoft", "release_date": "Dec  2 2008", "developers": ["Ubisoft"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 60, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/ac164fba173f3eae8b52b92bf568658b-98.jpg", "descriptions": "Developed in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride. OpenDeveloped in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride. Open World Mountains: Choose how you ride in open-world mountains across the world. Conquer extreme peak conditions, create your own paths in the back country, or compete with fellow riders in the terrain parks. Your Friends Are Always Around: Play in a world where your friends are always around. Do your own runs on mountains populated by real gamers, or join your friends for a quick session from any mountain. More than Just Snowboarding: Have fun with your friends on and off the board! Throw snowballs, hike to access secret spots, film your friends doing ripping tricks. You can also upload your videos online to share with the world. Ride Your Way: Express yourself through tricks, riding styles, and highly customizable avatars – both in single-player and in the online world. Use the intuitive dual analog control to pull off a huge variety of tricks that express your style. Next-Gen Technology: Built on the Assassin's Creed engine, this game creates a massive world with gorgeous visuals and realistic NPC interactions. This is also the first time a snowboarding game is completely driven by physics instead of animation. Authentic Snowboarding: Ubisoft has worked closely with Shaun White to infuse the gaming experience with authenticity, personality and humor. Shaun is a friend and mentor in the game, and will help you with your skills. And, if you are deemed worthy, you may even be able to play as Shaun in the game. [Ubisoft]… Expand"}, {"name": "Cold War", "details_link": "https://www.metacritic.com/game/xbox/cold-war", "publisher": "DreamCatcher Interactive", "release_date": "Sep 27 2005", "developers": ["Mindware Studios"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/2f61017bb13256d7ae3be380e94fce25-98.jpg", "descriptions": "Cold War follows a freelance journalist who finds himself in the midst of an international conspiracy that aims to control the U.S.S.R. Twelve hours after arrival in Moscow for a routine story, he has been stripped of all possessions, beaten unconscious, and thrown into the KGB's politicalCold War follows a freelance journalist who finds himself in the midst of an international conspiracy that aims to control the U.S.S.R. Twelve hours after arrival in Moscow for a routine story, he has been stripped of all possessions, beaten unconscious, and thrown into the KGB's political prison. Now you must match wits and strength against the powerful Russian enemy using only recovered weapons and improvised gadgets to eliminate opponents. Whether you choose to evade or overcome elite Soviet forces, you must defeat the conspiracy before you're sent to a Siberian prison camp or killed.… Expand"}, {"name": "One Piece: Burning Blood", "details_link": "https://www.metacritic.com/game/xbox-one/one-piece-burning-blood", "publisher": "Bandai Namco Games", "release_date": "May 31 2016", "developers": ["Spike Chunsoft"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One"], "genres": ["Action", "Fighting", "3D"], "meta_score": 60, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/d8241e14e255b92ba3d4e03cfec235af-98.jpg", "descriptions": "Embark with the Straw Hat Crew and collect your bounty in this anime fighter. Use Devil Fruit abilities, Haki techniques, and punishing combos to turn the tide in the ultimate One Piece battle royale. Step into the New World with over the top head to head combat featuring all the action,Embark with the Straw Hat Crew and collect your bounty in this anime fighter. Use Devil Fruit abilities, Haki techniques, and punishing combos to turn the tide in the ultimate One Piece battle royale. Step into the New World with over the top head to head combat featuring all the action, drama and comedy of this infamous pirate saga.… Expand"}, {"name": "Commandos 2 HD Remaster", "details_link": "https://www.metacritic.com/game/pc/commandos-2-hd-remaster", "publisher": "Kalypso", "release_date": "Jan 24 2020", "developers": ["Yippee Entertainment LTD"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 60, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/5/42bd2d6244c800b3a4b86908af570ffc-98.jpg", "descriptions": "Relive the real-time tactics masterpiece that defined the genre like no other: Originally developed by the legendary Pyro Studios, Commandos 2 - HD Remaster is a true homage to one of gaming's most celebrated masterpieces. Experience Commandos 2 Men of Courage like never before in highRelive the real-time tactics masterpiece that defined the genre like no other: Originally developed by the legendary Pyro Studios, Commandos 2 - HD Remaster is a true homage to one of gaming's most celebrated masterpieces. Experience Commandos 2 Men of Courage like never before in high definition with reworked controls, UI and tutorial.Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of notoriously demanding missions set in World War II. Go covert into various environments based on authentic World War II locations and lead your team of commandos against overwhelming odds, operate covertly and turn the tide of war.… Expand"}, {"name": "Gauntlet: Dark Legacy", "details_link": "https://www.metacritic.com/game/gamecube/gauntlet-dark-legacy", "publisher": "Midway", "release_date": "Mar  6 2002", "developers": ["Midway"], "platforms": "GameCube", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 60, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/43e9a424874507f3c9511b78b7b9be23-98.jpg", "descriptions": "Gauntlet's hack-and-slash gameplay continues in Gauntlet: Dark Legacy. You and up to three of your friends must work as a team through eight dangerous worlds. As one of eight different characters, you'll vanquish creatures, evade traps, and search for treasure. Character-based power attacks,Gauntlet's hack-and-slash gameplay continues in Gauntlet: Dark Legacy. You and up to three of your friends must work as a team through eight dangerous worlds. As one of eight different characters, you'll vanquish creatures, evade traps, and search for treasure. Character-based power attacks, magic potions, new power-ups, and combination moves add to the mayhem. The game save system allows players to transfer evolving characters from their own machine to a friend's to take on the dungeon together.… Expand"}, {"name": "The Mysterious Cities of Gold: Secret Paths", "details_link": "https://www.metacritic.com/game/wii-u/the-mysterious-cities-of-gold-secret-paths", "publisher": "Ynnis Interactive", "release_date": "Nov 21 2013", "developers": ["Neko Entertainment"], "platforms": ["3DS", "iPhone/iPad", "PC", "Wii U"], "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 60, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/6aab9da3f323b969e3620ea65c737a34-98.jpg", "descriptions": "In Mysterious Cities of Gold : Secret Paths, you get to incarnate Esteban, Zia and Tao on a quest for the new city of gold, right in the heart of Imperial China. Thanks to the heroesÃ¢â‚¬â„¢ specific attributes, solve the puzzles and escape ZarÃƒÂ¨sÃ¢â‚¬â„¢ hostile men!"}, {"name": "Carrier Command: Gaea Mission", "details_link": "https://www.metacritic.com/game/pc/carrier-command-gaea-mission", "publisher": "Rising Star Games", "release_date": "Sep 28 2012", "developers": ["Bohemia Interactive"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "Real-Time", "3D", "First-Person", "Sci-Fi", "Sci-Fi", "Command"], "meta_score": 60, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/ec114e5ab06862aa0ee20bb481e034d7-98.jpg", "descriptions": "Carrier Command: Gaea Mission, set in the Gaea Universe and based on a story adapted from the science fiction trilogy of novels, reinvents the classic gameplay of the original Carrier Command released in 1988 in next-gen experience."}, {"name": "Dungeon Explorer: Warriors of Ancient Arts", "details_link": "https://www.metacritic.com/game/ds/dungeon-explorer-warriors-of-ancient-arts", "publisher": "Hudson Entertainment", "release_date": "Feb 19 2008", "developers": ["Amble"], "platforms": "DS", "num_players": "1-3 ", "genres": ["Role-Playing", "General", "General"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/949554f49db322ec242a2fceb8811a98-98.jpg", "descriptions": "The DS version picks up a few centuries after the PSP version, and follows the story of heroes who rise to fight against the evil Demon God and his legions of the undead.  Dungeon Explorer: Warriors of Ancient Arts is a fully customizable adventure; throwing hundreds of weapons, skills, andThe DS version picks up a few centuries after the PSP version, and follows the story of heroes who rise to fight against the evil Demon God and his legions of the undead.  Dungeon Explorer: Warriors of Ancient Arts is a fully customizable adventure; throwing hundreds of weapons, skills, and fighting styles your way while keeping the classic game’s exciting multiplayer element intact. [Hudson]… Expand"}, {"name": "Spyro: A Hero's Tail", "details_link": "https://www.metacritic.com/game/playstation-2/spyro-a-heros-tail", "publisher": "VU Games", "release_date": "Nov  3 2004", "developers": ["Eurocom Entertainment Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 60, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/9506943f8a499fbaa1e334a273cf0de5-98.jpg", "descriptions": "Spyro must save the Dragon Realms from the Evil Red Dragon who has planted light-sapping Dark Gems all over the Dragon Realms in an attempt to capture and control the world. With the help of his allies, Spyro must seek out and destroy all of the Dark Gems to return the lands back to normalSpyro must save the Dragon Realms from the Evil Red Dragon who has planted light-sapping Dark Gems all over the Dragon Realms in an attempt to capture and control the world. With the help of his allies, Spyro must seek out and destroy all of the Dark Gems to return the lands back to normal and to save the Dragon Realms from the evil dragon's tyrannical control. The fierce purple dragon will travel across dark, mysterious lands in which the environments shift from evil to good in real-time -- affecting enemies, music, lighting, objects, sky and more. Outfitted with mighty new abilities including the Wall Kick, Tail Swing and Ledge Grab, Spyro will fight his enemies with powered-up breath attacks -- burning opponents with Flame Breath, deep-freezing rivals with Freeze Breath, obstructing adversaries with Water Breath and destroying mechanical enemies with Electric Breath. In addition to playing as the heroic leader Spyro, gamers will also have the opportunity to play as weapons master Hunter the Cheetah, dive-bombing penguin Sgt. Byrd, loyal sidekick Sparx the Dragonfly or the all-new weapons-equipped, climbing Blink the Mole. [Vivendi Universal]… Expand"}, {"name": "Rayman Arena", "details_link": "https://www.metacritic.com/game/gamecube/rayman-arena", "publisher": "Ubisoft", "release_date": "Sep 24 2002", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 60, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/8c4ae36e2452ed25bdae6a232b7fffef-98.jpg", "descriptions": "Rayman Arena puts you in a competitive crash course. As any member of the cast of Rayman 2, you must smoke the competition on challenging race courses or incite a firefight in the battle arena. Take risks, use tricks, and trip up opponents as you sprint, slide, climb, and helicopter throughRayman Arena puts you in a competitive crash course. As any member of the cast of Rayman 2, you must smoke the competition on challenging race courses or incite a firefight in the battle arena. Take risks, use tricks, and trip up opponents as you sprint, slide, climb, and helicopter through 12 courses in an all-out rush for the checkered flag. Each of the gladiator-style arenas features its own set of power-ups, traps, and special ammo. You can also compete with up to four players in multiplayer action.… Expand"}, {"name": "Big Scale Racing", "details_link": "https://www.metacritic.com/game/pc/big-scale-racing", "publisher": "HD Interactive", "release_date": "Aug 19 2002", "developers": ["BumbleBeast"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 60, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/44c83cc91dd1b905d902a5c7bc654d2f-98.jpg", "descriptions": "Big Scale Racing is high paced rubber burning action. Race against devilish smart drifting competitors with a 4WD arcade car or select a Big Scale RC precision simulation and start a Multiplay Race against your friend! Big Scale Racing has a series of detailed cars, set-ups and highlyBig Scale Racing is high paced rubber burning action. Race against devilish smart drifting competitors with a 4WD arcade car or select a Big Scale RC precision simulation and start a Multiplay Race against your friend! Big Scale Racing has a series of detailed cars, set-ups and highly detailed racetracks. As many as 240 individual opponents are waiting for you. RC drivers around the world know how exciting close racing at high pace is, now you can also enjoy this compelling sport using the high tech 3D visual, audio and dynamics simulations of BSRacing. Easy installation & set-up ensures you can drive in minutes with keyboard, joystick or wheel. Not recommended for the faint hearted. [HD Interactive]… Expand"}, {"name": "Army Men: Sarge's Heroes", "details_link": "https://www.metacritic.com/game/dreamcast/army-men-sarges-heroes", "publisher": "Midway", "release_date": "Oct 30 2000", "developers": ["Saffire"], "platforms": "Dreamcast", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 60, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/163451add54418ef3975111f62961218-98.jpg", "descriptions": "As Sarge, you must rescue your trusted commandos from the clutches of the evil general plastero. Enjoy tense commando action in oe of 14 different missions as sarge rolls, dives and climbs through dangerous enemy environments. Good Luck, Soldier!"}, {"name": "Naruto Shippuden: Legends: Akatsuki Rising", "details_link": "https://www.metacritic.com/game/psp/naruto-shippuden-legends-akatsuki-rising", "publisher": "Namco Bandai Games America", "release_date": "Oct  6 2009", "developers": ["Racjin"], "platforms": "PSP", "genres": ["Action", "Adventure", "General", "General"], "meta_score": 60, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/40e73518159a66093ebe8134e7994639-98.jpg", "descriptions": "Based on the popular NARUTO Shippuden animated series from VIZ Media, players assume control of over 10 of their favorite ninja, including the dreaded Akatsuki. NARUTO Shippuden: Legends: Akatsuki Rising promises to deliver fierce ninja action as players re-live the NARUTO ShippudenBased on the popular NARUTO Shippuden animated series from VIZ Media, players assume control of over 10 of their favorite ninja, including the dreaded Akatsuki. NARUTO Shippuden: Legends: Akatsuki Rising promises to deliver fierce ninja action as players re-live the NARUTO Shippuden storyline and experience a brand new adventure. Naruto and his friends are in for the fight of their lives as they search for Gaara, the fifth Kazekage, who has been kidnapped by the dreaded Akatsuki organization.  It's a race against time as the Akatsuki attempts to release Shukaku, the demon sealed inside Gaara. NARUTO Shippuden: Legends: Akatsuki Rising boasts streamlined controls for the PSP, ensuring exciting, fast-paced tactical battles making best use of each character’s Jutsus.  Aim and time the powerful Jutsu attacks with a simple button commands and devastate the enemies by entering Hypermode.  As characters defeat the enemies or take damage, the Hyper Gauge will start to fill which enhance the Jutu or unlocks new Jutus. Players will be able to gain advantage in the heat of a battle by selecting two support characters to form a three-man team for each mission.  Utilize the different skills each character brings and combine their attacks with yours to discover ultimate combos in defeating enemies. NARUTO Shippuden: Legends: Akatsuki Rising incorporates multiple modes of play including two-player cooperative or versus play via ad-hoc local wireless network.  Original Mode lets players experience the Gaara Retrieval Arc as they battle enemies through lush, 3D anime inspired environments. Scenario Mode introduces all-new side-missions to pick up Skill Scrolls which increase your character's abilities including attack, defense, health and other numerous indicators reflected through all modes. Akatsuki Mode lets players gain control of members of the Akatsuki organization for the first time in a brand-new storyline, discovering the Akatsuki's true intentions while Naruto was searching for Gaara.  Finally, find out who the best ninja is with Versus Mode by battling against a friend or the computer in one-on-one fights. [Namco Bandai Games]… Expand"}, {"name": "Time Crisis 4", "details_link": "https://www.metacritic.com/game/playstation-3/time-crisis-4", "publisher": "Bandai Namco Games", "release_date": "Nov 20 2007", "developers": ["Nex Entertainment"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Light Gun", "Light Gun"], "meta_score": 60, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/41c4c19f46ff7054fbf819447625ab23-98.jpg", "descriptions": "The newest installment in the popular action-shooter series propels the franchise into the next generation, with an in-depth First Person Shooter mode, High-Definition graphics and a newly designed Guncon to complete the total Time Crisis experience. Players are given the task of preventingThe newest installment in the popular action-shooter series propels the franchise into the next generation, with an in-depth First Person Shooter mode, High-Definition graphics and a newly designed Guncon to complete the total Time Crisis experience. Players are given the task of preventing a top secret weapon from falling into the hands of international terrorists. With 4 modes of gameplay delivered in true HD, players have a vast gaming experience to enjoy. Featuring a new dual analog stick design, the next-gen Guncon 3 is capable of delivering entertainment to any home theater setup, supporting both High Definition displays and Standard Definition displays. New to the Time Crisis franchise, the FPS mode allows players to move freely through stages. In addition to basic game controls such as switching weapons, changing camera angles and character movement, a full feature set of gameplay actions including crouching, jumping, sniping provide a completely immersive FPS gameplay experience. A vast assortment of upgradeable weapons, unlockable bonus weapons and the ability to capture enemy machine guns mounts, make Time Crisis 4 the most in-depth and expansive Time Crisis title yet. [Namco Bandai Games]… Expand"}, {"name": "Mega Man Star Force: Pegasus", "details_link": "https://www.metacritic.com/game/ds/mega-man-star-force-pegasus", "publisher": "Capcom", "release_date": "Aug  7 2007", "developers": ["Capcom"], "platforms": "DS", "num_players": "6  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 60, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/7261bf70f60aadc4b1f2c06dc10f3636-98.jpg", "descriptions": "Mega Man Star Force introduces a new lead character, a boy named Subaru Hoshikawa, whose astronaut father has disappeared after a mysterious incident at the satellite station. Fond memories of spending time with his father have inspired Subaru's interests in the stars and what lies beyond.Mega Man Star Force introduces a new lead character, a boy named Subaru Hoshikawa, whose astronaut father has disappeared after a mysterious incident at the satellite station. Fond memories of spending time with his father have inspired Subaru's interests in the stars and what lies beyond. One day, Subaru heads to the observation deck and puts on a pair of \"visualizer\" glasses that had belonged to his father. These allow the wearer to see all the electric connections that exist between spaces. When he puts on these special goggles, a specific wave is triggered, summoning the presence of a mysterious alien life form named Warlock who had escaped from the planet FM. Dangerous creatures from that planet have come to attack Earth, so they must join together in order to defeat these menacing forces. Combining with Warlock enables Subaru to transform into Mega Man and enter the Wave Road. Features two coexisting worlds – players can navigate the real world as Subaru and transform into Mega Man to travel across Wave Road. Three stellar versions call upon the power of the elements to offer distinct advantages: Pegasus – based on the water element, Ice Pegasus can instantly freeze an opponent with its special Ice Slash; Leo – turning up the heat, Fire Leo uses a special Flame Burner attack that can incinerate enemies in its path; Dragon – the ferocious Green Dragon draws upon the power of wood with a Wood Shot move that fires a cluster of razor sharp leaves to slash enemies to bits.… Expand"}, {"name": "Zombie Driver", "details_link": "https://www.metacritic.com/game/pc/zombie-driver", "publisher": "ValuSoft", "release_date": "Dec  4 2009", "developers": ["EXOR Studios"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Driving", "Racing", "Arcade", "Futuristic", "Futuristic"], "meta_score": 60, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/0f51c1d63acda9ba2263b809257380f7-98.jpg", "descriptions": "As the name suggests there are zombies and there is driving in the game. The goal is to rescue survivors from a zombie infested city... No it's not just an excuse for killing innocent zombies! Well... maybe it is... :) but they are not innocent, they are zombies and they are evil!!! [Exor]"}, {"name": "Heatseeker", "details_link": "https://www.metacritic.com/game/playstation-2/heatseeker", "publisher": "Codemasters", "release_date": "May  1 2007", "developers": ["IR Gurus"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 60, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/c881f9fe5f8d161a6311f53023601927-98.jpg", "descriptions": "(Coming to the US market on May 1)  Designed to be an incredible lock-on/shake-off experience, Heatseeker reinvents missile combat to give gamers a massive rush of destruction. Featuring collection of current and near-future military fighter jets, Heatseeker's arsenal includes the stealthy(Coming to the US market on May 1)  Designed to be an incredible lock-on/shake-off experience, Heatseeker reinvents missile combat to give gamers a massive rush of destruction. Featuring collection of current and near-future military fighter jets, Heatseeker's arsenal includes the stealthy F-22 Raptor, the classic F-15 Eagle, the cutting-edge F35 Lightening II, and the aerodynamically advanced Russian SU-47 Berkut. Heatseeker straps players into the pilot's seat and deliver a white-knuckle ride that'll have them clutching the joypad as they engage in face-melting 6G turns and fight against a seemingly-impossible amount of airborne enemies. And when gamers launch a strike, they follow their missiles as they ruthlessly hone in on their targets via the Impact Cam. Delivering cinematic 3rd-person camera cutaway scenes, the Impact Cam reveals the results of attacks in all their devastating glory from all kinds of dynamic angles, complete with jaw-dropping explosions and smoke trails. With missions across the U.S., down to the Caribbean, across Antarctica and into the Far East, it's high-velocity combat all the way that'll see players constantly switching from predator to prey as an enemy missiles lock on. [Codemasters]… Expand"}, {"name": "Blade Dancer: Lineage of Light", "details_link": "https://www.metacritic.com/game/psp/blade-dancer-lineage-of-light", "publisher": "NIS America", "release_date": "Jul 18 2006", "developers": ["Hit Maker"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 60, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/486d9cd373a30644d05d4016c3d669e6-98.jpg", "descriptions": "In a world protected by the gentle Prismatic Moon, an ancient evil is stirring. The Dread Knight has reappeared to wreak havoc across the land, and the Dark Lord gathers his terrible strength. The world's only hope rests in the hands of a reluctant young adventurer named Lance. Discover yourIn a world protected by the gentle Prismatic Moon, an ancient evil is stirring. The Dread Knight has reappeared to wreak havoc across the land, and the Dark Lord gathers his terrible strength. The world's only hope rests in the hands of a reluctant young adventurer named Lance. Discover your heritage and learn what it means to be the Protector of Light, Blade Dancer. [NIS America]… Expand"}, {"name": "Echo Night Beyond", "details_link": "https://www.metacritic.com/game/playstation-2/echo-night-beyond", "publisher": "Agetec Inc.", "release_date": "Jul 27 2004", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 60, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/92ff7dd5f12e09001779b6fc85313fa8-98.jpg", "descriptions": "2044 ? Moon Colony ? A horrific crash on your honeymoon has left you separated from your fiancée. Opening the door to the lunar colony 239,000 miles from Earth ? you find a desolate base haunted by the spectral remains of those who called it home. Prepare to embark on a paranormal journey to2044 ? Moon Colony ? A horrific crash on your honeymoon has left you separated from your fiancée. Opening the door to the lunar colony 239,000 miles from Earth ? you find a desolate base haunted by the spectral remains of those who called it home. Prepare to embark on a paranormal journey to the Beyond. Fog, Shadows, and Weightless gravity engulf you in an out of this world experience. Stunning environments and dynamic camera changes will leave you trembling in fear. Challenging puzzles and heart-pounding exploration will take you to the edge and Beyond. [Agetec Inc.]… Expand"}, {"name": "Clive Barker's Jericho", "details_link": "https://www.metacritic.com/game/playstation-3/clive-barkers-jericho", "publisher": "Codemasters", "release_date": "Oct 23 2007", "developers": ["Mercury Steam", "Alchemic Productions"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 60, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/2653ab88a667c6645b01dfa302b40924-98.jpg", "descriptions": "An unflinching realisation of a Clive Barker nightmare for next-gen console platforms and PC, Clive Barker's Jericho is a supernatural horror concept with story by the master mythmaker, novelist and filmmaker Clive Barker. Jericho deals with the mysterious reappearance of a lost city in aAn unflinching realisation of a Clive Barker nightmare for next-gen console platforms and PC, Clive Barker's Jericho is a supernatural horror concept with story by the master mythmaker, novelist and filmmaker Clive Barker. Jericho deals with the mysterious reappearance of a lost city in a remote desert. When a form of evil that goes right back to the dawn of days resurfaces from there, a Special Forces squad, trained in both conventional warfare and the arcane arts, is sent in. Their mission: Hunt down and destroy the evil that lurks at the heart of the city before it destroys humanity. Jericho is designed as an action horror title that ups the stakes in visuals and phantasmagorical special effects. Mingling the darkest elements of Barker’s horror fiction and films with an ambitious, age-spanning story, aimed at mature gamers, fans of Clive Barker and horror fiction enthusiasts. [Codemasters]… Expand"}, {"name": "Snow Bros. Nick & Tom Special", "details_link": "https://www.metacritic.com/game/switch/snow-bros-nick-tom-special", "publisher": "Daewon Media Co., Ltd.", "release_date": "May 19 2022", "developers": ["CRT Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/41d6a99ac86ea0005b67667cabc70e24-98.jpg", "descriptions": "A 1990s arcade-style platformer revival."}, {"name": "Dragon Ball: Raging Blast 2", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-ball-raging-blast-2", "publisher": "Namco Bandai Games", "release_date": "Nov  2 2010", "developers": ["Spike"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 60, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/e7682b0cbad7511b76950a23b81ddc29-98.jpg", "descriptions": "Dragon Ball Z fans can rest assured that the destructible environment, and character trademark attacks and transformations will be true to the series. These include signature Pursuit Attacks which enable players to initiate attack combo strings, juggling your opponent in a string ofDragon Ball Z fans can rest assured that the destructible environment, and character trademark attacks and transformations will be true to the series. These include signature Pursuit Attacks which enable players to initiate attack combo strings, juggling your opponent in a string of devastating strikes throughout the environment. Additionally, Dragon Ball: Raging Blast 2 will sport the new Raging Soul System which enables characters to reach a special state, increasing their combat abilities to the ultimate level. Sporting more than 90 characters, 20 of which are brand new to the Raging Blast series, new modes, and additional environmental effects, Dragon Ball: Raging Blast 2 is the next evolution in the home console series. … Expand"}, {"name": "Jeremy McGrath's Offroad", "details_link": "https://www.metacritic.com/game/xbox-360/jeremy-mcgraths-offroad", "publisher": "D3Publisher", "release_date": "Jun 27 2012", "developers": ["2XL Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 60, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/5/02f3dcc1e0fcaf92f3d5cec45b0b307c-98.jpg", "descriptions": "In Jeremy McGrath's Offroad, players race four-wheeled, 800-horsepower off-road race trucks with tons of options."}, {"name": "Claybook", "details_link": "https://www.metacritic.com/game/switch/claybook", "publisher": "Second Order", "release_date": "Mar 12 2019", "developers": ["Second Order"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Puzzle", "General", "Platformer", "3D"], "meta_score": 60, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/a5f27134d7d31cd2c05f3f0b91c37f04-98.jpg", "descriptions": "Claybook is a unique world made entirely of clay. Every inch of the environment can be shaped and molded. Everything has matter inside it, not just an outer shell. Clay can be liquid or solid, and it can be deformed and destroyed. In the game, you step into the shoes of brave kids who bringClaybook is a unique world made entirely of clay. Every inch of the environment can be shaped and molded. Everything has matter inside it, not just an outer shell. Clay can be liquid or solid, and it can be deformed and destroyed. In the game, you step into the shoes of brave kids who bring the Claybook to life. Each chapter of the book challenges you with unique obstacles and puzzles. You possess clay blobs and morph them into different shapes to overcome tricky situations. Each shape has its strengths and weaknesses, and some even have special powers. … Expand"}, {"name": "Jump Force", "details_link": "https://www.metacritic.com/game/pc/jump-force", "publisher": "Bandai Namco Games", "release_date": "Feb 15 2019", "developers": ["Spike Chunsoft Co. Ltd.", "Spike Chunsoft"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General", "Action", "Fighting", "3D"], "meta_score": 60, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/2/cf745f81b845a817075020db80f5ffa8-98.jpg", "descriptions": "For the first time ever, the most famous Manga heroes are thrown into a whole new battleground: our world. Uniting to fight the most dangerous threat, the Jump Force will bear the fate of the entire human kind. Celebrating the 50th Anniversary of the famous Weekly Jump Magazine, Jump ForceFor the first time ever, the most famous Manga heroes are thrown into a whole new battleground: our world. Uniting to fight the most dangerous threat, the Jump Force will bear the fate of the entire human kind. Celebrating the 50th Anniversary of the famous Weekly Jump Magazine, Jump Force is also making the most of latest technologies to bring characters to life in a never-seen-before realistic design. A unique setting, merging the Jump World and the Real World.  The Jump Force, an alliance of the most powerful Manga heroes from Dragon Ball, One Piece, Naruto and much more. Realistic graphics bring Manga characters to life like never before. [Bandai Namco]… Expand"}, {"name": "Spider-Man 3", "details_link": "https://www.metacritic.com/game/playstation-3/spider-man-3", "publisher": "Activision", "release_date": "May  4 2007", "developers": ["Treyarch"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "3D", "3D"], "meta_score": 60, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/3076111f3de31c8bbc2254e5e01b2c96-98.jpg", "descriptions": "Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time,Possess the never-before-experienced powers of Black-Suited Spider-Man. Unleash incredible agility, amazing durability and awe-inspiring web abilities. But be warned - the rush your intensified powers bring could overwhelm you. More freedom than ever. More city than ever. For the first time, enjoy unprecedented freedom—choosing what you want to do, when you want to do it. There's no checklist to complete in order to progress. You set your own next goal, roaming anywhere you want - including subterranean areas such as subways, sewers and villains' lairs - in the most massive, detailed New York City ever seen in a Spider-Man game. Experience an all-new combat system, two exciting ways. Redesigned from the ground up, a unique combat system empowers both Spider-Man and Black-Suited Spider-Man to perform suit-specific powers and abilities. State of the art animations, combos and finishers make punch, kick and web attacks more super-heroic than ever. Battle 10 of Spider-Man’s most infamous enemies from the movie and Marvel universe, including Sandman and Venom. [Activision]… Expand"}, {"name": "Twin Mirror", "details_link": "https://www.metacritic.com/game/playstation-4/twin-mirror", "publisher": "Bandai Namco Games", "release_date": "Dec  1 2020", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 60, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/5/97ce696bfaec13743d7c6fd4f6cec6ae-98.jpg", "descriptions": "Sam, a 33-year old man recovering from a recent break-up, returns to his hometown Basswood, West Virginia, for the funeral of his best friend. Understandably depressed and bitter, he feels completely out of sorts and out of place... But when he wakes up in his hotel room with a bloody shirtSam, a 33-year old man recovering from a recent break-up, returns to his hometown Basswood, West Virginia, for the funeral of his best friend. Understandably depressed and bitter, he feels completely out of sorts and out of place... But when he wakes up in his hotel room with a bloody shirt and no memory of his whereabouts the previous night, he embarks on a twisted investigation to find the truth.FEATURES:* Play a Thrilling Investigation -- Recall your memories and find the truth by exploring the dark undertones of a small town in West Virginia.* Embark on a Compelling Emotional Journey -- Sam's quest is also one of redemption in his journey to find himself again and heal his wounded heart.* Direct Sam's Fate -- Your choices and values decide Sam's place in life as you shape his relationships with the Basswood's inhabitants.… Expand"}, {"name": "Clive 'N' Wrench", "details_link": "https://www.metacritic.com/game/playstation-5/clive-n-wrench", "publisher": "Numskull Games", "release_date": "Feb 24 2023", "developers": ["Clive Games", "Dinosaur Bytes Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/1b8abe7a401c35a934036c5913af59d3-98.jpg", "descriptions": "One fateful morning Professor Nancy Merricarp wakes to find that her proudly displayed time travel blueprints have been nabbed by the downright evil Dr Daucus! Luckily Nancy's cousin, Clive and her apprentice Wrench are there to help pursue the wicked doctor and put an end to his horridOne fateful morning Professor Nancy Merricarp wakes to find that her proudly displayed time travel blueprints have been nabbed by the downright evil Dr Daucus! Luckily Nancy's cousin, Clive and her apprentice Wrench are there to help pursue the wicked doctor and put an end to his horrid plans! But to do this they must travel through time themselves!Clive 'N' Wrench is a 3D platformer starring Clive, a rabbit, and Wrench, the literal monkey on his back. Your adventure takes you hurtling through time and space in a 1950's refrigerator on a heroic quest to thwart the tyrannical Dr Daucus and stop his evil plans.… Expand"}, {"name": "Dusk Diver 2", "details_link": "https://www.metacritic.com/game/switch/dusk-diver-2", "publisher": "Idea Factory", "release_date": "Aug 30 2022", "developers": ["Wanin International"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "Action RPG", "Beat-'Em-Up", "3D"], "meta_score": 60, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/7982b78481c3fe6cc3d16a6a0d738c31-98.jpg", "descriptions": "Yang Yumo, a college student with a daily part-time job. Her body had been suffering from the aftermath of the Youshanding incident a year back.In an ordinary day, Choas Beasts reappeared in the streets of Youshanding, and Yumo had to once again step onto the battlefield!\n\nA journey ofYang Yumo, a college student with a daily part-time job. Her body had been suffering from the aftermath of the Youshanding incident a year back.In an ordinary day, Choas Beasts reappeared in the streets of Youshanding, and Yumo had to once again step onto the battlefield!A journey of adventure and guardianship is about to unfold!!The fully enhanced Ximending action game sequel! New characters! New scenes! New customizations! It's the all new Dusk Diver 2!!… Expand"}, {"name": "De-formers", "details_link": "https://www.metacritic.com/game/playstation-4/de-formers", "publisher": "GameTrust", "release_date": "Apr 21 2017", "developers": ["Ready at Dawn"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Arcade"], "meta_score": 60, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/1/3949dcee6bcab189baf917ed811c3235-98.jpg", "descriptions": "Prepare for an epic battle Deformers is a fast and frantic multiplayer combat arena game. Smash up your friends in couch co-op, or team up and fight against others online."}, {"name": "Final Exam", "details_link": "https://www.metacritic.com/game/playstation-3/final-exam", "publisher": "Focus Home Interactive", "release_date": "Nov  5 2013", "developers": ["Mighty Rocket Studio"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 60, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/333622a2ba1b483760c007a2b122d7a7-98.jpg", "descriptions": "Playable alone and in cooperative mode (local & online), Obscure lets you play as one of four unlikely heroes; students, each with unique skills and abilities that develop throughout the adventure. Geared toward action and all-out brawling, Obscure's combat emphasizes combos, follow-upPlayable alone and in cooperative mode (local & online), Obscure lets you play as one of four unlikely heroes; students, each with unique skills and abilities that develop throughout the adventure. Geared toward action and all-out brawling, Obscure's combat emphasizes combos, follow-up attacks, and score-multipliers! Survive against packs of monsters trying to skin you alive, discover new weapons, and complete objectives throughout a variety of huge, non-linear levels. Overshooting the scores will earn you experience points to level your character up, unlocking new weapons, skills, and other devastating abilities! At any time, you can even get back to some of earlier levels to try your new toys and beat your scores! … Expand"}, {"name": "MicroBot", "details_link": "https://www.metacritic.com/game/xbox-360/microbot", "publisher": "Electronic Arts", "release_date": "Dec 29 2010", "developers": ["Naked Sky Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Top-Down"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/355e7a99771b6b7050e2018ed8ceef0f-98.jpg", "descriptions": "Microbot is a an arcade shooter for Xbox Live Arcade and the PlayStation Network."}, {"name": "Majesty 2: Kingmaker", "details_link": "https://www.metacritic.com/game/pc/majesty-2-kingmaker", "publisher": "Paradox Interactive", "release_date": "Mar 26 2010", "developers": ["1C", "1C Entertainment"], "platforms": "PC", "genres": ["Strategy", "General", "General"], "meta_score": 60, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/2f206582cd0c5cfa491473da76862cb9-98.jpg", "descriptions": "What is the connection between the nightmares of Lord Blackviper and those mysterious eyes, burning in the night? Who are these little green men? The ones stabbing your tax collectors with their spears? Can the shamans of the God of Plague rival the very gods themselves? From whence does hisWhat is the connection between the nightmares of Lord Blackviper and those mysterious eyes, burning in the night? Who are these little green men? The ones stabbing your tax collectors with their spears? Can the shamans of the God of Plague rival the very gods themselves? From whence does his avatars appear, and who is to blame? The search for answers to these questions is unlikely to improve your sleep , but will surely give you many hours of new and exciting battles when the war with the goblins descends upon the peaceful lands of Ardania. And besides, how better could the nights of the Great King be spent? Become not only the king of Ardania, but its creator as well. [Paradox Interactive]… Expand"}, {"name": "DreamWorks How to Train Your Dragon", "details_link": "https://www.metacritic.com/game/ds/dreamworks-how-to-train-your-dragon", "publisher": "Activision", "release_date": "Mar 23 2010", "developers": ["Griptonite Games"], "platforms": ["PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 60, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/f0ae216dac02802dfa1d0e2dc7cea99c-98.jpg", "descriptions": "How to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expandedHow to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expanded locales from the film including Vikings’ Village, Wild Zone, Training Zone and Fight Arena. In this truly larger-than-life adventure, players will train dragons, explore environments and battle in prestigious dragon tournaments as they battle for Viking victory. Plus, gamers can become the Dragon hero of their living room as they square-off with friends and family in endless head-to-head multi-player combat. [Activision]… Expand"}, {"name": "Tom Clancy's Rainbow Six Vegas", "details_link": "https://www.metacritic.com/game/psp/tom-clancys-rainbow-six-vegas", "publisher": "Ubisoft", "release_date": "Jun 12 2007", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/c1975671fa265e54882e0cf2ffd12968-98.jpg", "descriptions": "The PSP version features exclusive new content and all-new characters as Las Vegas finds itself in chaos and Rainbow operatives are forced to defend one of the most recognizable cities in the world. The future of Las Vegas and global security is in your hands... will you be able to saveThe PSP version features exclusive new content and all-new characters as Las Vegas finds itself in chaos and Rainbow operatives are forced to defend one of the most recognizable cities in the world. The future of Las Vegas and global security is in your hands... will you be able to save Vegas? New Team, New Location – Two new Rainbow operatives enter the impending doom that is Las Vegas as their console brethren, Keller, Park and Walter, simultaneously work against the clock to save \"Sin City.\" As Brian Armstrong, work as a field operative and assault expert, taking down tangos from the ground floor. As Shawn Rivers, use your sniper and long-range shooting skills to pick off terrorists from above, one at a time. Tag-Team Gameplay – In single-player mode, play as both a field operative and sniper as you battle to protect the innocent from carnage. Observe - Plan - Assault – Use tactical planning to maneuver through Vegas environments while utilizing high-tech equipment like snake cams to strategically \"tag\" terrorists prior to entering a room. Take Cover – When the action heats up, switch to third-person view while taking cover, giving you time to examine the situation before making your move. Tailored Control System – Shoot your way out of relentless gun battles utilizing a tailored control system built specifically for the PSP system. Player Rewards – Build up your stats to unlock exclusive Rainbow Six Vegas content, including concept art and the feverish Terrorist Hunt mode. Terrorist Hunt Mode – Hone your skills in Terrorist Hunt mode, where your objective is simple – kill the terrorists. Enter specific points of single-player maps and down the spawning terrorists one at a time. Multiplayer – Take the fight to five of your closest friends via wireless (Ad Hoc) or online play (Infrastructure) in Survival and Team Survival multiplayer modes, while exploring six classic Rainbow Six maps. [Ubisoft]… Expand"}, {"name": "Naruto: Ninja Council", "details_link": "https://www.metacritic.com/game/game-boy-advance/naruto-ninja-council", "publisher": "D3", "release_date": "Mar  7 2006", "developers": ["Aspect"], "platforms": "Game Boy Advance", "num_players": "24  Online", "genres": ["Action", "Platformer", "2D"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/5f8040484b942409447f2c3346b179f7-98.jpg", "descriptions": "NARUTO takes place in a world where ninja hold the ultimate power. Infused with the spirit of a once fearsome Nine-Tailed Fox, Naruto Uzumaki is a ninja-in-training who is learning the art of Ninjutsu with his classmates Sakura and Sasuke. The trio studies under the instruction of theirNARUTO takes place in a world where ninja hold the ultimate power. Infused with the spirit of a once fearsome Nine-Tailed Fox, Naruto Uzumaki is a ninja-in-training who is learning the art of Ninjutsu with his classmates Sakura and Sasuke. The trio studies under the instruction of their teacher, Kakashi, who helps the group face dangerous and daunting tests and challenges. Through their adventures, the young ninjas learn the importance of friendship, teamwork, loyalty, hard work, creativity, ingenuity, and right versus wrong.… Expand"}, {"name": "FIFA Street", "details_link": "https://www.metacritic.com/game/xbox/fifa-street", "publisher": "EA Sports Big", "release_date": "Feb 22 2005", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 60, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/52c16dde9754d395f690bd4e7c05a9ce-98.jpg", "descriptions": "FIFA Street is a combination of arcade action blended with the culture of freestyle street soccer. By removing the rules from the simulation soccer experience, FIFA Street exposes the heart of the world's beautiful game, on-the-ball flare and individual style. Leading this movement are theFIFA Street is a combination of arcade action blended with the culture of freestyle street soccer. By removing the rules from the simulation soccer experience, FIFA Street exposes the heart of the world's beautiful game, on-the-ball flare and individual style. Leading this movement are the worlds top professional players, showing off their skills and individual style in 4-on-4 match-ups against the backdrop of global venues that represent the true culture of street soccer. As the first game to support dynamic 1-on-1 encounters, beating your opponent will require skill, technique, and the careful selection of specific moves. As a gamer you'll take on the best and be required to earn their respect, gradually building your reputation and team into an unstoppable force that leads the tide of street soccer.… Expand"}, {"name": "Yu-Gi-Oh! The Sacred Cards", "details_link": "https://www.metacritic.com/game/game-boy-advance/yu-gi-oh!-the-sacred-cards", "publisher": "Konami", "release_date": "Nov  4 2003", "developers": ["Konami"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 60, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/316f8711ce77e05819848ea45f6d0c28-98.jpg", "descriptions": "In Yu-Gi-Oh! The Sacred Cards, it's just as important to play your cards right as it is to get the right cards.  This unique RPG gives you cards as weapons against the tough competition.  You'll battle in a tournament hosted by Kaiba Corporation and win the powerful Egyptian God Cards.In Yu-Gi-Oh! The Sacred Cards, it's just as important to play your cards right as it is to get the right cards.  This unique RPG gives you cards as weapons against the tough competition.  You'll battle in a tournament hosted by Kaiba Corporation and win the powerful Egyptian God Cards.  Based on events from the Yu-Gi-Oh! animated TV series, The Sacred Cards offers hundreds of cards, over 100 duelists and rivals, and unexpected twists and surprises.… Expand"}, {"name": "Mister Slime", "details_link": "https://www.metacritic.com/game/ds/mister-slime", "publisher": "SouthPeak Games", "release_date": "Jul 23 2008", "developers": ["Lexis Numerique"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/82d047b3fcc7827481f6effe0979c969-98.jpg", "descriptions": "As the young but determined hero Mister Slime, players set off on an adventure, trying to protect Slime Village from its evil enemies, the Axons. Using the touch screen and stylus, players must navigate the levels by dragging and stretching Mister Slime’s arms to grab hold of small anchorAs the young but determined hero Mister Slime, players set off on an adventure, trying to protect Slime Village from its evil enemies, the Axons. Using the touch screen and stylus, players must navigate the levels by dragging and stretching Mister Slime’s arms to grab hold of small anchor points scattered throughout the game. Mister Slime features inventive uses of characteristics specific to Nintendo DS, including sound and shape recognition.  As an example, players are able to blow on Mister Slime to make him fly in the air or to help him breathe under water. Mister Slime features both single and multiplayer game modes with a variety of level design. All together, Mister Slime keeps gamers busy for hours trying to stretch and manipulate their way through the wonderful world of slime. [SouthPeak Games]… Expand"}, {"name": "Need for Speed Undercover", "details_link": "https://www.metacritic.com/game/playstation-3/need-for-speed-undercover", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["EA Vancouver"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 59, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/3/1e5b583e4b2674c70980fa892966b4b1-98.jpg", "descriptions": "Need for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a uniqueNeed for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a unique technology that generates incredible high-performance moves at 180 miles per hour during breathtaking highway battles. A mix of computer graphics and live-action movies immerses gamers in the rich world of the Tri-City Bay Area. The city’s open-world environment features over 80 miles of roads, including an enormous highway system that sets the stage for highway battles. These high-speed, high-stake chase sequences push players to the limit as they fight off cops and opponents while whipping through traffic at 180 miles per hour. An intelligent new A.I. mechanic delivers a realistic and high-energy action driving experience. Going back to the franchise’s roots, Need for Speed Undercover features more aggressive and intelligent cops whose sole purpose is to take down the player quickly and by any means necessary. Need for Speed Undercover also features the series' signature car customization, real-world damage and realistic driving physics. The game includes some of the hottest licensed cars such as the Audi R8, BMW M6 and Lexus IS-F. [Electronic Arts]… Expand"}, {"name": "Separation", "details_link": "https://www.metacritic.com/game/playstation-4/separation", "publisher": "Recluse Industries", "release_date": "Mar  4 2020", "developers": ["Recluse Industries"], "platforms": ["iPhone/iPad", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "First-Person"], "meta_score": 59, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/a25a0d04c9da91a302927edeaa41b00f-98.jpg", "descriptions": "Separation is a first-person adventure at its most ambient and atmospheric. A meditation on solitude, loss, and the spiritual path, Separation is a unique journey to a place of epic desolation. Featuring a sublime electronic soundtrack by Vector Lovers, Separation is the ultimate chill out trip."}, {"name": "Narcos: Rise of the Cartels", "details_link": "https://www.metacritic.com/game/playstation-4/narcos-rise-of-the-cartels", "publisher": "Curve Digital", "release_date": "Nov 19 2019", "developers": ["Kuju Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 59, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/0/90348c7a104592cadea26d503ae7063f-98.jpg", "descriptions": "Welcome to Colombia, 1980's -- the fires of El Patron's empire have been lit, its influence spanning borders, and expansion unabated. Influence and corruption is rife; cops, guards, politicians and those in between are falling into the pocket of the Medellín Cartel, and after years ofWelcome to Colombia, 1980's -- the fires of El Patron's empire have been lit, its influence spanning borders, and expansion unabated. Influence and corruption is rife; cops, guards, politicians and those in between are falling into the pocket of the Medellín Cartel, and after years of production, America is finally taking notice.Narcos: Rise of the Cartels tells the story of the hit Netflix TV series, of the rise and fall of El Patron. Choose your side and ally with the DEA or conversely side with the Narcos. Explore recognisable locations from the show and take a role in pivotal world-altering events and battles that will define and shift the war on drugs.Form your team from a variety of class-specific roles, join leading characters, upgrade your skills and take part in brutal turn-based combat, where your actions will have consequence. Plata o Plomo?… Expand"}, {"name": "N.E.R.O.: Nothing Ever Remains Obscure", "details_link": "https://www.metacritic.com/game/playstation-4/nero-nothing-ever-remains-obscure", "publisher": "Soedesco", "release_date": "Jun 24 2016", "developers": ["Vertigo Games", "Storm in a Teacup"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Puzzle", "General", "3D", "First-Person"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/58695ed69832c338faa095d816ce9ce2-98.jpg", "descriptions": "NERO is a first person adventure game based on puzzle solving and exploration. NERO is a wonderful journey in an magic world where a kid is the key to all locks and the nights is not as frightening as you could think. Play the role of this kid, followed by a mysterious black cloathedNERO is a first person adventure game based on puzzle solving and exploration. NERO is a wonderful journey in an magic world where a kid is the key to all locks and the nights is not as frightening as you could think. Play the role of this kid, followed by a mysterious black cloathed companion, discovering the truth behind this epic journey. Use the Sphere of Light to interact with the environment, explore and experience emotions and feelings that are uncommon in videogames, with a brand new next-generation visual novel reshaping the genre.… Expand"}, {"name": "Pac-Man and the Ghostly Adventures 2", "details_link": "https://www.metacritic.com/game/playstation-3/pac-man-and-the-ghostly-adventures-2", "publisher": "Bandai Namco Games", "release_date": "Oct 14 2014", "developers": ["Vicious Cycle"], "platforms": ["3DS", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 59, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/90ab5826f10b0f2e1ab7ec314d96da0a-98.jpg", "descriptions": "The gang is back! Following the colorful characters and world of the PAC-MAN and the Ghostly Adventures animated series,PAC-MAN and the Ghostly Adventures 2 will feature PAC-MAN, Spiral and Cylindria in an all-new storyline as they defendPacWorld from the ghoulish army of Lord Betrayus."}, {"name": "Pokemon Mystery Dungeon: Gates to Infinity", "details_link": "https://www.metacritic.com/game/3ds/pokemon-mystery-dungeon-gates-to-infinity", "publisher": "Nintendo", "release_date": "Mar 24 2013", "developers": ["Nintendo", "Spike Chunsoft"], "platforms": "3DS", "num_players": "1 Player", "genres": ["General", "Role-Playing", "Console-style RPG", "Console-style RPG", "Roguelike"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/e450c8c508e4bd81642a874fd4f6180a-98.jpg", "descriptions": "Discover the 3D world of Pokemon Mystery Dungeon: Gates to Infinity, where Pokemon speak and adventures are always nearby. What's more, you will become a Pokemon yourself. You'll meet all kinds of Pokemon throughout the game, both in the towns you'll visit and the Mystery Dungeons you'llDiscover the 3D world of Pokemon Mystery Dungeon: Gates to Infinity, where Pokemon speak and adventures are always nearby. What's more, you will become a Pokemon yourself. You'll meet all kinds of Pokemon throughout the game, both in the towns you'll visit and the Mystery Dungeons you'll explore. There are tons of them lurking around where you'd least expect them.… Expand"}, {"name": "Inazuma Eleven Strikers", "details_link": "https://www.metacritic.com/game/wii/inazuma-eleven-strikers", "publisher": "Nintendo", "release_date": "Sep 28 2012", "developers": ["Level 5"], "platforms": "Wii", "genres": ["Sports", "General"], "meta_score": 59, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/7db182eb57a4c56cb3fc902039798d17-98.jpg", "descriptions": null}, {"name": "Crazy Taxi", "details_link": "https://www.metacritic.com/game/xbox-360/crazy-taxi", "publisher": "Sega", "release_date": "Nov 24 2010", "developers": ["Hitmaker"], "platforms": ["iPhone/iPad", "PC", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/33b7982616a5117ba6f5db82512cc12f-98.jpg", "descriptions": "The Dreamcast classic finally makes its way to Xbox Live Arcade."}, {"name": "Resident Evil 2", "details_link": "https://www.metacritic.com/game/gamecube/resident-evil-2", "publisher": "Capcom", "release_date": "Jan 16 2003", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 59, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/2/b982b907741b89726b954a3add954c3e-98.jpg", "descriptions": "Ready or not, the terror of Resident Evil 2 is here.  In chapter one, the case of the disastrous T-virus outbreak--a mutagenic toxin designed for biological weapons--was eventually closed but the experiments were far from over.  Control the destiny of Leon Kennedy or Claire Redfield as theirReady or not, the terror of Resident Evil 2 is here.  In chapter one, the case of the disastrous T-virus outbreak--a mutagenic toxin designed for biological weapons--was eventually closed but the experiments were far from over.  Control the destiny of Leon Kennedy or Claire Redfield as their nightmare begins when a biotech terror runs rampant in Raccoon City.  Relentless zombies and hideous monsters are all out for a taste of your blood.  If the suspense doesn't kill you, something else will.… Expand"}, {"name": "True Crime: New York City", "details_link": "https://www.metacritic.com/game/gamecube/true-crime-new-york-city", "publisher": "Activision", "release_date": "Nov 15 2005", "developers": ["Exakt"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/08887701f67eb960939a092fdb9dd441-98.jpg", "descriptions": "Be a good cop or a bad cop in the streetwise action game True Crime: New York City. You can explore the authentically modeled streets of New York City as a police officer tracking down criminals and administering justice. The game features a diverse weapon set, as well as a mixed offering ofBe a good cop or a bad cop in the streetwise action game True Crime: New York City. You can explore the authentically modeled streets of New York City as a police officer tracking down criminals and administering justice. The game features a diverse weapon set, as well as a mixed offering of fighting styles that you can use to take out those who stand in your way. In addition to combat on foot, the game features driving sequences and shootouts. Laurence Fishburne, Christopher Walken, and Mickey Rourke contribute their voice talent to the game as well.… Expand"}, {"name": "Taxi Chaos", "details_link": "https://www.metacritic.com/game/xbox-one/taxi-chaos", "publisher": "Lion Castle", "release_date": "Feb 23 2021", "developers": ["Team6 Game Studios", "Lion Castle"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Racing", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 59, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/22ce5ddb0077161bfa2255d7ff3df399-98.jpg", "descriptions": "RUSH THROUGH THE CITY TO DELIVER YOUR CRAZY CUSTOMERS!\r Get behind the wheel and get ready for a brand-new taxi experience! Drive around the city as the seasoned cab driver Vinny or the self-proclaimed ‘influencer’ Cleo, and pick up the craziest of customers!\r\n\r\nPower through midtown in aRUSH THROUGH THE CITY TO DELIVER YOUR CRAZY CUSTOMERS!\r Get behind the wheel and get ready for a brand-new taxi experience! Drive around the city as the seasoned cab driver Vinny or the self-proclaimed ‘influencer’ Cleo, and pick up the craziest of customers!\r Power through midtown in a strong muscle car, race past the parks in an exotic supercar or drift around the business area in a Japanese tuner taxi. Whatever you choose - your challenge is to deliver your passengers on time! At least, if you want to make any money.\r Navigate through crowded streets, dodge pedestrians across sidewalks or even defy the laws of gravity by jumping over rooftops! Nothing is too extreme when it comes to delivering your passengers on time! Discover the best shortcuts and get to know New Yellow City (NYC), as well as your passengers, like the back of your hand.\r Are you ready for this crazy and chaotic ride?… Expand"}, {"name": "Farming Simulator 20", "details_link": "https://www.metacritic.com/game/switch/farming-simulator-20", "publisher": "Focus Home Interactive", "release_date": "Dec  3 2019", "developers": ["Giants Software"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 59, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/7/8329786df5a4ea348351340ac28b9a43-98.jpg", "descriptions": "In Farming Simulator 20, take control of vehicles and machines faithfully recreated from leading brands in the industry. For the first time on Nintendo Switch, this includes John Deere, the largest agriculture machinery company in the world. Drive other famous farming brands such as Case IH,In Farming Simulator 20, take control of vehicles and machines faithfully recreated from leading brands in the industry. For the first time on Nintendo Switch, this includes John Deere, the largest agriculture machinery company in the world. Drive other famous farming brands such as Case IH, New Holland, Challenger, Fendt, Valtra, Krone, Deutz-Fahrand many more.Farming Simulator 20 features a new North American environment in which to develop and expand your farm. Enjoy many exciting farming activities, including new machinery and crops with cotton and oats, new to the Nintendo Switch! Tend to your livestock of pigs, cows, and sheep, and now ride your own horses, letting you explore the vast land around your farm in a brand-new way.… Expand"}, {"name": "YIIK: A Postmodern RPG", "details_link": "https://www.metacritic.com/game/playstation-4/yiik-a-postmodern-rpg", "publisher": "Ackkstudios", "release_date": "Jan 17 2019", "developers": ["Ackkstudios"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 59, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/9/8546f9302de2da9f3921b70afbe45023-98.jpg", "descriptions": "On the afternoon of April 4th 1999 Sammy Pak went missing.  That night, a video of her last known moments was uploaded online.  All of your friends excitedly watched as she is pulled from an elevator by something. otherworldly. \r\rThis is a story about what happens when you look for someoneOn the afternoon of April 4th 1999 Sammy Pak went missing.  That night, a video of her last known moments was uploaded online.  All of your friends excitedly watched as she is pulled from an elevator by something. otherworldly. \r\rThis is a story about what happens when you look for someone who cant be found and the strange things you invite into your life when you go to forbidden places.… Expand"}, {"name": "Auto Age: Standoff", "details_link": "https://www.metacritic.com/game/pc/auto-age-standoff", "publisher": "Phantom Compass", "release_date": "Sep 21 2017", "developers": ["Phantom Compass"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/634bf7e8c8239230c555651ff0e08e17-98.jpg", "descriptions": "In the bright but distant future, the recovery of New America rests in the hands of wheeled warriors. Will you side with the sinister Dark Jaw or intrepid Val Vega? Customize your killer ride and go head to head in 80s-style car combat. Gear up, team up, and roll out!"}, {"name": "One Upon Light", "details_link": "https://www.metacritic.com/game/playstation-4/one-upon-light", "publisher": "Singapore University of Technology and Design", "release_date": "Oct 13 2015", "developers": ["Singapore University of Technology and Design"], "platforms": ["PC", "PlayStation 4"], "genres": ["Puzzle", "Action"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/9820167d264f5ce49bea1d32b53be07a-98.jpg", "descriptions": "One Upon Light tells the story of an individual’s journey through what appears to be a large abandoned science facility. You control the protagonist – a scientist – as he makes his way through the labyrinth of chambers and malfunctioning science equipment. He soon finds out that he isOne Upon Light tells the story of an individual’s journey through what appears to be a large abandoned science facility. You control the protagonist – a scientist – as he makes his way through the labyrinth of chambers and malfunctioning science equipment. He soon finds out that he is extremely averse to light: exposure to illumination results in excruciating pain, followed shortly by death. Through the course of the game, you will uncover the mysteries behind the facility’s current state. At the same time, the scientist will learn more about his extraordinary condition — and perhaps even himself. [SUTD Game Lab]… Expand"}, {"name": "Ethan: Meteor Hunter", "details_link": "https://www.metacritic.com/game/pc/ethan-meteor-hunter", "publisher": "Plug In Digital", "release_date": "Oct 22 2013", "developers": ["Seaven Studio"], "platforms": ["PlayStation 3", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 59, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/31886cfac863d8b987ca760041001585-98.jpg", "descriptions": "'Ethan: Meteor Hunter' is a single-player genre mixing game that blends the very best of platform- and puzzle-gaming. The game features Ethan, a rat with an attitude, who was hit on the head by a meteorite giving him supernatural powers! You, yes you, must guide our rodent hero through 50'Ethan: Meteor Hunter' is a single-player genre mixing game that blends the very best of platform- and puzzle-gaming. The game features Ethan, a rat with an attitude, who was hit on the head by a meteorite giving him supernatural powers! You, yes you, must guide our rodent hero through 50 levels of challenging fun across 3 unique worlds. Getting struck by space trash does have its advantages! For example, our hero has the power of telekinesis and the ability to freeze time, enabling him to move objects around while the world is on hold; a truly unique feature you will need to overcome a number of difficult puzzles and obstacles.\r \rWith its themed levels, expressive art style, addictive gameplay, realistic physics, awesome graphics, mind-bending puzzles, and multiple ways of completing the game, 'Ethan: Meteor Hunter' will quickly immerse you in its enthralling world!… Expand"}, {"name": "Vambrace: Cold Soul", "details_link": "https://www.metacritic.com/game/pc/vambrace-cold-soul", "publisher": "Headup Games", "release_date": "May 28 2019", "developers": ["Devespresso Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 59, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/19e003e84e7ff81c88fa534c4f03bc4e-98.jpg", "descriptions": "Vambrace: Cold Soul is a roguelike fantasy-adventure set amidst a frozen landscape. Plan your expeditions underground, then journey to the cursed city surface with your team of heroes. Wield unique powers, avoid dangerous traps, brave strange encounters, and survive deadly combat."}, {"name": "Planet of the Apes: Last Frontier", "details_link": "https://www.metacritic.com/game/playstation-4/planet-of-the-apes-last-frontier", "publisher": "20th Century Fox Film Corporation", "release_date": "Nov 21 2017", "developers": ["Creative England", "Creative England"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 59, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/83ec8f38459a1e1281aca534e3bca68a-98.jpg", "descriptions": "Planet of the Apes: Last Frontier is a narrative adventure game of conquest, betrayal, and survival. When the fates of a tribe of apes and a band of human survivors intertwine, two worlds collide as their precarious existence hangs in the balance."}, {"name": "Liberated", "details_link": "https://www.metacritic.com/game/switch/liberated", "publisher": "Walkabout Games", "release_date": "Jun  2 2020", "developers": ["Atomic Wolf"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Linear"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/ec9a3b80493bb2313c6529ea3a2929c4-98.jpg", "descriptions": "Welcome to a brave new world. Undeniable truth and personal freedoms are dying. Revolution is near. Rise up in the bloodstained struggle for a land of the free.\r Forget everything you know about comics. Immerse yourself in a dark, rain-soaked city. Use your wits, hack the system, sneak andWelcome to a brave new world. Undeniable truth and personal freedoms are dying. Revolution is near. Rise up in the bloodstained struggle for a land of the free.\r Forget everything you know about comics. Immerse yourself in a dark, rain-soaked city. Use your wits, hack the system, sneak and solve puzzles. And when the going gets good, dispense picturesque headshots for great justice. Let the stunning hand-drawn art and action unite on the pages of this noir cyberpunk story.\r You are watched every minute of every hour of every day.\rAccept it. Or start a fire.… Expand"}, {"name": "SpongeBob SquarePants: Lights, Camera, Pants!", "details_link": "https://www.metacritic.com/game/playstation-2/spongebob-squarepants-lights-camera-pants!", "publisher": "THQ", "release_date": "Oct 21 2005", "developers": ["THQ Australia"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 59, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/c7e83e1fb396fa56f49090310d1b6aa5-98.jpg", "descriptions": "Bikini Bottom is abuzz! The producers of everyone's favorite superhero show, \"The Adventures of Mermaidman & Barnacleboy,\" are filming a special episode in Bikini Bottom and using the locals as actors. All your favorites are desperate to impress the talent scouts who have created a series ofBikini Bottom is abuzz! The producers of everyone's favorite superhero show, \"The Adventures of Mermaidman & Barnacleboy,\" are filming a special episode in Bikini Bottom and using the locals as actors. All your favorites are desperate to impress the talent scouts who have created a series of action-packed challenges to test the wannabe stars. Join SpongeBob, Patrick, Sandy, Squidward, Mr. Krabs and Plankton as you compete against your friends for 10 different roles, including the coveted super villain role. SpongeBob goes multiplayer for the 1st time! Play with up to 4 players in both a competitive and co-operative gameplay experience. Compete to earn roles in a 15-minute, full-fledged episode of \"The Adventures of Mermaidman & Barnacleboy.\" Your role changes depending on who plays and wins the game! Play all 30 party-style games in classic SpongeBob-style madness. 3 unique game modes (Story, Quick Game, and D.I.Y. Tournaments) provide endless variety of gameplay. [THQ]… Expand"}, {"name": "Okabu", "details_link": "https://www.metacritic.com/game/playstation-3/okabu", "publisher": "SCEA", "release_date": "Oct 18 2011", "developers": ["HandCircus"], "platforms": "PlayStation 3", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 59, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/3/6df1c47225063ec933545e980f040912-98.jpg", "descriptions": "Okabu follows the adventures of Kumulo, Nimbe and the cloud-flying heroes as they battle to save their people and their world from the industrialized threat of the Doza.  The world of Okabu is a hyper-tactile toybox filled with a huge number of puzzles, playthings, adorable creatures andOkabu follows the adventures of Kumulo, Nimbe and the cloud-flying heroes as they battle to save their people and their world from the industrialized threat of the Doza.  The world of Okabu is a hyper-tactile toybox filled with a huge number of puzzles, playthings, adorable creatures and devious machines â€“all spread across an epic co-op campaign designed exclusively for the PlayStation Network.… Expand"}, {"name": "Finny the Fish & the Seven Waters", "details_link": "https://www.metacritic.com/game/playstation-2/finny-the-fish-the-seven-waters", "publisher": "Natsume", "release_date": "May 17 2005", "developers": ["SCEI"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/7f7fbdbe6feea4434973eb66cd43355d-98.jpg", "descriptions": "(Also known as \"Uo: Legend of Seven Waters and Gods\" in the UK/EU and \"Uo Nanatsu no Mizu Densetsu no Nushi\" in Japan)  Finny the Fish is a three dimensional, underwater adventure game where you play through the eyes of a fish. You must solve various puzzles and mysteries to bring back(Also known as \"Uo: Legend of Seven Waters and Gods\" in the UK/EU and \"Uo Nanatsu no Mizu Densetsu no Nushi\" in Japan)  Finny the Fish is a three dimensional, underwater adventure game where you play through the eyes of a fish. You must solve various puzzles and mysteries to bring back balance to your aquatic home. Just like any fish, you'll need to eat, and more importantly, avoid being eaten?not only by other fish, but the local fishermen as well! It pays to carefully observe what you consume, since some bits of food are actually fishermen?s lures ? if you get caught, you will need to use a variety of skills to try and escape. [Natsume]… Expand"}, {"name": "Mind Zero", "details_link": "https://www.metacritic.com/game/playstation-vita/mind-zero", "publisher": "Aksys Games", "release_date": "May 27 2014", "developers": ["Zerodiv"], "platforms": ["PC", "PlayStation Vita"], "genres": ["Role-Playing", "First-Person", "General", "Japanese-Style", "Western-Style"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/9ec9540aa0047e5bf8defdf970f83e9f-98.jpg", "descriptions": "Mind Zero is a first-person dungeon crawler where you fight with your MINDs (literally and figuratively). Kei is a typical high school student until his life is turned upside down when he forms a contract with a MIND, a weapon/being with deadly powers. With the government and other forcesMind Zero is a first-person dungeon crawler where you fight with your MINDs (literally and figuratively). Kei is a typical high school student until his life is turned upside down when he forms a contract with a MIND, a weapon/being with deadly powers. With the government and other forces trailing him and his friends, Kei will need to discover the secret behind MIND before it’s too late.… Expand"}, {"name": "Crysis Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/crysis-remastered", "publisher": "Crytek", "release_date": "Sep 18 2020", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 59, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/3/7b86738fe04b2a5ce03059a3c12f4d4b-98.jpg", "descriptions": "The classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a North Korean islandThe classic first person shooter from Crytek is back with the action-packed gameplay, sandbox world, and thrilling epic battles you loved the first time around. What begins as a simple rescue mission becomes the battleground of a new war as alien invaders swarm over a North Korean island chain. Armed with a powerful Nanosuit, players can become invisible to stalk enemy patrols, or boost strength to lay waste to vehicles. The Nanosuit's speed, strength, armor, and cloaking allow creative solutions for every kind of fight, while a huge arsenal of modular weaponry provides unprecedented control over play style. In the ever-changing environment, adapt tactics and gear to dominate your enemies, in an enormous sandbox world. Suit up: Your Nanosuit's speed, strength, armor, and cloaking allow creative solutions for every kind of fight.Adapt: In an ever-changing environment, adapt your tactics to dominate on battlefields ranging from frozen jungle to alien environments.Customize: A huge arsenal of modular weaponry provides unprecedented control over play style, with options ranging from the experimental to the alien.Conquer: Life-like enemy AI require a strategic and flexible playstyle, as new challenges including a zero-g battlefield require players to take the offensive and be proactive.Explore: Choose your own path through the open world of Crysis, destroying obstacles, driving vehicles, and using the environment itself against your enemies.… Expand"}, {"name": "Ary and the Secret of Seasons", "details_link": "https://www.metacritic.com/game/pc/ary-and-the-secret-of-seasons", "publisher": "Modus Games", "release_date": "Sep  1 2020", "developers": ["Exiin"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/5cc59b526959aa82d652232e577fc082-98.jpg", "descriptions": "Ary and the Secret of Seasons is  adventure game following a young girl named Aryelle, or Ary, as she journeys across the great world of Valdi. By becoming the Guardian of Winter, Ary gains the ability to manipulate the seasons around her. Ary will learn to control the seasons and use themAry and the Secret of Seasons is  adventure game following a young girl named Aryelle, or Ary, as she journeys across the great world of Valdi. By becoming the Guardian of Winter, Ary gains the ability to manipulate the seasons around her. Ary will learn to control the seasons and use them to defeat enemies, overcome obstacles, and solve complex puzzles on her adventure across Valdi. Long ago, the world of Valdi was threatened by an evil mage. After a great struggle, he was defeated by the Legendary Warrior and sealed inside the Vault, imprisoned for all eternity. To ensure the mage's imprisonment, four great sages swore to keep watch and protect the Vault. They formed the original Guardians of Seasons, a secretive organization now steeped in history and legend. After a mysterious force throws the seasons of Valdi into disarray, Ary decides to assist the Guardians of Seasons and sets out to find the source of the mayhem. Using her wits and courage, Ary will have to overcome monstrous enemies, secret plots, and stuffy traditions to save Valdi and bring balance to the world once more. … Expand"}, {"name": "The Dark Crystal: Age of Resistance Tactics", "details_link": "https://www.metacritic.com/game/switch/the-dark-crystal-age-of-resistance-tactics", "publisher": "En Masse Entertainment", "release_date": "Feb  4 2020", "developers": ["BonusXP"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/52e4c8cda0fafcfb69b76938fab27d48-98.jpg", "descriptions": "Netflix's The Dark Crystal: Age of Resistance comes to life as a thrilling tactical strategy game!\r In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughandNetflix's The Dark Crystal: Age of Resistance comes to life as a thrilling tactical strategy game!\r In The Dark Crystal: Age of Resistance Tactics, lead the heroic Gelfling to restore light to the world of Thra! Experience everything the fantasy world has to offer by playing throughand going beyondthe events of the Netflix series. Encounter never-seen-before playable characters, stories, and environments. \r\rOver the course of 80 unique turn-based campaign battles taking place across the lands of Thra, recruit new allies and customize their forces by assigning them jobs and outfitting them with new equipment.\r Continue the Story in an Expanded World of Thra - Delve deeper into the legend of The Dark Crystal to learn more about the Gelfling clans and their histories across more than 5 diverse, modular territories. Choose from over 15 character jobs, play through reimagined and brand-new battles against the malicious Skeksis and help lead the proud Gelfling to victory.\r Gelfling Tactics - Devise unique ways for the outmatched Gelfling to fulfill their prophecy in multi-layered, turn-based tactical combat. Units can be customized for specific fights with gear, upgradable abilities and a job system. Use guile, planning and cunning to overcome superior foes!\r Highly Replayable - Replay finished battles to earn full marks or replay the entire game! Once completed, challenge New Game+ mode, keeping all progress from the first playthrough while facing more difficult versions of battles.\r Rich, Dynamic Environments - The world of Thra is a living, unpredictable environment as dangerous as it is beautiful. Dynamic events on the battlefield may create opportunities or put the Gelflings at a disadvantage, necessitating rapid changes in strategy.… Expand"}, {"name": "inMomentum", "details_link": "https://www.metacritic.com/game/pc/inmomentum", "publisher": "White Rabbit Interactive", "release_date": "Oct 31 2011", "developers": ["Digital Arrow"], "platforms": "PC", "genres": ["Miscellaneous", "General", "General"], "meta_score": 59, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/0438e26438a9968bed5c8a408ba62fbc-98.jpg", "descriptions": "Due for release later this summer, inMomentum is about creativity and freedom of movement. The gameplay is based on two simple actions which increase momentum each time used. To succeed, players need to manage movement to progress through the games many levels, find secret items, andDue for release later this summer, inMomentum is about creativity and freedom of movement. The gameplay is based on two simple actions which increase momentum each time used. To succeed, players need to manage movement to progress through the games many levels, find secret items, and complete a variety of gameplay challenges.  inMomentum offers both single and multiplayer game modes.… Expand"}, {"name": "Samurai Jack: The Shadow of Aku", "details_link": "https://www.metacritic.com/game/gamecube/samurai-jack-the-shadow-of-aku", "publisher": "Sega", "release_date": "Mar 24 2004", "developers": ["Adrenium"], "platforms": ["iPhone/iPad", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/9ff96ec17d57d8cb5a697abf5e35c735-98.jpg", "descriptions": "Thrust into the future by the evil Aku, a lone Samurai warrior must quickly find the time portal to the past to rescue his defenseless people. Ancestors of the displaced Samurai call him Jack and help him through four enemy-filled realms with 24 interactive levels. Samurai Jack suffersThrust into the future by the evil Aku, a lone Samurai warrior must quickly find the time portal to the past to rescue his defenseless people. Ancestors of the displaced Samurai call him Jack and help him through four enemy-filled realms with 24 interactive levels. Samurai Jack suffers various states of damage if he fails to dodge fireballs and sword strikes, but slow-motion attacks, devastating combo moves, and sushi snacks empower the hearty warrior. From a burning village to the bustling Aku City, you'll guide Jack as he blasts through doors, finds hidden pathways, and frees caged locals, bringing him ever closer to fulfilling his great destiny--the defeat of Aku once and for all. … Expand"}, {"name": "Curse: The Eye of Isis", "details_link": "https://www.metacritic.com/game/xbox/curse-the-eye-of-isis", "publisher": "DreamCatcher Interactive", "release_date": "Dec  8 2003", "developers": ["Asylum Entertainment"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/9ced35db248a843bec2724ceb9d5d29a-98.jpg", "descriptions": "Step into the shoes of Dr. Darien Dane or his assistant Victoria Sutton as you investigate the mysterious disappearance of an ancient sacred Egyptian statue from the British Museum.  Protected by an evil curse, the statue can cause madness or violent death, raise the dead, and animateStep into the shoes of Dr. Darien Dane or his assistant Victoria Sutton as you investigate the mysterious disappearance of an ancient sacred Egyptian statue from the British Museum.  Protected by an evil curse, the statue can cause madness or violent death, raise the dead, and animate diabolical objects.  Now it's up to you to find and return the cursed statue to the pyramid where it was left long ago.  But beware of your surroundings, for nearly anything can come alive and try to kill you, even the most insignificant of objects.  … Expand"}, {"name": "The Italian Job", "details_link": "https://www.metacritic.com/game/pc/the-italian-job", "publisher": "Global Star Software", "release_date": "Aug 19 2002", "developers": ["Pixelogic"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 59, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/09082a425ab0f4983b198531e78cd9fb-98.jpg", "descriptions": "There are a total of 6 playing modes, with the players thrashing the 3 Austin Mini Coopers and 11 other vehicles around 2 massive, free form areas - London, Turin and the Alps. Road, off-road and rooftop driving all feature in the game that delivers the ultimate mix of high-speed pursuit andThere are a total of 6 playing modes, with the players thrashing the 3 Austin Mini Coopers and 11 other vehicles around 2 massive, free form areas - London, Turin and the Alps. Road, off-road and rooftop driving all feature in the game that delivers the ultimate mix of high-speed pursuit and thrilling chases. [SCI]… Expand"}]