[{"name": "Job Simulator", "details_link": "https://www.metacritic.com/game/playstation-4/job-simulator", "publisher": "Owlchemy Labs", "release_date": "Oct 13 2016", "developers": ["Owlchemy Labs"], "platforms": ["PC", "PlayStation 5", "PlayStation 4"], "genres": ["Action", "General", "Simulation", "Virtual", "Career"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/0b493f5d914b84a3c161de6ba7fddbdd-98.jpg", "descriptions": "The year is 2050. Robots cook, clean, service, and organize the world with precision and speed. Human occupations are now memories of the past; long gone are the nine-to-five jobs that ran the old world. Humans raised in our perfect automated society must not forget their ancient ancestorsThe year is 2050. Robots cook, clean, service, and organize the world with precision and speed. Human occupations are now memories of the past; long gone are the nine-to-five jobs that ran the old world. Humans raised in our perfect automated society must not forget their ancient ancestors and history. This is why JobBot was born. JobBot created Job Simulator to teach humans what it is 'to job'. All praise to JobBot, for he is the keeper of human history. [Playstation.com]\r… Expand"}, {"name": "Payday 2: Crimewave Edition", "details_link": "https://www.metacritic.com/game/playstation-4/payday-2-crimewave-edition", "publisher": "505 Games", "release_date": "Jun 16 2015", "developers": ["Overkill Software"], "platforms": ["PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "General", "Fantasy", "Arcade"], "meta_score": 71, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/0/d80fc673621573571e723128616233b1-98.jpg", "descriptions": "Payday 2 is an action-packed, four-player co-op heist shooter that once again lets gamers don the masks of the original Payday crew - Dallas, Hoxton, Wolf and Chains. The new CrimeNet network offers a huge range of dynamic contracts and players are free to choose anything from small-timePayday 2 is an action-packed, four-player co-op heist shooter that once again lets gamers don the masks of the original Payday crew - Dallas, Hoxton, Wolf and Chains. The new CrimeNet network offers a huge range of dynamic contracts and players are free to choose anything from small-time convenience store hits or kidnappings, to cyber-crime or emptying out bank vaults. As the crew progresses the jobs become bigger, better and more rewarding. Along with earning more money and becoming a legendary criminal comes a new character customization and crafting system that lets crews build and customize their own guns and gear.… Expand"}, {"name": "Young Thor", "details_link": "https://www.metacritic.com/game/psp/young-thor", "publisher": "Frima Studio", "release_date": "Jul 20 2010", "developers": ["Frima Studio"], "platforms": "PSP", "genres": ["Action", "Action Adventure", "Fantasy", "Platformer", "Fantasy", "2D"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/c53240f6ca11bc68974800e31ebef0ad-98.jpg", "descriptions": "[PSP Minis]  Have you ever dreamed of exploring magnificent worlds and feeling like nothing can stop you because of your powers, of who you are? You are the young and mighty god of thunder, and the fate of the universe is in your hands. Yggdrasil, the world tree, is dying. The three Norns,[PSP Minis]  Have you ever dreamed of exploring magnificent worlds and feeling like nothing can stop you because of your powers, of who you are? You are the young and mighty god of thunder, and the fate of the universe is in your hands. Yggdrasil, the world tree, is dying. The three Norns, Skuld, Urd and Verdandi, are missing, leaving no one to tend the world tree. [Frima]… Expand"}, {"name": "The Dark Pictures Anthology: Little Hope", "details_link": "https://www.metacritic.com/game/playstation-4/the-dark-pictures-anthology-little-hope", "publisher": "Bandai Namco Games", "release_date": "Oct 30 2020", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/d8301a630e07d6090f5c1769aaa0e710-98.jpg", "descriptions": "Abandoned and all alone, 4 college students and their teacher become stranded in an isolated town miles from anywhere after their bus crashes in bad weather. Trapped by a mysterious fog in the town of Little Hope, they search desperately for a means of escape whilst visions from the pastAbandoned and all alone, 4 college students and their teacher become stranded in an isolated town miles from anywhere after their bus crashes in bad weather. Trapped by a mysterious fog in the town of Little Hope, they search desperately for a means of escape whilst visions from the past haunt them from the shadows. \r\rKey features:\r WELCOME TO LITTLE HOPE\rWitness terrifying visions of the past, haunted by the events of the XVIIth century Andover Witch Trials.\r SAVE YOUR SOULS...\rEscape the nightmarish apparitions that relentlessly pursue your cast\r DON'T PLAY ALONE\rPlay online with a friend or up to 5 friends offline, share your story and cooperate wisely to save your cast.\r Abandon Hope All who enter here… Expand"}, {"name": "Trek to Yomi", "details_link": "https://www.metacritic.com/game/pc/trek-to-yomi", "publisher": "Devolver Digital", "release_date": "May  5 2022", "developers": ["Flying Wild Hog"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/799fddc8159681100fa300e30c65a70a-98.jpg", "descriptions": "As a vow to his dying Master, the young swordsman Hiroki is sworn to protect his town and the people he loves against all threats. Faced with tragedy and bound to duty, the lone samurai must voyage beyond life and death to confront himself and decide his path forward."}, {"name": "Saints Row IV: Re-Elected", "details_link": "https://www.metacritic.com/game/switch/saints-row-iv-re-elected", "publisher": "Deep Silver", "release_date": "Mar 27 2020", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/2248338c670eaecd08c9f8ee0114ce8e-98.jpg", "descriptions": "Saints Row IV: Re-Elected After saving the world from a terrorist attack the leader of the 3rd Street Saints is elected to become President of the United States. Things go reasonably well until an alien warlord named Zinyak attacks the white house and abducts his entire cabinet. Now stuckSaints Row IV: Re-Elected After saving the world from a terrorist attack the leader of the 3rd Street Saints is elected to become President of the United States. Things go reasonably well until an alien warlord named Zinyak attacks the white house and abducts his entire cabinet. Now stuck inside a reality bending simulation, the President and the Saints fight to save themselves, Earth, and the entire galaxy if that all sounds crazy to you, trust us: were just getting started. Saints Row: Gat out of Hell In this standalone expansion epilogue to Saints Row IV, join Johnny Gat and Kinzie Kensington on an Orphean quest to save the Bosss soul from the bowels of Hell. Come for the demon killing, stay for the historical icons, open world shenanigans, talking gun, and full length musical number. Yes, seriously.… Expand"}, {"name": "Pawarumi", "details_link": "https://www.metacritic.com/game/xbox-one/pawarumi", "publisher": "Manufacture 43", "release_date": "Jul 24 2019", "developers": ["Manufacture 43"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/bad8edd9d3f52889c00b62ba5a38b9a3-98.jpg", "descriptions": "A modern shoot’em up set in a retro futuristic sci-fi universe. You’ll take control of the almighty ship Chukaru and its three unique weapons. Shoot wisely to either do double damage, heal yourself, or charge your super attack as you dispatch a enormous number of foes."}, {"name": "Dead by Daylight", "details_link": "https://www.metacritic.com/game/pc/dead-by-daylight", "publisher": "Starbreeze", "release_date": "Jun 14 2016", "developers": ["Behaviour Interactive"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 5 ", "genres": ["Action Adventure", "Survival"], "meta_score": 71, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/abe80f57bcd9458db222b5edd7524568-98.jpg", "descriptions": "Death Is Not an Escape. Dead by Daylight is an upcoming multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught, tortured and killed."}, {"name": "Just Cause 3", "details_link": "https://www.metacritic.com/game/xbox-one/just-cause-3", "publisher": "Square Enix", "release_date": "Dec  1 2015", "developers": ["Avalanche Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Sci-Fi", "Action Adventure", "Open-World"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/4dae41f9ca72e8bfd606ab59d3c5af75-98.jpg", "descriptions": "Set in the bucolic Mediterranean island republic of Medici, a land crumbling under the brutal rule of General Di Ravello, you assume control of franchise's hero Rico Rodriguez, a man on a mission to liberate his homeland and the people of Medici...by any means necessary. With over fourSet in the bucolic Mediterranean island republic of Medici, a land crumbling under the brutal rule of General Di Ravello, you assume control of franchise's hero Rico Rodriguez, a man on a mission to liberate his homeland and the people of Medici...by any means necessary. With over four hundred square miles of utter freedom from sky to seabed and a massive arsenal of weaponry, gadgets and vehicles, prepare to unleash chaos in the most creative and explosive ways you can dream up.… Expand"}, {"name": "Dyscourse", "details_link": "https://www.metacritic.com/game/pc/dyscourse", "publisher": "Owlchemy Labs", "release_date": "Mar 25 2015", "developers": ["Owlchemy Labs"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/8/9b528db58291ee86d9f7986790f67233-98.jpg", "descriptions": "Dyscourse is an interactive choose-your-own adventure where you journey through a stylized world of choice and consequence."}, {"name": "Dragon Ball Z: Burst Limit", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-ball-z-burst-limit", "publisher": "Atari", "release_date": "Jun 10 2008", "developers": ["Dimps Corporation", "Namco Bandai Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/8bc71ed6506dd92ba9ae00575c981a09-98.jpg", "descriptions": "Dragon Ball Z: Burst Limit is the first game of the Dragonball Z series to hit the next generation consoles. During each battle, find conditions to create new dramatic scenes. After the battles, watch a unique story unfold each time you play. There is also a stronger element of offence andDragon Ball Z: Burst Limit is the first game of the Dragonball Z series to hit the next generation consoles. During each battle, find conditions to create new dramatic scenes. After the battles, watch a unique story unfold each time you play. There is also a stronger element of offence and defence, due to added energy saving and fighting techniques. Competition grows with the ability to play online in both the co-op and vs. modes. During each battle, find conditions to create new scenes and watch a unique story unfold at the end of each game. Experience visuals and movement reminiscent of the anime due to Z3 shading technology and detailed effects. Increased speed of charge and release on the field, free movement around the field, and increased speed and power of attacks. Use of special skills will no longer drain energy. The lower your energy, the stronger you get, making for a possible turnaround of the battle. Each character in the game has his own \"Fatal Blow\". If the player successfully attacks his opponent, this would be a finishing move, but if not, it will put the player in the disadvantageous situation, and he must battle with no Fatal Blow for the rest of the battle. [Atari]… Expand"}, {"name": "Phantasy Star Online Episode III: C.A.R.D. Revolution", "details_link": "https://www.metacritic.com/game/gamecube/phantasy-star-online-episode-iii-card-revolution", "publisher": "Sega", "release_date": "Mar  2 2004", "developers": ["Sonic Team"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 71, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/11539ae428ea9d02aac118806adfdefd-98.jpg", "descriptions": "A strangely powerful Photon-like substance found on Planet Ragol has spurred a raging battle between the Hunters and a rebel team called the Arkz.  The prized matter known as \"The Germ\" has unique replicating powers and can be sealed in small playing-card-sized packets.  WarriorsA strangely powerful Photon-like substance found on Planet Ragol has spurred a raging battle between the Hunters and a rebel team called the Arkz.  The prized matter known as \"The Germ\" has unique replicating powers and can be sealed in small playing-card-sized packets.  Warriors carrying a deck of the sought-after cards can then bring unprecedented amounts of destructive weapons and creatures into battle.  Fight with the Hero Hunters or on the rebels' Dark Side and stack your decks accordingly.  You'll compose several powerful decks from nearly 500 cards featuring fighting moves, weapons, and PSO creatures.  … Expand"}, {"name": "RIDE 3", "details_link": "https://www.metacritic.com/game/playstation-4/ride-3", "publisher": "MileStone Inc.", "release_date": "Nov 30 2018", "developers": ["MileStone Inc.", "Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/64778626c1bc11261da15dc47d8fc830-98.jpg", "descriptions": "Experience what the creators promise to be the most complete racing ever with RIDE 3. Race on different tracks all over the world, put your favourite vehicles' speed to the test and have fun by customising them with the new Livery Editor."}, {"name": "ANNO: Mutationem", "details_link": "https://www.metacritic.com/game/pc/anno-mutationem", "publisher": "Lightning Games", "release_date": "Mar 17 2022", "developers": ["ThinkingStars"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/4180fe7c0d542c0210702b1ebc792527-98.jpg", "descriptions": "ANNO: Mutationem is an action-adventure game with RPG elements set in a cyberpunk world, featuring a unique mix of pixelated 2D & 3D graphic style with a rich, dark and bizarre plot."}, {"name": "Clea 2", "details_link": "https://www.metacritic.com/game/switch/clea-2", "publisher": "Sekai Project", "release_date": "Mar 25 2021", "developers": ["Sekai Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a04b377e15d68d3b17e2c7f5a3a579d6-98.jpg", "descriptions": "A jump scare free, skill-based survival horror sequel to the 2019 adventure. Four years have passed since the Whitlock Mansion tragedy. Florine, a former maid, is determined to resurrect the person who means everything to her. To succeed, she must travel past the third dimension and into theA jump scare free, skill-based survival horror sequel to the 2019 adventure. Four years have passed since the Whitlock Mansion tragedy. Florine, a former maid, is determined to resurrect the person who means everything to her. To succeed, she must travel past the third dimension and into the realms beyond. Otherworldly horrors lie in wait, but Florine is determined to soldier on.\r This, after all, is her final chance at redemption.\r * * *\r Skill-focused horror:\r Clea 2 is primarily a test of skills. Enemies roam the halls dynamically in real-time, reacting to the players' every noise. Clea is a challenging title, rewarding those who have mastered its mechanics.\r No jump scares:\r Clea 1 was a jump scare free experience, and the tradition continues here in this sequel.… Expand"}, {"name": "Deponia", "details_link": "https://www.metacritic.com/game/playstation-4/deponia", "publisher": "THQ Nordic", "release_date": "Dec  1 2016", "developers": ["Daedalic Entertainment"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/08cfa757a07c278c98f91a05f880715e-98.jpg", "descriptions": "Deponia is a fast-paced comedy of errors and one of the most unusual love stories in gaming history. The twist-filled story takes its off-beat characters all over trash planet Deponia, a unique game world in the style of Douglas Adams, Terry Pratchett and Matt Groening. From Kuvaq, anDeponia is a fast-paced comedy of errors and one of the most unusual love stories in gaming history. The twist-filled story takes its off-beat characters all over trash planet Deponia, a unique game world in the style of Douglas Adams, Terry Pratchett and Matt Groening. From Kuvaq, an improvised village built inside a giant trash heap, to the swimming black market and the dark corners of the elevated planetary railways: Deponia is brought to life with detailed hand-painted backgrounds in widescreen format and top-quality cartoon animation… Expand"}, {"name": "Tumblestone", "details_link": "https://www.metacritic.com/game/xbox-one/tumblestone", "publisher": "Ty Taylor and Mario Castaneda", "release_date": "Jul 16 2016", "developers": ["Ty Taylor and Mario Castaneda"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Puzzle", "Stacking"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/bfd5667d00c3cb001fa73c7bd545eefc-98.jpg", "descriptions": "A new competitive indie puzzler from The Quantum Astrophysicists Guild. Inspired by beloved classics like Tetris and Puyo Puyo, and adding a story mode, arcade modes, and exciting multiplayer game modes. [Xbox.com]"}, {"name": "Penarium", "details_link": "https://www.metacritic.com/game/playstation-4/penarium", "publisher": "Team17", "release_date": "Sep 22 2015", "developers": ["Self Made Miracle"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/22b9d49d47769fcd6754df3b1e2ef0f6-98.jpg", "descriptions": "Penarium is a frantic 2D arena arcade game in which you take on the role of quirky antihero, Willy. Willy is trapped in a crazy circus show where he needs to run, jump, and avoid an array of killer death-traps while being cheered on by a sadistic crowd that’s out for blood — his blood. [SelfPenarium is a frantic 2D arena arcade game in which you take on the role of quirky antihero, Willy. Willy is trapped in a crazy circus show where he needs to run, jump, and avoid an array of killer death-traps while being cheered on by a sadistic crowd that’s out for blood — his blood. [Self Made Miracle]… Expand"}, {"name": "NES Remix", "details_link": "https://www.metacritic.com/game/wii-u/nes-remix", "publisher": "Nintendo", "release_date": "Dec 18 2013", "developers": ["indieszero"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "Party / Minigame"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/7d279892bfe5bca6579a4b825ea60cd6-98.jpg", "descriptions": "NES Remix is a compilation title available in the Nintendo eShop on Wii U that brings together 16 classic NES games and updates with more modern challenges."}, {"name": "NBA Live 06", "details_link": "https://www.metacritic.com/game/pc/nba-live-06", "publisher": "EA Sports", "release_date": "Sep 26 2005", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/d1feabe260e8df1feeafee3857e9a24a-98.jpg", "descriptions": "Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo,Freestyle Superstars: You are in control of the top NBA stars, performing like their real-life counterparts based on distinct character types, including Power, Playmaker, Stopper and more. Authentic 5-on-5 Gameplay: The all-new animation system helps to visually present the up-tempo, fast-break brand of basketball that makes the NBA thrive. Also featured, is an improved transition game and a more physical brand of play with collisions and dunked-on scenarios. New Player Visuals: A new graphics engine now has player models not only playing and acting like their real life counterparts, but looking the part with striking detail and realism. [Electronic Arts]… Expand"}, {"name": "CT Special Forces", "details_link": "https://www.metacritic.com/game/game-boy-advance/ct-special-forces", "publisher": "Hip Games", "release_date": "Jan  4 2004", "developers": ["LSP"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/f8646a2005bc8511a4d4523b044d03fe-98.jpg", "descriptions": "As part of the Counter-Terrorist Special Forces unit, you have all the necessary means for putting an end to the threat of terrorism. Your team comprises highly trained soldiers who can do anything from dressing in camouflage to initiating surgical strikes on the enemy. In both groundAs part of the Counter-Terrorist Special Forces unit, you have all the necessary means for putting an end to the threat of terrorism. Your team comprises highly trained soldiers who can do anything from dressing in camouflage to initiating surgical strikes on the enemy. In both ground missions and air combat, you'll plunge into 12 levels that span jungles, cities, mountains, and deserts. You can equip your team with various state-of-the-art weapons, including assault rifles and rocket launchers. Multiplayer mode lets you team up with a friend to complete missions.… Expand"}, {"name": "Styx: Master of Shadows", "details_link": "https://www.metacritic.com/game/pc/styx-master-of-shadows", "publisher": "Focus Home Interactive", "release_date": "Oct  7 2014", "developers": ["Cyanide"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/fe1e782c0085f4c2468f35f3c12c1ba3-98.jpg", "descriptions": "Styx: Master of Shadows is an infiltration game with role-playing elements set in a dark fantasy universe, where you sneak, steal and assassinate your way through as Styx, a Goblin two-centuries old."}, {"name": "Medal of Honor Heroes", "details_link": "https://www.metacritic.com/game/psp/medal-of-honor-heroes", "publisher": "EA Games", "release_date": "Oct 20 2006", "developers": ["Team Fusion"], "platforms": "PSP", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/aab500b921f1d32b6689fbf3aeea0804-98.jpg", "descriptions": "Medal of Honor Heroes give gamers the chance to take all the epic, authentic World War II action of Medal of Honor on the PSP. With a unique storyline and PSP-specific feature set, players experience a totally new single player campaign and choose from six different Multiplayer modes withinMedal of Honor Heroes give gamers the chance to take all the epic, authentic World War II action of Medal of Honor on the PSP. With a unique storyline and PSP-specific feature set, players experience a totally new single player campaign and choose from six different Multiplayer modes within 15 different maps, while participating in wireless Multiplayer sessions with up to 32 players. Or choose to play with up to 8 players across the room in a local Ad hoc game. \"Quickplay\" missions in skirmish mode allows players to jump right into the action or customize mission scenarios for added re-playability. Unlock over 20 classic characters to use in multiplayer games. Take on the role of Lieutenant Jimmy Patterson – star of Medal of Honor, and Medal of Honor Frontline – in an untold chapter of his time in Holland as part of Operation Market Garden. Play as Sergeant John Baker, from Medal of Honor Allied Assault Breakthrough, and sabotage German defenses on the Italian coastline to help the invasion forces crack Hitler’s iron hold on Europe. Don the officer’s cap of Lieutenant William Holt from Medal of Honor European Assault – and return to the Ardennes Forest during the Battle of the Bulge to complete unfinished business for the OSS. The Medal of Honor development teams continue to ensure that the ideals and integrity of the prestigious congressional Medal of Honor are accurately reflected within the game series. [Electronic Arts]… Expand"}, {"name": "Sacred 2: Fallen Angel", "details_link": "https://www.metacritic.com/game/xbox-360/sacred-2-fallen-angel", "publisher": "cdv Software", "release_date": "May 11 2009", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/98b6572ab449f0ee2d57dd86abe5a294-98.jpg", "descriptions": "Ancaria already awaits you! The mighty realm of the Highelves lies in ruins. The raging war for control over the T-Energy wears down the land and lures its denizens into fear and chaos. The world calls for a hero to end this war. Accompany six characters through the mystic - technologicalAncaria already awaits you! The mighty realm of the Highelves lies in ruins. The raging war for control over the T-Energy wears down the land and lures its denizens into fear and chaos. The world calls for a hero to end this war. Accompany six characters through the mystic - technological universe of Sacred 2: Fallen Angel. Dwell on dreary paths or follow the ways of the light. The decision is yours alone, but be aware this decision will change the world. [Ascaron Entertainment]… Expand"}, {"name": "UEFA Champions League 2006-2007", "details_link": "https://www.metacritic.com/game/psp/uefa-champions-league-2006-2007", "publisher": "EA Sports", "release_date": "Mar 20 2007", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox 360", "PSP"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Management"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/8bc46ff0adabda951e1904110499637e-98.jpg", "descriptions": "Feel the weight of history as you walk out to a deafening roar and onto the biggest stage in club football. In the cauldron-like atmosphere of a stadium alive with the dreams of thousands and heaving with the pressure of expectation, kick off alongside the most formidably talentedFeel the weight of history as you walk out to a deafening roar and onto the biggest stage in club football. In the cauldron-like atmosphere of a stadium alive with the dreams of thousands and heaving with the pressure of expectation, kick off alongside the most formidably talented footballers in Europe – and outplay them. Here is the ultimate test. Here history is made. Write yourself into legend with the only official UEFA Champions League 2006-2007 videogame. Test your management credentials with over 400 objectives to accomplish across all game modes. Take your pick from an array of gameplay options, including The Treble, where you have just one season in your bid to score European football's dream hat-trick. Thanks to a fluid, pacy movement system, players can now release more incisive defence-splitting one-twos, first touches and through passes. With five challenging game modes to test your managerial skill at the top level, it's down to you to write yourself into UEFA Champions League history. [Electronic Arts]… Expand"}, {"name": "Team Sonic Racing", "details_link": "https://www.metacritic.com/game/switch/team-sonic-racing", "publisher": "Sega", "release_date": "May 21 2019", "developers": ["Sumo Digital"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 12 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/10b3e14b7e45be45d6354372c9c4edc1-98.jpg", "descriptions": "Team Sonic Racing combines the best elements of arcade and fast and fast-paced competitive style racing as you face-off with friends in off with friends in intense multiplayer racing. Race together and work as a team by sharing power-ups and speed boosts. Take control of your racing style --Team Sonic Racing combines the best elements of arcade and fast and fast-paced competitive style racing as you face-off with friends in off with friends in intense multiplayer racing. Race together and work as a team by sharing power-ups and speed boosts. Take control of your racing style -- Choose from 3 distinct character types and unlock game changing vehicle customisation options to suit your racing style. Speed up. Gear Up -- Team Racing at Sonic Speed!… Expand"}, {"name": "Sega Superstars Tennis", "details_link": "https://www.metacritic.com/game/wii/sega-superstars-tennis", "publisher": "Sega", "release_date": "Mar 18 2008", "developers": ["Sumo Digital"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/8ce692d568a70caeb1ae3a58753bf163-98.jpg", "descriptions": "Sixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos andSixteen fan-favorite SEGA characters from Sonic to NiGHTS are serving up fun in SEGA Superstars Tennis. Multiple madcap mini-games keep the party rolling and up to four friends can challenge each other in tournaments, exhibitions and unlockable special events. With hilarious cameos and comical guest umpires from SEGA's rich gaming history, this fun-filled tennis party promises to be a smashing good time for the whole family. Zany SEGA Characters with Superstar Abilities - Each of the 16 characters has their own superstar alter-ego, which gives them the winning edge on the court. Ten Fantastical Themed Courts - Guest umpires will supervise the action on a wide variety of colorful courts, from Sonic's lush Green Hill Zone to Ulala's galactic Space Channel 5 world, just to name a couple. Four Action-Packed Tournaments - As you slice your way through the competitive tournaments, you will unlock loads of bonus content. Classic Soundtrack - Faithfully recreated in full Dolby Digital 5.1, treasured SEGA tunes will entertain SEGA fans new and old. [Sega]… Expand"}, {"name": "Shank", "details_link": "https://www.metacritic.com/game/xbox-360/shank", "publisher": "Electronic Arts", "release_date": "Aug 25 2010", "developers": ["Klei Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/7785d0b42933f8d39eabc9c4d3347017-98.jpg", "descriptions": "Shank is a new game that a small team at Klei is working on. It's an over-the-top action/adventure, built with all the things that we at Klei are passionate about: amazing control, great animation, immersive environment, and everything else that we feel like, and none of the stuff we don't."}, {"name": "Surgeon Simulator 2013", "details_link": "https://www.metacritic.com/game/pc/surgeon-simulator-2013", "publisher": "Bossa Studios", "release_date": "Apr 19 2013", "developers": ["Bossa Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "General", "Virtual", "Career"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/6b085d783d03d77e081f5cc72ef0f413-98.jpg", "descriptions": "Surgeon Simulator 2013 is a darkly humorous over-the-top operation sim game where players become Nigel Burke, a would-be surgeon taking life into his own shaky hands, performing life-saving surgical maneuvers on passive patients."}, {"name": "Hotshot Racing", "details_link": "https://www.metacritic.com/game/pc/hotshot-racing", "publisher": "Sumo Digital", "release_date": "Sep 10 2020", "developers": ["Lucky Mountain Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/5264ca240f06d92ac69b4a0cec857ff6-98.jpg", "descriptions": "Hotshot Racing is a blisteringly fast arcade-style racing game fusing drift handling, razor-sharp retro visuals and an incredible sense of speed to create an exhilarating driving experience."}, {"name": "The Typing of the Dead: Overkill", "details_link": "https://www.metacritic.com/game/pc/the-typing-of-the-dead-overkill", "publisher": "Sega", "release_date": "Oct 29 2013", "developers": ["Modern Dream"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/bda274cbf5f0d1009182649420e71775-98.jpg", "descriptions": "The Typing of the dead: Overkill brings together the horror and comedy of the legendary House of the Dead series with unique typing mechanics in order to deliver a unique gaming cornucopia.  This visceral shooter puts you in the middle of a mutant outbreak in Bayou county."}, {"name": "Disney Infinity", "details_link": "https://www.metacritic.com/game/wii-u/disney-infinity", "publisher": "Disney Interactive Studios", "release_date": "Aug 18 2013", "developers": ["Avalanche Software"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/91b5e5a24cdbbcee0e3f3fff2d761e03-98.jpg", "descriptions": "In Disney's most ambitious video game initiative ever, Disney Infinity introduces an all-new game universe where a spark of imagination unlocks a fantastical world where players have unprecedented freedom and endless opportunity to create stories and play experiences starring the belovedIn Disney's most ambitious video game initiative ever, Disney Infinity introduces an all-new game universe where a spark of imagination unlocks a fantastical world where players have unprecedented freedom and endless opportunity to create stories and play experiences starring the beloved characters from Walt Disney and Pixar Animation Studios' most popular franchises.… Expand"}, {"name": "Record of Agarest War", "details_link": "https://www.metacritic.com/game/xbox-360/record-of-agarest-war", "publisher": "Aksys Games", "release_date": "Apr 26 2010", "developers": ["Compile Heart"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/8a5cf7efddaf08d01f7582798c92084f-98.jpg", "descriptions": "War darkened the skies of Agarest. Not a simple war between mortals, easily ended by divine intervention, but a war that split the gods themselves. Armies such as the world had never seen before, and would never see again, clashed in the skies of Agarest, across its surface, and even in theWar darkened the skies of Agarest. Not a simple war between mortals, easily ended by divine intervention, but a war that split the gods themselves. Armies such as the world had never seen before, and would never see again, clashed in the skies of Agarest, across its surface, and even in the caverns that wound their way through its interior. As is the way in war, many died on both sides, gods and mortals alike, and the war left Agarest broken, blackened, and dead. The gods wept for their paradise, and in a final act of creation, sacrificed themselves to bring life back to its charred and twisted surface. Although the gods are long dead, the withering darkness that began and fueled their war is not. Imprisoned for millennia, its bonds have begun to weaken, and as they do, a shadow once again spreads across the surface of the world. Born into this world perched unknowingly on the brink of the apocalypse, a young man by the name of Leonhardt and his descendants are the last, best hope for Agarest. Their journey will span generations and continents as they strive to once again bring peace to their beleaguered world, even as the cost of their own souls. [Aksys Games]… Expand"}, {"name": "Syberia II", "details_link": "https://www.metacritic.com/game/xbox/syberia-ii", "publisher": "XS Games", "release_date": "Oct  5 2004", "developers": ["Microids"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Fantasy"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/c924177e5efa738b51bd4b7412542513-98.jpg", "descriptions": "An unlikely pair--young Kate Walker and old Hans Voralberg--must now set off on a journey together in search of the last of the fabled Syberian mammoths. Guide Hans and Kate as they face dangerous obstacles that test their courage and determination. You'll encounter new characters in aAn unlikely pair--young Kate Walker and old Hans Voralberg--must now set off on a journey together in search of the last of the fabled Syberian mammoths. Guide Hans and Kate as they face dangerous obstacles that test their courage and determination. You'll encounter new characters in a variety of environments. Each puzzle you solve brings you closer to the heart of a long-forgotten universe. It's now up to you to solve the mysteries behind Syberia.… Expand"}, {"name": "Spidersaurs", "details_link": "https://www.metacritic.com/game/switch/spidersaurs", "publisher": "WayForward", "release_date": "Jul 14 2022", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/f37635469b6853b5d37ed8c0b118ea3e-98.jpg", "descriptions": "Alert! Alert! The nightmarish dinosaur-spider hybrids known as Spidersaurs have run amok and only you (and a friend in co-op mode) can stop them!Created by InGest Corp to provide the meat and muscle that humanity needs to end world hunger, the Spidersaurs are now on the loose, leaving itAlert! Alert! The nightmarish dinosaur-spider hybrids known as Spidersaurs have run amok and only you (and a friend in co-op mode) can stop them!Created by InGest Corp to provide the meat and muscle that humanity needs to end world hunger, the Spidersaurs are now on the loose, leaving it to two former taste-testers - officer-in-training Adrian and punk-rocker Victoria - to use their awesome firepower to overcome six stages of ferocious run-'n'-gun action.Blast through a sweltering jungle, an infested laboratory, the heart of a live volcano, and more! The tangy food source with a bite is biting back, but by grabbing power-ups, gaining new abilities, and obliterating everything in sight, you can send these mutant monstrosities back to the stone age.… Expand"}, {"name": "SaGa Frontier Remastered", "details_link": "https://www.metacritic.com/game/switch/saga-frontier-remastered", "publisher": "Square Enix", "release_date": "Apr 15 2021", "developers": ["Square Enix", "Bullets"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/284d1b7da9968cbc8ac5fd1c998d222a-98.jpg", "descriptions": "The 1998 PlayStation® classic is back: SaGa Frontier is remastered. The team of eight have returned – now with Fuse added as a playable character. Choose your favorite character and embark on your own unique journey. Each of the eight characters have different goals and endings. Your choicesThe 1998 PlayStation® classic is back: SaGa Frontier is remastered. The team of eight have returned – now with Fuse added as a playable character. Choose your favorite character and embark on your own unique journey. Each of the eight characters have different goals and endings. Your choices will affect how events unfold using the Free-Form Scenario System. This in-depth system will allow you to manipulate and expand a story all your own. Challenge yourself in nail-biting battles by using “glimmer\" as well as learning new skills such as the ability to fire consecutive special attacks from multiple team members.… Expand"}, {"name": "Yu-Gi-Oh! Legacy of the Duelist: Link Evolution", "details_link": "https://www.metacritic.com/game/playstation-4/yu-gi-oh!-legacy-of-the-duelist-link-evolution", "publisher": "Konami", "release_date": "Mar 24 2020", "developers": ["Konami"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 71, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/d669e81a5f8e960b5363b7f059cde48d-98.jpg", "descriptions": "Experience 20 years of Yu-Gi-Oh! history with Yu-Gi-Oh! Legacy of the Duelist: Link Evolution! Build your Deck from over 10,000 cards and take on the most iconic Duelists from the Yu-Gi-Oh! universe. Relive the stories from the original animated series through Yu-Gi-Oh! VRAINS!"}, {"name": "God Eater 3", "details_link": "https://www.metacritic.com/game/pc/god-eater-3", "publisher": "Bandai Namco Games", "release_date": "Feb  8 2019", "developers": ["Bandai Namco Games", "Marvelous First Studio"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/f780f31f9981bf4ea810f5bf0f25ec72-98.jpg", "descriptions": "Set in a post-apocalyptic world, it’s up to your special team of God Eaters to destroy god-like monsters devastating the world. With an epic story, unique characters, and all new God Arcs and Aragami, the latest evolution in ACTION is here."}, {"name": "The Council - Episode 3: Ripples", "details_link": "https://www.metacritic.com/game/pc/the-council---episode-3-ripples", "publisher": "Focus Home Interactive", "release_date": "Jul 24 2018", "developers": ["Big Bad Wolf"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/6f97b81ee84102f12eb4d39b6d323143-98.jpg", "descriptions": "Episode 3: Ripples continues the story of Louis de Richet as plots are laid bare, characters reach their breaking point, and an unexpected, terrifying truth is uncovered. It will take all of Louis’ influence to prevent the situation from growing out of hand."}, {"name": "Pool Panic", "details_link": "https://www.metacritic.com/game/switch/pool-panic", "publisher": "Adult Swim", "release_date": "Jul 19 2018", "developers": ["Rekim"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/9d6d1b3f8c2306d0bbd8d61763e8f392-98.jpg", "descriptions": "Pool Panic frees billiards from the table and unleashes it into a world where everything from jungles and deserts to cities and swamps is a living pool game! You already know that sinking eight balls is the ultimate goal, but can you succeed while contending with monster balls chasing you,Pool Panic frees billiards from the table and unleashes it into a world where everything from jungles and deserts to cities and swamps is a living pool game! You already know that sinking eight balls is the ultimate goal, but can you succeed while contending with monster balls chasing you, or ballerina balls leaping away from your well-aimed shots? Take on the role of the mischievous, and dare we say, oblivious cue ball in Pool Panic's unique world comprised of 100+ levels while enjoying the single-player campaign, or invite your friends to join you for a multiplayer panic. … Expand"}, {"name": "Minecraft: Story Mode Season Two - Episode 3: Jailhouse Block", "details_link": "https://www.metacritic.com/game/pc/minecraft-story-mode-season-two---episode-3-jailhouse-block", "publisher": "Telltale Games", "release_date": "Sep 19 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Jesse and the gang must brave a dangerous prison and its even more dangerous inmates to reach the secret at the prison's heart... But when the enemy tries to recruit Jesse's friends, will they be able to resist the call?"}, {"name": "Factotum 90", "details_link": "https://www.metacritic.com/game/xbox-one/factotum-90", "publisher": "TACS Games", "release_date": "Feb 10 2016", "developers": ["TACS Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/31dd7cefbe88c0506314f80397c0c26e-98.jpg", "descriptions": "In space no one can hear you remotely operate twin quadrupedal deck walker robots. You're in deep space and something's collided with the ship. Main power is offline and you're trapped. It's lucky you have access to this walker control terminal. It's a little old but with these two robotsIn space no one can hear you remotely operate twin quadrupedal deck walker robots. You're in deep space and something's collided with the ship. Main power is offline and you're trapped. It's lucky you have access to this walker control terminal. It's a little old but with these two robots and some clever thinking you might be able to get power back on-line and save the day. Control two walker robots and puzzle your way through 30 levels to restore power, reactivate the life support and solve the mystery of the collision.… Expand"}, {"name": "Alien Breed: Impact", "details_link": "https://www.metacritic.com/game/playstation-3/alien-breed-impact", "publisher": "Team17", "release_date": "Oct  5 2010", "developers": ["Team17"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/d852663b9f1369587979da063deb23b1-98.jpg", "descriptions": "Team 17 are reviving the classic Alien Breed franchise in this all new Unreal powered remake."}, {"name": "Battle Realms: Winter of the Wolf", "details_link": "https://www.metacritic.com/game/pc/battle-realms-winter-of-the-wolf", "publisher": "Crave", "release_date": "Nov  5 2002", "developers": ["Liquid Entertainment"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy", "Command"], "meta_score": 71, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/38d4be7a5fbf7a6c75922824ba64d134-98.jpg", "descriptions": "Winter of the Wolf takes place seven years prior to the events in Battle Realms. The Wolf Clan has suffered under the lash of its Lotus slave masters for three decades, toiling endlessly in the brutal depths of the shale mines. As Grayback, new chieftain of the Wolf Clan, players must uniteWinter of the Wolf takes place seven years prior to the events in Battle Realms. The Wolf Clan has suffered under the lash of its Lotus slave masters for three decades, toiling endlessly in the brutal depths of the shale mines. As Grayback, new chieftain of the Wolf Clan, players must unite the scattered Wolves and win their freedom from tyranny. At their disposal are slaves wielding shale-breaking sledgehammers strong enough to shatter iron; hurling burning pitch to sear the flesh from their enemies' bones; even brawling two-fisted with massive slabs of stone. Grayback must use his knowledge of the mines to defeat superior forces, rediscover the powers of the lost Druidesses, and convince his fellow slaves to risk everything for their chance at freedom. [Ubi Soft]… Expand"}, {"name": "Cubivore: Survival of the Fittest", "details_link": "https://www.metacritic.com/game/gamecube/cubivore-survival-of-the-fittest", "publisher": "Atlus Co.", "release_date": "Nov  5 2002", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/e89ec79d52b6b92524a866d00cc5d630-98.jpg", "descriptions": "The premise of the game is simple: Eat or be eaten. In Cubivore, you'll assume the role of an animal in its early stages of development. From the moment the game begins, your creature is on its own to fend for its life. As your animal instincts take over, you will boldly traverse hostileThe premise of the game is simple: Eat or be eaten. In Cubivore, you'll assume the role of an animal in its early stages of development. From the moment the game begins, your creature is on its own to fend for its life. As your animal instincts take over, you will boldly traverse hostile environments, savagely stalking your prey and asserting your place in the animal chain of power. Explore a number of different environments while consuming other animals in order to evolve into one of 100 possible creature combinations. Ultimately, the goal is to become powerful enough to topple the alpha creature and earn your rightful place at the top of the food chain.… Expand"}, {"name": "Stuntman", "details_link": "https://www.metacritic.com/game/playstation-2/stuntman", "publisher": "Atari", "release_date": "Jun 23 2002", "developers": ["Reflections Interactive"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 71, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/7d727b9ac6e6b69f956d440d681633e5-98.jpg", "descriptions": "Rise from rookie driver to hero of the silver screen. Have you got what it takes? In the world of stunt driving, fear is failure. One slip and your Hollywood dreams are over. The higher you climb, the higher the stakes. Grip the wheel, hit the gas, chase the glory. [Infogrames]"}, {"name": "Mobile Suit Gundam: Zeonic Front", "details_link": "https://www.metacritic.com/game/playstation-2/mobile-suit-gundam-zeonic-front", "publisher": "Bandai", "release_date": "Jan 15 2002", "developers": ["Sunrise Interactive"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 71, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/0e274f5b13caf36b739edb3c0ad9132a-98.jpg", "descriptions": "Become your own worst enemy! For years you fought against the Zeon, now fight as one. For the first time, assume the role of a Zeon and take control of an elite mobile suit team. Set in the One Year War,? battle against the Earth Federation for independence and control of Earth territories.Become your own worst enemy! For years you fought against the Zeon, now fight as one. For the first time, assume the role of a Zeon and take control of an elite mobile suit team. Set in the One Year War,? battle against the Earth Federation for independence and control of Earth territories. Control up to three attack teams per mission and devise superior strategies against Earth Federation troops. [Bandai]… Expand"}, {"name": "NBA Courtside 2002", "details_link": "https://www.metacritic.com/game/gamecube/nba-courtside-2002", "publisher": "Nintendo", "release_date": "Jan 13 2002", "developers": ["Left Field Productions"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/e3a741f5547dffff56a3be208139ccd5-98.jpg", "descriptions": "Despite the fact that it's a solid first-year effort, Courtside 2002 isn't without its flaws and is generally a step behind more seasoned competing products."}, {"name": "Silent Hunter II", "details_link": "https://www.metacritic.com/game/pc/silent-hunter-ii", "publisher": "SSI", "release_date": "Nov  5 2001", "developers": ["Ultimation Inc."], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Submarine", "Marine", "Combat"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/e044b2ec4723647549968301864d0ae5-98.jpg", "descriptions": "This WWII U-boat combat simulator puts players in command of a cunning killer. Features 3D modeled ships, subs, aircraft from all major powers in the Atlantic; inter-operability via the internet with the naval combat simulation, \"Destroyer Command\"; ultra-realistic, real-time ocean andThis WWII U-boat combat simulator puts players in command of a cunning killer. Features 3D modeled ships, subs, aircraft from all major powers in the Atlantic; inter-operability via the internet with the naval combat simulation, \"Destroyer Command\"; ultra-realistic, real-time ocean and weather effects; and adjustable realism and difficulty levels. [Ubi Soft]… Expand"}, {"name": "Magic & Mayhem: The Art of Magic", "details_link": "https://www.metacritic.com/game/pc/magic-mayhem-the-art-of-magic", "publisher": "Bethesda Softworks", "release_date": "Oct 26 2001", "developers": ["Charybdis"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/706dadb6d564e0bdee479d577bad222b-98.jpg", "descriptions": "A unique blend of strategy, tactical combat, and role-playing brought to life with full 3D graphics and an epic storyline. As a Wizard, you have the power to conjure terrifying creatures and devastating spells against you opponent. Before each battle, you choose which spells you will bringA unique blend of strategy, tactical combat, and role-playing brought to life with full 3D graphics and an epic storyline. As a Wizard, you have the power to conjure terrifying creatures and devastating spells against you opponent. Before each battle, you choose which spells you will bring with you, and then use the spells in real-time tactical combat against your opponent. [Bethesda Softworks]… Expand"}, {"name": "Project Eden", "details_link": "https://www.metacritic.com/game/playstation-2/project-eden", "publisher": "Eidos Interactive", "release_date": "Oct 22 2001", "developers": ["Core Design Ltd."], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/1b21ccae49f9c774dd6eeab7b9f141f3-98.jpg", "descriptions": "Designed by the team that created the original \"Tomb Raider,\" Project Eden puts the player in control of an elite 4-person team of Urban Protection Agency members called in to investigate a bizarre equipment malfunction at the Real Meat factory."}, {"name": "Mega Man Legacy Collection 2", "details_link": "https://www.metacritic.com/game/playstation-4/mega-man-legacy-collection-2", "publisher": "Capcom", "release_date": "Aug  8 2017", "developers": ["Capcom", "Now Production", "Bullets"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/417fae5435b8a49fa0b3736128268f5a-98.jpg", "descriptions": "The Blue Bomber returns in this 2nd collection of classic Capcom titles. Featuring reproductions of Mega Man 7, 8, 9, and 10, this collection is full of additional content, from time trials and remix challenges to a music player and an extensive gallery of rare illustrations."}, {"name": "Call of Duty: WWII - The Resistance", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-wwii---the-resistance", "publisher": "Activision", "release_date": "Jan 30 2018", "developers": ["Sledgehammer Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/7/db761eb1af8415155961422e31845898-98.jpg", "descriptions": "Continue the epic scale of war with DLC Pack 1 for Call of Duty®: WWII - The Resistance. Fight in iconic locations centered around historic resistance uprisings in three new Multiplayer maps, as well as an all new objective-based War mode mission, 'Operation Intercept'. Plus, experience theContinue the epic scale of war with DLC Pack 1 for Call of Duty®: WWII - The Resistance. Fight in iconic locations centered around historic resistance uprisings in three new Multiplayer maps, as well as an all new objective-based War mode mission, 'Operation Intercept'. Plus, experience the latest Nazi Zombies chapter, 'The Darkest Shore'.… Expand"}, {"name": "Assassin's Creed Rogue Remastered", "details_link": "https://www.metacritic.com/game/xbox-one/assassins-creed-rogue-remastered", "publisher": "Ubisoft", "release_date": "Mar 20 2018", "developers": ["Ubisoft"], "platforms": ["PlayStation 4", "Stadia", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/d7049dc3cd91a409674ef5f0177b9ee1-98.jpg", "descriptions": "18th century, North America. Amid the chaos and violence of the French and Indian War, Shay Patrick Cormac, a fearless young member of the Assassin Brotherhood, undergoes a dark transformation that will forever shape the future of the colonies. After a dangerous mission gone tragically18th century, North America. Amid the chaos and violence of the French and Indian War, Shay Patrick Cormac, a fearless young member of the Assassin Brotherhood, undergoes a dark transformation that will forever shape the future of the colonies. After a dangerous mission gone tragically wrong, Shay turns his back on the Assassins who, in response, attempt to end his life. Cast aside by those he once called brothers, Shay sets out on a mission to wipe out all who turned against him, to ultimately become the most feared Assassin hunter in history. In Assassin’s Creed Rogue Remastered, you will experience the slow transformation from Assassin to Assassin hunter. Follow your own creed and set off on an extraordinary journey through New York City, the wild river valley, and far away to the icy cold waters of the North Atlantic in pursuit of your ultimate goal to bring down the Assassins for good. [Ubisoft]… Expand"}, {"name": "Titan Quest: Ragnarok", "details_link": "https://www.metacritic.com/game/pc/titan-quest-ragnarok", "publisher": "THQ Nordic", "release_date": "Nov 17 2017", "developers": ["Iron Lore Entertainment", "Pieces Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/624aa72d334e6e6db1c293da4f47ebc3-98.jpg", "descriptions": "At long last, Titan Quest continues its epic journey through the world of antiquity. A mysterious threat calls the heroes of Hades to the uncharted lands of northern Europe, where new enemies await and new powers and treasures are waiting to be found. This new expansion to the acclaimedAt long last, Titan Quest continues its epic journey through the world of antiquity. A mysterious threat calls the heroes of Hades to the uncharted lands of northern Europe, where new enemies await and new powers and treasures are waiting to be found. This new expansion to the acclaimed Anniversary Edition of Titan Quest adds a fifth act of unprecedented scope, along with many new and requested features including new weapon types and a 10th Mastery for your characters to learn.… Expand"}, {"name": "Loot Rascals", "details_link": "https://www.metacritic.com/game/playstation-4/loot-rascals", "publisher": "Hollow Ponds", "release_date": "Mar  7 2017", "developers": ["Hollow Ponds"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/cd5b821e489ac923e1e7bbbfac512fce-98.jpg", "descriptions": "Only you can rescue Big Barry - your huge robot head pal - from a space theme park that’s been invaded by a tentacled pan-dimensional godbeast."}, {"name": "Shadow of Destiny", "details_link": "https://www.metacritic.com/game/pc/shadow-of-destiny", "publisher": "Konami", "release_date": "Dec  2 2002", "developers": ["Runecraft"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/9dfccfe998b08a5b89748c1d50b9fac1-98.jpg", "descriptions": "A murder has been committed... your own! Travel back in time to solve thought provoking puzzles as you unravel the mystery of your death. See how your actions in the past change the course of events in the future. You have the power to prevent your death, identify your killer, and changeA murder has been committed... your own! Travel back in time to solve thought provoking puzzles as you unravel the mystery of your death. See how your actions in the past change the course of events in the future. You have the power to prevent your death, identify your killer, and change your destiny. Use it wisely. [Konami]… Expand"}, {"name": "The Centennial Case: A Shijima Story", "details_link": "https://www.metacritic.com/game/playstation-5/the-centennial-case-a-shijima-story", "publisher": "Square Enix", "release_date": "May 12 2022", "developers": ["h.a.n.d. Inc."], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/e60fd84b5186fe79c76841c62aec4d82-98.jpg", "descriptions": "The complex and interwoven mysteries you’ll unravel in this investigative adventure are centered around the ill-fated Shijima family, which has suffered a series of inexplicable deaths over the last century. As Haruka Kagami, it’s up to you to use your powers of deduction to uncover theThe complex and interwoven mysteries you’ll unravel in this investigative adventure are centered around the ill-fated Shijima family, which has suffered a series of inexplicable deaths over the last century. As Haruka Kagami, it’s up to you to use your powers of deduction to uncover the truth behind these mysterious events and the ‘Fruit of Youth’ that allegedly lies somewhere in the Shijima Mansion. You’ll explore both the past and the present in four murder cases, set across different eras of Japan. Of course, unravelling this intricate web of secrets won’t be straightforward. You’ll have to have your wits about you as you uncover clues, speak to suspects, and put all the pieces of the puzzle together to form a hypothesis. Not everyone you speak to will be cooperative, so be ready to counter their arguments when you present your case. And don’t worry if your detective skills are a little rusty - the game is designed in such a way that you’ll be able to reach the correct answer if you don’t give up. [Square Enix]… Expand"}, {"name": "Collection of SaGa: Final Fantasy Legend", "details_link": "https://www.metacritic.com/game/switch/collection-of-saga-final-fantasy-legend", "publisher": "Square Enix", "release_date": "Dec 15 2020", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/f71ede4cd8dcd77f51ee5d4d0e428307-98.jpg", "descriptions": "In celebration of the SaGa series' 30th anniversary, the first three games in the series are coming to Nintendo Switch in one collection! The first Game Boy RPG to sell over a million units and the memorable first installment of the series: THE FINAL FANTASY LEGEND. \nA title that gainedIn celebration of the SaGa series' 30th anniversary, the first three games in the series are coming to Nintendo Switch in one collection! The first Game Boy RPG to sell over a million units and the memorable first installment of the series: THE FINAL FANTASY LEGEND. A title that gained popularity through its refined gameplay system and the journey through a diverse world: FINAL FANTASY LEGEND II. A unique story that travelled across time that featured a new and an innovative character leveling system.: FINAL FANTASY LEGEND III. Experience the origins of the SaGa series with the COLLECTION OF SaGa FINAL FANTASY LEGEND, the first complete port of these hugely popular titles.The collection includes new enhancements like high-speed mode as well as features unique to the Nintendo Switch, such as adjustable screen magnification and game screen background customization. Featuring compatibility with, of course, handheld mode, but also with TV mode and tabletop mode. Furthermore, this game also revives the nostalgia of playing the original by enabling vertical usage of the console after removing the Joy-Cons. Take your collection on the go with handheld mode, share your journey with your Nintendo Switch in TV mode, or remove the Joy-Cons and turn your Nintendo Switch vertically for a retro Game Boy experience.… Expand"}, {"name": "Poker Night at the Inventory", "details_link": "https://www.metacritic.com/game/pc/poker-night-at-the-inventory", "publisher": "Telltale Games", "release_date": "Nov 22 2010", "developers": ["Telltale Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/51134416158b2523e240a4521dbb40d1-98.jpg", "descriptions": "Poker Night at the Inventory features the stars of Sam and Max, Team Fortress, Penny Arcade, and more during their off hours."}, {"name": "Mario Party 6", "details_link": "https://www.metacritic.com/game/gamecube/mario-party-6", "publisher": "Nintendo", "release_date": "Dec  6 2004", "developers": ["Hudson Soft"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Party"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/c972532077bd1ba1658f48c0b9b3a108-98.jpg", "descriptions": "Mario Party 6 offers a new batch of games that require both your fingers and your voice. In this installment in the Mario Party series, you can use the included microphone controller to talk your way to victory. More than 80 minigames are included. You can play as Mario, Bowser, or otherMario Party 6 offers a new batch of games that require both your fingers and your voice. In this installment in the Mario Party series, you can use the included microphone controller to talk your way to victory. More than 80 minigames are included. You can play as Mario, Bowser, or other characters from the Mushroom Kingdom. New characters appear on the board depending on what time of day it is. The game supports up to four players.… Expand"}, {"name": "ANNO: Mutationem", "details_link": "https://www.metacritic.com/game/playstation-5/anno-mutationem", "publisher": "Shenzhen Leiting Information Technology Co., Ltd.", "release_date": "Mar 17 2022", "developers": ["Shenzhen Leiting Information Technology Co.", "Ltd."], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/de021426714dad05f3ff7eab06185185-98.jpg", "descriptions": "Welcome to the neon-covered, 2D-meets-3D Cyberpunk world of ANNO: Mutationem. In this Action-Adventure game with RPG elements, you become Ann: a highly-skilled combat-trained lone wolf on a personal mission in a giant Metropolis, full of sinister mega-corporations, mysterious fringe groupsWelcome to the neon-covered, 2D-meets-3D Cyberpunk world of ANNO: Mutationem. In this Action-Adventure game with RPG elements, you become Ann: a highly-skilled combat-trained lone wolf on a personal mission in a giant Metropolis, full of sinister mega-corporations, mysterious fringe groups and creatures more bizarre than words can express. Where 2D meets 3D\rUnique 2D-to-3D gameplay, seamless switching between 2D Action n' Platforming and 3D Exploration to interact with the world and its inhabitants.\r Ann kicks Ass\rExploring diverse locations such as huge cities & complex underground structures, players are free to go as they please, returning to previous areas and unlock new events.\r Explore, Discover & Return\rExploring diverse locations such as huge cities & complex underground structures, players are free to go as they please, returning to previous areas and unlock new events.\r A dark, twisted plot\rA grand story befitting a rich and dark cyberpunk décor, featuring our main hero Ann and her trusty hacker side-kick Ayane.\r Craft, Upgrade, Improve, Customize\rCollect, buy or craft items & upgrade Ann's stats, skills and gear. Use chips to modify any kind of weapon you find.… Expand"}, {"name": "Out of Line", "details_link": "https://www.metacritic.com/game/switch/out-of-line", "publisher": "Hatinh Interactive", "release_date": "Aug 18 2021", "developers": ["Nerd Monkeys"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/f2f90badf8959c1a8a51661ec2e973a3-98.jpg", "descriptions": "Out of Line wasdesigned with a stylized approach. The mechanics of the game revolve around San’s spear, something the character sees as a tool that will help him navigate this strange world. We want players to learn through experimentation, constantly tinkering with puzzles until they find aOut of Line wasdesigned with a stylized approach. The mechanics of the game revolve around San’s spear, something the character sees as a tool that will help him navigate this strange world. We want players to learn through experimentation, constantly tinkering with puzzles until they find a logical solution. This design philosophy plays a thematic role in our game, as most individuals find their purpose through trial and error.… Expand"}, {"name": "Cathedral", "details_link": "https://www.metacritic.com/game/switch/cathedral", "publisher": "Decemberborn Interactive", "release_date": "Feb 18 2021", "developers": ["Decemberborn Interactive"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/292c095623cfb96e6bbcb32a71c0b38f-98.jpg", "descriptions": "Explore a vast world. Wake up in a world with no recollection of how you got there. A world full of secrets, hidden rooms, dungeons and towns. Make your way through more than 600 rooms, and unravel the secrets of your past. From the sunny beaches of Brightwind in the south, to the coldExplore a vast world. Wake up in a world with no recollection of how you got there. A world full of secrets, hidden rooms, dungeons and towns. Make your way through more than 600 rooms, and unravel the secrets of your past. From the sunny beaches of Brightwind in the south, to the cold regions of Icepeak Mountain to the north, the map will always be your friend. Find map fragments along the way, and use the map to see which parts of the world you haven't visited yet, where you are supposed to go and which parts you missed the first time around. Use the elemental orbs to find the answers to who you are. The orbs, placed in ancient times by the demi-god known only as Ardur, is protected by five fearsome guardians. Meet these challenging bosses head-on in combat, and see if you can best them!… Expand"}, {"name": "Zone of the Enders: The 2nd Runner MARS", "details_link": "https://www.metacritic.com/game/playstation-4/zone-of-the-enders-the-2nd-runner-mars", "publisher": "Konami", "release_date": "Sep  4 2018", "developers": ["Cygames"], "platforms": ["PC", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/c834a18eaab5c405e95a605f80c6ad67-98.jpg", "descriptions": "JEHUTY lives. And there, ANUBIS thrives. Zone of the Enders: The 2nd Runner returns with 4K and VR support on Steam.Relive the experience Zone of the Enders: The 2nd Runner MARS as a full-length remaster of the classic fast-paced 3D robot action game, recreated in VR, native 4K and in fullJEHUTY lives. And there, ANUBIS thrives. Zone of the Enders: The 2nd Runner returns with 4K and VR support on Steam.Relive the experience Zone of the Enders: The 2nd Runner MARS as a full-length remaster of the classic fast-paced 3D robot action game, recreated in VR, native 4K and in full surround sound. Enter JEHUTY's cockpit and fly through Martian skies!The year is 2174 and the despotic BAHRAM military organisation is using new Orbital Frames robot technology to secure its grip on Mars and Earth. Seizing control of the JEHUTY Orbital Frame, the player is the last hope for the stricken planets. Strike deep at the heart of the BAHRAM army with unrivalled powers! Written and directed by Shuyo Murata, The 2nd Runner MARS is recognised as a masterpiece among space action titles.… Expand"}, {"name": "Arktika.1", "details_link": "https://www.metacritic.com/game/pc/arktika1", "publisher": "4A Games", "release_date": "Oct 10 2017", "developers": ["4A Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 71, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/8052d4970613043d7c13d11cb271d5aa-98.jpg", "descriptions": "ARKTIKA.1 is a highly immersive, action-packed, first-person shooter designed exclusively for Oculus Touch. Nearly a century in the future, the world has fallen into a new ice age in the aftermath of a silent apocalypse. Only the equatorial regions remain habitable, yet pockets of humanityARKTIKA.1 is a highly immersive, action-packed, first-person shooter designed exclusively for Oculus Touch. Nearly a century in the future, the world has fallen into a new ice age in the aftermath of a silent apocalypse. Only the equatorial regions remain habitable, yet pockets of humanity survive in small numbers all over the planet, hanging onto existence in the resource-rich territories to the north and south--resources that everyone wants to control... Protect the colony in the wastelands of old Russia from raiders, marauders, and horrifying creatures. Be the savior. … Expand"}, {"name": "J.U.L.I.A.: Among the Stars", "details_link": "https://www.metacritic.com/game/pc/julia-among-the-stars", "publisher": "Cardboard Box Entertainment", "release_date": "Sep 12 2014", "developers": ["Cardboard Box Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "General", "Point-and-Click"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/2352246461085bf549e651094f71cc38-98.jpg", "descriptions": "The story focuses on Rachel Manners, a 35 year old astrobiologist. She is a member of an select group of scientists, chosen to embark on one of the most critical missions ever conceived on Earth. Now Rachel is alone, orbiting an unknown planet. Her only companions are J.U.L.I.A., the spaceThe story focuses on Rachel Manners, a 35 year old astrobiologist. She is a member of an select group of scientists, chosen to embark on one of the most critical missions ever conceived on Earth. Now Rachel is alone, orbiting an unknown planet. Her only companions are J.U.L.I.A., the space probe’s artificial intelligence and Mobot, a huge reconnaissance robot. Together, this unlikely trio will explore the mysteries of this solar system. But are they prepared for what they will find?… Expand"}, {"name": "DmC: Devil May Cry - Vergil's Downfall", "details_link": "https://www.metacritic.com/game/playstation-3/dmc-devil-may-cry---vergils-downfall", "publisher": "Capcom", "release_date": "Mar  5 2013", "developers": ["Ninja Theory"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/58f72e19867dd8e330b6e84a86c11a7a-98.jpg", "descriptions": "Vergil's Downfall is downloadable content for DmC: Devil May Cry that shows players what happens to Vergil after the events of the main game."}, {"name": "Europa Universalis III: Divine Wind", "details_link": "https://www.metacritic.com/game/pc/europa-universalis-iii-divine-wind", "publisher": "Paradox Interactive", "release_date": "Dec 14 2010", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "General", "General"], "meta_score": 71, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/a8e6f3bbde96bbc9d8978d17d321323c-98.jpg", "descriptions": "The fourth expansion to the classic historical strategy epic, Europa Universalis III Divine Wind is set in the Far East and will enhance every aspect of the original game to create an even deeper and more rewarding experience. Requiring Europa Universalis III Complete as well as the Heir toThe fourth expansion to the classic historical strategy epic, Europa Universalis III Divine Wind is set in the Far East and will enhance every aspect of the original game to create an even deeper and more rewarding experience. Requiring Europa Universalis III Complete as well as the Heir to the Throne expansion to play, Divine Wind introduces a new graphical style, a more detailed map, and a wealth of new oriental provinces to control.… Expand"}, {"name": "Jolly Rover", "details_link": "https://www.metacritic.com/game/pc/jolly-rover", "publisher": "Brawsome", "release_date": "Jun  7 2010", "developers": ["Brawsome"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/fe5a70ee70845b8f9a64a6f1e40ed558-98.jpg", "descriptions": "It be the golden age of pirates! Dogs of the sea! Quite literally. Our swashbuckling sausage-dog star is Gaius James Rover, son of the famous clown Jolly Rover, who died from a blow to the groin from an improperly loaded joke cannon. Following the tragically comedic death of his father,It be the golden age of pirates! Dogs of the sea! Quite literally. Our swashbuckling sausage-dog star is Gaius James Rover, son of the famous clown Jolly Rover, who died from a blow to the groin from an improperly loaded joke cannon. Following the tragically comedic death of his father, young Gaius, who insists on using his middle name James, goes to live with his uncle, a wealthy plantation owner on a small Caribbean island. While practising a particularly tricky juggling move, he accidentally taints a barrel of rum with tobacco, creating a potent and addictive brew which he coins ‘Jolly Rover’, one of the most prized substances in the Caribbean. [Brawsome]… Expand"}, {"name": "Mutropolis", "details_link": "https://www.metacritic.com/game/pc/mutropolis", "publisher": "Pirita Studio", "release_date": "Feb 18 2021", "developers": ["Pirita Studio"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/928f149c76d088df5e7643a69c0e69a0-98.jpg", "descriptions": "MUTROPOLIS is a lovely sci-fi adventure set on the abandoned Planet Earth. Play as Henry Dijon (hero, nerd, detective) in search of a legendary lost city. Uncover weird ancient artifacts. And PLEASE don’t get obliterated by an ageless evil. You’ve been warned."}, {"name": "Alwa's Awakening", "details_link": "https://www.metacritic.com/game/pc/alwas-awakening", "publisher": "Elden Pixels", "release_date": "Feb  2 2017", "developers": ["Elden Pixels"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/6371487a6be582cab0b7791b9ab134ab-98.jpg", "descriptions": "Use your magic staff and progress through a large interconnected world where you'll solve puzzles, fight enemies and defeat bosses in order to help free the land of Alwa. Explore and uncover the secrets by using your platforming skills in this challenging and charming 8-bit adventure game."}, {"name": "Choplifter HD", "details_link": "https://www.metacritic.com/game/playstation-3/choplifter-hd", "publisher": "InXile Entertainment", "release_date": "Jan 10 2012", "developers": ["InXile Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 71, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/7/e2db11c7b56bdcc2bd041d80c970f944-98.jpg", "descriptions": "In Choplifter HD, players take on the role of an up and coming rescue pilot asked to join the elite, international helicopter rescue team C.H.O.P.R. (Coordinated Helicopter Operations, Preservation and Rescue).  Pilots will be trained to command a variety of helicopters deployed on more thanIn Choplifter HD, players take on the role of an up and coming rescue pilot asked to join the elite, international helicopter rescue team C.H.O.P.R. (Coordinated Helicopter Operations, Preservation and Rescue).  Pilots will be trained to command a variety of helicopters deployed on more than 20 different missions ranging from captured military prisoner extraction to saving survivors of viral outbreaks. Pilots must bank, hover and touch-down in perilous conditions in order to make their rescue and complete their mission.… Expand"}, {"name": "Soldner-X 2: Final Prototype", "details_link": "https://www.metacritic.com/game/playstation-vita/soldner-x-2-final-prototype", "publisher": "EastAsiaSoft", "release_date": "Mar 17 2015", "developers": ["SideQuest Studios"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Action", "Shooter", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/2c6e476d962dae509c391b47365e3fc1-98.jpg", "descriptions": "In Soldner-X 2: Final Prototype, you will return to Gota IV as part of the Soldner-X defense force. Mankind will once more rely on your battle against new mysterious powers. Staged across seven unique action-loaded levels accompanied with an adrenaline pumping soundtrack, Soldner-X 2: FinalIn Soldner-X 2: Final Prototype, you will return to Gota IV as part of the Soldner-X defense force. Mankind will once more rely on your battle against new mysterious powers. Staged across seven unique action-loaded levels accompanied with an adrenaline pumping soundtrack, Soldner-X 2: Final Prototype combines traditional 2D gameplay with detailed high definition graphics and a taste of fresh innovations.… Expand"}, {"name": "The Fancy Pants Adventures", "details_link": "https://www.metacritic.com/game/playstation-3/the-fancy-pants-adventures", "publisher": "Electronic Arts", "release_date": "Apr 19 2011", "developers": ["Over the Top Games", "EA 2D"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Shooter", "Scrolling", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/f3f50ec76110ac881efa58de3c2385e6-98.jpg", "descriptions": "The Fancy Pants Adventures casts players in the role of the game’s hero – a hand-drawn stick figure named Fancy Pants Man who embarks on a mission to rescue his kidnapped sister, Cutie Pants. Sporting his trademark orange pants, Fancy Pants Man begins his journey in Squiggleville, racingThe Fancy Pants Adventures casts players in the role of the game’s hero – a hand-drawn stick figure named Fancy Pants Man who embarks on a mission to rescue his kidnapped sister, Cutie Pants. Sporting his trademark orange pants, Fancy Pants Man begins his journey in Squiggleville, racing through more than 20 unique open levels filled with challenges and bonus rooms where he must defeat comical enemies and overcome clever obstacles. Along the way, gamers can unlock over 140 unique customizations including 40 weapons to help Fancy Pants Man in his quest to defeat the Pirates. … Expand"}, {"name": "Tales of Xillia 2", "details_link": "https://www.metacritic.com/game/playstation-3/tales-of-xillia-2", "publisher": "Bandai Namco Games", "release_date": "Aug 19 2014", "developers": ["Bandai Namco Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/49a6ab14ac8aa563aa0af45807bf6a2b-98.jpg", "descriptions": "TALES OF XILLIA 2 focuses on the events a year after the climactic end of TALES OF XILLIA.  Players assume the role of Ludger Kresnik, a young man with a zest for cooking who lives with his older brother and cat, Rollo.  On his way to his first day at work for a local cafeteria he runs intoTALES OF XILLIA 2 focuses on the events a year after the climactic end of TALES OF XILLIA.  Players assume the role of Ludger Kresnik, a young man with a zest for cooking who lives with his older brother and cat, Rollo.  On his way to his first day at work for a local cafeteria he runs into a young girl named Elle Marta and the two soon become involved in an accident that will change both of their lives forever.… Expand"}, {"name": "March of the Eagles", "details_link": "https://www.metacritic.com/game/pc/march-of-the-eagles", "publisher": "Paradox Interactive", "release_date": "Feb 18 2013", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "General"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/3db1d0f3e35a1c935aefa76d2adefc0a-98.jpg", "descriptions": "The wargame March of the Eagles is dedicated to the era 1805-1815 focused on the dramatic conflicts of Europe. March of the Eagles explores one of the defining periods in European history in an experience crafted by Paradox Development Studio, the masters of Grand Strategy and makers ofThe wargame March of the Eagles is dedicated to the era 1805-1815 focused on the dramatic conflicts of Europe. March of the Eagles explores one of the defining periods in European history in an experience crafted by Paradox Development Studio, the masters of Grand Strategy and makers of Hearts of Iron and Europa Universalis. The Napoleonic War is brought to life in this war-focused strategy game.… Expand"}, {"name": "UFO: Afterlight", "details_link": "https://www.metacritic.com/game/pc/ufo-afterlight", "publisher": "TopWare Interactive", "release_date": "May  4 2007", "developers": ["Altar Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/a1095f4a11f6918008eee9b78e9b2d00-98.jpg", "descriptions": "UFO: Afterlight is the next instalment in the \"UFO: Aftermath\" and \"UFO: Aftershock\" series, bringing a completely new insight to the story of Aftershock, this time from the perspective of lonely human inhabitants on Mars; combination of global strategy and tactical missions; completely newUFO: Afterlight is the next instalment in the \"UFO: Aftermath\" and \"UFO: Aftershock\" series, bringing a completely new insight to the story of Aftershock, this time from the perspective of lonely human inhabitants on Mars; combination of global strategy and tactical missions; completely new story built on the events from UFO: Aftershock; large number of new technologies, weapons and equipment to develop; completely new environments on a different planet than Earth; highly replayable game because of the player’s key decisions on diplomacy and research; strong RPG elements, the player knows his team by names. Strategy: new enemies and new alien races with variable weapons and battle tactics; several character classes with different attributes, skills and trainings; diplomacy has strong influence on the game story; research enables terraforming of the planet in later stages of the game; improved and transparent construction and building management; friendly interface and easy orientation in the game, useful information available at time and place where needed. Tactics: advanced tactical part of the game with the possibility to enter buildings, thermo visions and more; player may use different height and destructible elements of environment to his advantage; tactical missions controlled by intelligent scripts guarantee reasonable behavior of enemies; authentic physical model; player must adapt his tactics during the game as the enemies change and grow stronger, hardly two missions are the same; aliens and robots in your team; hostile environment requiring the use of different types of spacesuits; opportunity to mind-control your enemies and use psionic abilities. [Cenega Publishing]… Expand"}, {"name": "Maneater", "details_link": "https://www.metacritic.com/game/xbox-one/maneater", "publisher": "Deep Silver", "release_date": "May 22 2020", "developers": ["Tripwire Interactive", "Blindside Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/7ea8f195dbd77fd3c1da1712bbc45220-98.jpg", "descriptions": "Maneater breaks new ground in the popular action RPG genre and finds players taking on the role of a deadly shark with the uncanny ability to evolve as it feeds. Eat, Explore and Evolve in an Open World Action RPG. Play through a full narrative, story-based campaign narrated by ChrisManeater breaks new ground in the popular action RPG genre and finds players taking on the role of a deadly shark with the uncanny ability to evolve as it feeds. Eat, Explore and Evolve in an Open World Action RPG. Play through a full narrative, story-based campaign narrated by Chris Parnell. (Saturday Night Live, 30 Rock, Rick, and Morty)\r  Feed on humans, consume nutrients and find rare shark loot to evolve past what nature intended.\r  Explore 7 large regions including bayous of the gulf coast, resort beaches, industrial docks, the open ocean and more. Experience a living world with a full Day/Night cycle.\r  Unlock and equip various Evolutions that improve and enhance your shark as you progress through the campaign.\r  Hunter Parties and Bounty System - the humans fight back! The Battle against various types of hunters ranging from small skiffs all the way up to the coast guard.\r … Expand"}, {"name": "WWE '12", "details_link": "https://www.metacritic.com/game/xbox-360/wwe-12", "publisher": "THQ", "release_date": "Nov 22 2011", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 71, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/e00401ed055b9c2a92948e18a79b0a21-98.jpg", "descriptions": "WWE '12 is the next iteration in this wrestling series with Smackdown vs Raw being no more."}, {"name": "The Forest Quartet", "details_link": "https://www.metacritic.com/game/playstation-5/the-forest-quartet", "publisher": "Bedtime Digital Games", "release_date": "Dec  8 2022", "developers": ["Mads & Friends"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/67b2a94d788d64f47a4412fbad8c5fdb-98.jpg", "descriptions": "The Forest Quartet is a 3D narrative puzzler about a gone, but not forgotten, lead singer. Play her spirit and travel through 3 acts unique to the members of her band for a final farewell concert. Face their emotions, solve puzzles and fight the corruption plaguing their souls."}, {"name": "The Longest Road on Earth", "details_link": "https://www.metacritic.com/game/pc/the-longest-road-on-earth", "publisher": "Raw Fury", "release_date": "May 27 2021", "developers": ["Brainwash Gang"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/ab509d0e8bb4e3866a77b9f7265c4b4b-98.jpg", "descriptions": "A thoughtful and deeply personal title with stripped-down mechanics. The lack of dialogue or text allows you to create your own narrative through your time with four characters. Each short story will allow players to be swept away by the haunting lyrics of over twenty original, nostalgic songs."}, {"name": "HyperParasite", "details_link": "https://www.metacritic.com/game/switch/hyperparasite", "publisher": "HoundPicked Games", "release_date": "Apr  3 2020", "developers": ["Troglobytes Games", "S.L."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/9809d8655851cbe2fc3353defd905753-98.jpg", "descriptions": "A dystopian world presents an ambience of dislocation, menace and tough love which is set around World War III. The unseen aggressor marauding and consuming its way through the population is a parasitic organism capable of making hosts of unsuspecting human beings, consuming what’s left ofA dystopian world presents an ambience of dislocation, menace and tough love which is set around World War III. The unseen aggressor marauding and consuming its way through the population is a parasitic organism capable of making hosts of unsuspecting human beings, consuming what’s left of their souls and wreaking unfathomable havoc.… Expand"}, {"name": "StarBlox Inc.", "details_link": "https://www.metacritic.com/game/switch/starblox-inc", "publisher": "IlluminationGames", "release_date": "Oct 18 2019", "developers": ["IlluminationGames"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Stacking"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/b2c0d81ff39d8cfd5e9eabef21de40be-98.jpg", "descriptions": "Welcome to the team at StarBlox Incorporated – where sorting cargo is a contact sport. Load your rocket resource blocks quickly and efficiently to beat the competition. But watch out – the shipping world is fierce! Your opponent can sabotage your work by stealing blocks, delivering punchesWelcome to the team at StarBlox Incorporated – where sorting cargo is a contact sport. Load your rocket resource blocks quickly and efficiently to beat the competition. But watch out – the shipping world is fierce! Your opponent can sabotage your work by stealing blocks, delivering punches or throwing you in the incinerator. As you deliver cargo to the far corners of the solar system, each of the planets, moons and asteroids you visit will present new challenges – from black holes to gravity to waves of lava. Please try not to die - it tarnishes our safety track record. StarBlox Inc. is a unique mash up of a puzzler and a brawler made in partnership with Ingenium – Canada’s Museums of Science and Innovation. Crafted by experts for scientific accuracy, the stunning planetary backdrops will make you feel like you’re really there.… Expand"}, {"name": "One Night Stand", "details_link": "https://www.metacritic.com/game/switch/one-night-stand", "publisher": "Ratalaika Games", "release_date": "Oct  4 2019", "developers": ["Kinmoku", "Poppy Works"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/01228c6ff3b9129356f6a33666f50771-98.jpg", "descriptions": "After a night of fun, passion, and one too many drinks, you wake up the next morning to find a complete stranger lying naked beside you in bed. What do you do?In One Night Stand, explore the unknown bedroom and seek out clues to identify who the stranger is and what happened to bring youAfter a night of fun, passion, and one too many drinks, you wake up the next morning to find a complete stranger lying naked beside you in bed. What do you do?In One Night Stand, explore the unknown bedroom and seek out clues to identify who the stranger is and what happened to bring you both together.You may resort to some unusual methods to find the answers you're looking for, but take care not to prod and pry too much a nosy guest quickly becomes an unwanted one!Will you stay and explore your relationship with this stranger, or will you escape when the opportunity presents itself? With 12 unique endings to discover, can you keep up the act long enough to find out what really happened?… Expand"}, {"name": "Xeodrifter", "details_link": "https://www.metacritic.com/game/switch/xeodrifter", "publisher": "Atooi LLC", "release_date": "Feb 15 2018", "developers": ["Atooi LLC"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/8212118bea2a943db3fccba3aead45e3-98.jpg", "descriptions": "Drifting through the stars. Xeodrifter is the story of an interstellar drifter traveling the stars on a simple mission of exploration. We join our nomad as he embarks on the investigation of a small cluster of four planets in the omega sector, after a collision with a rogue asteroid damagedDrifting through the stars. Xeodrifter is the story of an interstellar drifter traveling the stars on a simple mission of exploration. We join our nomad as he embarks on the investigation of a small cluster of four planets in the omega sector, after a collision with a rogue asteroid damaged his warp core. Blast your way through alien landscapes, seek out valuable secrets, and defeat ancient guardians to unlock powers from a legendary supreme culture in this exciting journey of mystery and adventure.… Expand"}, {"name": "Aces of the Luftwaffe: Squadron", "details_link": "https://www.metacritic.com/game/switch/aces-of-the-luftwaffe-squadron", "publisher": "HandyGames", "release_date": "Nov 17 2017", "developers": ["HandyGames"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down", "Vertical"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/2fc5a2552ae395ccde0036db88929db1-98.jpg", "descriptions": "Avoid a swarm of bullets and face fearsome war machines in air battles and boss fights. Aces of the Luftwaffe: Squadron is a vertically scrolling shoot ‘em up with a fully-voiced narrative. Upgrade each member of your squadron with their personal skill tree and take on the Aces with up toAvoid a swarm of bullets and face fearsome war machines in air battles and boss fights. Aces of the Luftwaffe: Squadron is a vertically scrolling shoot ‘em up with a fully-voiced narrative. Upgrade each member of your squadron with their personal skill tree and take on the Aces with up to three friends in epic 4-player local co-op battles.… Expand"}, {"name": "Megadimension Neptunia VII", "details_link": "https://www.metacritic.com/game/playstation-4/megadimension-neptunia-vii", "publisher": "Idea Factory", "release_date": "Feb  2 2016", "developers": ["Idea Factory", "Compile Heart"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/b00eba41b126f6642a1a7ad5f4f930e6-98.jpg", "descriptions": "The first PS4 game in the Hyperdimension Neptunia series, this installment features new characters, three worlds to save, three new stories to play, a new powerful transformation mode, extra features to the battle system, and a new dungeon minigame. Enjoy original Japanese and EnglishThe first PS4 game in the Hyperdimension Neptunia series, this installment features new characters, three worlds to save, three new stories to play, a new powerful transformation mode, extra features to the battle system, and a new dungeon minigame. Enjoy original Japanese and English voiceovers, plus English subtitles, and experience free-roaming turn-based battles as you obtain all of the items you and your new allies need to save Gamindustri.… Expand"}, {"name": "Disney Infinity 2.0 Edition", "details_link": "https://www.metacritic.com/game/playstation-4/disney-infinity-20-edition", "publisher": "Disney Interactive Studios", "release_date": "Sep 23 2014", "developers": ["Avalanche Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General", "Fantasy"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/9/72528184e3528a43b580574bba47db36-98.jpg", "descriptions": "The starter pack includes: one Disney Infinity: Marvel Super Heroes 2.0 Edition Game, 3 Marvel Super Heroes Figures: Iron Man, Thor and Black Widow, one Disney Infinity Base (2.0 Edition), two Toy Box Game Discs, one Marvel's The Avengers Play Set piece, and one Web Code Card."}, {"name": "One Piece: Pirate Warriors 2", "details_link": "https://www.metacritic.com/game/playstation-3/one-piece-pirate-warriors-2", "publisher": "Namco Bandai Games", "release_date": "Sep  3 2013", "developers": ["Omega Force"], "platforms": "PlayStation 3", "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/f8309f7a66e818cf41c06c3de127d625-98.jpg", "descriptions": "Players  set off on grand adventures with characters such as Luffy, Sanji, Zoro and the rest of the Straw Hat crew to explore and conquer island after island while traveling through the New World. With playable characters from the original title along with never before seen charactersPlayers  set off on grand adventures with characters such as Luffy, Sanji, Zoro and the rest of the Straw Hat crew to explore and conquer island after island while traveling through the New World. With playable characters from the original title along with never before seen characters joining the battle, fans can enjoy seeing whole line-ups of their favorite ONE PIECE characters springing to action, including Eneru for the first time ever on PS3.… Expand"}, {"name": "My Word Coach", "details_link": "https://www.metacritic.com/game/ds/my-word-coach", "publisher": "Ubisoft", "release_date": "Oct 16 2007", "developers": ["Ubisoft"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Edutainment", "Edutainment"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/ecd865a7015d5355f6878f22eb37a3d8-98.jpg", "descriptions": "Do you ever feel at \"loss for words\"? Would you like to express yourself more clearly and with confidence? Want to improve your vocabulary in a straightforward and entertaining way? In your daily life, knowing the right word can make all the difference! My Word Coach offers a fun andDo you ever feel at \"loss for words\"? Would you like to express yourself more clearly and with confidence? Want to improve your vocabulary in a straightforward and entertaining way? In your daily life, knowing the right word can make all the difference! My Word Coach offers a fun and challenging way to improve verbal skills through a series of engaging activities and exercises. The game was inspired by ongoing vocabulary acquisition research by Thomas Cobb, University Professor in Applied Linguistics at the University of Quebec. Enjoyable activities include word recognition, spelling challenges, and vocabulary definition, including 16,800 words from the Cambridge Advanced Learner's Dictionary. When you play, My Word Coach assesses, monitors, and rewards your Expression Potential, a score that represents your ability to command and use the English language. The higher the number (out of a possible 100%), the better you are able to express yourself! While the Wii version takes advantage of the Wii Remote through lively mini-games and easy-to-use controls, the Nintendo DS version makes full use of the system’s unique, dual Touch Screen. [Ubisoft]… Expand"}, {"name": "The Bard's Tale IV: Barrows Deep", "details_link": "https://www.metacritic.com/game/pc/the-bards-tale-iv-barrows-deep", "publisher": "InXile Entertainment", "release_date": "Sep 18 2018", "developers": ["InXile Entertainment"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/ac25341aad9067b0e153a3ff1bdefe82-98.jpg", "descriptions": "The Bard's Tale IV returns to the classic fantasy RPGs of years past. Featuring dynamic turn-based combat, a full party of characters to build and customize, and first-person exploration of maze-like dungeons with devious puzzles and riddles, The Bard's Tale IV is a true successor to theThe Bard's Tale IV returns to the classic fantasy RPGs of years past. Featuring dynamic turn-based combat, a full party of characters to build and customize, and first-person exploration of maze-like dungeons with devious puzzles and riddles, The Bard's Tale IV is a true successor to the original Bard's Tale trilogy, and is crowdfunded by thousands of fans. Help us bring back the dungeon crawl and return to Skara Brae - the city that started it all.\r * A single-player, party-based role-playing game, rich in exploration, combat and challenging puzzles.\r* Dynamic phase-based combat, where the pace of battle is animated and fluid, but still gives you time to think and respond to your enemies.\r* A game set to beautiful Gaelic music from Julie Fowlis (multi-award winning Gaelic singer) and Mark Morgan (Wasteland 2, Torment: Tides of Numenera), where the Bard's songs and melodies affect gameplay.\r* Compelling story and narrative by acclaimed novel and game writer Nathan Long (Wasteland 2, Torment: Tides of Numenera).\r* Built using Unreal Engine 4, taking advantage of the latest graphics technologies to create a lush and vibrant world with great interactivity and detail.\r* Branching quests and a world that reacts to your decisions and party make-up.\rRecruitable companion NPC characters, bring personality, and maybe trouble, to your party.\r* Unlock another layer of secrets as you examine and physically manipulate your magic items and the environment.\r* Brought to you by the team behind Wasteland 2 and Torment: Tides of Numenera.\rAvailable DRM-free for Windows, Mac and Linux.… Expand"}, {"name": "DOOM VFR", "details_link": "https://www.metacritic.com/game/playstation-4/doom-vfr", "publisher": "Bethesda Softworks", "release_date": "Dec  1 2017", "developers": ["id Software"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/92cb2adb144808ee66d5154bcf9314e2-98.jpg", "descriptions": "Available for PlayStation VR and VIVE platforms, this DOOM adventure will bathe you in virtual carnage. Developed by id Software, the studio that pioneered the first-person shooter genre and modern VR, DOOM VFR brings the fast-paced, brutal gameplay fans of the series love to virtualAvailable for PlayStation VR and VIVE platforms, this DOOM adventure will bathe you in virtual carnage. Developed by id Software, the studio that pioneered the first-person shooter genre and modern VR, DOOM VFR brings the fast-paced, brutal gameplay fans of the series love to virtual reality. Immerse yourself in the UAC facility on Mars and the depths of Hell, as your skills are put to the test through intense combat and challenging puzzle-solving. Play as a cybernetic survivor who is activated by the UAC to fight the demon invasion, maintain order, and prevent catastrophic failure at the Mars facility. Lay waste to an army of demonic foes as you explore and interact with the outlandish world of DOOM from an entirely new perspective.… Expand"}, {"name": "Battleborn", "details_link": "https://www.metacritic.com/game/xbox-one/battleborn", "publisher": "2K Games", "release_date": "May  3 2016", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/9c8d5c6cf03b0017d16e77051ed0299b-98.jpg", "descriptions": "Battleborn is a next-gen hero-shooter brought to you by the creators of the award-winning and best-selling Borderlands franchise. In Battleborn’s distant future, the only hope for the last star in a dying universe is a new breed of warriors, who must put aside their differences to drive backBattleborn is a next-gen hero-shooter brought to you by the creators of the award-winning and best-selling Borderlands franchise. In Battleborn’s distant future, the only hope for the last star in a dying universe is a new breed of warriors, who must put aside their differences to drive back an unstoppable menace. Choose from a myriad of powerful heroes and fight together alongside your friends in an intense co-operative campaign, or battle against them in fast-paced competitive multiplayer matches.… Expand"}, {"name": "Story of Seasons: Pioneers of Olive Town", "details_link": "https://www.metacritic.com/game/switch/story-of-seasons-pioneers-of-olive-town", "publisher": "XSEED Games", "release_date": "Mar 23 2021", "developers": ["Three Rings", "Marvelous Inc."], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/4e8ee1e2500a0ea2cdc78381b856ee3b-98.jpg", "descriptions": "Inspired by tales of their grandfather's pioneering days, the protagonist decides to pack their bags and leave the hustle and bustle of big city life for the frontier in Olive Town. \r\rWhen they arrive, they run into Victor, the town's mayor and their grandfather's old friend. He bringsInspired by tales of their grandfather's pioneering days, the protagonist decides to pack their bags and leave the hustle and bustle of big city life for the frontier in Olive Town. \r\rWhen they arrive, they run into Victor, the town's mayor and their grandfather's old friend. He brings them to the old farm, which has been reclaimed by nature over the years. Determined to breathe life back into their grandfather's dream and follow in his footsteps, the protagonist rolls up their sleeves and gets to work. \r\rOlive Townwhich is just a stone's throw away from the farmis a port town built on the tip of a peninsula. It might be a quiet little town, but it is home to a whole host of unique characters. And while the townsfolk get by well enough in this picturesque seaside locale, a little more tourism never hurt anyone... \r\rThe long-awaited brand new entry in the original farm/life simulation franchise, known in Japan as Bokujo Monogatari, makes its debut on Nintendo Switch, bringing players more freedom than ever before to shape an untamed wilderness and customize their farm down to the very tile. A new cast of marriage candidates, a town that grows and thrives along with your farm, and a request system highlight the new features, all while retaining the core elements of the STORY OF SEASONS series. Finding Earth Sprites while exploring your farmland may lead you to mysterious, fantastical lands such as gardens where the seasons never change, an island in the sky, or even the inside of a volcano! \r\rKEY FEATURES\r -Cultivate Your Farm, Cultivate Your Town\rTame the wilderness of the peninsula and build your farm from the ground up! Gather and process materials to fulfill requests and improve Olive Town's infrastructure, upgrade tools, or commission new outfits and accessories.\r -Simple Mechanics, Deep Gameplay\rGreenhorn farmers can rest easy with the return of Seedling Mode and Normal Mode. Veteran players ready to create a bustling farm of their own will find familiar features and facilities with new twists on classic gameplay elements. \r\r-A Farm of Endless Possibilities\rClear the land, repair old facilities, and place new ones wherever you see fit. Level up your farming skills and craft a variety of decorations and facilities, from fences and automatic feeders for livestock to sprinklers for crops!\r -There's Always Something Going on in Olive Town!\rParticipate in local festivals as the town comes to life with over 200 unique events! Get to know your neighbors better and you may even find love with a special someone among them.… Expand"}, {"name": "Graffiti Kingdom", "details_link": "https://www.metacritic.com/game/playstation-2/graffiti-kingdom", "publisher": "Hot-B", "release_date": "Jul 28 2005", "developers": ["Taito Corporation"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/4cffa5b59e40071ac58b7c83dec693e8-98.jpg", "descriptions": "(Also known as \"Magic Pengel 2\")  Players take on the role of Prince Pixel, who is on a quest to save his parents and restore Canvas Kingdom back to its normal form after an ancient evil transformed it into a labyrinth full of danger. On his quest, the heroic young Prince finds a companion,(Also known as \"Magic Pengel 2\")  Players take on the role of Prince Pixel, who is on a quest to save his parents and restore Canvas Kingdom back to its normal form after an ancient evil transformed it into a labyrinth full of danger. On his quest, the heroic young Prince finds a companion, 'Box Dog', who aids and accompanies him in his many quests. At the start of his adventure, Prince Pixel finds a magic wand that allows him to bring anything he draws to life. The wand also enables him to temporarily take the shape of any enemy encountered and learn their powers. Prince Pixel can become anything the player draws and transform between three additional different creatures at any given time. As Prince Pixel advances through the game, he gets stronger, tougher, and more skilled. Players also benefit from experience by acquiring more drawing tools and abilities. By the end of the game, players can literally re-create any creature that they've seen in the game with an incredibly easy-to-use drawing program. The game allows the user to draw straight lines as well, so even someone with no drawing skills whatsoever can create just about anything. Players use their imagination to battle their way through levels or creatively solve puzzles. [HOT-B]… Expand"}, {"name": "LEGO Indiana Jones 2: The Adventure Continues", "details_link": "https://www.metacritic.com/game/xbox-360/lego-indiana-jones-2-the-adventure-continues", "publisher": "LucasArts", "release_date": "Nov 17 2009", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/98351603b6336a8140083ccf467abc00-98.jpg", "descriptions": "LEGO Indiana Jones 2 presents a tongue-in-cheek take on all four cinematic adventures of pop culture’s most iconic archaeologist, including for the first time ever Indiana Jones and the Kingdom of the Crystal Skull and will give players the ability to create levels of their own! [LucasArts]"}, {"name": "The Amazing Spider-Man", "details_link": "https://www.metacritic.com/game/playstation-3/the-amazing-spider-man", "publisher": "Activision", "release_date": "Jun 26 2012", "developers": ["Beenox"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General", "Open-World"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/a4db034967586c076e7a328a0800f61d-98.jpg", "descriptions": "Take control of Spider-Man’s powers with Manhattan as your playground. Set briefly after the events of the new film, The Amazing Spider-Man injects New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge of significant threats.Take control of Spider-Man’s powers with Manhattan as your playground. Set briefly after the events of the new film, The Amazing Spider-Man injects New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge of significant threats. Players use real-time navigational and combat choices to fight crime and execute Spidey’s signature acrobatic moves in ways never seen previously. Discover the rest of Peter Parker’s untold story in the all-new epilogue story to Columbia Pictures' 2012 theatrical release. Battle all-new versions of classic Super Villains as well as original, larger than life enemies while racing to save Manhattan.… Expand"}, {"name": "Wonder Boy Collection", "details_link": "https://www.metacritic.com/game/playstation-4/wonder-boy-collection", "publisher": "ININ Games", "release_date": "Jun  3 2022", "developers": ["Bliss Brain"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/ccbc684777a871d4c7a216bb3c8bb289-98.jpg", "descriptions": "Bringing together four of the very best Wonder Boy games - from the original 1986 arcade version to 1994's Monster World IV - this remarkable collection gives you a chance to experience one of the most influential series from gaming's past. Through the 1980s and 1990s the Wonder Boy gamesBringing together four of the very best Wonder Boy games - from the original 1986 arcade version to 1994's Monster World IV - this remarkable collection gives you a chance to experience one of the most influential series from gaming's past. Through the 1980s and 1990s the Wonder Boy games built up a huge following with their dazzling blend of energetic platforming and action-RPG gameplay. Unlike other titans from the platform genre, however, the Wonder Boy games have seen very limited release in the West on modern gaming hardware. Until now! The Wonder Boy games are designed to be simple to pick-up and play for gamers of every ability - but contain enough depth and challenge to keep even the most skilled players busy. And now they're updated with modern features such as the ability to rewind your game at any moment. So whether you're looking to try this iconic gaming series for the first time, revisit a youth spent playing Wonder Boy, or add a refreshingly distinct platformer to your collection, Wonder Boy Collection is the perfect package for you!… Expand"}, {"name": "No Straight Roads", "details_link": "https://www.metacritic.com/game/switch/no-straight-roads", "publisher": "Sold Out", "release_date": "Aug 25 2020", "developers": ["Metronomik"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music", "Action Adventure", "Open-World"], "meta_score": 71, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/8cba47debcc68e973559b5541e02d361-98.jpg", "descriptions": "Exclusive Assist Mode - Partner up with an additional local player to take control of the Elliegator, a secret alligator assistant who can help players in battle by picking up items, transforming props and calling in useful bonuses.\r● 3-Player Co-Op - Played in conjunction with the game’s Exclusive Assist Mode - Partner up with an additional local player to take control of the Elliegator, a secret alligator assistant who can help players in battle by picking up items, transforming props and calling in useful bonuses.\r● 3-Player Co-Op - Played in conjunction with the game’s co-op mode, Assist Mode lets up to three local players experience No Straight Roads’ music-based action together, only on Nintendo Switch.\r● Touchscreen Support - Use the Nintendo Switch system’s touchscreen to transform props and pick up items.\r● Single Nintendo Switch Joy-ConTM Controller Play - Play through the entire game using a single Joy-Con, or pass the second Joy-Con to a friend to play in couch co-op.… Expand"}]