[{"name": "Warhammer 40,000: Kill Team", "details_link": "https://www.metacritic.com/game/xbox-360/warhammer-40000-kill-team", "publisher": "THQ", "release_date": "Jul 13 2011", "developers": ["THQ Warrington"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/d2fc93973d25ac47456cb2d356a41ce6-98.jpg", "descriptions": "In this third person arcade style shooter, players take on the role of an elite Space Marine team sent to assault a giant Ork Kroozer en-route to an Imperial Forge World. Do you have what it takes to take out the Warboss and prevent the Waaaagh?"}, {"name": "Neptunia ReVerse", "details_link": "https://www.metacritic.com/game/playstation-5/neptunia-reverse", "publisher": "Idea Factory", "release_date": "Jun  8 2021", "developers": ["Compile Heart"], "platforms": "PlayStation 5", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/c19d32c19ac2a00a92251535284e5b9d-98.jpg", "descriptions": "Neptunia ReVerse is an updated and enhanced version of the beloved RPG game Hyperdimension Neptunia Re;Birth 1 , originally released for the PlayStation Vita. Fans of the Neptunia series and newcomers can enjoy the lush worlds of Gamindustri with the help of the PS5 and new gameplayNeptunia ReVerse is an updated and enhanced version of the beloved RPG game Hyperdimension Neptunia Re;Birth 1 , originally released for the PlayStation Vita. Fans of the Neptunia series and newcomers can enjoy the lush worlds of Gamindustri with the help of the PS5 and new gameplay additions, including a fishing mini-game. Gamindustri is a distant world comprised of four nations, each under the divine protection of a Goddess. The nations are Planeptune: Land of Purple Progress, ruled by Neptune, Lastation: Land of Black Regality, ruled by Noire, Lowee: Land of White Serenity, ruled by Blanc, and Leanbox: Land of Green Pastures, ruled by Vert. Locked in the Console War, the four Goddesses vie for domination of the planet until Neptune is cast down and stripped of her power. Now Neptune must fight to restore her place, but could a being known as Arfoire threaten the very world the Goddesses have sworn to protect?\r… Expand"}, {"name": "Genesis Alpha One", "details_link": "https://www.metacritic.com/game/pc/genesis-alpha-one", "publisher": "Team17", "release_date": "Jan 29 2019", "developers": ["Radiation Blue"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/e8047d2deb3e3811d396ad8fa32d264c-98.jpg", "descriptions": "Genesis Alpha One is a revolutionary mix of roguelike shooter, base building and survival that puts you in the role of an interstellar pioneer.In a near future ravaged by wars, corrupt regimes and global capitalism left unchecked have resulted in natural resource over-exploitation andGenesis Alpha One is a revolutionary mix of roguelike shooter, base building and survival that puts you in the role of an interstellar pioneer.In a near future ravaged by wars, corrupt regimes and global capitalism left unchecked have resulted in natural resource over-exploitation and pollution; devastating the planet. Supported by Earth's remaining governments, four influential corporations initiate the Genesis program. As the Captain of a Genesis starship, you journey into uncharted space on the ultimate mission. Build and manage a space vessel, farm resources, deal with terrifying alien infestations, clone creatures and explore a vast, randomly generated universe. Your goal: Find new homes for humanity's DNA and save the species from extinction.… Expand"}, {"name": "Bus Simulator 18", "details_link": "https://www.metacritic.com/game/pc/bus-simulator-18", "publisher": "astragon", "release_date": "Jun 13 2018", "developers": ["stillalive studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Simulation", "Vehicle", "Civilian"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/fd216b42b0e20ab05c5e665f55e833ab-98.jpg", "descriptions": "Experience the job of a bus driver in a vast and freely drivable urban area. Drive original licensed city buses from the great brands: Mercedes-Benz, Setra, MAN, and IVECO BUS. Transport your passengers safely and punctually, either solo in single player mode, or in multiplayer mode."}, {"name": "Disneyland Adventures", "details_link": "https://www.metacritic.com/game/xbox-one/disneyland-adventures", "publisher": "Microsoft Game Studios", "release_date": "Oct 31 2017", "developers": ["Asobo Studio"], "platforms": ["PC", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/403cf084d2b70fe8706718a82aaf20ca-98.jpg", "descriptions": "Experience a place where two magical worlds unite: Kinect for Xbox 360 invites you to take a journey where stories come to life and dreams come true, right in your living room! Explore Disneyland park i? from Main Street U.S.A. to Critter Country i? join Peter Pan to battle Captain Hook,Experience a place where two magical worlds unite: Kinect for Xbox 360 invites you to take a journey where stories come to life and dreams come true, right in your living room! Explore Disneyland park i? from Main Street U.S.A. to Critter Country i? join Peter Pan to battle Captain Hook, high-five Mickey Mouse or hug Snow White.\r Harnessing the controller-free magic of Kinect for Xbox 360, \"Kinect: Disneyland Adventures\" allows children, families and Disney fans of all ages to explore Disneyland park, step into adventures based on attractions, engage in challenging quests and interact with beloved Disney characters using their full bodies and voices,* no controller required. \"Kinect: Disneyland Adventures\" is your portal to a magical world of Disneyland park adventures through Kinect.… Expand"}, {"name": "The Walking Dead: Michonne - A Telltale Miniseries", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-michonne---a-telltale-miniseries", "publisher": "Telltale Games", "release_date": "Apr 26 2016", "developers": ["Skybound LLC", "Skybound Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 67, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/098aa8661fd9854e99e0a33266c9dc27-98.jpg", "descriptions": "he Walking Dead: Michonne - A Telltale Miniseries stars the iconic, blade-wielding character from Robert Kirkman's best-selling comic books, portrayed in-game by award-winning actress Samira Wiley. Haunted by her past, and coping with unimaginable loss and regret, the story exploreshe Walking Dead: Michonne - A Telltale Miniseries stars the iconic, blade-wielding character from Robert Kirkman's best-selling comic books, portrayed in-game by award-winning actress Samira Wiley. Haunted by her past, and coping with unimaginable loss and regret, the story explores Michonne's absence between issues #126 and #139 of the comic book. Over the three episodes of the miniseries, players will discover what took Michonne away from Rick, Ezekiel, and the rest of her trusted group... and what brought her back.… Expand"}, {"name": "Bust-A-Move Deluxe", "details_link": "https://www.metacritic.com/game/psp/bust-a-move-deluxe", "publisher": "Majesco Games", "release_date": "Apr  4 2006", "developers": ["Taito Corporation"], "platforms": "PSP", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/5ff8bbdddb1d6936f0fe3d36be9d096d-98.jpg", "descriptions": "(Currently available in the UK/EU/JPN only; also know as \"Puzzle Bobble Pocket\" and \"Ultra Bust-A-Move Pocket\")  BAM ghost is one of the best versions of this game game for his spooky and funny environment and above all for his several game modes. You can play a funny and creative variation(Currently available in the UK/EU/JPN only; also know as \"Puzzle Bobble Pocket\" and \"Ultra Bust-A-Move Pocket\")  BAM ghost is one of the best versions of this game game for his spooky and funny environment and above all for his several game modes. You can play a funny and creative variation of the classic bust a move game, followed by your favorite characters (who forgot \"the ghost whale\" from Bubble Bobble?) or by one friend wireless. Play screen that tilts due to the \"weight\" of bubbles or \"mix‘em up\" colors in a series of stages where colours changes all of a suddenand many others. [505 GameStreet]… Expand"}, {"name": "The X-Files: Resist or Serve", "details_link": "https://www.metacritic.com/game/playstation-2/the-x-files-resist-or-serve", "publisher": "Sierra Entertainment", "release_date": "Mar 16 2004", "developers": ["Black Ops Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Adventure", "Third-Person", "Sci-Fi"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/fe8475415935052994d6e962e2d4ed04-98.jpg", "descriptions": "Uncover the Horrifying Truth. Set in the show's seventh season, the fear begins when Mulder and Scully travel to the small Rocky Mountain town of Red Falls to investigate a string of unusual murders linked to ghost sightings, the undead, and other paranormal phenomena. The agents then pursueUncover the Horrifying Truth. Set in the show's seventh season, the fear begins when Mulder and Scully travel to the small Rocky Mountain town of Red Falls to investigate a string of unusual murders linked to ghost sightings, the undead, and other paranormal phenomena. The agents then pursue an inhuman killer to a secret research facility in the Siberian wasteland and finally into the depths of a buried alien spacecraft. If they survive, they will unravel the mystery of the black oil and prevent the alien colonization of the planet...for now. The X-Files: Resist or Serve contains three horrific, interwoven episodes created by the Executive Producers of The X-Files. The game features authentic X-Files characters, music and storyline, voiceovers by David Duchovny, Gillian Andersen and the rest of the original cast, and unique DVD-style bonus material containing exclusive commentary and interviews. [Vivendi Universal]… Expand"}, {"name": "R: Racing Evolution", "details_link": "https://www.metacritic.com/game/xbox/r-racing-evolution", "publisher": "Namco", "release_date": "Dec  9 2003", "developers": ["Namco"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/fd1b155839e95fac5a687a28f6dcbbc1-98.jpg", "descriptions": "Not your ordinary racer, R: Racing Evolution features a story mode, in-game radio communications, and authentic licensed cars. R: Racing Evolution chronicles the intense competition and deep rivalries found only within the professional racing circuit. Upgrade and modify your vehicle toNot your ordinary racer, R: Racing Evolution features a story mode, in-game radio communications, and authentic licensed cars. R: Racing Evolution chronicles the intense competition and deep rivalries found only within the professional racing circuit. Upgrade and modify your vehicle to compete in five game modes, including Racing Life, Event Challenge, Time Attack, Arcade, and Versus. New features such as the Interactive Driver AI System and in-game radio communications bring players close to the racing action.… Expand"}, {"name": "NBA Jam 2004", "details_link": "https://www.metacritic.com/game/playstation-2/nba-jam-2004", "publisher": "Acclaim", "release_date": "Sep 23 2003", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 67, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/52c8f9c2a3d25cf1fc0b5b99c5adba58-98.jpg", "descriptions": "NBA JAM brings the \"rim-rocking\" highlights of NBA play to life with over the top, arcade-style 3-on-3 Basketball featuring spectacular high-flying dunks, ankle-breaking crossovers and \"get that outta here\" blocks! All the popular signature NBA JAM features are back - including over-the topNBA JAM brings the \"rim-rocking\" highlights of NBA play to life with over the top, arcade-style 3-on-3 Basketball featuring spectacular high-flying dunks, ankle-breaking crossovers and \"get that outta here\" blocks! All the popular signature NBA JAM features are back - including over-the top gameplay, \"On-Fire\" & \"Big Head\" modes, no fouls, Hotspots and surprising hidden characters. Play against over 50 of the NBA's greatest players from the past 50 years in the Legends Tournament, taking you on a journey through the NBA of the 1950s - 1990s with era-specific music, uniforms, hairstyles, commentary and motions. Over 700 new motions, including signature moves for current NBA All-Stars and Legends. Game modes include quick-play Exhibition, NBA JAM Tournament, NBA Legends Tournament & Mini Games. All-new Create-A-Player allows you to build your own master of the court. Select upgraded attributes in the JAM Store. [Acclaim]… Expand"}, {"name": "Smash Cars", "details_link": "https://www.metacritic.com/game/playstation-2/smash-cars", "publisher": "Metro3D", "release_date": "Aug 13 2003", "developers": ["Creat Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/d43e6ae137111e0e642c04367d860180-98.jpg", "descriptions": "No rules radio-controlled racing through living off-road worlds with giant objects, giant animals and giant people. Multiple shortcuts hidden on the tracks make for a more exciting racing and add more intrigue to overcoming opponents. Knocking over and hitting loose objects located on theNo rules radio-controlled racing through living off-road worlds with giant objects, giant animals and giant people. Multiple shortcuts hidden on the tracks make for a more exciting racing and add more intrigue to overcoming opponents. Knocking over and hitting loose objects located on the track allow the player to pick up bonuses.  [Creat]… Expand"}, {"name": "Tennis Masters Series 2003", "details_link": "https://www.metacritic.com/game/xbox/tennis-masters-series-2003", "publisher": "Hip Games", "release_date": "Aug  7 2003", "developers": ["Microids"], "platforms": ["PC", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/fd94273850dbf50d02ff44886fed0e32-98.jpg", "descriptions": "Are you ready to take on the world's best players in the Tennis Masters Series? Master the individual skills and styles of one of 67 different players, and then compete in multiplayer singles or doubles matches or single-player tournaments. The game reproduces nine Masters Series tournamentsAre you ready to take on the world's best players in the Tennis Masters Series? Master the individual skills and styles of one of 67 different players, and then compete in multiplayer singles or doubles matches or single-player tournaments. The game reproduces nine Masters Series tournaments from locations including Miami, Rome, and Paris. With your four different shots--power top spin, slice, flat, and lob--you can create up to 60 different moves to use during matches.… Expand"}, {"name": "Zoo Tycoon: Dinosaur Digs", "details_link": "https://www.metacritic.com/game/pc/zoo-tycoon-dinosaur-digs", "publisher": "Microsoft Game Studios", "release_date": "May 19 2002", "developers": ["Blue Fang Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/4a9ac68e5ce61392edae4bcaccb75ad5-98.jpg", "descriptions": "The fun has evolved into prehistoric pandemonium as you add dinosaurs to your zoo with the Zoo Tycoon Dinosaur Digs expansion pack! Zookeepers will be envious as you let your imagination run wild building the most vibrant and beautiful zoo with dinosaurs and ice age beasts. Manage more thanThe fun has evolved into prehistoric pandemonium as you add dinosaurs to your zoo with the Zoo Tycoon Dinosaur Digs expansion pack! Zookeepers will be envious as you let your imagination run wild building the most vibrant and beautiful zoo with dinosaurs and ice age beasts. Manage more than 20 new awe-inspiring creatures including the T-rex, Velociraptor, and Sabre-tooth cat while keeping your animals and guests happy and you will be a Zoo Tycoon! [Microsoft]… Expand"}, {"name": "PaRappa the Rapper 2", "details_link": "https://www.metacritic.com/game/playstation-2/parappa-the-rapper-2", "publisher": "SCEA", "release_date": "Jan 23 2002", "developers": ["NanaOn-Sha"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/d87eae4da99aaa75b9b67581675a953c-98.jpg", "descriptions": "See if you have enough rhythm to keep the beat with everyone's favorite rappin' puppy. Join Parappa and a cast of new and favorite characters on a mission of the ultimate importance - to prevent the Evil Noodle Syndicate from turning everything into noodles! Check out the funky fresh tunesSee if you have enough rhythm to keep the beat with everyone's favorite rappin' puppy. Join Parappa and a cast of new and favorite characters on a mission of the ultimate importance - to prevent the Evil Noodle Syndicate from turning everything into noodles! Check out the funky fresh tunes that are guaranteed to get your head bobbin' and your fingers tapping'. [Sony]… Expand"}, {"name": "Innocent Life: A Futuristic Harvest Moon", "details_link": "https://www.metacritic.com/game/psp/innocent-life-a-futuristic-harvest-moon", "publisher": "Natsume", "release_date": "May 15 2007", "developers": ["ArtePiazza"], "platforms": ["PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 67, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/3e36a522ab0deea8973b264e6c7b92dd-98.jpg", "descriptions": "(Also known as \"Harvest Moon: Innocent Life\")  Advanced robots and computers do the work for people on Heartflame Island, but this shiny technology can't save the inhabitants from an ancient curse. The spell could be broken if someone unlocks the ancient lands sealed off from humans, but(Also known as \"Harvest Moon: Innocent Life\")  Advanced robots and computers do the work for people on Heartflame Island, but this shiny technology can't save the inhabitants from an ancient curse. The spell could be broken if someone unlocks the ancient lands sealed off from humans, but you're the only one capable of pulling it off. Can you work hard and reclaim the land before time runs out? Grow crops and raise animals in a futuristic world. Unlock the secrets of the ancient ruins as you interact with the villagers. Explore the island, by walking or ATV...one of many high-tech tools at your disposal. [Natsume]… Expand"}, {"name": "State of Emergency", "details_link": "https://www.metacritic.com/game/xbox/state-of-emergency", "publisher": "Rockstar Games", "release_date": "Mar 26 2003", "developers": ["VIS Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/62f7c3721f64f122a7fc587a874153bb-98.jpg", "descriptions": "Join the resistance and liberate your people from the oppressive Corporation. State of Emergency plunges you into a rioting mob fighting for freedom. Use hand-to-hand combat, weapons, and anything you can find on the street to add to the chaos. The streets are littered with a variety ofJoin the resistance and liberate your people from the oppressive Corporation. State of Emergency plunges you into a rioting mob fighting for freedom. Use hand-to-hand combat, weapons, and anything you can find on the street to add to the chaos. The streets are littered with a variety of weapons--from park benches and soda cans to flamethrowers and rocket launchers. As you fight for the cause, don't be surprised if corporate executives, law enforcement officials, and looters fight back.… Expand"}, {"name": "Joy Ride Turbo", "details_link": "https://www.metacritic.com/game/xbox-360/joy-ride-turbo", "publisher": "Microsoft Game Studios", "release_date": "May 23 2012", "developers": ["BigPark"], "platforms": "Xbox 360", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 67, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/873a95f610b994b51ef69074ea4a395d-98.jpg", "descriptions": "From the Kinect Joy Ride creators comes Joy Ride Turbo, a controller-based arcade racer delivering precision handling and crazy stunts and promising more thrills, speed, & mayhem. In the new Stunt Park, you’re free to show off. It’s a vibrant playground for your car - jump off cliffs, shootFrom the Kinect Joy Ride creators comes Joy Ride Turbo, a controller-based arcade racer delivering precision handling and crazy stunts and promising more thrills, speed, & mayhem. In the new Stunt Park, you’re free to show off. It’s a vibrant playground for your car - jump off cliffs, shoot from a cannon, & more. Plus, explore and find collectibles that unlock cars – giving you an edge for faster races and death-defying tricks. Race new tracks, old favorites and 3 modes of play: Battle Race, Pro Race & Time Trial. Challenge family & friends to local 4-player split-screen or race up to 8 on Xbox LIVE. With Joy Ride Turbo, everyone’s in the driver’s seat in this madcap kart racer.… Expand"}, {"name": "City of Gangsters", "details_link": "https://www.metacritic.com/game/pc/city-of-gangsters", "publisher": "Kasedo Games", "release_date": "Aug  9 2021", "developers": ["SomaSim"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "Management", "Business / Tycoon"], "meta_score": 67, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/9fbd428d8c31c9a8a1e71187e63ccf47-98.jpg", "descriptions": "The year is 1920, the start of Prohibition in the USA. With congressional action, a huge segment of the national economy becomes illegal overnight: bars and saloons are ordered to close, distilleries and breweries go quiet, distributors shut down. But a new era is dawning: a gilded age forThe year is 1920, the start of Prohibition in the USA. With congressional action, a huge segment of the national economy becomes illegal overnight: bars and saloons are ordered to close, distilleries and breweries go quiet, distributors shut down. But a new era is dawning: a gilded age for smugglers, black markets, illegal manufacture, and organized crime.This is where you come in. You're a new arrival in the city at the dawn of Prohibition, with ambitions of striking it big. Behind many of the city's facades, people are building makeshift distilleries, secret loading docks, nighttime speakeasies. Work your way into this network, and the world will be yours.But think beyond making a quick buck or two. You gotta be thinking ahead. You gotta be thinking bigger. Much bigger.… Expand"}, {"name": "Hotel Sowls", "details_link": "https://www.metacritic.com/game/switch/hotel-sowls", "publisher": "CFK", "release_date": "Jul 30 2020", "developers": ["Studio Sott"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/6ed3a9e3f39a35ad6d4e9f631a59b7e9-98.jpg", "descriptions": "As a pharmacologist looking for success,\ryou obtained a mysterious stone found in Sowls.\r \"With this stone, I'll be able to conduct a successful research!\"\r Afterwards, you visited \"Hotel Sowls\" to get some good rest...\r...and found out next morning your precious stone has disappeared!"}, {"name": "Dreamfall Chapters", "details_link": "https://www.metacritic.com/game/playstation-4/dreamfall-chapters", "publisher": "Red Thread Games", "release_date": "May  5 2017", "developers": ["Red Thread Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Adventure", "3D", "Third-Person"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/ef976ee1bad900b06bddad2ec6dd43ff-98.jpg", "descriptions": "Dreamfall Chapters continues and concludes the gripping story of Zoe Castillo, the Dreamer. Revisiting familiar locations and characters, and introducing new sights and sounds, new faces, new game mechanics, new thrills and challenges, Dreamfall Chapters takes the player on an emotional,Dreamfall Chapters continues and concludes the gripping story of Zoe Castillo, the Dreamer. Revisiting familiar locations and characters, and introducing new sights and sounds, new faces, new game mechanics, new thrills and challenges, Dreamfall Chapters takes the player on an emotional, exciting and challenging journey -- from a dystopian cyberpunk future, through the mysterious and dreamlike Storytime, to the magical landscapes of Arcadia.… Expand"}, {"name": "Spaceball: Revolution", "details_link": "https://www.metacritic.com/game/wii/spaceball-revolution", "publisher": "Virtual Toys", "release_date": "Sep 14 2009", "developers": ["Virtual Toys"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/401559ff2b8806e7831d5a4b44e77725-98.jpg", "descriptions": "[WiiWare]  Steer your way through 15 diabolical levels in which you'll have to reconstruct impossible figures with help from space energy balls. Race against the clock and evade obstacles to activate the correct boxes. Spaceball: Revolution will put your ability and your concentration to the[WiiWare]  Steer your way through 15 diabolical levels in which you'll have to reconstruct impossible figures with help from space energy balls. Race against the clock and evade obstacles to activate the correct boxes. Spaceball: Revolution will put your ability and your concentration to the test. The game also lets you compare your score with the best players around the world in various difficulty levels: Easy, Normal, Advanced and Master. [Nintendo]… Expand"}, {"name": "Shenmue III", "details_link": "https://www.metacritic.com/game/playstation-4/shenmue-iii", "publisher": "Deep Silver", "release_date": "Nov 19 2019", "developers": ["Ys Net"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/4753da82ddb7352b8d7238a952d4c868-98.jpg", "descriptions": "The story begins in 1980s Yokosuka, Japan...The main character, Ryo Hazuki has his father murdered before him by Lan Di, the boss of the underground organization, Chi You Men. Ryo learns of the existence of a mysterious pair of mirrors, and makes his way to Hong Kong to unravel the mysteryThe story begins in 1980s Yokosuka, Japan...The main character, Ryo Hazuki has his father murdered before him by Lan Di, the boss of the underground organization, Chi You Men. Ryo learns of the existence of a mysterious pair of mirrors, and makes his way to Hong Kong to unravel the mystery and avenge his father. A stranger in a new land, Ryo gains the help of Ren Wuying, and together they make contact with Yuanda Zhu, only to see Lan Di make his escape. Continuing to pursue his father's Killer, Ryo travels to Bailu Village in Guilin. Along the way, he meets a new companion, Shenhua Ling who will forever change his destiny. The story of Shenmue was originally scripted for a total of eleven chapters.\r Shenmue II brought the story up to chapter six, with Shenmue III continuing from there at Bailu Village. What secrets are held within the twin mirrors? Will Ryo face his arch nemesis, Lan Di in a final showdown? What does fate hold in store for Ryo and Shenhua?… Expand"}, {"name": "RAGE 2", "details_link": "https://www.metacritic.com/game/playstation-4/rage-2", "publisher": "Bethesda Softworks", "release_date": "May 14 2019", "developers": ["id Software", "Avalanche Studios"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/09dad3f91b2820c2959f45ccaf4fbf06-98.jpg", "descriptions": "Dive headfirst into a dystopian world devoid of society, law, and order. RAGE 2 brings together two studio powerhouses Avalanche Studios, masters of open world insanity, and id Software, the gods of the first-person shooter to deliver a carnival of carnage where you can go anywhere, shootDive headfirst into a dystopian world devoid of society, law, and order. RAGE 2 brings together two studio powerhouses Avalanche Studios, masters of open world insanity, and id Software, the gods of the first-person shooter to deliver a carnival of carnage where you can go anywhere, shoot anything, and explode everything.\r THE LAST RANGER\rBring the pain using a collection of upgradable weapons, devastating Nanotrite powers, and Overdrive, the ability to push your guns beyond their mechanical limits.\r PEDAL TO THE METAL\rFrom monster trucks to gyrocopters, use an assortment of rugged and wasteland-ready vehicles to speed across the badlands. If you see it, you can drive it.\r FACTIONS & FOES\rFight against ferocious factions for control of the wasteland, each featuring a rogue's gallery of madmen, mutants, and monsters hungry for blood.\r THE WASTELAND AWAITS\rSeamlessly traverse a vast and varied landscape, from lush jungles and treacherous swamps to sun-scorched deserts in your pursuit of The Authority. The wasteland is massive, and you've got the arsenal to fight for every inch.… Expand"}, {"name": "Harvest Moon DS", "details_link": "https://www.metacritic.com/game/ds/harvest-moon-ds", "publisher": "Natsume", "release_date": "Sep 12 2006", "developers": ["TOSE"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/5cff97e0ac4e4512d64ad284e23f3432-98.jpg", "descriptions": "The Witch Princess conjured up a prank that went too far. Now it's up to you to restore the magic of Forget-Me-Not Valley. Seek out all 101 Harvest Sprites as you plant fields, tend livestock and find the right wife to share your farming dreams. As you find the missing Harvest Sprites theyThe Witch Princess conjured up a prank that went too far. Now it's up to you to restore the magic of Forget-Me-Not Valley. Seek out all 101 Harvest Sprites as you plant fields, tend livestock and find the right wife to share your farming dreams. As you find the missing Harvest Sprites they can help with chores around the farm...some might even unlock various activities or important information. Raise Cows, Sheep, Chickens and Ducks. Plant and grow a variety of crops and trees. New Festivals, Extensions, Items and Mini-Games. Inserting your copy of Harvest Moon: Friends of Mineral Town or Harvest Moon: More Friends of Mineral Town into your Nintendo DS will unlock many surprises in Harvest Moon DS! [Natsume]… Expand"}, {"name": "Outlaw Tennis", "details_link": "https://www.metacritic.com/game/playstation-2/outlaw-tennis", "publisher": "Global Star Software", "release_date": "Jul 26 2005", "developers": ["Hypnotix"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/6c283906687e68bf3164f460c0356313-98.jpg", "descriptions": "Outlaw Tennis is a top quality tennis sim combined with the outrageous characters, play modes and humor of the Outlaw series of games. The Fighting/composure system that is unique to the Outlaw series adds a whole new dimension to the otherwise conservative world of tennis. Get ready to hitOutlaw Tennis is a top quality tennis sim combined with the outrageous characters, play modes and humor of the Outlaw series of games. The Fighting/composure system that is unique to the Outlaw series adds a whole new dimension to the otherwise conservative world of tennis. Get ready to hit the courts, beat the daylights out of your opponent and cause a \"racquet\". Features 16 playable characters, customizable outfits and accessories. 6 improvable attributes: Power, Endurance, Control, Serve, Accuracy, Speed. 12 courts - 10 regular unlockable courts, 1 drill court, 1 surprise court. Dynamic Weather- patterns include sunshine, rain (thunder & lightning), snow and fog. Multiple Surface Types – Including Concrete, Black Top, Hard Polished Wood, Indoor Carpet Marble, Clay, Dirt, Natural Grass and Snow. 7 Match Modes including: Classic Tennis, Hot Potato, Casino, Baseball, Football Rules, Cash Zones, and Ping-Pong. [Globa Star]… Expand"}, {"name": "Worms Forts: Under Siege", "details_link": "https://www.metacritic.com/game/xbox/worms-forts-under-siege", "publisher": "Sega", "release_date": "Mar 15 2005", "developers": ["Team17"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/b7924e198bab13b8d5c191acf2efc67a-98.jpg", "descriptions": "Worms Forts: Under Siege! puts you in command of a team of up to four fort-dwelling worms. The game is set in the cartoon environments, and you direct your worm garrison to quickly construct defenses to maximize your strategic advantage, you direct the worms to expand your castle to seizeWorms Forts: Under Siege! puts you in command of a team of up to four fort-dwelling worms. The game is set in the cartoon environments, and you direct your worm garrison to quickly construct defenses to maximize your strategic advantage, you direct the worms to expand your castle to seize valuable resources, and you have them build weapons of mass destruction to destroy your opponents' fortifications. Test yourself against the single-player game by battling through the 20 missions. When you finish, take on three of your friends in Fort vs. Fort mode.… Expand"}, {"name": "Big Rumble Boxing: Creed Champions", "details_link": "https://www.metacritic.com/game/playstation-4/big-rumble-boxing-creed-champions", "publisher": "Deep Silver", "release_date": "Sep  3 2021", "developers": ["Survios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/3db20465ef21f2c0f8f963d3ca50c3dc-98.jpg", "descriptions": "Do you have what it takes to be a champion? Train, fight, and win like Adonis Creed and Rocky Balboa in this knockout boxing game. Are you ready to become a boxing champion? Step into the ring and show off your boxing skills in a knockout arcade experience. Fight as one of 20 iconicDo you have what it takes to be a champion? Train, fight, and win like Adonis Creed and Rocky Balboa in this knockout boxing game. Are you ready to become a boxing champion? Step into the ring and show off your boxing skills in a knockout arcade experience. Fight as one of 20 iconic characters from the Creed and Rocky movies. Take on world-class opponents across a variety of thrilling locations, or challenge your friends and family in intense, head-to-head matches.… Expand"}, {"name": "Shiness: The Lightning Kingdom", "details_link": "https://www.metacritic.com/game/xbox-one/shiness-the-lightning-kingdom", "publisher": "Focus Home Interactive", "release_date": "Apr 18 2017", "developers": ["Seaven Studio", "Enigami"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/e127ee26357d07d625aba5196fb7e584-98.jpg", "descriptions": "An Action RPG that takes you on a journey across a universe on the verge of collapse. Face off against dangerous enemies in hyper-dynamic fights, mixing magic with traditional fighting game mechanics. Gain experience to evolve your characters, learning exciting new skills and spells, andAn Action RPG that takes you on a journey across a universe on the verge of collapse. Face off against dangerous enemies in hyper-dynamic fights, mixing magic with traditional fighting game mechanics. Gain experience to evolve your characters, learning exciting new skills and spells, and become the hero who will unify the civilizations of Mahera. [Xbox.com]… Expand"}, {"name": "Ride 2", "details_link": "https://www.metacritic.com/game/pc/ride-2", "publisher": "Milestone S.r.l", "release_date": "Oct  7 2016", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/79aaa5029a95e33fc0253a3d0dc6e8d7-98.jpg", "descriptions": "Welcome to the temple of motorcycles, the only digital garage that will allow you to discover, transform and test the worlds fastest, most iconic and original vehicles.\r The top of the range of the most famous brands will await you to compete against each other in a unique videogame andWelcome to the temple of motorcycles, the only digital garage that will allow you to discover, transform and test the worlds fastest, most iconic and original vehicles.\r The top of the range of the most famous brands will await you to compete against each other in a unique videogame and show the world their full potential!\r Over 200 bikes are the undisputed protagonists of the new chapter of this long-waited two-wheel racing game. Feel the adrenaline rush through your veins and face the most dreadful bends with the passion and the boldness of a professional rider!\r Ride 2 include the tracks of the wildest and most exciting races of all time! Country, City, GP, Road, Motard and Drag race: challenge the toughest types of roads and leave a slipstream at every squeal of tyres!… Expand"}, {"name": "Battle Fantasia", "details_link": "https://www.metacritic.com/game/playstation-3/battle-fantasia", "publisher": "Aksys Games", "release_date": "Dec 22 2009", "developers": ["Arc System Works"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 67, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/b170f9b83aa5cfe3396810a09d627ee5-98.jpg", "descriptions": "Apart from the fast paced combat and responsive controls it's the unique graphics engine used that sets it apart from the rest. Battle Fantasia is played in two-dimensions but uses three-dimensional polygonal character models cleverly illustrated and lit to emulate 2D style sprites. TheApart from the fast paced combat and responsive controls it's the unique graphics engine used that sets it apart from the rest. Battle Fantasia is played in two-dimensions but uses three-dimensional polygonal character models cleverly illustrated and lit to emulate 2D style sprites. The result is called ‘2.5D’ and delivers a fast and fluid fighting game that promises to satisfy novice players and hardcore fans alike. With a roster of unique characters each with their own fighting style and special moves, Battle Fantasia promises to set the standard for PlayStation3 beat ‘em ups. [505 Games]… Expand"}, {"name": "Aliens: Fireteam Elite", "details_link": "https://www.metacritic.com/game/playstation-5/aliens-fireteam-elite", "publisher": "Cold Iron Studios", "release_date": "Aug 24 2021", "developers": ["Cold Iron Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/457262da180dac87d61ddf1b7b1901ab-98.jpg", "descriptions": "2202. A mysterious distress call reroutes your Marine Assault Unit to LV-895 in the outer colonies, where deadly Xenomorph legions, hidden corporate secrets, and ancient alien ruins await your arrival. Set in the iconic Alien universe, Aliens: Fireteam is a cooperative third-person survival2202. A mysterious distress call reroutes your Marine Assault Unit to LV-895 in the outer colonies, where deadly Xenomorph legions, hidden corporate secrets, and ancient alien ruins await your arrival. Set in the iconic Alien universe, Aliens: Fireteam is a cooperative third-person survival shooter that drops your fireteam of hardened marines into a desperate fight to contain the Xenomorph threat.\r Face off against waves of terrifying Xenomorph and Weyland-Yutani Synthetic foes alongside two players or AI teammates, as you and your fireteam desperately fight your way through four unique campaigns that introduce new storylines to the Alien universe. Create and customize your own Colonial Marine, choosing from an extensive variety of classes, weapons, gear and perks, battling overwhelming odds in this heart-pounding survival shooter experience.\r THE ULTIMATE HUNT\rPlay a pivotal role in the epic events that occur 23 years after the original Alien trilogy as a Colonial Marine stationed aboard the USS Endeavor, battling terrifying Xenomorph threats.\r SURVIVE THE HIVE\rFace overwhelming odds against over 20 enemy types, including 11 different Xenomorphs along the evolutionary scale from Facehuggers to Praetorians, each designed with their own intelligence to ambush, outsmart and eviscerate vulnerable marines.\r CUSTOMIZE YOUR FIRETEAM\rChoose from five unique classes - Gunner, Demolisher, Technician, Doc and Recon - each with their own special abilities and character perks. Utilize an extensive arsenal of 30+ weapons and 70+ mods/attachments in your effort to eradicate the Alien threat.… Expand"}, {"name": "Mafia III", "details_link": "https://www.metacritic.com/game/xbox-one/mafia-iii", "publisher": "2K Games", "release_date": "Oct  7 2016", "developers": ["Hangar 13"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 67, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/d2ec2d11b3199b91532dfed76efb638b-98.jpg", "descriptions": "In 1968, after years in Vietnam, Lincoln Clay knows this truth: Family isn't who you're born with, it's who you are willing to die for. Now back home, in a new New Orleans, Lincoln is dedicated to rebuilding his life, but established ties keep him from exiting the city. It'll take more thanIn 1968, after years in Vietnam, Lincoln Clay knows this truth: Family isn't who you're born with, it's who you are willing to die for. Now back home, in a new New Orleans, Lincoln is dedicated to rebuilding his life, but established ties keep him from exiting the city. It'll take more than a few friends to make it in this new world. Intense gun fights, hand-to-hand combat, white knuckle driving and street smarts will all be required. But with the right crew, tough decisions and some dirty hands, it's possible to ascend to the top of the city's underworld. It's about time to create a new family. … Expand"}, {"name": "Phoenix Wright: Ace Attorney - Trials and Tribulations", "details_link": "https://www.metacritic.com/game/wii/phoenix-wright-ace-attorney---trials-and-tribulations", "publisher": "Capcom", "release_date": "May 10 2010", "developers": ["Capcom"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Adventure", "First-Person", "Visual Novel", "Modern", "Modern"], "meta_score": 67, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/dfff59513c2c62fa7856104843d7234b-98.jpg", "descriptions": "[WiiWare]   Phoenix Wright is back as the third game in the popular Ace Attorney hand-held franchise comes to the WiiWare service. As Phoenix Wright, you'll play through five shocking new cases in first-person perspective. The game features two unique modes of play. In Investigations Mode[WiiWare]   Phoenix Wright is back as the third game in the popular Ace Attorney hand-held franchise comes to the WiiWare service. As Phoenix Wright, you'll play through five shocking new cases in first-person perspective. The game features two unique modes of play. In Investigations Mode you'll survey crime scenes, interview witnesses and gather evidence. You'll then present findings, listen to testimonials and examine witnesses in Court Mode. TRIALS AND TRIBULATIONS also includes the \"Psyche-Lock\" feature that allows Phoenix to use a line of questioning to reveal inconsistencies in witness testimony.… Expand"}, {"name": "Need for Speed Carbon", "details_link": "https://www.metacritic.com/game/wii/need-for-speed-carbon", "publisher": "EA Games", "release_date": "Nov 19 2006", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "Arcade", "GT / Street", "GT / Street", "Automobile"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/7884ee7bf6c4c167cad1725763fa580a-98.jpg", "descriptions": "What starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods oneWhat starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Need for Speed Carbon delivers the next generation of customization giving you the power to design and tweak your crew's cars in every way using the ground-breaking new Autosculpt technology. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games. [Electronic Arts]… Expand"}, {"name": "Thief", "details_link": "https://www.metacritic.com/game/playstation-4/thief", "publisher": "Square Enix", "release_date": "Feb 25 2014", "developers": ["Eidos Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "General", "Fantasy"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/ea0ad3b974106783734c7e795f683b9c-98.jpg", "descriptions": "Garrett, the Master Thief, steps out of the shadows into the City. In this treacherous place, where the Baron’s Watch spreads a rising tide of fear and oppression, his skills are the only things he can trust. Even the most cautious citizens and their best- guarded possessions are not safeGarrett, the Master Thief, steps out of the shadows into the City. In this treacherous place, where the Baron’s Watch spreads a rising tide of fear and oppression, his skills are the only things he can trust. Even the most cautious citizens and their best- guarded possessions are not safe from his reach. As an uprising emerges, Garrett finds himself entangled in growing layers of conflict. Lead by Orion, the voice of the people, the tyrannized citizens will do everything they can to claim back the City from the Baron’s grasp. The revolution is inevitable. If Garrett doesn’t get involved, the streets will run red with blood and the City will tear itself apart.… Expand"}, {"name": "Giraffe and Annika", "details_link": "https://www.metacritic.com/game/pc/giraffe-and-annika", "publisher": "Unties", "release_date": "Feb 17 2020", "developers": ["Atelier Mimina"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/b203b699fddf3253c79bc566f18b9eec-98.jpg", "descriptions": "Lovable, cat-eared Annika sets off on a grand quest on the Island of Spica! 3D adventure & rhythm action genres mesh in the lush, pastoral and beautiful manga-inspired world of Giraffe and Annika!"}, {"name": "Red Johnson's Chronicles", "details_link": "https://www.metacritic.com/game/playstation-3/red-johnsons-chronicles", "publisher": "Lexis Numerique", "release_date": "May  3 2011", "developers": ["Lexis Numerique"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3"], "genres": ["Miscellaneous", "Adventure", "Puzzle", "Action", "Puzzle", "Point-and-Click", "Action"], "meta_score": 67, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/56dffc64f6d83c60035ec8c931c55090-98.jpg", "descriptions": "Red Johnson's Chronicles is an action adventure/puzzle game that is played out in the style of a television crime show like Professor Layton meets CSI. In the game, players take on the role of Red Johnson, a private investigator on the streets of a city where the crime rate is skyrocketing.Red Johnson's Chronicles is an action adventure/puzzle game that is played out in the style of a television crime show like Professor Layton meets CSI. In the game, players take on the role of Red Johnson, a private investigator on the streets of a city where the crime rate is skyrocketing. Players must use clues, solve puzzles and question witnesses to investigate a murder, all while staying out of harm's way.… Expand"}, {"name": "Haunting Ground", "details_link": "https://www.metacritic.com/game/playstation-2/haunting-ground", "publisher": "Capcom", "release_date": "May 10 2005", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 67, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/8/a7f2144509c65792e83d6dcb13a81ed8-98.jpg", "descriptions": "(Also known as \"Demento\") In Haunting Ground, players take on the role of Fiona Belli, an 18 year old girl who is the sole survivor of a tragic car accident that has claimed both her parents. When she regains consciousness following the accident, she finds herself locked up in an unfamiliar(Also known as \"Demento\") In Haunting Ground, players take on the role of Fiona Belli, an 18 year old girl who is the sole survivor of a tragic car accident that has claimed both her parents. When she regains consciousness following the accident, she finds herself locked up in an unfamiliar old castle, with no clear way out. As she makes her way through unsettling surroundings, she encounters an array of strange inhabitants and learns that she has become the heiress of the mysterious castle upon her parents' death. Fiona also comes across Debilitas, a deformed and disturbed man who chases her relentlessly. Luckily, she meets a white shepherd dog named Hewie who has also been trapped in the castle. By saving him from the shackles that imprison him, an instant bond is formed. This spine-chilling survival horror game is set in a mysterious castle that has become a prison for two innocent characters- an orphaned young girl and a white shepherd dog. They must utilize each other's strengths if they hope to escape from their horrifying surroundings. Haunting Ground combines a compelling ambiance of terror and solitude with challenging puzzles and a unique gameplay approach. [Capcom]… Expand"}, {"name": "CivCity: Rome", "details_link": "https://www.metacritic.com/game/pc/civcity-rome", "publisher": "2K Games", "release_date": "Jul 24 2006", "developers": ["Firaxis Games", "FireFly Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "City Building", "Management", "Historic", "Historic", "Government"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/f359a6723a99152845e373fc99d9ef1f-98.jpg", "descriptions": "In CivCity: Rome, gamers will recreate the glory of Rome by building a small settlement into a mighty imperial city. Featuring hundreds of buildings including gladiatorial schools, amphitheatres, the circus maximus, legionnaire forts, weapons workshops and much more, CivCity: Rome offers theIn CivCity: Rome, gamers will recreate the glory of Rome by building a small settlement into a mighty imperial city. Featuring hundreds of buildings including gladiatorial schools, amphitheatres, the circus maximus, legionnaire forts, weapons workshops and much more, CivCity: Rome offers the most detailed look at Roman life ever depicted on a computer screen. [2K Games]… Expand"}, {"name": "Kane & Lynch: Dead Men", "details_link": "https://www.metacritic.com/game/pc/kane-lynch-dead-men", "publisher": "Eidos Interactive", "release_date": "Nov 20 2007", "developers": ["Io Interactive"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/3777e17fc75f8784d0e47f65cda2f89c-98.jpg", "descriptions": "Kane & Lynch: Dead Men is a dark and gritty drama featuring two men, one is a flawed mercenary and the other a medicated psychopath. Forced together on a violent and chaotic path of redemption and revenge, no action is considered too harsh as this volatile partnership is pushed beyond reasonKane & Lynch: Dead Men is a dark and gritty drama featuring two men, one is a flawed mercenary and the other a medicated psychopath. Forced together on a violent and chaotic path of redemption and revenge, no action is considered too harsh as this volatile partnership is pushed beyond reason in this brutally realistic, character-driven third person action shooter. [Eidos Interactive]… Expand"}, {"name": "Travis Strikes Again: No More Heroes", "details_link": "https://www.metacritic.com/game/switch/travis-strikes-again-no-more-heroes", "publisher": "Nintendo", "release_date": "Jan 18 2019", "developers": ["Grasshopper Manufacture"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/565f1a4a8f6553faee75f7c22b30794f-98.jpg", "descriptions": "Seven years have passed since the events of No More Heroes, and The Bad is determined to exact his revenge on Travis Touchdown. Just like the original cult classic, players will have to battle through multiple punk-rock levels and defeat over-the-top bosses."}, {"name": "Hyperdimension Neptunia Re;Birth2: Sisters Generation", "details_link": "https://www.metacritic.com/game/playstation-vita/hyperdimension-neptunia-rebirth2-sisters-generation", "publisher": "Idea Factory", "release_date": "Jan 27 2015", "developers": ["Felistella"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/c1acad8887e0354c6c2a504e46cb680c-98.jpg", "descriptions": "In 20XX Gamindustri faces a severe crisis. Shops are boarded up, creators are overworked and starving, and death looms. But the CPUs refuse to let this be game over for their world. Gamindustri had severed its ties to the chaotic Lawless Realm long ago. Ever since the advent of the ArfoireIn 20XX Gamindustri faces a severe crisis. Shops are boarded up, creators are overworked and starving, and death looms. But the CPUs refuse to let this be game over for their world. Gamindustri had severed its ties to the chaotic Lawless Realm long ago. Ever since the advent of the Arfoire Syndicate of International Crime morality has all but vanished. Thus did Gamindustri fall into complete and utter disarray. Those who tire of living in this corrupt world are sent to wander the Gamindustri Graveyard, forever lost. … Expand"}, {"name": "Harry Potter and the Prisoner of Azkaban", "details_link": "https://www.metacritic.com/game/xbox/harry-potter-and-the-prisoner-of-azkaban", "publisher": "EA Games", "release_date": "Jun  2 2004", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/8bd1aa95f8cd1500742633302f18bd86-98.jpg", "descriptions": "The Dementors are coming, and this time Harry needs his friends. From the opening scene on the Hogwarts Express to the climatic finale on the shore of the great lake at Hogwarts, Harry Potter and the Prisoner of Azkaban immerses you in the world of Harry Potter. As Harry, Ron, and Hermione,The Dementors are coming, and this time Harry needs his friends. From the opening scene on the Hogwarts Express to the climatic finale on the shore of the great lake at Hogwarts, Harry Potter and the Prisoner of Azkaban immerses you in the world of Harry Potter. As Harry, Ron, and Hermione, you'll face the dreaded Azkaban guards, fly the Hippogriff around towers, and explore Hogwarts with the Marauder's Map. Learn spells that allow you to freeze creatures, control dragons, and conjure a Patronus. New two-player minigames include Flying Seahorse Fishing and Dueling Club minigames.… Expand"}, {"name": "Champions of Anteria", "details_link": "https://www.metacritic.com/game/pc/champions-of-anteria", "publisher": "Ubisoft", "release_date": "Aug 30 2016", "developers": ["Blue Byte"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 67, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/612389180e359668e7fc7c8109002c4c-98.jpg", "descriptions": "Champions of Anteria is a tactical RTS with Active-Pause Mode in which you can fight with three of five Champions in diverse and challenging battles. Each Champion is aligned to a magical element, and players must strategically choose the powers they bring into a battle, as interactionsChampions of Anteria is a tactical RTS with Active-Pause Mode in which you can fight with three of five Champions in diverse and challenging battles. Each Champion is aligned to a magical element, and players must strategically choose the powers they bring into a battle, as interactions between affinities constitute a very important part of the gameplay. Champions of Anteria features a completely new narrative and adventure for players to enjoy. With a renewed focus on story, the economic and logistic features are revised and are handled via a homebase management system where you can craft items for your Champions and unlock new abilities. [Ubisoft]… Expand"}, {"name": "Castlevania: Harmony of Despair", "details_link": "https://www.metacritic.com/game/xbox-360/castlevania-harmony-of-despair", "publisher": "Konami", "release_date": "Aug  4 2010", "developers": ["Konami"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 67, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/b535a6cbce466532b13ffcdfe27692b7-98.jpg", "descriptions": "[Xbox Live Arcade]  Designed by the legendary producer of the Castlevania series, Koji Igarashi, Castlevania Harmony of Despair allows up to six friends to play together via online co-op story mode or see who the best vampire hunter is in Survival Mode, which challenges you to fend off your[Xbox Live Arcade]  Designed by the legendary producer of the Castlevania series, Koji Igarashi, Castlevania Harmony of Despair allows up to six friends to play together via online co-op story mode or see who the best vampire hunter is in Survival Mode, which challenges you to fend off your friends while fighting for your very survival. Utilize your co-op skills to explore the levels with your friends in order to find hidden locations with special items and equipment or team up in battle to let loose destructive attacks on the hordes of attacking creatures. [Konami]… Expand"}, {"name": "Dynasty Warriors Next", "details_link": "https://www.metacritic.com/game/playstation-vita/dynasty-warriors-next", "publisher": "Tecmo Koei America Corp.", "release_date": "Feb 21 2012", "developers": ["Koei", "Omega Force"], "platforms": "PlayStation Vita", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/856997ad0e388d83dd1d64b78c9c5b9d-98.jpg", "descriptions": "In this Tactical Action game players can enjoy the thrill of taking down thousands of enemies and become the greatest hero in Chinese history."}, {"name": "Dissidia: Final Fantasy NT", "details_link": "https://www.metacritic.com/game/playstation-4/dissidia-final-fantasy-nt", "publisher": "Square Enix", "release_date": "Jan 30 2018", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/18f8acc826936b8f4c7222fd5c32fc15-98.jpg", "descriptions": "Calling All Warriors! In partnership with Team Ninja, Square Enix presents Dissidia Final Fantasy NT as the next evolution in squad based brawlers. It's a fast-paced, strategic brawler where you can choose from over 20 iconic Final Fantasy characters and battle in a 3 versus 3 arena withCalling All Warriors! In partnership with Team Ninja, Square Enix presents Dissidia Final Fantasy NT as the next evolution in squad based brawlers. It's a fast-paced, strategic brawler where you can choose from over 20 iconic Final Fantasy characters and battle in a 3 versus 3 arena with your friends and other players online, or by yourself.… Expand"}, {"name": "Ice Age: Dawn of the Dinosaurs", "details_link": "https://www.metacritic.com/game/playstation-3/ice-age-dawn-of-the-dinosaurs", "publisher": "Activision", "release_date": "Jun 30 2009", "developers": ["Activision"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/5f4c2afd195a7bdf96ad631262d68ac8-98.jpg", "descriptions": "Ice Age: Dawn of the Dinosaurs reunites fans with Scrat, Sid, Manny and Diego in an all-new quest based on the upcoming film from Twentieth Century Fox. As the unlikely herd travels across the tundra and beyond, they stumble upon another world - a lush Dinosaur World teeming with jungles,Ice Age: Dawn of the Dinosaurs reunites fans with Scrat, Sid, Manny and Diego in an all-new quest based on the upcoming film from Twentieth Century Fox. As the unlikely herd travels across the tundra and beyond, they stumble upon another world - a lush Dinosaur World teeming with jungles, mysterious plants, fierce dinosaurs, wild new adventures and several new friends. Taking on the role of more than six playable characters, including everyone's favorite Ice Age friends and newly introduced characters, players master their unique skills and abilities across more than 15 action-packed levels. In addition to the expanded features of the single-player gameplay, for the first time in an Ice Age game, players can team up with friends and family in eight competitive multiplayer mini-games. Experience continuously changing gameplay through more than 15 levels - Every level presents new and exciting challenges as players learn and master each character’s abilities in order to defeat enemies, traverse dangerous landscapes, avoid obstacles and escape from perilous situations. [Activision]… Expand"}, {"name": "Mega Man Battle Network 5: Team Protoman", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network-5-team-protoman", "publisher": "Capcom", "release_date": "Jun 21 2005", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 67, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/7a24edd804ce079882be97d2675d8684-98.jpg", "descriptions": "Team Protoman is the first edition of Mega Man Battle Network 5. In the game, you can join forces with characters from previous installments of the Mega Man Battle series, and you can play in a new fighting mode. Team up with other cyberheroes in an effort to stop an evil organization fromTeam Protoman is the first edition of Mega Man Battle Network 5. In the game, you can join forces with characters from previous installments of the Mega Man Battle series, and you can play in a new fighting mode. Team up with other cyberheroes in an effort to stop an evil organization from taking control of the global Internet.… Expand"}, {"name": "World Championship Poker: Deluxe Series", "details_link": "https://www.metacritic.com/game/ds/world-championship-poker-deluxe-series", "publisher": "Crave", "release_date": "Apr 17 2005", "developers": ["Sensory Sweep"], "platforms": ["PlayStation 2", "DS"], "num_players": "1-6 ", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/99654bab65221a42d0eec1408330662d-98.jpg", "descriptions": "Features 12 types of poker and card games including Texas Hold'em, Five Card Draw , Video Poker and Black Jack. Interactive Poker tutorials for each game. Wireless multiplayer for up to six players, featuring a \"smack talk\" system so you can taunt your opponents. Quick Play for players whoFeatures 12 types of poker and card games including Texas Hold'em, Five Card Draw , Video Poker and Black Jack. Interactive Poker tutorials for each game. Wireless multiplayer for up to six players, featuring a \"smack talk\" system so you can taunt your opponents. Quick Play for players who just want to play a quick tournament style card game. Career mode that features four 3D themed casinos, poker tournaments, a Loan Shark and a Gift Shop. Customize your character with \"bling\" as you rake in more pots!… Expand"}, {"name": "Yo-kai Watch Blasters: White Dog Squad", "details_link": "https://www.metacritic.com/game/3ds/yo-kai-watch-blasters-white-dog-squad", "publisher": "Nintendo", "release_date": "Sep  7 2018", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/5c0f69d7b23593d8f82f13716208d3fe-98.jpg", "descriptions": "Take down enemy Yo-kai and Big Bosses using skills and Soultimate Moves with up to 3 other friends*. As you tackle missions, befriend new Yo-kai to amplify your team's awesomeness. Train with Sgt. Burly to become the strongest Blasters team there is! As you complete missions, gather Oni OrbsTake down enemy Yo-kai and Big Bosses using skills and Soultimate Moves with up to 3 other friends*. As you tackle missions, befriend new Yo-kai to amplify your team's awesomeness. Train with Sgt. Burly to become the strongest Blasters team there is! As you complete missions, gather Oni Orbs and items to level up or forge equipment to power up your team. Some missions, bosses, and Yo-kai are exclusive to each version. Trade Yo-kai between versions to collect them all! You can befriend all friend Yo-kai from all versions of the YO-KAI WATCH 2 game, boss Yo-kai, plus the all-new Usapyon, Blizzie, and more. Link save data with a version of YO-KAI WATCH 2 to befriend special Yo-kai. Uncover new sides to the story as well as new Yo-kai, bosses, and missions with a post-launch software update.… Expand"}, {"name": "NBA 2K21", "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k21", "publisher": "2K Games", "release_date": "Sep  4 2020", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox Series X", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 67, "users_score": 1.6, "image": "https://static.metacritic.com/images/products/games/8/a6e53707b7ea2fb6a8ede5efb08de700-98.jpg", "descriptions": "With extensive improvements upon its best-in-class graphics and gameplay, competitive and community online features, and deep, varied game modes, NBA 2K21 offers one-of-a-kind immersion into all facets of NBA basketball and culture - where Everything is Game."}, {"name": "State of Mind", "details_link": "https://www.metacritic.com/game/playstation-4/state-of-mind", "publisher": "Daedalic Entertainment", "release_date": "Aug 15 2018", "developers": ["Daedalic Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/01490d96e424b9862837c3832da70e49-98.jpg", "descriptions": "When mind and machine become one – what will remain of humanity? State of Mind is a futuristic thriller game delving into transhumanism. The game explores a world torn between a dystopian material reality and a utopian virtual future."}, {"name": "All Zombies Must Die!", "details_link": "https://www.metacritic.com/game/playstation-3/all-zombies-must-die!", "publisher": "Doublesix", "release_date": "Dec 27 2011", "developers": ["Doublesix"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 67, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/39e14b5d9fe04fa66a598963fdf52152-98.jpg", "descriptions": "A Gamer, a Girl, a Mad Scientist and an Alien are all that stands between 6 billion zombies and the worldï¿½s supply of delicious, supple brains. All Zombies Must Die! drops up to four players into the town of Deadhill, where they must blast their way through ranks ofA Gamer, a Girl, a Mad Scientist and an Alien are all that stands between 6 billion zombies and the worldï¿½s supply of delicious, supple brains. All Zombies Must Die! drops up to four players into the town of Deadhill, where they must blast their way through ranks of brain hungry monsters with a variety of weaponry while completing quests served up by the gameï¿½s insane storyline. doublesix is combining elements of action and role-playing, including character levelling, weapons crafting and numerous quests. The graphics reflect the silly yet sinister nature of the gameplay with a bright, comic style.… Expand"}, {"name": "Bright Memory: Infinite", "details_link": "https://www.metacritic.com/game/pc/bright-memory-infinite", "publisher": "Playism", "release_date": "Nov 11 2021", "developers": ["FYQD-Studio"], "platforms": ["PlayStation 5", "Switch", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/7e7d43375e80ee9239c0604742465223-98.jpg", "descriptions": "A lightning-fast fusion of the FPS and action genres\r Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science ResearchA lightning-fast fusion of the FPS and action genres\r Bright Memory: Infinite is set in a sprawling, futuristic metropolis in the year 2036. A strange phenomenon for which scientists can find no explanation has occurred in the skies around the world. The Supernatural Science Research Organization (SRO) has sent agents out to various regions to investigate this phenomenon. It is soon discovered that these strange occurrences are connected to an archaic mystery an as-of-yet unknown history of two worlds, about to come to light...\r Optimized for Xbox Series X\rGames built using the Xbox Series X development kit are designed to take advantage of the unique capabilities of the Xbox Series X. They will showcase unparalleled load-times, visuals, responsiveness, and framerates up to 120FPS.\r * 4K Ultra HD\r* 60 Frames Per Second\r* Ray Tracing… Expand"}, {"name": "Double Cross", "details_link": "https://www.metacritic.com/game/switch/double-cross", "publisher": "Graffiti Games", "release_date": "Jan 10 2019", "developers": ["13AM Games"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 67, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/80a758d869703f44888d1b0e0c6d30a2-98.jpg", "descriptions": "Developed by 13AM Games, the studio behind award-winning Runbow, Double Cross is an exciting action adventure game that has players take on the role of Zahra, an agent of R.I.F.T. (Regulators of Interdimensional Frontiers and Technology) whose job it is to maintain peace and order betweenDeveloped by 13AM Games, the studio behind award-winning Runbow, Double Cross is an exciting action adventure game that has players take on the role of Zahra, an agent of R.I.F.T. (Regulators of Interdimensional Frontiers and Technology) whose job it is to maintain peace and order between all dimensions. A recent attack on R.I.F.T. headquarters thrusts players into a thrilling new case where they must use their R.I.F.T. developed gear to sling, swing, fight and investigate across distinct dimensions. During their travels players will gather clues to bring themselves one step closer to finding the identity of R.I.F.T.’s attacker and save every variation of the universe. … Expand"}, {"name": "Red Faction: Guerrilla Re-Mars-tered", "details_link": "https://www.metacritic.com/game/pc/red-faction-guerrilla-re-mars-tered", "publisher": "THQ Nordic", "release_date": "Jul  3 2018", "developers": ["Volition Inc."], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/d7b73643aa2b78e42e79d7c3b73a23ee-98.jpg", "descriptions": "Set 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: GuerrillaSet 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: Guerrilla still defines the limits of destruction-based game-play with a huge open-world, fast-paced guerrilla-style combat, and true physics-based destruction.Features:* Open World Guerrilla Warfare - You decide who, when, where and how to battle. Utilize guerrilla tactics, improvised weaponry, and modified vehicles to lead insurgent attacks on EDF targets. Launch attacks based on your own gameplay style, take on missions in any order you choose, or engage in destructive activities to weaken the EDF's grip on Mars.* Strategic Destruction - Use destruction to your tactical advantage, setting ambushes or chain reaction explosions to attack enemy strongholds and permanently modify the game environment. Leverage fully-dynamic physics-based destruction to improvise on the fly: blow holes in a wall or floor to set an ambush or escape, take out a staircase to stop your pursuers, or drive vehicles through blown out walls.* Evolving & Emergent Gameplay - Carve your path through an ever-changing landscape as you improvise your combat tactics - mixing gameplay styles, vehicles, weapons and explosives to defeat the EDF.* Epic Sci-Fi Setting - Explore the huge, unforgiving Martian landscape, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos; then tear through the fully destructible open-world environments swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire.* Multiplayer Combat - There is no place to hide when you put your guerrilla warfare skills to the test in a variety of highly destructive multiplayer combat modes.Re-Mars-tered Features:> Fully reworked graphics Heavily reworked textures and graphic features adding for example specular maps.> Improved shadow rendering> Improved Lighting> Shader & Postprocessing rework> Native 4k support for the finest up to date mars destruction experience ever… Expand"}, {"name": "Corpse Party: Book of Shadows", "details_link": "https://www.metacritic.com/game/psp/corpse-party-book-of-shadows", "publisher": "XSEED Games", "release_date": "Jan 15 2013", "developers": ["5pb"], "platforms": ["iPhone/iPad", "PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Horror", "Horror", "Survival"], "meta_score": 67, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/8598c7e6a43a1084c415120a34e7f4f3-98.jpg", "descriptions": "Corpse Party: Book of Shadows is a gory, disturbing and uncomfortably exhilarating tale of mystery, fear and survival."}, {"name": "Code of Princess", "details_link": "https://www.metacritic.com/game/3ds/code-of-princess", "publisher": "Atlus", "release_date": "Oct  9 2012", "developers": ["Studio Saizensen"], "platforms": ["PC", "3DS"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "General", "Action RPG"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/ae3628b7f15767eb376251770739496a-98.jpg", "descriptions": "Code of Princess is an action RPG brawler for Nintendo 3DS with cooperative and competitive multiplayer."}, {"name": "BloodRayne 2", "details_link": "https://www.metacritic.com/game/pc/bloodrayne-2", "publisher": "Majesco Games", "release_date": "Aug  2 2005", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/3e45a82267e0fad47169ac3ee071a92d-98.jpg", "descriptions": "Born from the unnatural union of vampire and human, BloodRayne is blessed with the powers of a vampire but cursed with the unquenchable thirst for blood and a weakness to sunlight. BloodRayne 2 challenges the supernatural anti-heroine with her most personal battle yet as she hunts down eachBorn from the unnatural union of vampire and human, BloodRayne is blessed with the powers of a vampire but cursed with the unquenchable thirst for blood and a weakness to sunlight. BloodRayne 2 challenges the supernatural anti-heroine with her most personal battle yet as she hunts down each of her wicked siblings who are carrying on the legacy of their dead father, Kagan. They have created \"The Shroud,\" a mysterious substance which, when released, renders the sun?s lethal rays harmless to vampires. Now only BloodRayne stands between an unsuspecting humanity and a horrifying vampire dawn. Expanding upon the distinctive features that were the hallmark of its predecessor ? fast-paced acrobatic combat and supernatural powers ? BloodRayne 2 includes new in-game dynamics such as pole combat, rail sliding and advanced melee fighting with fatality moves. Built upon a modified version of the Infernal Engine, BloodRayne 2 introduces threatening new bosses, all new environments set within a huge modern day city, a range of new supernatural powers and new motion-captured movements complete with soft-body physics. [Majesco]… Expand"}, {"name": "Harry Potter and the Prisoner of Azkaban", "details_link": "https://www.metacritic.com/game/pc/harry-potter-and-the-prisoner-of-azkaban", "publisher": "EA Games", "release_date": "May 25 2004", "developers": ["KnowWonder"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/26e60bfe2180a30c2b0ecf440fefee5f-98.jpg", "descriptions": "For the first time gamers will play as friends Ron Weasley and Hermione Granger as well as Harry Potter, switching between characters and utilizing their key attributes and skills to resolve challenges and overcome enemies. The three friends will need to combine their strengths and master aFor the first time gamers will play as friends Ron Weasley and Hermione Granger as well as Harry Potter, switching between characters and utilizing their key attributes and skills to resolve challenges and overcome enemies. The three friends will need to combine their strengths and master a variety of new spells as they face Harry's most terrifying opponents yet: the escaped convict Sirius Black and the Dementors, the sinister guards of Azkaban prison. From the opening scene on the Hogwarts Express to the climatic finale on the shore of the great lake at Hogwarts, the Harry Potter and the Prisoner of Azkaban videogame will immerse players in the magical world of Harry Potter. Players will unravel the mystery surrounding Sirius Black and his escape from the infamous wizard prison Azkaban, as they take part in the most exciting and challenging Harry Potter videogame adventure yet. Gamers will encounter a host of new characters and creatures, engage in a variety of sub-quests, fly on a Hippogriff, reveal the secrets of the Marauder's Map, and take on their friends in multiple two-player challenges. [Electroinc Arts]… Expand"}, {"name": "Dead to Rights", "details_link": "https://www.metacritic.com/game/pc/dead-to-rights", "publisher": "Hip Games", "release_date": "Nov 10 2003", "developers": ["Namco"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 67, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/9f3a028dc855b0faffa8edb666640a67-98.jpg", "descriptions": "Meet Jack Slate, a cop who's having a bad day. Framed for murder and facing execution, he makes a daring escape from the Iron Point Maximum-Security Penitentiary. Driven to bring the criminal element that framed him to justice, Slate hunts the hunters in this gritty, crime-noir inspiredMeet Jack Slate, a cop who's having a bad day. Framed for murder and facing execution, he makes a daring escape from the Iron Point Maximum-Security Penitentiary. Driven to bring the criminal element that framed him to justice, Slate hunts the hunters in this gritty, crime-noir inspired epic. He finds himself alone and on the run trying to survive the hard streets of Grant City. Without a home and pitifully few friends, what Jack discovers sends him on a downward spiral into a labyrinth of corruption, betrayal and crime. With super-charged game play, jaw-dropping graphics and hard-boiled storytelling, Dead to Rights raises the bar on the crime action-thriller genre. [Hip Games]… Expand"}, {"name": "Blackthorne", "details_link": "https://www.metacritic.com/game/game-boy-advance/blackthorne", "publisher": "Blizzard Classic Arcade", "release_date": "Sep 17 2003", "developers": ["Mass Media"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 67, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/ef998e4a7e6208f8690fdd7cc4dbe515-98.jpg", "descriptions": "BEFORE DIABLO... one warrior stood alone against a kindgom of evil. With a shotgun at your side and vengeance on your mind, step into the boots of Kyle Blackthorne. Single-handedly blast your way through a demonic horde of mutants to defeat the evil Sarlac and free your enslaved people. TheBEFORE DIABLO... one warrior stood alone against a kindgom of evil. With a shotgun at your side and vengeance on your mind, step into the boots of Kyle Blackthorne. Single-handedly blast your way through a demonic horde of mutants to defeat the evil Sarlac and free your enslaved people. The fate of the world is in your hands.… Expand"}, {"name": "Legaia 2: Duel Saga", "details_link": "https://www.metacritic.com/game/playstation-2/legaia-2-duel-saga", "publisher": "Eidos Interactive", "release_date": "Oct  1 2002", "developers": ["Prokion"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 67, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/886c980d2a349aba018f3f7ca509c413-98.jpg", "descriptions": "A magical crystal that supplies infinite water to the small village of Nohl is stolen by force, causing a solar eclipse that drowns the land in an evil light, making monsters more abundant and powerful and placing the village's survival at stake. Now Lang, a rookie member of the NohlA magical crystal that supplies infinite water to the small village of Nohl is stolen by force, causing a solar eclipse that drowns the land in an evil light, making monsters more abundant and powerful and placing the village's survival at stake. Now Lang, a rookie member of the Nohl militia, must fight his way across uncharted lands to recover the crystal and restore peace to the land. [Fresh Games]… Expand"}, {"name": "Commandos 2: Men of Courage", "details_link": "https://www.metacritic.com/game/playstation-2/commandos-2-men-of-courage", "publisher": "Eidos Interactive", "release_date": "Aug 28 2002", "developers": ["Pyro Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Strategy", "Real-Time", "Military"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/2b5fc8849455b6e35e57b98cd9523ab0-98.jpg", "descriptions": "A tactical action/strategy game set against the backdrop of World War II. Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of mission-based objectives. Go covert into new environments based onA tactical action/strategy game set against the backdrop of World War II. Take control of an elite group of commandos who must venture deep into enemy territory and utilize their combined expertise to complete a series of mission-based objectives. Go covert into new environments based on authentic WWII locations: the heart of the third Reich, a northern European submarine installation, the headquarters of the Japanese army and more. [Eidos Interactive]… Expand"}, {"name": "Tsugunai: Atonement", "details_link": "https://www.metacritic.com/game/playstation-2/tsugunai-atonement", "publisher": "Atlus Co.", "release_date": "Nov 29 2001", "developers": ["Cattle Call"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 67, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/72d2b385a313877ee1a2f333f7b1b21f-98.jpg", "descriptions": "The story of a young mercenary named Leise, who has inadvertently angered the God of Light by removing the mystical Treasure Orb from its sacred pedestal. As punishment, the God of Light forever separates his soul from his body until he atones for his sins by helping the people of Walondia.The story of a young mercenary named Leise, who has inadvertently angered the God of Light by removing the mystical Treasure Orb from its sacred pedestal. As punishment, the God of Light forever separates his soul from his body until he atones for his sins by helping the people of Walondia. However, without a physical body of his own, the only way to change the fates of the people is to possess them. Ultimately, Leise must confront the evil power responsible for the darkness that has befallen Walondia. [Atlus]… Expand"}, {"name": "NFL Quarterback Club 2002", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-quarterback-club-2002", "publisher": "Acclaim", "release_date": "Sep  5 2001", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/dba7e6eb9af1305757812dfde2b21ff3-98.jpg", "descriptions": "The only football game with NFL Quarterback Challenge Mode, which features four head-to-head events:  Speed and Mobility, Accuracy, Long Distance Throw, and Read & Recognition.  Play as  an active QB or as a retired great such as Elway, Marino, Young, Kelly, and Simms."}, {"name": "Star Wars: Demolition", "details_link": "https://www.metacritic.com/game/dreamcast/star-wars-demolition", "publisher": "LucasArts", "release_date": "Nov 19 2000", "developers": ["Luxoflux", "Inc."], "platforms": ["PlayStation 4", "PlayStation 5", "Dreamcast"], "genres": ["Driving", "Car Combat"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/1ca32ff362e9ed13c80816b424e0f8cb-98.jpg", "descriptions": "Star Wars Demolition might seem like some half-baked attempt to cash in on the Star Wars license, though it's actually a competently executed game."}, {"name": "Uncharted: Fight for Fortune", "details_link": "https://www.metacritic.com/game/playstation-vita/uncharted-fight-for-fortune", "publisher": "SCEA", "release_date": "Dec  4 2012", "developers": ["Sony Bend"], "platforms": "PlayStation Vita", "num_players": "2 ", "genres": ["Strategy", "Action Adventure", "Turn-Based", "Modern", "Modern", "Card Battle"], "meta_score": 67, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/b01a4f09ec74da75151a19257ab4fd9f-98.jpg", "descriptions": "UNCHARTED: Fight for Fortune is an action-adventure turn-based card game featuring the heroes and villains from the UNCHARTED universe. Take a look at the new trailer of the game below to give you an idea of how combat works."}, {"name": "DC Universe Online", "details_link": "https://www.metacritic.com/game/playstation-3/dc-universe-online", "publisher": "Sony Online Entertainment", "release_date": "Jan 11 2011", "developers": ["WBIE"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "PlayStation 3"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 67, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/13fe8fe3c4e0676c3087b968d6c278ba-98.jpg", "descriptions": "DC Universe Online is an MMO based on DC comic book universe and lets you fight along side or against DC superheroes."}, {"name": "Top Spin", "details_link": "https://www.metacritic.com/game/playstation-2/top-spin", "publisher": "2K Sports", "release_date": "Sep 26 2005", "developers": ["Pam Development"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/d52792bf8d18988cbf25a3bd2a2c0d71-98.jpg", "descriptions": "Top Spin takes 16 of the top professional tennis players in the world including Maria Sharapova, Roger Federer, Venus Williams and Carlos Moya and puts them in gamers' hands to create the most realistic tennis game ever. Players must work their way up from an unranked amateur with no skills,Top Spin takes 16 of the top professional tennis players in the world including Maria Sharapova, Roger Federer, Venus Williams and Carlos Moya and puts them in gamers' hands to create the most realistic tennis game ever. Players must work their way up from an unranked amateur with no skills, to a top ranked player in the world with huge endorsement deals. Top Spin further pushes the edge of competition as the only PlayStation 2 tennis game playable online. [2K Games]… Expand"}, {"name": "Ministry of Broadcast", "details_link": "https://www.metacritic.com/game/pc/ministry-of-broadcast", "publisher": "Hitcents", "release_date": "Jan 30 2020", "developers": ["Homeless Unicorn", "Ministry of Broadcast Studios"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/2686d6336d62ba3834744e60c70ea55f-98.jpg", "descriptions": "Ministry of Broadcast is a narrative-driven single player cinematic platformer mixing Orwell’s 1984 with modern reality TV. A country divided by The Wall; to cross it and reach your family, you must compete on - and win - a reality TV show broadcast by the Regime."}, {"name": "One Piece: Unlimited Adventure", "details_link": "https://www.metacritic.com/game/wii/one-piece-unlimited-adventure", "publisher": "Namco Bandai Games", "release_date": "Jan 22 2008", "developers": ["Ganbarion"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "General", "General"], "meta_score": 67, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/c7a80f735bfe8012e422a695269fb566-98.jpg", "descriptions": "In One Piece: Unlimited Adventure, the motley Straw Hat Pirates find themselves stranded in a mysterious land after a massive island rises to the ocean surface from underneath their pirate ship. Players must assume the role of their favorite One Piece persona and explore this newly formedIn One Piece: Unlimited Adventure, the motley Straw Hat Pirates find themselves stranded in a mysterious land after a massive island rises to the ocean surface from underneath their pirate ship. Players must assume the role of their favorite One Piece persona and explore this newly formed terrain to uncover the secrets and powers that lie within this isle. With the Wii remote and Nunchuck controller, players pull, turn and swing to battle nefarious villains using each character’s own unique set of moves including Luffy’s “Gum Gum Storm” and Nami’s “Cyclone Tempo”. Now with more One Piece playable characters than ever, gamers can journey through the exclusive new storyline in Adventure Mode using one of eight Straw Hat pirates or test their skills in Survival Mode and Vs. Mode to unlock more than 40 additional playable swashbucklers. Find a bountiful booty of items, unlock special moves and costumes all in the name of acquiring the ultimate treasure. [Namco Bandai Games]… Expand"}, {"name": "ELEX II", "details_link": "https://www.metacritic.com/game/xbox-series-x/elex-ii", "publisher": "THQ Nordic", "release_date": "Mar  1 2022", "developers": ["Piranha Bytes"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 67, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/751d65e7422441c30b974f9db4c387c2-98.jpg", "descriptions": "ELEX II is the sequel to ELEX, the vintage open-world role-playing experience from the award-winning creators of the Gothic and Risen series, Piranha Bytes. ELEX II returns to the post-apocalyptic Science Fantasy world of Magalan with massive environments that can be explored with unrivaledELEX II is the sequel to ELEX, the vintage open-world role-playing experience from the award-winning creators of the Gothic and Risen series, Piranha Bytes. ELEX II returns to the post-apocalyptic Science Fantasy world of Magalan with massive environments that can be explored with unrivaled freedom via jetpack, you will be able to move through the epic story any way you want.Several years after Jax defeated the Hybrid, a new threat arrives from the sky, unleashing the dangerous powers of dark Elex and endangering all life on the planet. In order to defend the peace on Magalan and the safety of his own family, Jax has to go on a mission to convince the factions to unite against the invaders.Dive into a huge, hand-crafted, completely unique world with multiple factions and diverse environments set in a post-apocalyptic science fantasy universe.… Expand"}, {"name": "MXGP3: The Official Motocross Videogame", "details_link": "https://www.metacritic.com/game/playstation-4/mxgp3-the-official-motocross-videogame", "publisher": "Milestone S.r.l", "release_date": "Jun 20 2017", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 67, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/2ae7574559cc2857c0ac51469d3cd29e-98.jpg", "descriptions": "Race on 18 official tracks and in the MXoN with all riders and bikes from the 2016 MXGP and MX2 seasons and be the first to experience the thrill of riding one of the 10 2-strokes available. Render your rider and your bike unique, with more than 300 official components for a complete customisation."}, {"name": "Tycoon City: New York", "details_link": "https://www.metacritic.com/game/pc/tycoon-city-new-york", "publisher": "Atari", "release_date": "Feb 21 2006", "developers": ["Deep Red"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 67, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/1ea542b62d7c6238d484c89e6c04990c-98.jpg", "descriptions": "Here's your chance to make it big in the Big Apple… New York City, the city that never sleeps! Go for broke building your own Manhattan empire, creating and customizing over 100 types of major businesses: run a hot nightclub, oversee a media conglomerate, open a lucrative Broadway theater —Here's your chance to make it big in the Big Apple… New York City, the city that never sleeps! Go for broke building your own Manhattan empire, creating and customizing over 100 types of major businesses: run a hot nightclub, oversee a media conglomerate, open a lucrative Broadway theater — the choices are endless. As your success grows, so will your reputation — your face on TV reports, your name in lights, and the city at your feet. With world-renowned landmarks, true-to-life neighborhoods, and spectacular New York events, you’re constantly in the thick of the action, becoming a major mogul in America’s most exciting metropolis. High-profile industries, real-world brands, and a bustling 24-hour city give every player the chance to make it big. [Atari]… Expand"}, {"name": "CounterSpy", "details_link": "https://www.metacritic.com/game/playstation-4/counterspy", "publisher": "SCEA", "release_date": "Aug 19 2014", "developers": ["Dynamighty"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "General"], "meta_score": 67, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/991663134b67131eeaf231bc71b75d66-98.jpg", "descriptions": "Synthesizing the spy mythology and unique aesthetics of the 50's and 60's and set during the Cold War, CounterSpy highlights the rogue third spy agency, C.O.U.N.T.E.R., which keeps the globe's superpowers at bay. As each side of the ongoing conflict nears the unleashing of a blow ofSynthesizing the spy mythology and unique aesthetics of the 50's and 60's and set during the Cold War, CounterSpy highlights the rogue third spy agency, C.O.U.N.T.E.R., which keeps the globe's superpowers at bay. As each side of the ongoing conflict nears the unleashing of a blow of earthshaking proportions, C.O.U.N.T.E.R. takes action, furtively subverting their plans and maintaining world peace with subterfuge.… Expand"}, {"name": "Resident Evil 6", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-6", "publisher": "Capcom", "release_date": "Oct  2 2012", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 67, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/3/94e21a73f802aa96beee72dbe130ba0e-98.jpg", "descriptions": "Resident Evil 6 is set in 2013, ten years after the original Raccoon City incident. The world is now in turmoil as the C-virus has reached pandemic proportions and threatens to consume the world in a horrific apocalyptic scenario. Under the threat of this global bioterrorist attack, ourResident Evil 6 is set in 2013, ten years after the original Raccoon City incident. The world is now in turmoil as the C-virus has reached pandemic proportions and threatens to consume the world in a horrific apocalyptic scenario. Under the threat of this global bioterrorist attack, our heroes battle to save the world in a story of fear on an unprecedented scale.… Expand"}, {"name": "The Simpsons Road Rage", "details_link": "https://www.metacritic.com/game/gamecube/the-simpsons-road-rage", "publisher": "Electronic Arts", "release_date": "Dec 17 2001", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/2f6f66ed7d7314f7fc2a2e5a404ad1f5-98.jpg", "descriptions": "Mr.  Burns is up to his greedy ways in Simpsons Road Rage, purchasing Springfield's busses and jacking up the fares.  Now, Springfield residents must turn their cars into cabs and work the streets.  Hopefully, making enough money to buy back the busses before the clock runs out.  Choose fromMr.  Burns is up to his greedy ways in Simpsons Road Rage, purchasing Springfield's busses and jacking up the fares.  Now, Springfield residents must turn their cars into cabs and work the streets.  Hopefully, making enough money to buy back the busses before the clock runs out.  Choose from over 30 of your favorite Simpsons characters and brave the jam-packed streets of six huge levels, performing big-air and powerslide stunts.  Compete for passengers in two-player, split screen action.  Go on a road rage, Simpsons-style.  … Expand"}, {"name": "Help Will Come Tomorrow", "details_link": "https://www.metacritic.com/game/pc/help-will-come-tomorrow", "publisher": "Klabater", "release_date": "Apr 21 2020", "developers": ["Arclight Creations"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/1f836f9ba0bf8d2f71f300598a80682b-98.jpg", "descriptions": "In a uninhabitable Siberian wilderness, in a wake of October Revolution, a group of passengers survives the mysterious catastrophe of Trans-Siberian railway train. They must endure in a harsh ice-clad climate until rescue arrives. Facing many dangers, their own weaknesses and, above all,In a uninhabitable Siberian wilderness, in a wake of October Revolution, a group of passengers survives the mysterious catastrophe of Trans-Siberian railway train. They must endure in a harsh ice-clad climate until rescue arrives. Facing many dangers, their own weaknesses and, above all, their own prejudice.… Expand"}, {"name": "Elli", "details_link": "https://www.metacritic.com/game/switch/elli", "publisher": "Bandana Kid", "release_date": "Jan 10 2019", "developers": ["Bandana Kid"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/7490d34dfcc6eb5c8c51f80f676d4e6b-98.jpg", "descriptions": "A whimsical hand-crafted single-player adventure. Discover a delightful world, inhabited by the playful and usually helpful Mandragora. Collect gems and and hidden coins and exchange them for a variety of robes, staffs and hats. Simple pick up and play controls, suitable for kids and bigA whimsical hand-crafted single-player adventure. Discover a delightful world, inhabited by the playful and usually helpful Mandragora. Collect gems and and hidden coins and exchange them for a variety of robes, staffs and hats. Simple pick up and play controls, suitable for kids and big kids! Elli is a psuedo-isometric 3D puzzle-platformer. Journey through a varied and whimsical world solving a variety of puzzles, avoiding pitfalls and meeting a cast of characters, explore to find hidden items to switch up your appearance, all while chasing down the mysterious Ghasti!… Expand"}, {"name": "Urban Trial Freestyle 2", "details_link": "https://www.metacritic.com/game/3ds/urban-trial-freestyle-2", "publisher": "Tate Multimedia", "release_date": "Mar 30 2017", "developers": ["Teyon", "Tate Multimedia"], "platforms": "3DS", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/9715507c299aa69823541cac5a23d4c9-98.jpg", "descriptions": "Pull off insane stunts on top of skyscrapers, speed down busy highways and take an intense ride through the suburbs while competing with others to get to the top of the leaderboards. Raise the bar by making the highest jumps or the most head-spinning flips in Stunt Mode! Try Time Attack andPull off insane stunts on top of skyscrapers, speed down busy highways and take an intense ride through the suburbs while competing with others to get to the top of the leaderboards. Raise the bar by making the highest jumps or the most head-spinning flips in Stunt Mode! Try Time Attack and beat the best time at neck-breaking speeds! Take on the Challenge levels to test your skills. Create your own unique levels in the Track Editor and share them with friends. [Nintendo]… Expand"}, {"name": "Uncanny Valley", "details_link": "https://www.metacritic.com/game/pc/uncanny-valley", "publisher": "Cowardly Creations", "release_date": "Apr 23 2015", "developers": ["Cowardly Creations"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/b7b76bf7acd3a6868cf1bc009e7b0781-98.jpg", "descriptions": "Uncanny Valley is a survival horror game that includes a mix of exploration, puzzle solving and a bit of action with a lot of optional story content. The developers are trying to preserve the old survival horror kind of gameplay instead of following the modern trend of creating a thirdUncanny Valley is a survival horror game that includes a mix of exploration, puzzle solving and a bit of action with a lot of optional story content. The developers are trying to preserve the old survival horror kind of gameplay instead of following the modern trend of creating a third person shooter with horror elements. … Expand"}, {"name": "LEGO Star Wars III: The Clone Wars", "details_link": "https://www.metacritic.com/game/3ds/lego-star-wars-iii-the-clone-wars", "publisher": "LucasArts", "release_date": "Mar 27 2011", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "3DS"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 67, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/27c449676ea9af4ab755d9e0f343a8c3-98.jpg", "descriptions": "LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes,LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes, giving players unique, head-to-head combat and an upgraded level builder, allowing the creation of customized bases and in-game battlefields. Play either as a Jedi or Separatist with all-new character abilities, such as Squad command, Lightsaber slicing, Lightsaber jumps, long distance Jedi attacks and Grapple Tie-Ups, all within a new, easy-to-navigate hub.… Expand"}, {"name": "Mega Man X: Command Mission", "details_link": "https://www.metacritic.com/game/gamecube/mega-man-x-command-mission", "publisher": "Capcom", "release_date": "Sep 21 2004", "developers": ["Capcom"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 67, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/83e9e6e413ba89ebd35a6d7623f98f70-98.jpg", "descriptions": "Mega Man X: Command Mission takes the blue bomber franchise in a whole new direction by adding RPG-style combat.  Your mission is to infiltrate Giga City Island to stop the evil plans of the rioting Liberion Army.  Choose from seven playable characters including Mega Man, Zero, and Axl, andMega Man X: Command Mission takes the blue bomber franchise in a whole new direction by adding RPG-style combat.  Your mission is to infiltrate Giga City Island to stop the evil plans of the rioting Liberion Army.  Choose from seven playable characters including Mega Man, Zero, and Axl, and team up to use three-member attacks.  Upgrade your characters' abilities, attacks, and weapons to put an end to the brewing war.  With cel-shaded characters, stylized environments, and a new \"Cross Order System\" that allows for finishing attacks, the Mega Man series looks to please both fans and gamers new to the franchise.… Expand"}, {"name": "Miitopia", "details_link": "https://www.metacritic.com/game/3ds/miitopia", "publisher": "Nintendo", "release_date": "Jul 28 2017", "developers": ["Nintendo"], "platforms": ["Switch", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General"], "meta_score": 67, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/dee0706e6b85472f31c0660c6f45d29d-98.jpg", "descriptions": "Since the dawn of ever, warriors have banded together to fight evil. Now… Mii characters based on your favorite people must unite to do turn-based battle and save Miitopia. Cast them in roles across the kingdom, manage friendships, and give them jobs with distinct stats, abilities, gear, andSince the dawn of ever, warriors have banded together to fight evil. Now… Mii characters based on your favorite people must unite to do turn-based battle and save Miitopia. Cast them in roles across the kingdom, manage friendships, and give them jobs with distinct stats, abilities, gear, and a custom look. Then behold as awesomeness unfolds. Guide your team of Mii characters on a quest to defeat the Dark Lord and restore the stolen faces of the citizens of Miitopia. As you watch with bated breath, Mii characters will mingle over food, camping, exercise, sleeping arrangements, and yes, combat! In these wild, yet traditional RPG battles, your party’s relationships affect the outcome. Enemies attack while you explore the world map, which is littered with hidden paths and treasures. [Nintendo]… Expand"}, {"name": "Cel Damage", "details_link": "https://www.metacritic.com/game/gamecube/cel-damage", "publisher": "Electronic Arts", "release_date": "Jan  7 2002", "developers": ["Pseudo Interactive"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 67, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/f5609ee610f481c469a4d37342a95272-98.jpg", "descriptions": "PART DEMOLITION DERBY, PART WHACKED-OUT CARTOON COME TO LIFE.\r36 wild, over-the-top weapons\r10 tough 'toons\rDeathmatch, capture-the-flag and gate racing action\r4-person split-screen multiplayer\r12 interactive cartoon worlds"}, {"name": "Guinness World Records: The Videogame", "details_link": "https://www.metacritic.com/game/wii/guinness-world-records-the-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 11 2008", "developers": ["TT Fusion"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "General", "Party / Minigame"], "meta_score": 67, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/92decb98cfd43d97d541e046864c4d35-98.jpg", "descriptions": "Guinness World Recordsis full of amazing world records, giving players the opportunity to become a real world record breaker. The game's quick-fire action challenges can be played solo, in teams, or in competitive multi-player groups. Accessible game mechanics enable anyone to grow theGuinness World Recordsis full of amazing world records, giving players the opportunity to become a real world record breaker. The game's quick-fire action challenges can be played solo, in teams, or in competitive multi-player groups. Accessible game mechanics enable anyone to grow the longest fingernails ever seen; to walk a tightrope across the Grand Canyon; or even eat a jumbo jet. But true skill and dedication will be required to compete at the highest level. The ultimate prize: you may see your name appear in the official Guinness World Records book. [Warner Bros.]… Expand"}, {"name": "The Park", "details_link": "https://www.metacritic.com/game/pc/the-park", "publisher": "Funcom", "release_date": "Oct 27 2015", "developers": ["Funcom"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 67, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/4e6e17b7cf8183fcd6bd7d89527e3eba-98.jpg", "descriptions": "The Park is a single-player horror experience developed by Funcom, set against the backdrop of an amusement park where a dark and sinister secret is just waiting to be uncovered."}, {"name": "High on Life", "details_link": "https://www.metacritic.com/game/xbox-series-x/high-on-life", "publisher": "Squanch Games", "release_date": "Dec 13 2022", "developers": ["Squanch Games"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 67, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/bd07d07ac9ee73a49f768ec4f1b59c2b-98.jpg", "descriptions": "Fresh out of high school with no job and no ambition, you've really got nothing going for you until an alien cartel that wants to get high off humanity invades Earth. Now, you and a team of charismatic talking guns must answer the hero's call and become the deadliest intergalactic bountyFresh out of high school with no job and no ambition, you've really got nothing going for you until an alien cartel that wants to get high off humanity invades Earth. Now, you and a team of charismatic talking guns must answer the hero's call and become the deadliest intergalactic bounty hunter the cosmos has ever seen.Travel to various planets and locations across the cosmos, go up against the nefarious Garmantuous and his gang of goons, collect loot, meet unique characters, and more, in the latest comedy adventure from Justin Roiland!Navigate dynamic and changing worlds that range from a jungle paradise, to a city built inside an asteroid, the hub of the cosmos.Leverage the distinct skills of each gun to defeat a variety of diabolical alien enemies and track down Garmantuous.Complete hunter challenges, meet weird, fun, and hilarious characters, collect an array of alien technology, and more!… Expand"}, {"name": "Secret Files 3", "details_link": "https://www.metacritic.com/game/pc/secret-files-3", "publisher": "Deep Silver", "release_date": "Sep 13 2012", "developers": ["Animation Arts"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/4df789d8c4cc2018a15085310dad13fc-98.jpg", "descriptions": "Secret Files 3 combines a moving story with engaging gameplay, mental challenges, and beautiful locations."}, {"name": "MySims Racing", "details_link": "https://www.metacritic.com/game/ds/mysims-racing", "publisher": "EA Games", "release_date": "Jun 12 2009", "developers": ["EA Games"], "platforms": "DS", "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 67, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/896e03012b1d05d5956c4c22f2bed267-98.jpg", "descriptions": "Race into an all-new adventure with MySims Racing! Test your reflexes, strategy and skill by tricking out cars, completing challenges, and winning championships. Speed up any get-together with 4-player mode. Pick cool race-themed outfits and accessories for your MySim, save Speedville, andRace into an all-new adventure with MySims Racing! Test your reflexes, strategy and skill by tricking out cars, completing challenges, and winning championships. Speed up any get-together with 4-player mode. Pick cool race-themed outfits and accessories for your MySim, save Speedville, and come race with us! Take the race with you! MySims Racing for the Nintendo DS allows you and up to three of your friends to race each other using local wireless or Nintendo Wi-Fi. [Electronic Arts]… Expand"}, {"name": "Men's Room Mayhem", "details_link": "https://www.metacritic.com/game/playstation-vita/mens-room-mayhem", "publisher": "Ripstone", "release_date": "May 21 2013", "developers": ["Sawfly Studios"], "platforms": ["iPhone/iPad", "PlayStation Vita"], "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 67, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/9/8a96ad1ebcbd00a70eb9004ee1127c55-98.jpg", "descriptions": "In Men's Room Mayhem you're hired as the janitor of your very own chaotic men's room."}, {"name": "East India Company", "details_link": "https://www.metacritic.com/game/pc/east-india-company", "publisher": "Paradox Interactive", "release_date": "Jul 28 2009", "developers": ["Nitro Games"], "platforms": "PC", "num_players": "8  Online", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 67, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/2263f6baebc507ee60138f799e3da34f-98.jpg", "descriptions": "In East India Company, players enjoy building the World's most powerful trading empire and engaging in fierce battles in both single player and multiplayer modes. Players fight, manage and rule their trading empires from Europe to the Far East with eight nationalities to choose from:In East India Company, players enjoy building the World's most powerful trading empire and engaging in fierce battles in both single player and multiplayer modes. Players fight, manage and rule their trading empires from Europe to the Far East with eight nationalities to choose from: British, Dutch, French, Danish, Portuguese, Swedish, Italian or Spanish. Starting modestly, you build your fleet, establish connections to far away countries, and keep rival nations at bay. Choose from a wide array of ship classes, including a variety of transport and military vessels. Create diverse fleets and assign each of them specific trading routes. Control and upgrade well situated ports as you form your strategy for domination. Conflicts and wars are inevitable. When hostile fleets engage each other, the spectacular naval battles are fought on a real-time tactical level. Devastating broadsides are fired with a deafening roar and cannon balls tear through enemy ships and their crew. For greater tactical depth, you can, at any point, take direct command of any of your ships and feel the battle close up! Fight against the other European powers to create a trading empire that will rule above all others in this groundbreaking strategy game. [Lighthouse Interactive]… Expand"}, {"name": "Batman: Rise of Sin Tzu", "details_link": "https://www.metacritic.com/game/xbox/batman-rise-of-sin-tzu", "publisher": "Ubisoft", "release_date": "Oct 16 2003", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 67, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/d96b3cc953aa3c701bbaf5c6117e5ba9-98.jpg", "descriptions": "In Batman: Rise of Sin Tzu, Batman faces a new enemy unlike any he has ever faced before.  The faceless foe plunges Gotham City into chaos on the night of the anniversary of Bruce Wayne's parents' murder.  Who is responsible for unleashing havoc on Gotham City?  The truth will be revealedIn Batman: Rise of Sin Tzu, Batman faces a new enemy unlike any he has ever faced before.  The faceless foe plunges Gotham City into chaos on the night of the anniversary of Bruce Wayne's parents' murder.  Who is responsible for unleashing havoc on Gotham City?  The truth will be revealed after you battle evil forces and super-villains, including Bane, Clayface, Scarecrow, and the new formidable foe--Sin Tzu.  In addition to Batman's martial arts attacks, Batman has an arsenal including the Batarang, Grappling Hook, and Smoke Bomb.… Expand"}, {"name": "The Godfather II", "details_link": "https://www.metacritic.com/game/playstation-3/the-godfather-ii", "publisher": "Electronic Arts", "release_date": "Apr  7 2009", "developers": ["EA Redwood Shores"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action Adventure", "Adventure", "Third-Person", "Historic", "Linear", "Open-World", "Modern"], "meta_score": 67, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/b6d89d5a3ca0818be67642f78e2d8a01-98.jpg", "descriptions": "After being promoted by Michael Corleone to Don of New York, players expand to new cities, as they build up their families through extorting businesses, monopolizing illegal crime rings and defeating new families in an effort to become the most powerful mob family in America. To help playersAfter being promoted by Michael Corleone to Don of New York, players expand to new cities, as they build up their families through extorting businesses, monopolizing illegal crime rings and defeating new families in an effort to become the most powerful mob family in America. To help players manage their empire, The Godfather II introduces \"The Don's View\" – an innovative strategy meta-game that allows players to oversee the entire world as they grow the family business. Using the Don's View, players will be able to build, defend and expand their crime rings, while keeping an eye on the movements and plans of the rival families. Players will also learn to master the business of organized crime by building a family of Made Men, hiring crew, handing out orders, and promoting their best men up the ranks. Set in a stunning open-world environment, The Godfather II expands on the popular gameplay mechanics of the first game and doubles down on the series' signature BlackHand control scheme, which now features even more visceral hand-to-hand brutality at your fingertips, introducing a new combo system, pressure tactics and executions. In The Godfather II, players fight alongside their hand-picked crew, who have their own skills and expertise. Each family member specializes in a specific field such as demolitions, arson, engineering, first-aid and more. As The Don you control the family, sending some of your men on missions while heading off into action with others. The combination of strategic organized crime gameplay and brutal BlackHand action promises to set The Godfather II apart from other open-world games. Play The Godfather II online multiplayer modes and become the true Don of Dons. Take your money, weapons, and crew from your single-player experience online and wage mob warfare against up to 16 players from around the world.  Play as one of the family’s crew specialists and put your best strategies to the test as you take over territory and strike back at rivals. Earn upgrades and money that can be used in your single-player experience. [Electronic Arts]… Expand"}, {"name": "Shank", "details_link": "https://www.metacritic.com/game/pc/shank", "publisher": "Electronic Arts", "release_date": "Oct 25 2010", "developers": ["Klei Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/93f08b69d63ecd2434a039c8aff75ed3-98.jpg", "descriptions": "Shank is a new game that a small team at Klei is working on. It's an over-the-top action/adventure, built with all the things that we at Klei are passionate about: amazing control, great animation, immersive environment, and everything else that we feel like, and none of the stuff we don't."}, {"name": "NFL Head Coach 09", "details_link": "https://www.metacritic.com/game/xbox-360/nfl-head-coach-09", "publisher": "Electronic Arts", "release_date": "Sep  3 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Management", "Management", "Sim"], "meta_score": 67, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/db14949a240d58e016a88ee8125e5a64-98.jpg", "descriptions": "NFL Head Coach 09 provides a complete NFL experience, offering a variety of different ways to control an NFL franchise, on and off the field, in-season and off-season.  With strategic game planning features, NFL Head Coach 09 places gamers in the coach's seat by allowing gamers toNFL Head Coach 09 provides a complete NFL experience, offering a variety of different ways to control an NFL franchise, on and off the field, in-season and off-season.  With strategic game planning features, NFL Head Coach 09 places gamers in the coach's seat by allowing gamers to comprehensively scout the opponent, build playbooks, and develop a team that will adapt to the philosophy and system of an NFL franchise. The sideline is your playing field in NFL Head Coach 09 - gamers can make adjustments to plays and game strategies in an instant.  The outcome of every game depends on game-time decisions made on the sideline. Success depends on proper preparation and knowledge of the opposing teams’ strategies, as well as expert and timely play calling. [Electronic Arts]… Expand"}, {"name": "The Council - Episode 2: Hide and Seek", "details_link": "https://www.metacritic.com/game/playstation-4/the-council---episode-2-hide-and-seek", "publisher": "Focus Home Interactive", "release_date": "May 15 2018", "developers": ["Big Bad Wolf"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 67, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/1eda5b0b3a68a82bf5eb96533eb9bb46-98.jpg", "descriptions": "Hide and Seek is the second episode of The Council’s 5-episode season. Get the full experience with the Season Pass. Episode 1: The Mad Ones is required to run this episode or the Season Pass. Louis de Richet is on Lord Mortimer’s island where he is still in search of his mother. Here he hasHide and Seek is the second episode of The Council’s 5-episode season. Get the full experience with the Season Pass. Episode 1: The Mad Ones is required to run this episode or the Season Pass. Louis de Richet is on Lord Mortimer’s island where he is still in search of his mother. Here he has met a collection of the most influential people alive, invited to help reshape the world. His investigation is interrupted by tragic events on the second night in the mansion, meaning Louis must answer to the enigmatic Lord Mortimer. Meanwhile the Spanish head of state joins the guests and brings news that threatens the stability of all of Europe - Louis must pick a side as factions begin to form.… Expand"}, {"name": "Outcast: Second Contact", "details_link": "https://www.metacritic.com/game/xbox-one/outcast-second-contact", "publisher": "Maximum Games", "release_date": "Nov  7 2017", "developers": ["Appeal", "Bigben Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 67, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/844fa3b9eb038ae23a214ae71f2a5022-98.jpg", "descriptions": "Outcast: Second Contact is an open world action-adventure game taking the player to an extra-terrestrial planet as dangerous as it is beautiful. You take the role of Cutter Slade, an elite soldier sent on a mission to Adelphi, home of an ancient and advanced alien civilisation. Your choicesOutcast: Second Contact is an open world action-adventure game taking the player to an extra-terrestrial planet as dangerous as it is beautiful. You take the role of Cutter Slade, an elite soldier sent on a mission to Adelphi, home of an ancient and advanced alien civilisation. Your choices and actions will determine humanity's survival.Outcast: Second Contact is the complete remaster of the cult game Outcast. The first open, 3D world in the history of video games and a true pioneer in the action-adventure genre -- the original game won over 100 awards including adventure game of the year!… Expand"}]