[{"name": "Everhood", "details_link": "https://www.metacritic.com/game/switch/everhood", "publisher": "Surefire.Games", "release_date": "Mar  4 2021", "developers": ["Foreign Gnomes"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/f8df3f06328b9f025b74ac13aa7d1170-98.jpg", "descriptions": "An UNCONVENTIONAL ADVENTURE RPG that takes place in an inexpressible world filled with amusing musical battles and strange delightful encounters. To put it simply: You are in for a ride."}, {"name": "Operencia: The Stolen Sun", "details_link": "https://www.metacritic.com/game/switch/operencia-the-stolen-sun", "publisher": "Zen Studios", "release_date": "Mar 31 2020", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/e928b92cd5a5be3afb1459b0e7f3b380-98.jpg", "descriptions": "Operencia: The Stolen Sun embraces everything you love about classic first-person dungeon-crawlers, enhancing the old-school turn-based RPG experience with modern sensibilities. Gather your team of memorable characters and guide them through a world inspired by Central European mythology,Operencia: The Stolen Sun embraces everything you love about classic first-person dungeon-crawlers, enhancing the old-school turn-based RPG experience with modern sensibilities. Gather your team of memorable characters and guide them through a world inspired by Central European mythology, where history meets legend. Unreal Engine 4 powers breathtaking environments, from traditional tombs and dungeons to enchanted castles and a forest made of copper. … Expand"}, {"name": "Wunderling", "details_link": "https://www.metacritic.com/game/switch/wunderling", "publisher": "Retroid", "release_date": "Mar  5 2020", "developers": ["Retroid"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/dbd9ab621fc2d2cfb4ae73942999753d-98.jpg", "descriptions": "Take control of the Wunderling, a low-level video game goon who has just unlocked the power to jump. Unable to stop or change direction at will, you will need to plan ahead and master the Wunderlings’ abilities to navigate treacherous scrolling levels and chase down that pesky Hero."}, {"name": "SteamWorld Heist", "details_link": "https://www.metacritic.com/game/pc/steamworld-heist", "publisher": "Image & Form", "release_date": "Jun  7 2016", "developers": ["Image & Form"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/724e31b49bcdac1ae07858fafb274eac-98.jpg", "descriptions": "Join Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier byJoin Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier by upgrading your robots with unique abilities, weapons – and even stylish hats!… Expand"}, {"name": "OutRun 2006: Coast 2 Coast", "details_link": "https://www.metacritic.com/game/pc/outrun-2006-coast-2-coast", "publisher": "Sega", "release_date": "Jun 27 2006", "developers": ["Sumo Digital"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/16f10f4956b1d40b43dde7aad1cd9d38-98.jpg", "descriptions": "OutRun 2006: Coast to Coast features a choice of 15 fully licensed Ferrari models, featuring the all-new F430 and F430 Spider, as well as the dazzling Superamerica and the stunning 550 Barchetta. Power your way across 15 new American themed environments from the \"OutRun2 SP\" arcadeOutRun 2006: Coast to Coast features a choice of 15 fully licensed Ferrari models, featuring the all-new F430 and F430 Spider, as well as the dazzling Superamerica and the stunning 550 Barchetta. Power your way across 15 new American themed environments from the \"OutRun2 SP\" arcade experience. Race from coast to glorious coast with a fresh new mission structure, a license mode and online play, with up to 6 players for a thrilling head-to-head journey. [Sega]… Expand"}, {"name": "Peter Jackson's King Kong: The Official Game of the Movie", "details_link": "https://www.metacritic.com/game/gamecube/peter-jacksons-king-kong-the-official-game-of-the-movie", "publisher": "Ubisoft", "release_date": "Nov 21 2005", "developers": ["Ubisoft Montpellier"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/8d35c58bdacee009f302620d0d0d3aa9-98.jpg", "descriptions": "Play as man or beast in Peter Jackson's King Kong: The Official Game of the Movie. You can be King Kong or Jack Driscoll as you follow a story based on the movie. Peter Jackson, the director of the 2005 movie, also took an active role in developing the game, which expands upon the movie'sPlay as man or beast in Peter Jackson's King Kong: The Official Game of the Movie. You can be King Kong or Jack Driscoll as you follow a story based on the movie. Peter Jackson, the director of the 2005 movie, also took an active role in developing the game, which expands upon the movie's storyline, adding new creatures and locations. The game employs a cinematic style that makes the game more immersive and less like a traditional video game.… Expand"}, {"name": "echochrome", "details_link": "https://www.metacritic.com/game/playstation-3/echochrome", "publisher": "SCEA", "release_date": "May  1 2008", "developers": ["SCE/WWS", "SCE Japan Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "PlayStation 3"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "General"], "meta_score": 81, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/44a84b2dc93296c29c3e31a991b414e1-98.jpg", "descriptions": "(Downloadable Game)  Featuring an elegant black and white art design inspired by the works of M.C. Escher, echochrome is a puzzle game unlike any other. With gameplay based on optical illusions, players must utilize five simple laws of perspective to join walkways, hide dangers, and create(Downloadable Game)  Featuring an elegant black and white art design inspired by the works of M.C. Escher, echochrome is a puzzle game unlike any other. With gameplay based on optical illusions, players must utilize five simple laws of perspective to join walkways, hide dangers, and create new paths to reach the \"echos,\" or shadow guides. Once you've mastered the five laws, use them to create your own mind-bending levels to play and share with friends using the custom level editor. Master perspective puzzles based on optical illusions across 56 challenging levels that are exclusive to the PS3 version. [Sony]… Expand"}, {"name": "Blur", "details_link": "https://www.metacritic.com/game/pc/blur", "publisher": "Activision", "release_date": "May 25 2010", "developers": ["Bizarre Creations"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/013012b85566792492fb76be39e5e68f-98.jpg", "descriptions": "Blur is a new style of powered-up racing. The game drops players into heart-pumping racing action with 20 cars on a track all targeting the finish line and battling each other as they trade paint and collect intense power-ups, including the ability to blast other cars out of the way withBlur is a new style of powered-up racing. The game drops players into heart-pumping racing action with 20 cars on a track all targeting the finish line and battling each other as they trade paint and collect intense power-ups, including the ability to blast other cars out of the way with huge bursts of energy, boost their speed, and more. Gamers can use offensive and defensive attacks as they battle for the lead and careen through real-world track locations ranging from L.A. and San Francisco to the streets of Hackney, UK and the treacherous roads of Barcelona, Spain. Beyond the action-packed racing filled with fast curves, sneaky alternate routes, hair-raising jumps and fully realized damage models that provide for spectacular crashes, Blur’s narrative is presented through Bizarre’s new community-based interface, reaching far beyond the game itself. This unique story-driving social network evolves dynamically as players compete in different races, make new friends, rivals and fans, and connect with other racers both in-game and in real life. Looking beyond Blur's single player story, gamers can engage in competitive and team-based multiplayer races with up to 20 players online, or on a single console via 4-player split-screen. Bizarre has also introduced Blur’s original social gaming experience - Custom Groups, where anyone can create unique multiplayer modes based on their favorite ways to play the game. These new modes are immediately shared through Blur’s social network, expanding the game in ways that are only limited by the gaming community’s creativity. [Activision]… Expand"}, {"name": "LEGO Batman 2: DC Super Heroes", "details_link": "https://www.metacritic.com/game/playstation-3/lego-batman-2-dc-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 19 2012", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/0ba8694176f5040500f9aa295bd9d9d0-98.jpg", "descriptions": "Lego Batman 2: DC Super Heroes is a sequel to Lego Batman: The Videogame and includes appearances from the likes of Wonder Woman, Superman, and The Green Lantern."}, {"name": "Fly Together!", "details_link": "https://www.metacritic.com/game/switch/fly-together!", "publisher": "Northplay ApS", "release_date": "Apr 29 2021", "developers": ["Northplay ApS"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/20976e6f2a0d288598a4cd73d43e3d7c-98.jpg", "descriptions": "Fly TOGETHER! is a multiplayer game of explosive airplane action that will challenge your inner air traffic controller. The sequel to the award winning Conduct TOGETHER! takes players to the skies in a race against time to bring passengers safely to their destination by drawing flight pathsFly TOGETHER! is a multiplayer game of explosive airplane action that will challenge your inner air traffic controller. The sequel to the award winning Conduct TOGETHER! takes players to the skies in a race against time to bring passengers safely to their destination by drawing flight paths and avoiding collisions in increasingly challenging action-puzzles. Fly Solo or hand a Joy-Con™ to your friends and co-pilot through an expansive campaign. Complete contracts, upgrade your airport and collect a growing fleet of airplanes.\r Fly against your friends in hectic up-to-8-player battles: throw meteors, invoke tornadoes or drop a giant cake on your opponents. The pilot who gets the most passengers safely to their destination wins.\r Here’s some rad things in this game\r • Pilot planes in a beautiful 3D world with handheld, stick and motion controls.\r• Simple and intuitive gameplay for everyone\r• Seamlessly shift between single and multiplayer. Play as the solo pilot or pass the Joy-Con™ to friends for up to 8 players\r• Transport passengers, earn coins and unlock new airplanes\r• Progress through exotic islands with unique themes\r• Fantastic soundtrack by composer Mikkel Gemzøe\r• From the Award winning team that brought you Conduct TOGETHER!\r… Expand"}, {"name": "Helldivers", "details_link": "https://www.metacritic.com/game/playstation-4/helldivers", "publisher": "SCEA", "release_date": "Mar  3 2015", "developers": ["Arrowhead Game Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Shooter", "Sci-Fi", "Sci-Fi", "Action", "Shooter", "Third-Person", "Shoot-'Em-Up", "Arcade", "Top-Down"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/15f91837dc50d0ef0113c74a0b90575d-98.jpg", "descriptions": "Set in a dystopian future, players fight to protect \"Super Earth\" where a managed democracy has mussed the lines between military and government rule. We are losing the war, and the HELLDIVERS are the last line of defense against three invading enemy species."}, {"name": "Mega Man Anniversary Collection", "details_link": "https://www.metacritic.com/game/gamecube/mega-man-anniversary-collection", "publisher": "Capcom", "release_date": "Jun 22 2004", "developers": ["Atomic Planet Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/1/882d3b9ba12ee5b14628aa111c1ff2dd-98.jpg", "descriptions": "For 15 years, Mega Man games have appeared on consoles, and now you can play ten of them on one disc.  Mega Man Anniversary Collection includes the first eight Mega Man games plus two that were never-before-released in the U.S.  See how Mega Man has crossed into other media by watchingFor 15 years, Mega Man games have appeared on consoles, and now you can play ten of them on one disc.  Mega Man Anniversary Collection includes the first eight Mega Man games plus two that were never-before-released in the U.S.  See how Mega Man has crossed into other media by watching unlockable bonus features, including footage from the original Mega Man TV Series, over 30 original artwork selections, and remixed music tracks inspired by the series.  … Expand"}, {"name": "The Sims Bustin' Out", "details_link": "https://www.metacritic.com/game/gamecube/the-sims-bustin-out", "publisher": "EA Games", "release_date": "Dec 15 2003", "developers": ["Maxis"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "The Sims are making a big return to the console and this time they are bustin' out of the house and exploring all-new locations around town.  In The Sims Bustin' Out, players can choose from a variety of new career paths.  Along the way, players can unlock and collect over a hundred of newThe Sims are making a big return to the console and this time they are bustin' out of the house and exploring all-new locations around town.  In The Sims Bustin' Out, players can choose from a variety of new career paths.  Along the way, players can unlock and collect over a hundred of new objects and social moves exclusive to the console.  Play, work, and socialize with a cast of over 25 new outrageous characters and climb through a dozen new careers.  The Sims Bustin' Out also features new integrated two-player gameplay and memory card support, for those players who like to take their Sims over to a friend's house and show them off.… Expand"}, {"name": "Empires: Dawn of the Modern World", "details_link": "https://www.metacritic.com/game/pc/empires-dawn-of-the-modern-world", "publisher": "Activision", "release_date": "Oct 21 2003", "developers": ["Stainless Steel Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/3c8347f7daad1b616e477a8bca201dc8-98.jpg", "descriptions": "From renowned game designer Rick Goodman and respected game developer Stainless Steel Studios comes a detailed RTS that lets you completely command unique, historically accurate civilizations?from China to Germany and the United States. From the Middle Ages to World War II, lead your nationFrom renowned game designer Rick Goodman and respected game developer Stainless Steel Studios comes a detailed RTS that lets you completely command unique, historically accurate civilizations?from China to Germany and the United States. From the Middle Ages to World War II, lead your nation to dominate the globe. Each civilization's strengths and weaknesses affect the gameplay experience. Your ability to adapt to these differences is only one of the challenges you will face as a world leader. [Activision]… Expand"}, {"name": "Chessmaster 9000", "details_link": "https://www.metacritic.com/game/pc/chessmaster-9000", "publisher": "Ubisoft", "release_date": "Aug 31 2002", "developers": ["Ubisoft"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/16865bf00aaa59fdfdbdae076d37daf5-98.jpg", "descriptions": "Chessmaster 9000 builds on the strong foundation of its predecessors by adding many new tools to help players master the game of chess, including a new course on the Psychology of Competition by International Master Josh Waitzkin, a new Endgame Quiz from five-time chess champ and GrandChessmaster 9000 builds on the strong foundation of its predecessors by adding many new tools to help players master the game of chess, including a new course on the Psychology of Competition by International Master Josh Waitzkin, a new Endgame Quiz from five-time chess champ and Grand Master Larry Evans, and a new Blunder Alert feature that immediately notifies players of better moves when they move their pieces into danger. Additionally, new online features include a free matchmaking service via ubi.com, special chat events, and rated games online. [Ubi Soft]… Expand"}, {"name": "Gothic", "details_link": "https://www.metacritic.com/game/pc/gothic", "publisher": "Xicat Interactive", "release_date": "Nov 23 2001", "developers": ["Piranha Bytes"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/5fd56b1ae3af0f906040c992e3970158-98.jpg", "descriptions": "War has decimated the land, Orc Hordes are invading human territory and the king of the land needs a lot of ore to forge enough weapons for his army to stand against this threat. Prisoners from all over the empire are imprisoned in a large magical sphere where they have to work in the minesWar has decimated the land, Orc Hordes are invading human territory and the king of the land needs a lot of ore to forge enough weapons for his army to stand against this threat. Prisoners from all over the empire are imprisoned in a large magical sphere where they have to work in the mines for the king. You are thrown into the sphere to give a letter to the high mages, this letter may be the turning point on the war against the Orcs. [Xicat Interactive]… Expand"}, {"name": "Arcanum: Of Steamworks and Magick Obscura", "details_link": "https://www.metacritic.com/game/pc/arcanum-of-steamworks-and-magick-obscura", "publisher": "Sierra Entertainment", "release_date": "Aug 22 2001", "developers": ["Troika Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 81, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/7f4869e72e98add8eb5dabe181ab77db-98.jpg", "descriptions": "Populated with elves, orcs, humans, dwarves, gnomes, and halflings, Arcanum, a Tolkienesque fantasy world, exists in an unsteady equilibrium between the emergence of industrialized cities and the decline of magic.  This debut RPG from the core \"Fallout\" team finds the player \"on vacation\"Populated with elves, orcs, humans, dwarves, gnomes, and halflings, Arcanum, a Tolkienesque fantasy world, exists in an unsteady equilibrium between the emergence of industrialized cities and the decline of magic.  This debut RPG from the core \"Fallout\" team finds the player \"on vacation\" when he becomes responsible for the fate of this world.… Expand"}, {"name": "NASCAR Heat", "details_link": "https://www.metacritic.com/game/pc/nascar-heat", "publisher": "Hasbro Interactive", "release_date": "Sep 27 2000", "developers": ["Monster Games Inc."], "platforms": "PC", "num_players": "1-16 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/ace097439bbb5f64cfc0dd3f9ed5eef9-98.jpg", "descriptions": "NASCAR Heat offers a brutally honest driving experience, but with simplistic damage modeling."}, {"name": "Professor Layton and the Azran Legacy", "details_link": "https://www.metacritic.com/game/3ds/professor-layton-and-the-azran-legacy", "publisher": "Nintendo", "release_date": "Feb 28 2014", "developers": ["Level 5"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["General", "Logic", "Puzzle", "Miscellaneous", "Puzzle", "General"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/5ee912dfafe942a72b1a29d76ee4a624-98.jpg", "descriptions": "As the memories of Monte d'Or fade into the past, Professor Layton receives a letter from a like-minded archaeologist, Professor Desmond Sycamore. In it, Sycamore claims to have discovered a 'living mummy' and suggests Layton should see it for himself. Intrigued, the professor and hisAs the memories of Monte d'Or fade into the past, Professor Layton receives a letter from a like-minded archaeologist, Professor Desmond Sycamore. In it, Sycamore claims to have discovered a 'living mummy' and suggests Layton should see it for himself. Intrigued, the professor and his companions, Luke and Emmy, head for the town of Froenborg to investigate... [Nintendo UK]… Expand"}, {"name": "Company of Heroes 2: Ardennes Assault", "details_link": "https://www.metacritic.com/game/pc/company-of-heroes-2-ardennes-assault", "publisher": "Sega", "release_date": "Nov 17 2014", "developers": ["Relic", "Sega", "Relic Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Historic"], "meta_score": 81, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/ec4adb48285c84c20947a9fccd919fae-98.jpg", "descriptions": "Assume control of US Allied forces as they face tactical challenges and harrowing terrain during a surprise offensive manoeuvre led by the relentless resurgent Oberkommando West. Watch the dramatic Battle of the Bulge unfold through the eyes of 3 different Officers."}, {"name": "PlanetSide", "details_link": "https://www.metacritic.com/game/pc/planetside", "publisher": "Sony Online Entertainment", "release_date": "May 20 2003", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Sci-Fi", "Sci-Fi"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/80bbe1ac32203323f58abfda3224cb80-98.jpg", "descriptions": "PlanetSide is a Massively Multiplayer Online First-Person Shooter involving thousands of players fulfilling all the roles needed to wage war across the face of ten gigantic continents. The war involves infantry, ground vehicles, and air battles in a science-fiction setting. Gamers play asPlanetSide is a Massively Multiplayer Online First-Person Shooter involving thousands of players fulfilling all the roles needed to wage war across the face of ten gigantic continents. The war involves infantry, ground vehicles, and air battles in a science-fiction setting. Gamers play as any of the three global empires, each group struggling against one another to dominate each base, continent, and ultimately, the planet, for their Empire. [Sony Online Entertainment]… Expand"}, {"name": "Tales From The Borderlands: Episode 3 - Catch A Ride", "details_link": "https://www.metacritic.com/game/pc/tales-from-the-borderlands-episode-3---catch-a-ride", "publisher": "Telltale Games", "release_date": "Jun 23 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/9c0389914535f702d17815be5dbdf7b3-98.jpg", "descriptions": "After a dizzying escape from a near-almost-certain-death scenario (involving statuesque buttocks), Rhys and Fiona are in search of another piece of the puzzle that will lead them to the vast riches of Vault key ownership. Lost in the mysterious jungle of an Atlas terraforming facility, FionaAfter a dizzying escape from a near-almost-certain-death scenario (involving statuesque buttocks), Rhys and Fiona are in search of another piece of the puzzle that will lead them to the vast riches of Vault key ownership. Lost in the mysterious jungle of an Atlas terraforming facility, Fiona finds help from an unexpected mentor, Rhys continues to share brain-space with the disembodied mind of a dead dictator, and love is in the air. Pursued by the ruthless criminal 'Queenpin' Vallory, and with very little help from Vaughn's accountancy skills (or stellar abs), getting anywhere near the Vault is entirely on you.… Expand"}, {"name": "The Walking Dead: Season Two Episode 2 - A House Divided", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-season-two-episode-2---a-house-divided", "publisher": "Telltale Games", "release_date": "Mar  4 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/90eea3298eea70978b7ea3cba7931e1e-98.jpg", "descriptions": "Season Two continues the story that began in Season One. You are Clementine, a young survivor in a world gone to hell. The dead have risen to feast on the living, and the living cannot be trusted. The story you experience in The Walking Dead Season Two is driven by the choices that you make.Season Two continues the story that began in Season One. You are Clementine, a young survivor in a world gone to hell. The dead have risen to feast on the living, and the living cannot be trusted. The story you experience in The Walking Dead Season Two is driven by the choices that you make. Because of that, your story could be very different from someone else’s. If you played Season One and the DLC episode ‘400 Days’, the choices you made there will affect Season Two.… Expand"}, {"name": "Star Wars Jedi Knight II: Jedi Outcast", "details_link": "https://www.metacritic.com/game/xbox/star-wars-jedi-knight-ii-jedi-outcast", "publisher": "LucasArts", "release_date": "Nov 20 2002", "developers": ["Vicarious Visions"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 81, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/d1ba4a00f5e9545bcb80be7463660c89-98.jpg", "descriptions": "In the tradition of Jedi Knight, rebel agent Kyle Katarn returns in thrilling first-person action.  Several years have passed since Kyle avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi.  When a new and menacing threat to the galaxy emerges,In the tradition of Jedi Knight, rebel agent Kyle Katarn returns in thrilling first-person action.  Several years have passed since Kyle avenged his father's death and saved the Valley of the Jedi from Jerec and his band of Dark Jedi.  When a new and menacing threat to the galaxy emerges, Kyle knows he must reclaim his past in order to save his future.  You assume the role of Kyle and employ a unique mix of weapons, Force powers, and your lightsaber in both solo and multiplayer modes.  … Expand"}, {"name": "MotoGP 22", "details_link": "https://www.metacritic.com/game/xbox-series-x/motogp-22", "publisher": "Milestone S.r.l", "release_date": "Apr 21 2022", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 81, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/01d3c731310af9f5346878d0ddd10133-98.jpg", "descriptions": "Explore all the contents of the 2022 season in the MotoGP™ classes and in all the other categories. More than 120 riders, over 20 official circuits and all the excitement of the official championship are waiting for you. And if you want to take a leap into the past, over 70 historicExplore all the contents of the 2022 season in the MotoGP™ classes and in all the other categories. More than 120 riders, over 20 official circuits and all the excitement of the official championship are waiting for you. And if you want to take a leap into the past, over 70 historic champions will let you relive the best of MotoGP™ history.… Expand"}, {"name": "R-Type Dimensions EX", "details_link": "https://www.metacritic.com/game/switch/r-type-dimensions-ex", "publisher": "Tozai Games", "release_date": "Nov 28 2018", "developers": ["Southend Interactive"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Switch"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/2666d54dc78b5f349c45c51ec4c4d876-98.jpg", "descriptions": null}, {"name": "Rune Factory 4 Special", "details_link": "https://www.metacritic.com/game/switch/rune-factory-4-special", "publisher": "XSEED Games", "release_date": "Feb 25 2020", "developers": ["Neverland", "HAKAMA"], "platforms": ["3DS", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "General", "Action RPG"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/ee3d6b9e056faf04d61440eed3c0dc83-98.jpg", "descriptions": "Rune Factory 4 marks the return of the popular Harvest Moon spinoff that combines farming with dungeon adventuring. For the first time in the series, the player can select to play as a male or female hero, and potential suitors of either gender are also available in order to pursue love,Rune Factory 4 marks the return of the popular Harvest Moon spinoff that combines farming with dungeon adventuring. For the first time in the series, the player can select to play as a male or female hero, and potential suitors of either gender are also available in order to pursue love, marriage, and possibly a child. As the newly-appointed prince or princess, you can fulfill your royal duties of protecting the town from invaders, or take a more rural approach to governing by raising your own fruits and vegetables and helping townsfolk. Should some dungeon adventuring be on the days itinerary, you can select from the castles vast armament of swords, spears, and staffs along with magic for battle against dangerous foes, or even bring along a companion or friendly monster to aid you during your travels.… Expand"}, {"name": "Finding Paradise", "details_link": "https://www.metacritic.com/game/pc/finding-paradise", "publisher": "Freebird Games", "release_date": "Dec 14 2017", "developers": ["Freebird Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Japanese-Style"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/1df01205c29b18d98eba54a2e30ad799-98.jpg", "descriptions": "A story-driven experience about two doctors traversing through a dying man's memories to artificially fulfill his last wish."}, {"name": "Kingdoms of Amalur: Reckoning", "details_link": "https://www.metacritic.com/game/pc/kingdoms-of-amalur-reckoning", "publisher": "Electronic Arts", "release_date": "Feb  7 2012", "developers": ["Big Huge Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "Action RPG"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/e6982628efc7257e3e29b65aae76be22-98.jpg", "descriptions": "Immerse yourself in an all-new massive universe from the minds of bestselling author R.A. Salvatore, Spawn creator Todd McFarlane, and Elder Scrolls IV: Oblivion lead designer Ken Rolston. Choose your path and battle through a sprawling world featuring intense, responsive, and customizableImmerse yourself in an all-new massive universe from the minds of bestselling author R.A. Salvatore, Spawn creator Todd McFarlane, and Elder Scrolls IV: Oblivion lead designer Ken Rolston. Choose your path and battle through a sprawling world featuring intense, responsive, and customizable RPG combat.… Expand"}, {"name": "Brothers: A Tale of Two Sons", "details_link": "https://www.metacritic.com/game/playstation-4/brothers-a-tale-of-two-sons", "publisher": "505 Games", "release_date": "Aug 11 2015", "developers": ["Starbreeze"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Linear"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/14c8f289dfb7390d2aba735a6839447d-98.jpg", "descriptions": "Share in the epic journey of two brothers, as they set out to find a cure for their dying father."}, {"name": "Broken Age", "details_link": "https://www.metacritic.com/game/playstation-4/broken-age", "publisher": "Double Fine Productions", "release_date": "Apr 28 2015", "developers": ["Double Fine Productions"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Third-Person", "3D", "Adventure", "Point-and-Click"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/83ae236b9db80f2aaf6580b616d97723-98.jpg", "descriptions": "Broken Age is a point-and-click adventure telling the stories of a young boy and girl leading parallel lives. The girl has been chosen by her village to be sacrificed to a terrible monster--but she decides to fight back. Meanwhile, a boy on a spaceship is living a solitary life under theBroken Age is a point-and-click adventure telling the stories of a young boy and girl leading parallel lives. The girl has been chosen by her village to be sacrificed to a terrible monster--but she decides to fight back. Meanwhile, a boy on a spaceship is living a solitary life under the care of a motherly computer, but he wants to break free to lead adventures and do good in the world. Adventures ensue.… Expand"}, {"name": "Life is Strange: Episode 4 - Dark Room", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-episode-4---dark-room", "publisher": "Square Enix", "release_date": "Jul 28 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/a2359dc8f1e492209cf585f06fc7958e-98.jpg", "descriptions": "Darkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become theDarkroom follows the antics of series protagonist, Max, as she attempts to uncover the mystery behind the disappearance of Rachel Amber and get to the bottom of the bizarre happenings in Arcadia Bay. With the ‘End of the World’ party on the horizon, time is running out for Max to become the saviour of the town.… Expand"}, {"name": "WindJammers", "details_link": "https://www.metacritic.com/game/switch/windjammers", "publisher": "DotEmu", "release_date": "Oct 23 2018", "developers": ["Data East", "DotEmu"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch"], "num_players": "2 ", "genres": ["Sports", "Individual", "Other"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/19bd6c515ffa343ad5dcc291267211fc-98.jpg", "descriptions": "A dazzling new game combining the thrills of tennis, the dangers of the discus, and the heart-stopping competition of competition sports. Six of the world's toughest and most clever athletes take court in the most thrilling new sport of the fin-de-seicle! WINDJAMMERS - It will blow you away!"}, {"name": "Tiger Woods PGA Tour 06", "details_link": "https://www.metacritic.com/game/xbox/tiger-woods-pga-tour-06", "publisher": "EA Sports", "release_date": "Sep 20 2005", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 81, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/41406c592ce680f5f8a46e938ab14108-98.jpg", "descriptions": "Tiger Woods 06 pits you against Tiger Woods in a battle to be the best golfer of all time. You can play golf greats in their own eras on their terms to prove that you are the best ever. Tiger Woods 06 includes greater shot control and a \"gamebreaker\" meter that models the momentumTiger Woods 06 pits you against Tiger Woods in a battle to be the best golfer of all time. You can play golf greats in their own eras on their terms to prove that you are the best ever. Tiger Woods 06 includes greater shot control and a \"gamebreaker\" meter that models the momentum of professional golf competition. You can play on 15 courses, both licensed and fantastical. \"Game face\" features return to let you customize a character and take him or her through an entire 52-week PGA season. Tiger Woods 06 also adds more multiplayer modes and capabilities.… Expand"}, {"name": "Boomerang X", "details_link": "https://www.metacritic.com/game/pc/boomerang-x", "publisher": "DANG!", "release_date": "Jul  8 2021", "developers": ["DANG!"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/25b389d6192d1a4e2decf04e3afbb6ef-98.jpg", "descriptions": "Harness the power of a mystical boomerang to fling yourself through the air. Slice, fly, and blast through arenas swarming with evil creatures. Stay agile or meet your doom. \r\rFight otherworldly forces and look cool doing it. Impress the boomerang with stylish tricks and it'll grant youHarness the power of a mystical boomerang to fling yourself through the air. Slice, fly, and blast through arenas swarming with evil creatures. Stay agile or meet your doom. \r\rFight otherworldly forces and look cool doing it. Impress the boomerang with stylish tricks and it'll grant you stranger powers - powers that'll let you defeat the forces of the depths with greater ease. Kaspidae smiles upon you and your killer moves...… Expand"}, {"name": "Sam & Max: The Devil's Playhouse - Episode 1: The Penal Zone", "details_link": "https://www.metacritic.com/game/pc/sam-max-the-devils-playhouse---episode-1-the-penal-zone", "publisher": "Telltale Games", "release_date": "Apr 15 2010", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "3D", "Compilation", "Third-Person"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/c2829fd2803387cb4177ad7bcc5789b7-98.jpg", "descriptions": "An otherworldly power for controlling matter and space calls to the strongest and strangest who might wield it -- intergalactic warlords and eldritch gods, under-dwellers and scholars of the arcane. Gaming's greatest dog and rabbit sleuths Sam & Max seek the power's ancient secrets, as manicAn otherworldly power for controlling matter and space calls to the strongest and strangest who might wield it -- intergalactic warlords and eldritch gods, under-dwellers and scholars of the arcane. Gaming's greatest dog and rabbit sleuths Sam & Max seek the power's ancient secrets, as manic Max gains shape shifting, teleportation, mind reading and future vision abilities for battling these foes.… Expand"}, {"name": "Sunset Overdrive", "details_link": "https://www.metacritic.com/game/xbox-one/sunset-overdrive", "publisher": "Microsoft Game Studios", "release_date": "Oct 28 2014", "developers": ["Insomniac Games"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 8 ", "genres": ["General", "Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/359a4906b91ce8b853fb2a3b88f4df74-98.jpg", "descriptions": "An open world with no rules: only riots. Sunset Overdrive is an ever-changing open-world game set in the not-so-distant future. A catastrophic event has left your city overrun by mutants. While the majority perish or transform, you have learned to flourish. It turns out your calling isn'tAn open world with no rules: only riots. Sunset Overdrive is an ever-changing open-world game set in the not-so-distant future. A catastrophic event has left your city overrun by mutants. While the majority perish or transform, you have learned to flourish. It turns out your calling isn't picking up trash or serving food, it is mutant destruction. With an arsenal of kick-ass, overpowered weapons and a knack for traversing the city with hyper agility, its not the end of days for you. Your story has only begun.… Expand"}, {"name": "Super Time Force", "details_link": "https://www.metacritic.com/game/xbox-360/super-time-force", "publisher": "Capybara Games", "release_date": "May 14 2014", "developers": ["Capy Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Xbox 360"], "genres": ["Action", "Platformer", "Shooter", "2D", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 81, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/8768bdac0d74c1117113443ae8f32432-98.jpg", "descriptions": "Super Time Force is a frantic, hyper-action videogame filled with total mayhem, total madness and total non-stop shooty-shooty-bam-bam destruction. And yet, it also has super sweet, soothing, perhaps even sublime, moments of sloooow motion. Every level in Super Time Force contains 3Super Time Force is a frantic, hyper-action videogame filled with total mayhem, total madness and total non-stop shooty-shooty-bam-bam destruction. And yet, it also has super sweet, soothing, perhaps even sublime, moments of sloooow motion. Every level in Super Time Force contains 3 mysterious inter-dimensional objects called Shards, which can be used to control the flow of time, slowing it down like velvety smooth molasses, allowing players to unleash a truly heroic level of dodging, weaving, sniping and precision acrobatics.… Expand"}, {"name": "Toy Soldiers", "details_link": "https://www.metacritic.com/game/xbox-360/toy-soldiers", "publisher": "Microsoft Game Studios", "release_date": "Mar  3 2010", "developers": ["Signal Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Wargame", "Real-Time", "General"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/bedd9599760eaa0649e71364e5f5f89e-98.jpg", "descriptions": "[Xbox Live Arcade]  Put your foot soldiers, snipers, cavalry, and fighter pilots to the test in Toy Soldiers. Poised to be a smash hit on Xbox LIVE® Arcade, Toy Soldiers is an action-packed strategy-based game in which players command antique WWI toy soldiers vying for control of the[Xbox Live Arcade]  Put your foot soldiers, snipers, cavalry, and fighter pilots to the test in Toy Soldiers. Poised to be a smash hit on Xbox LIVE® Arcade, Toy Soldiers is an action-packed strategy-based game in which players command antique WWI toy soldiers vying for control of the trench-filled battlefields of Europe. Deploy an exciting arsenal such as tanks, cavalry, biplanes, and flamethrowers in vintage WWI toy dioramas. Developed by Signal Studios exclusively for Xbox 360, Toy Soldiers allows you to take control of individual units or control the entire battlefield from a strategic view. Integrating multiple game genres and world-class visuals, Toy Soldiers is a unique and action-packed entertainment experience. [Xbox.com]… Expand"}, {"name": "Life is Strange: True Colors", "details_link": "https://www.metacritic.com/game/playstation-5/life-is-strange-true-colors", "publisher": "Square Enix", "release_date": "Sep 10 2021", "developers": ["Deck Nine Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 81, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/899815c43b390313368ab77a16e93d8e-98.jpg", "descriptions": "A bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!\r Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees asA bold new era of the award-winning Life is Strange begins, with an all-new playable lead character and a thrilling mystery to solve!\r Alex Chen has long suppressed her 'curse': the supernatural ability to experience, absorb and manipulate the strong emotions of others, which she sees as blazing, colored auras.\r When her brother dies in a so-called accident, Alex must embrace her volatile power to find the truth and uncover the dark secrets buried by a small town.… Expand"}, {"name": "The Legend of Heroes: Trails of Cold Steel IV", "details_link": "https://www.metacritic.com/game/switch/the-legend-of-heroes-trails-of-cold-steel-iv", "publisher": "NIS America", "release_date": "Apr  9 2021", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/b8744c66ef9b466177f062cabb7bac15-98.jpg", "descriptions": "The Erebonian Empire is on the brink of all out war! Taking place shortly after the ending of Trails of Cold Steel III, the heroes of Class VII find themselves against the full force of the Empire in an attempt to stop its path of total domination. Further, the hero of the Erebonian CivilThe Erebonian Empire is on the brink of all out war! Taking place shortly after the ending of Trails of Cold Steel III, the heroes of Class VII find themselves against the full force of the Empire in an attempt to stop its path of total domination. Further, the hero of the Erebonian Civil War and Class VII's instructor, Rean Schwarzer, has gone missing. Now, the students of Class VII, old and new, must unite with heroes from all over the continent to create the only chance the world has to be spared from total destruction.… Expand"}, {"name": "Stormland", "details_link": "https://www.metacritic.com/game/pc/stormland", "publisher": "Insomniac Games", "release_date": "Nov 14 2019", "developers": ["Insomniac Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/c8d98461d2f85efb4b26c18054c63115-98.jpg", "descriptions": "The Tempest shattered your android body. Now you must journey through an ever-changing cloudscape to augment yourself and save your friends. Explore an expansive world with complete freedombound up cliffs, glide across chasms, and fly through the slipstream with velocity. DetonateThe Tempest shattered your android body. Now you must journey through an ever-changing cloudscape to augment yourself and save your friends. Explore an expansive world with complete freedombound up cliffs, glide across chasms, and fly through the slipstream with velocity. Detonate explosives, harness electricity, and wield makeshift weapons to overcome titanium sentries and monolithic guardians. Play single-player, or explore forgotten ruins together.It's time to reclaim your world.Key Features:* Move with velocity. Explore the open world with exhilarating freedom. Fly through the slipstream, kick up a cloud ramp, launch up to a cliff, and glide back down with all-new Touch mechanics.* Discover a changing otherworld. The Tempest rearranges the Stormland to reveal new challengesand new playgrounds of movement, combat, and scavenging. Your Satellite watches from above to guide you to the best upgrades.* Join a community of androids. Weather the storm together. Link up to the satellite, join up for Stormland raids, and collaborate on shared missions for the benefit of android gardeners everywhere.* Fight with freeform style. Equip makeshift weapons to overcome the Tempest's army of synthetic troops and mutated creatures. Augment your android abilities to cloak your body, manifest shields, and harness electricity. Find new tech, build yourself up, and discover just how far you can push past the limits of your design.… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 1: Ties That Bind Part One", "details_link": "https://www.metacritic.com/game/pc/the-walking-dead-the-telltale-series---a-new-frontier-episode-1-ties-that-bind-part-one", "publisher": "Telltale Games", "release_date": "Dec 20 2016", "developers": ["Telltale Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "General", "Adventure", "Point-and-Click"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/7f3c3ff8151b0f280a7c08345d52141c-98.jpg", "descriptions": "When family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken fromWhen family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken from him, you meet a young girl who has experienced her own unimaginable loss. Her name is Clementine, and your fates are bound together in a story where every choice you make could be your last.… Expand"}, {"name": "SSX", "details_link": "https://www.metacritic.com/game/playstation-3/ssx", "publisher": "EA Sports", "release_date": "Feb 28 2012", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 81, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/03a76b884f03bc89724957ee49c483d8-98.jpg", "descriptions": "SSX allows players to experience the franchise’s signature fun and adrenaline-packed gameplay across iconic mountain ranges all over the world. Utilizing NASA topographical satellite data, we’ve mapped out a Massive World for players to explore. Using a Google-Earth inspired interface,SSX allows players to experience the franchise’s signature fun and adrenaline-packed gameplay across iconic mountain ranges all over the world. Utilizing NASA topographical satellite data, we’ve mapped out a Massive World for players to explore. Using a Google-Earth inspired interface, navigate throughout nine expansive mountain ranges and regions, each with multiple peaks and multiple drops. SSX packs reality-defying gameplay into every run letting players Race, Trick, and Survive down huge open mountains. In addition, Explore, Global Events and RiderNet - SSX’s recommendation engine - headline an online feature set that will revolutionize social competition for gamers, making it fun and easy to compete with friends on your schedule.… Expand"}, {"name": "Borderlands", "details_link": "https://www.metacritic.com/game/pc/borderlands", "publisher": "2K Games", "release_date": "Oct 26 2009", "developers": ["Gearbox Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/a6d2e246d5588a36e2cc3234798c84a8-98.jpg", "descriptions": "As the first title in an all-new sci-fi action franchise, Borderlands combines the best elements of Gearbox Software's first-person action titles with player customization and vehicular combat. Borderlands features a unique content generation system allowing for near-endless variety inAs the first title in an all-new sci-fi action franchise, Borderlands combines the best elements of Gearbox Software's first-person action titles with player customization and vehicular combat. Borderlands features a unique content generation system allowing for near-endless variety in missions, environments, enemies, weapons, item drops and character customization. Borderlands is a cooperative experience, allowing for multiple players to share the same game experience simultaneously online. Players can freely join or leave each other’s games at anytime, or choose to play in the full single-player mode. Borderlands features life-like character animations, impressive real-time physics, and customizable vehicles. More details to follow. [2K Games/Gearbox Software]… Expand"}, {"name": "DG2: Defense Grid 2", "details_link": "https://www.metacritic.com/game/pc/dg2-defense-grid-2", "publisher": "505 Games", "release_date": "Sep 23 2014", "developers": ["Hidden Path Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["General", "Strategy", "Real-Time", "General", "Defense"], "meta_score": 81, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/816a8fc3687ec4a95b6018f7cfc9dc20-98.jpg", "descriptions": "The sequel to the tower defense game of the same name, Defense Grid 2 introduces new worlds and threats to test your tower placement strategies. With a new look and the addition of new game modes, player-versus-player and multiplayer co-op, every play-through brings fun new opportunities andThe sequel to the tower defense game of the same name, Defense Grid 2 introduces new worlds and threats to test your tower placement strategies. With a new look and the addition of new game modes, player-versus-player and multiplayer co-op, every play-through brings fun new opportunities and challenges.… Expand"}, {"name": "Crysis", "details_link": "https://www.metacritic.com/game/playstation-3/crysis", "publisher": "EA Games", "release_date": "Oct  4 2011", "developers": ["Crytek"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/d0b6987d8ee494d62f3ff8c8d3ae89e7-98.jpg", "descriptions": "In Crysis, gamers will travel to 2019 where a team of US scientists makes a frightening discovery on an island in the South China Sea. All contact with the team is lost when the North Korean Government quickly seals off the area. The United States responds by dispatching an elite team ofIn Crysis, gamers will travel to 2019 where a team of US scientists makes a frightening discovery on an island in the South China Sea. All contact with the team is lost when the North Korean Government quickly seals off the area. The United States responds by dispatching an elite team of Delta Force Operators to recon the situation. As tension rises between the two nations, a massive alien ship reveals itself in the middle of the island. Now with hope rapidly fading, the US and North Koreans must join forces to battle the alien menace, fighting epic battles through stunning, photorealistic tropical jungles and frozen landscapes.… Expand"}, {"name": "Crysis", "details_link": "https://www.metacritic.com/game/xbox-360/crysis", "publisher": "EA Games", "release_date": "Oct  4 2011", "developers": ["Crytek"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/44ea15d4fa61ab8a63a63919959be778-98.jpg", "descriptions": "In Crysis, gamers will travel to 2019 where a team of US scientists makes a frightening discovery on an island in the South China Sea. All contact with the team is lost when the North Korean Government quickly seals off the area. The United States responds by dispatching an elite team ofIn Crysis, gamers will travel to 2019 where a team of US scientists makes a frightening discovery on an island in the South China Sea. All contact with the team is lost when the North Korean Government quickly seals off the area. The United States responds by dispatching an elite team of Delta Force Operators to recon the situation. As tension rises between the two nations, a massive alien ship reveals itself in the middle of the island. Now with hope rapidly fading, the US and North Koreans must join forces to battle the alien menace, fighting epic battles through stunning, photorealistic tropical jungles and frozen landscapes.… Expand"}, {"name": "Just Cause 2", "details_link": "https://www.metacritic.com/game/xbox-360/just-cause-2", "publisher": "Square Enix", "release_date": "Mar 23 2010", "developers": ["Avalanche Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/16b5998882fec6f1aae0509b4a9f4d1a-98.jpg", "descriptions": "Developed by Avalanche Studios, Just Cause 2 finds Rico Rodriguez returning in an epic open-world adventure set in the diverse tropical playground of Panau in South East Asia, where the aim is to cause chaos and destruction in a way that only Rico knows how! His mission is to destabilize theDeveloped by Avalanche Studios, Just Cause 2 finds Rico Rodriguez returning in an epic open-world adventure set in the diverse tropical playground of Panau in South East Asia, where the aim is to cause chaos and destruction in a way that only Rico knows how! His mission is to destabilize the island and free it from the tyranny of the evil dictator, Baby Panay. Players tackle missions and objectives in any way they want while exploring the highly-detailed and beautiful island by land, sea or air, performing an insane range of new daredevil stunts and mastering the use of the all new grappling hook and Rico's trademark parachute. [Eidos Interactive]… Expand"}, {"name": "Mario Tennis: Power Tour", "details_link": "https://www.metacritic.com/game/game-boy-advance/mario-tennis-power-tour", "publisher": "Nintendo", "release_date": "Dec  5 2005", "developers": ["Camelot Software Planning"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/0b3ddc83f00dded4f45454df66cddd48-98.jpg", "descriptions": "Players can test their backhand in this unique role-playing tennis adventure. Train hard at the Royal Tennis Academy to be a champion. Gain experience and improve your skills through lessons and tournaments, and rise to the top of the ranks. Play as Mario, Peach, Waluigi, or Donkey Kong in aPlayers can test their backhand in this unique role-playing tennis adventure. Train hard at the Royal Tennis Academy to be a champion. Gain experience and improve your skills through lessons and tournaments, and rise to the top of the ranks. Play as Mario, Peach, Waluigi, or Donkey Kong in a slew of wild modes. Advance through the story and unlock even more characters, all with their own power moves. Beat Mario at his own game, then link up with a friend or three for even more frantic fun.… Expand"}, {"name": "RAGE", "details_link": "https://www.metacritic.com/game/xbox-360/rage", "publisher": "Bethesda Softworks", "release_date": "Oct  4 2011", "developers": ["id Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Modern", "Modern", "Modern", "Arcade"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/37274f1e49c9a04ce405db29e0419cb2-98.jpg", "descriptions": "An action game set in a post-apocalyptic landscape jam-packed with driving and shooting, created by John Carmack and the rest of the Doom crew."}, {"name": "Napoleon: Total War", "details_link": "https://www.metacritic.com/game/pc/napoleon-total-war", "publisher": "Sega", "release_date": "Feb 23 2010", "developers": ["Creative Assembly"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/f5ded0eefcad50d75a710b5819545e0c-98.jpg", "descriptions": "Napoleon: Total War defines a new standard within the genre with exciting characters and a cinematic narrative, mind-blowing battle sequences and an unrivalled mix of turn-based and real-time strategy. Take command and lead your armies on land and sea over three campaigns: Italy, Egypt andNapoleon: Total War defines a new standard within the genre with exciting characters and a cinematic narrative, mind-blowing battle sequences and an unrivalled mix of turn-based and real-time strategy. Take command and lead your armies on land and sea over three campaigns: Italy, Egypt and Mastery of Europe. The seamless mix of objective-based missions and sandbox experience makes this the most complete Total War experience to date. Napoleon features fully integrated multiplayer modes and a complete set of online functionalities: Steam achievements, gameplay bonuses, uniform editor and voice communications. Advanced weaponry enables new tactical options and even more exciting real-time battles on an epic scale, while the highly detailed environments and improved battlefield buildings guarantee a realistic recreation of famous historical battles. [Sega]… Expand"}, {"name": "Overlord", "details_link": "https://www.metacritic.com/game/pc/overlord", "publisher": "Codemasters", "release_date": "Jun 26 2007", "developers": ["Triumph Studios"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/5ac0b627f0ffd33ed7ad41853b9fbd7a-98.jpg", "descriptions": "Controlling a mysterious figure that has inherited the legacy of the evil, long-dead Overlord, the player emerges, near death, from the ruins of the old Overlord's Dark Tower. Only the player's actions determine if they will rise to become the new all-powerful Overlord; it's all down to howControlling a mysterious figure that has inherited the legacy of the evil, long-dead Overlord, the player emerges, near death, from the ruins of the old Overlord's Dark Tower. Only the player's actions determine if they will rise to become the new all-powerful Overlord; it's all down to how much of a bad ass they want to be in order to succeed...evil or really evil! Played out with plenty of black humour and dark irony, the game immerses players in twisted parodies of classic fantasy scenarios and characters. Overlord's key innovation is the introduction of an array of impish creatures – the Minions. They believe you are the old Overlord reborn and will use their unique skills to fetch, fight and die for you. Throughout the game players actively control a horde of these gremlin-like critters and they follow your every instruction no matter how despotic or, for the Minions, life threatening it is. [Codemasters]… Expand"}, {"name": "Rockstar Games presents Table Tennis", "details_link": "https://www.metacritic.com/game/xbox-360/rockstar-games-presents-table-tennis", "publisher": "Rockstar Games", "release_date": "May 22 2006", "developers": ["Rockstar San Diego"], "platforms": "Xbox 360", "num_players": "8  Online", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Other", "Tennis"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/fae5a04d9a636a4f54b310dad97d8c08-98.jpg", "descriptions": "\"Our goal was to create a game that is perfectly addictive in its focused simplicity, a game that showcases the true possibilities of a next gen experience, not just in looks but in feel and pace,\" stated Sam Houser, Founder and Executive Producer of Rockstar Games. \"We wanted to use the\"Our goal was to create a game that is perfectly addictive in its focused simplicity, a game that showcases the true possibilities of a next gen experience, not just in looks but in feel and pace,\" stated Sam Houser, Founder and Executive Producer of Rockstar Games. \"We wanted to use the power of the new hardware and the resolution of new televisions to give the game an immediacy, an intensity and a sense of physicality and reality, resulting in a purer, more visceral experience that simply was not possible previously.\" Houser continued, \"It is a distillation of game design philosophy, focusing on removing the traditional areas of compromise inherent in managing size and scope and concentrating the hardware's entire power on one activity, with the aim of doing that better than it's ever been done before.\" [Rockstar Games]… Expand"}, {"name": "Metal Gear Solid HD Collection", "details_link": "https://www.metacritic.com/game/playstation-vita/metal-gear-solid-hd-collection", "publisher": "Konami", "release_date": "Jun 12 2012", "developers": ["Armature Studio"], "platforms": ["Xbox 360", "PlayStation Vita"], "num_players": "1 Player", "genres": ["Miscellaneous", "Action Adventure", "Modern", "Compilation", "Compilation"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/43ab7e459f05f28a91770fc72ccadf3d-98.jpg", "descriptions": "From the critically acclaimed director, Hideo Kojima, Metal Gear Solid HD Collection offers a handful of the most popular Metal Gear Solid titles from the past in true HD for the first time ever. Featuring three complete games, Metal Gear Solid 2: Sons of Liberty, Metal Gear Solid: SnakeFrom the critically acclaimed director, Hideo Kojima, Metal Gear Solid HD Collection offers a handful of the most popular Metal Gear Solid titles from the past in true HD for the first time ever. Featuring three complete games, Metal Gear Solid 2: Sons of Liberty, Metal Gear Solid: Snake Eater and Metal Gear Solid: Peace Walker, the HD Collection offers old and new fans a chance to experience the epic game play, design and storytelling of the MGS franchise. The \"Metal Gear Solid (MGS)\" series is the seminal work of Hideo Kojima, Japan's master game creator, and the progenitor of the stealth action game genre. The series has become a global phenomenon, with over 27 million copies sold worldwide. The player controls a secret agent from an elite special forces unit who is sent on solo sneaking missions through enemy installations, vast jungles, and sometimes even the thick of battle. Alone and surrounded by the enemy, even a special forces agent will find it tough to come out alive. But that is the secret behind the series' popularity-the cerebral challenge of figuring out how to avoid combat, and the thrill of sneaking through enemy territory undetected.The MGS series is also known for its storyline, which blends seamlessly with the gameplay. The scenarios are based on extensive research and incorporate the drama of actual developments in society. These elements have made MGS what it is today: a mature work of entertainment that transcends national borders and the confines of video games, and one of the leading products of the Japanesecontent business.… Expand"}, {"name": "Jak and Daxter Collection", "details_link": "https://www.metacritic.com/game/playstation-3/jak-and-daxter-collection", "publisher": "SCEA", "release_date": "Feb  7 2012", "developers": ["Mass Media"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Compilation", "Compilation", "3D"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/a876dfe20c63d3357febc11335577025-98.jpg", "descriptions": "The Jak and Daxter Collection includes the dynamic duo's first three adventures: Jak and Daxter: The Precursor Legacy, Jak II and Jak 3."}, {"name": "Samurai Shodown", "details_link": "https://www.metacritic.com/game/playstation-4/samurai-shodown", "publisher": "SNK Corporation", "release_date": "Jun 25 2019", "developers": ["SNK Corporation"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/04ab37a8939219243ba444049bc0b015-98.jpg", "descriptions": "11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay. Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN11 years have passed since the last series installment, and it is now time for SAMURAI SHODOWN to return in a brand-new game featuring high-end visuals and gameplay. Faithfully reproducing the game mechanics and atmosphere that contributed to the success of the series, SAMURAI SHODOWN includes a feature that learns from players game actions and patterns in order to create CPU-controlled “ghost” characters. With a story set one year before the very first installment, a diverse cast of returning and new characters cross paths in order to fulfill their destinies. [SNK]… Expand"}, {"name": "Firewatch", "details_link": "https://www.metacritic.com/game/pc/firewatch", "publisher": "Panic Inc.", "release_date": "Feb  9 2016", "developers": ["Campo Santo"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "3D", "First-Person"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/6c31475e58397b5f8e7552caab847675-98.jpg", "descriptions": "In Firewatch you play as a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, it’s your job to look for smoke and keep the wilderness safe. An especially hot and dry summer has everyone on edge. YourIn Firewatch you play as a man named Henry who has retreated from his messy life to work as a fire lookout in the Wyoming wilderness. Perched high atop a mountain, it’s your job to look for smoke and keep the wilderness safe. An especially hot and dry summer has everyone on edge. Your supervisor, a woman named Delilah, is available to you at all times over a small, handheld radio — and is your only contact with the world you've left behind. But when something strange draws you out of your lookout tower and into the world, you’ll explore a wild and unknown environment, facing questions and making interpersonal choices that can build or destroy the only meaningful relationship you have.… Expand"}, {"name": "Persona 3 Portable", "details_link": "https://www.metacritic.com/game/switch/persona-3-portable", "publisher": "Sega", "release_date": "Jan 19 2023", "developers": ["Atlus"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/53542c6f31f264d92e49dab43a011c41-98.jpg", "descriptions": "The Dark Hour, time \"hidden\" between one day and the next. Unfamiliar stillness swallows the city, people turn into eerie coffins, and otherworldly monsters called Shadows swarm. One night, the protagonist is attacked by these Shadows and the power of the heart, their Persona, is awakened.The Dark Hour, time \"hidden\" between one day and the next. Unfamiliar stillness swallows the city, people turn into eerie coffins, and otherworldly monsters called Shadows swarm. One night, the protagonist is attacked by these Shadows and the power of the heart, their Persona, is awakened.\r As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom. Will you live to see the light of day?… Expand"}, {"name": "Okinawa Rush", "details_link": "https://www.metacritic.com/game/switch/okinawa-rush", "publisher": "Pixelheart", "release_date": "Oct 28 2021", "developers": ["Storybird"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Action", "Platformer", "Beat-'Em-Up", "2D"], "meta_score": 81, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/0bf10cbc87690c0bd5d804d213de93f6-98.jpg", "descriptions": "The Black Mantis clan has come to Okinawa...Take on the role of the martial arts master Hiro, Meilin, or Shin as they face off in a desperate fight for their lives against the Black Mantis clan. \n\nDOUBLE THE MAYHEM: Bring a friend and battle against ninjas, demons, and more in the 2-playerThe Black Mantis clan has come to Okinawa...Take on the role of the martial arts master Hiro, Meilin, or Shin as they face off in a desperate fight for their lives against the Black Mantis clan. DOUBLE THE MAYHEM: Bring a friend and battle against ninjas, demons, and more in the 2-player local co-op mode of this action-adventure platformer set in a mystical, fantasy version of Okinawa.The fast, fluid combat system brings with it many moves, combos, juggles, and an intuitive parrying system.Fight to gain the top spot on our online scoreboard!… Expand"}, {"name": "Tails of Iron", "details_link": "https://www.metacritic.com/game/playstation-5/tails-of-iron", "publisher": "United Label", "release_date": "Sep 17 2021", "developers": ["Odd Bug Studio"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/26f73995146f50ce534ea169c37da57e-98.jpg", "descriptions": "Set in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart. As you explore the deceivinglySet in a grim land plagued by war, Tails of Iron is a hand-drawn RPG Adventure with punishingly brutal combat. As Redgi, heir to the Rat Throne, you must restore your broken Kingdom by banishing the merciless Frog Clan and their ferocious leader, Greenwart. As you explore the deceivingly charming world, you'll encounter a cast of unique companions, ready to aid you in your adventure. And you'll need all the help you can get, whether that's new meal recipes, blueprints to forge deadly weapons and armour, or even a land-chugging, armour-plated mole mobile! Overcome your fears. Rescue your brothers. Restore Your Kingdom. Your tail has begun. Master Brutal Combat: From frog zombies to gargantuan grubs - and everything in-between - the Kingdom is awash with danger. To overcome each perilous encounter, you'll need to study your opponent's attacks and react accordingly! Thankfully, there's a range of deadly abilities at your disposal, including parry bashes and fatal executions, not to mention ranged attacks with your nifty bow and arrow. Explore a Treacherous Kingdom: Fully accompanied by the deep, raspy narrations of Doug Cockle (voice of Geralt of Rivia from The Witcher), prepare to embark on an epic adventure across the mediaeval-fantasy Rat Kingdom. Complete side quests and faction hunts for some additional gold-on-the-side, or join forces with a sharp-eyed companion to help even the playing field. Customise your Attack: Adapt Redgi's combat style to the task at hand. Heavy armour may provide better protection but can you really afford to slow down your dodge-roll? And then there's the question of weapon; axes pack a punch, while spears are quick and nimble. Perhaps you'd prefer the all-round performance of a trusty broadsword? … Expand"}, {"name": "Overboard!", "details_link": "https://www.metacritic.com/game/pc/overboard!", "publisher": "inkle", "release_date": "Jun  2 2021", "developers": ["inkle"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/3cae5ad544127c201b376d1c8fe1409a-98.jpg", "descriptions": "GET AWAY WITH MURDER. Highly replayable detective game where you're the one whodunnit. From the creators of 80 Days and Heaven's Vault."}, {"name": "Silicon Dreams", "details_link": "https://www.metacritic.com/game/pc/silicon-dreams", "publisher": "Clockwork Bird", "release_date": "Apr 20 2021", "developers": ["Clockwork Bird"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Adventure", "3D", "First-Person"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/d82f68fe4d30eb509d2fb02da2286023-98.jpg", "descriptions": "It’s 2065, and you are an interrogator-model android tasked with rooting out deviants among your own kind. You must probe for lies, monitor and exploit emotional spikes, earn the trust of your subjects, and make the final call: release, or destroy?"}, {"name": "The Yakuza Remastered Collection", "details_link": "https://www.metacritic.com/game/xbox-one/the-yakuza-remastered-collection", "publisher": "Sega", "release_date": "Jan 28 2021", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/46de10c670b8951bdd4f8c1aaa42db36-98.jpg", "descriptions": "Complete The Dragon of Dojima's JourneyCelebrate Kazuma Kiryu's saga with the beautifully remastered Yakuza 3, 4, and 5. With restored content and updated localization in 1080p and 60fps, experience the complete Yakuza collection on one console for the first time in history."}, {"name": "Fuser", "details_link": "https://www.metacritic.com/game/xbox-one/fuser", "publisher": "NCSOFT", "release_date": "Nov 10 2020", "developers": ["Harmonix Music Systems"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Action", "Rhythm", "Music"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/ca5d52f2bd81ae5ec97e3b61016db1c1-98.jpg", "descriptions": "Work your way from the basics of mixing all the way to expert level techniques as you perform shows across 6 larger than life stage venues, each with its own signature style."}, {"name": "Torchlight II", "details_link": "https://www.metacritic.com/game/switch/torchlight-ii", "publisher": "Perfect World Entertainment", "release_date": "Sep  3 2019", "developers": ["Panic Button"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/7cae20f0d9ea08248a84f76605f789a9-98.jpg", "descriptions": "Beyond the town of Torchlight lies a world shrouded in adventure and mystery. Guardian-warrior Syl appears in a prophetic dream, summoning the player to the Estherian Steppes. There, you meet with the Destroyer and soon venture across the continent of Vilderan, an exotic frontier besieged byBeyond the town of Torchlight lies a world shrouded in adventure and mystery. Guardian-warrior Syl appears in a prophetic dream, summoning the player to the Estherian Steppes. There, you meet with the Destroyer and soon venture across the continent of Vilderan, an exotic frontier besieged by forces of evil. A discovery unfolds, that the Alchemist, following his conquest of dark ember, disappeared on his quest to defeat the unknown corrupted force responsible for destroying the mystical race of Estherians. Aided by Syl, the remaining Estherian Guardians, and clues left behind by the missing Alchemist, you will find yourself battling a powerful enemy that threatens to unravel the elements of the entire world.… Expand"}, {"name": "Hunt: Showdown", "details_link": "https://www.metacritic.com/game/pc/hunt-showdown", "publisher": "Crytek", "release_date": "Aug 27 2019", "developers": ["Crytek"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 12 ", "genres": ["Sci-Fi", "Third-Person", "Arcade", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/8337fe8b10ce349dcf61be246c165f56-98.jpg", "descriptions": "Hunt: Showdown is a competitive first-person bounty hunting game that packs the thrill of survival games into a match-based format. Set in Louisiana in 1895, the game boasts a mixture of PvP and PvE elements that creates a uniquely tense experience. It’s not just the creatures who are aHunt: Showdown is a competitive first-person bounty hunting game that packs the thrill of survival games into a match-based format. Set in Louisiana in 1895, the game boasts a mixture of PvP and PvE elements that creates a uniquely tense experience. It’s not just the creatures who are a threat—it’s every Hunter on the map. In the classic game mode, a match of Hunt pits ten players—playing solo or in teams of two—against each other as they race to take out gruesome beasts for a bounty they must collect and get off of the map, while Hunt’s quickplay mode offers a shorter match for solo players to scavenge for weapons as they compete for a diminishing pool of bounty. The higher the risk, the higher the reward–but a single mistake could cost everything.… Expand"}, {"name": "The Gardens Between", "details_link": "https://www.metacritic.com/game/xbox-one/the-gardens-between", "publisher": "The Voxel Agents", "release_date": "Nov 29 2018", "developers": ["The Voxel Agents"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/0758a4ff1e93064df6976bac9233d5cf-98.jpg", "descriptions": "Manipulate the flow of time to solve mind-bending puzzles while following best friends Arina and Frendt. Move time forward and backward, revisiting shared precious childhood memories scattered amongst surreal garden islands."}, {"name": "Madden NFL 19", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-19", "publisher": "Electronic Arts", "release_date": "Aug 10 2018", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Sports", "Team", "Football", "Sim"], "meta_score": 81, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/6/b57a918e4a83789d56ba64a38e65aa77-98.jpg", "descriptions": "Gameplay in Madden NFL 19 was developed with two primary objectives: 1. Player Control across the field; 2.Immersive NFL Experience from start to finish. To achieve these objectives, EA's goal is to deliver the most significant animation upgrade in Madden history. Madden NFL 19 introduces aGameplay in Madden NFL 19 was developed with two primary objectives: 1. Player Control across the field; 2.Immersive NFL Experience from start to finish. To achieve these objectives, EA's goal is to deliver the most significant animation upgrade in Madden history. Madden NFL 19 introduces a package of features known as Real Player Motion – featuring authentic player movement, more player control and responsiveness, and player signature behaviors that will immerse players into the NFL each and every game. [Electronic Arts]\r… Expand"}, {"name": "Reigns: Her Majesty", "details_link": "https://www.metacritic.com/game/pc/reigns-her-majesty", "publisher": "Devolver Digital", "release_date": "Dec  6 2017", "developers": ["Nerial"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/a4e0a8bd9d6cbbc85e16c26d00d3bd66-98.jpg", "descriptions": "Reigns: Her Majesty is the revolutionary follow-up to the smash swipe ‘em up hit Reigns."}, {"name": "Children of Zodiarcs", "details_link": "https://www.metacritic.com/game/playstation-4/children-of-zodiarcs", "publisher": "Cardboard Utopia", "release_date": "Jul 18 2017", "developers": ["Cardboard Utopia"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/dadf424641cd1dbcda5000ffc6cbbf95-98.jpg", "descriptions": "A story-driven, tactical RPG set in the fantasy realm of Lumus — a world divided by wealth and poverty. Assume control of Nahmi and her fellow outcasts, utilizing a brand new deck and dice based combat system to strike a blow to the noble Lords’ and Ladies’ unquenchable thirst for profit."}, {"name": "Little Nightmares", "details_link": "https://www.metacritic.com/game/pc/little-nightmares", "publisher": "Namco Bandai Games America", "release_date": "Apr 28 2017", "developers": ["Tarsier Studios"], "platforms": ["PlayStation 4", "Stadia", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action Adventure", "Linear"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/a5e65ffe8ce6fccb6b9acd0481589b98-98.jpg", "descriptions": "Immerse yourself in Little Nightmares, a dark whimsical tale that will confront you with your childhood fears. Help Six escape The Maw – a vast, mysterious vessel inhabited by corrupted souls looking for their next meal."}, {"name": "Shantae: Half-Genie Hero", "details_link": "https://www.metacritic.com/game/playstation-4/shantae-half-genie-hero", "publisher": "XSEED Games", "release_date": "Dec 20 2016", "developers": ["WayForward"], "platforms": ["PC", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/5d09bacaa9ae4cffb29fdaefe2c65b5f-98.jpg", "descriptions": "Shantae: Half-Genie Hero is a belly dancing, hair-whipping HD adventure from WayForward, makers of Ducktales Remastered, Adventure Time, and Contra 4."}, {"name": "Watch Dogs 2", "details_link": "https://www.metacritic.com/game/xbox-one/watch-dogs-2", "publisher": "Ubisoft", "release_date": "Nov 15 2016", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/3c7857b53757f3e48bbdc1a61b3fb7df-98.jpg", "descriptions": "Check out the birthplace of the tech revolution as Marcus Holloway, a brilliant young hacker who has fallen victim to ctOS 2.0's predictive algorithms and accused of a crime he did not commit. In Marcus' mission to shut down ctOS 2.0 for good, hacking is his ultimate weapon.  Players notCheck out the birthplace of the tech revolution as Marcus Holloway, a brilliant young hacker who has fallen victim to ctOS 2.0's predictive algorithms and accused of a crime he did not commit. In Marcus' mission to shut down ctOS 2.0 for good, hacking is his ultimate weapon.  Players not only can hack into the San Francisco Bay Area's infrastructure, but also into every person and any connected device they possess to trigger unpredictable chains of events in this vast open world. … Expand"}, {"name": "Zombie Night Terror", "details_link": "https://www.metacritic.com/game/pc/zombie-night-terror", "publisher": "Gambitious", "release_date": "Jul 20 2016", "developers": ["NoClip"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/346424a5131703a64fd5d25388352c34-98.jpg", "descriptions": "Prepare yourself. Something strange has happened and people everywhere are turning into blood thirsty walking corpses. But guess who’s the brains behind this hungry undead army? YOU! So spread this pandemic and wipe humanity of the planet."}, {"name": "Victoria II: Heart of Darkness", "details_link": "https://www.metacritic.com/game/pc/victoria-ii-heart-of-darkness", "publisher": "Paradox Interactive", "release_date": "Apr 16 2013", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 81, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/54c400fbfef4287ec19a5fca0ad5fd64-98.jpg", "descriptions": "Victoria II: Heart of Darkness, the second expansion for the grand strategy/ political simulator focuses on the Scramble for Africa as you compete with other colonial powers and experience international crises which require Great Power mediation if the world is to avoid war. \rBecome a trulyVictoria II: Heart of Darkness, the second expansion for the grand strategy/ political simulator focuses on the Scramble for Africa as you compete with other colonial powers and experience international crises which require Great Power mediation if the world is to avoid war. \rBecome a truly great power by the dawn of the 20th century in Victoria II, an experience crafted by Paradox Development Studio, the masters of Grand Strategy.… Expand"}, {"name": "Terraria", "details_link": "https://www.metacritic.com/game/playstation-3/terraria", "publisher": "505 Games", "release_date": "Mar 26 2013", "developers": ["Engine Software"], "platforms": ["3DS", "iPhone/iPad", "iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Sandbox", "2D", "2D"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/ff8750d1a67aa954cd5298128874c6ac-98.jpg", "descriptions": "Terraria? What's that?\r Terraria is a land of adventure! A land of mystery! A land that's yours to shape, to defend and to enjoy. Your options in Terraria are limitless, are you an action gamer with an itchy trigger finger? A master builder? A collector? An explorer? There's something forTerraria? What's that?\r Terraria is a land of adventure! A land of mystery! A land that's yours to shape, to defend and to enjoy. Your options in Terraria are limitless, are you an action gamer with an itchy trigger finger? A master builder? A collector? An explorer? There's something for everyone here.\r Dig, fight, explore, build! Nothing is impossible in this action-packed adventure game. The world is your canvas and the ground itself is your paint.\r Grab your tools and go! Make weapons to fight off a variety of enemies in numerous biomes. Dig deep underground to find accessories, money, and other useful things. Gather resources to create everything you need to make the world your own. Build a house, a fort, or even a castle. People will move in to live there and perhaps even sell you different wares to assist you on your journey.\r But beware, there are even more challenges awaiting you... Are you up to the task?\r Key features:\r - Sandbox Play\r- Randomly generated worlds\r- Free Content Updates… Expand"}, {"name": "Borderlands 2: Captain Scarlett and Her Pirate's Booty", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-2-captain-scarlett-and-her-pirates-booty", "publisher": "2K Games", "release_date": "Oct 16 2012", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/c94a20f993053755543fc11ea0792395-98.jpg", "descriptions": "In Captain Scarlett and her Pirate's Booty, up to four players cooperatively enter the hostile sand dunes and wastelands of Pirate Bay in search of ancient treasures. The add-on content campaign features new characters, including the eccentric and eager Shade; locations such as the town ofIn Captain Scarlett and her Pirate's Booty, up to four players cooperatively enter the hostile sand dunes and wastelands of Pirate Bay in search of ancient treasures. The add-on content campaign features new characters, including the eccentric and eager Shade; locations such as the town of Oasis; enemies including the Sand Pirates and Anchormen; and special weapons and loot that make it a must-play experience. No trip to Pandora is complete without a stop in Pirate Bay.… Expand"}, {"name": "Waveform", "details_link": "https://www.metacritic.com/game/pc/waveform", "publisher": "Eden Industries", "release_date": "Mar 20 2012", "developers": ["Eden Industries"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General", "General"], "meta_score": 81, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/ea6a5115abf7f96b8e1a39fb8e2bb90b-98.jpg", "descriptions": "Navigate the beauty and hazards of the solar system while riding on a wave of light in this innovative arcade-action game. On your journey to restore light to a dying galaxy being consumed by a Singularity, you'll travel from Pluto to the Sun and interact with a wide variety of strangeNavigate the beauty and hazards of the solar system while riding on a wave of light in this innovative arcade-action game. On your journey to restore light to a dying galaxy being consumed by a Singularity, you'll travel from Pluto to the Sun and interact with a wide variety of strange objects, and mind-bending situations that will affect the path of your wave, and the world around you, in interesting ways.… Expand"}, {"name": "Bit.Trip Flux", "details_link": "https://www.metacritic.com/game/wii/bittrip-flux", "publisher": "Aksys Games", "release_date": "Feb 28 2011", "developers": ["Gaijin Games"], "platforms": ["3DS", "PC", "Switch", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/cd4b19418e26c97684c35108b9f108d9-98.jpg", "descriptions": "Bit.Trip Flux is the final adventure for CommanderVideo."}, {"name": "Fallout 3: Broken Steel", "details_link": "https://www.metacritic.com/game/playstation-3/fallout-3-broken-steel", "publisher": "Bethesda Softworks", "release_date": "Sep 24 2009", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "General", "Western-Style"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/a7a2220ce862f5c7bdce52197e915450-98.jpg", "descriptions": "(Downloadable Content)  Continue your existing Fallout 3 game and finish the fight against the Enclave remnants alongside Liberty Prime. Broken Steel moves the level cap for your character from 20 to 30, allowing you to experience even more of the game, including new perks and achievements.(Downloadable Content)  Continue your existing Fallout 3 game and finish the fight against the Enclave remnants alongside Liberty Prime. Broken Steel moves the level cap for your character from 20 to 30, allowing you to experience even more of the game, including new perks and achievements. Story: You may have dealt the Enclave a serious blow at Project Purity, but their forces are still out there, and still pose a grave threat to the people and security of the Capital Wasteland. In Broken Steel, you'll continue your current Fallout 3 character past the events of Project Purity, and work with the Brotherhood of Steel to eradicate the Enclave threat once and for all. Travel to new locations like the Olney Powerworks, wield destructive new weapons like the Tesla Cannon, and fight powerful new creatures like the Super Mutant Overlord. [Bethesda Softworks]… Expand"}, {"name": "Personal Trainer: Cooking", "details_link": "https://www.metacritic.com/game/ds/personal-trainer-cooking", "publisher": "Nintendo", "release_date": "Nov 24 2008", "developers": ["indieszero"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "General", "General"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/143a1e9d99b49a73b9fbb4269cf93678-98.jpg", "descriptions": "(Also known as \"Cooking Guide: Can't Decide What To Eat?\")  Cooking Gide is designed to take the user through every stage of cooking. Its recipes are enhanced with many demonstrational videos which go beyond the capabilities of printed cook books. Additional functionalities are included to(Also known as \"Cooking Guide: Can't Decide What To Eat?\")  Cooking Gide is designed to take the user through every stage of cooking. Its recipes are enhanced with many demonstrational videos which go beyond the capabilities of printed cook books. Additional functionalities are included to facilitate the cooking and preparation process.… Expand"}, {"name": "Tiger Woods PGA Tour 08", "details_link": "https://www.metacritic.com/game/ds/tiger-woods-pga-tour-08", "publisher": "EA Sports", "release_date": "Aug 28 2007", "developers": ["Exient Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 81, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/23472b785937656c127f37f0c2cabc7f-98.jpg", "descriptions": "With new Touch Screen swing and putting controls take full control of your swing during training and challenges in Tiger Challenge mode, then take on the best PGA TOUR pros throughout an entire season. Featuring the greatest PGA TOUR pros, including Tiger Woods, Retief Goosen, and VijayWith new Touch Screen swing and putting controls take full control of your swing during training and challenges in Tiger Challenge mode, then take on the best PGA TOUR pros throughout an entire season. Featuring the greatest PGA TOUR pros, including Tiger Woods, Retief Goosen, and Vijay Singh, plus four female pros, including Annika Sorenstam and Natalie Gulbis. [Electronic Arts]… Expand"}, {"name": "NBA Street Homecourt", "details_link": "https://www.metacritic.com/game/playstation-3/nba-street-homecourt", "publisher": "EA Sports Big", "release_date": "Mar  6 2007", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/ac54398857655b4159b942e16feb63d5-98.jpg", "descriptions": "The fourth chapter in the multi-platinum selling NBA Street series expands on the fast-paced and larger-than-life 3-on-3 basketball gameplay that has made the franchise a hit. The newest iteration of NBA Street creates a hyper-real world that merges legendary courts with the hometown courtsThe fourth chapter in the multi-platinum selling NBA Street series expands on the fast-paced and larger-than-life 3-on-3 basketball gameplay that has made the franchise a hit. The newest iteration of NBA Street creates a hyper-real world that merges legendary courts with the hometown courts of your favorite NBA stars into one seamless city of streetball moments. Earn a name for yourself and garner respect as you progress along your hometown journey and become a legend. [Electronic Arts]… Expand"}, {"name": "The Elder Scrolls IV: Knights of the Nine", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-iv-knights-of-the-nine", "publisher": "Bethesda Softworks", "release_date": "Nov 21 2006", "developers": ["Bethesda Softworks"], "platforms": ["Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 81, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/71e380d8f9265a780087c1404d074b56-98.jpg", "descriptions": "Knights of the Nine is a compilation that includes all the other Oblivion downloadable content released to date: Horse Armor, The Orrery, Wizard’s Tower, Vile Lair, Thieves Den, Mehrunes' Razor, and Spell Tomes. Knights of the Nine features an all-new faction and quests for noble charactersKnights of the Nine is a compilation that includes all the other Oblivion downloadable content released to date: Horse Armor, The Orrery, Wizard’s Tower, Vile Lair, Thieves Den, Mehrunes' Razor, and Spell Tomes. Knights of the Nine features an all-new faction and quests for noble characters and answers many of the questions surrounding the Ayleid ruins found throughout Oblivion. Players can join a new faction and found their own order of holy knights – leading them into battle against a sorcerer-king and his demonic minions while exploring massive dungeons and searching for legendary relics – the holy armor and weapons of the Divine Crusader. [Bethesda Softworks]… Expand"}, {"name": "Red Orchestra: Ostfront 41-45", "details_link": "https://www.metacritic.com/game/pc/red-orchestra-ostfront-41-45", "publisher": "Bold Games", "release_date": "Mar 14 2006", "developers": ["Tripwire Interactive"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/2e495995a7f249ad1b53ae991607d99b-98.jpg", "descriptions": "Fight in the theatre of war that changed the world forever. Battle alongside your compatriots on some of the most inhospitable environments of the Eastern Front in Red Orchestra: Ostfront 41-45 RO places you in the most realistic WWII first-person multi-player combat to date on the PC,Fight in the theatre of war that changed the world forever. Battle alongside your compatriots on some of the most inhospitable environments of the Eastern Front in Red Orchestra: Ostfront 41-45 RO places you in the most realistic WWII first-person multi-player combat to date on the PC, allowing the player to fight through some of the most intense combat of the war. You can play as infantry, using a wide range of infantry weapons, or crew one of the many armoured combat vehicles available in the game, from half-tracks all the way through to the most famous German and Soviet heavy tanks. You can engage the enemy with everything from your bayonet at close quarters up to the massive 122mm cannon on the Soviet IS-2. And if that isn't enough, find an officer and a radio to call in thunderous artillery strikes to shake the enemy loose. [Tripwire]… Expand"}, {"name": "SSX On Tour", "details_link": "https://www.metacritic.com/game/xbox/ssx-on-tour", "publisher": "EA Sports Big", "release_date": "Oct 11 2005", "developers": ["EA Canada"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/f799ba124f4fa1e90f3f790bd403016e-98.jpg", "descriptions": "You can ski or snowboard yourself into stardom in SSX On Tour. The game includes 12 levels for racing and performing stunts. You can earn yourself a spot on the professional tour by winning events and improving your skills. Your success moves you up the rankings until you can call yourselfYou can ski or snowboard yourself into stardom in SSX On Tour. The game includes 12 levels for racing and performing stunts. You can earn yourself a spot on the professional tour by winning events and improving your skills. Your success moves you up the rankings until you can call yourself the best on the mountain. This version of SSX features new graphical effects and controller feedback designed to capture the speed of your races and the massive air of your tricks. SSX On Tour also includes new music, art, and characters.… Expand"}, {"name": "Hot Shots Golf: Open Tee", "details_link": "https://www.metacritic.com/game/psp/hot-shots-golf-open-tee", "publisher": "SCEA", "release_date": "May  3 2005", "developers": ["Clap Hanz"], "platforms": "PSP", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Arcade", "Arcade"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/67ec431204e86f657a70ad94d33cf1e3-98.jpg", "descriptions": "(Also known as \"Minna No Golf\" and \"Everybody's Golf\")  Take on a cast of colourful characters in the coolest clubhouse around. No need for airs and graces here – just select a golfer from a range of friendly faces, and customize their abilities, attributes and appearance before teeing off(Also known as \"Minna No Golf\" and \"Everybody's Golf\")  Take on a cast of colourful characters in the coolest clubhouse around. No need for airs and graces here – just select a golfer from a range of friendly faces, and customize their abilities, attributes and appearance before teeing off across a series of challenging courses and game modes. Go head-to-head with both friends and foes via WiFi compatible Ad Hoc Mode and become a true golfing legend. Features 6 new courses, classic venues and favourite characters from the ever-popular Hot Shots Golf series. Directly connect PSPs via a wireless network to simultaneously link up with several golfers and take part in gala golf tournaments and challenges. [SCEA]… Expand"}, {"name": "Kingdom Under Fire: The Crusaders", "details_link": "https://www.metacritic.com/game/xbox/kingdom-under-fire-the-crusaders", "publisher": "Microsoft Game Studios", "release_date": "Oct 12 2004", "developers": ["Phantagram"], "platforms": "Xbox", "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/aa66134435ce96ddb23b23e26ee327df-98.jpg", "descriptions": "Imagine you're a military hero in the Middle Ages, gallantly striking down the enemy and commanding friendly forces. Set 50 years after the events of Kingdom Under Fire, The Crusaders lets you lead hundreds of troops into war, while managing resources, augmenting your forces, and developingImagine you're a military hero in the Middle Ages, gallantly striking down the enemy and commanding friendly forces. Set 50 years after the events of Kingdom Under Fire, The Crusaders lets you lead hundreds of troops into war, while managing resources, augmenting your forces, and developing your combat strategies. You can choose to play as one of two races, Humans or Dark Legions, and you can select one of several character types within each race. While moving across the continent, you can stop by castles, gain endorsements from feudal lords, hire mercenaries, replenish or change equipment, and more. … Expand"}, {"name": "The Sims Bustin' Out", "details_link": "https://www.metacritic.com/game/xbox/the-sims-bustin-out", "publisher": "EA Games", "release_date": "Dec 15 2003", "developers": ["Maxis"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/f9fdbd826912dec0867ca277008aa1c0-98.jpg", "descriptions": "The Sims are making a big return to the console and this time they are bustin' out of the house and exploring all-new locations around town.  In The Sims Bustin' Out, players can choose from a variety of new career paths.  Along the way, players can unlock and collect over a hundred of newThe Sims are making a big return to the console and this time they are bustin' out of the house and exploring all-new locations around town.  In The Sims Bustin' Out, players can choose from a variety of new career paths.  Along the way, players can unlock and collect over a hundred of new objects and social moves exclusive to the console.  Play, work, and socialize with a cast of over 25 new outrageous characters and climb through a dozen new careers.  The Sims Bustin' Out also features new integrated two-player gameplay and memory card support, for those players who like to take their Sims over to a friend's house and show them off.… Expand"}, {"name": "The Simpsons: Hit & Run", "details_link": "https://www.metacritic.com/game/xbox/the-simpsons-hit-run", "publisher": "VU Games", "release_date": "Sep 16 2003", "developers": ["Radical Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Mission-based"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/add1f4e663540a47aab7a95a522481e5-98.jpg", "descriptions": "Explore Springfield as your favorite Simpsons characters as you unravel the plot that threatens the town's very existence.  Play as Homer, Bart, Marge, Lisa, and Apu in over 56 driving and on-foot missions in seven challenging levels.  Drive in 40 of Springfield's finest vehicles includingExplore Springfield as your favorite Simpsons characters as you unravel the plot that threatens the town's very existence.  Play as Homer, Bart, Marge, Lisa, and Apu in over 56 driving and on-foot missions in seven challenging levels.  Drive in 40 of Springfield's finest vehicles including Mr.  Plow and the Canyonero.  Unlock the multiplayer mode to play against three other players.  The world of the Simpsons has many gags and surprises in store for you. … Expand"}, {"name": "Karnaaj Rally", "details_link": "https://www.metacritic.com/game/game-boy-advance/karnaaj-rally", "publisher": "Jaleco Entertainment", "release_date": "Jan  2 2003", "developers": ["Infinite Dreams", "Paragon 5"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Driving", "Car Combat"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/f80f5b68e333bea36ad1f0817213a0a3-98.jpg", "descriptions": "Crying. That's what your opponents will be doing when you're at the wheel. Race from a top-down perspective as you steer down one of 22 tracks. Blast ahead with gas and brake control. Make your opponents spin and crash as you bombard them with a barrage of weapons. Take your competition outCrying. That's what your opponents will be doing when you're at the wheel. Race from a top-down perspective as you steer down one of 22 tracks. Blast ahead with gas and brake control. Make your opponents spin and crash as you bombard them with a barrage of weapons. Take your competition out of the race with rockets and mines. Earn money every time you win to buy newer, faster vehicles and weapon power-ups for more fire action.… Expand"}, {"name": "Stronghold", "details_link": "https://www.metacritic.com/game/pc/stronghold", "publisher": "Gathering", "release_date": "Oct 21 2001", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 81, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/3aac9966ea55c2c43c49c4c0f90a804f-98.jpg", "descriptions": "Set in medieval Europe, players establish settlements, build and manage castles and engage in siege warfare. The game incorporates much more building and \"community managing\" than a traditional RTS, yet allows for a more intense combat experience than city builders have featured in the past.Set in medieval Europe, players establish settlements, build and manage castles and engage in siege warfare. The game incorporates much more building and \"community managing\" than a traditional RTS, yet allows for a more intense combat experience than city builders have featured in the past.  [GodGames]… Expand"}, {"name": "Star Fox 64 3D", "details_link": "https://www.metacritic.com/game/3ds/star-fox-64-3d", "publisher": "Nintendo", "release_date": "Sep  9 2011", "developers": ["Nintendo", "Q-Games"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Rail", "Rail"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/e63564a6cff3427be457d6b7b3ff08cc-98.jpg", "descriptions": "Star Fox 64 is being remade in 3-D for the 3DS."}, {"name": "Yoshi's Island DS", "details_link": "https://www.metacritic.com/game/ds/yoshis-island-ds", "publisher": "Nintendo", "release_date": "Nov 13 2006", "developers": ["Artoon"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 81, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/98d31b03dc3c7870723cd9e86f878862-98.jpg", "descriptions": "Return to the colorful wilds of Yoshi's Island in a new platforming adventure for Nintendo DS. A mysterious floating island has suddenly appeared over peaceful Yoshi’s Island. Soon after its arrival, a gaggle of kids vanishes from the island school. Thankfully, Baby Mario, Baby Peach andReturn to the colorful wilds of Yoshi's Island in a new platforming adventure for Nintendo DS. A mysterious floating island has suddenly appeared over peaceful Yoshi’s Island. Soon after its arrival, a gaggle of kids vanishes from the island school. Thankfully, Baby Mario, Baby Peach and Baby Donkey Kong manage to avoid being kidnapped. Now, Yoshi and the three young superstars must set out on a wild and colorful quest to rescue the kids and investigate the ominous island hovering overhead. Thanks to the power of Nintendo DS, all of the lush vistas and perilous paths of Yoshi's Island span two screens. [Nintendo]… Expand"}, {"name": "SOCOM: U.S. Navy SEALs Fireteam Bravo 2", "details_link": "https://www.metacritic.com/game/psp/socom-us-navy-seals-fireteam-bravo-2", "publisher": "SCEA", "release_date": "Nov 21 2006", "developers": ["Zipper Interactive"], "platforms": "PSP", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 81, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/3bf481d6377e7781f33aeaa92dcfe13f-98.jpg", "descriptions": "Command a secret subset of the most elite and deadly fighting force on the planet as players defend America and her allies through broad combat experiences including new non-linear mission progression, over 40 authentic real world weapons and a huge area of operation spanning multipleCommand a secret subset of the most elite and deadly fighting force on the planet as players defend America and her allies through broad combat experiences including new non-linear mission progression, over 40 authentic real world weapons and a huge area of operation spanning multiple terrain types and environments. As the SEAL commander, the player is supported by an AI teammate executing traditional SOCOM team-based tactical, stealth and action gameplay. Multiple players once again be able to form clans and take on their friends for team based high-action gameplay in SOCOM U.S. Navy SEALs: Fireteam Bravo 2 via a Wi-Fi connection. Up to 16 players in close proximity in Ad Hoc mode and online in Infrastructure mode can compete wirelessly through 3 new game types across all new multiplayer maps and original SOCOM U.S. Navy SEALs: Fireteam Bravo maps. Fireteam Bravo 2 is complete with a variety of new gameplay features including new non-linear mission progression, which allows players to choose which mission to tackle next and also provides players with the ability to go back to previous mission areas when enemy activity resurfaces there. Additionally, a new persistent performance rating system tracks the player's success and failure throughout the campaign. By completing mission goals, discovering bonus objectives, and rescuing civilians, the player earns \"Command Equity\" points that can be used to add new weapons to the armory or purchase in-game air strikes and supply drops. They also increase their \"Local Influence\" rating, which will give them access to black market weapons and intel from locals. [SCEA]… Expand"}, {"name": "Life is Strange 2: Episode 1 - Roads", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-2-episode-1---roads", "publisher": "Square Enix", "release_date": "Sep 27 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/74b1594c5d545b0655ebbef939c5743e-98.jpg", "descriptions": "Two brothers, aged 16 and 9, are forced to run away from home after a tragic incident, while attempting to conceal a sudden and mysterious supernatural power."}, {"name": "Freedom Fighters", "details_link": "https://www.metacritic.com/game/playstation-2/freedom-fighters", "publisher": "EA Games", "release_date": "Oct  1 2003", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/50b2b9ad4a668d4ac1dd011441930855-98.jpg", "descriptions": "Wars are not won alone. In a world where the Soviet Union won the Cold War, a fierce conflict is beginning to unfold in the streets of America. Red Army troops are pouring across the borders of Mexico and Canada shortly after a nuclear missile is unleashed on Washington D.C. Chaos sets inWars are not won alone. In a world where the Soviet Union won the Cold War, a fierce conflict is beginning to unfold in the streets of America. Red Army troops are pouring across the borders of Mexico and Canada shortly after a nuclear missile is unleashed on Washington D.C. Chaos sets in when breaking news informs Americans that their President has been killed and the Russians have invaded the country. You take on the role of Christopher Walker, a man who evolves into a charismatic and fearless freedom fighter obsessed with finding and freeing his brother in the streets of occupied New York City. [Electronic Arts]… Expand"}, {"name": "Phoenix Wright: Ace Attorney - Spirit of Justice", "details_link": "https://www.metacritic.com/game/3ds/phoenix-wright-ace-attorney---spirit-of-justice", "publisher": "Capcom", "release_date": "Sep  8 2016", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 81, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/40dcdf2f247dd376122c48fe10c3b153-98.jpg", "descriptions": "This narrative adventure stars beloved defense attorneys Phoenix Wright and Apollo Justice and sees the return of many familiar faces alongside some exciting new additions. Filled with puzzling cases to solve, the new game also brings popular investigative techniques from previousThis narrative adventure stars beloved defense attorneys Phoenix Wright and Apollo Justice and sees the return of many familiar faces alongside some exciting new additions. Filled with puzzling cases to solve, the new game also brings popular investigative techniques from previous installments, along with brand new mechanics such as the Divination Séance. Spirit of Justice sees Phoenix in a brand new location: a courtroom situated in the Kingdom of Khura'in, origin of the Kurain Channeling Technique, where mysterious séance trials decide the fate of all defendants. Meanwhile, defense attorney Apollo Justice faces his own challenges holding down the fort at the Wright Anything Agency, as he takes on a case that will have explosive implications. Both our heroes are joined by a host of returning friends and adversaries in their fight to bring about justice. [Nintendo.com]… Expand"}, {"name": "CHUCHEL", "details_link": "https://www.metacritic.com/game/pc/chuchel", "publisher": "Amanita Design", "release_date": "Mar  7 2018", "developers": ["Amanita Design"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 81, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/118ec37c4b8b3dca6016e01040f60928-98.jpg", "descriptions": "CHUCHEL is a comedy adventure game from the creators of Machinarium, Botanicula and Samorost. Join the hairy hero Chuchel and his rival Kekel as they will be facing numerous puzzles and challenges in their quest to retrieve the precious cherry."}]