[{"name": "Knockout Kings 2003", "details_link": "https://www.metacritic.com/game/gamecube/knockout-kings-2003", "publisher": "Electronic Arts", "release_date": "Oct  9 2002", "developers": ["EA Sports"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/43df9e6a19306d92f97d894f1fd8d288-98.jpg", "descriptions": "Knockout Kings 2003 offers big-time boxing moments, fast gameplay, and other new features. You can create countless dream matches with Muhammad Ali, Joe Frazier, Roberto Duran, and Sugar Ray Leonard, or you can stick with the current lions including Felix Trinidad, Lennox Lewis, Oscar De LaKnockout Kings 2003 offers big-time boxing moments, fast gameplay, and other new features. You can create countless dream matches with Muhammad Ali, Joe Frazier, Roberto Duran, and Sugar Ray Leonard, or you can stick with the current lions including Felix Trinidad, Lennox Lewis, Oscar De La Hoya, Fernando Vargas, and many others. Now you can take on opponents in single elimination tournaments with untimed fighting in an all-new mode, earn special punches during matches, and track a fighter's actions in the ring with the enhanced stat tracking system.… Expand"}, {"name": "Duke Nukem: Manhattan Project", "details_link": "https://www.metacritic.com/game/pc/duke-nukem-manhattan-project", "publisher": "Arush Entertainment", "release_date": "May 17 2002", "developers": ["Sunstorm Interactive"], "platforms": ["iPhone/iPad", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Platformer", "Shooter", "Scrolling", "2D", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/77db1a3300a34a24e2ad435c26fc423b-98.jpg", "descriptions": "Gaming's king of action returns in an all new adventure, this time in New York City. Duke battles his way across towering skyscraper rooftops and through gritty subway stations on the hunt for power-hungry villain, Mech Morphix. Mutants of every kind are thrown at Duke as he chases downGaming's king of action returns in an all new adventure, this time in New York City. Duke battles his way across towering skyscraper rooftops and through gritty subway stations on the hunt for power-hungry villain, Mech Morphix. Mutants of every kind are thrown at Duke as he chases down Morphix through eight huge environments and avoids the green slime called GLOPP that is causing all the chaos. But radioactive slime isn't Duke's only problem--there over 25 uniquely dangerous mutated enemies hell-bent on making a meal of him. Whether it's Uzi-sporting alligators or ten-foot tall roach beasts--Duke's in town to blast bad guys and save babes. Sure, pipe bombs, a machine gun, a rocket launcher and a pulse cannon are gonna make a goo-filled mess in the Big Apple, but what's a hero to do? [ARUSH]… Expand"}, {"name": "Konami Collector's Series: Arcade Advanced", "details_link": "https://www.metacritic.com/game/game-boy-advance/konami-collectors-series-arcade-advanced", "publisher": "Konami", "release_date": "Mar 21 2002", "developers": ["KCEA"], "platforms": "Game Boy Advance", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/25ddddaad9d2e3f636747947645e6ca6-98.jpg", "descriptions": "Six Konami arcade classics arrive in Konami's Collectors Series: Arcade Advanced.  For the first time in over ten years, play the original arcade version of the classic hit Frogger.  Search the solar system, travel through time and space, and infiltrate enemy bases in Gyruss, Time Pilot,Six Konami arcade classics arrive in Konami's Collectors Series: Arcade Advanced.  For the first time in over ten years, play the original arcade version of the classic hit Frogger.  Search the solar system, travel through time and space, and infiltrate enemy bases in Gyruss, Time Pilot, Rush 'n Attack, and Scramble.  And test your martial arts skill in Yie Ar Kung Fu.  With better graphics, levels, difficulty, and a multiplayer mode, Konami's compilation shows that its greatest games improve with age.  … Expand"}, {"name": "Gradius Galaxies", "details_link": "https://www.metacritic.com/game/game-boy-advance/gradius-galaxies", "publisher": "Konami", "release_date": "Nov 12 2001", "developers": ["Mobile 21"], "platforms": "Game Boy Advance", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/09c364fc30317dd7ee363c08c7ed399a-98.jpg", "descriptions": "The classic franchise Gradius comes to Game Boy® Advance! An evil force has taken over a distant star system and only you can stop them. Soar through a myriad of enemy attack units and blow them to bits using ultra powerful weapons including photon missiles and laser beams."}, {"name": "Tales of Destiny II", "details_link": "https://www.metacritic.com/game/playstation/tales-of-destiny-ii", "publisher": "Namco", "release_date": "Sep 10 2001", "developers": ["Namco"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/9b8c9db55dd0696724c5761ec7d6a4f7-98.jpg", "descriptions": "Embark on a heroic journey to discover the truth behind an enigmatic stranger and the ominous message she brings. For years, life in the sleepy village of Rasheans was routine and peaceful - that is, until the day a spacecraft crashed in a nearby forest leaving nothing but wreckage, aEmbark on a heroic journey to discover the truth behind an enigmatic stranger and the ominous message she brings. For years, life in the sleepy village of Rasheans was routine and peaceful - that is, until the day a spacecraft crashed in a nearby forest leaving nothing but wreckage, a mysterious girl, and a desperate warning of catastrophe. Join Reid, Farah, and other valiant heroes as they set out to discover the origin of the stranded girl and the truth behind the fate of their worlds. … Expand"}, {"name": "Metal Gear Solid: Snake Eater 3D", "details_link": "https://www.metacritic.com/game/3ds/metal-gear-solid-snake-eater-3d", "publisher": "Konami", "release_date": "Feb 21 2012", "developers": ["Kojima Productions"], "platforms": ["PlayStation 2", "3DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/7790cb2e395c8a9e0d491072d5415a8a-98.jpg", "descriptions": "In the aftermath of the Second World War, the world was torn in two between East and West. It was the beginning of a new era- the Cold War. October 16, 1962. The President of the United States received word that the Soviet Union had deployed nuclear missiles in Cuba. The world trembled inIn the aftermath of the Second World War, the world was torn in two between East and West. It was the beginning of a new era- the Cold War. October 16, 1962. The President of the United States received word that the Soviet Union had deployed nuclear missiles in Cuba. The world trembled in fear as the prospect of nuclear war loomed ever closer. After days of tense negotiations, the Soviets finally agreed on the 28th to withdraw their missiles from Cuban soil. With the resolution of this incident, later to be known as the Cuban Missile Crisis, it seemed that humanity had survived yet another threat to its existence. However, there was a secret condition in the deal that put an end to the crisis. Nokolai Stepanovich Sokolov, a Soviet scientist who had defected to the West, was to be sent back to the Soviet Union. The U.S. government agreed to this stipulation, and returned Sokolov back to his native land. Little did they know that Sokolov was to be the designer of a nightmarish weapon. Now, with Sokolov back in their hands, the Soviets are ready to resume its development. If this weapon is completed, it will mark the beginning of a new age of fear. August 1964. Realizing at last the urgency of the situation, the CIA forms a plan to recapture Sokolov. They dispatch the covert FOX unit to Sokolov’s research facility, located to the south of the great Soviet fortress of Groznyj Grad. Led by former SAS member Major Zero, FOX is a next-generation special-forces unit that operates both as a specialized combat group and as a covert intelligence outfit. The FOX unit’s modus operandi is to send a single agent, backed by radio support from afar, into enemy territory to carry out solo sneaking missions. [Nintendo]… Expand"}, {"name": "Overcooked!", "details_link": "https://www.metacritic.com/game/playstation-4/overcooked!", "publisher": "Team17", "release_date": "Aug  2 2016", "developers": ["Ghost Town Games Ltd."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Simulation", "Arcade", "Virtual", "Career"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/85df55be509bba26c22778390a60c134-98.jpg", "descriptions": "Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook, and serve up a variety of tasty orders before the baying customers storm out in a huff. [Playstation.com]"}, {"name": "Marvel: Ultimate Alliance", "details_link": "https://www.metacritic.com/game/playstation-3/marvel-ultimate-alliance", "publisher": "Activision", "release_date": "Nov 17 2006", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 2", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/e91c4dd98e19dab3f1681e86ea4058f3-98.jpg", "descriptions": "Marvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine theMarvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game.  Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine the fate of both planet Earth and the Marvel universe – revealed in one of multiple epilogues. Marvel: Ultimate Alliance offers total team customization, where players create their own team name, icon and vehicle, as well as establish their team reputation as they play throughout the story.  Gamers also have the option to level up each character individually to their liking, or all team members at the same time to keep their heroes balanced.  With the game's new combat system, players battle against the world's most notorious Marvel Super Villains in the air, underwater, and on the ground, using grappling, blocking and dodging moves, by charging up their Super Hero powers before unleashing them, and using environmental objects as one and two-handed weapons. Marvel:  Ultimate Alliance features a storyline where the missions players accept, the objectives they complete, and their interactions with other characters throughout the game directly impact how the story plays out. The game also features a robust multiplayer component where fans can band together with friends as their favorite Marvel Super Heroes, and fight evil in both on and offline cooperative story modes.  There's also a Competitive Mode where the game tracks various in-game stats so players can see how well they stack up against one another – affecting the amount of experience points earned and how equipment is distributed. [Activision]… Expand"}, {"name": "Grand Kingdom", "details_link": "https://www.metacritic.com/game/playstation-4/grand-kingdom", "publisher": "NIS America", "release_date": "Jun 21 2016", "developers": ["Spike Chunsoft"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/1c78b290b1076fb7b83ea1eafce82e70-98.jpg", "descriptions": "After the fall of the once-prosperous Uldein Empire over one hundred years ago, the Four Great Nations now wage war to claim dominion over the Resonail continent. Battles are no longer fought by honorable knights loyal to a nation, but by mercenaries who sell their services to the highestAfter the fall of the once-prosperous Uldein Empire over one hundred years ago, the Four Great Nations now wage war to claim dominion over the Resonail continent. Battles are no longer fought by honorable knights loyal to a nation, but by mercenaries who sell their services to the highest bidder. As the leader of a mercenary squad, the player will lead their troops across a battle-scarred continent, overcoming obstacles and adversaries as they complete quests doled out by each nation. In doing so, they will unravel the mystery behind the downfall of a mighty empire.… Expand"}, {"name": "Dauntless", "details_link": "https://www.metacritic.com/game/pc/dauntless", "publisher": "Phoenix Labs", "release_date": "May 21 2019", "developers": ["Phoenix Labs"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/a9e94e3d3a84b25b45fdb748f0713477-98.jpg", "descriptions": "Discover a shattered world, forge powerful weapons, and hunt the ferocious behemoths threatening our survival."}, {"name": "The Quarry", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-quarry", "publisher": "2K Games", "release_date": "Jun 10 2022", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Survival"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/03a4ec36e33388b5aa6eeffb27ec9475-98.jpg", "descriptions": "As the sun sets on the last day of summer camp, the teenage counselors of Hackett's Quarry throw a party to celebrate. No kids. No adults. No rules.Things quickly take a turn for the worse.\n\nHunted by blood-drenched locals and something far more sinister, the teens' party plans unravelAs the sun sets on the last day of summer camp, the teenage counselors of Hackett's Quarry throw a party to celebrate. No kids. No adults. No rules.Things quickly take a turn for the worse.Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel into an unpredictable night of horror. Friendly banter and flirtations give way to life-or-death decisions, as relationships build or break under the strain of unimaginable choices.Play as each of the nine camp counselors in a thrilling cinematic tale, where every decision shapes your unique story from a tangled web of possibilities. Any character can be the star of the showor die before daylight comes.How will your story unfold?YOUR STORY, THEIR FATEWill you dare to check what's behind that trap door? Will you investigate the screams echoing from within the forest? Will you save your friends or desperately run for your life? Every choice, big or small, shapes your story and determines who lives to tell the tale.A STUNNING CINEMATIC EXPERIENCECutting edge facial capture and filmic lighting techniques, combined with incredible performances from an iconic ensemble cast of Hollywood talent, bring the horrors of Hackett's Quarry to life in a pulse-pounding, cinematic thrill ride.ENJOY THE FRIGHT WITH FRIENDSPlace your faith in up to 7 friends in online play, where invited players watch along and vote on key decisions, creating a story shaped by the whole group! Or, play together in a party horror couch co-op experience where each player picks a counselor and controls their actions.CUSTOMIZE YOUR EXPERIENCEAdjustable difficulty for all gameplay elements let players of any skill level enjoy the horror. And if you prefer to watch rather than play, Movie Mode lets you enjoy The Quarry as a binge-worthy cinematic thriller. Select how you want the story to unfold, kick back, and munch on some popcorn in between all the screams!STARRING:David Arquette as ChrisAriel Winter as AbigailBrenda Song as KaitlynEvan Evagora as NickHalston Sage as EmmaJustice Smith as RyanMiles Robbins as DylanSiobhan Williams as LauraSkyler Gisondo as MaxZach Tinker as JacobEthan Suplee as BobbyGrace Zabriskie as ElizaLance Henriksen as JedediahLin Shaye as ConstanceTed Raimi as Travis… Expand"}, {"name": "Freedom Finger", "details_link": "https://www.metacritic.com/game/xbox-one/freedom-finger", "publisher": "Wide Right Interactive", "release_date": "Mar 24 2020", "developers": ["Wide Right Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/19c8621a8f23f1ff46d9c506541882df-98.jpg", "descriptions": "Freedom Finger is a music driven, side-scrolling shooter that sends you blasting across 40 levels of crazy cartoon action. Starring Nolan North, John DiMaggio, and Sam Riegel. Featuring music by Aesop Rock, Red Fang, METZ, Power Trip, Com Truise, and many more!"}, {"name": "Bridge Constructor Portal", "details_link": "https://www.metacritic.com/game/playstation-4/bridge-constructor-portal", "publisher": "Headup Games", "release_date": "Mar  1 2018", "developers": ["ClockStone Studio"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Puzzle", "Action", "Virtual", "Career"], "meta_score": 78, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/9/9b80ce83f7dc054bdfee149720fd6be7-98.jpg", "descriptions": "Enter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 testEnter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 test chambers and get the Bendies safely across the finish line in their vehicles. Make use of the many Portal gadgets, like portals, propulsion gel, repulsion gel, aerial faith plates, cubes, and more to bypass the sentry turrets, acid pools and laser barriers, solve switch puzzles, and make it through the test chambers unscathed. Let Ellen McLain, the original voice of GLaDOS, guide you through the tutorial, and learn all the tips and tricks that make a true Aperture Science employee. The bridge is a lie!… Expand"}, {"name": "Wuppo", "details_link": "https://www.metacritic.com/game/pc/wuppo", "publisher": "Soedesco", "release_date": "Sep 29 2016", "developers": ["Knuist & Perzik"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/d64a8e92e647446411914492f62594e4-98.jpg", "descriptions": "Enter the wondrous world of Wuppo! Fight numerous enemies, collect countless items, and solve immersive puzzles, all while exploring the detailed history of the world in your quest to find a new home."}, {"name": "Joe Danger 2: The Movie", "details_link": "https://www.metacritic.com/game/playstation-3/joe-danger-2-the-movie", "publisher": "Hello Games", "release_date": "Oct  9 2012", "developers": ["Hello Games"], "platforms": ["PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Racing", "General", "General", "Arcade", "Other"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/aa2d1af8372ab22b271e57c564306f6e-98.jpg", "descriptions": "On the set of the greatest blockbuster \"Movie\" ever made, create your own action film scene by scene, performing every stunt yourself."}, {"name": "Robocalypse", "details_link": "https://www.metacritic.com/game/ds/robocalypse", "publisher": "Tecmo", "release_date": "Nov 17 2008", "developers": ["Vogster"], "platforms": "DS", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/eb31dfad241a3c8efeb691440f4e574d-98.jpg", "descriptions": "Robocalypse is an innovative real-time strategy developed specifically for the Nintendo DS. Featuring robotic armies equipped with unique weaponry, Robocalypse offers deep strategic warfare and a twist of humor. Up to 4 players can compete head to head in wireless multiplayer matches or youRobocalypse is an innovative real-time strategy developed specifically for the Nintendo DS. Featuring robotic armies equipped with unique weaponry, Robocalypse offers deep strategic warfare and a twist of humor. Up to 4 players can compete head to head in wireless multiplayer matches or you can lead an army to victory in the comical single player storymode campaign penned by Jay Lender and Micah Wright. Choose from over 10 distinct robot units with specialized skills and weapons all with their own distinct attitudes and personalities. Over 20 groundbreaking weapon types with spectacular visual effects, including, Converter Cannons, Falling Anvils, Head-Crack’n Gauntlet and Digitizers. Simplified controls and innovative Action Flag system reduces the complexity of commanding units. No buttons – just point and tap. [Vogster]… Expand"}, {"name": "For Honor", "details_link": "https://www.metacritic.com/game/playstation-4/for-honor", "publisher": "Ubisoft", "release_date": "Feb 14 2017", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/4a8e482cfbabc6a64eb4630ecd89d7af-98.jpg", "descriptions": "For Honor is a competitive third-person melee title which mixes speed, strategy and team play with close range combat. The Chosen has survived a thousand years of wandering the southern deserts. Their journey should have wiped them out hundreds of years ago, but they survived thanks to theFor Honor is a competitive third-person melee title which mixes speed, strategy and team play with close range combat. The Chosen has survived a thousand years of wandering the southern deserts. Their journey should have wiped them out hundreds of years ago, but they survived thanks to the skill set and focus of their heroes. These individuals hoe to lead their followers to an improbable victory and to establish a new homeland. Striking fear in their enemies, The Warborn warriors sail across the Boiling Sea to raid the southern coast. Known for their fire and passion, they will seek to drive their enemies out of their ancestral lands. On the shoulders of great heroes, The Legions have driven out invaders, conquered any who wouldn't join them, and established hundreds of others to defend what is theirs. Facing invasion on two fronts, these heroes fight to protect their lands form the heathens who would take it. [Ubisoft]… Expand"}, {"name": "Scarlet Nexus", "details_link": "https://www.metacritic.com/game/pc/scarlet-nexus", "publisher": "Bandai Namco Games", "release_date": "Jun 25 2021", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/f4d7cc9d4bf2e3627a4f0d5a548eb354-98.jpg", "descriptions": "Unleash the Power of the Mind - In a far distant future, a psionic hormone was discovered in the human brain, granting people extra-sensory powersand changing the world as we know it. Just as humanity was entering this new era, deranged mutants known as Others began to descend from the skyUnleash the Power of the Mind - In a far distant future, a psionic hormone was discovered in the human brain, granting people extra-sensory powersand changing the world as we know it. Just as humanity was entering this new era, deranged mutants known as Others began to descend from the sky with a thirst for human brains. Highly resistant to conventional attack methods, extreme measures needed to be taken to battle the overwhelming threat and preserve humanity. Those with acute extra-sensory abilities, known as psionics, were our chance to fight the onslaught from above. To this day, psionics have been scouted for their talents and recruited to the Other Suppression Force (OSF), humanity's last line of defense.\r Take on the role of Yuito Sumeragi, a new recruit to the OSF aiming to become an elite psionic like the one who saved him as a child. Armed with a talent in psycho-kinesis, explore the futuristic city of New Himuka and uncover the mysteries of a Brain Punk future caught between technology and psychic abilities in SCARLET NEXUS. \r\rKINETIC PSYCHIC COMBAT\rUsing psycho-kinetic abilities, the world around you becomes your greatest weapon. Lift, break and throw pieces of your environment to build your attack combos and lay waste to your enemies. \r\rEXTERMINATE THE OTHERS\rDeranged mutants that descended from the sky, immune to conventional weapons and defenses. Tormented by the constant pain of their mutation, they seek brains of living organisms to calm their madness. \r\rDISCOVER A BRAIN PUNK FUTURE\rExplore and protect a futuristic Japanese landscape that combines inspirations from classic anime and western science fiction. \r\rDEEP STORY DRIVEN EXPERIENCE\rDive into a complex story of bonds, courage and heroism crafted by minds behind the iconic Tales of Vesperia.… Expand"}, {"name": "The Disney Afternoon Collection", "details_link": "https://www.metacritic.com/game/pc/the-disney-afternoon-collection", "publisher": "Capcom", "release_date": "Apr 18 2017", "developers": ["Capcom", "Digital Eclipse"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/12115d0ea986f33add8112c9139a0a47-98.jpg", "descriptions": "Starring a cast of Disney characters, The Disney Afternoon Collection takes you back to a golden era of gaming and afternoons filled with adventure. All six classic games feature new and improved visuals and include filtering options that replicate a retro look and feel."}, {"name": "Closure", "details_link": "https://www.metacritic.com/game/pc/closure", "publisher": "Eyebrow Interactive", "release_date": "Jan  1 2009", "developers": ["Eyebrow Interactive"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/ac14063da43b1f24fd8c446b5cbf549e-98.jpg", "descriptions": "In the mysterious world of Closure, only what you see exists. Manipulate lights to phase objects in and out of reality in this multiple-award-winning puzzle game. Play as a strange spider-like demon who explores the stories of three human characters through beautiful, eerie environments suchIn the mysterious world of Closure, only what you see exists. Manipulate lights to phase objects in and out of reality in this multiple-award-winning puzzle game. Play as a strange spider-like demon who explores the stories of three human characters through beautiful, eerie environments such as a decrepit factory, a murky forest, an abandoned carnival, and the strange, surreal realm that connects them together.… Expand"}, {"name": "Dead Rising 2", "details_link": "https://www.metacritic.com/game/pc/dead-rising-2", "publisher": "Capcom", "release_date": "Sep 27 2010", "developers": ["Blue Castle Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Open-World"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/44a49e62b108bf89263072df67318ff9-98.jpg", "descriptions": "Dead Rising 2 takes the franchise to a new level of zombie-killing fun with tens of thousands of zombies, the all new gambling paradise of Fortune City to explore and conquer plus a host of new in-game objects that can all be used as deadly weapons to stave off the zombie assault. DeadDead Rising 2 takes the franchise to a new level of zombie-killing fun with tens of thousands of zombies, the all new gambling paradise of Fortune City to explore and conquer plus a host of new in-game objects that can all be used as deadly weapons to stave off the zombie assault. Dead Rising 2 is set several years after the infamous zombie invasion of Willamette. Unfortunately, the zombie virus was not contained at the conclusion of Dead Rising, spreading unchecked throughout the United States and Dead Rising 2 depicts a country where zombie outbreaks continue to strike. [Capcom]… Expand"}, {"name": "Insurgency: Sandstorm", "details_link": "https://www.metacritic.com/game/pc/insurgency-sandstorm", "publisher": "Focus Home Interactive", "release_date": "Dec 12 2018", "developers": ["New World Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["General", "Action", "Strategy", "General", "Shooter", "First-Person", "Tactical"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/0406cc3c74a6826a13830574bcfd8d9e-98.jpg", "descriptions": "Insurgency: Sandstorm is a team-based, tactical FPS based on lethal close quarters combat and objective-oriented multiplayer gameplay. Experience the intensity of modern combat where skill is rewarded, and teamwork wins the fight."}, {"name": "Klonoa Phantasy Reverie Series", "details_link": "https://www.metacritic.com/game/playstation-5/klonoa-phantasy-reverie-series", "publisher": "Bandai Namco Games", "release_date": "Jul  8 2022", "developers": ["Bandai Namco Games", "MONKEYCRAFT Co. Ltd."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/69397b9d32f7925fadde4a4266c9938c-98.jpg", "descriptions": "Klonoa Phantasy Reverie Series brings back \"Klonoa: Door to Phantomile\" and \"Klonoa 2: Lunatea's Veil\" remastered in one collection to fans new and old. Get ready to set off on an adventure to save the world. Released initially in 1997 by Namco, Klonoa is a side-scrolling platformerKlonoa Phantasy Reverie Series brings back \"Klonoa: Door to Phantomile\" and \"Klonoa 2: Lunatea's Veil\" remastered in one collection to fans new and old. Get ready to set off on an adventure to save the world. Released initially in 1997 by Namco, Klonoa is a side-scrolling platformer featuring a colorful character roster and vibrant game world, it's up to you as Klonoa to embark on a journey to save Phantomile. For the franchise's momentous twenty-fifth birthday, Klonoa: Door to Phantomile and Klonoa 2: Lunatea's Veil are receiving the remaster treatment in a two-in-one set—titled KLONOA Phantasy Reverie Series slated to hit the Nintendo Switch™, PlayStation®5, PlayStation®4, Xbox Series X|S, Xbox One, and Steam. The graphics have received an elegant revamp while Klonoa's beloved world and classic gameplay have been faithfully preserved. The remaster also features an adjustable difficulty level, allowing franchise newcomers to delve right into the action, and long-time fans to get reacquainted with ease.… Expand"}, {"name": "TumbleSeed", "details_link": "https://www.metacritic.com/game/switch/tumbleseed", "publisher": "aeiowu", "release_date": "May  2 2017", "developers": ["Benedict Fritz", "aeiowu", "Team TumbleSeed"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/77495bde964ff43ea0241439bf8208fd-98.jpg", "descriptions": "TumbleSeed is a roguelike about balancing a seed up a dangerous and ever-changing mountain. Avoid holes and defeat corrupted creatures in this dual-stick action adventure."}, {"name": "WindJammers 2", "details_link": "https://www.metacritic.com/game/switch/windjammers-2", "publisher": "DotEmu", "release_date": "Jan 20 2022", "developers": ["DotEmu"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Sports", "Individual", "Other"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/d57f131be8463c0eac0bb1f50182faa5-98.jpg", "descriptions": "The best flying disc game of all time is back! With amazing hand-drawn graphics, crazy new moves, gameplay mechanics and awesome new characters and stages, Windjammers 2 is the sequel you've been dreaming of."}, {"name": "Road 96", "details_link": "https://www.metacritic.com/game/xbox-series-x/road-96", "publisher": "Merge Games", "release_date": "Apr 14 2022", "developers": ["Digixart Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/6f99ae56bb01d5b9b0453b42d23602d3-98.jpg", "descriptions": "Summer 1996. Today is the day! You hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive. On this risky road trip to the border, you'll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\rBut every mile opensSummer 1996. Today is the day! You hit the road. Adventure. Freedom. Escape. Run. Flee the Regime. Try to survive. On this risky road trip to the border, you'll meet incredible characters, and discover their intertwined stories and secrets in an ever-evolving adventure.\rBut every mile opens up a choice to make. Your decisions will change your adventure, change the people you meet, maybe even change the world.\r There are thousands of roads across the authoritarian nation of Petria.\r Which one will you take?… Expand"}, {"name": "Ghostrunner", "details_link": "https://www.metacritic.com/game/playstation-5/ghostrunner", "publisher": "505 Games", "release_date": "Sep 28 2021", "developers": ["ONE MORE LEVEL"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "3D"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/abdd30583ca5f9c9caf72bc1ea9d4ee9-98.jpg", "descriptions": "Ghostrunner is a hardcore FPP slasher packed with lightning-fast action, set in a grim, cyberpunk megastructure. Climb Dharma Tower, humanity's last shelter, after a world-ending cataclysm. Make your way up from the bottom to the top, confront the tyrannical Keymaster, and take your revenge."}, {"name": "Werewolf: The Apocalypse - Heart of the Forest", "details_link": "https://www.metacritic.com/game/pc/werewolf-the-apocalypse---heart-of-the-forest", "publisher": "Walkabout Games", "release_date": "Oct 13 2020", "developers": ["Different Tales"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "Action RPG", "Visual Novel"], "meta_score": 78, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/2/4b82fe6cfbed275e8dae649ed03ee8ed-98.jpg", "descriptions": "Explore the myths and monsters of Europe’s last primeval wilderness. Play as Maia, who arrives at the ancient Białowieża Forest looking to explore her family history. Discover Rage in an adventure game inspired by the experience of the legendary tabletop roleplaying game Werewolf: TheExplore the myths and monsters of Europe’s last primeval wilderness. Play as Maia, who arrives at the ancient Białowieża Forest looking to explore her family history. Discover Rage in an adventure game inspired by the experience of the legendary tabletop roleplaying game Werewolf: The Apocalypse.\r… Expand"}, {"name": "SUPERHOT: MIND CONTROL DELETE", "details_link": "https://www.metacritic.com/game/pc/superhot-mind-control-delete", "publisher": "SUPERHOT", "release_date": "Jul 16 2020", "developers": ["SUPERHOT"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/a80a524636e1377597788b94c6a62a33-98.jpg", "descriptions": "ONE OF US. ONE OF US. Still outnumbered, still outgunned. Enemies swirl around you in a storm of slow motion violence. Battle after battle, each fallen foe pushes you closer to the secrets hiding in the game and each secret gives you more powers to fight the System’s unending opposition."}, {"name": "The Walking Dead: The Telltale Series - The Final Season", "details_link": "https://www.metacritic.com/game/xbox-one/the-walking-dead-the-telltale-series---the-final-season", "publisher": "Telltale Games", "release_date": "Aug 14 2018", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/dcd5c6df3ff278896cef44d5b1203f46-98.jpg", "descriptions": "After years on the road facing threats both living and dead, a secluded school might finally be Clementine’s chance for a home. But protecting it will mean sacrifice. In this gripping, emotional final season, your choices will define your relationships and determine how Clementine’s story ends."}, {"name": "Forgotton Anne", "details_link": "https://www.metacritic.com/game/playstation-4/forgotton-anne", "publisher": "Square Enix", "release_date": "May 15 2018", "developers": ["Throughline Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/9353b3cb74233d11b93b558c854df15b-98.jpg", "descriptions": "Imagine a place where everything that is lost and forgotten goes; old toys, letters, single socks. The Forgotten Lands is a magical world inhabited by Forgotlings; creatures composed of mislaid objects longing to be remembered again. Forgotton Anne is a seamless cinematic adventure game withImagine a place where everything that is lost and forgotten goes; old toys, letters, single socks. The Forgotten Lands is a magical world inhabited by Forgotlings; creatures composed of mislaid objects longing to be remembered again. Forgotton Anne is a seamless cinematic adventure game with light puzzle platforming elements. You play as Anne, the enforcer who keeps order in the Forgotten Lands, as she sets out to quash a rebellion that might prevent her master, Bonku, and herself from returning to the human world... [Square Enix]… Expand"}, {"name": "Call of Duty: Advanced Warfare", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-advanced-warfare", "publisher": "Activision", "release_date": "Nov  3 2014", "developers": ["Sledgehammer Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 78, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/2/5396f84ef622fb128398103045a1850f-98.jpg", "descriptions": "Call of Duty: Advanced Warfare envisions the powerful battlegrounds of the future, where both technology and tactic have evolved to usher in a new era of combat for the franchise. Delivering a stunning performance, Academy Award winning actor Kevin Spacey stars as Jonathan Irons -- one ofCall of Duty: Advanced Warfare envisions the powerful battlegrounds of the future, where both technology and tactic have evolved to usher in a new era of combat for the franchise. Delivering a stunning performance, Academy Award winning actor Kevin Spacey stars as Jonathan Irons -- one of the most powerful men in the world -- shaping this chilling vision of the future of war. The game takes place in a plausible future in which technological progress and today's military practices have converged with powerful consequences. In this carefully researched and crafted vision of the future, Private Military Corporations (PMCs) have become the dominant armed forces for countless nations outsourcing their military needs, redrawing borders and rewriting the rules of war. And Jonathan Irons, the founder and president of the world's largest PMC, Atlas Corporation, is at the center of it all.\r Suit up for combat in exoskeletons that evolve every aspect of a soldier's battle readiness, enabling combatants to deploy with an advanced lethality and eliminating the need for specialization. Players experience enhanced player movement and verticality through boost jumps and grappling, covert cloaking abilities, and biomechanics that provide unparalleled strength, awareness, endurance, and speed. With the advent of the exoskeleton and newly advanced armor and weaponry, every soldier commands tactical freedom in any terrain unlike ever before, fundamentally changing the way gamers play Call of Duty across all modes… Expand"}, {"name": "MotorStorm RC", "details_link": "https://www.metacritic.com/game/playstation-vita/motorstorm-rc", "publisher": "SCEA", "release_date": "Mar  6 2012", "developers": ["Evolution Studios"], "platforms": ["PlayStation 3", "PlayStation Vita"], "genres": ["Driving", "Racing", "Simulation", "Arcade", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/129c06571a788ad13e35df8a0a278f93-98.jpg", "descriptions": "A unique blend of old-school and contemporary racing gameplay, MotorStorm RC is an addictive racer, with social interaction at the fore.  Players will be able to build an impressive garage of vehicles, with 24 vehicles initially available to unlock in the game, with DLC and expansion packsA unique blend of old-school and contemporary racing gameplay, MotorStorm RC is an addictive racer, with social interaction at the fore.  Players will be able to build an impressive garage of vehicles, with 24 vehicles initially available to unlock in the game, with DLC and expansion packs allowing gamers to access new tracks, vehicles, and more, planned after launch.… Expand"}, {"name": "AstroPop", "details_link": "https://www.metacritic.com/game/xbox-360/astropop", "publisher": "Oberon Media", "release_date": "Mar 22 2006", "developers": ["PopCap"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Matching", "General"], "meta_score": 78, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/316d5a3ee66df68d4cf0b71ab935fadf-98.jpg", "descriptions": "[Xbox Live Arcade]  Fire your rockets and blast off to fast-paced, arcade-puzzle action. Astropop blends fast twitch challenge with an offbeat, fun storyline. Choose from four space pilots, each with unique abilities and weaponry. Then grab, group, and blast bricks to create combos and clear[Xbox Live Arcade]  Fire your rockets and blast off to fast-paced, arcade-puzzle action. Astropop blends fast twitch challenge with an offbeat, fun storyline. Choose from four space pilots, each with unique abilities and weaponry. Then grab, group, and blast bricks to create combos and clear a path to the stars. As you progress, a mysterious link between the pilots unfolds against a backdrop of spectacular graphics, captivating sound effects, and myriads of scoring opportunities. Astropop's two different gameplay modes (Classic & Survival), coupled with 33 challenging bonus rounds, offers hours of extraordinary replay value for players of all ages and skill levels. [Xbox.com]… Expand"}, {"name": "Dragon Quest VI: Realms of Revelation", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-vi-realms-of-revelation", "publisher": "Nintendo", "release_date": "Feb 14 2011", "developers": ["ArtePiazza"], "platforms": ["iPhone/iPad", "DS"], "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/81db451f938209999a2e784bd6080fd6-98.jpg", "descriptions": "Dragon Quest VI: Realms of Reverie for Nintendo DS brings the classic console title into the handheld scene. Explore two parallel worlds while distinguishing reality from illusion and seeking to discover the true meaning of your very existence. [Square Enix]"}, {"name": "Theatrhythm Final Fantasy", "details_link": "https://www.metacritic.com/game/3ds/theatrhythm-final-fantasy", "publisher": "Square Enix", "release_date": "Jul  3 2012", "developers": ["indieszero"], "platforms": ["iPhone/iPad", "3DS"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/e5b1e8072f6db2b254ed7c4d79d022e3-98.jpg", "descriptions": "This year marks the 25th anniversary of FINAL FANTASY, and THEATRHYTHM FINAL FANTASY is the first music rhythm game in the history of the world famous franchise.\r Developed by rhythm game veteran indieszero, SQUARE ENIX brings more than 70 musical scores spanning 25 years to THEATRHYTHMThis year marks the 25th anniversary of FINAL FANTASY, and THEATRHYTHM FINAL FANTASY is the first music rhythm game in the history of the world famous franchise.\r Developed by rhythm game veteran indieszero, SQUARE ENIX brings more than 70 musical scores spanning 25 years to THEATRHYTHM FINAL FANTASY.   The title features music from key events, lush field themes and decisive battle arrangements.\r THEATRHYTHM FINAL FANTASY features a hybrid of music rhythm gameplay with RPG elements. Adorably re-designed heroes from the catalogue of FINAL FANTASY titles will set out on an adventure to combat memorable villains with the rhythmic taps of the player's stylus.… Expand"}, {"name": "Teleglitch: Die More Edition", "details_link": "https://www.metacritic.com/game/pc/teleglitch-die-more-edition", "publisher": "Paradox Interactive", "release_date": "Jul 24 2013", "developers": ["Johamm Tael & Mihkel Tael"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Shoot-'Em-Up", "Sci-Fi", "Sci-Fi", "Top-Down"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/9ae738014c2224d89ff417cd2b10410a-98.jpg", "descriptions": "Teleglitch is a roguelike top-down shooter with pixel graphics."}, {"name": "Lost in Random", "details_link": "https://www.metacritic.com/game/pc/lost-in-random", "publisher": "Electronic Arts", "release_date": "Sep 10 2021", "developers": ["Zoink!"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/50b9cf7056d14beffa9d77535c4fa911-98.jpg", "descriptions": "Play the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, fromPlay the odds in Lost in Random™, a gothic fairytale-inspired action adventure where every citizen’s fate is determined by the roll of a dice. Ruled by a wicked Queen, the kingdom of Random is divided into six shadowy realms where life is dictated by a cursed black dice. In this story, from the award-winning Swedish game studio Zoink and penned by Eisner Award-winning Adventure Time and Marvel Comics The Unbeatable Squirrel Girl author Ryan North, you’ll join Even, a penniless girl who’s down on her luck, in a dark quest to save her beloved sister. With her companion Dicey, a small and strange living dice, Even must learn to embrace the chaos of Random, uncovering an age-old tale with a modern message. Walk Random’s mysterious cobbled streets, meet its unpredictable residents, and take on courageous quests. Engage in fearsome battles with a unique blend of tactical combat, card collection, and explosive dice gameplay. It’s time to adapt or perish, as you battle inside giant board game arenas that change with every dice throw! Learn how to tip the odds in your favor, and dive into a dark wonderland where only the brave survive.… Expand"}, {"name": "Age of Empires: Mythologies", "details_link": "https://www.metacritic.com/game/ds/age-of-empires-mythologies", "publisher": "THQ", "release_date": "Nov 24 2008", "developers": ["Griptonite Games"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "General", "Historic", "Historic", "Tactics"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/f061af5c1569766c0067ec0cbd47e1c3-98.jpg", "descriptions": "Age of Empires: Mythologies is inspired by the Windows PC series Age of Empires and built on the Age of Empires: Age of Kings' game engine. Featuring three playable civilizations with individual campaigns - the Egyptians, Greeks and the Norse - Age of Empires: Mythologies allows players toAge of Empires: Mythologies is inspired by the Windows PC series Age of Empires and built on the Age of Empires: Age of Kings' game engine. Featuring three playable civilizations with individual campaigns - the Egyptians, Greeks and the Norse - Age of Empires: Mythologies allows players to lead mighty heroes and legendary monsters, call down divine powers of the gods, and change the tide of battle with an all-new active combat system. Age of Empires: Mythologies also offers an immersive multiplayer experience with unique maps, customizable rules, a new skirmish mode and single-cart game sharing, allowing players anywhere to go head-to-head worldwide. [THQ]… Expand"}, {"name": "Lone Echo II", "details_link": "https://www.metacritic.com/game/pc/lone-echo-ii", "publisher": "Oculus Studios", "release_date": "Oct 12 2021", "developers": ["Ready at Dawn"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/c1df4dac64718329ffec6ad6ef6b55ca-98.jpg", "descriptions": "Jack and Liv are back in Lone Echo II. Return to the rings of Saturn in this highly-anticipated sequel, to unravel the mysteries of Lone Echo and journey deeper into space – past the very boundaries of time itself."}, {"name": "Project Warlock", "details_link": "https://www.metacritic.com/game/pc/project-warlock", "publisher": "Buckshot Software", "release_date": "Oct 18 2018", "developers": ["Buckshot Software"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/2222e1e52ece4f69c53da165c9c8aeb8-98.jpg", "descriptions": "Project Warlock is a first person shooter that fans of Doom, Hexen and Wolfenstein cannot miss. It serves you an exploding cocktail of bullets, spells and monsters. In Project Warlock you battle through 60 levels of non stop action packed with bloodthirsty enemies and challenging bosses. TheProject Warlock is a first person shooter that fans of Doom, Hexen and Wolfenstein cannot miss. It serves you an exploding cocktail of bullets, spells and monsters. In Project Warlock you battle through 60 levels of non stop action packed with bloodthirsty enemies and challenging bosses. The game offers not just firepower, but perk-based character development, weapon upgrades and unlockable spells system.… Expand"}, {"name": "Donkey Kong Country", "details_link": "https://www.metacritic.com/game/game-boy-advance/donkey-kong-country", "publisher": "Nintendo", "release_date": "Jun  9 2003", "developers": ["Rare Ltd."], "platforms": "Game Boy Advance", "num_players": "", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/01070a44494cee9ed0c215d731871d2b-98.jpg", "descriptions": "Welcome to Donkey Kong Country, a place where ostriches wear running shoes, apes wear neckties, and rhinoceros gracefully leap across gaping canyons with a style and flair that would make the great Evel Knievel envious.  This remake of the SNES classic revamps the Donkey Kong CountryWelcome to Donkey Kong Country, a place where ostriches wear running shoes, apes wear neckties, and rhinoceros gracefully leap across gaping canyons with a style and flair that would make the great Evel Knievel envious.  This remake of the SNES classic revamps the Donkey Kong Country gameplay with new minigames, a new Attack mode, and the ability to save your progress anywhere.  Whether you're looking for a nostalgic stroll through the jungle or you're new to the Donkey Kong world, Donkey Kong Country keeps you on your toes with platform challenges, dance minigames, and unique enemies.… Expand"}, {"name": "Murder by Numbers", "details_link": "https://www.metacritic.com/game/switch/murder-by-numbers", "publisher": "The Irregular Corporation", "release_date": "Mar  5 2020", "developers": ["Mediatonic"], "platforms": ["PC", "Stadia", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/7e077ab08a4bac453ffd723a1d056165-98.jpg", "descriptions": "Los Angeles, 1996. Honor Mizrahi was just an actress on a hit TV detective show. But when her boss ends up dead just minutes after he fires her,she finds herself starring in her own murder mystery. Teaming up with SCOUT, a reconnaissance robot thrown away after a mysterious incident, sheLos Angeles, 1996. Honor Mizrahi was just an actress on a hit TV detective show. But when her boss ends up dead just minutes after he fires her,she finds herself starring in her own murder mystery. Teaming up with SCOUT, a reconnaissance robot thrown away after a mysterious incident, she sets out to clear her name - and a new detective duo is born!\r Investigate a range of murders across TV studios, glitzy award shows, drag clubs, and more - all set to an energetic soundtrack from famed composer Masakazu Sugimori (Phoenix Wright: Ace Attorney, Ghost Trick and Viewtiful Joe).\r Uncover a dark conspiracy by interrogating a wild range of weird and wonderful characters, designed by the incomparable Hato Moa, creator of Hatoful Boyfriend.… Expand"}, {"name": "Football Manager 2021", "details_link": "https://www.metacritic.com/game/xbox-series-x/football-manager-2021", "publisher": "Sega", "release_date": "Nov 30 2020", "developers": ["Sports Interactive"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Xbox Series X"], "num_players": "Up to 32 ", "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/34ccd144edb5600f95f0e332f8317669-98.jpg", "descriptions": "Football Manager 2021 Xbox Edition brings the depth, detail, and drama of the world’s favourite football management simulation series to Xbox.\rExperience the closest thing to being a real manager by taking charge of the world’s greatest football teams and playing the beautiful game yourFootball Manager 2021 Xbox Edition brings the depth, detail, and drama of the world’s favourite football management simulation series to Xbox.\rExperience the closest thing to being a real manager by taking charge of the world’s greatest football teams and playing the beautiful game your way. FM21 Xbox achieves football authenticity that other management games can only aspire to.\r Based on FM Touch, FM21 Xbox is fully optimised for victory with the Xbox Controller for Series X|S and Xbox One.… Expand"}, {"name": "Zero Escape: Zero Time Dilemma", "details_link": "https://www.metacritic.com/game/pc/zero-escape-zero-time-dilemma", "publisher": "Aksys Games", "release_date": "Jun 29 2016", "developers": ["Spike Chunsoft"], "platforms": ["3DS", "PlayStation 4", "PlayStation Vita", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/3f7796adb7f05b1893a5f1d3024aa077-98.jpg", "descriptions": "Zero Time Dilemma is the third entry in the acclaimed Zero Escape series. The mysterious Zero traps 9 participants within an underground shelter, dividing them equally between 3 wards that are connected to an elevator shaft in the middle. The only way out  passing through a locked X-Door toZero Time Dilemma is the third entry in the acclaimed Zero Escape series. The mysterious Zero traps 9 participants within an underground shelter, dividing them equally between 3 wards that are connected to an elevator shaft in the middle. The only way out  passing through a locked X-Door to access the elevator. Six passwords are required to unlock the door, and each password is revealed only after a participant dies. Zeros Decision Game will offer teams the opportunity to kill other participants through a variety of means to obtain the necessary passwords so they may escape\r December 31, 2028. Nevada desert. Nine people have been living and performing experiments for the past five days in the Dcom facility. On the sixth day, they discover they are trapped in confinement rooms, an unfamiliar black bracelet strapped to their left wrists. A mysterious figure in a mask appears before them, demanding that they play the Decision Game. The lives of you, me, and the human race hang in the balance. Transported to a shelter underground, they are divided into 3 teams and left in separate wards. Which team will manage to stay alive? The fate of all mankind rests on their decision!… Expand"}, {"name": "LEGO Marvel Super Heroes", "details_link": "https://www.metacritic.com/game/pc/lego-marvel-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 22 2013", "developers": ["TT Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/469a1b2b7f04e10f4408f865986f95cb-98.jpg", "descriptions": "LEGO Marvel Super Heroes features an original story where players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world."}, {"name": "League of Legends", "details_link": "https://www.metacritic.com/game/pc/league-of-legends", "publisher": "Riot Games", "release_date": "Oct 27 2009", "developers": ["Riot Games"], "platforms": "PC", "num_players": "Up to 10 ", "genres": ["Role-Playing", "Strategy", "Action RPG", "Real-Time", "MOBA", "MOBA"], "meta_score": 78, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/1/1d96e6170590ddadd3f9b13af803bc6d-98.jpg", "descriptions": "Join forces with your closest allies as you unite to defeat your foes in deadly multiplayer battle arenas. League of Legends combines elements from both strategy and role playing games to bring you a unique and dynamic player experience. As a Summoner, you will have your own distinct,Join forces with your closest allies as you unite to defeat your foes in deadly multiplayer battle arenas. League of Legends combines elements from both strategy and role playing games to bring you a unique and dynamic player experience. As a Summoner, you will have your own distinct, customizable avatar that grows in power as you move through the game. In each battle you will select and call forth one of dozens of Champions to control and engage in head-to-head combat against teams of highly trained warriors. Choose your allies wisely, for the stakes are high. In the League, every battle means more than life or death as the balance of power shifts with each victory or defeat. [Riot Games]… Expand"}, {"name": "Rabbids Go Home", "details_link": "https://www.metacritic.com/game/wii/rabbids-go-home", "publisher": "Ubisoft", "release_date": "Nov  1 2009", "developers": ["Ubisoft Montpellier"], "platforms": "Wii", "genres": ["Action Adventure", "Adventure", "Puzzle", "Action", "General", "General", "Linear"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/11f6b7fac584ad30231aa14c9593a027-98.jpg", "descriptions": "The Rabbids first comedy-adventure takes them to the moon or bust. Those crazy Rabbids have an infallible plan: collect all the human stuff they can find, heap it onto a giant pile and literally climb home to the moon. But not so fast.  The Humans revolt, unleashing the Verminators whoseThe Rabbids first comedy-adventure takes them to the moon or bust. Those crazy Rabbids have an infallible plan: collect all the human stuff they can find, heap it onto a giant pile and literally climb home to the moon. But not so fast.  The Humans revolt, unleashing the Verminators whose only objective is to exterminate the Rabbids. Rabbids Go Home game features include: The Rabbids First Comedy-Adventure: Control two Raving Rabbids and their shopping cart and cause mayhem in a world full of uptight Humans with shopping on the brain. Collect varying sizes of human stuff to build the Rabbids sky-high pile of junk in their quest to reach the moon. Make a huge mess and provoke hilarious situations in over 15 striking game environments: Scour through supermarkets, race across rooftops, jet past airports and boost through the Bayou, visiting the game's unique take on everyday places. Play over 40 missions: Race, chase, boost and generally run amok while scaring the Humans right down to their undies - literally! Ridicule reams of relentless enemies and their nasty pooches in an increasingly paranoid world of Rabbid-haters. Unique Art Direction: Encounter a cast of colorful, oddball characters and explore a remarkable parody of the modern world as if you were living inside an interactive cartoon! Variety of Gameplay: Soup up your shopping cart with a Jet Ski, an airplane reactor, or a hospital Bubble Bed to wreak endless havoc everywhere you turn. Learn to pilot your cart while boosting, jumping, gliding, floating and flying. [Ubisoft]… Expand"}, {"name": "Warhammer 40,000: Mechanicus", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-mechanicus", "publisher": "Kasedo Games", "release_date": "Nov 15 2018", "developers": ["Bulwark Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/25215c205acde6bfa24e091b0ab81d36-98.jpg", "descriptions": "Take control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you'll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations usingTake control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you'll lead the expedition on the newly rediscovered planet of Silva Tenebris. Manage resources, discover long-forgotten tech, plan tactical operations using the Noosphere technology and control your Tech-Priests every move.Your every decision will shape the missions ahead and ultimately decide the fate of the troops under your command. However, choose your path carefully - the Imperium depends on it.* AugmentFlesh is weak! Upgrade your Tech-Priests limbs with mechanical augments made from the blessed metals of the Omnissiah. Customize your team with hundreds of possibilities, creating a squad to suit your playstyle.* Difficult DecisionsMake tough decisions that will forge the future from your Ark Mechanicus, The Caestus Metalican, and send you towards alternate endings for a truly unique playthrough.* Experience the NoosphereUse the Adeptus Mechanicus' evolved human cognition to scan unexplored tombs for valuable data in order to gain a tactical advantage over your enemy.* The LibraryA compelling story written by Black Library author, Ben Counter, specifically crafted to fit the unique personality of the Adeptus Mechanicus faction.… Expand"}, {"name": "The Movies: Stunts & Effects", "details_link": "https://www.metacritic.com/game/pc/the-movies-stunts-effects", "publisher": "Activision", "release_date": "Jun  6 2006", "developers": ["Lionhead Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/034e6e5ca632665eb9d4d54b99a4efd3-98.jpg", "descriptions": "The Movies: Stunts & Effects allows players to hone their movie making skills with features that can turn an ordinary script into an extraordinary blockbuster.  In addition to stunts and effects, the game introduces new backdrops, costumes and props, as well as upgrades to the Advanced MovieThe Movies: Stunts & Effects allows players to hone their movie making skills with features that can turn an ordinary script into an extraordinary blockbuster.  In addition to stunts and effects, the game introduces new backdrops, costumes and props, as well as upgrades to the Advanced Movie Making mode that lets players take control of even more movie features.  Players are further immersed into the Hollywood lifestyle as they train and manage stuntmen, as well as compete for industry awards and achievements by uploading their movies to www.themoviesgame.com for the entire world to see. [Activision]… Expand"}, {"name": "Observer", "details_link": "https://www.metacritic.com/game/pc/observer", "publisher": "Aspyr", "release_date": "Aug 15 2017", "developers": ["Bloober Team"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/6eb108d66e1071209129636fc2295df4-98.jpg", "descriptions": "What would you do if your fears were hacked? >observer_ is a cyberpunk horror game from Bloober Team, the creators of Layers of Fear. Play as an Observer, the new front line of neural police, as you hack into the jagged minds of the insane."}, {"name": "Vengeful Guardian: Moonrider", "details_link": "https://www.metacritic.com/game/switch/vengeful-guardian-moonrider", "publisher": "The Arcade Crew", "release_date": "Jan 12 2023", "developers": ["JoyMasher"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/4800ba627019d821ca17bf647bdc4b10-98.jpg", "descriptions": "Vengeful Guardian: Moonrider is a side-scrolling action platformer that channels the golden age of classic 16-bit action games in a full-throttle quest for revenge. Created to defend a totalitarian state, the Moonrider rejects its programming and now seeks vengeance on its creators."}, {"name": "Mobile Suit Gundam: Extreme VS. MaxiBoost ON", "details_link": "https://www.metacritic.com/game/playstation-4/mobile-suit-gundam-extreme-vs-maxiboost-on", "publisher": "Bandai Namco Games", "release_date": "Jul 30 2020", "developers": ["Bandai Namco Games"], "platforms": "PlayStation 4", "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/e204b3b840ba7a952c2b98fa894eb995-98.jpg", "descriptions": "MOBILE SUIT GUNDAM EXTREME VS. MAXIBOOST ON” is a true port of the arcade version that started operation in 2016 in Japan—and is still popular today. Coordinate and lay waste to your rivals in fierce PVP fighting combat iconic to the EXTREME VS. series. Join the battle with 183 units fromMOBILE SUIT GUNDAM EXTREME VS. MAXIBOOST ON” is a true port of the arcade version that started operation in 2016 in Japan—and is still popular today. Coordinate and lay waste to your rivals in fierce PVP fighting combat iconic to the EXTREME VS. series. Join the battle with 183 units from the entire Gundam universe, each with different abilities ready to suit your play style. Choose between three different EX BURST Systems: FIGHTING BURST, EXTEND BURST and SHOOTING BURST!… Expand"}, {"name": "Golf Peaks", "details_link": "https://www.metacritic.com/game/switch/golf-peaks", "publisher": "7Levels", "release_date": "Mar 14 2019", "developers": ["Afterburn"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Puzzle", "General", "Individual", "Golf", "Arcade"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/832f186809009286c67d5d781b010954-98.jpg", "descriptions": "No understanding of golf is required – just grab your Joy-Con controllers and conquer the mountain peaks by making your way to the hole, however not in the usual skill-shot based style. Instead, plan your strategy and use action cards to move the ball! Solve over 100 enjoyable yetNo understanding of golf is required – just grab your Joy-Con controllers and conquer the mountain peaks by making your way to the hole, however not in the usual skill-shot based style. Instead, plan your strategy and use action cards to move the ball! Solve over 100 enjoyable yet challenging puzzles accompanied by relaxing music and minimalist, eye-pleasing graphics and conquer the summits. Golf Peaks is a relaxing puzzler where you climb mountains by playing golf. The title uniquely combines puzzle mechanics with an easy-to-learn card-based movement system, providing the player with numerous action cards. Each card moves the ball in a different way and at varying distances.… Expand"}, {"name": "Deus Ex: Human Revolution - The Missing Link", "details_link": "https://www.metacritic.com/game/playstation-3/deus-ex-human-revolution---the-missing-link", "publisher": "Square Enix", "release_date": "Oct 18 2011", "developers": ["Eidos Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/518c7185ef464d78b033cc2def48d0d2-98.jpg", "descriptions": "The DEUS EX: HUMAN REVOLUTION conspiracy grows deeper in The Missing Link. During lead character Adam Jensen’s quest for the truth in DEUS EX: HUMAN REVOLUTION, he mysteriously vanishes for three days. Where was he? What did he find out? The Missing Link reveals it all."}, {"name": "Asphalt 4: Elite Racing", "details_link": "https://www.metacritic.com/game/ds/asphalt-4-elite-racing", "publisher": "Gameloft", "release_date": "Jul  6 2009", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "DS"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/bb4ba55ab0a2718654fa9a40f5d9b033-98.jpg", "descriptions": "[DSiWare]  For the racing elite, the world is their racetrack. Choose among 28 dream cars and motorcycles from the world's most prestigious manufacturers. Then race your way through eight of the most renowned cities, fully rendered in 3-D. Control your speed machine with either standard or[DSiWare]  For the racing elite, the world is their racetrack. Choose among 28 dream cars and motorcycles from the world's most prestigious manufacturers. Then race your way through eight of the most renowned cities, fully rendered in 3-D. Control your speed machine with either standard or touch-screen controls for precision driving. Photos taken with the Nintendo DSi™ Camera can be used as your personal icon or can appear throughout the various environments, including the garage where you can customize and tune your vehicles. From New York to Shanghai, Paris to Dubai, you'll weave a course through busy streets in six kinds of races plus four-player Multiplayer mode. Avoid police, demolish competitors and pass the leader to win. You'll need to floor it at every straightaway and push every drift to the limit to stay one step ahead and become the ultimate VIP of urban racing. [Nintendo]… Expand"}, {"name": "Shaun White Snowboarding: Road Trip", "details_link": "https://www.metacritic.com/game/wii/shaun-white-snowboarding-road-trip", "publisher": "Ubisoft", "release_date": "Nov 16 2008", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Snowboarding", "Snowboarding", "Ski / Snowboard"], "meta_score": 78, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/a63e6ba22bf12d700b8ae11a1375af72-98.jpg", "descriptions": "Developed in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride.Developed in close collaboration with Shaun White, Olympic Gold Medalist and eight-time X Games Gold Medalist, Shaun White Snowboarding allows players to enter a world of total freedom, where they can create their own experience and choose how, where, and with whom they want to ride. Everybody loves a road trip! You and your crew travel the world to participate in a variety of the largest and craziest events to become a world-renowned athlete. Life on the road to success wouldn’t be the same without the support of your friends, who will always be there to help you out and keep your head on your shoulders. Stand together with your friends – both in the game and in the living room – and you will be able to conquer the madness that fame brings. Go on a globetrotting adventure with Shaun White as your partner – Ubisoft worked in close contact with Shaun White in order to infuse the experience with the most authentic elements of his riding style, personality and sense of humor. Shaun will act as a good-natured friend and mentor to the player, hooking him up with the right friends to conquer challenges together, introduce him to new locales, or simply be around to share in a laugh. Wii Balance Board Integration – Get yourself into the game like never before by using the Wii Board to control your rider. Control your carves, jumps and grinds with the intuitiveness and fun of having a snowboard in your own living room. Engage in a seamlessly integrated multiplayer experience for two to four players, where every player is active in the game at all times. Getting your name out there by doing well as a pro snowboarder is bound to get you some recognition. As your fame grows, so too does your ability to take on bigger and bigger challenges, from new mountains to more prestigious events and competitions. Fame, however, isn’t everything. You’ll need to gain your friends’ respect by riding with style in order to gain their support; they will help you find hidden areas, share their favorite music tracks and keep you laughing. [Ubisoft]… Expand"}, {"name": "Dynasty Warriors 4", "details_link": "https://www.metacritic.com/game/playstation-2/dynasty-warriors-4", "publisher": "Koei", "release_date": "Mar 25 2003", "developers": ["Omega Force"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 78, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/4/4683aca17344b475bb9a08d8e8bcf9e2-98.jpg", "descriptions": "Dynasty Warriors 4 takes battlefield action to the next level, allowing players to experience the thrill of taking on multiple opponents at once and fighting against impossible odds. A host of new features add greater depth to the gameplay, as well as more insight into the characters andDynasty Warriors 4 takes battlefield action to the next level, allowing players to experience the thrill of taking on multiple opponents at once and fighting against impossible odds. A host of new features add greater depth to the gameplay, as well as more insight into the characters and turbulent events of the Three Kingdoms era. The concepts of Honor and Loyalty in the face of adversity serve as the main theme for the game. The obligations of generals to their Lords and Allies guide the paths of these warriors as the fight to unify a divided empire. [KOEI]… Expand"}, {"name": "Shox", "details_link": "https://www.metacritic.com/game/playstation-2/shox", "publisher": "Electronic Arts", "release_date": "Nov 19 2002", "developers": ["Electronic Arts"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/703bdaa5c9d76a4716a2cfefb1bfa65d-98.jpg", "descriptions": "The fun starts with 24 licensed high-voltage vehicles from famous makers like Audi, BMW, Toyota, Mitsubishi, Subaru, Lancia, and Ford. Players then race through three-lap circuits of snow, desert, or jungle landscapes, sliding through dusty roads, slipping on ice, and shredding throughThe fun starts with 24 licensed high-voltage vehicles from famous makers like Audi, BMW, Toyota, Mitsubishi, Subaru, Lancia, and Ford. Players then race through three-lap circuits of snow, desert, or jungle landscapes, sliding through dusty roads, slipping on ice, and shredding through foliage. The competition really heats up on the open road though, as six cars try to muscle into prime position, wreaking havoc on their way to the finish line. Within each track are \"Shox Zones\" where players are awarded Bronze, Silver, and Gold placements based on their driving skills. Earning Gold in all three Shox Zones on a single track unlocks a new night circuit. Players can also put up their own cars as collateral in head-to-head Gambling Mode to collect the ultimate off-road vehicle collection. [Electronic Arts]… Expand"}, {"name": "Super Ghouls 'n Ghosts", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-ghouls-n-ghosts", "publisher": "Capcom", "release_date": "Sep 23 2002", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/d8f4bf9ec4ce2a284b93633623acd8a8-98.jpg", "descriptions": "As dauntless knight Arthur you are caught up in the most dangerous of quests! A spell has been cast upon the kingdom. Your fair maiden, Princess Prin Prin has been snatched up by the evil emperor. Only as Arthur can you get her back from the creatures of the undead that haunt the land. TestAs dauntless knight Arthur you are caught up in the most dangerous of quests! A spell has been cast upon the kingdom. Your fair maiden, Princess Prin Prin has been snatched up by the evil emperor. Only as Arthur can you get her back from the creatures of the undead that haunt the land. Test your courage and skill to the limit. You must keep up the quest. On your journey, your mightiest weapon of all awaits you... MAGIC!… Expand"}, {"name": "The Thing", "details_link": "https://www.metacritic.com/game/xbox/the-thing", "publisher": "VU Games", "release_date": "Sep  9 2002", "developers": ["Computer Artworks"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/254f54aa18a62aca0826552446173af7-98.jpg", "descriptions": "While investigating the enigmatic deaths of American scientists in the Antarctic, a military rescue team encounters a strange shape-shifting alien life-form that assumes the appearance of the people it kills. As the team leader, you must forget everything you ever learned about obliteratingWhile investigating the enigmatic deaths of American scientists in the Antarctic, a military rescue team encounters a strange shape-shifting alien life-form that assumes the appearance of the people it kills. As the team leader, you must forget everything you ever learned about obliterating aliens simply with a barrage of violent ammunition--this monster is difficult to see, hard to kill, and seemingly impossible to evade. In the midst of this lurking terror, you must convince your squad to cooperate and complete tasks essential to both the success of the mission and your own survival.… Expand"}, {"name": "Tropico: Paradise Island", "details_link": "https://www.metacritic.com/game/pc/tropico-paradise-island", "publisher": "Take-Two Interactive", "release_date": "Feb  3 2002", "developers": ["BreakAway Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Miscellaneous", "Tycoon", "Management", "Compilation", "Tycoon", "Government", "Business / Tycoon"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/5305b4d7a329176246e99f99d9077054-98.jpg", "descriptions": "As the all-powerful dictator El Presidente in this \"Tropico\" expansion, face new challenges as you build your thriving island paradise... not to mention a bountiful Swiss bank account. Paradise Island provides more tourist attractions such as beach villas, tennis courts, and nature preservesAs the all-powerful dictator El Presidente in this \"Tropico\" expansion, face new challenges as you build your thriving island paradise... not to mention a bountiful Swiss bank account. Paradise Island provides more tourist attractions such as beach villas, tennis courts, and nature preserves to help lure those Yanqui tourists. And for you \"evil\" tyrants out there, new dictator attributes allow for the success of even the most unjust regime! It may be time to enforce Martial Law, because it looks like there's trouble in paradise! [Take 2]… Expand"}, {"name": "NASCAR Heat 2002", "details_link": "https://www.metacritic.com/game/xbox/nascar-heat-2002", "publisher": "Infogrames", "release_date": "Nov 14 2001", "developers": ["Monster Games Inc."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/c50adf688ea6b3e45e35aa95365aa7e6-98.jpg", "descriptions": "Your favorite drivers in their current cars racing at your favorite tracks. PLUS Beat the Heat Challenges where you can take on 36 actual race-day situations designed by NASCAR® drivers. You can also compete one-on-one against your favorite driver in Race the Pro and try to beat theirYour favorite drivers in their current cars racing at your favorite tracks. PLUS Beat the Heat Challenges where you can take on 36 actual race-day situations designed by NASCAR® drivers. You can also compete one-on-one against your favorite driver in Race the Pro and try to beat their best lap times.… Expand"}, {"name": "MechWarrior 4: Black Knight Expansion", "details_link": "https://www.metacritic.com/game/pc/mechwarrior-4-black-knight-expansion", "publisher": "Microsoft Game Studios", "release_date": "Oct 31 2001", "developers": ["Cyberlore Studios"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Combat"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/f45a760e9396e451f89333b442be5551-98.jpg", "descriptions": "You're back on Kentares IV, and this time, you don't have to play nice. Enlist in the notorious Black Knight Legion, climb aboard any one of five new 'Mechs, and deliver some payback for all the injustices you've been dealt. Put your mercenary skills to the ultimate test in a world ravagedYou're back on Kentares IV, and this time, you don't have to play nice. Enlist in the notorious Black Knight Legion, climb aboard any one of five new 'Mechs, and deliver some payback for all the injustices you've been dealt. Put your mercenary skills to the ultimate test in a world ravaged by civil war. Use the new Black Market feature to get the equipment and weapons you need, when you need it.  [Microsoft]… Expand"}, {"name": "Cool Boarders 2001", "details_link": "https://www.metacritic.com/game/playstation-2/cool-boarders-2001", "publisher": "SCEA", "release_date": "May 21 2001", "developers": ["Idol Minds"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/913c5828ca96cf465edfcdb6afb6ea65-98.jpg", "descriptions": "The fifth game in the Cool Boarders series, and the 3rd snowbaording game on the PS2, features 10 professional riders including Todd Richards, Michele Taggart, Kevin Jones, and Tara Dakides and includes the Quick Run and a Career Mode."}, {"name": "Ridge Racer V", "details_link": "https://www.metacritic.com/game/playstation-2/ridge-racer-v", "publisher": "Namco", "release_date": "Oct 25 2000", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/b9c73e36a373511bd8b5bc31cb09bcb6-98.jpg", "descriptions": "The asphalt of Ridge City is once again thundering with high-speed action and palm-sweating competition. The checkered flag is flying and so are the cars. Amazingly detailed visuals, from the glowing of heated brake pads tot he smoldering of tires in a power-slide, will have you captivatedThe asphalt of Ridge City is once again thundering with high-speed action and palm-sweating competition. The checkered flag is flying and so are the cars. Amazingly detailed visuals, from the glowing of heated brake pads tot he smoldering of tires in a power-slide, will have you captivated as the battle for supremacy races on. It's all about speed, power, and control. With Ridge Racer V, your search for unforgiving racing intensity is over.… Expand"}, {"name": "NFL Blitz 2001", "details_link": "https://www.metacritic.com/game/dreamcast/nfl-blitz-2001", "publisher": "Midway", "release_date": "Sep 14 2000", "developers": ["Avalanche Software"], "platforms": "Dreamcast", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/8d255b6bbb207261221e7b223f3d8209-98.jpg", "descriptions": "NFL Blitz 2001 for Dreamcast is a worthy update and a giant step above the PlayStation and Nintendo 64 versions of the same name."}, {"name": "Apollo Justice: Ace Attorney", "details_link": "https://www.metacritic.com/game/ds/apollo-justice-ace-attorney", "publisher": "Capcom", "release_date": "Feb 19 2008", "developers": ["Capcom"], "platforms": ["3DS", "iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/956ccf0ee3f021092af2505406eafe23-98.jpg", "descriptions": "This is the fourth game in the series and the first developed specifically for Nintendo DS and sees a change of direction for the story line with the introduction of new defense attorney Apollo Justice and a host of new characters. Players star as rookie defense attorney Apollo Justice as heThis is the fourth game in the series and the first developed specifically for Nintendo DS and sees a change of direction for the story line with the introduction of new defense attorney Apollo Justice and a host of new characters. Players star as rookie defense attorney Apollo Justice as he visits crime scenes, questions key witnesses and collects vital evidence before stepping into the courtroom to prove his clients' innocence. Facing Apollo across the courtroom is the highly talented and flamboyant prosecutor Klavier Gavin who, in addition to being a legal genius, is also lead singer with Gavinners, a highly successful rock band with a string of hits to their name. He may be young and inexperienced but Apollo's confident manner and passion, coupled with his unique ability to uncover witnesses' lies by studying their body language, will prove invaluable assets in the courtroom as he pleads the case for the defense. Thankfully, Apollo is not alone and is aided both in and out of the courtroom by his assistant Trucy, a mysterious female magician. Apollo also receives invaluable advice from his mentor the ultra-cool Kristoph Gavin, elder brother of Klavier, whose perfect logic and natural instincts have won him numerous cases and the respect of his colleagues. [Capcom]… Expand"}, {"name": "The Surge 2", "details_link": "https://www.metacritic.com/game/xbox-one/the-surge-2", "publisher": "Focus Home Interactive", "release_date": "Sep 24 2019", "developers": ["Deck 13"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/b519655b0cd789d0a287f8c23b42248f-98.jpg", "descriptions": "[OVERCOME]On the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm[OVERCOME]On the way to Jericho City, your plane is shot down by a mysterious storm and crash-lands in the outskirts. You wake up weeks later in a derelict detention facility inside the city. Armor-clad soldiers enforce Martial Law, robots are on a rampage, and a dark, expanding nanostorm looms over the cityscape...[SURVIVE]In a bid to survive, explore the sprawling, devastated city of Jericho. Fight its numerous, ferocious threats in brutal, unforgiving combat, slashing and tearing the limbs off your opponents to steal valuable equipment that will make you stronger - strong enough to face the most fearsome, imposing foes lurking in the city.[UPGRADE]With an expanded arsenal of weapons, armors, abilities, implants, and drones to build your character, and a bigger, more varied and more ambitious world, The Surge 2 challenges you to survive and unravel its hidden secrets.* Hardcore, brutal melee combat* Face deadly foes and colossal bosses* Cut off parts of the enemy you want to loot* Rich character progression and customization… Expand"}, {"name": "Rune Factory: A Fantasy Harvest Moon", "details_link": "https://www.metacritic.com/game/ds/rune-factory-a-fantasy-harvest-moon", "publisher": "Natsume", "release_date": "Aug 14 2007", "developers": ["Neverland"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/21715db2ed4a397c005791edc6126535-98.jpg", "descriptions": "You awaken to find yourself in an unfamiliar village with no memory of who you are or how you arrived. Mist, a beautiful young woman comes to your aid and helps you start to build a life for yourself…on a farm. Till the land, grow crops, raise animals, catch fish and battle monsters!You awaken to find yourself in an unfamiliar village with no memory of who you are or how you arrived. Mist, a beautiful young woman comes to your aid and helps you start to build a life for yourself…on a farm. Till the land, grow crops, raise animals, catch fish and battle monsters! Battling against fierce beasts is very important for your survival, but making friends with them is essential for your farm life. Build skills and learn magic as you save your neighbors and uncover the secrets of your forgotten past...Befriend wandering monsters to help with your farm, each with their own special abilities. Upgrade your skills as you use and create hundreds of items and tools. Communicate and exchange items via Wi-Fi. Grow crops, make friends and fall in love. [Natsume]… Expand"}, {"name": "The Tomb Raider Trilogy", "details_link": "https://www.metacritic.com/game/playstation-3/the-tomb-raider-trilogy", "publisher": "Square Enix", "release_date": "Mar 22 2011", "developers": ["Crystal Dynamics"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/22b02961b93bba0f5e94306cb5119d2b-98.jpg", "descriptions": "The Tomb Raider Trilogy contains Tomb Raider Legend, Tomb Raider Anniversary, as well as Tomb Raider Underworld in a HD bundle."}, {"name": "1001 Spikes", "details_link": "https://www.metacritic.com/game/playstation-4/1001-spikes", "publisher": "Nicalis", "release_date": "Jun  3 2014", "developers": ["Nicalis"], "platforms": ["3DS", "PC", "PlayStation Vita", "Wii U", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/7c57b5b8906f75e874a71feb27b868a6-98.jpg", "descriptions": "Aban Hawkins & the 1,001 Spikes is a 2D platformer where you have 1,001 lives to beat the game."}, {"name": "The Walking Dead: 400 Days", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-400-days", "publisher": "Telltale Games", "release_date": "Jul  2 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/b264ee4d7896a1f5eb6b69032e44c9cc-98.jpg", "descriptions": "Join five new characters as they struggle to survive in The Walking Dead: 400 Days"}, {"name": "Disney Guilty Party", "details_link": "https://www.metacritic.com/game/wii/disney-guilty-party", "publisher": "Disney Interactive Studios", "release_date": "Aug 26 2010", "developers": ["Wideload Games Inc."], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/fe904e8f50e5aa06875f05ce17a1be7e-98.jpg", "descriptions": "Disney Guilty Party is a fun and hilarious mystery party game, exclusively for Wii.  Friends and family play as the savvy sleuths of the world-famous Dickens Detective Agency to investigate a series of crimes and identify the guilty party."}, {"name": "Crowns and Pawns: Kingdom of Deceit", "details_link": "https://www.metacritic.com/game/pc/crowns-and-pawns-kingdom-of-deceit", "publisher": "Headup Games", "release_date": "May  6 2022", "developers": ["Tag of Joy"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/6b3d48cff89f0d59a1b2b35a98436a02-98.jpg", "descriptions": "Crowns and Pawns, a modern-day point and click adventure, inspired by classics such as Broken Sword, Monkey Island, Still Life, Syberia and others. Experience the legendary stories of the Grand Duchy of Lithuania, bring to light the villainous branch of the KGB, solve puzzles and followCrowns and Pawns, a modern-day point and click adventure, inspired by classics such as Broken Sword, Monkey Island, Still Life, Syberia and others. Experience the legendary stories of the Grand Duchy of Lithuania, bring to light the villainous branch of the KGB, solve puzzles and follow hints to reveal the secrets of the King who was never crowned.The story follows a girl from Chicago, Milda, who unexpectedly receives an inheritance from her grandfather - a house in Lithuania. She sets off to Europe, but upon arrival she is threatened by an unknown man, demanding that she gives up her inheritance. Determined and intrigued, she explores the run-down house, discovering old documents and clues dating back to the 15th century. Before long, Milda gets dragged into a dangerous search for a long-lost mysterious relic...… Expand"}, {"name": "Atelier Ryza 2: Lost Legends & the Secret Fairy", "details_link": "https://www.metacritic.com/game/playstation-5/atelier-ryza-2-lost-legends-the-secret-fairy", "publisher": "Koei Tecmo Games", "release_date": "Jan 26 2021", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/49ae08afb29dc6bc33f2846f50b5bac8-98.jpg", "descriptions": "Three years have passed since Ryza’s secret grand adventure on Kurken Island. Ryza, the only member of her group to remain on the island, receives a letter from her friend telling her about ruins that may be related to alchemy, along with a mysterious request involving a glowing stone. ThisThree years have passed since Ryza’s secret grand adventure on Kurken Island. Ryza, the only member of her group to remain on the island, receives a letter from her friend telling her about ruins that may be related to alchemy, along with a mysterious request involving a glowing stone. This inspires her to leave the island and venture out to the royal capital, Ashra-am Baird. However, Ryza is unaware that this will lead to the beginning of an imaginative new adventure involving a pursuit of the mysteries of the ruins surrounding the royal capital and a meeting with a strange creature that will change her life.… Expand"}, {"name": "Ace Combat 7: Skies Unknown", "details_link": "https://www.metacritic.com/game/pc/ace-combat-7-skies-unknown", "publisher": "Bandai Namco Games", "release_date": "Jan 31 2019", "developers": ["Project Aces"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 8 ", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/ff86be519369bb51686c770e301f9a7f-98.jpg", "descriptions": "Strap yourself into the cockpit of some of the worlds most formidable fighter planes and skim through the clouds embarking on daring aerial stunts and nerve-shredding tactical dogfights.\r In Ace Combat 7, you take on the role of an Ace  an elite fighter pilot tasked with patrolling theStrap yourself into the cockpit of some of the worlds most formidable fighter planes and skim through the clouds embarking on daring aerial stunts and nerve-shredding tactical dogfights.\r In Ace Combat 7, you take on the role of an Ace  an elite fighter pilot tasked with patrolling the most open and intimidating space on Earth: the sky. Choose from an array of authentic modern and futurist aircraft and load them up with an arsenal of cutting-edge super weapons as unfolding events drive you into ever more dangerous aerial face-offs.\r PlayStation VR support will allow you to actually climb inside the cockpit with a series of exclusive features that create a new level of death-defying immersion.… Expand"}, {"name": "Sairento VR", "details_link": "https://www.metacritic.com/game/pc/sairento-vr", "publisher": "Mixed Realms Pte Ltd", "release_date": "Jan 19 2018", "developers": ["Mixed Realms Pte Ltd"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/a50f386cb549a252fd3e94f38e86a896-98.jpg", "descriptions": "Sairento VR is a mission-driven, VR action role-playing game set in a reimagined Japan in the near future. In Sairento, you play as a member of the Silent Ones - a righteous but covert organization of seemingly ordinary people who practice the long forsaken code and martial arts of theSairento VR is a mission-driven, VR action role-playing game set in a reimagined Japan in the near future. In Sairento, you play as a member of the Silent Ones - a righteous but covert organization of seemingly ordinary people who practice the long forsaken code and martial arts of the ancient samurais and ninjas. You are tasked with uncovering the sinister secret behind other members of the Silent Ones turning into crazed nano-infected shells of their former self and in the process, fight your way through multitudes of your past comrades.… Expand"}, {"name": "Skylanders Imaginators", "details_link": "https://www.metacritic.com/game/xbox-one/skylanders-imaginators", "publisher": "Activision", "release_date": "Oct 16 2016", "developers": ["Toys for Bob"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Action", "Platformer", "3D"], "meta_score": 78, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/7341a7ff667e5592a05376cb7e89e47e-98.jpg", "descriptions": "Use the power of your imagination to create Imaginator Skylanders to battle in the ultimate adventure alongside the almighty Senseis to save Skylands."}, {"name": "Warp", "details_link": "https://www.metacritic.com/game/playstation-3/warp", "publisher": "Electronic Arts", "release_date": "Mar 13 2012", "developers": ["Trapdoor"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/a6946830f5a34441b8007bea7483f91c-98.jpg", "descriptions": "Warp is a puzzle-based stealth action game from Trapdoor."}, {"name": "Wild Arms 3", "details_link": "https://www.metacritic.com/game/playstation-2/wild-arms-3", "publisher": "SCEA", "release_date": "Oct 15 2002", "developers": ["Media.Vision", "Contrail"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/734d59cffdc5e871712952d54f0a2af8-98.jpg", "descriptions": "During desolate times on the \"Sea of Sand\", Drifters venture across the vast lands of Filgaia searching for fortune and adventure. Amidst the deserts lie cities erected from eroded rock and scavenged wood. Towns that a few call home provide rest and solitude for the many travelers of theDuring desolate times on the \"Sea of Sand\", Drifters venture across the vast lands of Filgaia searching for fortune and adventure. Amidst the deserts lie cities erected from eroded rock and scavenged wood. Towns that a few call home provide rest and solitude for the many travelers of the barren wasteland. Tales of mystic relics that harness unmatched powers spread across the land. While some vision the items as treasure, others have deciphered a secret bringing unlimited power. Meanwhile, one object of mythical stature attracts four Drifters to a common place. These four strangers discover the strength in working as a team. Shortly thereafter they learn of an ancient prophecy determining the future of their eroded homeland. Setting aside their differences, they roam the lands and unlock the knowledge and mystical forces making their adventure their destiny. [SCEA]… Expand"}, {"name": "Tales of Xillia", "details_link": "https://www.metacritic.com/game/playstation-3/tales-of-xillia", "publisher": "Namco Bandai Games", "release_date": "Aug  6 2013", "developers": ["Bandai Namco Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Action RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/dcbde0c03763579021ed854cfd748977-98.jpg", "descriptions": "TALES OF XILLIA draws players into the adventures of Jude Mathis, a medical student going to school in the capital city of Fennmont, and Milla Maxwell, a mysterious lady accompanied by four unseen beings.  In a tale that can be lived from either Jude or Milla’s perspective, the two heroes’TALES OF XILLIA draws players into the adventures of Jude Mathis, a medical student going to school in the capital city of Fennmont, and Milla Maxwell, a mysterious lady accompanied by four unseen beings.  In a tale that can be lived from either Jude or Milla’s perspective, the two heroes’ journeys fatefully intersect as they learn that the kingdom of Rashugal has been fatefully experimenting with a powerful device that has effectively been draining the world’s supply of mana.  Faced with the knowledge that continued experiments would result in dangerous results, Milla and Jude join forces to restore peace to a dying world in a dangerous journey that will test their courage and convictions.… Expand"}, {"name": "FIFA 22", "details_link": "https://www.metacritic.com/game/xbox-series-x/fifa-22", "publisher": "Electronic Arts", "release_date": "Sep 27 2021", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 78, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/2/f5804b80cdd67c7bfc67a005d379b2f8-98.jpg", "descriptions": "Powered by Football™, EA SPORTS™ FIFA 22 brings the game even closer to the real thing with fundamental gameplay advances and a new season of innovation across every mode. New gameplay features in FIFA 22 give you more consistency between the posts with a goalkeeper rewrite that brings morePowered by Football™, EA SPORTS™ FIFA 22 brings the game even closer to the real thing with fundamental gameplay advances and a new season of innovation across every mode. New gameplay features in FIFA 22 give you more consistency between the posts with a goalkeeper rewrite that brings more composure to the most important position on the pitch, alongside new ball physics, explosive sprint that better matches the acceleration of the game’s quickest players, and new attacking tactics that let you take control of how your team plays. In Career Mode, live out your football dreams as you create and manage the game’s newest club to glory. VOLTA FOOTBALL rewards you for your flair with restyled small-sided gameplay and new ways to play and progress each season. Get the squad together in Pro Clubs with enhanced team customization and updated progression that puts you in control of your Virtual Pro’s development, and welcome back some of football’s most memorable players as new FUT Heroes in FIFA Ultimate Team™ with a redefined competition structure that makes testing your skills against other players more accessible. However you play, enjoy unrivaled authenticity everywhere with over 17,000 players, 700+ teams, and more than 30 leagues including the UEFA Champions League, CONMEBOL Libertadores, and the brand new UEFA Europa Conference League - only available in FIFA 22.\rGAMEPLAY\rReimagined gameplay creates fundamental advances that you’ll feel across every mode in FIFA 22. A goalkeeper rewrite brings more composure and consistency to the most important position on the pitch, new ball physics reimagine every pass, shot, and goal, and explosive sprint lets you feel the acceleration of the game’s quickest players.\r•\tGoalkeeper Rewrite - A brand new goalkeeper system brings a new level of intelligence to the last line of defence, unlocking more reliable shot-stopping and smarter decision-making between the posts. In FIFA 22, goalkeeper positioning personality replicates the different styles of keepers throughout the game - from the lightning-fast reflexes of world-class shot stoppers like Jan Oblak to the aggression of sweeper keepers such as Ederson.\r•\tTrue Ball Physics - Real-world data imported into FIFA 22 takes the game’s ball physics to a new level of realism. Tuned parameters including speed, swerve, air drag, air resistance, ground friction, and rolling friction mean every touch, trap, shot, volley, pass, and dribble will look, move, and fly like the real thing.\r•\tExplosive Sprint - A new gameplay mechanic that changes the dynamic of one-on-one situations, Explosive Sprint gives you more control over acceleration when dribbling or defending. Lure opponents in and choose when to unleash your full speed to get away from the defender as you drive your team forward in attack.\r… Expand"}, {"name": "Ken Follett's The Pillars of the Earth", "details_link": "https://www.metacritic.com/game/pc/ken-folletts-the-pillars-of-the-earth", "publisher": "Daedalic Entertainment", "release_date": "Aug 15 2017", "developers": ["Daedalic Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/5388ef6f466af551312f509a017e93de-98.jpg", "descriptions": "Based on Ken Follett’s world-bestseller, The Pillars of the Earth retells the story of the village of Kingsbridge in a whole new way. Play as Jack, Aliena, and Philip and change the events of the book through exploration, decision-making and dialogues."}, {"name": "Shadow Warrior 2", "details_link": "https://www.metacritic.com/game/xbox-one/shadow-warrior-2", "publisher": "Devolver Digital", "release_date": "May 19 2017", "developers": ["Flying Wild Hog"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/b90572bc98466bb2a9553055ac51714b-98.jpg", "descriptions": "Shadow Warrior 2 is the evolution of Flying Wild Hog’s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastatingShadow Warrior 2 is the evolution of Flying Wild Hog’s offbeat first-person shooter following the further misadventures of former corporate shogun Lo Wang. Now surviving as a reclusive mercenary on the edge of a corrupted world, the formidable warrior must again wield a devastating combination of guns, blades, magic and wit to strike down the demonic legions overwhelming the world. Battle alongside allies online in four-player co-op or go it alone in spectacular procedurally-generated landscapes to complete daring missions and collect powerful new weapons, armor, and arcane relics of legend.… Expand"}, {"name": "Hatsune Miku: Project Diva F 2nd", "details_link": "https://www.metacritic.com/game/playstation-3/hatsune-miku-project-diva-f-2nd", "publisher": "Sega", "release_date": "Nov 18 2014", "developers": ["Sega"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/580bdfa0305c9d8087257b422df69ef1-98.jpg", "descriptions": "Hatsune Miku: Project DIVA F 2nd features 20 classic songs from the previously Japan-only Playstation Portable games making their first debut in the West, and 20 new songs to the Project DIVA series.  In addition to the new songs, the game features updated gameplay mechanics and controls,Hatsune Miku: Project DIVA F 2nd features 20 classic songs from the previously Japan-only Playstation Portable games making their first debut in the West, and 20 new songs to the Project DIVA series.  In addition to the new songs, the game features updated gameplay mechanics and controls, more than eighty brand new and remade modules, Cross-Save compatibility, Markerless AR Mode (Vita) and a revamped edit mode ranking system that showcases the most popular user generated content. [SEGA]… Expand"}, {"name": "Karaoke Revolution Party", "details_link": "https://www.metacritic.com/game/playstation-2/karaoke-revolution-party", "publisher": "Konami", "release_date": "Nov  8 2005", "developers": ["Harmonix Music Systems"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/021055c54dfd0b656b0b5df1afc2b5e9-98.jpg", "descriptions": "Grab your friends, plug in the mics, and get the party started! Karaoke Revolution Party adds even more life to the party, expanding on what has already made the series a popular hit at social gatherings. Now you can sing AND dance to a collection of 50 songs featuring classics like \"SweetGrab your friends, plug in the mics, and get the party started! Karaoke Revolution Party adds even more life to the party, expanding on what has already made the series a popular hit at social gatherings. Now you can sing AND dance to a collection of 50 songs featuring classics like \"Sweet Caroline\" and recent hits like \"Crazy In Love\". Combined with more multiplayer and party modes than ever before, as well as support for the EyeToyTM USB Camera (for PlayStation 2), Karaoke Revolution Party is the only true interactive karaoke experience. 50 all-new songs. Showcase your superstar talent in the all-new Sing and Dance mode - supports the DDR dance pad (sold separately). Play team games, duets, head-to-head battles and mini-games. Put your vocal skills to the test in the all-new KR Challenge. Fully customize your character's head, body shape, clothes, and accessories. [Konami]… Expand"}, {"name": "The Adventures of Cookie & Cream", "details_link": "https://www.metacritic.com/game/playstation-2/the-adventures-of-cookie-cream", "publisher": "Agetec Inc.", "release_date": "Apr 30 2001", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/ad681691804d088c6e70b4305379929d-98.jpg", "descriptions": "A game that may actually improve your social life?  The option to share a single controller while guiding two hyperactive bunnies on a cooperative, split-screen journey to find their fleeting moon enhances this truly unique PS2 party game."}, {"name": "Visage", "details_link": "https://www.metacritic.com/game/xbox-one/visage", "publisher": "SadSquare Studio", "release_date": "Oct 30 2020", "developers": ["SadSquare Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 78, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/e61558e6bc9c767d0b2eff2a4f7546c5-98.jpg", "descriptions": "Visage is a first-person psychological horror game. Explore a mysterious ever-changing house in a slow-paced, atmospheric world that combines both uncannily comforting and horrifyingly realistic environments, and enjoy a genuinely terrifying experience."}, {"name": "Swords & Soldiers HD", "details_link": "https://www.metacritic.com/game/wii-u/swords-soldiers-hd", "publisher": "Two Tribes", "release_date": "May 22 2014", "developers": ["Two Tribes"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Switch", "Wii U"], "genres": ["Strategy", "General"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/225dc4d59c6bc3aa236ab0335a36c735-98.jpg", "descriptions": "Lead an army of Vikings in their mission to create the ultimate BBQ sauce, lead the Aztecs in defense of the Holy Pepper and build an array of explosive Chinese toys! Build your own forces and defeat your foes using berserkers, dart blowers, giant boulders, ninja monkeys (yes, – ninjaLead an army of Vikings in their mission to create the ultimate BBQ sauce, lead the Aztecs in defense of the Holy Pepper and build an array of explosive Chinese toys! Build your own forces and defeat your foes using berserkers, dart blowers, giant boulders, ninja monkeys (yes, – ninja monkeys!) and many more.… Expand"}, {"name": "Pro Evolution Soccer 2011", "details_link": "https://www.metacritic.com/game/wii/pro-evolution-soccer-2011", "publisher": "Konami", "release_date": "Nov 23 2010", "developers": ["Konami"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/7501b3bf0dcf143608a4554a270b2cfd-98.jpg", "descriptions": "The PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-lifeThe PRO EVOLUTION SOCCER franchise has long been regarded as offering incredible realism and control, however PRO EVOLUTION SOCCER 2011 will reinvigorate the series with the most advanced set of improved gameplay additions, control options and to catch up with the evolution of the real-life soccer. Central to its total freedom of play, PRO EVOLUTION SOCCER 2011 introduces a power bar for each player that allows the user to determine the exact strength and placement of every pass and shot. Balls can now be spread absolutely anywhere with surgical precision, with long balls into space, short passes to feet, and intricate one-twos allowing the player to dictate play and control the tempo of a match. … Expand"}, {"name": "Tom Clancy's Rainbow Six: Vegas 2", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-rainbow-six-vegas-2", "publisher": "Ubisoft", "release_date": "Apr 15 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/dfa0a5b5b966f4021e0c09932b8a6c80-98.jpg", "descriptions": "Tom Clancy's Rainbow Six Vegas 2 is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end. Sin City is back and bigger than before. Explore all new Vegas hot spots as the environment changesTom Clancy's Rainbow Six Vegas 2 is your last chance to rescue America's sexiest city from an escalating terrorist siege that will force you into heart-pounding action from beginning to end. Sin City is back and bigger than before. Explore all new Vegas hot spots as the environment changes from dusk to bright daylight to dawn, creating a visual experience that is as challenging as it is breathtaking. The multiplayer mode in Tom Clancy's Rainbow Six Vegas has been upgraded to include 11 new, smaller maps that force more intense face-offs, 2 new adversarial modes, more rewards, and easier access to matches using the improved and intuitive matchmaking system. Create your own identity that stays the same in both single player and multiplayer modes and progresses as you do. Reap the benefits of your single player rewards in multiplayer and vice versa. Turn single player mode into co-op mode at any time, just by jumping into the game. Now your friend can jump into your single player game and help you without any change to the story. Single player maps and storyline were created with co-op in mind, which means every map has multiple entry points and the story is the same. AI is more challenging than ever. Now, the terrorists are equipped with thermal vision, night vision, and shields – not to mention a multitude of varying reactions – all of which are guaranteed to give you a new playing experience every time you go into battle. As you progress within the game, you'll only be able to outsmart your enemies by taking advantage of intel opportunities, such as thermal scanning, and tactical strategies, such as leapfrogging. Take down the terrorists more effectively using 11 new weapons. New camouflage, clothing and gear allow you to take customization to the next level. [Ubisoft]… Expand"}, {"name": "Blast Works: Build, Trade, Destroy", "details_link": "https://www.metacritic.com/game/wii/blast-works-build-trade-destroy", "publisher": "Majesco Games", "release_date": "Jun 11 2008", "developers": ["BudCat"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Horizontal"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/31afd8d741769e353da0c2b35315e166-98.jpg", "descriptions": "Whether it's by land, sea or air, BlastWorks: Build, Trade, Destroy challenges you to a frenetic geometric battle. As you destroy your opponents, you can absorb their parts and use them to make your own ship bigger and stronger. In addition, level and ship editors let you customize andWhether it's by land, sea or air, BlastWorks: Build, Trade, Destroy challenges you to a frenetic geometric battle. As you destroy your opponents, you can absorb their parts and use them to make your own ship bigger and stronger. In addition, level and ship editors let you customize and design to your liking and then trade creations with friends. With bright, abstract graphics and fast-paced action, this \"sticky\" creative shooter based on the Tumiki Fighters online game will suck you in for the long haul. Become a massive ship over 15+ different missions by playing with the Wii Remote and the Nunchuk controller or the Wii Classic Controller. Design your own levels, ships, enemy ships, objects, and bosses with the in-depth Blastworks Editor. Assign Bullet Patterns, Sound FX, movement patterns, hit boxes, and more in the Ship Editor portion of the Blastworks Editor. Trade custom ships, levels and high scores with your friends via WiiConnect24. Absorb the pieces and weapons of destroyed enemies to build a larger, stronger ship that prepares you to fight more formidable Boss Ships. Supports multiplayer gameplay for 2-4 players in multiple modes. Retro geometric graphic style lends this classic shooter a unique look. Finish the game to unlock 4 complete Kenta Cho games: Tumiki Fighters, Gunroar, Torus Trooper and rRootage. [Majesco]… Expand"}, {"name": "In Other Waters", "details_link": "https://www.metacritic.com/game/switch/in-other-waters", "publisher": "Fellow Traveller", "release_date": "Apr  3 2020", "developers": ["Jump Over The Age"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/2345c0f70ea13d682b2745bf2fd8c704-98.jpg", "descriptions": "Play as an Artificial Intelligence guiding a stranded xenobiologist through a beautiful and mysterious alien ocean. A non-violent sci-fi story, enter a world of wonder, fear and vulnerability, unraveling the history and ecology of an impossible planet. What will you discover together?Play as an Artificial Intelligence guiding a stranded xenobiologist through a beautiful and mysterious alien ocean. A non-violent sci-fi story, enter a world of wonder, fear and vulnerability, unraveling the history and ecology of an impossible planet. What will you discover together?\r EXPLORE AN ALIEN OCEAN: Freely dive into an expansive section of seafloor, from shimmering reefs to inky depths. Unlock upgrades and make discoveries that allow you to open up new paths, uncovering strange creatures and environments as you do.\r SEE THE WORLD THROUGH AN AI LENS: Navigate an elegant, intuitive UI via touch or mouse controls. Interpret signals, set headings, and map the ocean through experimentation and intuition.\r BECOME AN XENOBIOLOGIST: Discover and catalogue species through observation, scanning, taking samples, and interacting with alien life. Read Ellery’s notes, look at her sketches, and help her classify an entirely new ecosystem.\r PLAN YOUR DIVES: Choose whether to study creatures, investigate secrets or dive new areas, then come back to your base to study samples in the lab, chat to Ellery or read her journals to understand more about this world.… Expand"}, {"name": "The Room VR: A Dark Matter", "details_link": "https://www.metacritic.com/game/pc/the-room-vr-a-dark-matter", "publisher": "Fireproof Games", "release_date": "Mar 26 2020", "developers": ["Fireproof Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/00ec53022878fcc8383b38fa7569e1fd-98.jpg", "descriptions": "The British Institute of Archaeology, London, 1908: The disappearance of an esteemed Egyptologist prompts a Police investigation into the unknown. Explore cryptic locations, examine fantastic gadgets and uncover an otherworldly discovery which blurs the line between reality and illusion.The British Institute of Archaeology, London, 1908: The disappearance of an esteemed Egyptologist prompts a Police investigation into the unknown. Explore cryptic locations, examine fantastic gadgets and uncover an otherworldly discovery which blurs the line between reality and illusion. Designed from the ground up for the unique capabilities of virtual reality, players can inhabit the spine-tingling world of The Room and interact with its strange contraptions in this compelling new chapter.… Expand"}, {"name": "LEGO Star Wars: The Force Awakens", "details_link": "https://www.metacritic.com/game/playstation-4/lego-star-wars-the-force-awakens", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 28 2016", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/343222d6ade5fe9ee202d72b17602e98-98.jpg", "descriptions": "Experience untold adventures set before Star Wars: The Force Awakens through exclusive new story levels that takes place between Star Wars: Return of the Jedi and the new film. Play as all of the heroic characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO,Experience untold adventures set before Star Wars: The Force Awakens through exclusive new story levels that takes place between Star Wars: Return of the Jedi and the new film. Play as all of the heroic characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO, and BB-8, as well as Kylo Ren, General Hux and Captain Phasma, while exploring classic Star Wars locales, such as Jakku and Starkiller Base, and utilizing a multitude of vehicles along the way. [LEGO]… Expand"}, {"name": "After the Fall", "details_link": "https://www.metacritic.com/game/playstation-5/after-the-fall", "publisher": "Vertigo Games", "release_date": "Feb 22 2023", "developers": ["Vertigo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e8b4b58ae9c31996e6f54ee6c05ca9bf-98.jpg", "descriptions": "From the creators of Arizona Sunshine comes an epic VR action FPS with intense co-op gameplay at its core that pits up to 4 players against a post-apocalyptic VR world filled with ferocious undead, mutated and twisted by the relentless cold. Set in the ice-covered ruins of 1980s LA nearly 20From the creators of Arizona Sunshine comes an epic VR action FPS with intense co-op gameplay at its core that pits up to 4 players against a post-apocalyptic VR world filled with ferocious undead, mutated and twisted by the relentless cold. Set in the ice-covered ruins of 1980s LA nearly 20 years after the apocalypse, After the Fall combines an evolving VR world shared with players on all platforms with action-packed co-op gameplay, built from the ground up for VR.\r Venture out into the remains of post-apocalyptic LA, wield deadly weapons and devastating powers with real-life movements as you develop your combat style, and join forces with players worldwide. Go head to head with hordes and towering bosses in a bid to leave the city a better place than your predecessors.… Expand"}, {"name": "Marvel's Guardians of the Galaxy", "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy", "publisher": "Square Enix", "release_date": "Oct 26 2021", "developers": ["Eidos Montreal"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Linear"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/463c7b3ac69016b9ad4fa86a430d96aa-98.jpg", "descriptions": "Fire up Star-Lord’s jet boots for a wild ride across the cosmos in this third-person action-adventure game, a fresh take on Marvel’s Guardians of the Galaxy. With the unpredictable Guardians at your side, blast your way from one explosive situation to another, with original and iconic MarvelFire up Star-Lord’s jet boots for a wild ride across the cosmos in this third-person action-adventure game, a fresh take on Marvel’s Guardians of the Galaxy. With the unpredictable Guardians at your side, blast your way from one explosive situation to another, with original and iconic Marvel characters caught in a struggle for the fate of the universe. You got this. Probably.… Expand"}, {"name": "Root Double: Before Crime * After Days - Xtend Edition", "details_link": "https://www.metacritic.com/game/switch/root-double-before-crime-after-days---xtend-edition", "publisher": "Sekai Games", "release_date": "Nov 26 2020", "developers": ["Regista"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/7418d7296cb62bd8f4bf0fba89f84775-98.jpg", "descriptions": "The year is 2030. Business is as usual in the isolated research city of Rokumei–that is until several explosions suddenly go off in the nuclear research facility known as “LABO.” The city sends in “Sirius,” an elite rescue squad, to deal with the situation. But the situation only gets worseThe year is 2030. Business is as usual in the isolated research city of Rokumei–that is until several explosions suddenly go off in the nuclear research facility known as “LABO.” The city sends in “Sirius,” an elite rescue squad, to deal with the situation. But the situation only gets worse when LABO’s nuclear reactor melts down, sending the facility into lockdown–with members of Sirius and survivors still trapped inside. With lethal radiation leaking everywhere and not enough anti-radiation medication to last until lockdown lifts, the survivors make more and more grim discoveries. In their struggle for survival, in a deathtrap full of fire and radiation, they learn that doubt is their greatest enemy, and trust their greatest asset.The story of Root Double features two different protagonists: Watase Kasasagi, a rescue squad captain who has lost his memories in the hours after the incident, and Natsuhiko Tenkawa, a student piecing together the clues in the six days before. The only key to survival lies in the player’s hands with the Senses Sympathy System (SSS). Unlike traditional visual novels, Root Double does not have clear cut “choices,” but rather, the game uses SSS to allow the player to manipulate the story based purely upon emotion. Your emotions projected upon the characters, particularly your trust in them, shape the progression of the story. Only with effective use of this system and completion of both protagonists’ stories can the player piece together the truth and hope to discover a way out of the facility.… Expand"}, {"name": "Yonder: The Cloud Catcher Chronicles", "details_link": "https://www.metacritic.com/game/xbox-one/yonder-the-cloud-catcher-chronicles", "publisher": "Prideful Sloth", "release_date": "Feb 27 2019", "developers": ["Prideful Sloth"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/b0f42ca67462d8e56b53245dc2a3f4c4-98.jpg", "descriptions": "Yonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the islandYonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the island flourish.… Expand"}]