[{"name": "The Room VR: A Dark Matter", "details_link": "https://www.metacritic.com/game/pc/the-room-vr-a-dark-matter", "publisher": "Fireproof Games", "release_date": "Mar 26 2020", "developers": ["Fireproof Games"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/00ec53022878fcc8383b38fa7569e1fd-98.jpg", "descriptions": "The British Institute of Archaeology, London, 1908: The disappearance of an esteemed Egyptologist prompts a Police investigation into the unknown. Explore cryptic locations, examine fantastic gadgets and uncover an otherworldly discovery which blurs the line between reality and illusion.The British Institute of Archaeology, London, 1908: The disappearance of an esteemed Egyptologist prompts a Police investigation into the unknown. Explore cryptic locations, examine fantastic gadgets and uncover an otherworldly discovery which blurs the line between reality and illusion. Designed from the ground up for the unique capabilities of virtual reality, players can inhabit the spine-tingling world of The Room and interact with its strange contraptions in this compelling new chapter.… Expand"}, {"name": "LEGO Star Wars: The Force Awakens", "details_link": "https://www.metacritic.com/game/playstation-4/lego-star-wars-the-force-awakens", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 28 2016", "developers": ["TT Games"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/343222d6ade5fe9ee202d72b17602e98-98.jpg", "descriptions": "Experience untold adventures set before Star Wars: The Force Awakens through exclusive new story levels that takes place between Star Wars: Return of the Jedi and the new film. Play as all of the heroic characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO,Experience untold adventures set before Star Wars: The Force Awakens through exclusive new story levels that takes place between Star Wars: Return of the Jedi and the new film. Play as all of the heroic characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO, and BB-8, as well as Kylo Ren, General Hux and Captain Phasma, while exploring classic Star Wars locales, such as Jakku and Starkiller Base, and utilizing a multitude of vehicles along the way. [LEGO]… Expand"}, {"name": "After the Fall", "details_link": "https://www.metacritic.com/game/playstation-5/after-the-fall", "publisher": "Vertigo Games", "release_date": "Feb 22 2023", "developers": ["Vertigo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/e8b4b58ae9c31996e6f54ee6c05ca9bf-98.jpg", "descriptions": "From the creators of Arizona Sunshine comes an epic VR action FPS with intense co-op gameplay at its core that pits up to 4 players against a post-apocalyptic VR world filled with ferocious undead, mutated and twisted by the relentless cold. Set in the ice-covered ruins of 1980s LA nearly 20From the creators of Arizona Sunshine comes an epic VR action FPS with intense co-op gameplay at its core that pits up to 4 players against a post-apocalyptic VR world filled with ferocious undead, mutated and twisted by the relentless cold. Set in the ice-covered ruins of 1980s LA nearly 20 years after the apocalypse, After the Fall combines an evolving VR world shared with players on all platforms with action-packed co-op gameplay, built from the ground up for VR.\r Venture out into the remains of post-apocalyptic LA, wield deadly weapons and devastating powers with real-life movements as you develop your combat style, and join forces with players worldwide. Go head to head with hordes and towering bosses in a bid to leave the city a better place than your predecessors.… Expand"}, {"name": "Marvel's Guardians of the Galaxy", "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy", "publisher": "Square Enix", "release_date": "Oct 26 2021", "developers": ["Eidos Montreal"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Linear"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/463c7b3ac69016b9ad4fa86a430d96aa-98.jpg", "descriptions": "Fire up Star-Lord’s jet boots for a wild ride across the cosmos in this third-person action-adventure game, a fresh take on Marvel’s Guardians of the Galaxy. With the unpredictable Guardians at your side, blast your way from one explosive situation to another, with original and iconic MarvelFire up Star-Lord’s jet boots for a wild ride across the cosmos in this third-person action-adventure game, a fresh take on Marvel’s Guardians of the Galaxy. With the unpredictable Guardians at your side, blast your way from one explosive situation to another, with original and iconic Marvel characters caught in a struggle for the fate of the universe. You got this. Probably.… Expand"}, {"name": "Root Double: Before Crime * After Days - Xtend Edition", "details_link": "https://www.metacritic.com/game/switch/root-double-before-crime-after-days---xtend-edition", "publisher": "Sekai Games", "release_date": "Nov 26 2020", "developers": ["Regista"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/7418d7296cb62bd8f4bf0fba89f84775-98.jpg", "descriptions": "The year is 2030. Business is as usual in the isolated research city of Rokumei–that is until several explosions suddenly go off in the nuclear research facility known as “LABO.” The city sends in “Sirius,” an elite rescue squad, to deal with the situation. But the situation only gets worseThe year is 2030. Business is as usual in the isolated research city of Rokumei–that is until several explosions suddenly go off in the nuclear research facility known as “LABO.” The city sends in “Sirius,” an elite rescue squad, to deal with the situation. But the situation only gets worse when LABO’s nuclear reactor melts down, sending the facility into lockdown–with members of Sirius and survivors still trapped inside. With lethal radiation leaking everywhere and not enough anti-radiation medication to last until lockdown lifts, the survivors make more and more grim discoveries. In their struggle for survival, in a deathtrap full of fire and radiation, they learn that doubt is their greatest enemy, and trust their greatest asset.The story of Root Double features two different protagonists: Watase Kasasagi, a rescue squad captain who has lost his memories in the hours after the incident, and Natsuhiko Tenkawa, a student piecing together the clues in the six days before. The only key to survival lies in the player’s hands with the Senses Sympathy System (SSS). Unlike traditional visual novels, Root Double does not have clear cut “choices,” but rather, the game uses SSS to allow the player to manipulate the story based purely upon emotion. Your emotions projected upon the characters, particularly your trust in them, shape the progression of the story. Only with effective use of this system and completion of both protagonists’ stories can the player piece together the truth and hope to discover a way out of the facility.… Expand"}, {"name": "Yonder: The Cloud Catcher Chronicles", "details_link": "https://www.metacritic.com/game/xbox-one/yonder-the-cloud-catcher-chronicles", "publisher": "Prideful Sloth", "release_date": "Feb 27 2019", "developers": ["Prideful Sloth"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/b0f42ca67462d8e56b53245dc2a3f4c4-98.jpg", "descriptions": "Yonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the islandYonder shipwrecks players on the vast island of Gemea, a land enshrouded in an evil murk.  By exploring the land, joining forces with the locals and contributing to their community through optional talents like farming, crafting, cooking, fishing and brewing, adventurers can help the island flourish.… Expand"}, {"name": "Arcade Spirits", "details_link": "https://www.metacritic.com/game/pc/arcade-spirits", "publisher": "PQube", "release_date": "Feb 12 2019", "developers": ["Fiction Factory Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/7d7ef4afa627ec3dee85634d1244505e-98.jpg", "descriptions": "Arcade Spirits is a romantic visual novel that follows an alternative timeline where the 1983 video game crash never occurred. It's 20XX and you've just started a new job at the Funplex game arcade. Who will you meet along the way? Will you find the romance you're seeking?"}, {"name": "Musynx", "details_link": "https://www.metacritic.com/game/switch/musynx", "publisher": "acttil llc.", "release_date": "Jun 19 2018", "developers": ["PM Studios Inc."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/0d29565d966c50cb70d426d2da362a20-98.jpg", "descriptions": "With more than 50 songs to choose from, MUSYNX is the next destination of choice for rhythm game fans to rock out and stretch their rhythmic fingers! The simple, organic game mechanics will put players to the test with rhythms and beats like no other. With multiple difficulty levels and aWith more than 50 songs to choose from, MUSYNX is the next destination of choice for rhythm game fans to rock out and stretch their rhythmic fingers! The simple, organic game mechanics will put players to the test with rhythms and beats like no other. With multiple difficulty levels and a huge range of genres to choose from (pop, classical, trance, vocaloid, R&B, and more), players will be glued to their Nintendo Switch for hours and hours, whether at home or on the go. … Expand"}, {"name": "Runner3", "details_link": "https://www.metacritic.com/game/pc/runner3", "publisher": "Choice Provisions", "release_date": "May 22 2018", "developers": ["Choice Provisions"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/97bdf5154527c24e7dbf30808dcad710-98.jpg", "descriptions": "The rhythm-music gameplay of BIT.TRIP RUNNER and Runner2 is back."}, {"name": "Dungeon of the Endless", "details_link": "https://www.metacritic.com/game/xbox-one/dungeon-of-the-endless", "publisher": "Amplitude Studios", "release_date": "Mar 16 2016", "developers": ["Amplitude Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/3cfaf21b4ef8058108480c982e3d2234-98.jpg", "descriptions": "Do you want to know what's behind the door? A Rogue-Like Dungeon Defense with a pinch of RPG. Open the door... what could go wrong?"}, {"name": "Blaster Master Zero", "details_link": "https://www.metacritic.com/game/switch/blaster-master-zero", "publisher": "Inti Creates", "release_date": "Mar  9 2017", "developers": ["Inti Creates"], "platforms": ["3DS", "PC", "PlayStation 4", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/761fa4661acc08983bc2325b10dec7e0-98.jpg", "descriptions": "Blaster Master Zero is a 8-bit style top-down & sideview 2D action-adventure game that hearkens back to the golden age of the NES.\r Using the original 1988 NES title \"Blaster Master\" from Sunsoft as a base, with the addition of new areas and bosses, new gameplay elements such as extraBlaster Master Zero is a 8-bit style top-down & sideview 2D action-adventure game that hearkens back to the golden age of the NES.\r Using the original 1988 NES title \"Blaster Master\" from Sunsoft as a base, with the addition of new areas and bosses, new gameplay elements such as extra sub-weapons, improved gameplay, a more robust scenario, refined and expanded exploration mechanics, and more.\r This of course includes new areas and bosses, and new gameplay elements such as extra sub-weapons, improved gameplay when battling outside of your SOPHIA 3rd tank, a more robust scenario, refined and expanded exploration mechanics, and more.\r -On the sideview maps, take control of the battle tank SOPHIA III and explore your surroundings as you search for the entrance to the dungeon where the area's boss lurks.\r-Once you find a dungeon entrance, exit SOPHIA III and make your way inside as the hero Jason and take on the mutants inside in top-down mode.\r-Defeat the mid-bosses and area bosses to acquire new items, sub-weapons, upgrades to SOPHIA III and Jason's equipment, and new abilities and move to the next area.\r-Incorporation of HD Rumble features into various aspects of the gameplay.\r-Player 2 can provide support for Player 1 as they traverse through the game in the co-op multiplayer mode.… Expand"}, {"name": "Unravel", "details_link": "https://www.metacritic.com/game/playstation-4/unravel", "publisher": "Electronic Arts", "release_date": "Feb  9 2016", "developers": ["Coldwood Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/9a33237b70fdfe4680391148813a9bab-98.jpg", "descriptions": "Yarny's mission is to mend broken bonds and the yarn represents the love and connection between people. The player will use Yarny's thread to do things such as swinging across gaps or rappelling down trees. Te game will also challenge gamers to use the thread in clever and creative ways.Yarny's mission is to mend broken bonds and the yarn represents the love and connection between people. The player will use Yarny's thread to do things such as swinging across gaps or rappelling down trees. Te game will also challenge gamers to use the thread in clever and creative ways. [Electronic Arts]… Expand"}, {"name": "Sonic & Sega All-Stars Racing", "details_link": "https://www.metacritic.com/game/wii/sonic-sega-all-stars-racing", "publisher": "Sega", "release_date": "Feb 23 2010", "developers": ["Sumo Digital"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Kart", "Automobile"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/82500b62d925944b16c33d7b7df1365f-98.jpg", "descriptions": "In a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many moreIn a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many more will join Sonic in their custom built vehicles, revving their engines and jostling to stay ahead of the pack. Each character will speed around the track in cars, planes, motorbikes, and in Aiai’s case – a banana mobile! Secret short cuts, swift handling and avoiding strategically placed obstacles are certainly the best way to get to the top of the podium. But winning is only part of the fun in Sonic & SEGA All-Stars Racing! Each character has a specific All Star move – such as Super Sonic, Banana Blitz and Tails Tornado – that allows a quick way for competitors to get back into the race! Power ups and weapons can also be collected around the tracks and used against the opposition to ensure they don’t become a threat to that number one position. [Sega]… Expand"}, {"name": "Blackwood Crossing", "details_link": "https://www.metacritic.com/game/xbox-one/blackwood-crossing", "publisher": "PaperSeven", "release_date": "Apr  5 2017", "developers": ["PaperSeven"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/2c503913bdf1b670de02181d82438285-98.jpg", "descriptions": "Blackwood Crossing is a single-player, first person narrative game. An intriguing tale exploring the relationship of Scarlett and Finn, two siblings who are growing apart. When their paths cross with a ghostly figure, an ordinary train ride evolves into a haunting adventure of love, death and magic."}, {"name": "Candleman", "details_link": "https://www.metacritic.com/game/xbox-one/candleman", "publisher": "E-Home Entertainment", "release_date": "Feb  1 2017", "developers": ["Spotlightor Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "3D"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/c0203db7fe13a34fbff064dea78c1d3b-98.jpg", "descriptions": "Even though it can only burn for 10 seconds, a little candle decides to walk into the darkness on a journey to seek the light. A 3D platformer, Candleman’s action adventure gameplay uses the mechanics of light and shadow to tell an immersive story, and a wide range of environments helpEven though it can only burn for 10 seconds, a little candle decides to walk into the darkness on a journey to seek the light. A 3D platformer, Candleman’s action adventure gameplay uses the mechanics of light and shadow to tell an immersive story, and a wide range of environments help provide the backdrop. [Xbox.com]… Expand"}, {"name": "Outriders Worldslayer", "details_link": "https://www.metacritic.com/game/xbox-series-x/outriders-worldslayer", "publisher": "Square Enix", "release_date": "Jun 30 2022", "developers": ["People Can Fly"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 78, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/f83df459d68a21be80a90e3b7c7636b6-98.jpg", "descriptions": "OUTRIDERS is a story driven RPG-Shooter that will put the player in the shoes of an Outrider, the last hope of the human race trapped on Enoch, a dangerous and untamed planet. The campaign can be played entirely in single player, or in co-op with up to three players. Outriders Worldslayer isOUTRIDERS is a story driven RPG-Shooter that will put the player in the shoes of an Outrider, the last hope of the human race trapped on Enoch, a dangerous and untamed planet. The campaign can be played entirely in single player, or in co-op with up to three players. Outriders Worldslayer is a new expansion that takes place directly after the events of the main campaign. In it, you and up to 2 other players must travel to the far reaches of Enoch to battle a new threat known as Ereshkigal, a dark overlord, and the main villain of the expansion.… Expand"}, {"name": "Full Metal Furies", "details_link": "https://www.metacritic.com/game/switch/full-metal-furies", "publisher": "Cellar Door Games", "release_date": "Nov  6 2018", "developers": ["Cellar Door Games"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/fdeb81f2659257a3a1e709f3f5e1334e-98.jpg", "descriptions": "From the creators of Rogue Legacy comes a \"true-cooperative\" action RPG. FULL METAL FURIES puts an emphasis on team play with a unique combat system where everyone is important. Play on the couch, alone or with friends, or make it an online party for up to four players."}, {"name": "Fluidity: Spin Cycle", "details_link": "https://www.metacritic.com/game/3ds/fluidity-spin-cycle", "publisher": "Nintendo", "release_date": "Dec 27 2012", "developers": ["Curve Studios"], "platforms": "3DS", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/df5dd7d4f292f74febd1ecfc275ff8f0-98.jpg", "descriptions": "(Known as Hydroventure: Spin Cycle in the UK/EU) Fluidity: Spin Cycle lets players tilt, turn and even rotate their Nintendo 3DS system 360 degrees to maneuver a puddle of water named Eddy through a maze-like, magical world."}, {"name": "Super Street Fighter IV: Arcade Edition", "details_link": "https://www.metacritic.com/game/xbox-360/super-street-fighter-iv-arcade-edition", "publisher": "Capcom", "release_date": "Jun 28 2011", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "2D", "3D"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/7c112242f2cbbee59c370e258e38ecd7-98.jpg", "descriptions": "Super Street Fighter IV Arcade Edition features a roster of 39 characters, with 4 new characters added."}, {"name": "Burnout Paradise Remastered", "details_link": "https://www.metacritic.com/game/switch/burnout-paradise-remastered", "publisher": "Electronic Arts", "release_date": "Jun 19 2020", "developers": ["STELLAR ENTERTAINMENT SOFTWARE LTD"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/3875d7fcaa6367bdda98241304c033e3-98.jpg", "descriptions": "Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever!Burnout Paradise Remastered provides the ultimate driving playground for you and your friends to play online. This remaster includes all DLC from the Year of Paradise, including the Big Surf Island update, meticulously recreated and ready to wreck in 4K on the PlayStation 4 Pro and Xbox One X.… Expand"}, {"name": "Arc the Lad Collection", "details_link": "https://www.metacritic.com/game/playstation/arc-the-lad-collection", "publisher": "Working Designs", "release_date": "Apr 18 2002", "developers": ["ARC Entertainment"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/f9e00978052a172ec88c747e34363253-98.jpg", "descriptions": "The Arc the Lad Collection is ultimately an interesting, varied, and rewarding experience that has a tendency to sometimes get bogged down."}, {"name": "MultiVersus", "details_link": "https://www.metacritic.com/game/pc/multiversus", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jul 26 2022", "developers": ["Player First Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 78, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/df7fa5d24bac29d6e8cbca3d9567a0d9-98.jpg", "descriptions": "In MultiVersus, the Multiverse is at your fingertips as you battle it out in intense 2v2 matches. Up against Batman & Shaggy? Try using Bugs Bunny & Arya Stark! This platform fighter lets you play out your fantasy matchups in a fun co-op or head-to-head fight for supremacy."}, {"name": "Wytchwood", "details_link": "https://www.metacritic.com/game/pc/wytchwood", "publisher": "Alientrap", "release_date": "Dec  9 2021", "developers": ["Alientrap"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/51e7fbb4c3163b5a1d0798839c67f10c-98.jpg", "descriptions": "Wytchwood is a crafting adventure game set in a land of gothic fables and fairytales. As the old witch of the woods, explore a strange countryside, collect magic ingredients, brew sorcerous spells, and pass judgement upon a capricious cast of characters."}, {"name": "Resident Evil: Revelations Collection", "details_link": "https://www.metacritic.com/game/switch/resident-evil-revelations-collection", "publisher": "Capcom", "release_date": "Nov 28 2017", "developers": ["Capcom"], "platforms": "Switch", "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/668ffeb042684631ca49865439a4af74-98.jpg", "descriptions": "Resident Evil Revelations features Jill Valentine and Claire Redfield as they investigate an abandoned cruise ship where terror lurks around every corner. Resident Evil Revelations 2 features 2 separate, but intertwined storylines featuring Claire Redfield and Barry Burton as they findResident Evil Revelations features Jill Valentine and Claire Redfield as they investigate an abandoned cruise ship where terror lurks around every corner. Resident Evil Revelations 2 features 2 separate, but intertwined storylines featuring Claire Redfield and Barry Burton as they find themselves on an abandoned prison island.… Expand"}, {"name": "Battle Chasers: Nightwar", "details_link": "https://www.metacritic.com/game/pc/battle-chasers-nightwar", "publisher": "Nordic Games Publishing", "release_date": "Oct  3 2017", "developers": ["Airship Syndicate Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/66ffe55f0f6d5d92f229efdde2350503-98.jpg", "descriptions": "Battle Chasers: Nightwar is an RPG inspired by the classic console greats, featuring deep dungeon diving, turn-based combat presented in a classic JRPG format, and a story driven by exploration of the world."}, {"name": "FIFA Soccer 2005", "details_link": "https://www.metacritic.com/game/gamecube/fifa-soccer-2005", "publisher": "EA Sports", "release_date": "Oct 12 2004", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/bcb594f1d0cadb85ea4f5e77f4e1b64c-98.jpg", "descriptions": "FIFA Soccer 2005 gives you more control than ever with improved button and control sensitivity and an intuitive Off the Ball Control. Now you can take command of players not in possession of the ball by calling in tackles, jostling for space, and sending your teammates on runs as you controlFIFA Soccer 2005 gives you more control than ever with improved button and control sensitivity and an intuitive Off the Ball Control. Now you can take command of players not in possession of the ball by calling in tackles, jostling for space, and sending your teammates on runs as you control the pitch. With more than 350 official team and league licenses from around the world, an enhanced Career mode, and an improved broadcast, FIFA Soccer 2005 gives you a complete and authentic soccer experience.… Expand"}, {"name": "Tom Clancy's Splinter Cell Pandora Tomorrow", "details_link": "https://www.metacritic.com/game/gamecube/tom-clancys-splinter-cell-pandora-tomorrow", "publisher": "Ubisoft", "release_date": "Jul 20 2004", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "GameCube"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/517f9b42fbf697bc5cceb54a7eebc6b0-98.jpg", "descriptions": "The sequel to Splinter Cell makes its way to the PlayStation 2 and GameCube with a host of exclusive content, including a new jungle mission, alternate pathways in revisited missions, and booby-trap gameplay. Splinter Cell Pandora Tomorrow once again casts you in the role of Sam Fisher,The sequel to Splinter Cell makes its way to the PlayStation 2 and GameCube with a host of exclusive content, including a new jungle mission, alternate pathways in revisited missions, and booby-trap gameplay. Splinter Cell Pandora Tomorrow once again casts you in the role of Sam Fisher, whose mission is to destroy top secret documentation held in the embassy of militia leader Suhadi Sadono. With Sam's all-new moves and prototype gear, you must infiltrate buildings and spare the hostages.… Expand"}, {"name": "Hitman: Contracts", "details_link": "https://www.metacritic.com/game/xbox/hitman-contracts", "publisher": "Eidos Interactive", "release_date": "Apr 20 2004", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 78, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/199a59c807c1708d7577b7c58af49deb-98.jpg", "descriptions": "Explore the dark psychology of killing for a living as you delve into the mind of a ruthless and efficient contract killer. Hitman: Contracts delivers more action-packed missions that require you to eliminate targets from England to China. Now you have a greater variety of ways to make theExplore the dark psychology of killing for a living as you delve into the mind of a ruthless and efficient contract killer. Hitman: Contracts delivers more action-packed missions that require you to eliminate targets from England to China. Now you have a greater variety of ways to make the perfect hit and an increased arsenal of firearms and close-combat weapons at your disposal. Pick up objects like meat hooks, pool cues, shovels, and pillows to use as weapons, and then admire your \"work\" showcased in brutal detail. … Expand"}, {"name": "Puzzle Pirates", "details_link": "https://www.metacritic.com/game/pc/puzzle-pirates", "publisher": "Ubisoft", "release_date": "Dec  8 2003", "developers": ["Three Rings"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Massively Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/8d4e72aa779ea693f704ee5388eb9171-98.jpg", "descriptions": "Yohoho! Puzzle Pirates is an online game in which you play a Pirate character in an ocean world. Hundreds of your fellow player Pirates swarm these Isles and Sea-lanes. For Pirates who love acronyms, Puzzle Pirates is an massively multi-player online roleplaying game, or mmoarrrrpg. PiratesYohoho! Puzzle Pirates is an online game in which you play a Pirate character in an ocean world. Hundreds of your fellow player Pirates swarm these Isles and Sea-lanes. For Pirates who love acronyms, Puzzle Pirates is an massively multi-player online roleplaying game, or mmoarrrrpg. Pirates can wander around on land and sail the thirty-seven seas with their crew. When your Pirate sails, or swordfights, or navigates, the appropriate Puzzle game is launched. Good Puzzling thereby brings victories and accrues great fortunes to you and your fellow Pirates. Thus Yohoho! brings you Puzzling fun in a social Piratical setting, where every Puzzle game contributes to the greater story of your Pirate, her Crew, and the Ocean world. [Three Rings]… Expand"}, {"name": "The Lord of the Rings: The Return of the King", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-the-return-of-the-king", "publisher": "EA Games", "release_date": "Oct 31 2003", "developers": ["EA Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Action", "Role-Playing", "Beat-'Em-Up", "Action RPG", "Beat-'Em-Up", "2D", "3D"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/700829d1f6ac375dde6c5ae4c7816a6c-98.jpg", "descriptions": "Return to Middle-earth in the only video game based on the epic final chapter of the highly-acclaimed The Lord of the Rings movie trilogy. Developed using the same digital assets as the films, The Return of the King re-creates in stunning detail the final events of the War of the Ring.Return to Middle-earth in the only video game based on the epic final chapter of the highly-acclaimed The Lord of the Rings movie trilogy. Developed using the same digital assets as the films, The Return of the King re-creates in stunning detail the final events of the War of the Ring. Become the heroes who determine the fate of Middle-earth as you traverse the haunted Paths of the Dead, defend Minas Tirith from the onslaught of thousands of Sauron's minions, and even play co-op multiplayer with a friend as you march against the impenetrable Black Gates of Mordor. Eight playable characters, including Gandalf, Aragorn, Legolas, Gimli, Sam, and Frodo with exclusive voice-over provided by the films' actors. The fate of Middle-earth is in your hands. [Electronic Arts]… Expand"}, {"name": "Crimson Sea", "details_link": "https://www.metacritic.com/game/xbox/crimson-sea", "publisher": "Koei", "release_date": "Dec 16 2002", "developers": ["Koei"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/2404c1fa98c60c462a57d7f29be0e982-98.jpg", "descriptions": "Travel thousands of years into the future to the galaxy Theophilus. As Sho, your job is to solve the mystery of countless murders that have been committed by an invading alien force. Along the way, you'll decimate hordes of alien creatures and liquid-morphing enemies with customized blasterTravel thousands of years into the future to the galaxy Theophilus. As Sho, your job is to solve the mystery of countless murders that have been committed by an invading alien force. Along the way, you'll decimate hordes of alien creatures and liquid-morphing enemies with customized blaster rifles and plasma swords. Summon the power of Neo-Psionics to blast through hordes of alien menaces in a single move. Now, with Crimson Sea's Phantom Sensor System, use sound and touch to discover the hidden enemy.… Expand"}, {"name": "2002 FIFA World Cup", "details_link": "https://www.metacritic.com/game/gamecube/2002-fifa-world-cup", "publisher": "EA Sports", "release_date": "Apr 30 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/c06a8f045c23d8c5c46671841774f71d-98.jpg", "descriptions": "Kick off the FIFA World Cup season with 2002 FIFA World Cup, which captures every moment of glory, every emotion, and every sound of the global event. The game boasts licenses from the official FIFA World Cup, insignia, mascots, and the 20 new World Cup stadiums in Japan and Korea. AnotherKick off the FIFA World Cup season with 2002 FIFA World Cup, which captures every moment of glory, every emotion, and every sound of the global event. The game boasts licenses from the official FIFA World Cup, insignia, mascots, and the 20 new World Cup stadiums in Japan and Korea. Another enhancement includes Air Play, a new control scheme that delivers intuitive one-button headers, volleys, scissors kicks, juggling, and more. Choose your team and then compete in a seven-game series beginning with round-robin play, followed by playoffs that lead to the final match. … Expand"}, {"name": "Knockout Kings 2002", "details_link": "https://www.metacritic.com/game/xbox/knockout-kings-2002", "publisher": "Electronic Arts", "release_date": "Mar  4 2002", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/43b13c5adf33b8b182662a7193db4fff-98.jpg", "descriptions": "Knockout Kings 2002 features an all-new game engine with the fastest, most intense boxing action in the series. Lace up the gloves, throw in the mouthpiece, and experience the thrills of boxing's biggest moments, most devastating combinations, dazzling footwork, crushing blows and the bestKnockout Kings 2002 features an all-new game engine with the fastest, most intense boxing action in the series. Lace up the gloves, throw in the mouthpiece, and experience the thrills of boxing's biggest moments, most devastating combinations, dazzling footwork, crushing blows and the best looking boxers ever. A long list of champions allows fight fans to create countless dream bouts with such legendary fighters as Muhammad Ali, Joe Frazier, Roberto Duran, and Sugar Ray Leonard along with current greats--Felix Trinidad, Lennox Lewis, Oscar De La Hoya, and many more.… Expand"}, {"name": "Star Trek Starfleet Command: Orion Pirates", "details_link": "https://www.metacritic.com/game/pc/star-trek-starfleet-command-orion-pirates", "publisher": "Interplay", "release_date": "Jul  1 2001", "developers": ["Taldren"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General", "Tactics"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/9d8e4a225a0a6a8e68e6460fa5874c55-98.jpg", "descriptions": "Taking over command of one of the eight star empires from the original game, you choose between fighting against the Orion Pirates or joining forces with them to conquer the universe. During game play, players will control various ships and all of its systems while taking it into combatTaking over command of one of the eight star empires from the original game, you choose between fighting against the Orion Pirates or joining forces with them to conquer the universe. During game play, players will control various ships and all of its systems while taking it into combat against enemy vessels. [Interplay]… Expand"}, {"name": "Sonic Origins", "details_link": "https://www.metacritic.com/game/playstation-5/sonic-origins", "publisher": "Sega", "release_date": "Jun 23 2022", "developers": ["Sega"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/05ca2badc29690d00d0dc5137e464fe7-98.jpg", "descriptions": "Relive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans ofRelive the classic collected adventures of Sonic The Hedgehog, Sonic The Hedgehog 2, Sonic 3 & Knuckles, and Sonic CD in the newly remastered Sonic Origins! From the iconic Green Hill Zone to the treacherous Death Egg Robot, you'll speed down memory lane to thwart the sinister plans of Doctor Robotnik in polished high definition! This latest version includes new areas to explore, additional animations, and a brand new Anniversary mode! Explore the classic Sonic titles in high-resolution, with all-new opening and ending animations for each title! New Unlockables: Complete various missions to collect coins to unlock new content, challenges, and Special Stages through the Museum. Classic and Anniversary Mode. Choose to Spin Dash your way through the numerous zones in Classic mode with the game's original resolution and limited lives, or the new Anniversary mode with unlimited lives and revamped fullscreen resolution.… Expand"}, {"name": "CastleStorm", "details_link": "https://www.metacritic.com/game/switch/castlestorm", "publisher": "Zen Studios", "release_date": "Aug 16 2018", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox 360", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Strategy", "Real-Time", "General", "Defense"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/ee8b7e3b7313b8baf4e11c99733aff76-98.jpg", "descriptions": "CastleStorm features medieval ballista weaponry, allowing players to launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsomeCastleStorm features medieval ballista weaponry, allowing players to launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsome ground attack of swordsmen, knights, and donkey riders in order to protect your castle games, and if all else fails, call upon powerful spells to help keep the enemy at bay.… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 1: Ties That Bind Part One", "details_link": "https://www.metacritic.com/game/xbox-one/the-walking-dead-the-telltale-series---a-new-frontier-episode-1-ties-that-bind-part-one", "publisher": "Telltale Games", "release_date": "Dec 20 2016", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/2059a6717a09e711b9910cbd757f7563-98.jpg", "descriptions": "When family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken fromWhen family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken from him, you meet a young girl who has experienced her own unimaginable loss. Her name is Clementine, and your fates are bound together in a story where every choice you make could be your last.… Expand"}, {"name": "Two Worlds II: Pirates of the Flying Fortress", "details_link": "https://www.metacritic.com/game/pc/two-worlds-ii-pirates-of-the-flying-fortress", "publisher": "TopWare Interactive", "release_date": "Sep 30 2011", "developers": ["Reality Pump"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Third-Person", "Third-Person", "General", "Action RPG"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/6e41bb36e95fe26ea2efe8e7a3402a5b-98.jpg", "descriptions": "Two Worlds II: Pirates of the Flying Fortress is a DLC for Two Worlds II."}, {"name": "Part Time UFO", "details_link": "https://www.metacritic.com/game/switch/part-time-ufo", "publisher": "Nintendo", "release_date": "Oct 28 2020", "developers": ["HAL Labs"], "platforms": ["iPhone/iPad", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/d27274515da0795001b829c6bc25ca7d-98.jpg", "descriptions": "Help the citizens of earth as a cute little UFO with a handy extendable claw\r Move objects to the designated platform and balance, arrange, and build to help earthlings complete jobs! Tasks range from farming, fishing, and stacking cheerleaders. Wait…what? Each puzzling job has multipleHelp the citizens of earth as a cute little UFO with a handy extendable claw\r Move objects to the designated platform and balance, arrange, and build to help earthlings complete jobs! Tasks range from farming, fishing, and stacking cheerleaders. Wait…what? Each puzzling job has multiple objectives hinted at through pictures. Solve them to earn in-game medals and unlock even more jobs—just keep an eye on the timer.\r Pass a Joy-Con™ controller to a friend for some duo UFO puzzle solving\r Recruit a friend and complete any job in cooperative mode. Each job also has a more difficult variation that’s perfect for two players. Jobs may have more objects to move or other challenges to keep the action fresh for your UFO buddy. Two claws are better than one!\r Reach for the stars (and a high score) in the Tower of Infinity\r The sky’s the limit in the Tower of Infinity mode! Stack objects that are flown in on helicopters to build the tallest tower you can. Be careful not to let anything fall of the platform or the round will end. A second player can join you on your journey to build the tallest tower possible.\r Take on jobs like helping a farmer load a truck, arranging circus animals, and rebuilding a temple. In addition to the medals you’ll earn to unlock other stages, you’ll receive some in-game currency for each job you complete. Redeem your hard-earned currency for adorably useful costumes. Dress like a ninja for a sneaky look and a speed boost, or don the safety helmet to stop quickly when zooming around the screen.\r  Check out the Feats of Glory for extra challenges to complete as you play. For example, try to transport a total of 160 objects across all jobs or get a total of 54 medals. Complete four of these feats to unlock an animated illustration.\r  Once you master your claw-swinging, object-stacking skills, you can go for a treasure hunt! In this mode you must solve puzzles and collect treasure as you explore treacherous ruins. Whether you want to help out earthlings, build your Tower of Infinity, or explore for treasure, the Part Time UFO game is full time fun.… Expand"}, {"name": "Battlefield V", "details_link": "https://www.metacritic.com/game/xbox-one/battlefield-v", "publisher": "Electronic Arts", "release_date": "Nov 15 2018", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 78, "users_score": 3.1, "image": "https://static.metacritic.com/images/products/games/1/f38a52f27d7ca22e69cb10f0d5cf08f9-98.jpg", "descriptions": "Enter mankind's greatest conflict with Battlefield 5 as the series goes back to its roots with a never-before-seen portrayal of World War 2. Lead your squad to victory with new ways to turn the battlefield to your advantage. Assemble your Company of customized soldiers, weapons, and vehiclesEnter mankind's greatest conflict with Battlefield 5 as the series goes back to its roots with a never-before-seen portrayal of World War 2. Lead your squad to victory with new ways to turn the battlefield to your advantage. Assemble your Company of customized soldiers, weapons, and vehicles then take them on an epic journey through the Tides of War. Experience the most intense, immersive Battlefield yet. You will never be the same.… Expand"}, {"name": "Grow: Song of the Evertree", "details_link": "https://www.metacritic.com/game/pc/grow-song-of-the-evertree", "publisher": "505 Games", "release_date": "Nov 16 2021", "developers": ["Prideful Sloth"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 78, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/4588bfaa374486ca98cd104acd5c1645-98.jpg", "descriptions": "Over time, the Worlds of Alaria faded. The Evertree where many worlds resided on its countless branches is now nothing more than a sapling, its splendor long erased from memory. No one knows how to make it grow. But you are different. You hear the sun as it sings across the sky. You hear theOver time, the Worlds of Alaria faded. The Evertree where many worlds resided on its countless branches is now nothing more than a sapling, its splendor long erased from memory. No one knows how to make it grow. But you are different. You hear the sun as it sings across the sky. You hear the language of rain against the earth. You are the last of the Everheart Alchemists and it is your ancestral task and privilege to care for the Evertree.Grow your own worlds and nurture a deep natural connection with everything they hold. See your actions change the world for better! Bring the Evertree back to life in this breathtaking world-crafting sandbox, with life management and adventure elements.… Expand"}, {"name": "Forager", "details_link": "https://www.metacritic.com/game/switch/forager", "publisher": "Humble Bundle", "release_date": "Jul 30 2019", "developers": ["HopFrog"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/0eec76a9086f637c80e4ac48184d80eb-98.jpg", "descriptions": "Forager is a 2D open world game inspired by exploration, farming and crafting games such as Stardew Valley, Terraria & Zelda. Start small and improve your base, skills, equipment, network of friends (and enemies!) and build your future as you see fit! You can play Forager in a very variedForager is a 2D open world game inspired by exploration, farming and crafting games such as Stardew Valley, Terraria & Zelda. Start small and improve your base, skills, equipment, network of friends (and enemies!) and build your future as you see fit! You can play Forager in a very varied array of playstyles.… Expand"}, {"name": "Devil May Cry 4", "details_link": "https://www.metacritic.com/game/pc/devil-may-cry-4", "publisher": "Capcom", "release_date": "Jul  8 2008", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Fantasy", "Beat-'Em-Up", "General", "Fantasy", "Linear"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/9720f9dd8e6ca334efb221339a329d21-98.jpg", "descriptions": "Fear resonates in the underworld as a new protagonist crosses paths with a familiar hero who seemingly inexplicably slaughters countless people. Long ago the Dark Knight Sparda awoke to justice and rebelled against the dark emperor, to wage a one-man war to save humanity. Thousands of yearsFear resonates in the underworld as a new protagonist crosses paths with a familiar hero who seemingly inexplicably slaughters countless people. Long ago the Dark Knight Sparda awoke to justice and rebelled against the dark emperor, to wage a one-man war to save humanity. Thousands of years later, a religious organization worships this renowned savior and has taken it upon themselves to rid the world of all demons. Residing in Fortuna, a castle city on the coast, this \"Order of the Sword\" has an elite group of \"Holy Knights\" dedicated to carrying out this very creed. Rising among the ranks, a young cynical warrior named Nero witnesses Sparda's legendary son Dante slaughter countless \"knights\". Has the renowned devil hunter turned his back on mankind? What does this encounter mean for these two individuals and why has destiny brought them together? In Devil May Cry 4, players control the formidable Nero who comes to grips with his newly found power as his beliefs and allegiance are tested. Continuing the legacy of fast paced action synonymous with the series, Devil May Cry 4 pushes the envelope of excellence even further with the inclusion of a new combat system that incorporates Nero's \"Devil Bringer\". This new feature has players delivering overwhelming damage to enemies with non-stop combos, while gaining new power for Nero's right arm. Good things come to those who wait as PC owners will benefit from having more modes and more visual customization options to help enhance their demon-slaying action. Turbo mode turns-up the action to insane speeds, while Legendary Dark Knight Mode harnesses advanced PC processing power and fill the screen with an unbelievable number of enemies for extra difficulty. Moreover, familiar enemies from the console versions will show-up in new locations in the PC version. [Capcom]… Expand"}, {"name": "Breath of Fire: Dragon Quarter", "details_link": "https://www.metacritic.com/game/playstation-2/breath-of-fire-dragon-quarter", "publisher": "Capcom", "release_date": "Feb 16 2003", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/ae42172bbaf6d6b355b2ec558a36540d-98.jpg", "descriptions": "It's an epic quest of magical proportions. You live in another time... another place... devoid of all light sources. You are now part of the underground world. Foil your menacing enemies to reach your ultimate mission. Only you can discover the way out of the labyrinth-like dungeon thatIt's an epic quest of magical proportions. You live in another time... another place... devoid of all light sources. You are now part of the underground world. Foil your menacing enemies to reach your ultimate mission. Only you can discover the way out of the labyrinth-like dungeon that envelops you and your friends. Escape your underground captors and you'll reach the world of the living. [Capcom]… Expand"}, {"name": "The Procession to Calvary", "details_link": "https://www.metacritic.com/game/pc/the-procession-to-calvary", "publisher": "Joe Richardson", "release_date": "Apr  9 2020", "developers": ["Joe Richardson"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/b27f1d7e5caefda6f42edc8f0df3b0ab-98.jpg", "descriptions": "Pilfer from pirates, conspire with cardinals and perform miracles with an incompetent magician. The Procession to Calvary is a Pythonesque adventure game made from Renaissance paintings, and a spiritual successor to the critically acclaimed Four Last Things."}, {"name": "Soul Bubbles", "details_link": "https://www.metacritic.com/game/ds/soul-bubbles", "publisher": "Eidos Interactive", "release_date": "Jun 10 2008", "developers": ["Mekensleep"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/2e7c8f1ecf8a2563b52128644589565f-98.jpg", "descriptions": "Experience the soulful stories of a young shaman apprentice entrusted with saving lost spirits and steering them to safety. Under the guidance of his master, he must protect these fragile souls from the hostile and dangerous world around them by creating mystic bubbles to guide them on theirExperience the soulful stories of a young shaman apprentice entrusted with saving lost spirits and steering them to safety. Under the guidance of his master, he must protect these fragile souls from the hostile and dangerous world around them by creating mystic bubbles to guide them on their spiritual journey. Using your Stylus, manipulate these mystical bubbles by deflating or expanding them in order to transport your spirits to safety. Fill created bubbles with water and pop them to extinguish dangerous fires or use them to trap harmful gases and blow them away. These diverse worlds are filled with supernatural challenges, so move your soul bubble gracefully, collecting star dust along the way to allow the light from your protected spirits to shine. Soul Bubbles features eight divine worlds with over 40 challenging levels that offer a rejuvenating new take on the puzzle genre. [Eidos Interactive]… Expand"}, {"name": "Praetorians", "details_link": "https://www.metacritic.com/game/pc/praetorians", "publisher": "Eidos Interactive", "release_date": "Mar 10 2003", "developers": ["Pyro Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/c45288b7eb6101db830c2f7263b8f853-98.jpg", "descriptions": "Set amidst the reign of Julius Caesar, Praetorians is an epic troop-based strategy game from the creators of the award-winning, best-selling Commandos series. As a Roman General on a quest to forge an empire, you will be transported back to the dusty battlefields of Egypt, the frozen landsSet amidst the reign of Julius Caesar, Praetorians is an epic troop-based strategy game from the creators of the award-winning, best-selling Commandos series. As a Roman General on a quest to forge an empire, you will be transported back to the dusty battlefields of Egypt, the frozen lands of the Gauls, and finally to the heart of the Empire itself, Italy. Your quest will be no easy task as the lands you seek to conquer are heavily defended by thousands of powerful troops. [Eidos Interactive]… Expand"}, {"name": "Mario and Donkey Kong: Minis on the Move", "details_link": "https://www.metacritic.com/game/3ds/mario-and-donkey-kong-minis-on-the-move", "publisher": "Nintendo", "release_date": "May  9 2013", "developers": ["Nintendo"], "platforms": "3DS", "genres": ["Puzzle", "Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/a6c55544cb1bfe962df600ff7a2a44f5-98.jpg", "descriptions": "Mario and Donkey Kong: Minis on the Move is a Nintendo eShop exclsuive that challenges players to place tiles on the bottom screen to guide the Mini Marios to their goal on the top screen."}, {"name": "Revita", "details_link": "https://www.metacritic.com/game/switch/revita", "publisher": "Dear Villagers", "release_date": "Apr 21 2022", "developers": ["BenStar"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/d08ca6b316f2c8391236a6a15a42eeaf-98.jpg", "descriptions": "A nameless child with no memories awakens in the metro with only a vague sense of purpose and desire to reach the distant clocktower, hoping to find answers at the top. On the way they will discover a melancholic world filled with masked characters, monsters and perhaps the answers that theA nameless child with no memories awakens in the metro with only a vague sense of purpose and desire to reach the distant clocktower, hoping to find answers at the top. On the way they will discover a melancholic world filled with masked characters, monsters and perhaps the answers that the child seeks. \r\rA fast paced twin-stick roguelite platformer. Climb an ominous clock tower in a series of procedural encounter rooms and past challenging boss fights on your way to reclaiming your lost memory.… Expand"}, {"name": "Naruto: Rise of a Ninja", "details_link": "https://www.metacritic.com/game/xbox-360/naruto-rise-of-a-ninja", "publisher": "Ubisoft", "release_date": "Oct 30 2007", "developers": ["Ubisoft Montreal"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Action Adventure", "General", "General", "Open-World"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/edf8e4392781a4092331d9ddb1a507d6-98.jpg", "descriptions": "In a game exclusively developed from the ground up for the Xbox 360, and for the first time, gamers can experience Naruto starting from the series' beginning. Relive Naruto's transformation from noisy ninja-academy dropout to respected ninja. Immerse Yourself In Naruto's Universe: RoamIn a game exclusively developed from the ground up for the Xbox 360, and for the first time, gamers can experience Naruto starting from the series' beginning. Relive Naruto's transformation from noisy ninja-academy dropout to respected ninja. Immerse Yourself In Naruto's Universe: Roam freely and discover authentic environments. Explore the genuine Konoha Village and its surroundings. Interact with Sasuke, Sakura, Kakashi and members from the Naruto cast.  The first Naruto game to combine action-adventure gameplay, classic platforming battles, head-to-head fighting, and in-depth character development. Build Your Fighting Techniques to Defeat Deadly Enemies in Fast-Paced Combat: Define your own way of the ninja as you learn to better control your chakra, improve your techniques, master new taijutsus and ninjutus, and command more powerful ninja weapons. Select your favorite Naruto character and challenge a friend. Customize your character and pick your own battlefield. [Ubisoft]… Expand"}, {"name": "Sonic Rush Adventure", "details_link": "https://www.metacritic.com/game/ds/sonic-rush-adventure", "publisher": "Sega", "release_date": "Sep 18 2007", "developers": ["Dimps Corporation"], "platforms": "DS", "num_players": "2  Online", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/e566e21f5ed38224b86f772a19e95b9c-98.jpg", "descriptions": "Sonic returns to the DS with all the classic 2D dual screen action of \"Sonic Rush,\" as well as a new high-seas adventure where he clashes with ruthless pirates. As Sonic, set off from Windmill Village to explore seven islands for action-packed adventures spread across a large map. As youSonic returns to the DS with all the classic 2D dual screen action of \"Sonic Rush,\" as well as a new high-seas adventure where he clashes with ruthless pirates. As Sonic, set off from Windmill Village to explore seven islands for action-packed adventures spread across a large map. As you venture, you'll uncover valuable items and materials that will help Tails build new ships so that Sonic can track down the villainous pirates in a variety of ways. With a fleet of up to five ships, including a submarine, water bike, and hovercraft, you will use the touch screen technology in exciting new ways to control your ships as you race across the ocean gathering rings, busting tricks, and torching pirate ships in fierce ship-to-ship battles. At the end of each level, test your skills in epic 3D boss battles that span both screens, including the ultimate showdown with the evil pirate, Captain Whisker. A high-speed ocean adventure: Battle with wicked pirates both on land and at sea throughout 14 action stages on seven different islands. Navigate the oceans and perform aerial tricks to avoid treacherous water mines and aim your cannons during ship-to-ship battles by using the stylus and touch screen on the Nintendo DS. Compete with friends via Wireless DS Single-Card Download Play in two battle modes. Two players will face-off in intense dual screen races or collect the most items spread throughout the map in exciting mission battles. [Sega]… Expand"}, {"name": "Stealth Inc: A Clone in the Dark", "details_link": "https://www.metacritic.com/game/playstation-vita/stealth-inc-a-clone-in-the-dark", "publisher": "Curve Studios", "release_date": "Jul 23 2013", "developers": ["Curve Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation Vita"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/e4c7eb77b4ee597d7cd64b29044e5945-98.jpg", "descriptions": "Stealth Inc: A Clone in the Dark is a fast-paced stealth platformer featuring brutal hazards, ruthless enemies, fiendish puzzles and red pixels galore. Jump, sneak, and be chunked through 80 levels. Will you make it out alive? Armed with only your wits and a pair of top-of-the-lineStealth Inc: A Clone in the Dark is a fast-paced stealth platformer featuring brutal hazards, ruthless enemies, fiendish puzzles and red pixels galore. Jump, sneak, and be chunked through 80 levels. Will you make it out alive? Armed with only your wits and a pair of top-of-the-line Stealthing Goggles, it's your job to sneak your way through a deadly facility that's determined to extinguish your fragile little life. With no weapons and no armor, being seen means instant death. Stay out of the light to avoid the attention of deadly security robots! Leap like a lusty salmon to avoid those zap-happy lasers! Think fast as the walls close in around you! And once you've defeated these deadly chambers (or they've defeated you), create your own fiendish death-rooms in Stealth Inc's fully-featured level editor. This game supports Cross Buy and entitles you to both the PS3 and Vita version!… Expand"}, {"name": "Not Tonight: Take Back Control Edition", "details_link": "https://www.metacritic.com/game/switch/not-tonight-take-back-control-edition", "publisher": "No More Robots", "release_date": "Jan 31 2020", "developers": ["Panic Barn Ltd"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "Simulation", "Virtual", "Career"], "meta_score": 78, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/2ce17087d668dacb3f0bfc41fc3f48e2-98.jpg", "descriptions": "Not Tonight is a post-Brexit management game, fusing a time-pressure RPG with a politically charged story where every decision matters. Will you join the resistance and fight the regime -- or keep your head down and hope that one day this will all be a distant memory? \r\rNot Tonight: OneNot Tonight is a post-Brexit management game, fusing a time-pressure RPG with a politically charged story where every decision matters. Will you join the resistance and fight the regime -- or keep your head down and hope that one day this will all be a distant memory? \r\rNot Tonight: One Love is a full, extra chapter that follows on from the main Not Tonight storyline. King's Head Dave has had just about enough of everything happening in Britain, and has decided to pack up and move to France, in the hope of finding true love.\r In an alternative Britain where Brexit talks have collapsed, an extreme far-right government has taken power. Citizens of European heritage have been rounded up and exiled. Forced out of your previous life, you find yourself in the midst of a booming gig economy, fighting to scrape by and return to the city you call home.… Expand"}, {"name": "Call of Duty Classic", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-classic", "publisher": "Activision", "release_date": "Dec  3 2009", "developers": ["Infinity Ward"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Historic", "Tactical", "Historic", "Arcade"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/867503be47a1edd9e5cb698c90d44817-98.jpg", "descriptions": "[Playstation Network]  For the first time ever, Infinity Ward's 2003 award-winning game that launched a franchise comes to consoles in Call of Duty Classic. Relive the original Call of Duty experience in high definition, including online multiplayer. Battlefield action: Experience the[Playstation Network]  For the first time ever, Infinity Ward's 2003 award-winning game that launched a franchise comes to consoles in Call of Duty Classic. Relive the original Call of Duty experience in high definition, including online multiplayer. Battlefield action: Experience the cinematic intensity of World War II's biggest conflicts including D-Day, Stalingrad, and the Battle of Berlin. Play through 24 epic single-player missions across four interconnected campaigns. [Activision]… Expand"}, {"name": "Bust-A-Move Live!", "details_link": "https://www.metacritic.com/game/xbox-360/bust-a-move-live!", "publisher": "Taito Corporation", "release_date": "Sep 30 2009", "developers": ["Taito Corporation"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/1ba09919baf2d9f3c3a76d2ce1190b7f-98.jpg", "descriptions": "[Xbox Live Arcade: Also known as \"Puzzle Bobble Live\"]   BUST-A-MOVE, sometimes known as PUZZLE BOBBLE, returns in BUST-A-MOVE Live!, with all of its exciting pick-up-and-play gameplay intact. Dazzling graphics and a surreal soundtrack create a unique fantasy world enhancing the ultimate[Xbox Live Arcade: Also known as \"Puzzle Bobble Live\"]   BUST-A-MOVE, sometimes known as PUZZLE BOBBLE, returns in BUST-A-MOVE Live!, with all of its exciting pick-up-and-play gameplay intact. Dazzling graphics and a surreal soundtrack create a unique fantasy world enhancing the ultimate BUST-A-MOVE experience. Classic gameplay: Fire bubbles at the bubble clusters on each stage to destroy them. It's easy to play, challenging, and fun. Multiple game modes: Clear 135 stages in Single Player mode, play against 8 colorful opponents in CPU Battle mode, or take on the Infinity mode featuring a never-ending cluster of bubbles to destroy. Online gameplay: Multiplayer mode offers frenetic competitive play that can be enjoyed at home or over Xbox LIVE, with or without Voice Chat. Even more stages: Extra Packs 1 and 2 will offer an additional 270 stages for download. [Taito]… Expand"}, {"name": "MLB 09: The Show", "details_link": "https://www.metacritic.com/game/psp/mlb-09-the-show", "publisher": "SCEA", "release_date": "Mar  3 2009", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 2", "PlayStation 3", "PSP"], "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/99d1615d7d31bf49ae0ac203567852a9-98.jpg", "descriptions": "Road to the Show 3.0. Now includes interactive training, new settings, a new steal/ lead-off system, presentations and coach interactions. Interactive training will consist of a set of mini-games designed to improve a player’s ability and performance in various areas of baseball. FranchiseRoad to the Show 3.0. Now includes interactive training, new settings, a new steal/ lead-off system, presentations and coach interactions. Interactive training will consist of a set of mini-games designed to improve a player’s ability and performance in various areas of baseball. Franchise Mode 2.0. Improvements include the long awaited 40-man roster! The latest Franchise Mode improvements will also offer Salary Arbitration, Waiver Transactions and September call-ups. Training/Practice Drills. In MLB 09 users will have the ability to choose from a number of different Training/Practice drills. The drills will be of various concentrations of the game. These drills are a perfect way to polish and improve your baseball skills in The Show. Details & Subtleties. Details and subtleties play a huge role in legitimizing a game and helping you lose yourself in the suspension of disbelief. MLB 09 The Show sinks it's teeth into the details with realistic stadiums and signage, wear and tear on field, dusk to night lighting transitions, stadium Jumbotron animations and even crowd atmosphere - reaching up for foul balls out of play and home runs in addition to crowd rivalries and weather appropriate clothing. [SCEA]… Expand"}, {"name": "Blasphemous", "details_link": "https://www.metacritic.com/game/playstation-4/blasphemous", "publisher": "Team17", "release_date": "Sep 10 2019", "developers": ["The Game Kitchen"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "", "Metroidvania"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/e66dfebbe22dea536709fcbeea291911-98.jpg", "descriptions": "Blasphemous is a punishing action-platformer that combines the fast-paced, skilled combat of a hack-n-slash game with a deep and evocative narrative core, delivered through exploration of a huge universe comprised of non-linear levels."}, {"name": "The Persistence VR", "details_link": "https://www.metacritic.com/game/playstation-4/the-persistence-vr", "publisher": "Sony Interactive Entertainment", "release_date": "Jul 24 2018", "developers": ["Firesprite"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/1955be663de91b0f3a27bd3f3f84aa64-98.jpg", "descriptions": "Caught in the inexorable pull of a black hole, and with the crew mutated into horrific and murderous aberrations, it’s down to you, a clone of security officer Zimri Eder, to save the ship and make the jump back to earth."}, {"name": "Bejeweled 3", "details_link": "https://www.metacritic.com/game/xbox-360/bejeweled-3", "publisher": "PopCap", "release_date": "Oct 19 2011", "developers": ["PopCap"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/aad9b4ac2374c078f49edb3cb0ec11c4-98.jpg", "descriptions": "The biggest, brightest Bejeweled ever! Discover all-new ways to play the world's #1 puzzle game. Find your perfect match with 8 breathtaking game modes that meet all your moods ease into Classic Bejeweled for cascades of fun, journey through 40 challenging Quest puzzles, charge into theThe biggest, brightest Bejeweled ever! Discover all-new ways to play the world's #1 puzzle game. Find your perfect match with 8 breathtaking game modes that meet all your moods ease into Classic Bejeweled for cascades of fun, journey through 40 challenging Quest puzzles, charge into the electrifying Lightning for non-stop action, and tailor your experience in Zen for a revolutionary new way to relax.… Expand"}, {"name": "Tiger Woods PGA Tour 07", "details_link": "https://www.metacritic.com/game/psp/tiger-woods-pga-tour-07", "publisher": "EA Sports", "release_date": "Oct 10 2006", "developers": ["Team Fusion"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/d5af455a7ee1c4034c09075b760953ad-98.jpg", "descriptions": "Tiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournamentTiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournament play. Enhanced Career Mode — From working on your driving to mastering your putting skills, craft your game with training challenges in the Practice Facility, then take on the world's best golfers on the World Tour. All-New Championship Courses — The course content doubles with the addition of new licensed courses, including Firestone Country Club, Glen Abbey, Princeville, Spyglass Hill, St Andrews, and Bandon Dunes. The game features 15 of the world's top players, including Tiger Woods, John Daly, Vijay Singh, Ian Poulter, Michael Campbell, and Annika Sorenstam, the most decorated golfer on the LPGA Tour. Show Your GameFace — The innovative character creation tool is revamped with deeper modifications, more apparel, equipment licenses, and specialty items. Challenge up to three players in five new game modes, or play in online tournaments complete with money lists, full stat tracking, league leaders, and more. More Game Modes — Work on your game or take on a friend in Match Play, Battle Golf, 21, OneBall, and more. [EA Sports]… Expand"}, {"name": "GTFO", "details_link": "https://www.metacritic.com/game/pc/gtfo", "publisher": "10 Chambers Collective", "release_date": "Dec  9 2021", "developers": ["10 Chambers Collective"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/9d022f61eb3ef7084bbfdfec535b5dd9-98.jpg", "descriptions": "GTFO is a 4 player action/horror cooperative first-person shooter for hardcore gamers looking for a real challenge. Players get to play as a team of prisoners, forced to explore and extract valuable artifacts from a vast underground complex that has been overrun by terrifying creatures.GTFO is a 4 player action/horror cooperative first-person shooter for hardcore gamers looking for a real challenge. Players get to play as a team of prisoners, forced to explore and extract valuable artifacts from a vast underground complex that has been overrun by terrifying creatures. Gather weapons, tools, and resources to help you survive - and work to unearth the answers about your past and how to escape.KEY FEATURES* 4 player cooperative PvE gameplay that puts you and your teammates through the ultimate cooperation and communication test.* Explore a massive underground complex with a dense and dark atmosphere.* Plan your expedition, equip and operate tools, combine your firepower, communicate and coordinate as a team - every detail counts if you are to survive the nightmare.* Search the complex for information and resources to help you and your team solve your objectives and come back alive.* The Rundown: New expeditions released regularly that always replaces the old expeditions. Our goal is to invent new ways of challenging you and your teammates in new and interesting ways.* Nightmarish atmosphere accompanied by music from acclaimed composer Simon Viklund.… Expand"}, {"name": "forma.8", "details_link": "https://www.metacritic.com/game/playstation-4/forma8", "publisher": "MixedBag", "release_date": "Feb 23 2017", "developers": ["MixedBag"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D", "Metroidvania"], "meta_score": 78, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/2/649bb46a43b9f8be66792e2c751f7dae-98.jpg", "descriptions": "In a distant future, the small exploration probe forma.8 is stranded alone on the surface of an alien planet. He got parted away from his companions by an accidental event and has a life or death mission to accomplish: he needs to find and recover a powerful energy source deep under theIn a distant future, the small exploration probe forma.8 is stranded alone on the surface of an alien planet. He got parted away from his companions by an accidental event and has a life or death mission to accomplish: he needs to find and recover a powerful energy source deep under the surface before itâ€™s too late. Ancient civilisations, great perils and dystopian visions awaits him, and not everything is as it seems...… Expand"}, {"name": "Shin Megami Tensei: Persona", "details_link": "https://www.metacritic.com/game/psp/shin-megami-tensei-persona", "publisher": "Atlus", "release_date": "Sep 22 2009", "developers": ["ITL"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 78, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/7/32593848d9fd1e16d03b542f6ca5c669-98.jpg", "descriptions": "The rumor going around St. Hermelin High School holds that if you play the \"Persona\" game, you can see what the future holds for you. When a group of students-some eager, some skeptical-tries the game out, they experience something quite different. Before long, the city is turned upside-downThe rumor going around St. Hermelin High School holds that if you play the \"Persona\" game, you can see what the future holds for you. When a group of students-some eager, some skeptical-tries the game out, they experience something quite different. Before long, the city is turned upside-down and demons are roaming the streets, and only the students' newfound power of Persona can set things right again. Whether you pursue Takahisa Kandori and his abuses of the power he wields as SEBEC's president, or whether you delve into the curse of the Snow Queen that has plagued St. Hermelin for decades, a deep, modern, psychological tale awaits. Remember your true self, and free the tortured psyches of others... More than the same old JRPG -- Dark, philosophical, and complex, Persona sets you up in a modern day Japan that has gone into chaos.  Demons run free, and you and your team must navigate corruption, mental frailty, and an alternate version of your world to bring your reality back into order. A second chance on PSP -- Offering a second opportunity to experience the beginnings of the acclaimed Persona series, this remake boasts a fully relocalized script, revamped user interface, faster battles, expanded soundtrack, and new in-game movies with voice work added just for the North American release. Unique tactical opportunities -- The inner selves known Personas are your key to progressing through the adventure, adding skills and incredible depth to your battle tactics. Expand and improve your collection through the Demon Negotiation system that offers spell cards that you can later fuse into new Personas. [Atlus USA]… Expand"}, {"name": "Disney/Pixar Toy Story 3", "details_link": "https://www.metacritic.com/game/playstation-3/disneypixar-toy-story-3", "publisher": "Disney Interactive Studios", "release_date": "Jun 15 2010", "developers": ["Avalanche Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/35ca0cd31cee5f25c047d262ef170544-98.jpg", "descriptions": "Unleash your imagination in this new open world and play with Andy's toys your way. As Buzz, Woody, or Jessie, you choose what activities you want to do and the order you wish to do them. The more you use your imagination and create your own story, the more you get rewarded. [Disney Interactive]"}, {"name": "Call of Duty: Black Ops - First Strike", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops---first-strike", "publisher": "Activision", "release_date": "Feb  1 2011", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Historic", "Arcade"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/f53d93bda0ba8d2d8c3862a6accf123e-98.jpg", "descriptions": "This map pack features new multiplayer maps, including Kowloon and Berlin Wall."}, {"name": "Silent Hill: Origins", "details_link": "https://www.metacritic.com/game/psp/silent-hill-origins", "publisher": "Konami", "release_date": "Nov  6 2007", "developers": ["Climax Group", "Climax Studios"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/5ba75767468df968ececca009e520f32-98.jpg", "descriptions": "Silent Hill Origins tells the tale of a solitary truck driver stuck in the terrifying town while making a routine delivery. New gameplay elements, such as a barricade system that lets players block off rooms from enemies, and an enhanced camera system deliver an added sense of isolation andSilent Hill Origins tells the tale of a solitary truck driver stuck in the terrifying town while making a routine delivery. New gameplay elements, such as a barricade system that lets players block off rooms from enemies, and an enhanced camera system deliver an added sense of isolation and anxiety in this frightening adventure. [Konami]… Expand"}, {"name": "Sniper Elite 4", "details_link": "https://www.metacritic.com/game/pc/sniper-elite-4", "publisher": "Rebellion", "release_date": "Feb 14 2017", "developers": ["Rebellion"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/312a16c9b0831cfc84e7d1f934349ea4-98.jpg", "descriptions": "Welcome to Italy, 1943.\r Set in the aftermath of its award-winning predecessor, Sniper Elite 4 continues the series World War Two heritage by transporting players across the beautiful Italian peninsula, from sun-drenched Mediterranean coastal towns, to colossal Nazi mega structures,Welcome to Italy, 1943.\r Set in the aftermath of its award-winning predecessor, Sniper Elite 4 continues the series World War Two heritage by transporting players across the beautiful Italian peninsula, from sun-drenched Mediterranean coastal towns, to colossal Nazi mega structures, daunting forests and giddying mountain monasteries inspired by Monte Cassino.\r Covert agent and elite marksman Karl Fairburne must fight alongside the brave men and women of the Italian Resistance to help free their country from the yoke of Fascism, and defeat a terrifying new threat with the potential to halt the Allied fightback in Europe before its even begun.\r If his mission fails, there will be no Operation Overlord, no D-Day landings, and no Victory in Europe.… Expand"}, {"name": "Mutant Year Zero: Road to Eden", "details_link": "https://www.metacritic.com/game/pc/mutant-year-zero-road-to-eden", "publisher": "Funcom", "release_date": "Dec  4 2018", "developers": ["The Bearded Ladies Consulting"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/f3ad8402051406b142a1515e0f7069e1-98.jpg", "descriptions": "A tactical adventure game combining the turn-based combat of XCOM with story, exploration, stealth, and strategy. Take control of a team of Mutants navigating a post-human Earth. Created by a team including former HITMAN leads and the designer of PAYDAY."}, {"name": "Capcom Beat 'Em Up Bundle", "details_link": "https://www.metacritic.com/game/switch/capcom-beat-em-up-bundle", "publisher": "Capcom", "release_date": "Sep 18 2018", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/c61ceff2b5c1949af02de7777dc4e41c-98.jpg", "descriptions": "Relive the glory days of cooperative arcade games with the Capcom Beat ‘Em Up Bundle. This comprehensive collection includes seven classic games, each with various multiplayer options, online capabilities and detailed galleries."}, {"name": "EA Sports Active 2", "details_link": "https://www.metacritic.com/game/playstation-3/ea-sports-active-2", "publisher": "EA Sports", "release_date": "Nov 16 2010", "developers": ["EA Canada"], "platforms": ["iPhone/iPad", "Xbox 360", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 78, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/8/0592de424d2ff1ac20a026eb0804b206-98.jpg", "descriptions": "EA SPORTS Active 2.0 provides total body conditioning using progressive exercise in new prescribed programs. A three-phase, nine-week program provides a fitness roadmap to help keep users motivated and on track of their fitness goals. Additional mini-programs will also be available to addEA SPORTS Active 2.0 provides total body conditioning using progressive exercise in new prescribed programs. A three-phase, nine-week program provides a fitness roadmap to help keep users motivated and on track of their fitness goals. Additional mini-programs will also be available to add on, keeping workouts fresh and inspiring. The EA SPORTS Active personal trainer will walk users through their workout and provide continued encouragement with feedback to ensure an optimal workout experience.  … Expand"}, {"name": "Final Fantasy XIV Online: A Realm Reborn", "details_link": "https://www.metacritic.com/game/playstation-3/final-fantasy-xiv-online-a-realm-reborn", "publisher": "Square Enix", "release_date": "Aug 27 2013", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "PlayStation 3"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/8e89f2b277150f300c44139282945b32-98.jpg", "descriptions": "Previously referenced as \"version 2.0,\" this title has been rebuilt from the ground up, and centers on the core concept of rebirth, featuring a new world to explore and storyline to experience."}, {"name": "Chime Super Deluxe", "details_link": "https://www.metacritic.com/game/playstation-3/chime-super-deluxe", "publisher": "Zoe Mode", "release_date": "Mar 29 2011", "developers": ["Zoe Mode"], "platforms": "PlayStation 3", "genres": ["Puzzle", "Miscellaneous", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/c7e68ecbf13e75e5d8edec55cbdf6d0d-98.jpg", "descriptions": "Superseding the previously released Chime on Xbox LIVE Arcade and PC, Chime Super Deluxe features new music from a variety of artists in addition to those already included (Moby, Markus Schulz, Philip Glass, Paul Hartnoll from Orbital and Fred Deakin from Lemon Jelly). The line-up includesSuperseding the previously released Chime on Xbox LIVE Arcade and PC, Chime Super Deluxe features new music from a variety of artists in addition to those already included (Moby, Markus Schulz, Philip Glass, Paul Hartnoll from Orbital and Fred Deakin from Lemon Jelly). The line-up includes tracks created exclusively for Chime and provides the largest roster of music so far for players to enjoy.… Expand"}, {"name": "DeathSpank: Thongs of Virtue", "details_link": "https://www.metacritic.com/game/playstation-3/deathspank-thongs-of-virtue", "publisher": "EA Partners", "release_date": "Sep 21 2010", "developers": ["Hothead Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/f51b35818030c6b4cf5b34de43ec724e-98.jpg", "descriptions": "Featuring the trademark humor found in the original, Thongs of Virtue centers on DeathSpank's journey through a massive war-torn land; explore the North Pole and the high seas to locate six mystical thongs to bring peace and harmony to the universe."}, {"name": "Lost Planet: Extreme Condition Colonies Edition", "details_link": "https://www.metacritic.com/game/xbox-360/lost-planet-extreme-condition-colonies-edition", "publisher": "Capcom", "release_date": "May 27 2008", "developers": ["Capcom"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/b783b630f60c6f0ef2efd4515e4a3ee1-98.jpg", "descriptions": "Lost Planet: Extreme Condition Colonies Edition provides action for both online and offline players. Gamers who missed the original Lost Planet will have the opportunity to experience the original with the added bonus of fresh new content and cross platform multi-play all at a great valueLost Planet: Extreme Condition Colonies Edition provides action for both online and offline players. Gamers who missed the original Lost Planet will have the opportunity to experience the original with the added bonus of fresh new content and cross platform multi-play all at a great value price. Fans of the Lost Planet's online action will enjoy new online modes, maps, weapons and models. [Capcom]… Expand"}, {"name": "Chaos on Deponia", "details_link": "https://www.metacritic.com/game/pc/chaos-on-deponia", "publisher": "Daedalic Entertainment", "release_date": "Nov  6 2012", "developers": ["Daedalic Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/3e15aae2e0678f7573129b6489ee2b73-98.jpg", "descriptions": "Embark on round 2. CoD promises to be even crazier than the first game and quickly puts the player under its spell. After the events on Deponia, it appears that Rufus came to his senses."}, {"name": "Ashen", "details_link": "https://www.metacritic.com/game/xbox-one/ashen", "publisher": "Annapurna Interactive", "release_date": "Dec  7 2018", "developers": ["A44"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/b3bb6f64bf493dbdf62ffba0db7c368d-98.jpg", "descriptions": "Ashen is a 3rd person, action RPG about forging relationships. You are a lone wanderer in a sunless land. The only light to be had sputters from an age-old lantern at your side. There is a rumble in the distance, and then a light. Through leaking eyes you make out a peak on the horizon,Ashen is a 3rd person, action RPG about forging relationships. You are a lone wanderer in a sunless land. The only light to be had sputters from an age-old lantern at your side. There is a rumble in the distance, and then a light. Through leaking eyes you make out a peak on the horizon, choking the land in a cloud of ash. Nothing ever shone so bright. The first dawn turns to dusk and finally recedes into familiar blackness. A GAME BY AURORA44. This is the tale of a bygone world. Choose a path and hold on to those you trust. Players can choose to guide those they trust to their camp, encouraging them to rest at the fire and perhaps remain. Together, you might just stand a chance.… Expand"}, {"name": "James Bond 007: NightFire", "details_link": "https://www.metacritic.com/game/xbox/james-bond-007-nightfire", "publisher": "Electronic Arts", "release_date": "Nov 18 2002", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/c3cce6d19fb0d654898f28fb40062e6e-98.jpg", "descriptions": "The ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire.  Explore new heights and depths like never before--infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through theThe ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire.  Explore new heights and depths like never before--infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through the streets of Tokyo.  New state-of-the-art upgradeable gadgets and weapons and original missions--including zero-gravity assignments--will leave you shaken and stirred.  … Expand"}, {"name": "That Dragon, Cancer", "details_link": "https://www.metacritic.com/game/pc/that-dragon-cancer", "publisher": "Numinous Games", "release_date": "Jan 11 2016", "developers": ["Numinous Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/befdfba92e828c784d8c30ea166398e9-98.jpg", "descriptions": "That Dragon, Cancer is an adventure game that acts as a living painting; a poem; an interactive retelling of Ryan and Amy Green's experience raising their son Joel, a 4-year-old currently fighting his third year of terminal cancer. Players relive memories, share heartache, and discover theThat Dragon, Cancer is an adventure game that acts as a living painting; a poem; an interactive retelling of Ryan and Amy Green's experience raising their son Joel, a 4-year-old currently fighting his third year of terminal cancer. Players relive memories, share heartache, and discover the overwhelming hope that can be found in the face of death.… Expand"}, {"name": "Goat Simulator 3", "details_link": "https://www.metacritic.com/game/xbox-series-x/goat-simulator-3", "publisher": "Deep Silver", "release_date": "Nov 17 2022", "developers": ["Coffee Stain North"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 4 ", "genres": ["Simulation", "General"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/5c0d00324e77185eb8faf4855bd3b22f-98.jpg", "descriptions": "That's right - we're doing this again. The baa has been raised, and Pilgor is joined by other goats too. You can invite up to three friends in local or online co-op, create carnage as a team, or compete in mini-games and then not be friends anymore.Get ready for another round of udderThat's right - we're doing this again. The baa has been raised, and Pilgor is joined by other goats too. You can invite up to three friends in local or online co-op, create carnage as a team, or compete in mini-games and then not be friends anymore.Get ready for another round of udder mayhem. Lick, headbutt, and ruin your way through a brand new open world in the biggest waste of your time since Goat Simulator! We won't tell you how to play (except in the tutorial), but merely provide the means to be the goats of your dreams.… Expand"}, {"name": "Once Upon a Jester...", "details_link": "https://www.metacritic.com/game/switch/once-upon-a-jester", "publisher": "Crunching Koalas", "release_date": "Nov  9 2022", "developers": ["Bonte Avond"], "platforms": ["PC", "Switch"], "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/8b42b0be2ff5853d8412673337444919-98.jpg", "descriptions": "Best friends Sok & Jester devise a mischievous scheme to steal the Royal Diamond!To complete their master plan, they must start an improv theatre show and outperform every other act - including their rivals, Hofnar & Bok. Only becoming the best show in the kingdom will get them invited toBest friends Sok & Jester devise a mischievous scheme to steal the Royal Diamond!To complete their master plan, they must start an improv theatre show and outperform every other act - including their rivals, Hofnar & Bok. Only becoming the best show in the kingdom will get them invited to the Royal Theatrical Spectacle in the Royal Palace, where the king keeps his precious gem.They embark on a grand adventure across a fantasy kingdom, meeting tons of wacky characters, performing improvised shows and singing their hearts out. Along the way, they unintentionally discover the freedom and joy of musical theatre. Will the pair change their wicked ways or do whatever it takes to get rich?… Expand"}, {"name": "Metal: Hellsinger", "details_link": "https://www.metacritic.com/game/playstation-5/metal-hellsinger", "publisher": "Funcom", "release_date": "Sep 15 2022", "developers": ["The Outsiders"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/93a3429cce0e0b40bca9a6a2f49b1f8d-98.jpg", "descriptions": "Strike terror into the hearts of demons and devils as you fight your way through eight Hells. Metal: Hellsinger is a rhythm FPS, brimming with diabolical enemies, powerful weapons, and metal music. Set out on an infernal journey in order to achieve the purest of goals: Vengeance."}, {"name": "ANNO: Mutationem", "details_link": "https://www.metacritic.com/game/switch/anno-mutationem", "publisher": "Lightning Games", "release_date": "Sep  1 2022", "developers": ["ThinkingStars"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/882092bb0d1444a74c00d0b0b146c013-98.jpg", "descriptions": "Welcome to the neon-covered, 2D-meets-3D Cyberpunk world of ANNO: Mutationem. In this Action-Adventure game with RPG elements you become Ann: a highly-skilled combat-trained lone wolf on a personal mission in the giant Metropolis, full of sinister mega-corporations, mysterious fringe groupsWelcome to the neon-covered, 2D-meets-3D Cyberpunk world of ANNO: Mutationem. In this Action-Adventure game with RPG elements you become Ann: a highly-skilled combat-trained lone wolf on a personal mission in the giant Metropolis, full of sinister mega-corporations, mysterious fringe groups and creatures more bizarre than words can express.This is a world full of surprises waiting for you to find out! While going through the main story you can chat with a Cyborg corgi, take on a part-time bartender job, hunt down vicious criminals reveal the true face of a trending V-streamer! By exploring diverse locations such as neon Noctis Town, an off-shore cargo ship and huge underground structures, players are free to go as they please and act as they want.… Expand"}, {"name": "Capcom Arcade 2nd Stadium", "details_link": "https://www.metacritic.com/game/xbox-one/capcom-arcade-2nd-stadium", "publisher": "Capcom", "release_date": "Jul 22 2022", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/7/c9995ce1c5a9569f62a5c90cedda8421-98.jpg", "descriptions": "Included Games: 1943 Kai\rBlack Tiger\rBlock Block\r\nCapcom Sports Club\r\nDarkstalkers: The Night Warriors\r\nEco Fighters\r\nGan Sumoku (GunSmoke)\r\nHissatsu Buraiken (Avengers)\r\nHyper Dyne Side Arms\r\nHyper Street Fighter II: The Anniversary Edition\r\nKnights of the Round\r\nLast Duel\r\nMagic SwordIncluded Games: 1943 Kai\rBlack Tiger\rBlock Block\rCapcom Sports Club\rDarkstalkers: The Night Warriors\rEco Fighters\rGan Sumoku (GunSmoke)\rHissatsu Buraiken (Avengers)\rHyper Dyne Side Arms\rHyper Street Fighter II: The Anniversary Edition\rKnights of the Round\rLast Duel\rMagic Sword\rMega Man: The Power Battle\rMega Man 2: The Power Fighters\rNight Warriors: Darkstalkers’ Revenge\rPnickies\rRally 2011 LED Storm\rSaturday Night Slam Masters\rSavage Bees (Exed Exes)\rSonSon\rStreet Fighter\rStreet Fighter Alpha: Warriors’ Dreams\rStreet Fighter Alpha 2\rStreet Fighter Alpha 3\rSuper Gem Fighter Mini Mix\rSuper Puzzle Fighter II Turbo\rThe King of Dragons\rThe Speed Rumbler (Rush & Crash)\rThree Wonders\rTiger Road\rVampire Savior: The Lord of Vampire… Expand"}, {"name": "Hell Pie", "details_link": "https://www.metacritic.com/game/pc/hell-pie", "publisher": "Headup Games", "release_date": "Jul 21 2022", "developers": ["Sluggerfly"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/cec59ca9f5b92a7e6d78be8d88dc4532-98.jpg", "descriptions": "Hell Pie is an obscene 3D platformer that takes bad taste to the next level. Hell Pie sees you grab the horns of Nate, the ‘Demon of Bad Taste’. He is given the honorable task of gathering the disgusting ingredients for Satan’s infamous birthday pie."}, {"name": "WWE 2K22", "details_link": "https://www.metacritic.com/game/xbox-series-x/wwe-2k22", "publisher": "2K Games", "release_date": "Mar  8 2022", "developers": ["Take-Two Interactive", "Visual Concepts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 78, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/ae919b34e20dd813a986b7aa52de4f2d-98.jpg", "descriptions": "Get ripped out of the stands and hit with complete control of the WWE Universe. Hitting this hard has never been so easy. Everything from the controls to the graphics have been redesigned, and feels as real as being ringside at WrestleMania. Hit with the biggest and best-looking SuperstarsGet ripped out of the stands and hit with complete control of the WWE Universe. Hitting this hard has never been so easy. Everything from the controls to the graphics have been redesigned, and feels as real as being ringside at WrestleMania. Hit with the biggest and best-looking Superstars and Legends: The Rock, Sasha Banks, Ric Flair, Alexa Bliss & more.\r… Expand"}, {"name": "Riders Republic", "details_link": "https://www.metacritic.com/game/pc/riders-republic", "publisher": "Ubisoft", "release_date": "Oct 28 2021", "developers": ["Ubisoft"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PC"], "genres": ["Sports", "Individual", "Other"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/40cd9facae721e47dcedc599d76360e8-98.jpg", "descriptions": "Jump into the Riders Republic massive multiplayer playground! Meet and compete with other players, and ride hard with an exciting range of activities such as bike, ski, snowboard, wingsuit and rocket wingsuit.\r Live out the rider's fantasy as you roam free in a huge, vibrant open world,Jump into the Riders Republic massive multiplayer playground! Meet and compete with other players, and ride hard with an exciting range of activities such as bike, ski, snowboard, wingsuit and rocket wingsuit.\r Live out the rider's fantasy as you roam free in a huge, vibrant open world, always buzzing with other players around you. Immerse yourself in iconic American national parks including Bryce Canyon, Yosemite Valley, Mammoth Mountain... all mashed up for you to shred!\r Squad up with your friends and compete in a wide range of multiplayer modes: feel the rush of downhill races, dominate maps in team vs team competitions, or give it your best shot in epic mass PvP races with more than 50 other players. Go all out. Join the madness!… Expand"}, {"name": "Lemnis Gate", "details_link": "https://www.metacritic.com/game/playstation-5/lemnis-gate", "publisher": "Frontier Foundry", "release_date": "Sep 28 2021", "developers": ["Ratloop Games Canada"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/2a18216c8d09100ac5566280f9b9fd1b-98.jpg", "descriptions": "Lemnis Gate is a time-warping, turn-based combat strategy FPS. Over five alternating turns taking place in a 25” time-loop, you are called to master the unique abilities of a varied cast of deep-space operatives and outskill, outsmart, and outmanoeuvre your opponent in mind-bendingLemnis Gate is a time-warping, turn-based combat strategy FPS. Over five alternating turns taking place in a 25” time-loop, you are called to master the unique abilities of a varied cast of deep-space operatives and outskill, outsmart, and outmanoeuvre your opponent in mind-bending four-dimensional battles. Lemnis Gate twists time to subvert one of the world’s most popular game genres and offers a relentlessly inventive multiplayer experience deeply rooted in tactical FPS gameplay. Challenge yourself to think across four dimensions as you embark on the ultimate test of cognition and combat.\r Matches in Lemnis Gate take place within time loops. You have 25 seconds to execute your action, be it blasting an enemy, manoeuvring your operative, or setting up your next move. After all players have taken turns, the next 25-second round begins. Now you’ll face what has happened while setting up what will happen. Each of the five rounds is your chance to alter the timeline as past, present, and future converge.\r STRATEGIC COMBAT IN THE FOURTH DIMENSION\rVictory doesn’t rely on shooting supremacy. You’ll have to use skill and strategy to create unstoppable game plans and get the drop on opponents. It’s all about non-linear logic, abstract thinking, and outlandish manoeuvres. Execute audacious acts and think several moves ahead to get the win.\r A TIME-BENDING TACTICAL SHOOTER\rWith a varied cast of characters to choose from, how you play is up to you. Lay damaging toxic waste in your enemy’s path, slow time to land the perfect shot, or deploy protective orbs to assist your future self. Every operative possesses a distinctive loadout and special ability that proves decisive on the battlefield.\r TEAM UP WITH YOURSELF\rWelcome to the team comprised entirely of one: you. With Lemnis Gate’s innovative auto co-op feature, you command every member of your side. Auto co-op gives you total control of five deep-space operatives, effectively enabling two competitors to duke it out in bustling ten-character matches. Become a literal one-person army.\r COUNTLESS POSSIBILITIES, ENDLESS OUTCOMES\rFrom the first second to the last, anything can happen in Lemnis Gate. Each round is a fresh chance to implement an unbeatable new strategy – or earn redemption from an earlier error. Predict hostiles’ routes, infiltrate enemy lines, and develop multi-layered gameplans by co-operating with yourself. Experiment both in and outside time, and get creative with causality.… Expand"}, {"name": "Samurai Warriors 5", "details_link": "https://www.metacritic.com/game/switch/samurai-warriors-5", "publisher": "Koei Tecmo Games", "release_date": "Jul 27 2021", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/b7c12bf16ad98fdd8619f2570ef1eea0-98.jpg", "descriptions": "Experience exhilarating action set in a dramatic historical setting in SAMURAI WARRIORS 5. As the latest numbered entry in the SAMURAI WARRIORS franchise, the story, characters, and visuals have been re-imagined to set the stage for a thrilling new series. The story takes place after theExperience exhilarating action set in a dramatic historical setting in SAMURAI WARRIORS 5. As the latest numbered entry in the SAMURAI WARRIORS franchise, the story, characters, and visuals have been re-imagined to set the stage for a thrilling new series. The story takes place after the Ōnin War during the golden age of the Sengoku period, and features a story that centers on the lives of two of the most representative military commanders of this era: Nobunaga Oda and Mitsuhide Akechi. Choose from a number of new and returning characters while utilizing new abilities to take on evolving enemy forces. Experience electrifying Musou action like never before in SAMURAI WARRIORS 5.\r  ・Experience an intense historical drama set during Japan's Sengoku period, told from the perspective of this era's foremost military commanders: Nobunaga Oda and Mitsuhide Akechi.\r ・Both returning heroes and brand new characters have received re-imagined designs in order to showcase the captivating world of the Sengoku period.\r ・Enjoy exhilarating strategic action on an evolved battlefield.\r ・Enemy forces continue to evolve as time passes in the story, making full use of a number of different military tactics to take on the player.\r… Expand"}, {"name": "Curse of the Dead Gods", "details_link": "https://www.metacritic.com/game/switch/curse-of-the-dead-gods", "publisher": "Focus Home Interactive", "release_date": "Feb 23 2021", "developers": ["Passtech Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/1e7c1011209cd21a2895a09d30cd12b2-98.jpg", "descriptions": "You seek untold riches, eternal life, divine powers -- it leads to this accursed temple, a seemingly-infinite labyrinth of bottomless pits, deadly traps, and monsters.Your greed will lead you to death, but that is not an escape. Rise to fight again. Delve deeper again. Defy the malignantYou seek untold riches, eternal life, divine powers -- it leads to this accursed temple, a seemingly-infinite labyrinth of bottomless pits, deadly traps, and monsters.Your greed will lead you to death, but that is not an escape. Rise to fight again. Delve deeper again. Defy the malignant deities that linger in this place. Battle through hordes of enemies in dark, cavernous passages filled with traps and secrets of all sorts -- fire-spewing statues, explosives, hidden spikes, and worse.Collect mystical Relics and an arsenal of weapons to make yourself unstoppable. Corruption builds in you with every step -- encourage or ignore it, but each powerful curse can be a double-edged sword.… Expand"}, {"name": "ALTDEUS: Beyond Chronos", "details_link": "https://www.metacritic.com/game/pc/altdeus-beyond-chronos", "publisher": "MyDearest", "release_date": "Dec  4 2020", "developers": ["MyDearest"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/1/660a5390ee902769e048bebf6fda8dbe-98.jpg", "descriptions": "Enter the latest installment in the Chronos Series.\rBecome Lieutenant Chloe, pilot of the massive battle robot Makhia as you face off against the Meteoras, colossal enemies of humanity in a story that takes place 200 years in the future.\r\r\nMake choices and decisions with the guidance ofEnter the latest installment in the Chronos Series.\rBecome Lieutenant Chloe, pilot of the massive battle robot Makhia as you face off against the Meteoras, colossal enemies of humanity in a story that takes place 200 years in the future.\r Make choices and decisions with the guidance of the Decision Support System.\rPilot the 400-meter-tall Makhia in blood-pumping action sequences.\rBe amazed by the concerts of an electronic idol.\r The future awaits beyond your screen.… Expand"}, {"name": "Haven", "details_link": "https://www.metacritic.com/game/xbox-series-x/haven", "publisher": "The Game Bakers", "release_date": "Dec  3 2020", "developers": ["The Game Bakers"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/504e289913410db6c8dcbd673a65ecfd-98.jpg", "descriptions": "Does love truly conquer all? Two lovers gave up everything, left their entire lives behind, and escaped to a lost planet to be together. Play these lovers, Yu and Kay, at the same time as they settle into an unknown and eerie world. Explore the planet searching for parts and material to fixDoes love truly conquer all? Two lovers gave up everything, left their entire lives behind, and escaped to a lost planet to be together. Play these lovers, Yu and Kay, at the same time as they settle into an unknown and eerie world. Explore the planet searching for parts and material to fix their ship and make it a cosy home. Enjoy life together as a relatable couple cooking meals, crafting, collecting resources and engaging in meaningful conversations. Fight against those trying to tear them apart by synchroniSing their actions in combat, finding the perfect timing and rhythm, while controlling both characters simultaneously. Glide through the mysterious landscape, explore a fragmented world and fight against what’s trying to tear them apart in this RPG adventure about love, rebellion, and freedom.… Expand"}, {"name": "Spellbreak", "details_link": "https://www.metacritic.com/game/xbox-one/spellbreak", "publisher": "Proletariat, Inc.", "release_date": "Sep  3 2020", "developers": ["Proletariat", "Inc."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/98c307197cf26b7ab49791ba7abfa3ed-98.jpg", "descriptions": "Spellbreak is an epic fantasy action spellcasting game where players choose a class, weave spectacular spell combinations and fight other players to become an all-powerful battlemage."}, {"name": "Control: The Foundation", "details_link": "https://www.metacritic.com/game/playstation-4/control-the-foundation", "publisher": "505 Games", "release_date": "Mar 26 2020", "developers": ["Remedy Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/1060d94dffad510a710a1d181f50f3f6-98.jpg", "descriptions": "The Foundation Expansion includes new story content and side missions as well as new weapons and mods inspired by the Oldest House's mysterious origins. The Astral Plane is colliding with our reality. Jesse Faden, the Director of the Federal Bureau of Control, must travel through the cavernsThe Foundation Expansion includes new story content and side missions as well as new weapons and mods inspired by the Oldest House's mysterious origins. The Astral Plane is colliding with our reality. Jesse Faden, the Director of the Federal Bureau of Control, must travel through the caverns of the Foundation to prevent the Astral Plane from consuming the Oldest House. The missing Head of Operations, Helen Marshall, may hold some answers to the mysteries surrounding this threat...… Expand"}, {"name": "Green Hell", "details_link": "https://www.metacritic.com/game/pc/green-hell", "publisher": "Creepy Jar", "release_date": "Sep  5 2019", "developers": ["Creepy Jar"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Survival", "First-Person", "Arcade"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/fd2bc0d156e885cfe63a7800cbf95152-98.jpg", "descriptions": "Green Hell is a sweltering struggle for survival in the Amazonian rainforest. Clinging to life, the player is set on a journey of durability as the effects of solitude wear heavy not only on the body but also the mind. How long can you survive against the dangers of the unknown?"}, {"name": "Life is Strange 2: Episode 3 - Wastelands", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-2-episode-3---wastelands", "publisher": "Square Enix", "release_date": "May  9 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 78, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/316c0120ae2a8e1ece4c478f8cff0e6c-98.jpg", "descriptions": "Sean and Daniel Diaz’s journey to Mexico continues in Episode 3, a few months after the events in Episode 2 and the boys’ escape from Beaver Creek. The brothers experience life on the fringes of society, as they befriend a close-knit community of drifters and runaways, and become embroiledSean and Daniel Diaz’s journey to Mexico continues in Episode 3, a few months after the events in Episode 2 and the boys’ escape from Beaver Creek. The brothers experience life on the fringes of society, as they befriend a close-knit community of drifters and runaways, and become embroiled in the illegal cannabis trade among the towering redwood forests of California. Sean and Daniel’s resolve is put to the test once again, as new relationships create friction between them and they both learn much about who they are as individuals. Uncertain about their once united purpose, can they stay together, or will their journey together end here?… Expand"}, {"name": "The Missing: JJ Macfield and the Island of Memories", "details_link": "https://www.metacritic.com/game/pc/the-missing-jj-macfield-and-the-island-of-memories", "publisher": "Arc System Works", "release_date": "Oct 11 2018", "developers": ["White Owls"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 78, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/26f06dc29f23688ce1099b1bee675866-98.jpg", "descriptions": "The blunt disappearance of a close friend encourages J.J. to go look for her on the strange Island of Memories. You can’t die on this nightmare island, even if you’re seriously injured. No matter how many times J.J.’s brought back from the grips of death, she drags her mangled body deeperThe blunt disappearance of a close friend encourages J.J. to go look for her on the strange Island of Memories. You can’t die on this nightmare island, even if you’re seriously injured. No matter how many times J.J.’s brought back from the grips of death, she drags her mangled body deeper into the woods to find her friend.… Expand"}, {"name": "Mothergunship", "details_link": "https://www.metacritic.com/game/playstation-4/mothergunship", "publisher": "Sold Out", "release_date": "Jul 17 2018", "developers": ["Grip Digital"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/32cd44eecb0de08acda359185ca2b6fc-98.jpg", "descriptions": "MOTHERGUNSHIP mixes bullet-hell intensity with the shooting, customization, and traversal of the first-person genre. Fight your way through the alien fleets, facing randomized enemy and level mayhem as you clear rooms and take out some of the biggest bosses seen in the FPS genre."}, {"name": "Human Resource Machine", "details_link": "https://www.metacritic.com/game/pc/human-resource-machine", "publisher": "Tomorrow Corporation", "release_date": "Oct 15 2015", "developers": ["Tomorrow Corporation"], "platforms": ["iPhone/iPad", "Switch", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/41f6b2849416dfd3ef7ddcb2678f8200-98.jpg", "descriptions": "Program little office workers to solve puzzles. Be a good employee! The machines are coming... for your job. From the creators of World of Goo and Little Inferno."}, {"name": "Adventures of Pip", "details_link": "https://www.metacritic.com/game/wii-u/adventures-of-pip", "publisher": "TicToc Games", "release_date": "Jun  4 2015", "developers": ["TicToc Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/a1fa546e3bf72588c6843220d4c763de-98.jpg", "descriptions": "Play as the Ultimate Digital Underdog!\r Adventures of Pip, is an action-platformer with a fresh gameplay twist inside a retro 32-bit world. Alas, Pip is an unlikely 1-pixel hero yet has the unique ability to absorb the pixels of his defeated enemies to evolve into three different forms.Play as the Ultimate Digital Underdog!\r Adventures of Pip, is an action-platformer with a fresh gameplay twist inside a retro 32-bit world. Alas, Pip is an unlikely 1-pixel hero yet has the unique ability to absorb the pixels of his defeated enemies to evolve into three different forms. Players will skillfully switch between these three forms while exploring five worlds on an epic 10-hour campaign to defeat the Skeleton Queen.\r FEATURES:\r-Switch between three different evolution forms to complete each level. Each form has its own advantages and disadvantages.\r-Travel through different lands in search of the Skeleton Queen. Each land has different obstacles that will require you to switch between your forms.\r-Rescue trapped villagers inside the levels. Different villagers can open up new shops in the village Aiding Pip in his quest.\r-Fight unique epic bosses in the world using your different forms. Remember bigger isnt always better.\r-Use your Wii U GamePad controller to access your inventory quickly or to fast travel throughout the land.… Expand"}, {"name": "OlliOlli", "details_link": "https://www.metacritic.com/game/pc/olliolli", "publisher": "Devolver Digital", "release_date": "Jul 22 2014", "developers": ["Tom Hegarty"], "platforms": ["3DS", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skate / Skateboard"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/c4c7bd30100d808676d97fe1282f5014-98.jpg", "descriptions": "OlliOlli mixes one-life gameplay with over 120 tricks and grinds across 50 levels, 250 Challenges, Spots Mode and Daily Grind. Complete all challenges to unlock the super skillful RAD Mode. Rack up the biggest and coolest combos along the way then time your landing to perfection to rule theOlliOlli mixes one-life gameplay with over 120 tricks and grinds across 50 levels, 250 Challenges, Spots Mode and Daily Grind. Complete all challenges to unlock the super skillful RAD Mode. Rack up the biggest and coolest combos along the way then time your landing to perfection to rule the leader-boards. Just don’t slam on your face (you will slam on your face). OlliOlli rewards the most skillful and riskiest players, always tempting them to go for that for that audacious 360 backside flip and ludicrous chain of combos leaving them to time their landing to perfection - or risk losing their score.… Expand"}]