[{"name": "Guitar Hero Live", "details_link": "https://www.metacritic.com/game/playstation-4/guitar-hero-live", "publisher": "Activision", "release_date": "Oct 20 2015", "developers": ["FreeStyleGames"], "platforms": ["iPhone/iPad", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "Rhythm", "Music"], "meta_score": 80, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/87f8adbc2810e4e787b8f1fe1392b323-98.jpg", "descriptions": "Guitar Hero Live mode inserts you onstage, looking out: you get a first-person perspective as a real crowd reacts to the notes you play. Or switch over to GHTV - a playable music video network, where you can play along in real time, discover new music, and challenge friends around the world."}, {"name": "Tom Clancy's The Division", "details_link": "https://www.metacritic.com/game/xbox-one/tom-clancys-the-division", "publisher": "Ubisoft", "release_date": "Mar  8 2016", "developers": ["Massive Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Shooter", "Modern", "Modern", "Action", "Shooter", "Third-Person", "Tactical", "Arcade"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/76618fdef62c095bcc3166363f3c478e-98.jpg", "descriptions": "Tom Clancy's The Division has players assume the role of Division agents where they find themselves caught up in an epic conspiracy, forced to combat not only the effects of a man-made virus, but also the rising threat of those behind it."}, {"name": "Proteus", "details_link": "https://www.metacritic.com/game/pc/proteus", "publisher": "Twisted Tree", "release_date": "Jan 30 2013", "developers": ["Ed Key and David Kanaga"], "platforms": ["PlayStation 3", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "First-Person", "Fantasy"], "meta_score": 80, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/666969b706c4eba6bf00c131eb933301-98.jpg", "descriptions": "Proteus is a minimalist game of pure exploration and sublime discovery in a musical wilderness environment. There are no challenges and no goals other than those set by the player. A reactive audio mixing system allows the player to explore the environment as music."}, {"name": "Hot Shots Tennis: Get a Grip", "details_link": "https://www.metacritic.com/game/psp/hot-shots-tennis-get-a-grip", "publisher": "SCEA", "release_date": "Jun 28 2010", "developers": ["Clap Hanz"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/9d9897fc709fef9514936e5510fad15f-98.jpg", "descriptions": "Choose from several game modes including the all-new Story Mode, which puts you on a journey to travel the world and help spread the love of tennis. You’ll travel to exciting locations to challenge a variety of characters and inspire former tennis greats to rally around the sport and helpChoose from several game modes including the all-new Story Mode, which puts you on a journey to travel the world and help spread the love of tennis. You’ll travel to exciting locations to challenge a variety of characters and inspire former tennis greats to rally around the sport and help you. Interact with other characters to gain knowledge and special items, and even unlock new characters to play with. [SCEA]… Expand"}, {"name": "Heave Ho", "details_link": "https://www.metacritic.com/game/switch/heave-ho", "publisher": "Devolver Digital", "release_date": "Aug 29 2019", "developers": ["Le Cartel Studio"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "General", "Party / Minigame"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/610f2aa40d7bb7509f1fdf1e4789c30a-98.jpg", "descriptions": "Heave Ho tasks up to four players with a simple goal – don’t fall to your death! Players will use their own two hands and the outstretched grip of their friends to grapple across each level on their way to victory. Grab one another’s hands, climb across dangling bodies, and swing your palsHeave Ho tasks up to four players with a simple goal – don’t fall to your death! Players will use their own two hands and the outstretched grip of their friends to grapple across each level on their way to victory. Grab one another’s hands, climb across dangling bodies, and swing your pals to safety in a wobbly, dangly mass of limbs. Customize your character with all manner of stylish accessories and zany accouterment in a vain attempt to remember who you are and which of your hands is the only thing between you and the plummet of doom.… Expand"}, {"name": "Armello", "details_link": "https://www.metacritic.com/game/switch/armello", "publisher": "League of Geeks", "release_date": "Sep 27 2018", "developers": ["League of Geeks"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/8898454b78ed54b4379845e6417ca2a9-98.jpg", "descriptions": "Armello is a swashbuckling adventure that combines RPG elements with the strategic play of card and board games, creating a personal, story-fuelled experience."}, {"name": "Life is Strange: Before the Storm - Episode 1: Awake", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-before-the-storm---episode-1-awake", "publisher": "Square Enix", "release_date": "Aug 31 2017", "developers": ["Deck Nine Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/180a1b1517a41aad4a9a671b728954fc-98.jpg", "descriptions": "Life is Strange: Before the Storm is a new three part standalone story adventure set three years before the events of the first game. This time play as Chloe Price, a rebel who forms an unlikely friendship with Rachel Amber in a dramatic new story in the BAFTA award winning franchise."}, {"name": "Candle", "details_link": "https://www.metacritic.com/game/pc/candle", "publisher": "Daedalic Entertainment", "release_date": "Nov 11 2016", "developers": ["Teku Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/a9e14f8126bc0813c037dd506e5f7f8e-98.jpg", "descriptions": "Candle is a 2D sidescrolling adventure game that uses the powerful and indie-lover engine Unity 4. Its creators describe it as a \"dynamic graphic adventure\", since its gameplay combines both Platformer and Graphic Adventure genres. The player takes control of Teku, a young andCandle is a 2D sidescrolling adventure game that uses the powerful and indie-lover engine Unity 4. Its creators describe it as a \"dynamic graphic adventure\", since its gameplay combines both Platformer and Graphic Adventure genres. The player takes control of Teku, a young and inexperienced character in his journey to save his friends and unravel the mysteries of his world.… Expand"}, {"name": "Hitman: Contracts", "details_link": "https://www.metacritic.com/game/playstation-2/hitman-contracts", "publisher": "Eidos Interactive", "release_date": "Apr 20 2004", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/844ad290473f37c3d923284a3a02dd9c-98.jpg", "descriptions": "Hitman: Contracts takes you into the mind of Agent 47, the most ruthlessly efficient contract killer in history. The game begins in Paris as Agent 47 finds himself wounded and trapped in what is a dangerous situation, even for him. Hitman: Contracts explores the dark psychology of killingHitman: Contracts takes you into the mind of Agent 47, the most ruthlessly efficient contract killer in history. The game begins in Paris as Agent 47 finds himself wounded and trapped in what is a dangerous situation, even for him. Hitman: Contracts explores the dark psychology of killing for a living and promises to be the darkest, most disturbing episode in the series. [Eidos Interactive]… Expand"}, {"name": "Medal of Honor Infiltrator", "details_link": "https://www.metacritic.com/game/game-boy-advance/medal-of-honor-infiltrator", "publisher": "EA Games", "release_date": "Nov 17 2003", "developers": ["Netherock Ltd."], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Historic"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/a714086c13803c48bb7dd1473fb8b2b9-98.jpg", "descriptions": "Medal of Honor Infiltrator puts you in the role of Corporal Jake Murphy, a man who must complete five daring missions to defeat the Axis powers in WWII. From sabotaging enemy resources to capturing key personnel to all-out firefights, you'll need to master a variety of gameplay styles toMedal of Honor Infiltrator puts you in the role of Corporal Jake Murphy, a man who must complete five daring missions to defeat the Axis powers in WWII. From sabotaging enemy resources to capturing key personnel to all-out firefights, you'll need to master a variety of gameplay styles to overcome the enemy. On foot, in a tank, or even in disguise, you must engage opponents on the battlefield with an assortment of WWII-era weapons, including machine guns, grenades, bazookas, and more.… Expand"}, {"name": "Rock 'N Roll Racing", "details_link": "https://www.metacritic.com/game/game-boy-advance/rock-n-roll-racing", "publisher": "Blizzard Classic Arcade", "release_date": "Jun 23 2003", "developers": ["Mass Media"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/9cf5b105d9d456c3d855ab5104ab6beb-98.jpg", "descriptions": "With music and engines scream'n, you pick your car, driver, and weapons--then slam it into gear. Annihilate the competition with laser cannons and cluster bombs as you pit yourself against other lead-footed crazies bent on ruining your day."}, {"name": "Pro Race Driver", "details_link": "https://www.metacritic.com/game/xbox/pro-race-driver", "publisher": "Codemasters", "release_date": "Apr 16 2003", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/6503de534453b12649574862d31fd463-98.jpg", "descriptions": "Pro Race Driver immerses you in the heart of a global racing championship.  The game retains the series' core values of close-contact racing with real cars, real teams, real track, real drivers, and an astounding damage engine while introducing a character- based narrative and episodicPro Race Driver immerses you in the heart of a global racing championship.  The game retains the series' core values of close-contact racing with real cars, real teams, real track, real drivers, and an astounding damage engine while introducing a character- based narrative and episodic storyline.  Choose from a fictional cast of racers and 42 licensed touring and racing cars to compete in real-world global championships.  Get ready for a true-to-life driving and performance experience.… Expand"}, {"name": "James Bond 007: NightFire", "details_link": "https://www.metacritic.com/game/gamecube/james-bond-007-nightfire", "publisher": "Electronic Arts", "release_date": "Nov 18 2002", "developers": ["Eurocom Entertainment Software"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/c934e375c39b1364cd480ebeed807cc4-98.jpg", "descriptions": "The ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire.  Explore new heights and depths like never before--infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through theThe ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire.  Explore new heights and depths like never before--infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through the streets of Tokyo.  New state-of-the-art upgradeable gadgets and weapons and original missions--including zero-gravity assignments--will leave you shaken and stirred.  … Expand"}, {"name": "Robin Hood: The Legend of Sherwood", "details_link": "https://www.metacritic.com/game/pc/robin-hood-the-legend-of-sherwood", "publisher": "Strategy First", "release_date": "Nov 14 2002", "developers": ["Spellbound"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/7875578e0611b40b4d90838947b86bf9-98.jpg", "descriptions": "Roam the dense foliage of Sherwood Forest and come face to face with royal trouble as you fight for the common man in Robin Hood: The Legend of Sherwood. Take on the role of the legendary nobleman, Robin Hood, and join forces with Little John and his Merrymen as the battle for control of theRoam the dense foliage of Sherwood Forest and come face to face with royal trouble as you fight for the common man in Robin Hood: The Legend of Sherwood. Take on the role of the legendary nobleman, Robin Hood, and join forces with Little John and his Merrymen as the battle for control of the King's throne ensues. A fascinating universe with strong-willed, powerful characters, Robin Hood: The Legend of Sherwood, takes you on a voyage through medieval Sherwood with a fistful of arrows and a heart full of courage. [Strategy First]… Expand"}, {"name": "Kelly Slater's Pro Surfer", "details_link": "https://www.metacritic.com/game/gamecube/kelly-slaters-pro-surfer", "publisher": "Activision", "release_date": "Sep 16 2002", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Surfing"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/c261d3f4d3f233de1ccce570ad5ed2e8-98.jpg", "descriptions": "Experience the rush of big-wave surfing and the surfer lifestyle as you search the globe for the world's best breaks. In Kelly Slater's Pro Surfer, you'll play Kelly Slater, or one of eight other surfers, in exotic locations with more than 30 challenging levels to explore. Drop down hugeExperience the rush of big-wave surfing and the surfer lifestyle as you search the globe for the world's best breaks. In Kelly Slater's Pro Surfer, you'll play Kelly Slater, or one of eight other surfers, in exotic locations with more than 30 challenging levels to explore. Drop down huge waves, ride barreling tubes, and pull off exciting trick combinations and signature pro moves. The game features multiple gameplay modes, including a Surf Trip where you choose your own path in search of the perfect wave. … Expand"}, {"name": "Soldier of Fortune II: Double Helix", "details_link": "https://www.metacritic.com/game/pc/soldier-of-fortune-ii-double-helix", "publisher": "Activision", "release_date": "May 20 2002", "developers": ["Raven Software"], "platforms": "PC", "num_players": "1-64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/78e0d5c14f02439ad162c2f2d65cd33c-98.jpg", "descriptions": "Double Helix plunges the players into the secret and deadly world of the modern day mercenary as they race around the globe to stop a bio-terrorist organization. New features include enhanced version of the Quake III Arena game engine for explosive special effects and fast action gameplayDouble Helix plunges the players into the secret and deadly world of the modern day mercenary as they race around the globe to stop a bio-terrorist organization. New features include enhanced version of the Quake III Arena game engine for explosive special effects and fast action gameplay and even deadlier AI than the original. [Activision]… Expand"}, {"name": "World Rally Championship", "details_link": "https://www.metacritic.com/game/playstation-2/world-rally-championship", "publisher": "Bam Entertainment", "release_date": "Mar 21 2002", "developers": ["Evolution Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/bf9094ce92e9041261032e9c0d561b38-98.jpg", "descriptions": "The only officially licensed game of the World Rally Championship, WRC brings you all the authentic action and excitement of the rally circuit, as you race over 100 tracks in some truly massive racing locations. The unique 'go anywhere' engine means that the road is no longer the only routeThe only officially licensed game of the World Rally Championship, WRC brings you all the authentic action and excitement of the rally circuit, as you race over 100 tracks in some truly massive racing locations. The unique 'go anywhere' engine means that the road is no longer the only route to the chequered flag, so you'd better be careful on those mountaintop bends. [Sony Europe]… Expand"}, {"name": "Baseball Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/baseball-advance", "publisher": "THQ", "release_date": "Mar 20 2002", "developers": ["Smilebit"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/2c85afd4621c279066eca0502b2f692e-98.jpg", "descriptions": "Grab you bat and ball and get ready to hit a few homers! Whether you take your favorite MLB team through a full season or compete in the All-Star Game, you'll be throwing curve balls and fielding pop flies ar major league ballparks across the country. So batter up and play ball!"}, {"name": "Max Payne", "details_link": "https://www.metacritic.com/game/playstation-2/max-payne", "publisher": "Rockstar Games", "release_date": "Dec  6 2001", "developers": ["Rockstar Toronto"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/6a51af1deca5246120b3ff65894d0be2-98.jpg", "descriptions": "Max Payne is a man with nothing to lose in the violent, cold urban night. A fugitive undercover cop framed for murder, and now hunted by cops and the mob. A man with his back against the wall, fighting a battle he cannot hope to win.  Prepare for pain with this much-anticipated 3rd-personMax Payne is a man with nothing to lose in the violent, cold urban night. A fugitive undercover cop framed for murder, and now hunted by cops and the mob. A man with his back against the wall, fighting a battle he cannot hope to win.  Prepare for pain with this much-anticipated 3rd-person shooter. [Rockstar Games]… Expand"}, {"name": "Oddworld: Munch's Oddysee", "details_link": "https://www.metacritic.com/game/xbox/oddworld-munchs-oddysee", "publisher": "Microsoft Game Studios", "release_date": "Nov  6 2001", "developers": ["Oddworld Inhabitants"], "platforms": ["iPhone/iPad", "PC", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/921fe0b0fcabb07983145439961072db-98.jpg", "descriptions": "Munch, the Gabbit with \"odditude,\" and his sidekick Abe lead an off-beat revolution to save the world.  With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control theMunch, the Gabbit with \"odditude,\" and his sidekick Abe lead an off-beat revolution to save the world.  With their sacred land in jeopardy of being destroyed by the greedy Glukkons, Munch and Abe team up to teach those rascals a lesson by using their chanting prowess to control the enemy, arming themselves with wacky weapons, and acquiring power-ups for extra boosts.  You can switch between Munch and Abe at anytime to utilize each character's unique abilities and access certain areas.… Expand"}, {"name": "RollerCoaster Tycoon: Loopy Landscapes", "details_link": "https://www.metacritic.com/game/pc/rollercoaster-tycoon-loopy-landscapes", "publisher": "Atari", "release_date": "Sep 30 2000", "developers": ["Chris Sawyer"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Business / Tycoon"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/4/0dc0dbf13402f49dab22c1f923406e81-98.jpg", "descriptions": "From Rocket Ships and Medieval Castles to Winter Wonderlands and new environments, you now have a complete working palette to create your next thrill-a-minute masterpiece. Build on new landscapes, provide more shops and stalls or take on one of 30 new scenarios filled with new excitingFrom Rocket Ships and Medieval Castles to Winter Wonderlands and new environments, you now have a complete working palette to create your next thrill-a-minute masterpiece. Build on new landscapes, provide more shops and stalls or take on one of 30 new scenarios filled with new exciting challenges. This expansion two pack also includes Corkscrew Follies. NOTE: This is an add-on pack and requires a copy of the main RollerCoaster Tycoon game to play. [Hasbro Interactive]… Expand"}, {"name": "Madden NFL 15", "details_link": "https://www.metacritic.com/game/xbox-one/madden-nfl-15", "publisher": "Electronic Arts", "release_date": "Aug 26 2014", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/38427dce6c20d0446fc418bf73d6817c-98.jpg", "descriptions": "New broadcast and NFL Films-inspired presentation shows the game in a different light. Evolved player and coach models make personalities appear more realistic, and additional camera angles and player celebrations capture the most kinetic moments of football. Also on board is a new studioNew broadcast and NFL Films-inspired presentation shows the game in a different light. Evolved player and coach models make personalities appear more realistic, and additional camera angles and player celebrations capture the most kinetic moments of football. Also on board is a new studio halftime show with dynamic highlights, analysis and recaps of the first half that tell the story of the game.… Expand"}, {"name": "Ys: The Oath in Felghana", "details_link": "https://www.metacritic.com/game/psp/ys-the-oath-in-felghana", "publisher": "XSEED Games", "release_date": "Nov  1 2010", "developers": ["Falcom"], "platforms": ["PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/11e2d83ffb3a8d3670d6e4441f553334-98.jpg", "descriptions": "Ys: The Oath in Felghana is a remake third game from the Ys series, Ys III: Wanderers From Ys."}, {"name": "Dicey Dungeons", "details_link": "https://www.metacritic.com/game/pc/dicey-dungeons", "publisher": "Terry Cavanagh", "release_date": "Aug 13 2019", "developers": ["Terry Cavanagh"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/5a27f4c3600f5cc3d80ebd82c86e18d9-98.jpg", "descriptions": "Become a giant walking dice and battle to the end of an ever-changing dungeon! Can you escape the cruel whims of Lady Luck? In this new fast-paced deckbuilding roguelike from Terry Cavanagh (Super Hexagon, VVVVVV), Chipzel, and Marlowe Dobbe, you'll fight monsters, find better loot, andBecome a giant walking dice and battle to the end of an ever-changing dungeon! Can you escape the cruel whims of Lady Luck? In this new fast-paced deckbuilding roguelike from Terry Cavanagh (Super Hexagon, VVVVVV), Chipzel, and Marlowe Dobbe, you'll fight monsters, find better loot, and level up your heroes as you work together to take down the Goddess of Fortune, Lady Luck herself. Balance your carefully planned strategies against the unknown of a dice roll.… Expand"}, {"name": "1979 Revolution: Black Friday", "details_link": "https://www.metacritic.com/game/pc/1979-revolution-black-friday", "publisher": "iNK Stories", "release_date": "Apr  4 2016", "developers": ["N-Fusion Interactive Entertainment Corp.", "iNK Stories"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/3d072dd3c61a4406e98d8e28458d3b78-98.jpg", "descriptions": "1979 Revolution: Black Friday is choice driven, narrative game that brings players into the brooding world of a nation on the verge of collapse. Play as Reza, an aspiring photojournalist, and make life and death decisions as you survive the gritty streets of Iran in the late 1970’s."}, {"name": "Space Invaders Infinity Gene", "details_link": "https://www.metacritic.com/game/xbox-360/space-invaders-infinity-gene", "publisher": "Square Enix", "release_date": "Sep 15 2010", "developers": ["Taito Corporation"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/f41a9b70202cc649915a103b4da949aa-98.jpg", "descriptions": "The game starts off looking like the classic Space Invaders, but as you play through the game, it evolves. Unlock new stages, new power ups, and new features. In addition to Normal Mode, Challenge Mode pits you against 99 randomly-created stages. And Music Mode generates custom stages basedThe game starts off looking like the classic Space Invaders, but as you play through the game, it evolves. Unlock new stages, new power ups, and new features. In addition to Normal Mode, Challenge Mode pits you against 99 randomly-created stages. And Music Mode generates custom stages based on music stored on your console. The Invaders are back, and they're watching you. The more you play, the more the game evolves!… Expand"}, {"name": "Toki Tori", "details_link": "https://www.metacritic.com/game/pc/toki-tori", "publisher": "Two Tribes", "release_date": "Jan 28 2010", "developers": ["Two Tribes"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3", "Switch", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/932165f2180ef99e71ba53c9bc0e4de3-98.jpg", "descriptions": "The gameplay in Toki Tori is a blend of two genres. While it looks like a platform game, it's a puzzle game at heart. To progress through the game, the player must pick up each egg in a level using a set number of tools. Players will have to look and plan ahead carefully while using itemsThe gameplay in Toki Tori is a blend of two genres. While it looks like a platform game, it's a puzzle game at heart. To progress through the game, the player must pick up each egg in a level using a set number of tools. Players will have to look and plan ahead carefully while using items such as the Telewarp, Freeze-o-Matic and InstantRock. Additional tools are gradually introduced as the player progresses through the game's 80+ levels covering four unique worlds. [Steam]… Expand"}, {"name": "UEFA EURO 2008", "details_link": "https://www.metacritic.com/game/xbox-360/uefa-euro-2008", "publisher": "Electronic Arts", "release_date": "May 19 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/eb3903d2dd0e16d89f3f13f52e69273c-98.jpg", "descriptions": "UEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penaltyUEFA EURO 2008 captures the look and feel of the journey from qualification to the finals with rain and mud dynamics that impact playing conditions, real-time player ratings that change based on player performance, and a penalty kick mode that re-creates the elation and agony of a penalty shoot-out as if you were on the pitch. Experience the thrill of scoring the goal that sends your country through to the next round and then choose how to celebrate it with all-new interactive user-controlled celebrations. Captain your country, play alongside your heroes, and inspire them to championship glory in the official videogame of UEFA EURO 2008. A new game mode called Captain Your Country enables gamers to customize them on the pitch and wear the shirt of their national team. Work through eight status levels to earn the captaincy of your team and then lead your country into battle for championship glory against your rivals. Go online in Battle of the Nations to earn status points for yourself and your country in a competition for global supremacy. Go for the biggest upsets to earn the most points and then watch you and your country move up the leader boards. Face the challenge and pressure of competing in the championship rounds in the EURO Online Knockout Draw to test your skills against the world's best. [Electronic Arts]… Expand"}, {"name": "Beaterator", "details_link": "https://www.metacritic.com/game/psp/beaterator", "publisher": "Rockstar Games", "release_date": "Sep 29 2009", "developers": ["Rockstar Leeds"], "platforms": ["iPhone/iPad", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Music Maker", "Music Maker", "Application"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/5ca9ae383ba11dc6515cd5ead87b9b41-98.jpg", "descriptions": "Beaterator for the PSP system is both a powerful music mixer with robust beatmaking features, as well as a collection of original music and rhythm games and challenge modes - all available in the palm of your hand. [Rockstar]"}, {"name": "Ys Seven", "details_link": "https://www.metacritic.com/game/pc/ys-seven", "publisher": "XSEED Games", "release_date": "Aug 30 2017", "developers": ["Falcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/323e8d156523422e1fff0b546b6315ef-98.jpg", "descriptions": "Experience the first “modern-era” Ys game, now off the small screen for its worldwide PC debut. Features a full party system, dozens of unique combat skills, and a massive overworld to explore. Uncover the secret of the Five Great Dragons, and help Adol Christin save the day once again."}, {"name": "Lunar: Silver Star Harmony", "details_link": "https://www.metacritic.com/game/psp/lunar-silver-star-harmony", "publisher": "XSEED Games", "release_date": "Mar  2 2010", "developers": ["Game Arts"], "platforms": "PSP", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/c27142f5db3e938b31c0235f85ffb80d-98.jpg", "descriptions": "The Lunar series gets reborn on the PSP as Lunar: Silver Star Harmony with all new graphics, added gameplay features, and a re-mastered soundtrack."}, {"name": "Atelier Rorona Plus: The Alchemist of Arland", "details_link": "https://www.metacritic.com/game/playstation-3/atelier-rorona-plus-the-alchemist-of-arland", "publisher": "Tecmo Koei America Corp.", "release_date": "Jun 24 2014", "developers": ["Gust"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/dcf875e70b4a91211ecc7e82b9a15cfb-98.jpg", "descriptions": "The alchemic RPG franchise from Gust carries on the tradition of the Atelier series, using alchemy as the main focal point. Atelier Rorona Plus focuses on the exploits of Rorolina Frixell, one the most beloved characters of the Arland trilogy (Ateliers Meruru/ Totori/ Rorona), a young girlThe alchemic RPG franchise from Gust carries on the tradition of the Atelier series, using alchemy as the main focal point. Atelier Rorona Plus focuses on the exploits of Rorolina Frixell, one the most beloved characters of the Arland trilogy (Ateliers Meruru/ Totori/ Rorona), a young girl who is assigned to complete alchemy tasks over 3 years in order to keep her alchemy workshop and not be banished from the kingdom of Arland. Players can craft new items and also battle enemies using the power of alchemy. As all games in the Atelier series, this title is set against an anime-like background with 3D graphics and is characterized by an elaborate crafting and synthesis system. … Expand"}, {"name": "Alan Wake: The Writer", "details_link": "https://www.metacritic.com/game/xbox-360/alan-wake-the-writer", "publisher": "Microsoft Game Studios", "release_date": "Oct 12 2010", "developers": ["Remedy Entertainment"], "platforms": "Xbox 360", "genres": ["Action Adventure", "Modern", "Horror", "Survival"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/32ae7de8cc1c7846d56971192eec993b-98.jpg", "descriptions": "In â€œThe Writer,â€\u009d the second Game Add-on for the highly acclaimed Xbox 360 exclusive â€œAlan Wake,â€\u009d Wake fights for his life in an increasingly surreal and treacherous world where nightmares are reality, and the greatest danger comes from within. His only hope of survival is â€œTheIn â€œThe Writer,â€\u009d the second Game Add-on for the highly acclaimed Xbox 360 exclusive â€œAlan Wake,â€\u009d Wake fights for his life in an increasingly surreal and treacherous world where nightmares are reality, and the greatest danger comes from within. His only hope of survival is â€œThe Writer.â€\u009d… Expand"}, {"name": "RoboBlitz", "details_link": "https://www.metacritic.com/game/pc/roboblitz", "publisher": "Naked Sky Entertainment", "release_date": "Nov  7 2006", "developers": ["Naked Sky Entertainment"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/dcdf0dcc5a012129aac6c040f3836fb5-98.jpg", "descriptions": "RoboBlitz is a humorous, physics-driven action game full of inventive gizmos, weapons, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates. Set in seven distinctRoboBlitz is a humorous, physics-driven action game full of inventive gizmos, weapons, and environments. Players take on the role of Blitz, a multi-talented robot who must activate an aging Space Cannon to save his world from a band of maladjusted space pirates. Set in seven distinct environments, RoboBlitz features 19 levels of puzzle-solving and high-intensity action. [Naked Sky Entertainment]… Expand"}, {"name": "Lazy Raiders", "details_link": "https://www.metacritic.com/game/xbox-360/lazy-raiders", "publisher": "Sarbakan Inc.", "release_date": "Feb 24 2010", "developers": ["Sarbakan Inc."], "platforms": ["iPhone/iPad", "Xbox 360"], "genres": ["Action", "General", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/92b15ee4b3685c131e1b88f82acb9487-98.jpg", "descriptions": "[Xbox Live Arcade]  Dr. Diggabone's getting too old for archaeological digs, or so he says. Truth be told, he's just plain lazy... That's where you jump into Lazy Raiders and take control as you spin and flip mazes to send the Doctor or your Avatar on a gravity-defying quest for lost relics[Xbox Live Arcade]  Dr. Diggabone's getting too old for archaeological digs, or so he says. Truth be told, he's just plain lazy... That's where you jump into Lazy Raiders and take control as you spin and flip mazes to send the Doctor or your Avatar on a gravity-defying quest for lost relics that would bring him instant fortune and glory. Of course you'll have to deal with greedy thieves, pesky minions, and ingenious traps along the way. If there weren't any challenges, you'd just grow lazy ... and we wouldn't want that, would we? [Sarbakan]… Expand"}, {"name": "The Bigs 2", "details_link": "https://www.metacritic.com/game/playstation-3/the-bigs-2", "publisher": "2K Sports", "release_date": "Jul  7 2009", "developers": ["Blue Castle Games"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Arcade", "Arcade"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/0f42d68c165bd5d3c122d8e12c66194a-98.jpg", "descriptions": "The Big Leagues just got BIGGER! Available on all major video game consoles, The BIGS 2 allows fans to experience heroic gameplay, legendary game modes and incredible player models. Elevating The BIGS 2 to new heights are bigger power-ups, amazing visual effects, and an all new career mode.The Big Leagues just got BIGGER! Available on all major video game consoles, The BIGS 2 allows fans to experience heroic gameplay, legendary game modes and incredible player models. Elevating The BIGS 2 to new heights are bigger power-ups, amazing visual effects, and an all new career mode. Featuring exciting player animations and pick-up-and-play controls, The BIGS 2 delivers an action-packed, heroic MLB video game experience. Become A Legend Mode: New & improved story mode, picking up at the end of the \"Rookie Challenge\" mode from The BIGS. Create a player and progress your career from a Mexican league to the Majors and, eventually, the Hall of Fame. Along the way, compete in boss battles against MLB legends. Season Mode: As requested by fans, enjoy a new Season Mode featuring full MLB schedules, stat tracking and roster management. Improved Gameplay: Bigger and better arcade baseball action, featuring Legendary Moves, Batter’s Wheelhouse & a more powerful Big Slam. Home Run Pinball: Enjoy exciting single player or co-op action in Times Square or three new environments. Mini-Games: Test your hitting, fielding, running and throwing skills against MLB stars in several all-new mini-games. [2K Sports]… Expand"}, {"name": "The Pale Beyond", "details_link": "https://www.metacritic.com/game/pc/the-pale-beyond", "publisher": "Fellow Traveller", "release_date": "Feb 24 2023", "developers": ["Bellular Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/e40b1bd939902cb4c49504f0fee411e0-98.jpg", "descriptions": "Five years ago, The Viscount and its crew set sail through The Pale Passage in search of absolute magnetic South. The ship and its crew were tragically lost to the ice, never to be seen again. Her sister ship, The Temperance shall follow in her path, hoping to find answers where The ViscountFive years ago, The Viscount and its crew set sail through The Pale Passage in search of absolute magnetic South. The ship and its crew were tragically lost to the ice, never to be seen again. Her sister ship, The Temperance shall follow in her path, hoping to find answers where The Viscount failed.You didn't ask to lead this expedition, but here you are. Stuck in the ice, Captain missing, miles from civilisation. Someone has to take charge.Manage your meagre resources, balance safety and morale, make the hard calls, and head in the only direction you can - through The Pale Beyond.… Expand"}, {"name": "Them's Fightin' Herds", "details_link": "https://www.metacritic.com/game/xbox-series-x/thems-fightin-herds", "publisher": "Maximum Games", "release_date": "Oct 18 2022", "developers": ["Mane6", "Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/75e2659b266939b0dc36d81442118796-98.jpg", "descriptions": "Overview:Them's Fightin' Herds is an indie fighting game featuring a cast of adorable animals designed by acclaimed cartoon producer Lauren Faust. Beneath the cute and cuddly surface, a mechanically-deep GGPO-powered fighter awaits!\nCombat Features:\n\n* 4-Button Fighting - A (Light), BOverview:Them's Fightin' Herds is an indie fighting game featuring a cast of adorable animals designed by acclaimed cartoon producer Lauren Faust. Beneath the cute and cuddly surface, a mechanically-deep GGPO-powered fighter awaits!Combat Features:* 4-Button Fighting - A (Light), B (Medium), C (Heavy), D (Magic).* Magic System - Emphasize your character's special abilities through a dedicated button and a unique resource.* Enhanced Super Attack - Spend an additional bar of meter during your super for a bonus utility effect.* Juggle Decay - An infinite-prevention system that manages combo length without imposing hard limits.* Dynamic Music System - Rockin' character themes adapt in the heat of the battle to make every fight feel like a clash of champions.* GGPO Netcode - Battle across the globe with little to no input delay.Game Modes:* Local Versus and Online Matchmaking - Play at home or fight worthy opponents on-demand.* Tutorial and Training Modes - Learn the ropes with guided tutorials, or practice on your own with a fully-featured, data-rich training room.* Combo and Target Challenges - Test your skills in character-specific sets of combo trials and target-smashing obstacle courses.* Pixel Lobby - An online visual lobby system that sets players free to interact and explore in a top-down overworld with nostalgic style. Customize your avatar with cosmetic items collected through various single-player and multiplayer modes.* Salt Mines - A unique melding of fighting game and dungeon crawl that pits Pixel Lobby players against waves of predators and each other in a contest of glory... and hats!* Story Mode (currently in development) - An episodic adventure where players travel with each champion in their quest to recover a magical key that will save the world of Fnum from vicious predators. Chapter 1 will be available with the release of version 1.0. Subsequent chapters will be added in the months following, free of charge.… Expand"}, {"name": "Scarlet Nexus", "details_link": "https://www.metacritic.com/game/playstation-5/scarlet-nexus", "publisher": "Bandai Namco Games", "release_date": "Jun 25 2021", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/783889ecd8d5d513cf87b3325fc5012f-98.jpg", "descriptions": "Unleash the Power of the Mind - In a far distant future, a psionic hormone was discovered in the human brain, granting people extra-sensory powersand changing the world as we know it. Just as humanity was entering this new era, deranged mutants known as Others began to descend from the skyUnleash the Power of the Mind - In a far distant future, a psionic hormone was discovered in the human brain, granting people extra-sensory powersand changing the world as we know it. Just as humanity was entering this new era, deranged mutants known as Others began to descend from the sky with a thirst for human brains. Highly resistant to conventional attack methods, extreme measures needed to be taken to battle the overwhelming threat and preserve humanity. Those with acute extra-sensory abilities, known as psionics, were our chance to fight the onslaught from above. To this day, psionics have been scouted for their talents and recruited to the Other Suppression Force (OSF), humanity's last line of defense.\r Take on the role of Yuito Sumeragi, a new recruit to the OSF aiming to become an elite psionic like the one who saved him as a child. Armed with a talent in psycho-kinesis, explore the futuristic city of New Himuka and uncover the mysteries of a Brain Punk future caught between technology and psychic abilities in SCARLET NEXUS. \r\rKINETIC PSYCHIC COMBAT\rUsing psycho-kinetic abilities, the world around you becomes your greatest weapon. Lift, break and throw pieces of your environment to build your attack combos and lay waste to your enemies. \r\rEXTERMINATE THE OTHERS\rDeranged mutants that descended from the sky, immune to conventional weapons and defenses. Tormented by the constant pain of their mutation, they seek brains of living organisms to calm their madness. \r\rDISCOVER A BRAIN PUNK FUTURE\rExplore and protect a futuristic Japanese landscape that combines inspirations from classic anime and western science fiction. \r\rDEEP STORY DRIVEN EXPERIENCE\rDive into a complex story of bonds, courage and heroism crafted by minds behind the iconic Tales of Vesperia.… Expand"}, {"name": "NieR Replicant ver.1.22474487139...", "details_link": "https://www.metacritic.com/game/pc/nier-replicant-ver122474487139", "publisher": "Square Enix", "release_date": "Apr 23 2021", "developers": ["Toylogic Inc.", "Toylogic"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/f9d1dc860340563fe482b2d029081a60-98.jpg", "descriptions": "Get ready to experience where the NieR series all began - NieR Replicant ver.1.22474487139...Set in a post-apocalyptic world, NieR Replicant ver.1.22474487139 is puts you in the role of the titular Nier, a young man on a quest to cure his sister Yonah of a deadly disease. What they discoverGet ready to experience where the NieR series all began - NieR Replicant ver.1.22474487139...Set in a post-apocalyptic world, NieR Replicant ver.1.22474487139 is puts you in the role of the titular Nier, a young man on a quest to cure his sister Yonah of a deadly disease. What they discover will make them question everything they thought they knew The original NieR release has an interesting history. In Japan, there were two versions of the game: NieR Replicant and NieR Gestalt. NieR Replicant focused on Brother Nier and his sister Yonah. In NieR Gestalt, the main character was Father Nier, and Yonah his daughter. Only NieR Gestalt released in the West (under the name NIER) - so excitingly, this will be the first time many people will have played the Replicant version of the game.… Expand"}, {"name": "WRC 9 FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/pc/wrc-9-fia-world-rally-championship", "publisher": "Nacon", "release_date": "Sep  3 2020", "developers": ["KT Racing"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 80, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/d507c9f9e7d9cf41196822eaf9ed0524-98.jpg", "descriptions": "The WRC license is back and even better this year with WRC 9. Take part in the Calendar's 3 new rallies and challenge the community with the customisable league system. Then dive into the skin of a co-driver with the astonishing co-op mode."}, {"name": "Superliminal", "details_link": "https://www.metacritic.com/game/xbox-one/superliminal", "publisher": "Pillow Castle Games", "release_date": "Jul  7 2020", "developers": ["Pillow Castle Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 80, "users_score": 9.6, "image": "https://static.metacritic.com/images/products/games/9/78a511d24ef7419527898bba988583ef-98.jpg", "descriptions": "Perception is reality. In this mind-bending first-person puzzler, you explore a surreal dream world and solve impossible puzzles using the ambiguity of depth and perspective."}, {"name": "Life is Strange 2: Episode 1 - Roads", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-2-episode-1---roads", "publisher": "Square Enix", "release_date": "Sep 27 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 80, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/cd48c4de6bbe7534bc5a42670eb7947d-98.jpg", "descriptions": "Two brothers Sean and Daniel Diaz are forced to run away from home after a tragic incident. In fear of the police, Sean & Daniel head to Mexico while attempting to conceal a sudden and mysterious supernatural power. Now totally responsible for his much younger brother, Sean begins to realizeTwo brothers Sean and Daniel Diaz are forced to run away from home after a tragic incident. In fear of the police, Sean & Daniel head to Mexico while attempting to conceal a sudden and mysterious supernatural power. Now totally responsible for his much younger brother, Sean begins to realize that his decisions will impact their lives forever. Experience the first episode of this highly-anticipated sequel.… Expand"}, {"name": "Pro Evolution Soccer 2019", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2019", "publisher": "Konami", "release_date": "Aug 28 2018", "developers": ["Konami"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/43b87b7869c299af26da5633c4e22e1e-98.jpg", "descriptions": "Improved negotiation system and budget management. Added a re-sell and clean sheet options, so that strategy is needed not only on the field, but also with club management. Enjoy playing the newly added licensed leagues in Master League. All league regulations have been implemented, such asImproved negotiation system and budget management. Added a re-sell and clean sheet options, so that strategy is needed not only on the field, but also with club management. Enjoy playing the newly added licensed leagues in Master League. All league regulations have been implemented, such as the Split System from the Scottish Premiership.\r… Expand"}, {"name": "Cities: Skylines - Natural Disasters", "details_link": "https://www.metacritic.com/game/pc/cities-skylines---natural-disasters", "publisher": "Paradox Interactive", "release_date": "Nov 29 2016", "developers": ["Colossal Order"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 80, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/f34477b05f2bf41e326681a846acfc60-98.jpg", "descriptions": "Natural Disasters features a catalog of catastrophes to challenge mayor-players everywhere, including planning with early warning systems and emergency routes, devastating and destructive disaster effects, and caring for the populace as they struggle to rebuild. The expansion will alsoNatural Disasters features a catalog of catastrophes to challenge mayor-players everywhere, including planning with early warning systems and emergency routes, devastating and destructive disaster effects, and caring for the populace as they struggle to rebuild. The expansion will also update Cities: Skylines with a new scenario editor and gameplay mode, allowing players to finally win – or lose – the game on their own terms.… Expand"}, {"name": "The Evil Within: The Assignment", "details_link": "https://www.metacritic.com/game/playstation-4/the-evil-within-the-assignment", "publisher": "Bethesda Softworks", "release_date": "Mar 10 2015", "developers": ["Tango Gameworks"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 9.2, "image": "https://static.metacritic.com/images/products/games/0/e127dba4d9f2d0ca7f332dd38e74c833-98.jpg", "descriptions": "The first of a 2-part, story-driven experience in which players assume the role of detective Juli Kidman, Sebastian Castellanos’ enigmatic partner, in a concurrent story that seeks to answer a few of the questions surrounding her whereabouts during The Evil Within. She will confrontThe first of a 2-part, story-driven experience in which players assume the role of detective Juli Kidman, Sebastian Castellanos’ enigmatic partner, in a concurrent story that seeks to answer a few of the questions surrounding her whereabouts during The Evil Within. She will confront disturbing new enemies, discover new mysteries, and reveal new horrors. The Assignment affords fans of The Evil Within the opportunity to discover detective Kidman’s furtive motivations and her opaque connection to Mobius, the shadowy group thought to be behind the gnarly events of The Evil Within. … Expand"}, {"name": "Wargame: AirLand Battle", "details_link": "https://www.metacritic.com/game/pc/wargame-airland-battle", "publisher": "Focus Home Interactive", "release_date": "May 29 2013", "developers": ["Eugen Systems"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Tactics"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/2936e81684815237a999da4345e0286b-98.jpg", "descriptions": "Wargame: AirLand Battle allows players to command all military resources of the Cold War era from tanks to planes. A total of 150 planes strengthen the playable arsenal of the game, from fighters to bombers to electronic warfare planes. Four new nations and their vehicles join the originalWargame: AirLand Battle allows players to command all military resources of the Cold War era from tanks to planes. A total of 150 planes strengthen the playable arsenal of the game, from fighters to bombers to electronic warfare planes. Four new nations and their vehicles join the original eight from the first installment, making a total of over 750 vehicles and combat units rendered in realistic detail! Wargame: AirLand Battle also brings authenticity to the next level thanks to a new weapons system, better handling of fire effects, and a new Urban Combat Interface (UCI) allowing for battle inside cities.… Expand"}, {"name": "Football Manager 2015", "details_link": "https://www.metacritic.com/game/pc/football-manager-2015", "publisher": "SegaSoft", "release_date": "Nov  7 2014", "developers": ["Sports Interactive"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management"], "meta_score": 80, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/113cedf42daca31afe363469f59a2c5b-98.jpg", "descriptions": "Football Manager 2015 allows you to live the life of a real football manager – you decide who plays and who sits on the bench, you're in total control of tactics, team-talks, substitutions and pitch-side instructions as you follow the match live with the acclaimed 3D match engine."}, {"name": "TrackMania United", "details_link": "https://www.metacritic.com/game/pc/trackmania-united", "publisher": "Focus Home Interactive", "release_date": "Nov 17 2006", "developers": ["Nadeo"], "platforms": "PC", "num_players": "32  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/638a53eb657311d3c9a11694bf0bab19-98.jpg", "descriptions": "TrackMania United is the latest title in the TrackMania series, and combines high-speed racing with pure, uncomplicated fun. The game contains all the features of the previous titles, and introduces an extensive new content editor. The new editor and in-game browser allow both veteran andTrackMania United is the latest title in the TrackMania series, and combines high-speed racing with pure, uncomplicated fun. The game contains all the features of the previous titles, and introduces an extensive new content editor. The new editor and in-game browser allow both veteran and rookie players the ability to create, showcase and share customized paintjobs, tracks, environments and videos. TrackMania United offers players the opportunity to enjoy a rich gaming experience both online and offline, while taking part in a friendly and fun online community. [Focus Home Interactive]… Expand"}, {"name": "The Suffering", "details_link": "https://www.metacritic.com/game/pc/the-suffering", "publisher": "Encore Software, Inc.", "release_date": "Jun  8 2004", "developers": ["Surreal Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/cab7aca68226e6a3801a7ea5ff20f6a9-98.jpg", "descriptions": "Players assume the role of Torque, a man convicted of a horrible crime that he may or may not have committed. He's sentenced to life in Abbott State Penitentiary, a haunted place that hides a terrible secret, one that threatens both the prison guards and the hardened criminals that call thisPlayers assume the role of Torque, a man convicted of a horrible crime that he may or may not have committed. He's sentenced to life in Abbott State Penitentiary, a haunted place that hides a terrible secret, one that threatens both the prison guards and the hardened criminals that call this isolated hell home. Torque's tale unfolds in nine terrifying levels, where grisly mutated creatures, sadistic prisoners and guards lurk around every corner. A variety of deadly weapons are at his disposal to help him survive and escape from prison. In addition, Torque has a \"rage meter\" that, when filled, transforms him into a hideous and bloodthirsty creature that looks and feels right at home with the other dozen monstrosities stalking his every move. Torque will be able to interact with other inmate NPC's and enlist their help in escaping, or take them out if they get in his way. The Suffering also features three distinct endings based on how the game is played. In revealing Torque's story, he could be a cold-blooded killer, a man wrongfully accused, or something far, far worse. [Encore Software]… Expand"}, {"name": "Card Shark", "details_link": "https://www.metacritic.com/game/switch/card-shark", "publisher": "Devolver Digital", "release_date": "Jun  2 2022", "developers": ["Devolver Digital", "Nerial"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game", "Adventure", "General"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/a45c004072b4087a5dfe11f0649ca50c-98.jpg", "descriptions": "Card Shark is an adventure game full of cunning, intrigue, and delectable deceit. \"Our adversaries tonight? An unscrupulous group of scoundrels and rogues, rumoured to possess an unlimited fund between them. If we stick to the strategies you’ve learnt, this will be a walkover.\"\r- Comte deCard Shark is an adventure game full of cunning, intrigue, and delectable deceit. \"Our adversaries tonight? An unscrupulous group of scoundrels and rogues, rumoured to possess an unlimited fund between them. If we stick to the strategies you’ve learnt, this will be a walkover.\"\r- Comte de Saint-Germain\r LEARN AND MASTER NEW TRICKS\rCheat your way to the top of 18th-century French society. Master deceptions using card marking, false shuffles, deck switching, false deals, and more! Use your ill-gotten gains to buy your way into the closed world of high-stakes tables.\r UNCOVER A CONSPIRACY\r... as you climb from local card parlors to the King's table.\rA word of advice: Don't get caught. Your fellow gamblers do not take kindly to cheats…\r TRAVEL THROUGH 18TH CENTURY FRANCE\rDiscover small towns, remote mansions, and luxurious lounges imagined by Nerial team (Reigns), game creator Arnaud De Bock (Pikuniku). Immerse yourself in the ornate visual artwork of Nicolai Troshinsky. Have your every move accompanied by an original score from Andrea Boccadoro as interpreted by an orchestra.… Expand"}, {"name": "Pac-Man Championship Edition 2 Plus", "details_link": "https://www.metacritic.com/game/switch/pac-man-championship-edition-2-plus", "publisher": "Bandai Namco Games", "release_date": "Feb 22 2018", "developers": ["Bandai Namco Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/cf6c8f5323a64312ddcc5a4f14bc7afd-98.jpg", "descriptions": "A new sequel in the highly acclaimed PAC-MAN Championship Edition series finally comes to next-generation consoles and PC! Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for theA new sequel in the highly acclaimed PAC-MAN Championship Edition series finally comes to next-generation consoles and PC! Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for the future! Featuring eye-popping 3D graphics and funky visuals, the latest version of the classic game takes chomping and chasing through mazes to a whole new level! Get on the train, a new PAC experience is coming!… Expand"}, {"name": "MLB", "details_link": "https://www.metacritic.com/game/psp/mlb", "publisher": "SCEA", "release_date": "Apr 12 2005", "developers": ["989 Sports"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/faca8368200c82c21d700a9e5f8a384d-98.jpg", "descriptions": "Features all-new Branch Point Technology, which provides seamless fielding transitions and smooth base running; the all-new Playmaker Fielding Marker that brings together a player's attributes with the gamer's skill level in order to make the play; and the all-new Release Point Pitching withFeatures all-new Branch Point Technology, which provides seamless fielding transitions and smooth base running; the all-new Playmaker Fielding Marker that brings together a player's attributes with the gamer's skill level in order to make the play; and the all-new Release Point Pitching with Confidence Meter, which helps determine a gamer's ability to hit spots in the strike zone. Supporting up to two players via wireless multiplayer connectivity , gamers can compete against the Artificial Intelligence or go head-to-head against another player. By providing an unmatched broadcast presentation that brings together on screen gameplay, cut scenes, animation and sound, MLB for the PSP provides an engrossing authentic baseball simulation. [SCEA]… Expand"}, {"name": "Pro Evolution Soccer 2014", "details_link": "https://www.metacritic.com/game/xbox-360/pro-evolution-soccer-2014", "publisher": "Konami", "release_date": "Sep 24 2013", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 22 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/7/d8d9aa5a3d3ebdf7ef81b6214da5bb81-98.jpg", "descriptions": "Pro Evolution Soccer 2014 is the latest edition to the PES franchise and it centers everything on the ball including how it moves and how players use it. The game purports to offer new levels of control and fundamentally changing play. Key features include the M.A.S.S physics engine, whichPro Evolution Soccer 2014 is the latest edition to the PES franchise and it centers everything on the ball including how it moves and how players use it. The game purports to offer new levels of control and fundamentally changing play. Key features include the M.A.S.S physics engine, which promises to make every tussle unique and true-to-life, plus new animation tech and emotion mapping of players, teams and fans.… Expand"}, {"name": "Tom Clancy's The Division", "details_link": "https://www.metacritic.com/game/playstation-4/tom-clancys-the-division", "publisher": "Ubisoft", "release_date": "Mar  8 2016", "developers": ["Massive Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 24 ", "genres": ["Shooter", "Modern", "Modern", "Action", "Shooter", "Third-Person", "Tactical", "Arcade"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/61a56716e0ec08372fc3706eea724e68-98.jpg", "descriptions": "Tom Clancy's The Division has players assume the role of Division agents in which they find themselves caught up in an epic conspiracy, forced to combat not only the effects of a manmade virus, but also the rising threat of those behind it."}, {"name": "Dead or Alive 5 Plus", "details_link": "https://www.metacritic.com/game/playstation-vita/dead-or-alive-5-plus", "publisher": "Tecmo Koei America Corp.", "release_date": "Mar 19 2013", "developers": ["Team Ninja"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation Vita"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/d8220ab104ec45ba9aa58e50f6fd2f42-98.jpg", "descriptions": "Building on the DOA series' signature fighting style, DEAD OR ALIVE 5 PLUS brings the graphics and new martial arts techniques of the recent console release to the PS Vita with all-new system-specific features. Players take on the roles of the cast of DEAD OR ALIVE fighters in anBuilding on the DOA series' signature fighting style, DEAD OR ALIVE 5 PLUS brings the graphics and new martial arts techniques of the recent console release to the PS Vita with all-new system-specific features. Players take on the roles of the cast of DEAD OR ALIVE fighters in an action-filled brawler set in locations from around the world, with each stage featuring backdrops that change and interact with players. Characters are rendered in lifelike detail. New touch controls bring a new experience to fighting games. Simple taps, swipes, and pinches on your opponent trigger a variety of devastating moves. Using the Vita's motion sensor, you can even play vertically for a first-person, full-screen view of your opponent. Both novice and expert players can also find even more ways to up their game with new training-focused modes and a new display of advanced frame data that reveals twice the amount of information for each move compared to previous versions.… Expand"}, {"name": "Lumines Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/lumines-remastered", "publisher": "Enhance Games", "release_date": "Jun 26 2018", "developers": ["Enhance Games", "Resonair"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 80, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/e66ce0c11dfccb9805aa00308df661aa-98.jpg", "descriptions": "An HD remake of the classic hit puzzler Lumines, LUMINES REMASTERED comes shinin' back from the creators of Rez Infinite. Groove to this stylish, puzzle-action game where the fusion of light and sound sets the stage for a two-color falling block experience."}, {"name": "Gish", "details_link": "https://www.metacritic.com/game/pc/gish", "publisher": "GarageGames", "release_date": "Sep 17 2004", "developers": ["Chronic Logic"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/5b1089aa484fdf0e029ebd043e63fc02-98.jpg", "descriptions": "Gish isn't your average hero, in fact he's not your average anything.. see Gish is a ball of tar. A Sunday stroll with his lady friend Brea goes awry when a shadowy figure emerges from an open man hole and pulls Brea into the ground below. Following Brea's calls for help Gish suddenly findsGish isn't your average hero, in fact he's not your average anything.. see Gish is a ball of tar. A Sunday stroll with his lady friend Brea goes awry when a shadowy figure emerges from an open man hole and pulls Brea into the ground below. Following Brea's calls for help Gish suddenly finds himself in the subterranean sewers of Dross, a long forgotten city filled with twisting corridors, evil traps and some of the most demented creatures imaginable. With his gelatinous structure as his only means of defense Gish must follow the echoing cries of his damsel in distress deep into the earth bellow. What freakish creatures dwell in this subterranean land? Who is Brea's captor? And just how far down does the rabbit hole go? Life isn't easy when you're a 12 pound ball of tar... [Chronic Logic]… Expand"}, {"name": "Arise: A Simple Story", "details_link": "https://www.metacritic.com/game/xbox-one/arise-a-simple-story", "publisher": "Techland", "release_date": "Dec  3 2019", "developers": ["Piccolo"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/93586d0d426da87f5f994f31fb15475b-98.jpg", "descriptions": "Set out on an emotional journey through the bittersweet lives of two people where memories come alive and time bends to your will. Lose yourself in moments of happiness and overcome every hardship as you relive your life’s story. A story of joy and sorrow. A simple story."}, {"name": "Downwell", "details_link": "https://www.metacritic.com/game/playstation-4/downwell", "publisher": "Devolver Digital", "release_date": "May 24 2016", "developers": ["Moppin"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "PlayStation 4"], "genres": ["Action", "General"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/249268b77786a20b85bb2fbba8f273fb-98.jpg", "descriptions": "In Downwell, you descend into a deep well filled with monsters and traps, equipped with the Gunboots — a set of boots that let you shoot bullets from your feet. You’ll be using it to clear your way of enemies, or as a way to slow your descent using its recoil. On your way down you’ll findIn Downwell, you descend into a deep well filled with monsters and traps, equipped with the Gunboots — a set of boots that let you shoot bullets from your feet. You’ll be using it to clear your way of enemies, or as a way to slow your descent using its recoil. On your way down you’ll find different guns, shops with helpful items, and upgrades like explosive balloons or a set of silverware to eat your foes with. The well is randomly generated, so no two trips down will ever be the same. [Playstation.com]… Expand"}, {"name": "Axiom Verge", "details_link": "https://www.metacritic.com/game/pc/axiom-verge", "publisher": "Tom Happ", "release_date": "May 14 2015", "developers": ["Tom Happ"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Platformer", "", "Metroidvania"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/1db5ca7e36af009708ce4395bdf749de-98.jpg", "descriptions": "Axiom Verge is an indie game focusing on action and exploration."}, {"name": "Dark Souls II: Crown of the Sunken King", "details_link": "https://www.metacritic.com/game/xbox-360/dark-souls-ii-crown-of-the-sunken-king", "publisher": "Bandai Namco Games", "release_date": "Jul 22 2014", "developers": ["Namco Bandai Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/a08234e67ece89dade3678227f72491a-98.jpg", "descriptions": "Embark on a journey to reclaim a crown that Drangleic's King Vendrick once owned. This perilous quest will lead you through an entirely different world within the Dark Souls II universe, where stepped pyramids span a vast underground cavern. It is said that one of the ancient crowns layEmbark on a journey to reclaim a crown that Drangleic's King Vendrick once owned. This perilous quest will lead you through an entirely different world within the Dark Souls II universe, where stepped pyramids span a vast underground cavern. It is said that one of the ancient crowns lay buried deep within these dark caverns; but surely such a valued item cannot sit unguarded. Explore in search of a crown that holds the strength of lords from times long past.… Expand"}, {"name": "LEGO Star Wars: The Complete Saga", "details_link": "https://www.metacritic.com/game/ds/lego-star-wars-the-complete-saga", "publisher": "LucasArts", "release_date": "Nov  6 2007", "developers": ["TT Fusion"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Action Adventure", "Sci-Fi", "General", "Compilation"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/5be76d3caa02fcade992850172f83613-98.jpg", "descriptions": "From the Trade Federation's \"negotiations\" with Obi-Wan Kenobi and Qui-Gon Jinn in The Phantom Menace to the space battle above Endor in Return of the Jedi, The Complete Saga allows players to kick some brick through 36 Story Mode levels, including Episode II's newly added high-speed pursuitFrom the Trade Federation's \"negotiations\" with Obi-Wan Kenobi and Qui-Gon Jinn in The Phantom Menace to the space battle above Endor in Return of the Jedi, The Complete Saga allows players to kick some brick through 36 Story Mode levels, including Episode II's newly added high-speed pursuit of bounty hunter Zam Wessell. Traveller’s Tales has revamped levels from the original LEGO Star Wars to match the gameplay evolutions found in LEGO Star Wars II, and Prequel Trilogy characters can now be mixed and matched with those from the Original Trilogy – more than 160 in all. [LucasArts]… Expand"}, {"name": "Visage", "details_link": "https://www.metacritic.com/game/playstation-4/visage", "publisher": "SadSquare Studio", "release_date": "Oct 31 2020", "developers": ["SadSquare Studio"], "platforms": ["PC", "PlayStation 5", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/ba61ed7b0be29e40d4e851cf887f5487-98.jpg", "descriptions": "Visage is a first-person psychological horror game. Explore a mysterious ever-changing house in a slow-paced, atmospheric world that combines both uncannily comforting and horrifyingly realistic environments, and enjoy a genuinely terrifying experience."}, {"name": "Rabi-Ribi", "details_link": "https://www.metacritic.com/game/playstation-4/rabi-ribi", "publisher": "Sekai Project", "release_date": "Sep  1 2017", "developers": ["CreSpirit"], "platforms": ["PC", "PlayStation Vita", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/2073c506a426ad92a0b104825cfd8706-98.jpg", "descriptions": "Dodge bullets, missiles and lasers in battle as you wrap your head around that bunny girl costume! Combo away with your mighty Piko Hammer or spam various spells from afar with your fiery fairy friend. Explore and explode through Rabi-Rabi Island as you collect power-ups and uncover secrets."}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 2: Ties That Bind Part Two", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---a-new-frontier-episode-2-ties-that-bind-part-two", "publisher": "Telltale Games", "release_date": "Dec 20 2016", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/c4e04f3a60e880d01a9d0a3e4cbfdf51-98.jpg", "descriptions": "When family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken fromWhen family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken from him, you meet a young girl who has experienced her own unimaginable loss. Her name is Clementine, and your fates are bound together in a story where every choice you make could be your last.… Expand"}, {"name": "NBA Live 10", "details_link": "https://www.metacritic.com/game/xbox-360/nba-live-10", "publisher": "EA Sports", "release_date": "Oct  6 2009", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/886a2de0b5e5a0906559f98d0527ec7d-98.jpg", "descriptions": "Featuring several innovations to the core gameplay experience and online game modes, NBA LIVE 10 is bringing a renewed focus to the long-running EA SPORTS basketball franchise. The groundbreaking Dynamic DNA service, driven by Synergy Sports Technology, makes a return in NBA LIVE 10, withFeaturing several innovations to the core gameplay experience and online game modes, NBA LIVE 10 is bringing a renewed focus to the long-running EA SPORTS basketball franchise. The groundbreaking Dynamic DNA service, driven by Synergy Sports Technology, makes a return in NBA LIVE 10, with significant improvements that allow players to connect their game to the NBA season like never before. [Electronic Arts]… Expand"}, {"name": "Battlefield 2: Modern Combat", "details_link": "https://www.metacritic.com/game/xbox/battlefield-2-modern-combat", "publisher": "EA Games", "release_date": "Oct 24 2005", "developers": ["Digital Illusions"], "platforms": ["PlayStation 2", "Xbox 360", "Xbox"], "num_players": "32  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/1ecc2ed30611a250eb71def8159b01da-98.jpg", "descriptions": "Battlefield 2: Modern Combat brings the intensity of Battlefield 1942 into the modern era with the latest vehicles and weapons systems available. In this first-person shooter, you'll choose to fight for one of three military superpowers: the United States, China, or the newly formed MiddleBattlefield 2: Modern Combat brings the intensity of Battlefield 1942 into the modern era with the latest vehicles and weapons systems available. In this first-person shooter, you'll choose to fight for one of three military superpowers: the United States, China, or the newly formed Middle East Coalition. Armed with advanced weaponry, you can take control of any of the game's vehicles to engage in major conflicts with up to 24 players online. Battlefield: Modern Combat features expansive environments--from city streets to remote jungles--all around the world.… Expand"}, {"name": "Driver: San Francisco", "details_link": "https://www.metacritic.com/game/pc/driver-san-francisco", "publisher": "Ubisoft", "release_date": "Sep 27 2011", "developers": ["Ubisoft Reflections"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/9320d6f6fe2478f1470d7755a477ea31-98.jpg", "descriptions": "Driver: San Francisco marks the return of the established video game series that has sold 14 million copies worldwide. Gamers will play as Detective John Tanner on a relentless manhunt for crime lord Charles Jericho through the hills of the City by the Bay. Thanks to a groundbreakingDriver: San Francisco marks the return of the established video game series that has sold 14 million copies worldwide. Gamers will play as Detective John Tanner on a relentless manhunt for crime lord Charles Jericho through the hills of the City by the Bay. Thanks to a groundbreaking gameplay feature, players can now seamlessly \"shift\" between well over a hundred licensed vehicles, keeping them constantly in the heart of the action. With its timeless setting, unique car handling and renewed playability, Driver: San Francisco will revitalize the classic free-roaming, cinematic car chase experience for the current generation of gaming platforms.… Expand"}, {"name": "Geometry Wars: Galaxies", "details_link": "https://www.metacritic.com/game/wii/geometry-wars-galaxies", "publisher": "Sierra Entertainment", "release_date": "Nov 20 2007", "developers": ["Bizarre Creations", "Kuju Entertainment"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/652f9cfb1705ad03819d6996462f8ee7-98.jpg", "descriptions": "Geometry Wars: Galaxies delivers an all new mission-based campaign where players blast-off on action-paced quests across the galaxy, defending solar systems one by one, defeating waves of alien enemies on new and classic Battle Grids. The controls have been optimized for Nintendo systems,Geometry Wars: Galaxies delivers an all new mission-based campaign where players blast-off on action-paced quests across the galaxy, defending solar systems one by one, defeating waves of alien enemies on new and classic Battle Grids. The controls have been optimized for Nintendo systems, allowing gamers to use the Wii Remote and Nunchuk controller or DS touch screen to execute hotshot moves as never before. For the first time ever, the Geometry Wars videogame lets players battle via hot seat, co-op, simultaneous and versus in multiplayer mode. Those that own both the Nintendo DS and Wii can link the game together using Wi-Fi to unlock bonus content. Elite players can challenge the universe by posting high scores on the Wii's online leader board. Geometry Wars: Galaxies videogame also includes the full version of \"Geometry Wars: Retro Evolved\". [Sierra Entertainment]… Expand"}, {"name": "Wii Fit", "details_link": "https://www.metacritic.com/game/wii/wii-fit", "publisher": "Nintendo", "release_date": "May 19 2008", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/6fed4bec3a438dd818fc1bbe0de2574b-98.jpg", "descriptions": "The active-play phenomenon started by Wii Sports now spreads to your whole body thanks to the pressure-sensitive Wii Balance Board (name not final), which comes packed with Wii Fit. The board is used for an extensive array of fun and dynamic activities, including aerobics, yoga, muscleThe active-play phenomenon started by Wii Sports now spreads to your whole body thanks to the pressure-sensitive Wii Balance Board (name not final), which comes packed with Wii Fit. The board is used for an extensive array of fun and dynamic activities, including aerobics, yoga, muscle stretches and games. Many of these activities focus towards providing a \"core\" workout, a popular exercise method that emphasizes slower, controlled motions. Family members will have fun staying active and talking about and comparing their results and progress on a new channel on the Wii Menu. [Nintendo]… Expand"}, {"name": "Young Souls", "details_link": "https://www.metacritic.com/game/xbox-one/young-souls", "publisher": "The Arcade Crew", "release_date": "Mar 10 2022", "developers": ["1P2P"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 80, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/d6ada4c8f97b70518b2e5231acd153bc-98.jpg", "descriptions": "As orphans, Jenn and Tristan's life path brought them to a mysterious scientist, who took them in and cared for them as his own children. But one day, he disappeared under very odd circumstances.While searching desperately for him, the duo found a hidden cellar and the Moon Gate portal,As orphans, Jenn and Tristan's life path brought them to a mysterious scientist, who took them in and cared for them as his own children. But one day, he disappeared under very odd circumstances.While searching desperately for him, the duo found a hidden cellar and the Moon Gate portal, transporting them to a dangerous parallel world where goblins thrive.Your adventure begins as you fight to bridge these two very different worlds.Young Souls is a gorgeous 2D brawler meets story-rich action RPG. Fight hordes of belligerent goblins, level up with hundreds of weapons and accessories, explore, and journey between worlds, as rebellious twins battle their way to save their foster father.… Expand"}, {"name": "BPM: Bullets Per Minute", "details_link": "https://www.metacritic.com/game/playstation-4/bpm-bullets-per-minute", "publisher": "Playtonic Friends", "release_date": "Oct  5 2021", "developers": ["Awe Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Shooter", "First-Person", "Music", "Arcade"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/58c0c34c86675bf614d54c2cc882286c-98.jpg", "descriptions": "BPM is a rhythm-action FPS rogue-like where you must shoot, jump and dodge to the beat of an epic rock soundtrack. Delve into a randomly generated dungeon where one missed note can lead to your death. Gain game-changing abilities and loot powerful weaponry to defeat your ancient enemy: Nidhogg."}, {"name": "King's Quest Chapter 1: A Knight to Remember", "details_link": "https://www.metacritic.com/game/xbox-one/kings-quest-chapter-1-a-knight-to-remember", "publisher": "Sierra Games", "release_date": "Jul 29 2015", "developers": ["The Odd Gentlemen"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/24157950a216354f358f2d50844f81db-98.jpg", "descriptions": "King’s Quest is a collection of 5 different chapter releases, each focusing on an untold tale in Graham’s past. In each installment, an aging King Graham reflects on his life of adventure with his granddaughter, Gwendolyn, while players are thrust back to influence first-hand the decisionsKing’s Quest is a collection of 5 different chapter releases, each focusing on an untold tale in Graham’s past. In each installment, an aging King Graham reflects on his life of adventure with his granddaughter, Gwendolyn, while players are thrust back to influence first-hand the decisions and events that shaped a kingdom. Embark on an extraordinary journey across the world of Daventry. [Sierra]… Expand"}, {"name": "Stealth Inc: A Clone in the Dark", "details_link": "https://www.metacritic.com/game/playstation-3/stealth-inc-a-clone-in-the-dark", "publisher": "Curve Studios", "release_date": "Jul 23 2013", "developers": ["Curve Studios"], "platforms": ["iPhone/iPad", "PlayStation Vita", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/1f4fb42dd0f62ac11fa54ec07b03af82-98.jpg", "descriptions": "Stealth Inc: A Clone in the Dark is a fast-paced stealth platformer featuring brutal hazards, ruthless enemies, fiendish puzzles and red pixels galore. Jump, sneak, and be chunked through 80 levels. Will you make it out alive? Armed with only your wits and a pair of top-of-the-lineStealth Inc: A Clone in the Dark is a fast-paced stealth platformer featuring brutal hazards, ruthless enemies, fiendish puzzles and red pixels galore. Jump, sneak, and be chunked through 80 levels. Will you make it out alive? Armed with only your wits and a pair of top-of-the-line Stealthing Goggles, it's your job to sneak your way through a deadly facility that's determined to extinguish your fragile little life. With no weapons and no armor, being seen means instant death. Stay out of the light to avoid the attention of deadly security robots! Leap like a lusty salmon to avoid those zap-happy lasers! Think fast as the walls close in around you! And once you've defeated these deadly chambers (or they've defeated you), create your own fiendish death-rooms in Stealth Inc's fully-featured level editor. This game supports Cross Buy and entitles you to both the PS3 and Vita version!… Expand"}, {"name": "Hatsune Miku: Project Mirai DX", "details_link": "https://www.metacritic.com/game/3ds/hatsune-miku-project-mirai-dx", "publisher": "Sega", "release_date": "Sep  8 2015", "developers": ["Sega"], "platforms": "3DS", "genres": ["Miscellaneous", "Action", "Rhythm", "Music"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/d79d88cb452f969396357c6bda21a421-98.jpg", "descriptions": "Includes both Touch Mode and Button Mode, each featuring multiple levels of difficulty and an array of customization options. Gamers are able to adjust difficulty through challenge and support items, change timing indicators and target icons, and swap out vocals in certain songs. Players canIncludes both Touch Mode and Button Mode, each featuring multiple levels of difficulty and an array of customization options. Gamers are able to adjust difficulty through challenge and support items, change timing indicators and target icons, and swap out vocals in certain songs. Players can peep their favorite videos and add scrolling commentary in the Mirai Theater, formulate unique dance routines in the Dance Studio, and compose their own song phrases in My Tune.… Expand"}, {"name": "Nobunaga's Ambition: Sphere of Influence", "details_link": "https://www.metacritic.com/game/playstation-4/nobunagas-ambition-sphere-of-influence", "publisher": "Koei Tecmo Games", "release_date": "Sep  1 2015", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/39931aefaee9d707cbdf2a267e709dca-98.jpg", "descriptions": "Become a Daimyo of the Warring States period of Japanese history in NOBUNAGA'S AMBITION, a historical simulation game of conquest and domination. It is the 30th anniversary of this series and this current release, NOBUNAGA'S AMBITION: Sphere of Influence, is the crown of the series."}, {"name": "The Corporate Machine", "details_link": "https://www.metacritic.com/game/pc/the-corporate-machine", "publisher": "Take-Two Interactive", "release_date": "Jul 14 2001", "developers": ["Stardock"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General", "Management", "Business / Tycoon"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/95ad915f6ff088b301440ba94ca5f929-98.jpg", "descriptions": "Winning design, powerful artificial intelligence, and a great sense of humor make The Corporate Machine one of the best strategy games so far this year."}, {"name": "Bit.Trip Core", "details_link": "https://www.metacritic.com/game/wii/bittrip-core", "publisher": "Nintendo", "release_date": "Jul  6 2009", "developers": ["Gaijin Games"], "platforms": ["PC", "PC", "Switch", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/d8808c0100384edd623fe7c70a64a971-98.jpg", "descriptions": "[WiiWare]  BIT.TRIP CORE continues the BIT.TRIP saga in this retro-arcade-style game. BIT.TRIP CORE adds up to an exciting action/rhythm game that's best played while zoning out on the tunes and letting the visuals swallow you whole. The experience is inspired by games from the '80s, but[WiiWare]  BIT.TRIP CORE continues the BIT.TRIP saga in this retro-arcade-style game. BIT.TRIP CORE adds up to an exciting action/rhythm game that's best played while zoning out on the tunes and letting the visuals swallow you whole. The experience is inspired by games from the '80s, but with a modern twist. The game play is entirely new to the series, leaving the single-axis controls of BIT.TRIP BEAT behind in favor of the ability to control two axes. If the difficulty gets you down, grab a friend and play cooperatively with two-player multiplayer. Make it to the end and you'll have journeyed one step further to completing your BIT.TRIP. [Nintendo]… Expand"}, {"name": "Potionomics", "details_link": "https://www.metacritic.com/game/pc/potionomics", "publisher": "XSEED Games", "release_date": "Oct 17 2022", "developers": ["Voracious Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/c77725c7b7c3256ec98c1f61467b99b8-98.jpg", "descriptions": "You’ve inherited your uncle’s potion shop—and a huge debt. Better get brewing! Customize your store, hire heroes to gather ingredients, befriend (or romance) fellow vendors to learn new haggling strategies, and go head-to-head with competitors in this narrative-driven, deck-building shopYou’ve inherited your uncle’s potion shop—and a huge debt. Better get brewing! Customize your store, hire heroes to gather ingredients, befriend (or romance) fellow vendors to learn new haggling strategies, and go head-to-head with competitors in this narrative-driven, deck-building shop simulator.\r… Expand"}, {"name": "Game of Thrones: Episode Four - Sons of Winter", "details_link": "https://www.metacritic.com/game/xbox-one/game-of-thrones-episode-four---sons-of-winter", "publisher": "Telltale Games", "release_date": "May 26 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/6aed42cda7de167a466b165ad3fa319e-98.jpg", "descriptions": "In this fourth episode, the fate of the scattered Forresters hangs in the balance, and no one allied with the family is considered to be safe. An unexpected meeting offers Rodrik a new opportunity to free Ironrath from its Whitehill stranglehold, but with young Ryon Forrester stillIn this fourth episode, the fate of the scattered Forresters hangs in the balance, and no one allied with the family is considered to be safe. An unexpected meeting offers Rodrik a new opportunity to free Ironrath from its Whitehill stranglehold, but with young Ryon Forrester still imprisoned, his next moves are critical. Gared must abandon Castle Black and venture beyond the Wall in search of the mysterious North Grove, risking encounters with Wildlings and worse. In King's Landing, the population is reeling from a recent royal death, and Mira must step carefully in an increasingly complex game of politics where secrets are traded as currency. Far away in Essos, Asher infiltrates the slave city of Meereen at the behest of Daenerys Targaryen, but will the friendship he holds dear break under the strain of a mission that raises memories best forgotten? [Telltale Games]… Expand"}, {"name": "Dungeons & Dragons: Chronicles of Mystara", "details_link": "https://www.metacritic.com/game/pc/dungeons-dragons-chronicles-of-mystara", "publisher": "Capcom", "release_date": "Jun 18 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "genres": ["Action", "Miscellaneous", "Beat-'Em-Up", "Compilation"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/5c049a74fcc074484f3fd323be0d267b-98.jpg", "descriptions": "As the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titlesAs the first modern role playing game, the Dungeons & Dragons franchise from Wizards of the Coast gave birth to numerous products including two arcade titles from Capcom, Dungeons & Dragons: Tower of Doom and its sequel Dungeons & Dragons: Shadow over Mystara.  Both these titles are now being re-released with updated HD graphics and a wealth of other enhancements as a definitive double pack entitled Dungeons & Dragons: Chronicles of Mystara.… Expand"}, {"name": "Sonic's Ultimate Genesis Collection", "details_link": "https://www.metacritic.com/game/playstation-3/sonics-ultimate-genesis-collection", "publisher": "Sega", "release_date": "Feb 10 2009", "developers": ["Backbone Entertainment"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/5aac62b0f33b8cbc9b2da48aaa73426a-98.jpg", "descriptions": "Take a trip back in time with over 40 titles from the SEGA Genesis era, including your Sonic The Hedgehog favorites. In classic single-player and multiplayer battles, you’ll take down a huge variety of enemies, including Sonic’s nemesis Dr. Eggman (AKA Dr. Robotnik), shuriken-flingingTake a trip back in time with over 40 titles from the SEGA Genesis era, including your Sonic The Hedgehog favorites. In classic single-player and multiplayer battles, you’ll take down a huge variety of enemies, including Sonic’s nemesis Dr. Eggman (AKA Dr. Robotnik), shuriken-flinging ninjas, hordes of altered beasts and the world’s greatest fighting champions. [Sega]… Expand"}, {"name": "Final Fantasy Crystal Chronicles: My Life as a King", "details_link": "https://www.metacritic.com/game/wii/final-fantasy-crystal-chronicles-my-life-as-a-king", "publisher": "Square Enix", "release_date": "May 12 2008", "developers": ["Square Enix"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/4e1011d73b5ebbd3387d8605898fd47c-98.jpg", "descriptions": "[WiiWare]  You are a young king who must rebuild his kingdom, beginning with the castle town. When the king first reaches the borders of his realm, he finds that the crystal in the center of town has given him special powers to be a \"master builder,\" a unique ability he uses to construct[WiiWare]  You are a young king who must rebuild his kingdom, beginning with the castle town. When the king first reaches the borders of his realm, he finds that the crystal in the center of town has given him special powers to be a \"master builder,\" a unique ability he uses to construct houses, shops and the like to rebuild and revitalize his kingdom. [Nintendo]… Expand"}, {"name": "Elite: Dangerous", "details_link": "https://www.metacritic.com/game/xbox-one/elite-dangerous", "publisher": "Frontier Developments", "release_date": "Oct  6 2015", "developers": ["Frontier Developments"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Simulation", "Space", "Civilian"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/7b494b8afe076305c4c6a5c582921718-98.jpg", "descriptions": "Elite: Dangerous is a massively multiplayer space epic, bringing gaming’s original open world adventure to the modern generation with a connected galaxy, evolving narrative and the entirety of the Milky Way re-created at its full galactic proportions. Starting with only a small starship andElite: Dangerous is a massively multiplayer space epic, bringing gaming’s original open world adventure to the modern generation with a connected galaxy, evolving narrative and the entirety of the Milky Way re-created at its full galactic proportions. Starting with only a small starship and a few credits, players do what it takes to earn the skill, knowledge, wealth and power to survive in a futuristic cutthroat galaxy and to stand among the ranks of the iconic Elite. 400 Billion Star Systems. Infinite Freedom. Blaze Your Own Trail. [Xbox.com]… Expand"}, {"name": "Hellblade: Senua's Sacrifice", "details_link": "https://www.metacritic.com/game/switch/hellblade-senuas-sacrifice", "publisher": "Ninja Theory", "release_date": "Apr 11 2019", "developers": ["Ninja Theory", "QLOC"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/3225d0662c95b7673aadbab8629abd18-98.jpg", "descriptions": "An independent game from Ninja Theory - makers of Heavenly Sword, Enslaved: Odyssey to the West & DmC: Devil May Cry. Hellblade: Senua's Sacrifice takes you on a journey into savage viking heartland with Senua, a Celtic warrior struggling with trauma & psychosis."}, {"name": "Natsuki Chronicles", "details_link": "https://www.metacritic.com/game/playstation-4/natsuki-chronicles", "publisher": "Rising Star Games", "release_date": "Feb 18 2021", "developers": ["Qute"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/bb1d39f45d42e335b1a5cdcd643a2fd2-98.jpg", "descriptions": "New dramatic horizontal shoot ’em up that takes place in the same setting as Ginga Force.  An immersive story that follows protagonist Natsuki. Discover the story of her past as a rookie pilot up to present day with events that are parallel to those in Ginga Force."}, {"name": "Unforeseen Incidents", "details_link": "https://www.metacritic.com/game/pc/unforeseen-incidents", "publisher": "Application Systems Heidelberg", "release_date": "May 24 2018", "developers": ["Backwoods Entertainment"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/19a72a2ba5de8fe9c3c76668d9411705-98.jpg", "descriptions": "Unforeseen Incidents is a classical style interactive mystery set in a beautifully hand-painted world. Join Harper Pendrell and experience a challenging investigation, smart dialog and a rich cast of characters in this thrilling new adventure game."}, {"name": "FAR: Lone Sails", "details_link": "https://www.metacritic.com/game/pc/far-lone-sails", "publisher": "Mixtvision", "release_date": "May 17 2018", "developers": ["Okomotive"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "2D"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/c52ddc1503ac4cc9a73bd2d6b80127d9-98.jpg", "descriptions": "Traverse a dried-out seabed littered with the remains of a decaying civilization. Keep your unique vessel going, overcome numerous obstacles and withstand the hazardous weather conditions. How far can you make it? What will you find?"}, {"name": "Need for Speed Most Wanted", "details_link": "https://www.metacritic.com/game/gamecube/need-for-speed-most-wanted", "publisher": "Electronic Arts", "release_date": "Nov 15 2005", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 80, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/29fcde9e81eea22ae049476a1c070058-98.jpg", "descriptions": "In Need for Speed Most Wanted, you can try to become the most notorious street racer alive. Outrun both racers and cops to increase your reputation and move up the street racing blacklist. You can choose from a variety of vehicle types and destructible urban maps featuring shortcuts,In Need for Speed Most Wanted, you can try to become the most notorious street racer alive. Outrun both racers and cops to increase your reputation and move up the street racing blacklist. You can choose from a variety of vehicle types and destructible urban maps featuring shortcuts, traffic, and patrolling police.… Expand"}, {"name": "NCAA March Madness 2005", "details_link": "https://www.metacritic.com/game/xbox/ncaa-march-madness-2005", "publisher": "EA Sports", "release_date": "Nov 17 2004", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/b5c15f806e8c6f8a81aed23074ff61b7-98.jpg", "descriptions": "Lead one of more than 320 Division I schools to the Big Dance with NCAA March Madness 2005. Now you can use scouting reports and locker room videos from the nation's top college coaches to create a game plan that takes you to the top. Along with a revamped Dynasty mode, online play, andLead one of more than 320 Division I schools to the Big Dance with NCAA March Madness 2005. Now you can use scouting reports and locker room videos from the nation's top college coaches to create a game plan that takes you to the top. Along with a revamped Dynasty mode, online play, and Mascot and Rivalry modes, NCAA March Madness 2005 lets your replay classic matchups between great college basketball teams. The game also adds new mascots, cheerleaders, arenas, crowd chants, and fight songs.… Expand"}, {"name": "Disciples II: Rise of the Elves", "details_link": "https://www.metacritic.com/game/pc/disciples-ii-rise-of-the-elves", "publisher": "Strategy First", "release_date": "Nov 25 2003", "developers": ["Strategy First"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/9f43e733486a165ece114d7e1c1d61f2-98.jpg", "descriptions": "Disciples II: Rise of the Elves is a milestone in the Disciples universe. For the first time, Disciples fans will be able to play as the elder Elven race as they struggle to reclaim their forests from the four primary forces in Nevendaar. Driven by an unpredictable god who urges them toDisciples II: Rise of the Elves is a milestone in the Disciples universe. For the first time, Disciples fans will be able to play as the elder Elven race as they struggle to reclaim their forests from the four primary forces in Nevendaar. Driven by an unpredictable god who urges them to battle, the Elves begin a massive march towards their fate. The noble Elves rule their people from elaborate fortresses within the trees. They adorn themselves with ornate armor and prefer councils or negotiations to conflict. Their queen is a just leader, preferring the path of peace for her kind. The noble Elves owe much to the Empire... The wild Elves have become forest predators. Their intolerance of the civilized world has reached new extremes and they have reduced themselves to highwaymen and bandits. They tolerate the noble bloodline, but do not respect it. The thought of their race allying with another is appalling. As one tiny oracle heralds the unquestionable will of Gallean to lash out against his timeless enemies, the Elves must unite their scattered tribes. [Strategy First]… Expand"}, {"name": "Amped 2", "details_link": "https://www.metacritic.com/game/xbox/amped-2", "publisher": "Microsoft Game Studios", "release_date": "Oct 28 2003", "developers": ["Indie Built"], "platforms": "Xbox", "num_players": "1-8 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/1f08d7ac9640887dd357fc152014b00e-98.jpg", "descriptions": "Amped 2 offers a freestyle snowboarding experience with a large and varied trick library.  You'll explore vast areas of wide-open, real mountains packed with terrain parks.  Play head-to-head with friends in the various multiplayer modes.  When you're ready to take it to the next level,Amped 2 offers a freestyle snowboarding experience with a large and varied trick library.  You'll explore vast areas of wide-open, real mountains packed with terrain parks.  Play head-to-head with friends in the various multiplayer modes.  When you're ready to take it to the next level, connect to Xbox Live to check rankings and challenge the world's best virtual riders.  Travel the globe, and pull sick tricks in front of sponsors, photographers, and fans.  The latest snowboarding magazines or videos feature your photos and demo reels as you become more famous.  Climb to the top ranks of the sport, and become a media superstar--all to the sounds of more than 300 killer indie tracks.  … Expand"}, {"name": "Def Jam Vendetta", "details_link": "https://www.metacritic.com/game/playstation-2/def-jam-vendetta", "publisher": "EA Sports Big", "release_date": "Mar 31 2003", "developers": ["Aki Corp."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/2500293aec804998467fcf6fcc7caeb2-98.jpg", "descriptions": "It's been three years since D-Mob chased you out of the New York fight circuit and you swore you'd never go back. Now your pal Manny is in trouble and he needs you to bail him out. The plan is simple: get in, win a few fights, pay off his debt, get out. No problem. Well, it turns out thatIt's been three years since D-Mob chased you out of the New York fight circuit and you swore you'd never go back. Now your pal Manny is in trouble and he needs you to bail him out. The plan is simple: get in, win a few fights, pay off his debt, get out. No problem. Well, it turns out that things aren't as easy as they appear. Once in the scene, your past comes back to haunt you. Soon you're over your head and your only chance to get your life back together is to settle a score that has gone too long unpaid. [Electronic Arts]… Expand"}, {"name": "Capcom vs. SNK 2 EO", "details_link": "https://www.metacritic.com/game/xbox/capcom-vs-snk-2-eo", "publisher": "Capcom", "release_date": "Feb 11 2003", "developers": ["Capcom"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/3b3400797e9d1cf003f013d27ab1a59b-98.jpg", "descriptions": "Two fighting giants clash in Capcom vs. SNK 2 EO. Now you can choose from more than 44 characters from the Capcom and SNK fighting universes and pit them against one another in one-on-one slugfests. Before each match, you can customize your character's fighting style with one of six newTwo fighting giants clash in Capcom vs. SNK 2 EO. Now you can choose from more than 44 characters from the Capcom and SNK fighting universes and pit them against one another in one-on-one slugfests. Before each match, you can customize your character's fighting style with one of six new Grooves. Then, put your uppercuts, throws, and combos to the test in six gameplay modes featuring multiple tournaments. With the new Free Ratio System, you can easily determine the level of your fighter's strength.… Expand"}, {"name": "MechCommander 2", "details_link": "https://www.metacritic.com/game/pc/mechcommander-2", "publisher": "Microsoft Game Studios", "release_date": "Jul 18 2001", "developers": ["Microsoft Game Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "General", "General"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/ecf868a2ac01b0fa424c336a2a2ef8db-98.jpg", "descriptions": "Take control of an entire company of the most fearsome military machines in history: BattleMechs! As a MechCommander, you command a unit of mercenary MechWarriors in a real-time strategy game of power, combat, and treachery set in the BattleTech® Universe. [Microsoft]"}, {"name": "Dark Cloud", "details_link": "https://www.metacritic.com/game/playstation-2/dark-cloud", "publisher": "SCEA", "release_date": "May 28 2001", "developers": ["Level 5"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/ac831ff6448c33b63414c2157801ad0a-98.jpg", "descriptions": "Sony's long-awaited first-party title which mixes several existing genres and game ideas, Dark Cloud puts the player into the role of young Toan, who is chosen by a Fairy King to help bring the world back into order after it had destroyed by the recently summoned \"Dark Genie\" or \"Black Demon.\""}, {"name": "Waterloo: Napoleon's Last Battle", "details_link": "https://www.metacritic.com/game/pc/waterloo-napoleons-last-battle", "publisher": "Strategy First", "release_date": "Mar 25 2001", "developers": ["BreakAway Games"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "General", "General"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/8a0922af87dc4ea3938909a4776e1f7c-98.jpg", "descriptions": "Gameplay stands out in this strategy game based on the veteran game engine used in Sid Meier’s \"Gettysburg.\""}, {"name": "Vanishing Point", "details_link": "https://www.metacritic.com/game/dreamcast/vanishing-point", "publisher": "Acclaim", "release_date": "Dec 21 2000", "developers": ["Clockwork Games"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/c41369e53440000c23ac36135282eb3b-98.jpg", "descriptions": "It's a driving simulation so advanced and authentic it'll drive you mad. Comprehensive vehicle dynamics based on collaboration with industry engineers. Authentically licensed cars from manufacturers like Lotus, Aston-Martin, BMW, Alfa Romeo and more... One of the most advanced 3D drivingIt's a driving simulation so advanced and authentic it'll drive you mad. Comprehensive vehicle dynamics based on collaboration with industry engineers. Authentically licensed cars from manufacturers like Lotus, Aston-Martin, BMW, Alfa Romeo and more... One of the most advanced 3D driving engines ever developed. Is your mind ready for this much reality?… Expand"}, {"name": "Chessmaster 8000", "details_link": "https://www.metacritic.com/game/pc/chessmaster-8000", "publisher": "Mattel", "release_date": "Nov 14 2000", "developers": ["Mattel"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "General", "General", "Board / Card Game"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/c2f35d2af81ca23a30050de475bb0840-98.jpg", "descriptions": "While it does have some new features and still plays well, it actually falls short of its two predecessors in the important area of multiplayer support."}]