[{"name": "No Time to Explain", "details_link": "https://www.metacritic.com/game/pc/no-time-to-explain", "publisher": "tiny Build GAMES", "release_date": "Aug 15 2011", "developers": ["tiny Build GAMES", "tinyBuild"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/553e9c89089df2cf013b61a5d862869f-98.jpg", "descriptions": "No Time To Explain is an action platformer by indie developer tiny Build GAMES."}, {"name": "Die Hard: Vendetta", "details_link": "https://www.metacritic.com/game/gamecube/die-hard-vendetta", "publisher": "Sierra Entertainment", "release_date": "Nov 19 2002", "developers": ["Bits Studios"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 54, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/734e783abfeb00dc43359ed081ac66ff-98.jpg", "descriptions": "In Die Hard: Vendetta, tactics and stealth are just as important as having a big gun and being a quick shot. The story picks up five years after the movie Die Hard With a Vengeance, and you play as LA cop John McClane. Your daughter, now a full-grown woman on the police force, finds herselfIn Die Hard: Vendetta, tactics and stealth are just as important as having a big gun and being a quick shot. The story picks up five years after the movie Die Hard With a Vengeance, and you play as LA cop John McClane. Your daughter, now a full-grown woman on the police force, finds herself in danger, and it's up to you to save her. In your investigation, you'll meet old friends, uncover helpful clues, and solve objectives--all while using stealth or an arsenal of weaponry to move past enemies.… Expand"}, {"name": "Minority Report: Everybody Runs", "details_link": "https://www.metacritic.com/game/game-boy-advance/minority-report-everybody-runs", "publisher": "Activision", "release_date": "Nov 12 2002", "developers": ["Torus Games"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/70fc788ded9e8572ac58d482e90e62b7-98.jpg", "descriptions": "The year is 2054 and you are Precrime Officer John Anderton, head of an elite police force division that can apprehend murderers before the crime can be committed. Everyone thought the system was perfect, until a precrime report lists you as the prime suspect. Now, you're on the run throughThe year is 2054 and you are Precrime Officer John Anderton, head of an elite police force division that can apprehend murderers before the crime can be committed. Everyone thought the system was perfect, until a precrime report lists you as the prime suspect. Now, you're on the run through 40 futuristic levels filled with both human and robot enemies in a mission to clear your name. With an arsenal of weapons, hand-to-hand combat skills, and a Jetpack that allows you to fly through levels, it's up to you to stop an evil conspiracy before it's too late. … Expand"}, {"name": "Die Hard: Nakatomi Plaza", "details_link": "https://www.metacritic.com/game/pc/die-hard-nakatomi-plaza", "publisher": "Sierra Entertainment", "release_date": "Apr 22 2002", "developers": ["Piranha Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 54, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/668a5f618a008c854a38f684ede743e1-98.jpg", "descriptions": "John McClane, a brash New York cop, is in Los Angeles to reconcile with his estranged wife. Arriving at her company Christmas party high atop the Nakatomi Plaza, his efforts are interrupted when a group of highly trained, highly armed professional thieves seize the skyscraper as part of aJohn McClane, a brash New York cop, is in Los Angeles to reconcile with his estranged wife. Arriving at her company Christmas party high atop the Nakatomi Plaza, his efforts are interrupted when a group of highly trained, highly armed professional thieves seize the skyscraper as part of a daring heist. This plan is flawless except they didn't count on you... the fly in the ointment, the monkey in the wrench... you are John McClane - jetlagged, barefoot, and out of your jurisdiction. Over 30 single-player levels -- explore 40 floors of the Nakatomi Plaza, inspired by the building featured in the Die Hard movie. [Sierra]… Expand"}, {"name": "NCAA March Madness 2002", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-march-madness-2002", "publisher": "EA Sports", "release_date": "Jan  7 2002", "developers": ["NuFX"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 54, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/9/eb9646c4aa7f7ebf26e7bf34390c82f7-98.jpg", "descriptions": "Get scouting tips from coaches like Florida's Billy Donovan, Kansas' Roy Williams, and UCLA's Steve Lavin; New Emotion Meter lets big plays and crowd energy affect how you perform; New courts include fieldhouse and stadiums; Use one of over 130 real teams or create your own. [EA Sports]"}, {"name": "World's Scariest Police Chases", "details_link": "https://www.metacritic.com/game/playstation/worlds-scariest-police-chases", "publisher": "Activision", "release_date": "May 21 2001", "developers": ["UDS"], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 54, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/330a3381662f9bbddbfb19ec3b1e2766-98.jpg", "descriptions": "Did you play cops-n-robbers as a child? Based on Fox Broadcasting's anthology TV series of high-speed pursuit highlights, World's Scariest Police Chases puts you in the driver's seat of a powerful police cruiser in 20 crime-busting missions. You'll be on the lookout for an array of illegalDid you play cops-n-robbers as a child? Based on Fox Broadcasting's anthology TV series of high-speed pursuit highlights, World's Scariest Police Chases puts you in the driver's seat of a powerful police cruiser in 20 crime-busting missions. You'll be on the lookout for an array of illegal activity, including drunk drivers, robberies in progress and deadly shootouts. Once engaged, you'll pursue suspects through a dynamic city by taking shortcuts and using aggressive tactics as necessary to apprehend them. Two-player mode lets you roll with a partner; one handles the car while the other fires shots at fleeing vehicles.… Expand"}, {"name": "Vancouver 2010 - The Official Video Game of the Olympic Winter Games", "details_link": "https://www.metacritic.com/game/xbox-360/vancouver-2010---the-official-video-game-of-the-olympic-winter-games", "publisher": "Sega", "release_date": "Jan 12 2010", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 54, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/58248869d0f5c0818e015c590ba20507-98.jpg", "descriptions": "Experience the thrill and adrenaline of the Olympic Winter Games of Vancouver 2010. Carve your way down the slopes and across the ice as you aim to reach the pinnacle of your sport and claim a gold medal for your country. Featuring only the fastest, highest and most spectacular events fromExperience the thrill and adrenaline of the Olympic Winter Games of Vancouver 2010. Carve your way down the slopes and across the ice as you aim to reach the pinnacle of your sport and claim a gold medal for your country. Featuring only the fastest, highest and most spectacular events from the Olympic Winter Games, Vancouver 2010 immerses the player, first person, in the adrenaline, danger and glory of the world’s greatest winter multisport event. Feel the speed and adrenaline of the athletes at the Olympic Winter Games at each Olympic venue; hurtle down mountains, ice runs, over jumps and around ice rinks. 14 Premium events in which to earn gold - Including giant slalom, snowboard cross, downhill and bobsleigh, every event focused on speed or danger, and most on both. Fine tune your skills in a range of challenge modes. Such as 'Smashing the Snowmen' and 'Speed Bands' in a first for this kind of mode in an official Olympic title. Take your snow boots online. Set a new world record and see if anybody can knock you off the top of the leaderboard. Defeat your friends online or in the front room. Earn the ultimate bragging rights in up to 4 player split-screen action, or in online head-to-head competition. [Sega]… Expand"}, {"name": "Stubbs the Zombie in Rebel Without a Pulse", "details_link": "https://www.metacritic.com/game/switch/stubbs-the-zombie-in-rebel-without-a-pulse", "publisher": "Aspyr", "release_date": "Mar 16 2021", "developers": ["Aspyr"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 54, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/b63421eed065abea3a5adfb227fd3983-98.jpg", "descriptions": "Stubbs the Zombie has been disturbed from his eternal rest 50 years after his death, and you can help him get revenge on those that woke him. Roam the city of Punchbowl while using your zombie powers to take control of its inhabitants. You can turn citizens into zombies, possess them, or useStubbs the Zombie has been disturbed from his eternal rest 50 years after his death, and you can help him get revenge on those that woke him. Roam the city of Punchbowl while using your zombie powers to take control of its inhabitants. You can turn citizens into zombies, possess them, or use your other undead abilities in battle. You'll fight civilians, police, and militia on your way to getting your revenge on the city's designer, Andrew Monday. Stubbs the Zombie in Rebel Without a Pulse is a third-person action game that uses an updated version of the Halo game engine.… Expand"}, {"name": "Mega Man: Battle Chip Challenge", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-chip-challenge", "publisher": "Capcom", "release_date": "Mar  3 2004", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-3 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 54, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/aeffc4081d5ebaa6f59a2f15d8f47d9a-98.jpg", "descriptions": "The Mega Man series enters the card-battling arena in Mega Man Battle Chip Challenge.  You'll play a young boy named Lan who owns a unique device known as a \"Net-Navi.\"  The evil WWW organization threatens to disrupt cyberspace and, with the help of your Net-Navi, you must uploadThe Mega Man series enters the card-battling arena in Mega Man Battle Chip Challenge.  You'll play a young boy named Lan who owns a unique device known as a \"Net-Navi.\"  The evil WWW organization threatens to disrupt cyberspace and, with the help of your Net-Navi, you must upload Mega Man--armed with destructive viruses--into the system.  Your weapons consist of battle cards and chips, which you can power up.  The ultimate battle for Net Domination begins as you fight your way to the Battle Chip Grand Prix solo or compete with up to two players via the Game Link cable.  … Expand"}, {"name": "Fallen Legion: Revenants", "details_link": "https://www.metacritic.com/game/playstation-4/fallen-legion-revenants", "publisher": "NIS America", "release_date": "Feb 16 2021", "developers": ["YummyYummyTummy"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Japanese-Style"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/b2f03c694d24304931de21defc10cbd8-98.jpg", "descriptions": "In a world covered in miasma, a floating castle is the last refuge for mankind. The earth is scarred with creatures altered by the plague while Welkin Castle is isolated in the sky from the horrors below. Lucien, a charismatic politician protected within the castle’s walls, discovers anIn a world covered in miasma, a floating castle is the last refuge for mankind. The earth is scarred with creatures altered by the plague while Welkin Castle is isolated in the sky from the horrors below. Lucien, a charismatic politician protected within the castle’s walls, discovers an ancient book where he learns of the Exemplars, weapons that can turn into sentient soldiers. He joins forces with Rowena, a revenant determined to find a way to come back to life to raise her living son, and the two reluctantly make a pact to overthrow the mad tyrant controlling Welkin.… Expand"}, {"name": "The Great Perhaps", "details_link": "https://www.metacritic.com/game/pc/the-great-perhaps", "publisher": "Daedalic Entertainment", "release_date": "Aug 14 2019", "developers": ["Caligari Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/fb44048bc0d315216a699f16f7e59239-98.jpg", "descriptions": "The Great Perhaps is a time travel puzzle game about an astronaut returning to Earth destroyed by natural cataclysms. There, among the ruins he finds an unusual artifact — an old lantern, in the light of which you can see glimpses of another time and travel to the past."}, {"name": "Despicable Me: The Game - Minion Mayhem", "details_link": "https://www.metacritic.com/game/ds/despicable-me-the-game---minion-mayhem", "publisher": "D3Publisher", "release_date": "Jul  6 2010", "developers": ["WayForward"], "platforms": "DS", "genres": ["Action", "Miscellaneous", "Puzzle", "General", "Puzzle", "Platformer", "Action", "2D"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/499a0df40dbbbf4770361464e6dc47e5-98.jpg", "descriptions": "Be Despicable! Despicable Me: The Game lets players of all ages experience the thrill of being Gru, one of the world’s greatest supervillains who is planning the biggest heist in history – stealing the moon. Complete heists and missions in a unique blend of action and puzzle solving thatBe Despicable! Despicable Me: The Game lets players of all ages experience the thrill of being Gru, one of the world’s greatest supervillains who is planning the biggest heist in history – stealing the moon. Complete heists and missions in a unique blend of action and puzzle solving that combines the fun of commanding minions and using an arsenal of Despicable gadgets and weapons. [D3Publisher]… Expand"}, {"name": "Scene It? Bright Lights! Big Screen!", "details_link": "https://www.metacritic.com/game/wii/scene-it-bright-lights!-big-screen!", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 17 2009", "developers": ["Artificial Mind and Movement"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/3ad9672b6ff1780f3336c159a588b896-98.jpg", "descriptions": "Scene It? Bright Lights! Big Screen! allows players to battle it out in a quiz containing movie trivia from the past four decades."}, {"name": "Jurassic Park: The Game", "details_link": "https://www.metacritic.com/game/pc/jurassic-park-the-game", "publisher": "Telltale Games", "release_date": "Nov 15 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel", "Point-and-Click"], "meta_score": 54, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/2f1ea5742d4c624fef0abab4120d2181-98.jpg", "descriptions": "Telltale Games, the studio behind Tales of Monkey Island and the Sam & Max episodes, turns Spielberg's classic dinosaur movie Jurassic Park into an episodic adventure."}, {"name": "Marvel Nemesis: Rise of the Imperfects", "details_link": "https://www.metacritic.com/game/gamecube/marvel-nemesis-rise-of-the-imperfects", "publisher": "EA Games", "release_date": "Sep 20 2005", "developers": ["EA Canada", "Nihilistic"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 54, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/9742d50c23f22e3c56f095ac8d7e4a7e-98.jpg", "descriptions": "Marvel Nemesis: Rise of the Imperfects pits fierce Marvel superheroes against each other in a 3D fighting game. You can assume control of heroes such as the Punisher, Spider-Man, and Captain America, and duel with them in interactive and destructible environments. A new team of superheroesMarvel Nemesis: Rise of the Imperfects pits fierce Marvel superheroes against each other in a 3D fighting game. You can assume control of heroes such as the Punisher, Spider-Man, and Captain America, and duel with them in interactive and destructible environments. A new team of superheroes called the Imperfects joins the mayhem. You can play in single-player story mode to unlock hundreds of collectible awards, or you can play against other gamers in offline or online play.… Expand"}, {"name": "Spirit Camera: The Cursed Memoir", "details_link": "https://www.metacritic.com/game/3ds/spirit-camera-the-cursed-memoir", "publisher": "Nintendo", "release_date": "Apr 13 2012", "developers": ["Tecmo Koei Games"], "platforms": "3DS", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 54, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/b01fe36922c7e8152dc0fdb63507aa89-98.jpg", "descriptions": "Spirit Camera: The Cursed Memoir introduces a mysterious girl named Maya who has been hiding in the shadows of an old house. Players must help Maya break free from a terrifying curse by aiding her escape from the clutches of a malevolent woman in black. By using the Nintendo 3DS system’sSpirit Camera: The Cursed Memoir introduces a mysterious girl named Maya who has been hiding in the shadows of an old house. Players must help Maya break free from a terrifying curse by aiding her escape from the clutches of a malevolent woman in black. By using the Nintendo 3DS system’s built-in camera, players can view Maya in their own surroundings as the game’s eerie events unfold.… Expand"}, {"name": "Sonic Unleashed", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-unleashed", "publisher": "Sega", "release_date": "Dec  9 2008", "developers": ["Sonic Team"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action", "General", "Platformer", "2D", "3D"], "meta_score": 54, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/e1f6a4287407b2f3fc516514d4091197-98.jpg", "descriptions": "Having been broken apart by the evil Dr. Eggman, it's up to Sonic to put the pieces of the world back together again by retrieving the power of the chaos emeralds! In doing so, Sonic finds himself in a race against time and faced with an unusual situation that challenge hims in ways neverHaving been broken apart by the evil Dr. Eggman, it's up to Sonic to put the pieces of the world back together again by retrieving the power of the chaos emeralds! In doing so, Sonic finds himself in a race against time and faced with an unusual situation that challenge hims in ways never before seen. Both day and night play different, yet important, roles in Sonic's newest quest... as the sun sets, a new adventure awakens. By completing a wide variety of action-packed stages, spanning the seven broken continents of the world, gamers unleash Sonic’s amazing abilities to save the world, and himself! In addition to running at high speeds, which is highlighted in four new speed mechanics, combat fighting now becomes possible. New combat, movement, functional abilities and platforming are introduced to offer increased depth and variety. Sonic Unleashed offers a re-defined experience for fans and newcomers of the franchise alike by combing picturesque & detailed scenery, an expansive world with multiple paths to choose from and dynamic viewpoints for an immersive and renewed gaming atmosphere. Along with seamless 3D to classic 2D camera transitions, the game is built on a powerful, new proprietary \"Hedgehog Engine,\" which introduces impressive lighting abilities and new technology tailor made for Sonic’s new speed capabilities. [Sega]… Expand"}, {"name": "Tom Clancy's Ghost Recon Predator", "details_link": "https://www.metacritic.com/game/psp/tom-clancys-ghost-recon-predator", "publisher": "Ubisoft", "release_date": "Nov 15 2010", "developers": ["Virtuos"], "platforms": "PSP", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 54, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/fb60d91a97aeecc735b87b4dbc47601e-98.jpg", "descriptions": "Deep in the jungles of Sri Lanka, the Ghosts have 72 hours to prepare the way for a U.S. invasion force. As open conflict with Pakistan looms, the Ghosts uncover proof that theyâ€™ve been targeting the wrong enemy. Now they must act before falsified intelligence lures America into anDeep in the jungles of Sri Lanka, the Ghosts have 72 hours to prepare the way for a U.S. invasion force. As open conflict with Pakistan looms, the Ghosts uncover proof that theyâ€™ve been targeting the wrong enemy. Now they must act before falsified intelligence lures America into an unpredictable and devastating war.… Expand"}, {"name": "Yoostar 2: In The Movies", "details_link": "https://www.metacritic.com/game/playstation-3/yoostar-2-in-the-movies", "publisher": "Yoostar Entertainment Group", "release_date": "Mar  8 2011", "developers": ["Blitz Games Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/effa195a51db2e6b0c4b7dfb1bfc51ab-98.jpg", "descriptions": "Yoostar2 Combines The Power Of New Console Platforms, Top Hollywood Movies And The Burgeoning Social Media Phenomenon Monday 14th June/... Everyone now has the opportunity to become a global movie star with Yoostar2. In an instant you can step into the shoes of famous characters fromYoostar2 Combines The Power Of New Console Platforms, Top Hollywood Movies And The Burgeoning Social Media Phenomenon Monday 14th June/... Everyone now has the opportunity to become a global movie star with Yoostar2. In an instant you can step into the shoes of famous characters from hundreds of movies, play out the part and then share your performance with the world.… Expand"}, {"name": "Atlantis Evolution", "details_link": "https://www.metacritic.com/game/pc/atlantis-evolution", "publisher": "The Adventure Company", "release_date": "Oct 17 2004", "developers": ["Atlantis Interactive Entertainment\t", "Atlantis Interactive Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Sci-Fi", "Sci-Fi", "Third-Person"], "meta_score": 54, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/0/a5e8008324593e798d81c741520920aa-98.jpg", "descriptions": "1904. On his way back to New York, Curtis Quick, a young adventurer and photographer, is caught in a vortex that sends him to the heart of the lost city of Atlantis...A stranger in a land of hi-tech and archaic faith, Curtis endures thrilling adventure helping the people of Atlantis1904. On his way back to New York, Curtis Quick, a young adventurer and photographer, is caught in a vortex that sends him to the heart of the lost city of Atlantis...A stranger in a land of hi-tech and archaic faith, Curtis endures thrilling adventure helping the people of Atlantis overthrow the mighty 'Atlantian' Gods. Features spectacular award winning full-screen 3D graphics, 5 fascinating destinations to explore, each with its own culture and mysteries, many diverse challenging puzzles and games, and a beautiful and captivating original soundtrack. [DreamCatcher Interactive]… Expand"}, {"name": "Nippon Marathon", "details_link": "https://www.metacritic.com/game/playstation-4/nippon-marathon", "publisher": "PQube", "release_date": "Dec 17 2018", "developers": ["Onion Soup"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Athletics"], "meta_score": 54, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/8/1497e1dc36d903869464611c28f777ea-98.jpg", "descriptions": "Stretch your muscles and embark upon the ultimate marathon of Japan in a crazy party racer. Hurdle barrels, outrun Shiba Inu and dive out of the paths of bicycles – all while throwing fruit at your opponents and dashing across planks precariously balanced over waterfalls across Japan."}, {"name": "In Space We Brawl", "details_link": "https://www.metacritic.com/game/playstation-4/in-space-we-brawl", "publisher": "Forge Reply", "release_date": "Oct 14 2014", "developers": ["Forge Reply"], "platforms": ["PC", "PlayStation 3", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 54, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/08f65c5f6f60f6b653b41f2fcea9f898-98.jpg", "descriptions": "In Space We Brawl is a local multiplayer, twin stick shooter."}, {"name": "Achron", "details_link": "https://www.metacritic.com/game/pc/achron", "publisher": "Hazardous Software", "release_date": "Aug 29 2011", "developers": ["Hazardous Software"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 54, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/ce2757b98bd320a022d632a40606a84f-98.jpg", "descriptions": "How would combat change if you could foresee the future? If you could prevent your past mistakes from ever happening? What if your enemy could too? Achron is the first game to feature single-player and multiplayer free-form time travel. It is the world's first meta-time strategy game, aHow would combat change if you could foresee the future? If you could prevent your past mistakes from ever happening? What if your enemy could too? Achron is the first game to feature single-player and multiplayer free-form time travel. It is the world's first meta-time strategy game, a real-time strategy game where players and units can jump to and play at different times simultaneously and independently. You can undo your mistakes, change your strategy after committing to it, preview the future, freeze time to perfectly coordinate attacks, and send entire fleets through time to when they are needed. However, all of your opponents will also be independently moving across time, attempting to rewrite history in their favor... … Expand"}, {"name": "Crime Scene", "details_link": "https://www.metacritic.com/game/ds/crime-scene", "publisher": "SouthPeak Games", "release_date": "Feb 16 2010", "developers": ["White Birds Productions"], "platforms": "DS", "genres": ["Adventure", "General", "General"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/d7730cb5233f34200d19584e748239de-98.jpg", "descriptions": "Matt Simmons is a fresh recruit as a forensic detective in the police force. Hitting the ground running, Matt is faced with his first case: the horrific double-murder of a fellow detective and his wife. Using his arsenal of advanced forensic technology, Matt must comb the crime scene,Matt Simmons is a fresh recruit as a forensic detective in the police force. Hitting the ground running, Matt is faced with his first case: the horrific double-murder of a fellow detective and his wife. Using his arsenal of advanced forensic technology, Matt must comb the crime scene, picking up clues and trying to piece together what happened. In this thrilling mystery adventure, you'll help Matt unravel the clues in intriguing murder mysteries and clean up the town in a corrupt city where justice is a rare event. [SouthPeak Games]… Expand"}, {"name": "Night at the Museum: Battle of the Smithsonian", "details_link": "https://www.metacritic.com/game/wii/night-at-the-museum-battle-of-the-smithsonian", "publisher": "Majesco Games", "release_date": "May  5 2009", "developers": ["Pipeworks Software", "Inc."], "platforms": ["Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "General", "General", "3D", "Linear", "First-Person"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/4df27abdabf82410610236579ea9f6c6-98.jpg", "descriptions": "Get ready for a story so epic it could only unfold in the corridors of the world's largest museum--the Smithsonian Institution. Museum guard-turned entrepreneur Larry Daley discovers that his favorite exhibits, and some of his best friends, from New York's Natural History Museum are beingGet ready for a story so epic it could only unfold in the corridors of the world's largest museum--the Smithsonian Institution. Museum guard-turned entrepreneur Larry Daley discovers that his favorite exhibits, and some of his best friends, from New York's Natural History Museum are being shipped off to the archives at the Smithsonian.  Larry gets a distress call from the miniature cowboy, Jedediah, reporting that Egyptian ruler Kahmunrah and a trio of heinous henchmen--namely Ivan the Terrible, Napoleon and Al Capone--are plotting to take over the museum, then the world.  Speeding to the nation's capitol, Larry is clearly in over his head.  But with some impressive new pals, including the irrepressible Amelia Earhart, along with familiar friends Teddy Roosevelt and Octavius, Larry will stop at nothing to restore the Smithsonian before dawn. [Majesco]… Expand"}, {"name": "Dream Pinball 3D", "details_link": "https://www.metacritic.com/game/wii/dream-pinball-3d", "publisher": "SouthPeak Games", "release_date": "Apr 22 2008", "developers": ["TopWare Interactive"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 54, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/ad3b4ab73ef158309ff7bf08aaaa8039-98.jpg", "descriptions": "There are six different style balls, made of different materials, that not only look different, but whose ballistic characteristics will affect the very rolling behaviour of each one of them. Add to that incredible acoustics, state of the art particle technology, HDRI and multilayer 3DThere are six different style balls, made of different materials, that not only look different, but whose ballistic characteristics will affect the very rolling behaviour of each one of them. Add to that incredible acoustics, state of the art particle technology, HDRI and multilayer 3D sound, and realistic tilt function and motion blur effects. [SouthPeak Interactive]… Expand"}, {"name": "Gods: Lands of Infinity", "details_link": "https://www.metacritic.com/game/pc/gods-lands-of-infinity", "publisher": "Strategy First", "release_date": "Jun 10 2006", "developers": ["Cypron Studios"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/76c12eb22d5c3ad9df4298d4717a5be8-98.jpg", "descriptions": "Ancient world of Bellarion struggles in the neverending war of Gods. Conflict has aroused when Xarax, ruler of Gods of Bellarion, was murdered. Each of the remaining Gods claimed the right for the Divine Throne. After many quarrels, they all agreed that they should arrange the UltimateAncient world of Bellarion struggles in the neverending war of Gods. Conflict has aroused when Xarax, ruler of Gods of Bellarion, was murdered. Each of the remaining Gods claimed the right for the Divine Throne. After many quarrels, they all agreed that they should arrange the Ultimate Challenge in which all the Gods would cross their powers to show who is the most powerful to rule them all. But the Gods who failed were still not willing to submit to the winner. They summoned their armies and attacked the worshipers of other Gods. By the deaths of their worshipers, Gods lost part of their power and weakened. This deed could not have been left without reply. [Cypron Studios]… Expand"}, {"name": "Tom Clancy's Rainbow Six Critical Hour", "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-rainbow-six-critical-hour", "publisher": "Ubisoft", "release_date": "Mar 14 2006", "developers": ["Ubisoft Quebec"], "platforms": "Xbox", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 54, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/5/4d4dd0ab830b03c8216b7a2c3fbe1d00-98.jpg", "descriptions": "This latest chapter marks the return to the franchise's roots by reintroducing the deeply strategic and tactical gameplay synonymous with the Rainbow Six name, while incorporating classic in-game elements such as vintage maps and weapons, all rebuilt using today's technology. Rainbow SixThis latest chapter marks the return to the franchise's roots by reintroducing the deeply strategic and tactical gameplay synonymous with the Rainbow Six name, while incorporating classic in-game elements such as vintage maps and weapons, all rebuilt using today's technology. Rainbow Six Critical Hour's storyline bids on nostalgia as John Clark retires and passes the torch to Ding Chavez. Chosen by fans, eight single-player missions from the original Rainbow Six and Rogue Spear games return, revamped with today's technology. Return to tactical gameplay: Through slower pacing and an enhanced combat model, strategic planning is the central element of gameplay. Advanced combat model: Choose your steps wisely as your actions could mean the difference between life and death. Weapon accuracy is affected by in-game maneuvers and events such as running, crouching, standing still or firing while injured. Rainbow Six Critical Hour comes equipped with a superior multiplayer experience, including the revolutionary Persistent Elite Creation (P.E.C.) mode, as well as the new and innovative Assassin and Free-for-All modes. Close-quarter battles: Maps in narrow corridors with non-linear level design challenge even the most tactical of gamers, increasing the importance of the infamous one-shot kill. From Idaho to Venice, Mexico City to Siberia, team Rainbow travels the world to serve and protect the innocent from terrorist threats.… Expand"}, {"name": "Reign of Fire", "details_link": "https://www.metacritic.com/game/xbox/reign-of-fire", "publisher": "Bam Entertainment", "release_date": "Oct 22 2002", "developers": ["Bam Entertainment"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/0e09bc7b3d1dc71fef3db5afd69e6ced-98.jpg", "descriptions": "Based on the movie, Reign of Fire lets you play as either a human or a dragon in an epic battle. As a human, you'll take the role of a resistance fighter who's trying to defend the last remaining humans from attack. You must make your way to the site of the sole male dragon using a varietyBased on the movie, Reign of Fire lets you play as either a human or a dragon in an epic battle. As a human, you'll take the role of a resistance fighter who's trying to defend the last remaining humans from attack. You must make your way to the site of the sole male dragon using a variety of well-equipped vehicles and high-tech weaponry. As a dragon, you'll take the role of an infant, led by instinct to attack foes, and you'll attempt to eradicate the human race. With your natural fire-breathing and flying abilities, you can destroy everything on the ground or in the skies.… Expand"}, {"name": "Space HoRSE", "details_link": "https://www.metacritic.com/game/pc/space-horse", "publisher": "Shrapnel Games", "release_date": "Aug  1 2002", "developers": ["Gilligames"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Sci-Fi"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/96ade4dc9e933bf412977df71b832206-98.jpg", "descriptions": "A great depression rages across the galaxy. All around, piracy is rampant - an honest buck is rarely made. Equipped with your life savings, you depart for an uncolonized planet in deep space, with the hopes of a fresh start and an honest living..."}, {"name": "Star Wars: Battle for Naboo", "details_link": "https://www.metacritic.com/game/pc/star-wars-battle-for-naboo", "publisher": "LucasArts", "release_date": "Mar 11 2001", "developers": ["LucasArts", "Factor 5"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Combat"], "meta_score": 54, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/a18b766a7d8dbf7e857048a2782dd333-98.jpg", "descriptions": "Prepare to clash with Trade Federation battle droids, droid starfighters, battle tanks, and other enemies while progressing through 15 immersive levels of this original story line. Released to critical acclaim on the Nintendo 64, Battle For Naboo for PC features enhanced game resolution,Prepare to clash with Trade Federation battle droids, droid starfighters, battle tanks, and other enemies while progressing through 15 immersive levels of this original story line. Released to critical acclaim on the Nintendo 64, Battle For Naboo for PC features enhanced game resolution, textures, and a new interface.  [LucasArts]… Expand"}, {"name": "NBA ShootOut 2001", "details_link": "https://www.metacritic.com/game/playstation-2/nba-shootout-2001", "publisher": "SCEA", "release_date": "Feb 19 2001", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/518cf7feccb0ea252b2ebec6167b5361-98.jpg", "descriptions": "Fast, furious, authentic NBA action!\r989 Sports' long-running b-baller makes its debut on the PlayStation 2 with live presentation unmatched on the system. The players sport thousands of motion-captured moves, and over a hundred hours of play-by-play were logged in the production.Fast, furious, authentic NBA action!\r989 Sports' long-running b-baller makes its debut on the PlayStation 2 with live presentation unmatched on the system. The players sport thousands of motion-captured moves, and over a hundred hours of play-by-play were logged in the production. Everything in the stadium is modeled as closely as possible, from the detailed players to the real coaches on the sidelines to the people in the stands. ShootOut also brings back the Create Dunk feature, and refines the game's Touch Shooting and Passing control. As always, your choice is going to be a tough one between LIVE and ShootOut, and in the 2k1 basketball season, each has taken a shot at the game of basketball from a different angle. Check which fits your style.\rAuthentic players, animations, and arenas make this game so realistic you'll need high tops and wrist bands to play. It's got a new and improved game engine, redesigned player controls, and a TV-style presentation that has been edited to include more camera angles, close-ups, zooms, and cut-aways. Team-specific playbooks have more than 450 plays designed with the NBA elite. With the enhancements made to the Match-Up & Deny, Read & React A.I., no artificial intelligence has ever been more savvy. This year the road to the NBA Finals begins and ends with an NBA ShootOut.… Expand"}, {"name": "Army of Two: The Devil's Cartel", "details_link": "https://www.metacritic.com/game/xbox-360/army-of-two-the-devils-cartel", "publisher": "Electronic Arts", "release_date": "Mar 26 2013", "developers": ["Visceral Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 54, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/37f4dd03824e1dcadf79c2126099810e-98.jpg", "descriptions": "Army of Two The Devil’s Cartel is third-person co-op action-shooter that utilizes the new Frostbite 2 engine for maximum destruction. You and your partner have to shoot and destroy everything in your path to bring down a violent drug cartel that’s taken control of Mexico. In partner-basedArmy of Two The Devil’s Cartel is third-person co-op action-shooter that utilizes the new Frostbite 2 engine for maximum destruction. You and your partner have to shoot and destroy everything in your path to bring down a violent drug cartel that’s taken control of Mexico. In partner-based missions, each player has to take on and meet individual objectives to achieve a common goal. The more effective your teamwork, the greater your reward as the new Overkill mode thrusts devastating power upon you for truly grandiose mass destruction. Play in 2-player local split-screen or online co-op.… Expand"}, {"name": "The Lord of the Rings: Conquest", "details_link": "https://www.metacritic.com/game/playstation-3/the-lord-of-the-rings-conquest", "publisher": "Electronic Arts", "release_date": "Jan 13 2009", "developers": ["Pandemic Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "16  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 54, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/8da4d1f355f7ed31a2d9a9abec6fda5b-98.jpg", "descriptions": "For the first time, play as Evil characters in a brand new, 'Evil' campaign. Battle through scenarios after Frodo failed to destroy the One Ring; it’s good to be bad. Acclaimed Battlefront gameplay in a fantasy setting allows players to choose the way they fight, as Warrior, Archer, Mage orFor the first time, play as Evil characters in a brand new, 'Evil' campaign. Battle through scenarios after Frodo failed to destroy the One Ring; it’s good to be bad. Acclaimed Battlefront gameplay in a fantasy setting allows players to choose the way they fight, as Warrior, Archer, Mage or Scout in melee and ranged combat. Online multiplayer - pick your allegiance then battle in 16-player online clashes, or in 4-player co-op campaigns. Local multiplayer - split-screen with up to 4 players competitively or 2 player co-op. A massive cast of characters & weapons adds great depth to the gameplay: Heroes, Wargs, Ents, Oliphaunts, Cave-trolls, the Balrog, Nazgul, ballistae, and more. [Electronic Arts]… Expand"}, {"name": "Crackdown 3", "details_link": "https://www.metacritic.com/game/pc/crackdown-3", "publisher": "Microsoft Game Studios", "release_date": "Feb 15 2019", "developers": ["Sumo Digital", "Elbow Rocket"], "platforms": ["Xbox One", "PC"], "num_players": "Up to 10 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 54, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/3/b3829b681b728473b4c3b99eb2605666-98.jpg", "descriptions": "From out of nowhere, a new enemy attacked. Major metropolitan areas were hit with a never-before-seen form of elemental warfare, plunged into darkness and chaos. In the aftermath, the Agency picked-up a hot lead -- and now they'll stop at nothing to find the ones who knocked us down, toFrom out of nowhere, a new enemy attacked. Major metropolitan areas were hit with a never-before-seen form of elemental warfare, plunged into darkness and chaos. In the aftermath, the Agency picked-up a hot lead -- and now they'll stop at nothing to find the ones who knocked us down, to deliver a harsh dose of Justice… by any means necessary. … Expand"}, {"name": "Breached", "details_link": "https://www.metacritic.com/game/pc/breached", "publisher": "Nkidu Games Inc.", "release_date": "Jun 22 2016", "developers": ["Drama Drifters"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/c07d0082b059fba86882eb2215fe5524-98.jpg", "descriptions": "Breached is a sci-fi story with data stalking, drone flights and resource scavenging. The year is 2245. Being urgently awakened from hibernation, you find only desert around. Your shelter damaged, oxygen is low. Lifesaving system reserve: 8 days. Explore the desert, dig into broken data, fixBreached is a sci-fi story with data stalking, drone flights and resource scavenging. The year is 2245. Being urgently awakened from hibernation, you find only desert around. Your shelter damaged, oxygen is low. Lifesaving system reserve: 8 days. Explore the desert, dig into broken data, fix your shelter.… Expand"}, {"name": "Shaman King: Power of Spirit", "details_link": "https://www.metacritic.com/game/playstation-2/shaman-king-power-of-spirit", "publisher": "Konami", "release_date": "Nov  9 2004", "developers": ["WinkySoft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 54, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/a35cefc23a110966464cd0a969e9c8dc-98.jpg", "descriptions": "Shaman King follows the story of Yoh Asakura who might look like an average student, but behind his laid-back appearance, he holds an amazing secret. Yoh is a shaman, one of the chosen few who can communicate with ghosts and spirits. When Yoh teams up with the ghost, Amidamaru, he begins hisShaman King follows the story of Yoh Asakura who might look like an average student, but behind his laid-back appearance, he holds an amazing secret. Yoh is a shaman, one of the chosen few who can communicate with ghosts and spirits. When Yoh teams up with the ghost, Amidamaru, he begins his incredible quest to be crowned Shaman King in the Grand Tournament held only once every 500 years! Shaman King blends the elements of strategy, battling and role-playing games to deliver an exciting gameplay experience for players of all ages. Gamers will battle against numerous enemies and a nefarious organization that plans to stop the Grand Tournament from taking place. [Konami]… Expand"}, {"name": "GUNS UP!", "details_link": "https://www.metacritic.com/game/playstation-4/guns-up!", "publisher": "SCEA", "release_date": "Dec  5 2015", "developers": ["Valkyrie Entertainment"], "platforms": "PlayStation 4", "genres": ["Action", "Strategy", "Real-Time", "General"], "meta_score": 54, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/3d64c0e34e1ec8aed77bb958c04c455c-98.jpg", "descriptions": "In this side-scrolling strategy game, players take on the role of a General, managing resources and deploying the right combination of troops, land mines, air strikes, smoke screens, and sniper towers to topple their opponents’ bases. With Cross-Play, Generals can fine-tune their strategyIn this side-scrolling strategy game, players take on the role of a General, managing resources and deploying the right combination of troops, land mines, air strikes, smoke screens, and sniper towers to topple their opponents’ bases. With Cross-Play, Generals can fine-tune their strategy against opponents with turn-based asynchronous gameplay across the PlayStation 4, PlayStation 3 and PlayStation Vita systems.… Expand"}, {"name": "Dynasty Warriors: Gundam 2", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-gundam-2", "publisher": "Namco Bandai Games America", "release_date": "Apr 21 2009", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/f91f4133e9129b7220dccd430d5f0ff1-98.jpg", "descriptions": "In the future, rebel space colonies launch a brutal war of independence with a series of coordinated orbital strikes against Earth. The chaotic assault signals the dawn of a new age of combat and the ultimate instrument of warfare is born, the Mobile Suit. Dynasty Warriors: Gundam 2 combinesIn the future, rebel space colonies launch a brutal war of independence with a series of coordinated orbital strikes against Earth. The chaotic assault signals the dawn of a new age of combat and the ultimate instrument of warfare is born, the Mobile Suit. Dynasty Warriors: Gundam 2 combines the devastating power of the Mobile Suit, the rich legacy of the Gundam universe and the furious Tactical Action game play of the Dynasty Warriors series. The game thrusts players into incredible battles against legions of enemy Mobile Suits on distant planetary surfaces and in the far reaches of outer space. For the first time, Dynasty Warriors: Gundam 2 lets players engage in melee battles against colossal enemies such as the Psycho Gundam. The massive Psycho Gundam can quickly reconfigure their bodies into titanic mobile fortresses which can move with remarkable speed. However, highly-trained pilots can utilize their own Mobile Suit’s speed, agility, and of course firepower to defeat these deadly juggernauts. Dynasty Warriors: Gundam 2 also includes new stories featuring mecha from the latest Gundam anime, plus mecha from Char’s Counter Attack and more. With mecha parts collected throughout the course of the game, players can adapt a Mobile Suit which can be piloted into combat. [Namco Bandai Games]… Expand"}, {"name": "Disney/Pixar Cars Race-O-Rama", "details_link": "https://www.metacritic.com/game/xbox-360/disneypixar-cars-race-o-rama", "publisher": "THQ", "release_date": "Oct 12 2009", "developers": ["Incinerator Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 54, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/5d9108409d3e7d8ffb38f540e87048dc-98.jpg", "descriptions": "In Cars Race-O-Rama, players join Lightning McQueen and Chick Hicks in Radiator Springs as they prepare their academy of student racers to compete in the Race-O-Rama Exhibition. Players encounter 12 new playable characters making their video game debut. A new and improved Lightning McQueenIn Cars Race-O-Rama, players join Lightning McQueen and Chick Hicks in Radiator Springs as they prepare their academy of student racers to compete in the Race-O-Rama Exhibition. Players encounter 12 new playable characters making their video game debut. A new and improved Lightning McQueen comes fully equipped with special racing kits, allowing him to better maneuver brand new, action-packed tracks that takes players to metro city streets, the Baja desert and sandy beaches. In addition, players are now able to modify Lightning McQueen’s wheels, rims, hood, side skirt, rear bumper, spoiler and paint with special customization features, giving Lightning a personalized style and look that has never been seen before. As players compete in this high-speed, racing adventure game, they can utilize Lightning McQueen’s newly designed drifting abilities and perform \"Kachow\" poses for enthusiastic reporters and fans encountered throughout the game. Cars Race-O-Rama also features multiplayer mini-games based on Disney-Pixar’s \"Cars Toons,\" a series of animated shorts that are currently being aired on the Disney Channel. [THQ]… Expand"}, {"name": "The Tales of Bearsworth Manor: Chaotic Conflicts", "details_link": "https://www.metacritic.com/game/wii/the-tales-of-bearsworth-manor-chaotic-conflicts", "publisher": "Square Enix", "release_date": "Jun 21 2010", "developers": ["Square Enix"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/4c836fae4bd07bb58ecae0e00fb7cfd6-98.jpg", "descriptions": "[WiiWare]   A crumbling mansion is home to a most peculiar picture book. Gather your courage and open the door to this odd, unsettling and slightly scary tale. Turn the tide of frantic battles by using the Wii Remote controller to throw animated paper bears into the picture book's unusual[WiiWare]   A crumbling mansion is home to a most peculiar picture book. Gather your courage and open the door to this odd, unsettling and slightly scary tale. Turn the tide of frantic battles by using the Wii Remote controller to throw animated paper bears into the picture book's unusual pages. Use all the tools at your disposal to defend the shining blue jewels found within against Kina, the mysterious young boy residing in the mansion. Thirty exciting and challenging stages await you.… Expand"}, {"name": "Farming Simulator 15", "details_link": "https://www.metacritic.com/game/playstation-4/farming-simulator-15", "publisher": "Focus Home Interactive", "release_date": "May 19 2015", "developers": ["Giants Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 54, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/9a5026459e5155e52391e98b16c9db86-98.jpg", "descriptions": "Develop and manage your own farm across hundreds of acres of land offered by the new Nordic environment, and a renovated North American farm. Utilize and drive authentic machines and farming tools, from over 40 most famous manufacturers, including vehicles for the new activity in FarmingDevelop and manage your own farm across hundreds of acres of land offered by the new Nordic environment, and a renovated North American farm. Utilize and drive authentic machines and farming tools, from over 40 most famous manufacturers, including vehicles for the new activity in Farming Simulator 15: woodcutting.… Expand"}, {"name": "Dead to Rights II", "details_link": "https://www.metacritic.com/game/xbox/dead-to-rights-ii", "publisher": "Namco", "release_date": "Apr 12 2005", "developers": ["Namco"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 54, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Dead to Rights II marks the return of action-hero Jack Slate and his K-9 companion, Shadow. In this sequel, Jack and Shadow find themselves once again in the mean streets of Grant City, ensnared in a labyrinth of crime, corruption, and betrayal. Although he swore he'd never return to theDead to Rights II marks the return of action-hero Jack Slate and his K-9 companion, Shadow. In this sequel, Jack and Shadow find themselves once again in the mean streets of Grant City, ensnared in a labyrinth of crime, corruption, and betrayal. Although he swore he'd never return to the city that left him for dead, the plight of an innocent girl draws Jack back. The game features Hong Kong cinema-style action and new gameplay mechanics such as greater interaction with Shadow, disarm moves, a 360-degree fighting engine, melee weapon battles, and a dramatic spherical slow-motion diving system.… Expand"}, {"name": "The Legend of Korra", "details_link": "https://www.metacritic.com/game/playstation-4/the-legend-of-korra", "publisher": "Activision", "release_date": "Oct 21 2014", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Fantasy", "Linear"], "meta_score": 54, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/523422e00bccfb9e57e2d35db4bd0ae7-98.jpg", "descriptions": "Only one human born every generation, the Avatar, can bend the four elements of nature to their will. The Legend of Korra is a third-person action game that follows the current reincarnation of the Avatar – Korra – a headstrong teenage girl chosen by fate to bring balance to the powers ofOnly one human born every generation, the Avatar, can bend the four elements of nature to their will. The Legend of Korra is a third-person action game that follows the current reincarnation of the Avatar – Korra – a headstrong teenage girl chosen by fate to bring balance to the powers of the world.… Expand"}, {"name": "Top Gun: Hard Lock", "details_link": "https://www.metacritic.com/game/xbox-360/top-gun-hard-lock", "publisher": "505 Games", "release_date": "Mar  6 2012", "developers": ["505 Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 54, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/6/1371d4b54b708714134c7966574d2ff6-98.jpg", "descriptions": "Top Gun: Hard Lock is aerial dog-fighting at jet speeds and tailgating MiGs at Mach 2, while offering a unique \"Hard lock\" mode where players perform air combat maneuvers that deliver an explosively satisfying visual payoff that brings them right into the action. Featuring theTop Gun: Hard Lock is aerial dog-fighting at jet speeds and tailgating MiGs at Mach 2, while offering a unique \"Hard lock\" mode where players perform air combat maneuvers that deliver an explosively satisfying visual payoff that brings them right into the action. Featuring the legendary F-14 Tomcat fighter jet and a number of additional licensed planes and weapons, and more than enough enemy MIGs to turn into smoldering rubble, the game is carefully mixed with just enough nostalgic references to remain true to its action movie roots.… Expand"}, {"name": "Combat Elite: WWII Paratroopers", "details_link": "https://www.metacritic.com/game/playstation-2/combat-elite-wwii-paratroopers", "publisher": "SouthPeak Games", "release_date": "Nov 21 2005", "developers": ["BattleBorne"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Historic"], "meta_score": 54, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/0862ff0527fa3184b5584798c65f0a91-98.jpg", "descriptions": "World War II. June 6, 1944 - D-Day - The downfall of Nazi Germany's occupation of Europe begins with the Allied invasion of France. The campaign is supported by more than 17,000 U.S. and British paratroopers, dropped behind enemy lines prior to the assault on the beaches of Normandy. TheseWorld War II. June 6, 1944 - D-Day - The downfall of Nazi Germany's occupation of Europe begins with the Allied invasion of France. The campaign is supported by more than 17,000 U.S. and British paratroopers, dropped behind enemy lines prior to the assault on the beaches of Normandy. These brave troops pave the way for the Allies by attacking the German forces from inside occupied Europe, fighting their way through enemy territory to thwart the Nazi war machine from within. Their battles lead them through rolling hills, open plains, small farms and war-torn cities throughout France, Holland and Belgium. Eventually some prove themselves worthy of the ultimate challenge: preventing German development of a weapon that could forever change the face of Europe; the atomic bomb. This dangerous mission takes them into the very heart of the Axis; The Fatherland. More than 40 varied and immersive missions that recreate the toughest battles of WWII, including D-Day; Operation Market Garden and the bitter winter defense of Bastogne. Two-player, same screen co-operative gameplay. Rise through the ranks - begin as a Private and through battle experience earn promotions and that allow the customization of characters with new skills and abilities. [Acclaim]… Expand"}, {"name": "Danganronpa S: Ultimate Summer Camp", "details_link": "https://www.metacritic.com/game/switch/danganronpa-s-ultimate-summer-camp", "publisher": "Spike Chunsoft", "release_date": "Dec  3 2021", "developers": ["Spike Chunsoft"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 54, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/228fd45961c91b95370048342e770d0b-98.jpg", "descriptions": "Your favorite Danganronpa characters return for a hope-filled Summer!\r With an all-star dream lineup of characters from each Danganronpa game, gather Hope Fragments at a tropical resort. Explore Jabberwock Island and develop your Dangan characters. Gather money through battle and upgradeYour favorite Danganronpa characters return for a hope-filled Summer!\r With an all-star dream lineup of characters from each Danganronpa game, gather Hope Fragments at a tropical resort. Explore Jabberwock Island and develop your Dangan characters. Gather money through battle and upgrade your equipment, then defeat bosses and move on to the next island!… Expand"}, {"name": "Fighter Destiny 2", "details_link": "https://www.metacritic.com/game/nintendo-64/fighter-destiny-2", "publisher": "SouthPeak Games", "release_date": "Jul 14 2000", "developers": ["Opus"], "platforms": "Nintendo 64", "genres": ["Action", "Fighting", "3D"], "meta_score": 54, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/226a46693c55d6188162150279346070-98.jpg", "descriptions": "Enter the arena and do battle with the toughest, most skilled martial arts experts on the planet. As one of the international fighting elite, you'll vie to become the true authority of hand-to-hand combat. Your destiny awaits. Defeat any of your 11 opponents and gain their abilities. LaunchEnter the arena and do battle with the toughest, most skilled martial arts experts on the planet. As one of the international fighting elite, you'll vie to become the true authority of hand-to-hand combat. Your destiny awaits. Defeat any of your 11 opponents and gain their abilities. Launch 5 different modes of attack, from Training to Record Attack. Adjust scoring, ring sizes and difficulty settings. Compete in points-based martial arts tournaments. Force your opponent to relive defeat in instant replay. Gain new abilities and skills when you face the Master in the Fighter's Arena.… Expand"}, {"name": "Harvest Moon: One World", "details_link": "https://www.metacritic.com/game/switch/harvest-moon-one-world", "publisher": "Natsume", "release_date": "Mar  2 2021", "developers": ["Natsume"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 54, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/edbbaded1cdba183957ac7332f195e0f-98.jpg", "descriptions": "Take a trip around the world in the latest entry in the long-running Harvest Moon series! You'll ride camels across the deserts of Pastilla, venture deep into the snowy mountains of Salmiakki, and even visit a volcano near the cozy mountain town of Lebkuchen! Can you imagine a world withoutTake a trip around the world in the latest entry in the long-running Harvest Moon series! You'll ride camels across the deserts of Pastilla, venture deep into the snowy mountains of Salmiakki, and even visit a volcano near the cozy mountain town of Lebkuchen! Can you imagine a world without cabbage, tomatoes, or even carrots? Believe it or not, that's the world you'll find yourself in at the beginning of Harvest Moon: One World, as the Harvest Goddess, the queen of crops herself, has vanished... However, before the Harvest Goddess disappeared from this world, she imbued the tiny Harvest Wisps with the knowledge of various seeds, thus ensuring the various fruits and vegetables of the world would not be lost. Using the power given to these Harvest Wisps, you'll unlock various seeds as you progress through the game! But the Harvest Wisps can be tricky to find, as they all appear at different times and places. You'll need to use your noggin to make sure you seek out as many of them as you can.… Expand"}, {"name": "Sports Story", "details_link": "https://www.metacritic.com/game/switch/sports-story", "publisher": "SideBar Games", "release_date": "Dec 23 2022", "developers": ["SideBar Games"], "platforms": "Switch", "genres": ["Role-Playing", "General"], "meta_score": 54, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/7/d151747be6354c1ad7338c89c1cd178d-98.jpg", "descriptions": "Sports story is a game about sports, but not always. Various non-sporting pursuits provide variety. Alternate activities like dungeon exploration, stealthy infiltrations and fishing expeditions mean something unexpected waits around every corner. Sometimes it is even sports.Here are someSports story is a game about sports, but not always. Various non-sporting pursuits provide variety. Alternate activities like dungeon exploration, stealthy infiltrations and fishing expeditions mean something unexpected waits around every corner. Sometimes it is even sports.Here are some of the things you can do in the game:* Embark on a golfing adventure in both ordinary and fantastical places.* Undertake full-time study at a renowned tennis academy.* Make friends and enemies in your quest for sporting excellence.* Dungeons, espionage, mini games, buried treasure and you get to meet the queen.* Make your coach proud by competing in Decasportathon.… Expand"}, {"name": "AWAY: The Survival Series", "details_link": "https://www.metacritic.com/game/pc/away-the-survival-series", "publisher": "Breaking Walls", "release_date": "Sep 28 2021", "developers": ["Breaking Walls"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "First-Person"], "meta_score": 54, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/8271edbc6b7c616d61798512925884a9-98.jpg", "descriptions": "Play as a tiny sugar glider in your very own nature documentary. Glide among the trees, fight dangerous predators, and explore beautiful environments as you embark on a high-flying journey to save your family."}, {"name": "Frogger 3D", "details_link": "https://www.metacritic.com/game/3ds/frogger-3d", "publisher": "Konami", "release_date": "Sep 20 2011", "developers": ["Alpha Unit"], "platforms": "3DS", "num_players": "4  Online", "genres": ["Action", "General", "General"], "meta_score": 54, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/0/56bbfcf8acf55b4ce8ddcf5d9d7176b6-98.jpg", "descriptions": "Frogger 3DS is the debut game of the Frogger series for the Nintendo 3DS."}, {"name": "Boogie Bunnies", "details_link": "https://www.metacritic.com/game/xbox-360/boogie-bunnies", "publisher": "Sierra Online", "release_date": "Jan 16 2008", "developers": ["Artech Studios"], "platforms": ["PC", "Xbox 360"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Matching", "General"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/b51ddd10ee849af100fcd2a0d5a22f95-98.jpg", "descriptions": "[Xbox Live Arcade]  Help the Boogie Bunnies achieve their dream of superstardom as they shimmy shake their way through exotic, colorful destinations all the way to Hollywood. Only you can ensure they make it. In this revolutionary match-3 puzzle game, Boogie Bunnies lets you match up these[Xbox Live Arcade]  Help the Boogie Bunnies achieve their dream of superstardom as they shimmy shake their way through exotic, colorful destinations all the way to Hollywood. Only you can ensure they make it. In this revolutionary match-3 puzzle game, Boogie Bunnies lets you match up these wacky disco fur balls from three different sides—left, right, and from the bottom. Score chain combinations and watch them get their groove on. Let's get the party started! Play this great match-3 game with a twist at your own pace in three different game modes, Classic, Arcade, and Endless. Travel with the bunnies to the Arctic, Amazon, and Hollywood as they adopt the local culture. Stylish 3-D bunnies characters: Discover new bunnies along the way from designer sunglasses-wearing bunnies to completely outfitted diva bunnies. Fancy dance animations: Set up extensive chain combinations to trigger the bunnies' creative dance moves to catchy tunes. Family fun play: Join the party online or offline in two-player cooperative or competitive mode for the whole family to enjoy. [Sierra Online]… Expand"}, {"name": "RocketBowl", "details_link": "https://www.metacritic.com/game/xbox-360/rocketbowl", "publisher": "Microsoft", "release_date": "Sep 10 2008", "developers": ["Large Animal"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Sports", "Alternative", "Individual", "Bowling", "Bowling"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/0bba1a21cc7a68c7a4d9dcae14b20dc1-98.jpg", "descriptions": "[Xbox Live Arcade]  Ready for a fresh twist on a classic sport? Then you're ready for Rocket Bowl. Featuring a 50s style retro-futuristic vibe, out-of-this-world courses, and rocket-powered bowling balls, Rocket Bowl lets you compete in tournaments, challenge your friends in multiplayer,[Xbox Live Arcade]  Ready for a fresh twist on a classic sport? Then you're ready for Rocket Bowl. Featuring a 50s style retro-futuristic vibe, out-of-this-world courses, and rocket-powered bowling balls, Rocket Bowl lets you compete in tournaments, challenge your friends in multiplayer, test your skill in mini-games, and more. Rocket-powered bowling balls: Rocket Bowl takes the sport to a whole 'nother level with rocket-powered balls that can boost, jump, and turn to help you knock down the pins and earn extra points with wild shots. Ten crazy bowling courses: In addition to a regular bowling alley, play on nine additional crazy courses filled with ramps, tunnels, loops, hills, curves, and more to create a unique bowling experience. Fun and varied single-player mode: Take on a variety of courses in Free Play mode, or challenge the pros in Tournament and Challenge modes, where you can wager and win money to upgrade equipment. Compete with up to four friends over Xbox LIVE or locally on one system. Xbox LIVE play features Player (unranked) and Ranked matches. Challenging mini-games: Earn extra cash in skill-testing mini-games like MiniStriker and Alternate Shot. Upgrade your equipment: Using cash earned by winning matches and mini-games, players can upgrade from more than 15 unique bowling balls including Strawbally, 8-Ball, the Jupiter 5000, and the Kalamazoo Special. More powerful bowling balls feature enhanced boost and curve abilities. [Microsoft]… Expand"}, {"name": "Tom Clancy's Ghost Recon 2", "details_link": "https://www.metacritic.com/game/gamecube/tom-clancys-ghost-recon-2", "publisher": "Ubisoft", "release_date": "Mar 15 2005", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 2", "Xbox 360", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 54, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/0/1246bb1fa4368122e09829478e780d33-98.jpg", "descriptions": "As an evil North Korean army slowly gains power, the new Chinese regime sends in the Ghosts, a multinational force, to safeguard the China-North Korean border. As the leader of this new team of special forces, you can control your squad through voice commands, hand signals, and a newAs an evil North Korean army slowly gains power, the new Chinese regime sends in the Ghosts, a multinational force, to safeguard the China-North Korean border. As the leader of this new team of special forces, you can control your squad through voice commands, hand signals, and a new interface. You and your team have access to high-tech weapons and gadgets that help you survive surrounding mortar, gunfire, and air strikes. Now, cripple the North Korean threat, and eliminate their rogue general.… Expand"}, {"name": "Dragon Ball: The Breakers", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-ball-the-breakers", "publisher": "Bandai Namco Games", "release_date": "Oct 14 2022", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 54, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/1/d301ed1ef9e8f8f1c25d86af5942b821-98.jpg", "descriptions": "Caught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the TemporalCaught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the Temporal Seam with the Super Time Machine but the Raider is on their backs and getting stronger minute-by-minute.DRAGON BALL: THE BREAKERS is a 1-on-7 online asymmetrical action game in which a band of seven everyday humans tries to survive the Raider (a classic DRAGON BALL rival such as Cell and Frieza) who will hunt and evolve into an unstoppable force.… Expand"}, {"name": "Minesweeper Flags", "details_link": "https://www.metacritic.com/game/xbox-360/minesweeper-flags", "publisher": "Microsoft Game Studios", "release_date": "Feb 11 2009", "developers": ["Tik Games", "LLC", "TikGames"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Logic", "General"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/eae730b02122ccd71cac80efc055f01c-98.jpg", "descriptions": "[Xbox Live Arcade]  Minesweeper has come a long way since the days of the 9-by-9 grid! Minesweeper Flags includes the classic grid game, but if you're looking for real action, check out Flags where you must secure the mines instead of avoiding them! Minesweeper Flags also delivers exciting[Xbox Live Arcade]  Minesweeper has come a long way since the days of the 9-by-9 grid! Minesweeper Flags includes the classic grid game, but if you're looking for real action, check out Flags where you must secure the mines instead of avoiding them! Minesweeper Flags also delivers exciting multiplayer action for up to four players, deep stats to track your rankings, ratings and true skill score, fun new achievements, and an all-new action packed single-player campaign mode. This is Minesweeper Xbox 360 style. Supercharged Flags Mode: Play against the computer or compete with up to three other players locally or online in a race to find and flag the bombs first. Engaging Campaign Mode: Travel the seven continents and strategically use extra lives to sweep up mines on a variety of field sizes and shapes, unlocking lush new environments to enhance Classic or Flags mode. [TikGames]… Expand"}, {"name": "E.T. Armies", "details_link": "https://www.metacritic.com/game/pc/et-armies", "publisher": "Merge Games", "release_date": "Mar  3 2016", "developers": ["Raspina Studio"], "platforms": "PC", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 54, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/3f33aca9b5133b1f8cef9863c5fb47a4-98.jpg", "descriptions": "E.T. Armies is an action-packed, fast-paced, science-fiction first person shooter. The game takes place in a future where Earth has been reduced to ashes; It is now home to a new nation that hungers only for war. Prepare yourself to rise and defend against the invasion of the Forsaken."}, {"name": "Create", "details_link": "https://www.metacritic.com/game/pc/create", "publisher": "EA Games", "release_date": "Nov 16 2010", "developers": ["EA Bright Light"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 54, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/e13715652ec85bfb64e781bdd44cf7b9-98.jpg", "descriptions": "The more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the sceneThe more players explore the game, solve level-based challenges, and customize their world, the more rewards will be unlocked. Creativity will be unleashed as players design environments with easy-to-use brushes and tools, including textures, props and animating objects that bring the scene to life. On the PlayStation 3, Xbox 360, PC, and MAC players can share any of their creations, solutions or challenges with the community through the console and also via the official Create website at www.create.ea.com. Friends can download and remix solutions and set challenges for other players to download and complete. Imaginations will run wild this holiday!… Expand"}, {"name": "Creepy Tale", "details_link": "https://www.metacritic.com/game/switch/creepy-tale", "publisher": "No Gravity Games", "release_date": "Jul 10 2020", "developers": ["Deqaf Studio"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/6c3ac3e22dff0e29e16769ed08b28a58-98.jpg", "descriptions": "Find out the dark story that befell the once-calm and peaceful forest, turning it into a terrifying place filled with otherworldly evil. Solve the secrets of the forest and save your brother!\r \"CREEPY TALE\" FEATURES:\r\n\r\n▪ Unusual puzzles with unusual solutions.\r\n\r\n▪ Elements of a classicFind out the dark story that befell the once-calm and peaceful forest, turning it into a terrifying place filled with otherworldly evil. Solve the secrets of the forest and save your brother!\r \"CREEPY TALE\" FEATURES:\r ▪ Unusual puzzles with unusual solutions.\r ▪ Elements of a classic quest: collect items and use them in a wide variety of cases.\r ▪ Hide, run away, jump high, lure, distract and even... learn to play the reedpipe!\r ▪ A unique and beautiful 2D art will take you to a dark tale and will send shivers down your spine.\r ▪ Surreal audio design matching the otherworldly story and gameplay.… Expand"}, {"name": "Sneak King", "details_link": "https://www.metacritic.com/game/xbox-360/sneak-king", "publisher": "King Games", "release_date": "Nov 19 2006", "developers": ["Blitz Games"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 54, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/c2f3b2b1d7ce2871fc5736ffe94d824b-98.jpg", "descriptions": "[Playable on the Xbox and Xbox 360. Available only at Burger King Restaurants from Nov. 19 through Dec. 24, 2006 for $3.99 and the purchase of a BK Value Meal.]  Only the King can turn an everyday act into an art form and now players can step into the King's royal shoes and use cunning[Playable on the Xbox and Xbox 360. Available only at Burger King Restaurants from Nov. 19 through Dec. 24, 2006 for $3.99 and the purchase of a BK Value Meal.]  Only the King can turn an everyday act into an art form and now players can step into the King's royal shoes and use cunning stealth to sneak up behind unsuspecting people and bestow them with a delicious meal. The goal of Sneak King is to surprise hungry citizens with BURGER KING sandwiches and other menu items throughout the day before they pass out from hunger. Whether in a logging yard, construction site, suburban neighborhood or downtown urban scene -- each rich with detail and hidden pathways -- players can hide out and earn points based on how elaborate the delivery is executed.  [King Games]… Expand"}, {"name": "Spikeout: Battle Street", "details_link": "https://www.metacritic.com/game/xbox/spikeout-battle-street", "publisher": "Sega", "release_date": "Mar 29 2005", "developers": ["Dimps Corporation"], "platforms": "Xbox", "num_players": "4  Online", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 54, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/68e80edc0fd4604a8feda13529ef477d-98.jpg", "descriptions": "Get ready to engage in hand-to-hand melee combat against an army of enemies. Spikeout Battle Street puts you in the middle a gang war between Team Spike and Team Inferno. As one of 12 characters, you must use your arsenal of attack moves to defeat your enemies. The Xbox Live feature lets youGet ready to engage in hand-to-hand melee combat against an army of enemies. Spikeout Battle Street puts you in the middle a gang war between Team Spike and Team Inferno. As one of 12 characters, you must use your arsenal of attack moves to defeat your enemies. The Xbox Live feature lets you experience cooperative gameplay with three friends while talking trash through Xbox Communicators. Bonus online features include downloadable items, stories, characters, sound files, and more.… Expand"}, {"name": "Lost: Via Domus", "details_link": "https://www.metacritic.com/game/playstation-3/lost-via-domus", "publisher": "Ubisoft", "release_date": "Feb 26 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 54, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/d10744b556919c0f9b8519959c07d0c7-98.jpg", "descriptions": "After Oceanic Air flight 815 tore apart in mid-air and crashed on a seemingly deserted Pacific island, its survivors were forced to find inner strength they never knew they had in order to survive. The band of friends, family, enemies and strangers has become reluctant heroes who must workAfter Oceanic Air flight 815 tore apart in mid-air and crashed on a seemingly deserted Pacific island, its survivors were forced to find inner strength they never knew they had in order to survive. The band of friends, family, enemies and strangers has become reluctant heroes who must work together against the cruel weather and harsh terrain if they want to stay alive. Danger and mystery loom behind every corner on the island, and those they thought could be trusted may turn against them. Even heroes have secrets. As a passenger of Oceanic flight 815, you survived the crash and find yourself on an uncharted island somewhere in the Pacific Ocean. As you begin to unravel mysteries of the island, you begin to discover secrets of your own.  You will have to understand your past mistakes in order to survive and find your way home. Confront your dark past, seek your redemption, and ultimately find a way home. Explore familiar locations, unravel mysteries, and interact with the main characters from the show. Survive the challenges that the island throws at you: Solve puzzles, outsmart enemies, battle the smoke monster, and overcome many other challenges to survive the island and come out alive. [Ubisoft]… Expand"}, {"name": "Top Spin 4", "details_link": "https://www.metacritic.com/game/wii/top-spin-4", "publisher": "2K Sports", "release_date": "Mar 15 2011", "developers": ["2K Games"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 54, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/59e4deb6e15d2ff0aab71e1ee8f2ccdd-98.jpg", "descriptions": "Top Spin 4 is the latest iteration in the tennis sim, bringing 25 playable pros as well as the ability to create your own star."}, {"name": "OVERPASS", "details_link": "https://www.metacritic.com/game/playstation-4/overpass", "publisher": "Bigben Interactive", "release_date": "Mar 17 2020", "developers": ["Zordix Racing"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 54, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/1/ef241ebef52d76b7afca55a69a17ebf9-98.jpg", "descriptions": "In Overpass, the player takes control of powerful buggies and quads, scrabbling across extreme tracks and very hazardous terrain. This simulation, unique in its genre, pits the player against craggy slopes and puts their cool-headedness to the test throughout technical obstacle courses alongIn Overpass, the player takes control of powerful buggies and quads, scrabbling across extreme tracks and very hazardous terrain. This simulation, unique in its genre, pits the player against craggy slopes and puts their cool-headedness to the test throughout technical obstacle courses along wilderness tracks.Overpass's realistic physics engine requires you to keep precise and meticulous control of your speed and acceleration or you risk losing your grip and failing your crossing. You'll need to master the technical characteristics of official reproductions of buggies and quads from iconic brands such as Yamaha, Suzuki or Arctic Cat. Differential locking, 2 or 4 drive wheels, transmission type: the player has been given all the tools they need to discover the real vehicle options that will let them adapt their driving to the terrain.The Career mode lets you manage your buggies and quads and choose the one best adapted to each track and terrain type in order to win the competition and attract sponsors. In multi-player mode, you'll need to know and master the slightest detail of each track in order to post the best times and show that you are truly the master of off-roading!… Expand"}, {"name": "Son of Nor", "details_link": "https://www.metacritic.com/game/pc/son-of-nor", "publisher": "stillalive studios", "release_date": "Mar 31 2015", "developers": ["stillalive studios"], "platforms": "PC", "genres": ["Fantasy", "Action Adventure", "General"], "meta_score": 54, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/66e600462262600ca4dafc1093102932-98.jpg", "descriptions": "Enter the desert world of Noshrac. You are a Son of Nor, a human mage with the sole mission to protect and preserve what is left of your race. Son of Nor is an action adventure set in a dynamic desert world that can be shaped by the player's powers. Challenging puzzles, dynamic sandEnter the desert world of Noshrac. You are a Son of Nor, a human mage with the sole mission to protect and preserve what is left of your race. Son of Nor is an action adventure set in a dynamic desert world that can be shaped by the player's powers. Challenging puzzles, dynamic sand manipulations and an innovative magic system await you.… Expand"}, {"name": "Stacked with Daniel Negreanu", "details_link": "https://www.metacritic.com/game/pc/stacked-with-daniel-negreanu", "publisher": "Myelin Media", "release_date": "May 30 2006", "developers": ["5000ft Inc."], "platforms": "PC", "num_players": "10  Online", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 54, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/c3cf643ff9ff369d69b283d4302ab561-98.jpg", "descriptions": "Stacked is a Texas Hold 'em poker game that captures the look, excitement and drama of the phenomenon that has captivated America. The game features a comprehensive poker school in which the player can receive tips and strategies from Daniel Negreanu (2004 ESPN Player of the Year, WorldStacked is a Texas Hold 'em poker game that captures the look, excitement and drama of the phenomenon that has captivated America. The game features a comprehensive poker school in which the player can receive tips and strategies from Daniel Negreanu (2004 ESPN Player of the Year, World Poker Tour Player of the Year) who will teach everything from the fundamentals of Hold 'em to advanced tournament strategies through full motion video, voiceovers and dynamic in-game features. As players progress through the game's career mode, they can apply Daniel's teachings to overcome some of poker's most renowned stars, including Josh Arieh, Jennifer Harman, Erick Lindgren, Carlos Mortenson, Evelyn Ng and David Williams. The Poki Artificial Intelligence system utilized in Stacked adapts its tactics in real-time to exploit the user's playing style, detecting tendencies and deploying appropriate counter-strategies to deliver a challenging and authentic experience. Gamers can organize a casual game with friends or compete to qualify for sanctioned multi-table tournaments. [Myelin Media]… Expand"}, {"name": "Dynasty Warriors 9 Empires", "details_link": "https://www.metacritic.com/game/switch/dynasty-warriors-9-empires", "publisher": "Koei Tecmo Games", "release_date": "Feb 15 2022", "developers": ["Koei Tecmo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 54, "users_score": 9.4, "image": "https://static.metacritic.com/images/products/games/3/a2cbb4af3cd20aaa5adeccbd64c58140-98.jpg", "descriptions": "Empires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areasEmpires, a unique \"Romance of the Three Kingdoms\" experience. Dramatic stories of officers on different sides. All 94 officers who have appeared in DYNASTY WARRIORS 9 are  playable. In addition, players can control all 700 common officers. A major change from previous series titles, areas around castles become battlefields, evolving into “Storming the Castle” instances. Employ strategic Secret Plans and balance Army Affinity to break through the enemy's gate. Defeat the enemy commander in Decisive Battle mode to claim victory of the castle. The Empires series' signature domestic system is back. With a high degree of flexibility, set long and mid term kingdom goals, recruit new officers, procure logistics, and execute a variety of military, economic and diplomatic commands to strive to unify China.\r… Expand"}, {"name": "Legend of Kay Anniversary", "details_link": "https://www.metacritic.com/game/switch/legend-of-kay-anniversary", "publisher": "Nordic Games Publishing", "release_date": "May 29 2018", "developers": ["Kaiko"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 54, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/3/950844e8b242e6144e76f4dce11fab25-98.jpg", "descriptions": "Experience the unique blend of Martial Arts-combat, action adventure, Jump 'n' Run and puzzle solving.\r 10 years after its initial release, Legend of Kay Anniversary by Kaiko Games is a thoroughly remastered version of the original game with high resolution textures, new & more detailedExperience the unique blend of Martial Arts-combat, action adventure, Jump 'n' Run and puzzle solving.\r 10 years after its initial release, Legend of Kay Anniversary by Kaiko Games is a thoroughly remastered version of the original game with high resolution textures, new & more detailed character models, modern rendering techniques and crystal-clear surround sound which give this great classic a new shine.\r Full of fond allusions to old martial arts films and pop culture quotes, Legend of Kay Anniversary is both an incredibly funny game and a challenging action-adventure for young and old alike.… Expand"}, {"name": "Warriors: Legends of Troy", "details_link": "https://www.metacritic.com/game/xbox-360/warriors-legends-of-troy", "publisher": "Koei Tecmo Games", "release_date": "Nov 27 2012", "developers": ["Tecmo Koei Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 54, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/5149530ec2e8afe503a62a371fc32dd7-98.jpg", "descriptions": "Three thousand years ago, a poet sang of heroes strong enough to stand alone against an army. For love, they sailed the world. For family, they made the greatest sacrifices. For honor, they stood and faced the will of gods and fought a war that shook the earth..."}, {"name": "The Italian Job", "details_link": "https://www.metacritic.com/game/xbox/the-italian-job", "publisher": "Eidos Interactive", "release_date": "Jun 25 2003", "developers": ["Climax Group"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 54, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/c9901a94af8c5345bcce066000050111-98.jpg", "descriptions": "Charlie Croker and his gang are left for dead in Venice after being double-crossed during one of the biggest gold heists ever. You must take on the role of Charlie and his gang members in their quest for revenge and the gold. Based on the film, The Italian Job's story mode challenges you toCharlie Croker and his gang are left for dead in Venice after being double-crossed during one of the biggest gold heists ever. You must take on the role of Charlie and his gang members in their quest for revenge and the gold. Based on the film, The Italian Job's story mode challenges you to create the largest traffic jam in LA history, and then escape in supercharged Mini Coopers. Master four other action-packed modes, including stunt driving, circuit racing, and multiplayer modes for up to two players.… Expand"}, {"name": "Carnivores: Ice Age", "details_link": "https://www.metacritic.com/game/pc/carnivores-ice-age", "publisher": "WizardWorks", "release_date": "Jan 15 2001", "developers": ["Action Forms Ltd."], "platforms": ["iPhone/iPad", "PC"], "num_players": "1 Player", "genres": ["Action", "General", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 54, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/5a1403bd21ef0fd770de04574cee0ce6-98.jpg", "descriptions": "Take on such creatures as woolly mammoths to saber-toothed tigers and even the elusive and dangerous yeti. Prepare for a chilling expedition through five realistic 3-D maps, including massive ice cliffs and vast snowy expanses. Choose from a barrage of powerful firearms and accessories,Take on such creatures as woolly mammoths to saber-toothed tigers and even the elusive and dangerous yeti. Prepare for a chilling expedition through five realistic 3-D maps, including massive ice cliffs and vast snowy expanses. Choose from a barrage of powerful firearms and accessories, including radar, camo, and cover scent.  [WizardWorks]… Expand"}, {"name": "Buzz Lightyear of Star Command", "details_link": "https://www.metacritic.com/game/playstation/buzz-lightyear-of-star-command", "publisher": "Activision", "release_date": "Sep 26 2000", "developers": ["Traveller's Tales"], "platforms": "PlayStation", "genres": ["Action", "Platformer", "3D"], "meta_score": 54, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/1290719872fe237ef5cf9ba9e8da1af3-98.jpg", "descriptions": "Only you, Buzz Lightyear, and your elite Space Ranger team can defeat the evil Emperor Zurg in his dark quest for universal domination! Blast off with power-ups like shields, rockets, homing weapons and lightning beams. Fight on jetpacks, hoverboards, jetbikes and more! Explore 12 levels inOnly you, Buzz Lightyear, and your elite Space Ranger team can defeat the evil Emperor Zurg in his dark quest for universal domination! Blast off with power-ups like shields, rockets, homing weapons and lightning beams. Fight on jetpacks, hoverboards, jetbikes and more! Explore 12 levels in seven amazing worlds, including Planet Z.… Expand"}, {"name": "007: Quantum of Solace", "details_link": "https://www.metacritic.com/game/wii/007-quantum-of-solace", "publisher": "Activision", "release_date": "Nov  4 2008", "developers": ["Treyarch", "Beenox"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Third-Person", "Modern", "Modern", "Modern", "Arcade"], "meta_score": 54, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/b06a80c5bd68337e1e7c960bba8b8393-98.jpg", "descriptions": "Introducing a more lethal and cunningly efficient Bond, the game blends intense first-person action with a unique third-person cover combat system that allows players to truly feel what it is like to be the ultimate secret agent as they use their stealth, precision shooting and lethal combatIntroducing a more lethal and cunningly efficient Bond, the game blends intense first-person action with a unique third-person cover combat system that allows players to truly feel what it is like to be the ultimate secret agent as they use their stealth, precision shooting and lethal combat skills to progress through missions. Blending the action of the \"Quantum of Solace\" feature film with the \"Casino Royale\" movie, the title propels players into the cinematic experience of international espionage.  Based on the Call of Duty 4: Modern Warfare game engine that has been specifically engineered to immerse players in the Bond universe, the Quantum of Solace game delivers high-definition graphics, reactive AI and visually stunning locations inspired by locales portrayed in the films. Quantum of Solace marks the first time players can become the dangerous and cunning Bond as portrayed by Daniel Craig. From silent take downs and sneaking through confined spaces, to one-on-one shoot outs and large scale battles, players experience a variety of gameplay that challenges them to think through situations and choose how they progress, whether it's through covert means or confronting enemies in full force. Advanced combat and Realistic AI: Players engage in both first-person and third-person gameplay that allows gamers to be Bond in unscripted battles against the world's most evil villains and mercenaries. Filled with armed combat, massive explosions and vertigo-inducing chases, gamers are immersed in an authentic Bond universe and drawn into epic movie moments with theatrical camera angles, split screen effects, picture-in-picture sequences, and amazing environments inspired by real world locations such as Montenegro, Venice, Bolivia and Austria. Bringing James Bond to next-gen consoles for the first time, gamers now have the ability to battle online in a variety of modes. [Activision]… Expand"}, {"name": "Spyglass Board Games", "details_link": "https://www.metacritic.com/game/xbox-360/spyglass-board-games", "publisher": "Microsoft Game Studios", "release_date": "Aug  1 2007", "developers": ["Strange Flavour"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 54, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/5/d55d742e98ee30cb6901a873fb826206-98.jpg", "descriptions": "[Xbox Live Arcade]  Spyglass Board Games offers a fun new take on classic board games, like Chess, Checkers, Mancala, and Reversi. Play and chat socially on Xbox Live, or play against the computer. Use the Xbox LIVE Vision camera to personalize the game board, playing pieces, and video[Xbox Live Arcade]  Spyglass Board Games offers a fun new take on classic board games, like Chess, Checkers, Mancala, and Reversi. Play and chat socially on Xbox Live, or play against the computer. Use the Xbox LIVE Vision camera to personalize the game board, playing pieces, and video effects. Each game has custom pieces to choose from, such as a rook made of stone, or a furry checkers piece with cute gleaming eyes. Customizable pieces: Choose custom game pieces that range from traditional marble, to metallic silver, to fuzzy and wiggling gel. Twelve achievements: Twelve achievements are offered ranging from easy, such as playing all four games, to more challenging, such as taking all four corners in Reversi. [Microsoft]… Expand"}, {"name": "Pokemon Mystery Dungeon: Explorers of Sky", "details_link": "https://www.metacritic.com/game/ds/pokemon-mystery-dungeon-explorers-of-sky", "publisher": "Nintendo", "release_date": "Oct 12 2009", "developers": ["ChunSoft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Console-style RPG", "Console-style RPG", "Roguelike"], "meta_score": 54, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/6/5716f92b0968a1412337d1c9d7f05f9f-98.jpg", "descriptions": "Pokémon Mystery Dungeon: Explorers of Sky is the newest installment in the Pokémon Mystery Dungeon video game series. The game expands on the fun found in Pokémon Mystery Dungeon: Explorers of Time and Pokémon Mystery Dungeon: Explorers of Darkness. Players be a Pokémon and team up with aPokémon Mystery Dungeon: Explorers of Sky is the newest installment in the Pokémon Mystery Dungeon video game series. The game expands on the fun found in Pokémon Mystery Dungeon: Explorers of Time and Pokémon Mystery Dungeon: Explorers of Darkness. Players be a Pokémon and team up with a partner Pokémon. Together the two set out on an adventure of exploration and discovery, ultimately saving the world from destruction. With additional Pokémon to be, new “Special Episodes” and enhanced communication features, this is a grand adventure with a moving story and stunning finale. This game is a great starting point for players to enter the world of Pokémon Mystery Dungeon and for returning players to discover even more secrets. [Nintendo]… Expand"}, {"name": "Dragon Ball: The Breakers", "details_link": "https://www.metacritic.com/game/xbox-series-x/dragon-ball-the-breakers", "publisher": "Bandai Namco Games", "release_date": "Oct 14 2022", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "General"], "meta_score": 54, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/e8982f53b1c13659d4302212b60efdbb-98.jpg", "descriptions": "Caught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the TemporalCaught out by an unexpected temporal phenomenon, seven ordinary citizens find themselves stranded in a Temporal Seam; they share their imprisonment with a Raider, a menacing enemy from another timeline with overwhelming power.Their only hope for survival is to break out of the Temporal Seam with the Super Time Machine but the Raider is on their backs and getting stronger minute-by-minute.DRAGON BALL: THE BREAKERS is a 1-on-7 online asymmetrical action game in which a band of seven everyday humans tries to survive the Raider (a classic DRAGON BALL rival such as Cell and Frieza) who will hunt and evolve into an unstoppable force.… Expand"}, {"name": "SkateBIRD", "details_link": "https://www.metacritic.com/game/switch/skatebird", "publisher": "Glass Bottom Games", "release_date": "Sep 16 2021", "developers": ["Glass Bottom Games"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Skate / Skateboard"], "meta_score": 54, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/2/3d46bf8b10296ca1fe96f3e527c1be09-98.jpg", "descriptions": "Grind on bendy straws, kick-flip over staplers, and carve killer lines through cardboard and sticky tape parks. Above all else, skate birds try their best. Grind on bendy straws, kick-flip over staplers, and carve killer lines through cardboard and sticky tape parks!\r You're a lonely lil'Grind on bendy straws, kick-flip over staplers, and carve killer lines through cardboard and sticky tape parks. Above all else, skate birds try their best. Grind on bendy straws, kick-flip over staplers, and carve killer lines through cardboard and sticky tape parks!\r You're a lonely lil' bird, and your Big Friend has hung up their board for good. Their job sucks, and lately, they're barely ever home to play with you. You're gonna fix all that with the power of being a chill little skateboarding bird. You may be tiny, but the more you skate, the more following you get, the more the world of bird skating will open up. Birds will come check out your park, help you find more parks, and together you'll (somehow) fix Big Friend's life! Above all else, skate birds try their best!\r - Explore lots of bird-sized parks, with simple controls familiar to any pro skating tiny hawk.\r - Find fancy clothing, secret mixtapes of new music, birbs that need your help, and more!\r - Skate to an original low-fi birb-hop soundtrack, and unlock new tracks from underground bands as you explore the world!… Expand"}, {"name": "Whipseey and the Lost Atlas", "details_link": "https://www.metacritic.com/game/switch/whipseey-and-the-lost-atlas", "publisher": "Blowfish Studios", "release_date": "Aug 27 2019", "developers": ["Daniel A. Ramirez"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 54, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/257ca3d234bcb44cccd15b84daeb16a4-98.jpg", "descriptions": "In Whipseey and the Lost Atlas you play as Alex, a young boy who’s curiosity has landed him in a world of trouble. After finding himself lost in a strange world and being transformed into a magical creature named Whipseey, he must to solve the mystery of the Lost Atlas to return to hisIn Whipseey and the Lost Atlas you play as Alex, a young boy who’s curiosity has landed him in a world of trouble. After finding himself lost in a strange world and being transformed into a magical creature named Whipseey, he must to solve the mystery of the Lost Atlas to return to his original form and go back home.… Expand"}, {"name": "Hamsterdam", "details_link": "https://www.metacritic.com/game/switch/hamsterdam", "publisher": "Muse Games", "release_date": "Aug  1 2019", "developers": ["Muse Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/b2d96d4fd3de018dc53096c5fd8c3026-98.jpg", "descriptions": "Play as the hamster hero Pimm and harness the mightiest martial arts powers. Kick tail through district after district on a heart-pounding journey to take down the Vermin Gang, save Grandpa, and restore peace to Hamsterdam. \r\rThe once peaceful town of Hamsterdam is in danger! The vilePlay as the hamster hero Pimm and harness the mightiest martial arts powers. Kick tail through district after district on a heart-pounding journey to take down the Vermin Gang, save Grandpa, and restore peace to Hamsterdam. \r\rThe once peaceful town of Hamsterdam is in danger! The vile chinchilla Marlo and his Vermin Gang are wreaking havoc. \r\rSwing, flick, and strike your way through the streets of Hamsterdam. Experience the frantic action, flawlessly execute rhythm combos, and become one with the fabled Hamster-Fu.… Expand"}, {"name": "Cast of the Seven Godsends", "details_link": "https://www.metacritic.com/game/switch/cast-of-the-seven-godsends", "publisher": "Merge Games", "release_date": "Apr 18 2018", "developers": ["Merge Games", "Raven Travel Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/1620d8f6cdf5c891af9faf928217df73-98.jpg", "descriptions": "Cast of the Seven Godsends  Redux harks back to the days when classic 2D, run n gun, action-shooter games ruled the arcades. Four levels of difficulty, six worlds to conquer, twelve mid and end-of-level bosses, seven god-like armour sets, five basic weapons and thirty-five magic combatCast of the Seven Godsends  Redux harks back to the days when classic 2D, run n gun, action-shooter games ruled the arcades. Four levels of difficulty, six worlds to conquer, twelve mid and end-of-level bosses, seven god-like armour sets, five basic weapons and thirty-five magic combat spells!\r The evil emperor Zaraaima has kidnapped the infant heir to the land of Dareca. King Kandar must call upon the aid of the seven gods of Dareca as he traverses the six worlds of his kingdom in a bid to save his son. He must face the emperors hordes as he battles through dark woods, slimy swamps, sinister mills, infernal volcanos, snowy mountains, golden cities and demonic castles. Each world is guarded by level bosses each sworn to bring about the kings swift demise. To help him in his quest King Kandar can invoke god-given armour, wield different weapons and cast fanatical spells. Can the King save his son and his kingdom or will Dareca fall into the evil emperors grasp?… Expand"}, {"name": "Knee Deep", "details_link": "https://www.metacritic.com/game/playstation-4/knee-deep", "publisher": "Wales Interactive", "release_date": "Jan 31 2017", "developers": ["Wales Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 54, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/22d4077fee3dab3e28093e488844af65-98.jpg", "descriptions": "When a washed-up actor hangs himself on location, a spotlight is cast on the backwater Florida town of Cypress Knee. Your screen becomes a stage on which you investigate this mysterious suicide as three distinct characters: cheeky blogger Romana Teague, down-and-out local reporter JackWhen a washed-up actor hangs himself on location, a spotlight is cast on the backwater Florida town of Cypress Knee. Your screen becomes a stage on which you investigate this mysterious suicide as three distinct characters: cheeky blogger Romana Teague, down-and-out local reporter Jack Bellet, and cynical private investigator K.C. Gaddis.… Expand"}, {"name": "Hatoful Boyfriend: Holiday Star", "details_link": "https://www.metacritic.com/game/pc/hatoful-boyfriend-holiday-star", "publisher": "MIST[PSI]PRESS", "release_date": "Dec 15 2015", "developers": ["Hato Moa"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "Visual Novel"], "meta_score": 54, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/1b4d52de63cfed79589d0f975e83c50e-98.jpg", "descriptions": "The birds of Hatoful Boyfriend are back in the remastered holiday-themed sequel Hatoful Boyfriend: Holiday Star. Travel to out-there worlds, meet interesting new chickadees, and find romance in the elegantly designed winter wonderlands."}, {"name": "Dragon Ball Z: Battle of Z", "details_link": "https://www.metacritic.com/game/playstation-3/dragon-ball-z-battle-of-z", "publisher": "Namco Bandai Games", "release_date": "Jan 28 2014", "developers": ["Artdink"], "platforms": ["PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 54, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/4345e8966ce17f5eb77b3637bbb03cf1-98.jpg", "descriptions": "Developed by Tokyo based game developer ARTDINK; Dragon Ball Z Battle of Z will feature a large cast of playable characters including Goku, Piccolo, Vegeta, and a variety of melee and famous attacks including the Kamehameha, Special Beam Cannon, and Spirit Bomb. The epic battles in DragonDeveloped by Tokyo based game developer ARTDINK; Dragon Ball Z Battle of Z will feature a large cast of playable characters including Goku, Piccolo, Vegeta, and a variety of melee and famous attacks including the Kamehameha, Special Beam Cannon, and Spirit Bomb. The epic battles in Dragon Ball Z Battle of Z derive their style from the original anime series and will take place in rich environments on both land and in the air. Dragon Ball Z Battle of Z will let players form teams with up to four characters to participate in group melee action, take on massive boss battles, or challenge other players around the world for brawls featuring up to eight characters on screen at the same time.… Expand"}, {"name": "Omerta: City of Gangsters", "details_link": "https://www.metacritic.com/game/pc/omerta-city-of-gangsters", "publisher": "Kalypso", "release_date": "Jan 31 2013", "developers": ["Kalypso", "Haemimont Games"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General", "Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 54, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/fc1f0c8f9ce0a52f45d7768dff05e45c-98.jpg", "descriptions": "OMERTA - CITY OF GANGSTERS is a simulation game with tactical turn-based combat. Taking the role of a fresh-from-the-boat immigrant, with dreams of the big life, the player will work his way up the criminal hierarchy of 1920's Atlantic City. Starting with small jobs, his character recruits aOMERTA - CITY OF GANGSTERS is a simulation game with tactical turn-based combat. Taking the role of a fresh-from-the-boat immigrant, with dreams of the big life, the player will work his way up the criminal hierarchy of 1920's Atlantic City. Starting with small jobs, his character recruits a gang and expands his empire by taking territory from other gangsters. Eventually he establishes his own crime syndicate and becomes the de facto ruler of Atlantic City.… Expand"}, {"name": "Space Channel 5 VR: Kinda Funky News Flash", "details_link": "https://www.metacritic.com/game/playstation-4/space-channel-5-vr-kinda-funky-news-flash", "publisher": "Grounding Inc.", "release_date": "Feb 25 2020", "developers": ["Grounding Inc."], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Dancing"], "meta_score": 54, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/f641b550392059aa102d1f035fbdd202-98.jpg", "descriptions": "Dance is your power to protect the earth against invading aliens. Sega’s legendary Dreamcast rhythm game “Space Channel 5” is coming to virtual reality as ”Space Channel 5 VR Kinda Funky News Flash!” Your task is to master a series of life saving dancing poses while tuning into the coolDance is your power to protect the earth against invading aliens. Sega’s legendary Dreamcast rhythm game “Space Channel 5” is coming to virtual reality as ”Space Channel 5 VR Kinda Funky News Flash!” Your task is to master a series of life saving dancing poses while tuning into the cool beat. Experience the return of Ulala for yourselves.… Expand"}, {"name": "Steambot Chronicles: Battle Tournament", "details_link": "https://www.metacritic.com/game/psp/steambot-chronicles-battle-tournament", "publisher": "Atlus", "release_date": "Jun 30 2009", "developers": ["Irem"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 54, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/2a7844d4677e0b6326c0aad336cf1a34-98.jpg", "descriptions": "A young Trot driver comes to Orion City with one dream in mind: to win the prestigious Orion City Trotmobile gladiator tournament. However, you'll quickly learn that it takes more than pluck and optimism to earn victory in the coliseum. With the help of a spirited mechanic named Venus,A young Trot driver comes to Orion City with one dream in mind: to win the prestigious Orion City Trotmobile gladiator tournament. However, you'll quickly learn that it takes more than pluck and optimism to earn victory in the coliseum. With the help of a spirited mechanic named Venus, you'll have to take on a series of jobs to earn the money and fame required to make a name for yourself about town as a skilled Trotmobile operator. When a series of bandit attacks begins to affect the city's economy and distress the citizens, who will have the mettle and the metal to put a stop to it? You control your adventure -- Mission-based gameplay puts you in the driver's seat: you choose what you do and say. Take on missions ranging from cross-town delivery to mining in a canyon to defeating bandits. The money and fame points earned can be used to upgrade your Trotmobile and enter arena battles. Complete freedom to build -- The cardinal rule of Trotmobile design is that there is no ideal design. Instead, there are tons of customization options, letting you upgrade your arms, legs, heads, bodies, and more, each changing the nature of how you battle! Personalize your vehicle with color and emblem to make it distinctively yours. Four-player competition mode -- Clash with your friends' Trotmobiles in 4 player ad hoc multiplayer! Set each player against the others battle royale style, or pair up for tag team action. One cartridge, four players -- Only one UMD disc? You can still compete! Activate \"game sharing\" to enter multiplayer mode with standard Trotmobiles, or use multiple UMDs to have access to your customized battle vehicles. [Atlus USA]… Expand"}, {"name": "Hunting Simulator 2", "details_link": "https://www.metacritic.com/game/playstation-4/hunting-simulator-2", "publisher": "Bigben Interactive", "release_date": "Jun 30 2020", "developers": ["Neopica"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Hunting"], "meta_score": 54, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/5/369fca0fb1a89fbbf0a6470884842075-98.jpg", "descriptions": "With your hunting dog by your side, explore the Texan desert and forests of Colorado and Europe as you track down 33 animal species. Choose your gear from over 160 official weapons, accessories and clothing items (including Browning, Winchester and Bushnell)."}, {"name": "Dangerous Golf", "details_link": "https://www.metacritic.com/game/pc/dangerous-golf", "publisher": "Three Fields Entertainment", "release_date": "Jun  2 2016", "developers": ["Three Fields Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 54, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/5/e8a41e1f5ab3e58227a6e1442a19c255-98.jpg", "descriptions": "An arcade-eque sports game with a decidedly explosive twist. Brought to you from the founders of Criterion Games, the people behind Burnout and Black – this is Dangerous Golf."}, {"name": "Disney/Pixar Cars", "details_link": "https://www.metacritic.com/game/ds/disneypixar-cars", "publisher": "THQ", "release_date": "Jun  6 2006", "developers": ["Helixe"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 54, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/8/848a5b20f7c71c91280996977dc05ac5-98.jpg", "descriptions": "Race to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. The game is a story-based racingRace to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. The game is a story-based racing adventure game that relives all of the key moments of the movie. It features more than 10 playable characters from the film and an open world environment with more than 50 races. [THQ]… Expand"}, {"name": "Ghost Rider", "details_link": "https://www.metacritic.com/game/playstation-2/ghost-rider", "publisher": "2K Games", "release_date": "Feb 13 2007", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 54, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/b64b82f1d2636024ef3cc0b8a41f6e7d-98.jpg", "descriptions": "The Ghost Rider feature film follows superstar motorcycle stunt rider Johnny Blaze as he strikes a deal with the vile Mephistopheles for the most precious of commodities – his immortal soul. Now Johnny Blaze is forever destined to ride night after night as the host to the powerfulThe Ghost Rider feature film follows superstar motorcycle stunt rider Johnny Blaze as he strikes a deal with the vile Mephistopheles for the most precious of commodities – his immortal soul. Now Johnny Blaze is forever destined to ride night after night as the host to the powerful supernatural entity known as the Ghost Rider. The video game continues the storyline, dropping players into the role of Blaze as he is transformed into a super hero with powers to avenge any evil he encounters.  Featuring many of the characters and motorcycles from the comic book and movie, Ghost Rider engages gamers in an immersive, supernatural third person world with a seamless blend of hand-to-hand combat and high-speed motorcycle action. [2K Games]… Expand"}, {"name": "Trials of the Blood Dragon", "details_link": "https://www.metacritic.com/game/pc/trials-of-the-blood-dragon", "publisher": "Ubisoft", "release_date": "Jun 13 2016", "developers": ["RedLynx"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 54, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/61f1ff1aa97a120e949a3554eaf7d59a-98.jpg", "descriptions": "The year is 2019. Roxanne and Slayter, the offspring of the legendary Rex Power Colt, are going to Vietnam War 4 to save freedom, and save the world."}, {"name": "A Valley Without Wind", "details_link": "https://www.metacritic.com/game/pc/a-valley-without-wind", "publisher": "Arcen Games, LLC", "release_date": "Apr 24 2012", "developers": ["Arcen Games", "LLC"], "platforms": "PC", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 54, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/75723e9af3b9612e2b6df1b036e4d882-98.jpg", "descriptions": "AVWW is a complete departure from what Arcen has previously developed  in terms of genre. Set in a post-ice-age world in the distant future,  the game focuses on survival and exploration."}, {"name": "Universal Combat", "details_link": "https://www.metacritic.com/game/pc/universal-combat", "publisher": "DreamCatcher Interactive", "release_date": "Feb  5 2004", "developers": ["3000AD", "Inc."], "platforms": "PC", "num_players": "1-64 ", "genres": ["Simulation", "Sci-Fi", "Space", "Large Spaceship", "Large Spaceship", "Civilian"], "meta_score": 54, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/8/dc551dc6b4853e3ac087646e44f7678f-98.jpg", "descriptions": "Fight anything anywhere anyhow... and by any means necessary! Universal Combat takes you into a seamless universe full of epic space battles, massive ground skirmishes, fierce naval engagements and even tense dogfights above the planet's surface. In solo mode or in multiplayer, in first- orFight anything anywhere anyhow... and by any means necessary! Universal Combat takes you into a seamless universe full of epic space battles, massive ground skirmishes, fierce naval engagements and even tense dogfights above the planet's surface. In solo mode or in multiplayer, in first- or third-person view, play as a marine, a star ship commander with a full crew, or a pilot in the latest space fighter. Universal Combat brings together the greatest components of any war together in a single game. Conceived in late 2001 as Battlecruiser Generations, the fifth title in the long-running Battlecruiser series, during development it morphed into much more than a massive space simulation. As Universal Combat, the new action-based focus, direction and premise of the new incarnation caters to a wider audience of action and space sim fans alike. [DreamCatcher Interactive]… Expand"}, {"name": "Minority Report: Everybody Runs", "details_link": "https://www.metacritic.com/game/xbox/minority-report-everybody-runs", "publisher": "Activision", "release_date": "Nov 18 2002", "developers": ["Treyarch"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 54, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/28eaa821194f5881087997bfa30a71cd-98.jpg", "descriptions": "The year is 2054 and you are Precrime Officer John Anderton, head of an elite police force division that can apprehend murderers before the crime can be committed. Everyone thought the system was perfect, until a precrime report lists you as the prime suspect. Now, you're on the run throughThe year is 2054 and you are Precrime Officer John Anderton, head of an elite police force division that can apprehend murderers before the crime can be committed. Everyone thought the system was perfect, until a precrime report lists you as the prime suspect. Now, you're on the run through 40 futuristic levels filled with both human and robot enemies in a mission to clear your name. With an arsenal of weapons, hand-to-hand combat skills, and a Jetpack that allows you to fly through levels, it's up to you to stop an evil conspiracy before it's too late. … Expand"}, {"name": "Lost in Blue: Shipwrecked", "details_link": "https://www.metacritic.com/game/wii/lost-in-blue-shipwrecked", "publisher": "Konami", "release_date": "Sep 23 2008", "developers": ["Hudson Soft"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Adventure", "General", "General"], "meta_score": 54, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/80def77701ec5edc25f2465723811363-98.jpg", "descriptions": "The Lost in Blue series debuts on a new platform for the first time ever with Lost in Blue: Shipwrecked. Experience a survival adventure like never before through colorful 3D graphics and the uniquely interactive capabilities of the Wii. You find yourself stranded on a mysterious islandThe Lost in Blue series debuts on a new platform for the first time ever with Lost in Blue: Shipwrecked. Experience a survival adventure like never before through colorful 3D graphics and the uniquely interactive capabilities of the Wii. You find yourself stranded on a mysterious island filled with lush forests, a sunken ship, ancient ruins, and an active volcano. With the help of a trusty pet and a new friend, you’ll explore the mysteries of the island to find a way out or make a new life for yourselves there forever. The first console version of the series greatly upgrades the visual quality and depth of the game, immersing the player in a survival adventure like never before. Vibrant 3D graphics paint the island environment, weather systems, and various items as more life-like than ever. Full use of Wii-mote and Nunchuk controls allow you to experience realistic movements with a variety of mini-games including fishing, carpentry, fire-making and more. An island tutorial and a greater focus on exploration enhances the accessibility and fun factor for new players. Dependable pets improve item gathering and provide entertainment by playing music or dancing with you. Recruit a friend for around 40 mini-games, including new, cooperative games - the better you play, the bigger your reward. [Konami]… Expand"}, {"name": "Earthfall", "details_link": "https://www.metacritic.com/game/playstation-4/earthfall", "publisher": "Holospark", "release_date": "Jul 13 2018", "developers": ["Holospark"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 54, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/251508549224b3cec9277d003c4659a1-98.jpg", "descriptions": "Earthfall is a 4-player cooperative shooter that challenges players to survive waves of killer alien drones and their inscrutable masters. Traverse the Pacific Northwest with friends or AI teammates in a desperate guerrilla war against an invading extraterrestrial force. Pit yourself againstEarthfall is a 4-player cooperative shooter that challenges players to survive waves of killer alien drones and their inscrutable masters. Traverse the Pacific Northwest with friends or AI teammates in a desperate guerrilla war against an invading extraterrestrial force. Pit yourself against the ever-changing horde and save what’s left of humanity, utilize futuristic weaponry, upgrade deployable barricades with fire or electricity, control mounted turrets, and battle through ten levels of story-driven co-operative play. … Expand"}, {"name": "Time Carnage", "details_link": "https://www.metacritic.com/game/playstation-4/time-carnage", "publisher": "Wales Interactive", "release_date": "Apr 10 2018", "developers": ["Wales Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 54, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/8/9ca053614fb41db904a5fe4e8de15b31-98.jpg", "descriptions": "Time Carnage is a frantic VR survival shooter. Travel through time and wreak havoc through worlds swarming with dinosaurs, monsters, robots, and zombies."}, {"name": "Ghostbusters: The Video Game", "details_link": "https://www.metacritic.com/game/psp/ghostbusters-the-video-game", "publisher": "Atari", "release_date": "Oct 30 2009", "developers": ["Red Fly Studio"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 54, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/c7686f9a5a8ee1fcc97bc827b25408ad-98.jpg", "descriptions": "Ghostbusters: The Video Game on the PSP offers the ability to switch between four equipment sets to access eight unique proton pack functions and use gadgets like the PKE Meter and Paragoggles to scan and analyze targets. Get pulled into the world of the paranormal, unleash your blast streamGhostbusters: The Video Game on the PSP offers the ability to switch between four equipment sets to access eight unique proton pack functions and use gadgets like the PKE Meter and Paragoggles to scan and analyze targets. Get pulled into the world of the paranormal, unleash your blast stream and tear it up on the go. [Atari]… Expand"}, {"name": "Disney Sing It", "details_link": "https://www.metacritic.com/game/playstation-3/disney-sing-it", "publisher": "Disney Interactive Studios", "release_date": "Oct 21 2008", "developers": ["Zoe Mode"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 54, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/2/7622239988cc872d434f5ef086fa01c8-98.jpg", "descriptions": "Best out to some of today's hippest tunes and have a blast with your friends and favorite Disney stars. Sing to 35 chart-topping tunes including hits from Camp Rock, High School Musical, Hanna Montana, Cheetah Girls, as well as hits from Aly & AJ, Corbin Blue, Everlife, Jordan Pruitt, andBest out to some of today's hippest tunes and have a blast with your friends and favorite Disney stars. Sing to 35 chart-topping tunes including hits from Camp Rock, High School Musical, Hanna Montana, Cheetah Girls, as well as hits from Aly & AJ, Corbin Blue, Everlife, Jordan Pruitt, and more. Compete with and against friends in numerous multiplayer modes, including Duet, Versus, and Team Play. [Disney]… Expand"}]