[{"name": "Dark Souls Remastered", "details_link": "https://www.metacritic.com/game/switch/dark-souls-remastered", "publisher": "Namco Bandai Games", "release_date": "Oct 19 2018", "developers": ["From Software"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/c7d46c4653ba2ee14da1970b3909bbce-98.jpg", "descriptions": "Re-experience the critically acclaimed, genre-defining game that started it all. Beautifully remastered, return to Lordran in stunning detail. DARK SOULS: REMASTERED includes the main game plus the Artorias of the Abyss DLC."}, {"name": "2010 FIFA World Cup South Africa", "details_link": "https://www.metacritic.com/game/xbox-360/2010-fifa-world-cup-south-africa", "publisher": "EA Sports", "release_date": "Apr 27 2010", "developers": ["Electronic Arts"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/e5a7dfa9c3f8c2855f2c587c6d34a821-98.jpg", "descriptions": "EA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from eachEA SPORTS 2010 FIFA World Cup South Africa features all the emotion and passion of the fiercest national rivalries battling on the world’s biggest stage, with all 199 national teams that took part in qualification, all 10 official stadiums to be used in South Africa and stadiums from each qualifying region. Gamers can play as their home nation from qualification right through to a virtual reproduction of the FIFA World Cup Final and feel what it is like to score the goal that lifts a nation.  Everything fans love about the World Cup comes to life in spectacular  detail, including confetti rain, streamers, & fireworks - just like the official tournament. [Electronic Arts]… Expand"}, {"name": "The Great Ace Attorney Chronicles", "details_link": "https://www.metacritic.com/game/pc/the-great-ace-attorney-chronicles", "publisher": "Capcom", "release_date": "Jul 27 2021", "developers": ["Capcom"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/270b0bbba909088aa3ca17e1e944505e-98.jpg", "descriptions": "With all the fun and drama of the Ace Attorney series set against the backdrop of Victorian-era Britain and Japan, there's sure to be no \"Objection!\" to the adventures of Ryunosuke Naruhodo as he turns the courtroom upside down. Featuring an intriguing overarching mystery spanning across twoWith all the fun and drama of the Ace Attorney series set against the backdrop of Victorian-era Britain and Japan, there's sure to be no \"Objection!\" to the adventures of Ryunosuke Naruhodo as he turns the courtroom upside down. Featuring an intriguing overarching mystery spanning across two games, it promises to be the most engrossing story in the series yet. [Capcom]… Expand"}, {"name": "FIFA Soccer 10", "details_link": "https://www.metacritic.com/game/psp/fifa-soccer-10", "publisher": "Electronic Arts", "release_date": "Oct 20 2009", "developers": ["EA Sports", "HB Studios Multimedia"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/f337ad2355ffeada9b4a9a53bc47b4f8-98.jpg", "descriptions": "On the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. OnOn the pitch, critical gameplay fundamentals have been enhanced to ensure that FIFA Soccer 10 mirrors real-world soccer, providing more sophisticated ball control, and physical interaction between players. In addition, players now move, behave and position themselves more realistically. On attack, players analyze space more effectively, curve their runs in an attempt to stay onside, create passing lanes naturally, and drive for more variety in attacking options. On defense, new concepts like position priority enable defenders to multitask so dangerous spaces left open by teammates out of position are covered. Plus, slide tackle targeting, press marking, and better-urgency clearance logic provide new options that make defending a tactical skill in FIFA Soccer 10. In goal, a myriad of improvements and refinements to goalkeeper intelligence result in a more responsive and powerful rushing system and ultra-realistic saves. Better balance on lofted through balls, improved goalkeeper intelligence, more realistic shooting mechanics with less shots hitting the goal posts, a practice arena to perfect skills, and a more immersive soccer experience through continuous play and quick free kicks are just a few of the issues raised by fans and addressed in FIFA Soccer 10. Three new innovations revealed today at E3 have been developed to change the player control experience in FIFA Soccer 10. The first-ever true 360 degree dribbling system gives players finer control of the ball, enabling them to find spaces between defenders that previously were not possible. Using an all-new animation technology, skilled dribblers now have the ability to face the defender and use highly responsive lateral dribbling to skip past him. An innovative concept called Freedom in Physical Play enables players to perform wider dribble touches and new collision sharing creates a varied, less predictable, and extended fight for possession between the dribbler and a defender.\rFIFA Soccer 10 also features a deeper iteration of the ever-popular Manager Mode with more than 50 major improvements, including new match realism, realistic player transfers based on multiple decision points, and true-to-life player growth curves. [Electronic Arts]… Expand"}, {"name": "Gravity Rush", "details_link": "https://www.metacritic.com/game/playstation-vita/gravity-rush", "publisher": "SCEA", "release_date": "Jun 12 2012", "developers": ["SCE Japan Studio"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Platformer", "Open-World", "3D", "3D"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/a3a5f56317824d375eeb6a3a19b50ef8-98.jpg", "descriptions": "Gravity Rush has players manipulate gravity to save your world from destruction. Gain a new perspective as you assume the role of Kat, a head-string girl looking for a way to protect her future in a world that's crumbling under her feet. Tilt and move the Vita, taking gravity into your ownGravity Rush has players manipulate gravity to save your world from destruction. Gain a new perspective as you assume the role of Kat, a head-string girl looking for a way to protect her future in a world that's crumbling under her feet. Tilt and move the Vita, taking gravity into your own hands to deliver devastating attacks, uncover the secrets to your past and explore a mysterious world.… Expand"}, {"name": "Pokemon Omega Ruby", "details_link": "https://www.metacritic.com/game/3ds/pokemon-omega-ruby", "publisher": "Nintendo", "release_date": "Nov 21 2014", "developers": ["Game Freak"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Console-style RPG", "Japanese-Style", "Trainer"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/1ed85bc4f779384e08bf1e0abb42bcdf-98.jpg", "descriptions": "Pokemon gamers initially experienced Pokemon Ruby Version and Pokemon Sapphire Version when it launched in 2003 for the GBA. Now, a new generation of Pokemon people can experience the storyline that unfolds in Pokemon Omega Ruby and Pokemon Alpha Sapphire."}, {"name": "Horizon Zero Dawn: The Frozen Wilds", "details_link": "https://www.metacritic.com/game/playstation-4/horizon-zero-dawn-the-frozen-wilds", "publisher": "Sony Interactive Entertainment", "release_date": "Nov  7 2017", "developers": ["Guerrilla"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/294ed7083ef02b454011ba0ee54895a4-98.jpg", "descriptions": "Beyond the northern mountains, the borderlands of the Banuk tribe challenge all who dare enter to survive the extremes. But now this frozen wilderness harbors a new threat, and for Aloy, a new mystery - one she’s determined to solve.  The Frozen Wilds contains additional content for HorizonBeyond the northern mountains, the borderlands of the Banuk tribe challenge all who dare enter to survive the extremes. But now this frozen wilderness harbors a new threat, and for Aloy, a new mystery - one she’s determined to solve.  The Frozen Wilds contains additional content for Horizon Zero Dawn, including new storylines, characters and experiences in a beautiful but unforgiving new area. Uncover a compelling new story. Explore a brand new area. Face new machines. To use this download, you need Horizon Zero Dawn. [Sony]\r… Expand"}, {"name": "Ninja Gaiden: Dragon Sword", "details_link": "https://www.metacritic.com/game/ds/ninja-gaiden-dragon-sword", "publisher": "Tecmo", "release_date": "Mar 25 2008", "developers": ["Team Ninja"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/9293b21bb5e58900bd66388ef40bb33e-98.jpg", "descriptions": "Uncover all the mysteries of Ninja Gaiden Dragon Sword as you fight enemy ninjas and battle various fiends while taking on the role of Master Ninja, Ryu Hayabusa, in an all new storyline for the Nintendo DS. Innovative DS Stylus Functionality: Smoothly maneuver and fight through levels withUncover all the mysteries of Ninja Gaiden Dragon Sword as you fight enemy ninjas and battle various fiends while taking on the role of Master Ninja, Ryu Hayabusa, in an all new storyline for the Nintendo DS. Innovative DS Stylus Functionality: Smoothly maneuver and fight through levels with the intuitive operaton of the DS stylus. Hold the DS with one hand like a book to assist in the operation of the stylus which allows players to view a wider range of scenes. Cast Ninpo (Ninja Magic) by Letter Input Using the DS Stylus, draw various letters to quickly execute numerous types of Ninnpo. Experience Team NINJA's first original action game for the Nintendo DS. [Tecmo]… Expand"}, {"name": "Rhythm Heaven Fever", "details_link": "https://www.metacritic.com/game/wii/rhythm-heaven-fever", "publisher": "Nintendo", "release_date": "Feb 13 2012", "developers": ["Nintendo"], "platforms": "Wii", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/15eb30add485d6fcfb178cf6d5fa680a-98.jpg", "descriptions": "Known as \"Beat the Beat: Rhythm Paradise\" in the UK/EU. Feel the Beat and Get into the Rhythm Rhythm Heaven Fever promise to be the quirkiest, most charming rhythm game you and your friends will ever play."}, {"name": "Ms. 'Splosion Man", "details_link": "https://www.metacritic.com/game/xbox-360/ms-splosion-man", "publisher": "Twisted Pixel Games", "release_date": "Jul 13 2011", "developers": ["Twisted Pixel Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/80e81d26dd1e87c4d59ea624f6f7988c-98.jpg", "descriptions": "Ms. 'Splosion Man is the sequel to the 2009 XBLA title 'Splosion Man."}, {"name": "Detention", "details_link": "https://www.metacritic.com/game/playstation-4/detention", "publisher": "Coconut Island Games", "release_date": "Oct  3 2017", "developers": ["Red Candle Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/b42ecec44c948945981794df1495300c-98.jpg", "descriptions": "Detention is an unique atmospheric horror game heavily influenced by Taiwanese/East Asian culture, religious elements, and mythology. Venture into a school beset by hostile supernatural events to uncover stories behind the haunted place."}, {"name": "SUPERHOT", "details_link": "https://www.metacritic.com/game/playstation-4/superhot", "publisher": "SUPERHOT", "release_date": "Jul 21 2017", "developers": ["SUPERHOT"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/18fa0564c431c61aa389ef9fb4602243-98.jpg", "descriptions": "SUPERHOT is the first person shooter where time moves only when you move. No regenerating health bars. No conveniently placed ammo drops. It's just you, outnumbered and outgunned, grabbing the weapons of fallen enemies to shoot, slice, and maneuver through a hurricane of slow-motion bullets."}, {"name": "SUPERHOT", "details_link": "https://www.metacritic.com/game/xbox-one/superhot", "publisher": "SUPERHOT", "release_date": "May  3 2016", "developers": ["SUPERHOT"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/7f4557e1ca160aacec4829046f5643f6-98.jpg", "descriptions": "SUPERHOT is the first person shooter where time moves only when you move. With its gameplay and unique, stylized graphics SUPERHOT aims to finally add something new and disruptive to the FPS genre. See the bullets crawling towards you as you carefully plan your steps and aim your gun. EnjoySUPERHOT is the first person shooter where time moves only when you move. With its gameplay and unique, stylized graphics SUPERHOT aims to finally add something new and disruptive to the FPS genre. See the bullets crawling towards you as you carefully plan your steps and aim your gun. Enjoy the mayhem that is unleashed as you put that plan into motion. Dodge bullets. Take out your enemies. One step at a time. [SuperHot Team]… Expand"}, {"name": "CastleStorm", "details_link": "https://www.metacritic.com/game/wii-u/castlestorm", "publisher": "Zen Studios", "release_date": "Dec 26 2013", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 3", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox 360", "Xbox One", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Defense"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/fe75deb53a3bd10c9738dbc5c51f413e-98.jpg", "descriptions": "Set in a colorful medieval world, CastleStorm is a new breed of 2D archery projectile warfare and 2D physics-based structure destruction game."}, {"name": "EverQuest II: Rise of Kunark", "details_link": "https://www.metacritic.com/game/pc/everquest-ii-rise-of-kunark", "publisher": "Sony Online Entertainment", "release_date": "Nov 13 2007", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/b514e7035a23ac84770198f9f6ec3050-98.jpg", "descriptions": "Buried beneath a war-ruined land ravaged by centuries of conflict, a forgotten enemy rises.  Exiled from their homeland and banished from Norrath’s history, an ancient race emerges to uncover artifacts long thought lost.  Engage in all-new adventures as you embark on a crusade to reveal theBuried beneath a war-ruined land ravaged by centuries of conflict, a forgotten enemy rises.  Exiled from their homeland and banished from Norrath’s history, an ancient race emerges to uncover artifacts long thought lost.  Engage in all-new adventures as you embark on a crusade to reveal the truth of the wars between the reborn Iksar Empire and the Sarnak. Adventure awaits in the fabled land of Kunark. [Sony]… Expand"}, {"name": "Ninja Gaiden Sigma 2", "details_link": "https://www.metacritic.com/game/playstation-3/ninja-gaiden-sigma-2", "publisher": "Tecmo", "release_date": "Sep 29 2009", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation Vita", "PlayStation 3"], "num_players": "2 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/fbbaab738249d4c65e06e77d278c1e2c-98.jpg", "descriptions": "The most intense, challenging, action-packed ninja adventure is back, exclusively on the PS3. From Tokyo to New York, follow super ninja Ryu as he encounters vicious enemies and acquires an extensive assortment of ninja weaponry along the way. New Playable Characters: Ninja Gaiden's Rachel,The most intense, challenging, action-packed ninja adventure is back, exclusively on the PS3. From Tokyo to New York, follow super ninja Ryu as he encounters vicious enemies and acquires an extensive assortment of ninja weaponry along the way. New Playable Characters: Ninja Gaiden's Rachel, Ayane from the Dead or Alive series and Momiji from Ninja Gaiden Dragon Sword appear as sexy new playable characters. Online Co-op: Two people can engage in online co-op play, with voice chat, in 10 different stages (in 4 difficulty settings) to complete special missions. Rankings from each mission are recorded and posted online, where gamers can choose their opponents based on players' mission stats. Visual Diversity: Over 30 unique characters, 17 stages with a variety of environments, and a storyline which unfolds in 70 impressive cut-scenes. New Enemies: A variety of new enemies and bosses have been incorporated into the stunning enhanced environments. Variable AI: Contributing to the increased difficulty level, the gameplay differs each time you appear in a level as enemies engage in a variety of different actions as they assess the current situation. Gameplay Innovation: A finishing blow system can be used in battle to quickly defeat an enemy in one dynamic action. Weapon Rewards: The weapons you acquire can be leveled up to strengthen their power and gain new battle techniques. Enhanced Graphics and Sound: Full HD 1080p output and 5.1ch surround sound allows players to experience the game in total high definition. [Tecmo]… Expand"}, {"name": "Dragon Quest Heroes: Rocket Slime", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-heroes-rocket-slime", "publisher": "Square Enix", "release_date": "Sep 19 2006", "developers": ["Square Enix", "TOSE"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/7c4847bd960bdf757159afe883ff2993-98.jpg", "descriptions": "(Known in Japan as \"Slime Mori Mori Dragon Quest 2\")  The hero of this action-adventure is a slime—one of the most popular monsters from the Dragon Quest series. The game is set in the kingdom of Slimenia, a peaceful land that is suddenly invaded by a mysterious cartel called \"the Plob,\" who(Known in Japan as \"Slime Mori Mori Dragon Quest 2\")  The hero of this action-adventure is a slime—one of the most popular monsters from the Dragon Quest series. The game is set in the kingdom of Slimenia, a peaceful land that is suddenly invaded by a mysterious cartel called \"the Plob,\" who then proceed to kidnap all the slimes in the capital city of Boingburg. Our protagonist, Rocket, is the only slime left behind, and must embark on a journey throughout Slimenia to save his friends and uncover the Plob's nefarious plot. The adventure stages consist of our hero bouncing and stretching, as well as carrying various objects on his head, while solving the mysteries behind each area, and rescuing his captured slime friends along the way. Simple, streamlined controls allow players of all ages and skill levels to take part in the action with ease. Each adventure stage culminates in Rocket hopping aboard a colossal slime-shaped war machine called the Schleiman Tank and battling it out with the enemy’s Monster Tanks. Customize tanks by collecting a vast array of weapons and items. Call upon allies, each with their own individual personality and abilities, to aid in the heated tank battles. Even shoot your fellow slimes so they can infiltrate and sabotage the enemy’s Monster Tank. Pit tanks against a friend’s in exciting player-vs.-player action, using the Nintendo DS wireless multiplayer game feature. [Square Enix]… Expand"}, {"name": "Sleeping Dogs", "details_link": "https://www.metacritic.com/game/playstation-3/sleeping-dogs", "publisher": "Square Enix", "release_date": "Aug 14 2012", "developers": ["United Front Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/6b0a386d86d5cf2c8ae2e767811edbd8-98.jpg", "descriptions": "Sleeping Dogs is an open world cop drama set in the vibrant city of Hong Kong. Taking the role of undercover cop Wei Shen, players must take down one of the world's most lethal criminal organizations from the inside. Featuring imaginative combat systems, Sleeping Dogs empowers enablesSleeping Dogs is an open world cop drama set in the vibrant city of Hong Kong. Taking the role of undercover cop Wei Shen, players must take down one of the world's most lethal criminal organizations from the inside. Featuring imaginative combat systems, Sleeping Dogs empowers enables players to perform an array of martial arts moves, singlehandedly taking on numerous opponents. Players perform visceral kicks and combos, vicious counters and a cinematic set of environmental takedowns making use of real-world items from circular saws to phone booths, incinerators to refrigerator doors.… Expand"}, {"name": "Contra 4", "details_link": "https://www.metacritic.com/game/ds/contra-4", "publisher": "Konami", "release_date": "Nov 13 2007", "developers": ["WayForward"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/5cf8cc327272be2ac78aa626dc7e85b3-98.jpg", "descriptions": "Contra 4 takes place two years after \"Contra III: The Alien Wars,\" first released on the Super Nintendo in 1992. Heroes Bill and Lance again must team up to take down an oncoming alien invasion and its leader, Black Viper. Contra 4 features the same style of 2D side-scrolling gameplay thatContra 4 takes place two years after \"Contra III: The Alien Wars,\" first released on the Super Nintendo in 1992. Heroes Bill and Lance again must team up to take down an oncoming alien invasion and its leader, Black Viper. Contra 4 features the same style of 2D side-scrolling gameplay that established the series 20 years ago. Players combat alien hordes with a variety of futuristic weapons while attempting to avoid pitfalls and other hazards along the way. Contra 4's action extends to both screens on the DS, allowing for larger environments and boss encounters. And as is a hallmark of the series, Contra 4 retain two-player simultaneous gameplay.… Expand"}, {"name": "Street Fighter: 30th Anniversary Collection", "details_link": "https://www.metacritic.com/game/playstation-4/street-fighter-30th-anniversary-collection", "publisher": "Capcom", "release_date": "May 29 2018", "developers": ["Capcom", "Digital Eclipse"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/667823651d38a662ab777980306ec321-98.jpg", "descriptions": "Celebrate the 30th Anniversary of the iconic Street Fighter franchise with the ultimate tribute to its arcade legacy in the Street Fighter 30th Anniversary Collection. This content-rich all-in-one package highlights the series' past in an anthology of 12 classic titles with arcade-perfectCelebrate the 30th Anniversary of the iconic Street Fighter franchise with the ultimate tribute to its arcade legacy in the Street Fighter 30th Anniversary Collection. This content-rich all-in-one package highlights the series' past in an anthology of 12 classic titles with arcade-perfect balancing including the original Street Fighter, Street Fighter II, Street Fighter II: Champion Edition, Street Fighter II: Hyper Fighting, Super Street Fighter II, Super Street Fighter II: Turbo, Street Fighter Alpha, Street Fighter Alpha 2, Street Fighter Alpha 3, Street Fighter III, Street Fighter III: 2nd Impact and Street Fighter III: Third Strike.The collection also offers a definitive online experience across four of the included titles; Street Fighter II: Hyper Fighting, Super Street Fighter II: Turbo, Street Fighter Alpha 3 and Street Fighter III: Third Strike. Street Fighter players can recreate the classic arcade gaming experience by competing against the CPU whilst waiting for friends in online battles where they can put their fighting skills to the ultimate test. Fans of the series can also enjoy diving into the past 30 years of Street Fighter history with rich character bios, a huge Museum Mode including never before seen art and interactive timeline, and listen to tracks in the Music Player.GAMEPLAY FEATURES:* Celebrate 30 years of the most iconic fighting game series The hit series with over 39 million units in global sales returns for its 30th anniversary celebration with a compilation of 12 classic arcade titles in one package.* Relive the titles that made gaming history Includes the original Street Fighter released in 1987 which introduced two of gaming's most famous heroes, Ryu and Ken. Additionally, the iconic Street Fighter II became the first ever one-on-one video game that gave players a choice of characters, including the debut of the series' strongest female Chun-Li. Street Fighter III continued the core numbered series and was the first game to introduce the parry attack.* New gameplay options including online play Players can utilize save states as they progress through the game offline. In addition, players can duke it out online in four classic titles (Street Fighter II: Hyper Fighting, Super Street Fighter II: Turbo, Street Fighter Alpha 3 and Street Fighter III: Third Strike). In addition to Ranked and Casual Match options, up to four players can join a lobby where they can play against the CPU while waiting for their match. Each title will have their own Global leaderboard and the \"rewind\" tech ensures low-latency online battles.* Hadoken your way down memory lane Revisit historic moments from the series and explore an interactive timeline of events that helped create one of the world's leading fighting game series. View stunning pieces of concept art and uncover little known facts behind each game release.* Learn more about fan-favorite characters Scroll through character bios and learn new details about series favorites whilst enjoying sprites and key animations to see how the classic fighters have evolved over time.* Remember the tunes! Sit back and enjoy the most memorable Street Fighter tracks from the collection in the Music Player.… Expand"}, {"name": "Rhythm Heaven", "details_link": "https://www.metacritic.com/game/ds/rhythm-heaven", "publisher": "Nintendo", "release_date": "Apr  5 2009", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/594791d112294fcd6c5a8b40a3e5e3ba-98.jpg", "descriptions": "(Also known as \"Rhythm Paradise\")  Rhythm Heaven is a simple and infectious rhythm game that anyone can play. If you can tap your finger in time to music, you'll get the hang of Rhythm Heaven in no time. Players hold the Nintendo DS system sideways like a book and tap their stylus on the(Also known as \"Rhythm Paradise\")  Rhythm Heaven is a simple and infectious rhythm game that anyone can play. If you can tap your finger in time to music, you'll get the hang of Rhythm Heaven in no time. Players hold the Nintendo DS system sideways like a book and tap their stylus on the touch screen to the rhythm of the music. Players tap, slide or flick the stylus to hit the right beat. Rhythm Heaven features catchy tunes, charming characters and a wide variety of rhythm games. [Nintendo]… Expand"}, {"name": "Collection of Mana", "details_link": "https://www.metacritic.com/game/switch/collection-of-mana", "publisher": "Square Enix", "release_date": "Jun 11 2019", "developers": ["M2"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/0bceee48064e3b42c7874eb034618955-98.jpg", "descriptions": "The long-awaited \"Trials of Mana\" is now available outside of Japan. Play all three games in the original Mana series. Quintessential JRPG series \"Collection of Mana\" is now on Nintendo Switch! Fall in love with the Mana series all over again, including the first-ever release of theThe long-awaited \"Trials of Mana\" is now available outside of Japan. Play all three games in the original Mana series. Quintessential JRPG series \"Collection of Mana\" is now on Nintendo Switch! Fall in love with the Mana series all over again, including the first-ever release of the action-packed third game in the trilogy: \"Trials of Mana\".… Expand"}, {"name": "Citizen Sleeper", "details_link": "https://www.metacritic.com/game/switch/citizen-sleeper", "publisher": "Fellow Traveller", "release_date": "May  5 2022", "developers": ["Jump Over The Age"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Western-Style"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/be5b195205cd507d21ad6a75c2da8aba-98.jpg", "descriptions": "Live the life of an escaped worker, washed-up on a lawless station at the edge of an interstellar society. Inspired by the flexibility and freedom of Tabletop RPGs, explore the station, choose your friends, escape your past and change your future.\rLIFE ON ERLIN'S EYE\rAn abandoned stationLive the life of an escaped worker, washed-up on a lawless station at the edge of an interstellar society. Inspired by the flexibility and freedom of Tabletop RPGs, explore the station, choose your friends, escape your past and change your future.\rLIFE ON ERLIN'S EYE\rAn abandoned station on the edge of a system in crisis. Run down, chaotic, unruly, and alive—it was founded by idealists in the shadow of a corporate collapse. Now it is held together by anarchic alliances, ramshackle factions and a shared desire to be free from the gravity of corporate control.\r DO THE WORK. GET PAID. SURVIVE.\rEvery cycle you get up and choose what to do with your time. Toil in the yards, or take a bar shift. Search the markets for rare components or grab some street food. Make or break alliances, uncover truths and escape those that hunt you. Learn to survive and ultimately thrive, one cycle at a time.\r TURN UP FOR YOUR FRIENDS\rThe station plays host to characters from all walks of life, trying to eke out an existence among the stars. Salvagers, engineers, hackers, bartenders, street-food vendors, each has a history which brought them here. You choose which of them you wish to help, and together you will shape your future.\r ACCESS THEIR SECRETS\rHack into the station’s cloud to access decades of digital data, uncover new areas and unlock secrets. This is your unique power, and with it you can change your future. Corporate secrets, rogue AIs and troves of lost data await those willing to dive into the depths of the station’s networks.\r YOU WERE MADE TO DIE\rEssen-Arp: to them you are just property, one more asset in a portfolio that stretches across the stars. You are the product of an abusive system, in a universe where humanity’s expansion is marked by exploitation and extraction. Escape the makers of your decaying body, and chart your own path in a richly imagined, deeply relevant sci-fi world which explores ideas of precarity, personhood and freedom.… Expand"}, {"name": "Atelier Sophie 2: The Alchemist of the Mysterious Dream", "details_link": "https://www.metacritic.com/game/pc/atelier-sophie-2-the-alchemist-of-the-mysterious-dream", "publisher": "Koei Tecmo Games", "release_date": "Feb 25 2022", "developers": ["Gust"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/9/826a8fdbc224f8cb3eeeb0f161d19615-98.jpg", "descriptions": "A mysterious story of a mysterious dream...\rOne of the stories experienced throughout the Alchemist Sophie’s many adventures, as she continued her travels after leaving her hometown of Kirchen Bell.\rThis is Sophie’s adventure as she searches for her friend Plachta in the dream world ErdeA mysterious story of a mysterious dream...\rOne of the stories experienced throughout the Alchemist Sophie’s many adventures, as she continued her travels after leaving her hometown of Kirchen Bell.\rThis is Sophie’s adventure as she searches for her friend Plachta in the dream world Erde Wiege, where they become separated, and shows the bonds she forms with the people she meets and passing of hearts.\r ■Evolved turn-based battles & seamless transitions!\rIn the 6 member party turn-based battles, the 3 members in the front and 3 in the back form 2 teams cooperating “multi-linked turn battles”, and transitions from exploration to battles without loading times in “seamless battles”, the entire game can be enjoyed at a great pace.\r ■2 types of panels for everyone to enjoy synthesis!\rThis game uses panel synthesis, the synthesis system of the Mysterious series, where materials are placed in the panel slots to create new items in this puzzle-like feature. By placing the certain materials in the slots, various effects can be produced.\rThere are 2 types of panels in this game that players can select from : a regular panel and a restricted panel that has a higher synthesis difficulty level.\rThe board of the restricted panel is fairly complex, but when materials are placed just right, items with high effects can be synthesized, which can't be generated from the regular panel. … Expand"}, {"name": "Path of Exile: The Fall of Oriath", "details_link": "https://www.metacritic.com/game/xbox-one/path-of-exile-the-fall-of-oriath", "publisher": "Grinding Gear Games", "release_date": "Aug 24 2017", "developers": ["Grinding Gear Games"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/c32c9a029bba45030bcdc79fbd4df4a0-98.jpg", "descriptions": "Path of Exile is an online Action RPG set in an unforgiving world that boasts deep character and item customization, endless replayability, countless valuable treasures, and a massive, customizable end-game. The entire game is available for free. Its development is funded through optionalPath of Exile is an online Action RPG set in an unforgiving world that boasts deep character and item customization, endless replayability, countless valuable treasures, and a massive, customizable end-game. The entire game is available for free. Its development is funded through optional community support in exchange for cosmetic character garb to enhance your immersive experience. To compete in Path of Exile's leaderboards, all you'll need is your skill and not your wallet! There are no pay walls, and no paying for power. Path of Exile is developed by Grinding Gear Games, an independent studio from New Zealand that keeps gameplay fresh by providing frequent updates to the core content. Additionally, they offer a new Challenge League every thirteen weeks. These are competitive leagues that offer a new variation on gameplay where players can compete for bragging rights and rewards. [Xbox.com]… Expand"}, {"name": "The Legend of Heroes: Trails in the Sky the 3rd", "details_link": "https://www.metacritic.com/game/pc/the-legend-of-heroes-trails-in-the-sky-the-3rd", "publisher": "XSEED Games", "release_date": "May  3 2017", "developers": ["Falcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/b85fd242bac575dcba4cb69c29ae7231-98.jpg", "descriptions": "Half a year after Trails in the Sky SC, Father Kevin Graham takes on a routine mission on behalf of the Septian Church. He and his partner are then plunged into a realm that follows an unnaturally strict set of rules and is as intent to open old wounds as it is to keep them behind closed doors."}, {"name": "SteamWorld Heist", "details_link": "https://www.metacritic.com/game/playstation-4/steamworld-heist", "publisher": "Image & Form", "release_date": "Jun  7 2016", "developers": ["Image & Form"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation Vita", "Stadia", "Switch", "Wii U", "PlayStation 4"], "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/dda8dd8b9dc22215fd78063e267460c7-98.jpg", "descriptions": "Join Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier byJoin Captain Piper Faraday, smuggler and occasional pirate, as she recruits a rag-tag team of steam-driven robots and sets out on a daring adventure. With your hearty crew you’ll board, loot and shoot your way through enemy spaceships. Overcome the challenges of the vast frontier by upgrading your robots with unique abilities, weapons – and even stylish hats!… Expand"}, {"name": "Dark Age of Camelot: Catacombs", "details_link": "https://www.metacritic.com/game/pc/dark-age-of-camelot-catacombs", "publisher": "Mythic Entertainment", "release_date": "Dec  7 2004", "developers": ["Mythic Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/311515df4bd9855c3e232a0b5cd84ad3-98.jpg", "descriptions": "Catacombs is the third expansion pack for Dark Age of Camelot in which players are given the opportunity to explore underground cities ? with attached adventuring areas ? based on the backstory of one underground player race per Realm. Many of these new adventures will be instanced, givingCatacombs is the third expansion pack for Dark Age of Camelot in which players are given the opportunity to explore underground cities ? with attached adventuring areas ? based on the backstory of one underground player race per Realm. Many of these new adventures will be instanced, giving the player the chance to explore the underground world of Catacombs on their own schedule. The expansion features a major art upgrade to player character models that provides more detailed facial features, hairstyles, skin tones as well as enhanced armor and clothing options. The expansion also introduces one new player class per Realm. [Mythic Entertainment]… Expand"}, {"name": "ABZU", "details_link": "https://www.metacritic.com/game/pc/abzu", "publisher": "505 Games", "release_date": "Aug  2 2016", "developers": ["Giant Squid"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/cd562d2497b05fc418eed91db3ac04ce-98.jpg", "descriptions": "From the art director of Journey, ABZÛ is an underwater adventure that evokes the dream of diving. Immerse yourself in a vibrant hidden world bursting with color and life as you descend into the heart of the ocean. But beware as you swim deeper as dangers lurk in the depths."}, {"name": "The Messenger", "details_link": "https://www.metacritic.com/game/pc/the-messenger", "publisher": "Sabotage Studio", "release_date": "Aug 30 2018", "developers": ["Sabotage Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/7cbbc2f52914f5b26fdd601605749b76-98.jpg", "descriptions": "As a demon army besieges his village, a young ninja ventures through a cursed world, to deliver a scroll paramount to his clan’s survival. What begins as a classic action platformer soon unravels into an expansive time-traveling adventure full of thrills, surprises, and humor."}, {"name": "Pistol Whip", "details_link": "https://www.metacritic.com/game/pc/pistol-whip", "publisher": "Cloudhead Games", "release_date": "Nov  7 2019", "developers": ["Cloudhead Games"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/8a4c6b52bb4766f6e065c1c7e33545eb-98.jpg", "descriptions": "Pistol Whip is an unstoppable action-rhythm FPS. Journey through a cinematic bullet hell powered by a breakneck soundtrack to become the ultimate action hero legend."}, {"name": "Nintendogs: Dalmatian & Friends", "details_link": "https://www.metacritic.com/game/ds/nintendogs-dalmatian-friends", "publisher": "Nintendo", "release_date": "Oct 16 2006", "developers": ["Nintendo"], "platforms": "DS", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual Life", "Virtual", "Pet"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/ec9cd545992a5f41ce3bc3636df6e05c-98.jpg", "descriptions": "Go dotty for Nintendogs Dalmatian & Friends edition. The highly desirable Dalmatian is availalbe from the start; plus own teh most popular pups from previous editions: Boxer, German Shepherd, Golden Retriever, Yorkshire Terrier, Beagle and more. Link up with friends in Bark Mode and giveGo dotty for Nintendogs Dalmatian & Friends edition. The highly desirable Dalmatian is availalbe from the start; plus own teh most popular pups from previous editions: Boxer, German Shepherd, Golden Retriever, Yorkshire Terrier, Beagle and more. Link up with friends in Bark Mode and give them their own Dalmatian. Shary the puppy love among two million fans across Europe. [Nintendo Europe]… Expand"}, {"name": "Pokemon Legends: Arceus", "details_link": "https://www.metacritic.com/game/switch/pokemon-legends-arceus", "publisher": "Nintendo", "release_date": "Jan 28 2022", "developers": ["Game Freak"], "platforms": "Switch", "num_players": "2 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/6e2fed298673aae480fd703294dbed31-98.jpg", "descriptions": "A Bold New Direction. The Pokémon Legends: Arceus game honors past Pokémon games' core gameplay while infusing new action and RPG elements. You'll need to catch, survey, and research wild Pokémon in a long-gone era of the Sinnoh region to create and complete the region's first Pokédex.A Bold New Direction. The Pokémon Legends: Arceus game honors past Pokémon games' core gameplay while infusing new action and RPG elements. You'll need to catch, survey, and research wild Pokémon in a long-gone era of the Sinnoh region to create and complete the region's first Pokédex. \r\r-Catch Pokémon-\rTo catch Pokémon in the Pokémon Legends: Arceus game, you can observe them to learn their behavior, then carefully sneak up, aim your Poké Ball, and let fly!\r You can also have your ally Pokémon battle wild Pokémon that you hope to catch. Just throw the Poké Ball holding your ally Pokémon near a wild Pokémon, and you'll seamlessly enter battle and command your Pokémon by choosing from moves it knows.\r -An Adventure in the Sinnoh of Days Gone By-\rYou'll be brought to the Sinnoh region, the setting for the Pokémon Diamond and Pokémon Pearl games. But this story unfolds in a long-gone era, before ideas such as being a Pokémon Trainer or having a Pokémon League even existed.\r All around, you'll find Pokémon living wild in harsh environments that make for a Sinnoh unlike the region you may remember from the days of the Pokémon Diamond and Pokémon Pearl games.\r The Poké Balls of old were apparently built a little differently from the ones we know so well. They were made mostly of wood, and steam puffed from their tops when Pokémon were caught. \r\r-Meet Your First Partner Pokémon-\rAs you start off on your adventure to create the region's first Pokédex, you'll be able to choose Rowlet, Cyndaquil, or Oshawott as a partner.\r These three Pokémon arrived with a Pokémon Professor, who encountered them on research excursions to various regions. \r\rRowlet\rCategory: Grass Quill Pokémon\rType: Grass/Flying\rHeight: 1'\rWeight: 3.3 lbs.\r Rowlet is a Pokémon from the Alola region. It uses photosynthesis to store up energy during the day, while becoming active at night. Silently it glides, drawing near its targets. Before they even notice it, it begins to pelt them with vicious kicks.\r Cyndaquil\rCategory: Fire Mouse Pokémon \rType: Fire\rHeight: 1'8\"\rWeight: 17.4 lbs.\r Cyndaquil is a Pokémon from the Johto region. It is timid and always curls itself up in a ball. When it's surprised, the flames on its back flare up stronger. When it is attacked, it uses its flames to protect itself.\r Oshawott\rCategory: Sea Otter Pokémon\rType: Water\rHeight: 1'8\"\rWeight: 13 lbs.\r Oshawott is a Pokémon from the Unova region. With the scalchop on its stomach, it blocks opponents' attacks, then retaliates immediately by slashing. Its scalchop can be used to break open hard Berries as well.\r Arceus\rHolding the key to this tale is the Pokémon known as Arceus. Arceus is said to have shaped all there is in this world. Just how is this mighty Pokémon connected to your journey?\r Category: Alpha Pokémon\rType: Normal\rHeight: 10'6\"\rWeight: 705.5 lbs.… Expand"}, {"name": "Hypnospace Outlaw", "details_link": "https://www.metacritic.com/game/pc/hypnospace-outlaw", "publisher": "No More Robots", "release_date": "Mar 12 2019", "developers": ["Tendershoot"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/f125aed2efad0c2fde5a05e0816e7083-98.jpg", "descriptions": "Greetings Enforcer, and thank you for enlisting in the Hypnospace Patrol Department. As the world falls into its slumber, Hypnospace becomes a bustling global village. These virtual streets aren't going to police themselves."}, {"name": "Little Nightmares", "details_link": "https://www.metacritic.com/game/xbox-one/little-nightmares", "publisher": "Bandai Namco Games", "release_date": "Apr 28 2017", "developers": ["Tarsier Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One"], "genres": ["Action Adventure", "General", "Linear"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/8c0557283d10548c3ac07104c6288863-98.jpg", "descriptions": "Immerse yourself in Little Nightmares, a dark whimsical tale that will confront you with your childhood fears. Help Six escape The Maw – a vast, mysterious vessel inhabited by corrupted souls looking for their next meal."}, {"name": "Stacking", "details_link": "https://www.metacritic.com/game/playstation-3/stacking", "publisher": "THQ", "release_date": "Feb  8 2011", "developers": ["Double Fine Productions"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/b861cd105576731f9cc55d3479004bc1-98.jpg", "descriptions": "Stacking is the second downloadable game produced by THQ and the award-winning Double Fine Productions. The adventure of Stacking requires players to capture and stack dolls together, then use each doll's unique abilities to solve the game's challenges.  As more puzzles are solved, new dollsStacking is the second downloadable game produced by THQ and the award-winning Double Fine Productions. The adventure of Stacking requires players to capture and stack dolls together, then use each doll's unique abilities to solve the game's challenges.  As more puzzles are solved, new dolls are acquired and the game's visually lush, carefully constructed story unfolds.  … Expand"}, {"name": "Overcooked! 2: Surf 'n' Turf", "details_link": "https://www.metacritic.com/game/switch/overcooked!-2-surf-n-turf", "publisher": "Team17", "release_date": "Oct  3 2018", "developers": ["Ghost Town Games Ltd."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Action", "Arcade"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": null}, {"name": "Spore Creature Creator", "details_link": "https://www.metacritic.com/game/pc/spore-creature-creator", "publisher": "Electronic Arts", "release_date": "Jun 17 2008", "developers": ["Maxis", "EA Redwood Shores"], "platforms": "PC", "genres": ["Strategy", "Breeding/Constructing", "General", "Breeding/Constructing"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/a0d4b1f86d78c4e5234459613f9a91fb-98.jpg", "descriptions": "The Spore Creature Creator gives Spore fans, and those who are creatively curious, the first hands-on opportunity to design their own species and share it with their friends. All creatures designed with the Spore Creature Creator can be imported into the full retail version of Spore for PCThe Spore Creature Creator gives Spore fans, and those who are creatively curious, the first hands-on opportunity to design their own species and share it with their friends. All creatures designed with the Spore Creature Creator can be imported into the full retail version of Spore for PC and Mac. The demo lets players shape, paint and play with an unlimited number of creatures, using 25 percent of the creature-making parts from Spore. Gamers can then share these creations with their friends, including seamless uploads to YouTube. [Electronic Arts]… Expand"}, {"name": "Final Fantasy V Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/final-fantasy-v-advance", "publisher": "Nintendo", "release_date": "Nov  6 2006", "developers": ["TOSE"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/a9b3b6fe8e58b33d39b610f96ede2749-98.jpg", "descriptions": "The winds fail. Ships stand still, unable to fill their sails. The world races to its end. Unless a handful of heroes can protect the remaining crystals, the world will fall into ruin. Set off on a grand adventure in the finest version of FINAL FANTASY V ever released!"}, {"name": "Colin McRae Rally 2005", "details_link": "https://www.metacritic.com/game/pc/colin-mcrae-rally-2005", "publisher": "Codemasters", "release_date": "Oct 28 2004", "developers": ["Codemasters"], "platforms": "PC", "num_players": "8  Online", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/4f74d038f01dea60ecfc9ee798c6ad0f-98.jpg", "descriptions": "The all-new Career Challenge is the steering wheel-gripping heart of Colin McRae Rally 2005 and has players hurtling through over 20 different classes of rally events including Challenges, Cups, SuperCups, Shields and Championships, earning the right to compete against the very best.The all-new Career Challenge is the steering wheel-gripping heart of Colin McRae Rally 2005 and has players hurtling through over 20 different classes of rally events including Challenges, Cups, SuperCups, Shields and Championships, earning the right to compete against the very best. Offering real progression and the most diverse selection of rally cars to choose from, drivers will be pummeled through a staggering 300+ stages driving cars from 4-wheel drive, 2-wheel drive, 4-wheel Classics, Super 2-wheel, Rear Wheel, Distinctive and 4x4 classics. Beyond the Career Challenge, there’s even more adrenaline-fuelled rally gaming with the title’s 4WD Championship, Rally, Stages and Online gaming modes. Also features the new bonnet-cam and an improved chase cam gives a real sensation of speed and undulation. Enhanced damage and scenery visuals include new individual damage models for every car and should you crash into a tree, it’ll shudder and even drop leaves. 30+ featured cars include the Volkswagen Golf MK5, Toyota Celica GT-FOUR, Lancia Stratos, Alfa Romeo 147 GTA, Alfetta GTV Turbodelta, Mitsubishi Lancer Evo VIII, Peugeot 206, 205 T16 Evo2 and the distinctive VW Beetle RSi. 9 international locations (new German rally joins events through UK, Sweden, USA, Finland, Australia, Spain, Greece, and Japan), in Rally game mode, each with 8 stages. Large, animated spectator crowds cheer you on through the stages. [Codemasters]… Expand"}, {"name": "James Bond 007: Everything or Nothing", "details_link": "https://www.metacritic.com/game/xbox/james-bond-007-everything-or-nothing", "publisher": "EA Games", "release_date": "Feb 17 2004", "developers": ["EA Redwood Shores"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/d10fd950b673be8bf3345376c0fb54c9-98.jpg", "descriptions": "Think like Bond, act like Bond, and experience an entirely new Bond adventure.  James Bond, the world's greatest secret agent, returns in Everything or Nothing with new guns and gadgets, combat skills, and clever tricks--and it's up to you to put them to good use.  Travel through fourThink like Bond, act like Bond, and experience an entirely new Bond adventure.  James Bond, the world's greatest secret agent, returns in Everything or Nothing with new guns and gadgets, combat skills, and clever tricks--and it's up to you to put them to good use.  Travel through four exciting continents including the Valley of the Kings in Egypt and the French Quarter in New Orleans.  The game also features two-player co-op missions and four-player multiplayer arena modes.  … Expand"}, {"name": "The Sims", "details_link": "https://www.metacritic.com/game/playstation-2/the-sims", "publisher": "EA Games", "release_date": "Jan 12 2003", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/d67c3c2737390b75ac592b335d024f1c-98.jpg", "descriptions": "Create and control your Sims on the PS2 with new level-based game play and 3D graphics. Customize your Sim's personality and appearance then move into the neighborhood. Get a job, make friends and advance through your career and life's big moments. Unlock new objects and bigger houses alongCreate and control your Sims on the PS2 with new level-based game play and 3D graphics. Customize your Sim's personality and appearance then move into the neighborhood. Get a job, make friends and advance through your career and life's big moments. Unlock new objects and bigger houses along the way. Meet, flirt and fight with a neighborhood full of wild characters. You can also load your Sims into a friend's game and play two-player games. [Electronic Arts]… Expand"}, {"name": "All-Star Baseball 2003", "details_link": "https://www.metacritic.com/game/gamecube/all-star-baseball-2003", "publisher": "Acclaim", "release_date": "Feb 25 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/081454eb31356d5d385dd7356553353e-98.jpg", "descriptions": "If you're looking for a simulation-style baseball game for your GameCube, All-Star Baseball 2003 is the best and only option."}, {"name": "F1 2001", "details_link": "https://www.metacritic.com/game/xbox/f1-2001", "publisher": "Electronic Arts", "release_date": "Nov 18 2001", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 83, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/42992e93f73d0ff7bdcfb8152a3490a1-98.jpg", "descriptions": "Battle for position at every sweeping bend, high-speed straight away, and hairpin turn within the world's most glamorous sporting arena. From Monaco to Monza, take on the most intelligent and daring racers to hit the formula one circuit. The circuit comes to life with fully interactive pitBattle for position at every sweeping bend, high-speed straight away, and hairpin turn within the world's most glamorous sporting arena. From Monaco to Monza, take on the most intelligent and daring racers to hit the formula one circuit. The circuit comes to life with fully interactive pit stops, roaring crowds, a buzzing grid, driver animations, and a full spectrum of driving conditions, including torrential downpours and other mid-race weather changes. Add the official 2001 FIA Formula One World Championship license and F1 2001 is poised to reach new milestones in motor sports gaming.… Expand"}, {"name": "Looney Tunes: Space Race", "details_link": "https://www.metacritic.com/game/dreamcast/looney-tunes-space-race", "publisher": "Infogrames", "release_date": "Nov 27 2000", "developers": ["Melbourne House"], "platforms": ["PlayStation 2", "Dreamcast"], "genres": ["Driving", "Racing", "Kart"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/e1b7295b264af4136dbd383917b2aba9-98.jpg", "descriptions": "Blast off into space! Join your all-time favorite cartoon characters in a hilarious rocket-powered ride through the galaxy. Loaded with outrageous pranks and comical commentary, it's a winner-takes-all race for the inter-galactic championship!"}, {"name": "Disc Room", "details_link": "https://www.metacritic.com/game/pc/disc-room", "publisher": "Devolver Digital", "release_date": "Oct 22 2020", "developers": ["Terri", "Dose", "Kitty", "and JW"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 83, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/1024125f9db61ce9f69f2645e2e08126-98.jpg", "descriptions": "The year is 2089, and a giant disc has appeared in orbit of Jupiter. A crew of international scientists is formed in a desperate attempt to understand the mysterious secrets contained within. Step into the oversized space suit of a brave but reluctant scientist and explore this sprawlingThe year is 2089, and a giant disc has appeared in orbit of Jupiter. A crew of international scientists is formed in a desperate attempt to understand the mysterious secrets contained within. Step into the oversized space suit of a brave but reluctant scientist and explore this sprawling slaughterhouse from outer space. Attempt to discover the method behind its madness as you are relentlessly chased down by intelligent alien saw blades amid a seemingly endless labyrinth of interconnected death chambers. Stay sharp in order to navigate this murderous maze, as the seemingly straightforward slaughter unfurls into far more puzzling complexity. But, what kills you only makes you stronger. Absorb extraordinary abilities from the very discs that dice you into pieces. Invincibly dash, bend time, even clone yourself as you become one with the disc. Persistent punishment quickly solidifies into razor-sharp survival skills, as our scientist dies their way toward the deeper more devastating purpose of the disc.\r In Disc Room, the only way out is through Death.… Expand"}, {"name": "Tom Clancy's Splinter Cell: Conviction", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-splinter-cell-conviction", "publisher": "Ubisoft", "release_date": "Apr 27 2010", "developers": ["Ubisoft Montreal"], "platforms": ["Xbox 360", "PC"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 83, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/9/80ddfd6b5de2f880f6b8e6e075c8958b-98.jpg", "descriptions": "Improvise. Adapt. Overcome. You are a fugitive, ruthlessly hunted by the very government you used to serve. Your only choice is to improvise to survive. Experience original gameplay based on improvisation in which your environment is your top weapon. Always on your toes, you need to react onImprovise. Adapt. Overcome. You are a fugitive, ruthlessly hunted by the very government you used to serve. Your only choice is to improvise to survive. Experience original gameplay based on improvisation in which your environment is your top weapon. Always on your toes, you need to react on the fly to any changing situations and use the environment and the crowds around you to create diversions and deter your enemies. As a fugitive, quick thinking and adaptation are essential to turn the situation to your advantage. A gameplay experience delivering 100% adrenaline includes close combat and shooting sequences. To survive, build an underground network of allies who will help you obtain high-tech gadgets and stay one step ahead of your pursuers as you struggle to unmask the forces that frame you. [Ubisoft]… Expand"}, {"name": "Luftrausers", "details_link": "https://www.metacritic.com/game/playstation-vita/luftrausers", "publisher": "Devolver Digital", "release_date": "Mar 18 2014", "developers": ["Vlambeer"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita"], "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/824d050b79c682fddd6406c156d821af-98.jpg", "descriptions": "Luftrausers is an arcade-style aerial combat shooter where ace pilots will be able to customize their own \"rauser\" and battle wily enemy fighters amongst the clouds or charge colossal battleships scattered across the open seas."}, {"name": "Chicken Police - Paint it RED!", "details_link": "https://www.metacritic.com/game/switch/chicken-police---paint-it-red!", "publisher": "HandyGames", "release_date": "Nov  5 2020", "developers": ["HandyGames"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 83, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/f1d58caf7eb12d134aa28e22b7a26779-98.jpg", "descriptions": "Sonny Featherland and Marty MacChicken were once legendary detective partners in Clawville PD. Predatory division, nicknamed as the Chicken Police. But that was a decade ago and time had passed them by... Sonny is a semi-alcoholic wreck of a bird on paid leave, while Marty still hides behindSonny Featherland and Marty MacChicken were once legendary detective partners in Clawville PD. Predatory division, nicknamed as the Chicken Police. But that was a decade ago and time had passed them by... Sonny is a semi-alcoholic wreck of a bird on paid leave, while Marty still hides behind the facade of a star-detective.On the night of New Year's Eve, a mysterious woman visits Sonny with an errand which goes back to a dark corner of his past. Now, Sonny and Marty are back together again on a case stranger than anything they've ever encountered before!Chicken Police is an \"Orwellesque Buddycop Noir Adventure\", with a carefully crafted world, a gritty, dark story, and absurd humor. The game mixes elements of story-rich adventures with visual novel style dialogue-heavy storytelling, complete with a complex interrogation system, detective gameplay, and an ever-changing city.… Expand"}, {"name": "And Yet It Moves", "details_link": "https://www.metacritic.com/game/wii/and-yet-it-moves", "publisher": "Broken Rules", "release_date": "Aug 23 2010", "developers": ["Broken Rules"], "platforms": ["PC", "Wii"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/3da4c3e53b4907acc6702bd1e50dc2c3-98.jpg", "descriptions": "And Yet It Moves is a puzzle-platformer, set in a unique world, made of ripped paper. Within the paper collage, you can jump, run and last but certainly not least: rotate the world. Learn how to apply the physical consequences of rotation to master the many tricky situations you may encounter."}, {"name": "Tribes: Vengeance", "details_link": "https://www.metacritic.com/game/pc/tribes-vengeance", "publisher": "VU Games", "release_date": "Oct 12 2004", "developers": ["Irrational Games"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/80b3f10141f9be5f554c6d1b0e7f29a2-98.jpg", "descriptions": "A family in conflict. A galaxy at war. The endless war has begun. The Empire and the Tribes now fight as much over resources as they do for revenge. But when a war spans generations, it becomes a mother's quest to discover the truth about the conflict, and an heir's duty to break free fromA family in conflict. A galaxy at war. The endless war has begun. The Empire and the Tribes now fight as much over resources as they do for revenge. But when a war spans generations, it becomes a mother's quest to discover the truth about the conflict, and an heir's duty to break free from the cycle of vengeance. Play as multiple characters across two generations of a family at war in the first ever TRIBES single player experience. Physics system seamlessly integrates jet-packing, running, skiing and piloting into one dynamic experience. New weapons and vehicles add to the classic TRIBES arsenal and guarantee a fight like no other. Powered by an enhanced Unreal (tm) engine, stunning visuals take you into a never before seen chapter of TRIBES history. Battle in vast locations from underground caverns and forgotten cities to acid wastelands and mighty coliseums. Join the war online with extensive multiplayer action for up to 32 players. [Sierra]… Expand"}, {"name": "Hitman: Absolution", "details_link": "https://www.metacritic.com/game/playstation-3/hitman-absolution", "publisher": "Square Enix", "release_date": "Nov 20 2012", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/33b2eb17e29a013db5e279984d0d9d4d-98.jpg", "descriptions": "Wear the uniform of the deadliest assassin, you have the ability to blend into your environment, kill with nothing but your bare hands and create a weapon from almost anything a la McGuyver. You are Agent 47, the world's most lethal assassin."}, {"name": "Triangle Strategy", "details_link": "https://www.metacritic.com/game/switch/triangle-strategy", "publisher": "Square Enix", "release_date": "Mar  4 2022", "developers": ["Square Enix", "Artdink"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/d895dbec6f21f552d29dea8bf4db3eba-98.jpg", "descriptions": "Three nations battle for control of the dwindling resources of salt and iron. Command a group of warriors as Serenoa, heir of House Wolffort, in a tangled plot where your decisions make all the difference. Key choices you make will bolster one of three convictionsUtility, Morality,Three nations battle for control of the dwindling resources of salt and iron. Command a group of warriors as Serenoa, heir of House Wolffort, in a tangled plot where your decisions make all the difference. Key choices you make will bolster one of three convictionsUtility, Morality, Libertywhich together make up Serenoa's world view and influence how the story will unfold. When faced with truly momentous decisions, multiple characters will weigh in by casting their votes on the Scales of Conviction. In these moments, the allies and decisions you make can determine the fate of whole nations and the continent of Norzelia itself. Control multi-tiered battlefields to strategically secure victory\rFinding the best location in turn-based battles can tip the tide of combat in your favor. Position units on higher ground to take control of the battlefield and gain the advantage with increased range. You can also flank enemies on both sides, then strike from behind for a powerful follow-up attack. Elemental chain reactions are also an important part of combat. For example, use fire to melt icy terrain, then use lightning to electrocute it. Push the enemy into the electrified water to see sparks fly!… Expand"}, {"name": "Super Puzzle Fighter II Turbo HD Remix", "details_link": "https://www.metacritic.com/game/xbox-360/super-puzzle-fighter-ii-turbo-hd-remix", "publisher": "Capcom", "release_date": "Aug 29 2007", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/94c088a5c5b4f4f9fbfbe5074ea6d2ab-98.jpg", "descriptions": "[Xbox Live Arcade] One of the most popular puzzle games of all time is back with high-definition graphics, dazzling elemental effects and a new rebalanced X' game mode! Super Puzzle Fighter II Turbo HD Remix brings together Capcom's coolest fighting characters to provide extremely addictive[Xbox Live Arcade] One of the most popular puzzle games of all time is back with high-definition graphics, dazzling elemental effects and a new rebalanced X' game mode! Super Puzzle Fighter II Turbo HD Remix brings together Capcom's coolest fighting characters to provide extremely addictive puzzle mayhem. Enjoy single-player, local and online versus play, and spectator modes. The game features all the classic elements from the original arcade game, including traditional X Mode. Think fast on your feet as gems fall into your character's playfield. Don't let the stack get too high. The new X' Mode has been rebalanced with adjusted drop patterns and damage to level the playing field. Y Mode challenges players to connect three or more gems horizontally, vertically or diagonally. Z Mode has you group four adjacent gems and rotate them to join to other same-colored gems. Beautifully detailed high-definition backgrounds and character art come from the talented artists of Udon Comics. New elemental effects: Gems and Crash Gems interact with dazzling new effects. Hidden characters: There's Akuma, Dan, and more. Online play: Get online with Xbox LIVE and challenge other players to Ranked and Player Matches. Follow your progress on the leaderboards, and try to score the twelve all-new achievements. [Microsoft]… Expand"}, {"name": "Pathfinder: Wrath of the Righteous", "details_link": "https://www.metacritic.com/game/pc/pathfinder-wrath-of-the-righteous", "publisher": "Owlcat Games", "release_date": "Sep  2 2021", "developers": ["Owlcat Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/090a0ebc0b599715082c61fcbe07645d-98.jpg", "descriptions": "Embark on a journey to a realm overrun by demons in a new epic RPG from the creators of the critically acclaimed Pathfinder: Kingmaker. Explore the nature of good and evil, learn the true cost of power, and rise as a Mythic Hero capable of deeds beyond mortal expectations."}, {"name": "Hitman: Blood Money", "details_link": "https://www.metacritic.com/game/playstation-2/hitman-blood-money", "publisher": "Eidos Interactive", "release_date": "May 30 2006", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/0a8e7ce0713ea79f3aecd65cf70a0b06-98.jpg", "descriptions": "When assassins from Agent 47's contract agency, The ICA, are systematically eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. For Agent 47 it's business as usual, until suddenly he loses contact with The ICA. Sensing that he may be the next target,When assassins from Agent 47's contract agency, The ICA, are systematically eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. For Agent 47 it's business as usual, until suddenly he loses contact with The ICA. Sensing that he may be the next target, he travels to America, where he prepares to make a killing. Agent 47 is back and this time he's paid in cold, hard cash. How the money is spent will affect his passage through the game and the weapons at his disposal, resulting in a unique gameplay experience for each player. Powered by a new version of Io's stunning Glacier engine, Hitman: Blood Money delivers the most brutal and realistic simulation of life as the world's deadliest assassin. [Eidos Interactive]… Expand"}, {"name": "Kirby Mass Attack", "details_link": "https://www.metacritic.com/game/ds/kirby-mass-attack", "publisher": "Nintendo", "release_date": "Sep 19 2011", "developers": ["HAL Labs"], "platforms": "DS", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/bcde560b4a7383128c8f0ed14b6fa4db-98.jpg", "descriptions": "One day, an evildoer with a magic cane appears and splits Kirby into 10 pieces. Kirby sets off on a journey to return to his original form. Players use the touch screen to control a mass of Kirby characters in a new and novel way. Swipe the touch screen to launch them in a mass attackOne day, an evildoer with a magic cane appears and splits Kirby into 10 pieces. Kirby sets off on a journey to return to his original form. Players use the touch screen to control a mass of Kirby characters in a new and novel way. Swipe the touch screen to launch them in a mass attack against enemies, then tap the enemies into submission.… Expand"}, {"name": "Call of Duty: Black Ops II", "details_link": "https://www.metacritic.com/game/playstation-3/call-of-duty-black-ops-ii", "publisher": "Activision", "release_date": "Nov 13 2012", "developers": ["Treyarch"], "platforms": ["PC", "Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Modern", "Arcade"], "meta_score": 83, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/451194e957ee4fac7c8a2417b9fedb28-98.jpg", "descriptions": "Call of Duty: Black Ops II thrusts players into a potential near future - a 21st Century Cold War in which technology and weapons have merged to create a new generation of warfare. Black Ops 2 introduces players to an insidious villain named Raul Menendez who hijacks the US militaryCall of Duty: Black Ops II thrusts players into a potential near future - a 21st Century Cold War in which technology and weapons have merged to create a new generation of warfare. Black Ops 2 introduces players to an insidious villain named Raul Menendez who hijacks the US military infrastructure to further his own agenda. Take control of the power of near-future technology and advanced robotics to pull the world back from the brink of annihilation.… Expand"}, {"name": "Guitar Hero III: Legends of Rock", "details_link": "https://www.metacritic.com/game/playstation-3/guitar-hero-iii-legends-of-rock", "publisher": "Activision", "release_date": "Oct 28 2007", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/5059f3f5fae9bf4f71efe6cfa8d4727f-98.jpg", "descriptions": "Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses,Fire up the fretboard, crank up the amp and get ready to rock like never before. Guitar Hero III: Legends of Rock drops you into the spotlight of the largest and most legendary rock concert ever. The star-studded soundtrack includes master tracks by such legendary artists as Guns N’ Roses, The Rolling Stones, Beastie Boys, Muse and Pearl Jam, with added songs as made legendary by Kiss, Alice Cooper and Heart. Now drop that air guitar, tune your exclusive new Les Paul Guitar Controller and shred the night away with Guitar Hero III: Legends of Rock. [Activision]… Expand"}, {"name": "Alan Wake", "details_link": "https://www.metacritic.com/game/xbox-360/alan-wake", "publisher": "Microsoft Game Studios", "release_date": "May 18 2010", "developers": ["Remedy Entertainment"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Horror", "Horror", "Survival"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/5843992dc2e8642f0418a8919cfd827e-98.jpg", "descriptions": "Alan Wake is a psychological action thriller, a unique new take in the world of gaming. The game is set in an idyllic all-American small town and its surroundings in the state of Washington. Alan Wake, the game's protagonist, is a bestselling horror writer, who writes a novel about hisAlan Wake is a psychological action thriller, a unique new take in the world of gaming. The game is set in an idyllic all-American small town and its surroundings in the state of Washington. Alan Wake, the game's protagonist, is a bestselling horror writer, who writes a novel about his darkest nightmares. In the game, those nightmares come true. As with Remedy's previous games, story and atmosphere are fundamental elements. The game features a massive, open world for the players to explore. The game design is mission based with the player as the driving force behing the action, and as with their previous games, Remedy again focuses completely on delivering the best possible single player experience. The use of light is a significant gameplay element. Remedy has developed proprietary new technology to support the gameplay of the title and to push the high definition visuals to the next level. [Remedy]… Expand"}, {"name": "Marvel's Midnight Suns", "details_link": "https://www.metacritic.com/game/pc/marvels-midnight-suns", "publisher": "2K Games", "release_date": "Dec  2 2022", "developers": ["Firaxis Games"], "platforms": ["PlayStation 5", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 83, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/a51fa75a59fbb5abab906f97e2330eae-98.jpg", "descriptions": "After centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire withAfter centuries of sleep, Lilith, Mother of Demons, has been revived by Hydra through a twist of dark magic and science. Lilith stops at nothing to complete an ancient prophecy and bring back her evil master, Chthon. Pushed to the brink, the Avengers desperately look to fight fire with hellfire and enlist the help of the Midnight Suns - Nico Minoru, Blade, Magik and Ghost Rider - young heroes with powers deeply rooted in the supernatural, formed to prevent the very prophecy Lilith aims to fulfill.\r In the face of fallen allies and the fate of the world at stake, it will be up to you to rise up against the darkness!\r Marvel's Midnight Suns is a new tactical RPG set in the darker side of the Marvel Universe, putting you face-to-face against demonic forces of the underworld as you team up with and live among the Midnight Suns, Earth's last line of defense.… Expand"}, {"name": "Sega Ages: Sonic the Hedgehog 2", "details_link": "https://www.metacritic.com/game/switch/sega-ages-sonic-the-hedgehog-2", "publisher": "Sega", "release_date": "Feb 20 2020", "developers": ["Sonic Team", "M2"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/e01dd90b9b86fda11824eb53a0c0dad8-98.jpg", "descriptions": "Super Speed! Sonic's back and better than ever. He's a blur in blue! A blaze of action! With his new Super Spin Dash. And a new, fabulous friend, \"Tails\" the Fox. You won't believe it 'til you see it. And when you play, you won't stop. Super Play! Defy gravity in hair-raisingSuper Speed! Sonic's back and better than ever. He's a blur in blue! A blaze of action! With his new Super Spin Dash. And a new, fabulous friend, \"Tails\" the Fox. You won't believe it 'til you see it. And when you play, you won't stop. Super Play! Defy gravity in hair-raising loop-de-loops. Grab Power Sneakers and race like lightning through the mazes. All at break-neck speed! Super Power! Sonic's attitude is can-do. The mad scientist Dr. Robotnik is planning a world takeover. Sonic gets tough in the fight to save his friends and squash Robotnik for good!… Expand"}, {"name": "Gorogoa", "details_link": "https://www.metacritic.com/game/switch/gorogoa", "publisher": "Annapurna Interactive", "release_date": "Dec 14 2017", "developers": ["Jason Roberts", "Buried Signal"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "General"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/61542041c7d0f1d5efc672425b44cd1e-98.jpg", "descriptions": "Gorogoa is an elegant evolution of the puzzle genre, told through a beautifully hand-drawn story designed and illustrated by Jason Roberts, who created thousands of meticulously detailed hand-drawn illustrations, encompassing the impressive scope of Gorogoa's personal narrative.GorogoaGorogoa is an elegant evolution of the puzzle genre, told through a beautifully hand-drawn story designed and illustrated by Jason Roberts, who created thousands of meticulously detailed hand-drawn illustrations, encompassing the impressive scope of Gorogoa's personal narrative.Gorogoa isn't just a game - it's a work of art, expressing itself through soulful, charming illustrations and distinguished puzzle mechanics.… Expand"}, {"name": "Tales From The Borderlands: Episode 3 - Catch A Ride", "details_link": "https://www.metacritic.com/game/playstation-4/tales-from-the-borderlands-episode-3---catch-a-ride", "publisher": "Telltale Games", "release_date": "Jun 23 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 83, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/e1b8d1434187fee273d84cf3684ea9d8-98.jpg", "descriptions": "After a dizzying escape from a near-almost-certain-death scenario (involving statuesque buttocks), Rhys and Fiona are in search of another piece of the puzzle that will lead them to the vast riches of Vault key ownership. Lost in the mysterious jungle of an Atlas terraforming facility, FionaAfter a dizzying escape from a near-almost-certain-death scenario (involving statuesque buttocks), Rhys and Fiona are in search of another piece of the puzzle that will lead them to the vast riches of Vault key ownership. Lost in the mysterious jungle of an Atlas terraforming facility, Fiona finds help from an unexpected mentor, Rhys continues to share brain-space with the disembodied mind of a dead dictator, and love is in the air. Pursued by the ruthless criminal 'Queenpin' Vallory, and with very little help from Vaughn's accountancy skills (or stellar abs), getting anywhere near the Vault is entirely on you.… Expand"}, {"name": "L.A. Noire: The Complete Edition", "details_link": "https://www.metacritic.com/game/pc/la-noire-the-complete-edition", "publisher": "Rockstar Games", "release_date": "Nov  8 2011", "developers": ["Rockstar Leeds"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Modern", "Third-Person", "Modern"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/013959c150b16df291774794200a315b-98.jpg", "descriptions": "Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right,Amid the post-war boom of Hollywood's Golden Age, Cole Phelps, an LAPD detective is thrown headfirst into a city drowning in its own success. Corruption is rampant, the drug trade is exploding, and murder rates are at an all-time high. In his fight to climb the ranks and do what's right, Phelps must unravel the truth behind a string of arson attacks, racketeering conspiracies and brutal murders, battling the L.A. underworld and even members of his own department to uncover a secret that could shake the city to its rotten core. Using groundbreaking new animation technology that captures every nuance of an actor's facial performance in astonishing detail, L.A. Noire is a violent crime thriller that blends breathtaking action with true detective work to deliver an unprecedented interactive experience. Search for clues, chase down suspects and interrogate witnesses as you struggle to find the truth in a city where everyone has something to hide.… Expand"}, {"name": "Brutal Legend", "details_link": "https://www.metacritic.com/game/playstation-3/brutal-legend", "publisher": "EA Games", "release_date": "Oct 13 2009", "developers": ["Double Fine Productions"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "General", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/8561c9a747eed32bd5efffb2445bd0db-98.jpg", "descriptions": "Brütal Legend is an epic action game from visionary developer Tim Schafer.  Jack Black stars as Eddie Riggs, a legendary roadie summoned to a world of Heavy Metal where mountains are made of amplifiers, killer spiders spin guitar strings and Rock Legends roam the landscape.  As Eddie, crushBrütal Legend is an epic action game from visionary developer Tim Schafer.  Jack Black stars as Eddie Riggs, a legendary roadie summoned to a world of Heavy Metal where mountains are made of amplifiers, killer spiders spin guitar strings and Rock Legends roam the landscape.  As Eddie, crush skulls with a battle axe, ravage the road in a super-charged Hot Rod and unleash the power of Rock to reign down fire from the sky - all to save humanity and become a Brütal Legend. [Electronic Arts]… Expand"}, {"name": "Dragon Quest Wars", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-wars", "publisher": "Square Enix", "release_date": "Sep 28 2009", "developers": ["Intelligent Systems"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 83, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/6/c5749bc67bdd0a678b4ee15d485fa32d-98.jpg", "descriptions": "[DSiWare]  DRAGON QUEST WARS is a grid-based strategy game featuring all of your favorite quirky DRAGON QUEST monsters. Choose from several modes and get ready for battle. While the rules are simple, strategy is the key to victory. The game features single-player and DS Wireless Play, as[DSiWare]  DRAGON QUEST WARS is a grid-based strategy game featuring all of your favorite quirky DRAGON QUEST monsters. Choose from several modes and get ready for battle. While the rules are simple, strategy is the key to victory. The game features single-player and DS Wireless Play, as well as battles with foes worldwide via Nintendo® Wi-Fi Connection. (Broadband Internet access is required for online play.) [Square Enix]… Expand"}, {"name": "VVVVVV", "details_link": "https://www.metacritic.com/game/3ds/vvvvvv", "publisher": "Nicalis", "release_date": "Dec 29 2011", "developers": ["Terry Cavanagh"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Switch", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D", "", "Metroidvania"], "meta_score": 83, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/06d31be9174edac97ad3b4405d17a39c-98.jpg", "descriptions": "There's something terrible wrong in an alternate dimension! Help Captain Viridian flip to find five crew members, 20 hard-to-reach Trinkets and save a dimension on the brink of destruction. It's a space opera in the most unique scale with a style that only VVVVVV can bring to you. Instead ofThere's something terrible wrong in an alternate dimension! Help Captain Viridian flip to find five crew members, 20 hard-to-reach Trinkets and save a dimension on the brink of destruction. It's a space opera in the most unique scale with a style that only VVVVVV can bring to you. Instead of jumping, control the direction of gravity by inverting your gravity and allowing Captain Viridian to flip between the floors and ceilings of the environment.\r For adventurers who save the dimension, there's still hours and hours of new gameplay with all-new Player Levels. Test your mettle and see if you have what it takes to beat a collection of levels created by other famous game developers.\r Inspired by classic 8-bit days gone-by and now with experience-heightening 3D, VVVVVV will challenge even the most battle-hardened old-school gamers.… Expand"}, {"name": "Katana ZERO", "details_link": "https://www.metacritic.com/game/switch/katana-zero", "publisher": "Devolver Digital", "release_date": "Apr 17 2019", "developers": ["Askiisoft"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/2289d38efe58ccbd195bf52edaf60fb6-98.jpg", "descriptions": "Katana ZERO is a stylish neo-noir, action-platformer featuring breakneck action and instant-death combat. Slash, dash, and manipulate time to unravel your past in a beautifully brutal acrobatic display."}, {"name": "GTR Evolution", "details_link": "https://www.metacritic.com/game/pc/gtr-evolution", "publisher": "Take-Two Interactive", "release_date": "Sep  1 2008", "developers": ["SimBin"], "platforms": "PC", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/daecd801e30b9a55893be6ae2e12db82-98.jpg", "descriptions": "In addition to many other tracks, players of GTR Evolution will drive the modern version of the monumental track of Nürburgring Nordschleife along with the Nürburgring GP layout. Dubbed \"The Green Hell\" by racing legend Jackie Stewart, the track is revered and feared as the most difficultIn addition to many other tracks, players of GTR Evolution will drive the modern version of the monumental track of Nürburgring Nordschleife along with the Nürburgring GP layout. Dubbed \"The Green Hell\" by racing legend Jackie Stewart, the track is revered and feared as the most difficult and treacherous track ever built. GTR Evolution for PC comes with 22 GT car models in 3 different classes plus a selection of exclusive production cars. Further to this SimBin adds WTCC Extreme, tuned concept cars based on the FIA WTCC cars. [SimBin]… Expand"}, {"name": "Marvel: Ultimate Alliance", "details_link": "https://www.metacritic.com/game/xbox/marvel-ultimate-alliance", "publisher": "Activision", "release_date": "Oct 24 2006", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Xbox"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 83, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/8700eadc10132166452e92db4e61f780-98.jpg", "descriptions": "Marvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game. Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine theMarvel: Ultimate Alliance is an action/RPG that features the largest roster of comic book characters ever seen in a video game. Players assume the roles of more than 20 Marvel Super Heroes including Spider-Man, Wolverine, Blade and Captain America, and through their actions determine the fate of both planet Earth and the Marvel universe - revealed in one of multiple epilogues. Marvel: Ultimate Alliance offers total team customization, where players create their own team name, icon and vehicle, as well as establish their team reputation as they play throughout the story.… Expand"}, {"name": "Octopath Traveler II", "details_link": "https://www.metacritic.com/game/pc/octopath-traveler-ii", "publisher": "Square Enix", "release_date": "Feb 24 2023", "developers": ["Square Enix", "Acquire"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 83, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/a88ab8e3717224cddd68319b31165c55-98.jpg", "descriptions": "This game is a brand-new entry in the OCTOPATH TRAVELER series, the first installment of which was initially released in 2018 and sold over 3 million copies worldwide. It takes the series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, to even greater heights.\rIn the world ofThis game is a brand-new entry in the OCTOPATH TRAVELER series, the first installment of which was initially released in 2018 and sold over 3 million copies worldwide. It takes the series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, to even greater heights.\rIn the world of Solistia, eight new travelers venture forth into an exciting new era.\rWhere will you go? What will you do? Whose tale will you bring to life?\rEvery path is yours to take.\rEmbark on an adventure all your own.\r 1. Begin your adventure as one of eight new travelers, each with their own origins, motivations, and unique skills.\r 2. The series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, have reached even greater heights.\r 3. The story takes place in Solistia, where diverse cultures thrive from east to west and the industries of the new era flourish. You can sail the seas and explore every corner of a world that changes from day to night.\r 4. Each traveler has a unique set of Path Actions they can use to battle townspeople, obtain items, take others along in their travels, and more. Where will you go? What will you do? Every path is yours to take.\r 5. Familiar mechanics from the original game have been preserved, like the freedom to develop your travelers’ jobs and skills, as well as the Break and Boost system that made battles so exhilarating. New mechanics have also been added.… Expand"}, {"name": "Killer Queen Black", "details_link": "https://www.metacritic.com/game/switch/killer-queen-black", "publisher": "Liquid Bit", "release_date": "Oct 11 2019", "developers": ["Liquid Bit"], "platforms": ["PC", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "General", "Arcade"], "meta_score": 83, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/5bc0c9178a2841c9c94cfbcfa62689b7-98.jpg", "descriptions": "Fly solo, or team up with three of your friends as you race to complete one of three possible victory conditions. Killer Queen Black, a new take on the arcade eSport Killer Queen, has been rebuilt from the ground up and optimized for console. The gameplay is immediately recognizable andFly solo, or team up with three of your friends as you race to complete one of three possible victory conditions. Killer Queen Black, a new take on the arcade eSport Killer Queen, has been rebuilt from the ground up and optimized for console. The gameplay is immediately recognizable and familiar, yet it introduces exciting new twists and online play for the home audience. Killer Queen Black is the follow up to Killer Queen that fans have been begging for. … Expand"}, {"name": "Life is Strange: Episode 5 - Polarized", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-episode-5---polarized", "publisher": "Square Enix", "release_date": "Oct 20 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 83, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/68657bf268611808651c1d4c9c1f7a88-98.jpg", "descriptions": "In Episode 5: Polarized Max learns that time is impossible to control as she moves inexorably towards the most agonizing decision of her life. Arcadia Bay, meanwhile, is preparing to weather a huge storm as Life is Strange comes to a gripping and gut wrenching conclusion."}, {"name": "Battlefield 3: Back to Karkand", "details_link": "https://www.metacritic.com/game/playstation-3/battlefield-3-back-to-karkand", "publisher": "Electronic Arts", "release_date": "Dec  6 2011", "developers": ["EA DICE"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/7fb0b1b7ec0e90fc51d6ee202820bac3-98.jpg", "descriptions": "Battlefield 3: Back to Karkand is a massive themed expansion pack featuring four of the most loved maps from Battlefield 2, boldly reimagined for Battlefield 3 with the power and destruction of the Frostbite 2 engine. It also gives you classic weapons and vehicles from Battlefield 2, uniqueBattlefield 3: Back to Karkand is a massive themed expansion pack featuring four of the most loved maps from Battlefield 2, boldly reimagined for Battlefield 3 with the power and destruction of the Frostbite 2 engine. It also gives you classic weapons and vehicles from Battlefield 2, unique dog tags, and all-new Assignments.… Expand"}, {"name": "Bully: Scholarship Edition", "details_link": "https://www.metacritic.com/game/wii/bully-scholarship-edition", "publisher": "Rockstar Games", "release_date": "Mar  4 2008", "developers": ["Rockstar Toronto"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "Wii"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/d1d8610b66963420d85a2f421be38506-98.jpg", "descriptions": "Both the Wii and Xbox 360 versions retain the wit and deep gameplay of the previously released PS2 title \"Bully\" and boasts additional new content. Bully: Scholarship Edition takes place in the fictional New England boarding school of Bullworth Academy and tells the story of 15-year-oldBoth the Wii and Xbox 360 versions retain the wit and deep gameplay of the previously released PS2 title \"Bully\" and boasts additional new content. Bully: Scholarship Edition takes place in the fictional New England boarding school of Bullworth Academy and tells the story of 15-year-old Jimmy Hopkins as he experiences the highs and lows of adjusting to a new school. Capturing the hilarity and awkwardness of adolescence perfectly, Bully: Scholarship Edition pulls the player into its cinematic and engrossing world. [Rockstar Games]… Expand"}, {"name": "Victoria 3", "details_link": "https://www.metacritic.com/game/pc/victoria-3", "publisher": "Paradox Interactive", "release_date": "Oct 25 2022", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 83, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/9/f44654199b7240a3388120197d5f9b48-98.jpg", "descriptions": "Paradox Development Studio invites you to build your ideal society in the tumult of the exciting and transformative 19th century. Balance the competing interests in your society and earn your place in the sun in Victoria 3, one of the most anticipated games in Paradox’s history."}, {"name": "Def Jam: Fight for NY", "details_link": "https://www.metacritic.com/game/playstation-2/def-jam-fight-for-ny", "publisher": "EA Games", "release_date": "Sep 20 2004", "developers": ["Aki Corp."], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/715ded810be4b0fe318316f07dc98b9e-98.jpg", "descriptions": "The ultimate hip-hop-fueled fighting video game features more than 70 characters, including more than 35 of the most well-known artists and personalities in hip-hop today, including Busta Rhymes, Carmen Electra, Lil? Kim, Ludacris, Method Man, Redman, Sean Paul, Slick Rick, Snoop Dogg, andThe ultimate hip-hop-fueled fighting video game features more than 70 characters, including more than 35 of the most well-known artists and personalities in hip-hop today, including Busta Rhymes, Carmen Electra, Lil? Kim, Ludacris, Method Man, Redman, Sean Paul, Slick Rick, Snoop Dogg, and many more. Def Jam Vendetta II challenges players to step into the shoes of a ruthless NYC street fighter battling for control of the hip-hop underground. The game features an all-new fighting engine allowing gamers to customize multiple fighting styles as the deep new story mode takes the action well beyond the ring and into the streets. Master each fighting style: street fighting, kickboxing, martial arts, wrestling, and submission fighting. Combine up to three styles to create devastating hybrid-styles, complete with new \"blazin' moves\" to finish off your opponent. Build your own street-ready fighter and outfit him with thousands of pieces of unlockable licensed gear, tattoos, and even bling from the Jeweler to the stars, Jacob the Jeweler. [Electronic Arts]… Expand"}, {"name": "Horizon Forbidden West", "details_link": "https://www.metacritic.com/game/playstation-4/horizon-forbidden-west", "publisher": "PlayStation Studios", "release_date": "Feb 18 2022", "developers": ["Guerrilla"], "platforms": ["PlayStation 5", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Open-World"], "meta_score": 83, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/8b9fcf535907ad03b66c96432d8aa009-98.jpg", "descriptions": "Join Aloy as she braves the Forbidden West – a majestic but dangerous frontier that conceals mysterious new threats. Explore distant lands, fight bigger and more awe-inspiring machines, and encounter astonishing new tribes as you return to the far-future, post-apocalyptic world of Horizon.Join Aloy as she braves the Forbidden West – a majestic but dangerous frontier that conceals mysterious new threats. Explore distant lands, fight bigger and more awe-inspiring machines, and encounter astonishing new tribes as you return to the far-future, post-apocalyptic world of Horizon. The land is dying. Vicious storms and an unstoppable blight ravage the scattered remnants of humanity, while fearsome new machines prowl their borders. Life on Earth is hurtling towards another extinction, and no one knows why. It's up to Aloy to uncover the secrets behind these threats and restore order and balance to the world. Along the way, she must reunite with old friends, forge alliances with warring new factions and unravel the legacy of the ancient past – all the while trying to stay one step ahead of a seemingly undefeatable new enemy.\r… Expand"}, {"name": "Demeo", "details_link": "https://www.metacritic.com/game/pc/demeo", "publisher": "Resolution Games", "release_date": "May  6 2021", "developers": ["Resolution Games"], "platforms": ["PlayStation 5", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 83, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/144593694c3abbce9b47bc7b177c182c-98.jpg", "descriptions": "RPG fans, unite… in virtual reality. A dark force has taken over the underworld in Resolution Games’ upcoming RPG dungeon crawler, Demeo, and it’s a world you’re not likely to survive alone."}, {"name": "SteamWorld Dig", "details_link": "https://www.metacritic.com/game/wii-u/steamworld-dig", "publisher": "Image & Form", "release_date": "Aug 28 2014", "developers": ["Image & Form"], "platforms": ["3DS", "PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Xbox One", "Wii U"], "genres": ["Action", "Action Adventure", "General", "Platformer", "2D", ""], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/19c189b452fdf80e16e138e9e7a6c65f-98.jpg", "descriptions": "The clock has stopped around the turn of the 19th century, and humankind has prematurely blown itself to bits. The remaining scraps are huddling in caves beneath the surface, and steam-powered robots have taken over the Wild West."}, {"name": "Broforce", "details_link": "https://www.metacritic.com/game/pc/broforce", "publisher": "Devolver Digital", "release_date": "Apr  7 2014", "developers": ["Free Lives"], "platforms": ["PlayStation 4", "Switch", "PC"], "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/9659291487b99d9ba383e703427b6f21-98.jpg", "descriptions": "A ridiculously violent platform game about being awesome action heroes from the 80s and 90s while slaying satanic terrorists and aliens while unraveling an evil plot to destroy the planet while dealing with being awesome action heroes from the 80s and 90s."}, {"name": "Disgaea 2: Dark Hero Days", "details_link": "https://www.metacritic.com/game/psp/disgaea-2-dark-hero-days", "publisher": "NIS America", "release_date": "Sep  8 2009", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/df043af20d199aa810d8aa676be09370-98.jpg", "descriptions": "Get a dose of hyper reality as you can discover what the outside world is like at the very same time as Rozalin! Enjoy the all-new Axel Chapters, as you get a glimpse of what makes a Dark Hero tick. Now you can take the fight to Overlord Zenon wherever you want to go! [NIS America]"}, {"name": "Star Wars: Knights of the Old Republic", "details_link": "https://www.metacritic.com/game/switch/star-wars-knights-of-the-old-republic", "publisher": "Aspyr", "release_date": "Nov 11 2021", "developers": ["Aspyr"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Western-Style"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/a4bb981f6fa658cdd1cbdd147abc7677-98.jpg", "descriptions": "Long before the Galactic Civil War, an epic drama begins.  Engage in this saga set in the Golden Age of the Republic--over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands.  With the Galaxy reeling from a recent conflict with the Dark Lords, theLong before the Galactic Civil War, an epic drama begins.  Engage in this saga set in the Golden Age of the Republic--over 4,000 years before the first Star Wars film, when both Jedi and Sith number in the thousands.  With the Galaxy reeling from a recent conflict with the Dark Lords, the ongoing battle between the Jedi and the Sith rages on.  It's up to guide your customizable and evolving characters through ten different worlds, fast-paced minigames, and locations including a Sith world, the Wookie homeworld, and the Jedi Academy.  Your actions determine the outcome of this colossal galactic war--and your destiny as a Jedi.… Expand"}, {"name": "Dust: An Elysian Tail", "details_link": "https://www.metacritic.com/game/xbox-360/dust-an-elysian-tail", "publisher": "Microsoft Game Studios", "release_date": "Aug 15 2012", "developers": ["Humble Hearts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Role-Playing", "Action RPG", "Platformer", "Action RPG", ""], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/5d0225029d53dfed74f98401d6b90ef4-98.jpg", "descriptions": "Immerse yourself in a hand-painted world on a search for your true identity. As the mysterious warrior Dust, you must master the ancient Blade of Ahrah to battle dozens of enemies with an intuitive combat system, take on a variety of quests, discover powerful upgrades throughout the massive,Immerse yourself in a hand-painted world on a search for your true identity. As the mysterious warrior Dust, you must master the ancient Blade of Ahrah to battle dozens of enemies with an intuitive combat system, take on a variety of quests, discover powerful upgrades throughout the massive, open world, and uncover the story of an ancient civilization on the brink of extinction as you fight to uncover your own past. … Expand"}, {"name": "Battlefield: Bad Company", "details_link": "https://www.metacritic.com/game/xbox-360/battlefield-bad-company", "publisher": "EA Games", "release_date": "Jun 23 2008", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/a9da1515070f423cf78f16de12efb614-98.jpg", "descriptions": "Built from the ground-up for next-generation consoles using Digital Illusions' Frostbite game engine, Battlefield: Bad Company drops gamers behind enemy lines with a squad of renegade soldiers who risk it all on a personal quest for gold and revenge. Featuring a deep, cinematic single-playerBuilt from the ground-up for next-generation consoles using Digital Illusions' Frostbite game engine, Battlefield: Bad Company drops gamers behind enemy lines with a squad of renegade soldiers who risk it all on a personal quest for gold and revenge. Featuring a deep, cinematic single-player experience loaded with adventure and dark humor, the game delivers the series' trademark sandbox gameplay in a universe where nearly everything is destructible. Battlefield: Bad Company also features a full suite of the franchise's trademark multiplayer options with deep gameplay modes designed to take full advantage of the game's massively destructible environments.  [Electronic Arts]… Expand"}, {"name": "A Plague Tale: Innocence", "details_link": "https://www.metacritic.com/game/xbox-one/a-plague-tale-innocence", "publisher": "Focus Home Interactive", "release_date": "May 14 2019", "developers": ["Asobo Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Linear"], "meta_score": 83, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/6ee40d2259871ce448dfc71030625d86-98.jpg", "descriptions": "A Plague Tale: Innocence offers an adventure supported by an original scenario, with gameplay that blends action, adventure and stealth phases. Follow our protagonists Amicia and her little brother Hugo, both orphans and on the run from the terrifying Inquisition. Our young heroes will alsoA Plague Tale: Innocence offers an adventure supported by an original scenario, with gameplay that blends action, adventure and stealth phases. Follow our protagonists Amicia and her little brother Hugo, both orphans and on the run from the terrifying Inquisition. Our young heroes will also need to survive against an even greater danger: supernatural swarms of rats that appeared with the great plague infecting across cities and countryside. [Focus Home Interactive]… Expand"}, {"name": "Splasher", "details_link": "https://www.metacritic.com/game/switch/splasher", "publisher": "Splashteam", "release_date": "Oct 26 2017", "developers": ["Splashteam"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/a3b622267ee0d729e9668fc31ece9ce0-98.jpg", "descriptions": "Splasher is a 2D platformer with unique arcade/action gameplay. It offers gamers challenges that require agility, speed and fast reflexes, and is set in a crazy cartoon universe.The Splashers are in great danger! The quiet and peaceful workers from Inkorp are being led to their doom by theSplasher is a 2D platformer with unique arcade/action gameplay. It offers gamers challenges that require agility, speed and fast reflexes, and is set in a crazy cartoon universe.The Splashers are in great danger! The quiet and peaceful workers from Inkorp are being led to their doom by the greedy Docteur, the paint factory's evil boss. A young hero rises to fight for what's right. Armed with a splatter cannon, he launches an attack in order to save the Splashers and stand up to the dictator. His amazing paint cannon grants him color superpowers.… Expand"}, {"name": "Spelunky", "details_link": "https://www.metacritic.com/game/playstation-3/spelunky", "publisher": "Mossmouth", "release_date": "Aug 27 2013", "developers": ["Mossmouth", "BlitWorks"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/9d2374f9b40c711b2bfa2c5f4356422d-98.jpg", "descriptions": "Spelunky is a unique platformer with randomized levels that offer a new and challenging experience each time you play! Journey deep underground and explore fantastic places filled with monsters, traps, and treasure. Fully-destructible environments open up lots of strategies and make it aSpelunky is a unique platformer with randomized levels that offer a new and challenging experience each time you play! Journey deep underground and explore fantastic places filled with monsters, traps, and treasure. Fully-destructible environments open up lots of strategies and make it a blast to master the game's many secrets.… Expand"}, {"name": "NCAA Football 09", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-football-09", "publisher": "Electronic Arts", "release_date": "Jul 15 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 83, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/43b51da9a6845d45ff8654f669c12679-98.jpg", "descriptions": "College football has never before felt more wide open than in NCAA Football 09. Gamers can experience the excitement of making big plays on the field, as they have the ability to directly control and influence the game through the all-new break away animation engine. With huge cut-backCollege football has never before felt more wide open than in NCAA Football 09. Gamers can experience the excitement of making big plays on the field, as they have the ability to directly control and influence the game through the all-new break away animation engine. With huge cut-back lanes, new tackling animations and wider blocking holes, NCAA Football 09 offers a host of offensive opportunities. NCAA Football 09 also brings the atmosphere, pageantry and tradition of college football to life. Through the redesigned stadiums, which reflect even more detail of each school’s individual playing field, to the dynamic sidelines filled with school colors, cheerleaders and mascots, players feel the excitement of college gameday. Players can gain Home Field Advantage as the intensity of the home crowd rises and rattles the composure of opposing teams. All 120 Football Bowl Subdivision schools are represented in the game and players can even customize the in-game atmosphere with their own personal music collection. Off the field, NCAA Football 09 features its most robust Dynasty Mode yet, inviting fans to create and manage a perennial powerhouse program from landing blue-chip recruits to winning championships on the field. For the first time ever, Dynasty goes online with up to 12 competitors to recruit head-to-head, customize schedules and play for up to 60 seasons. [Electronic Arts]… Expand"}, {"name": "Star Wars: Battlefront II (2005)", "details_link": "https://www.metacritic.com/game/xbox/star-wars-battlefront-ii-2005", "publisher": "LucasArts", "release_date": "Nov  1 2005", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 83, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/89dec376d01d78baa01d84f1c4076cdc-98.jpg", "descriptions": "This sequel to Star Wars Battlefront improves upon its predecessor with a variety of gameplay enhancements, such as upgraded AI, more than 16 new battlegrounds, and greater story emphasis. In addition to the rebel, clone, and droid warriors from the original game, you can play as a Jedi,This sequel to Star Wars Battlefront improves upon its predecessor with a variety of gameplay enhancements, such as upgraded AI, more than 16 new battlegrounds, and greater story emphasis. In addition to the rebel, clone, and droid warriors from the original game, you can play as a Jedi, complete with lightsaber attacks and force powers. Take part in land and space battles from the Star Wars movie series, and pilot a variety of new aircraft, including X-Wings, TIE fighters, and Jedi Starfighters. Star Wars Battlefront also includes online multiplayer modes for battling other gamers. … Expand"}, {"name": "Wipeout Fusion", "details_link": "https://www.metacritic.com/game/playstation-2/wipeout-fusion", "publisher": "Bam Entertainment", "release_date": "Jun 17 2002", "developers": ["Studio Liverpool"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 83, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/01e23258099d41d9062da5155e3894b9-98.jpg", "descriptions": "It's WipEout time again, with the fourth instalment of the critically acclaimed series exploding onto PlayStation 2. Once again you must push your reactions and abilities to the limit in order to leave your rivals in the dust. With 45 futuristic race circuits to negotiate, WipEout FusionIt's WipEout time again, with the fourth instalment of the critically acclaimed series exploding onto PlayStation 2. Once again you must push your reactions and abilities to the limit in order to leave your rivals in the dust. With 45 futuristic race circuits to negotiate, WipEout Fusion will have you corkscrewing, jumping, barrel-rolling and looping like never before. Other enhancements include the addition of the Endurance and Zone modes, superior AI and the option to customise craft handling to match each course. [Sony Europe]… Expand"}, {"name": "Independence War 2: Edge of Chaos", "details_link": "https://www.metacritic.com/game/pc/independence-war-2-edge-of-chaos", "publisher": "Infogrames", "release_date": "Aug 22 2001", "developers": ["Particle Systems"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Large Spaceship", "Large Spaceship", "Combat", "Civilian"], "meta_score": 83, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/95c9441f1c0652b587475a646a14e0a7-98.jpg", "descriptions": "The Badlands cluster. 100 years after the first Independence War. Your father was killed by the Corporations for a bad debt. And you've spent 15 years rotting in jail for trying to get justice. Now it's time for vengeance. Command four futuristic battlecruisers and a band of revolutionaryThe Badlands cluster. 100 years after the first Independence War. Your father was killed by the Corporations for a bad debt. And you've spent 15 years rotting in jail for trying to get justice. Now it's time for vengeance. Command four futuristic battlecruisers and a band of revolutionary pirates into an all-consuming battle against impossible odds...because there just isn't enough Space for everyone! [Infogrames]… Expand"}, {"name": "Myst III: Exile", "details_link": "https://www.metacritic.com/game/pc/myst-iii-exile", "publisher": "Ubisoft", "release_date": "May  8 2001", "developers": ["Presto Studios"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Fantasy", "Fantasy"], "meta_score": 83, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/cfb825974c3f44c397cc57530f4f9994-98.jpg", "descriptions": "The next chapter in this point and click adventure series which begun with \"Myst\" and \"Riven,\" the best selling games of all time on any system, focuses on further exploration and puzzle-solving with the D'ni, a race who write magical books and create links to the \"ages\" described in them."}, {"name": "Final Fantasy Tactics", "details_link": "https://www.metacritic.com/game/playstation/final-fantasy-tactics", "publisher": "SCEA", "release_date": "Jan 28 1998", "developers": ["SquareSoft"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 83, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/9/b2892061938df1c4d226fb9b42d183ed-98.jpg", "descriptions": "Featuring over 20 types of Jobs and 400 Abilities through the Job System, beautifully laid out 3D environments and the Charge Time Battle System, FINAL FANTASY Tactics provides strategy-intensive gameplay that takes a twist on the traditional RPG."}, {"name": "Ace Combat 2", "details_link": "https://www.metacritic.com/game/playstation/ace-combat-2", "publisher": "Namco", "release_date": "Jul 31 1997", "developers": ["Namco"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 83, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/210b055f45d61cf59bd00156b2f6a269-98.jpg", "descriptions": "We've devised a weapon that's deadlier than a smart bomb. It's called a smart pilot. Now, Ace Combat 2 pits you against a whole squadron of them - 3-D polygonal jet jocks that maneuver like the real deal, turning every scorching sortie and dogfight into a kill-or-be-killed situation. WithWe've devised a weapon that's deadlier than a smart bomb. It's called a smart pilot. Now, Ace Combat 2 pits you against a whole squadron of them - 3-D polygonal jet jocks that maneuver like the real deal, turning every scorching sortie and dogfight into a kill-or-be-killed situation. With nearly double the missions of its predecessor, you'll double your chances of taking out the enemy. (Or taking a heat-seeker up the exhaust.)… Expand"}, {"name": "Superbrothers: Sword & Sworcery EP", "details_link": "https://www.metacritic.com/game/pc/superbrothers-sword-sworcery-ep", "publisher": "Superbrothers", "release_date": "Apr 16 2012", "developers": ["Capy Games"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 83, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/abf8ee3251905a4c70dfdfdb838292f7-98.jpg", "descriptions": "Superbrothers: Sword & Sworcery EP is an exploratory action adventure with an emphasis on audiovisual style. Traverse a mythic little realm, use a sword to do battle & evoke sworcery to solve mystical musical mysteries. Co-operate with friends via Twitter, experience a videogameSuperbrothers: Sword & Sworcery EP is an exploratory action adventure with an emphasis on audiovisual style. Traverse a mythic little realm, use a sword to do battle & evoke sworcery to solve mystical musical mysteries. Co-operate with friends via Twitter, experience a videogame world that is affected by moon phases & help a wandering warrior monk complete her woeful errand.… Expand"}, {"name": "Spyro Reignited Trilogy", "details_link": "https://www.metacritic.com/game/xbox-one/spyro-reignited-trilogy", "publisher": "Activision", "release_date": "Nov 13 2018", "developers": ["Activision", "Toys for Bob"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 83, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/0ef7d008d4e1bdf35f21d1a3fa8fd342-98.jpg", "descriptions": "The original roast master is back. Same sick burns, same smoldering attitude, now all scaled up in stunning HD. Spyro is bringing the heat like never before in the Spyro Reignited Trilogy game collection. Rekindle the fire with the original three games, Spyro the Dragon, Spyro 2: Ripto'sThe original roast master is back. Same sick burns, same smoldering attitude, now all scaled up in stunning HD. Spyro is bringing the heat like never before in the Spyro Reignited Trilogy game collection. Rekindle the fire with the original three games, Spyro the Dragon, Spyro 2: Ripto's Rage! and Spyro: Year of the Dragon. Explore the expansive realms, re-encounter the fiery personalities and relive the adventure in fully remastered glory. Because when there's a realm that needs saving, there's only one dragon to call.… Expand"}, {"name": "Sid Meier's Civilization IV: Colonization", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-iv-colonization", "publisher": "2K Games", "release_date": "Sep 22 2008", "developers": ["Firaxis Games"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "4X"], "meta_score": 83, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/72665d87d03053bfcb33f8e4ee2b1aa3-98.jpg", "descriptions": "In Colonization, players lead one of four European nations on a quest to conquer and rule the New World. Players are challenged to guide their people from the oppressive motherland, discover the New World, and negotiate, trade and fight with both the natives and other nations as they acquireIn Colonization, players lead one of four European nations on a quest to conquer and rule the New World. Players are challenged to guide their people from the oppressive motherland, discover the New World, and negotiate, trade and fight with both the natives and other nations as they acquire power and fight for freedom and independence. As a complete reimagining of the 1994 classic, Colonization is a total conversion of Civilization IV that combines Civilization's addictive \"just one more turn\" gameplay with all-new graphics and features that add more depth to the franchise. New features include brand-new interface, improved diplomacy options and the included modding tools. Colonization does not require the original Civilization IV product in order to be played. [2K Games]… Expand"}, {"name": "Pro Evolution Soccer 2008", "details_link": "https://www.metacritic.com/game/wii/pro-evolution-soccer-2008", "publisher": "Konami", "release_date": "Mar 18 2008", "developers": ["Konami"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 83, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/0be6bbb19bcc0a6fae26ad2eb67b1a0d-98.jpg", "descriptions": "PES 2008 has been redesigned to make incredible use of the motion-sensitive nature of the Wii's control system. The player has more control over the on-screen action than ever before, and in line with such advances, Konami has also unveiled an all-new pack design that conveys the uniquePES 2008 has been redesigned to make incredible use of the motion-sensitive nature of the Wii's control system. The player has more control over the on-screen action than ever before, and in line with such advances, Konami has also unveiled an all-new pack design that conveys the unique in-game visuals and ease of use while maximising its use of cover stars Cristiano Ronaldo and Michael Owen. Crucial to PES 2008 for Wii is an all-new control system that truly elevates the level of control available to the player while retaining the depth and intuitive moves of the series. Making use of the Wii Remote and Nunchuk, the player must also consider the movements of their teammates around them. The Nunchuck is used to move the current player, while the Wii Remote is used to pick out players to send them on runs or to receive passes via simple click and drag system which uses arrows to show the path of the run, and a press of the 'B' button to complete the move. [Konami]… Expand"}]