[{"name": "Dance Dance Revolution Universe 2", "details_link": "https://www.metacritic.com/game/xbox-360/dance-dance-revolution-universe-2", "publisher": "Konami", "release_date": "Dec  4 2007", "developers": ["Konami"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Dancing", "Dancing"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/97de4008839da47dbd00c9686a8b7a47-98.jpg", "descriptions": "The dancing universe expands further on the Xbox 360 with Dance Dance Revolution UNIVERSE 2.  Exclusively designed for the Xbox 360, Dance Dance Revolution UNIVERSE 2 has universal appeal with multiple options and settings for players of all skill levels, cool smash-hit songs and exclusivesThe dancing universe expands further on the Xbox 360 with Dance Dance Revolution UNIVERSE 2.  Exclusively designed for the Xbox 360, Dance Dance Revolution UNIVERSE 2 has universal appeal with multiple options and settings for players of all skill levels, cool smash-hit songs and exclusives and robust online and offline support. [Konami]… Expand"}, {"name": "Genesis Alpha One", "details_link": "https://www.metacritic.com/game/playstation-4/genesis-alpha-one", "publisher": "Team17", "release_date": "Jan 29 2019", "developers": ["Radiation Blue"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 65, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/fe38467c33f81c3696d59656a6092911-98.jpg", "descriptions": "Genesis Alpha One is a revolutionary mix of roguelike shooter, base building and survival that puts you in the role of an interstellar pioneer.In a near future ravaged by wars, corrupt regimes and global capitalism left unchecked have resulted in natural resource over-exploitation andGenesis Alpha One is a revolutionary mix of roguelike shooter, base building and survival that puts you in the role of an interstellar pioneer.In a near future ravaged by wars, corrupt regimes and global capitalism left unchecked have resulted in natural resource over-exploitation and pollution; devastating the planet. Supported by Earth's remaining governments, four influential corporations initiate the Genesis program. As the Captain of a Genesis starship, you journey into uncharted space on the ultimate mission. Build and manage a space vessel, farm resources, deal with terrifying alien infestations, clone creatures and explore a vast, randomly generated universe. Your goal: Find new homes for humanity's DNA and save the species from extinction.… Expand"}, {"name": "Dr. Luigi", "details_link": "https://www.metacritic.com/game/wii-u/dr-luigi", "publisher": "Nintendo", "release_date": "Dec 31 2013", "developers": ["Arika", "Nintendo"], "platforms": "Wii U", "num_players": "2 ", "genres": ["Miscellaneous", "Puzzle", "Stacking"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/185b042208ab2edda6a6588da87117a6-98.jpg", "descriptions": "Much like the classic puzzle game Dr. Mario, Dr. Luigi requires you to line up color-coded pills to destroy viruses. Dr. Luigi offers different skill settings and attacks in multiplayer games, and an original mode where the pills are, of course, L-shaped. The game comes with a Dr. MarioMuch like the classic puzzle game Dr. Mario, Dr. Luigi requires you to line up color-coded pills to destroy viruses. Dr. Luigi offers different skill settings and attacks in multiplayer games, and an original mode where the pills are, of course, L-shaped. The game comes with a Dr. Mario mode, Wii U GamePad compatibility, and online play, so wannabe virus busters from all around the world can compete. … Expand"}, {"name": "Armored Core 4", "details_link": "https://www.metacritic.com/game/xbox-360/armored-core-4", "publisher": "Sega", "release_date": "Mar 20 2007", "developers": ["From Software"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/928127462b11d5b0d986d2fc39cfc08c-98.jpg", "descriptions": "Armored Core 4 reinvigorates the brand by offering an all-new storyline, new environments, and online capability. The 10th anniversary of the acclaimed franchise is punctuated with a leap to next-generation platforms. Multiplayer functionality allows up to eight players to battle online.Armored Core 4 reinvigorates the brand by offering an all-new storyline, new environments, and online capability. The 10th anniversary of the acclaimed franchise is punctuated with a leap to next-generation platforms. Multiplayer functionality allows up to eight players to battle online. Join one of six factions specializing in different aspects of battle. 30 missions played out in detailed futuristic 3D environments. Fly through canyons and rip through cities battling multiple enemies. Deploy \"Quick Boost\" and \"Over Boost\" features for precise explosive movement and precision control of AC units. Engage \"Primal Armor\" the all-new defense shield that adjusts its strength according to specific battle conditions. [Sega]… Expand"}, {"name": "Kill la Kill: IF", "details_link": "https://www.metacritic.com/game/switch/kill-la-kill-if", "publisher": "Arc System Works", "release_date": "Jul 26 2019", "developers": ["Studio TRIGGER", "Aplus"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Action", "Fighting", "3D"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/44b654c9b8580c09937c96d050f99871-98.jpg", "descriptions": "You control Satsuki Kiryuin as the main\rprotagonist of this game, and proceed\ralong with the story while battling against\r\nvarious characters. All scenarios are\r\ncompletely new and fully\r\nsupervised under the watchful eyes of\r\nthe original scenario-writer,\r\nKazuki Nakashima. You will beYou control Satsuki Kiryuin as the main\rprotagonist of this game, and proceed\ralong with the story while battling against\rvarious characters. All scenarios are\rcompletely new and fully\rsupervised under the watchful eyes of\rthe original scenario-writer,\rKazuki Nakashima. You will be experiencing\rthe story unfold from the perspective of\rSatsuki Kiryuin, the rival of the original\rseries' protagonist Ryuko.… Expand"}, {"name": "NASCAR 09", "details_link": "https://www.metacritic.com/game/playstation-3/nascar-09", "publisher": "EA Sports", "release_date": "Jun 10 2008", "developers": ["EA Games"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 14 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/5a8a25f8a4a812aab07f8dea49d13264-98.jpg", "descriptions": "The road to victory begins with Jeff Gordon as he guides you through an all-new \"Chase for the NASCAR Sprint Cup\" Career Mode on a completely-revamped 3D menu interface. With Jeff's help you can sign big-time contracts, build your reputation and earn valuable performance points by dominatingThe road to victory begins with Jeff Gordon as he guides you through an all-new \"Chase for the NASCAR Sprint Cup\" Career Mode on a completely-revamped 3D menu interface. With Jeff's help you can sign big-time contracts, build your reputation and earn valuable performance points by dominating in the NASCAR Craftsman Truck Series, the NASCAR Nationwide Series and the NASCAR Sprint Cup Series. Two new and entirely distinct handling models let you play NASCAR 09 at your speed. Forgiving \"Normal\" mode is perfect for getting a handle on the game, while \"Pro\" mode delivers the authentic, white-knuckle NASCAR racing experience. Own the Track lets you compete against your friends and other gamers at all of hte Sprint Cup Series venues. Every racer's stats are compiled and the best driver at each track is named for the ultimate in bragging rights. [Electronic Arts]… Expand"}, {"name": "Mazes of Fate", "details_link": "https://www.metacritic.com/game/game-boy-advance/mazes-of-fate", "publisher": "O3 Entertainment", "release_date": "Dec  6 2006", "developers": ["Sabarasa Entertainment"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/19c4a991f9a8448f010fb3d6f7565a8c-98.jpg", "descriptions": "Mazes of Fate is an RPG for the Game Boy Advance and features 50 levels."}, {"name": "Curse of the Sea Rats", "details_link": "https://www.metacritic.com/game/playstation-5/curse-of-the-sea-rats", "publisher": "PQube", "release_date": "Apr  6 2023", "developers": ["PQube"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action", "Platformer", "Metroidvania"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/b3efe13dccf8c1c02e13c6c4e51520cc-98.jpg", "descriptions": "Curse of the Sea Rats is a 'ratoidvania' platform adventure with lovingly crafted, hand-drawn animations.Embark on the epic journey of four prisoners of the British empire, transformed into rats by the notorious pirate witch, Flora Burn. To regain their human bodies, they will have toCurse of the Sea Rats is a 'ratoidvania' platform adventure with lovingly crafted, hand-drawn animations.Embark on the epic journey of four prisoners of the British empire, transformed into rats by the notorious pirate witch, Flora Burn. To regain their human bodies, they will have to fight dangerous bosses, uncover the secrets of the vast Irish coast, and ultimately capture the witch who cursed them.A labyrinthine network of hundreds of pathways, rooms and discoveries lie ahead, in a substantial quest with over 12 hours of content.Can you master each character's playstyle, find all the hidden secrets, and unlock each of the game's multiple endings?… Expand"}, {"name": "198X", "details_link": "https://www.metacritic.com/game/switch/198x", "publisher": "8-4", "release_date": "Jan 23 2020", "developers": ["Hi-Bit Studios"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Party / Minigame", "2D"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/5193e0e1526fd52b1bf44aa243dbe0f8-98.jpg", "descriptions": "Welcome to Suburbia, just outside the City, sometime in 198X. This is the journey of Kid, a teenager stuck between the limitations of innocent youth and the obligations of inevitable adulthood. The story unfolds when Kid discovers the local arcade – finding new worlds, and new meaning, inWelcome to Suburbia, just outside the City, sometime in 198X. This is the journey of Kid, a teenager stuck between the limitations of innocent youth and the obligations of inevitable adulthood. The story unfolds when Kid discovers the local arcade – finding new worlds, and new meaning, in video games…… Expand"}, {"name": "SingStar Celebration", "details_link": "https://www.metacritic.com/game/playstation-4/singstar-celebration", "publisher": "Sony Interactive Entertainment", "release_date": "Oct 24 2017", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/a53b5c97639e181f3b286212dd505477-98.jpg", "descriptions": "Hit the high notes with upbeat tracks, massive hits and your favorite party classics. Whether it's your birthday, Christmas, New Year's Eve or even just a Saturday night -- SingStar Celebration is the perfect playlist to any party, with up to eight players able to join in the fun. Use yourHit the high notes with upbeat tracks, massive hits and your favorite party classics. Whether it's your birthday, Christmas, New Year's Eve or even just a Saturday night -- SingStar Celebration is the perfect playlist to any party, with up to eight players able to join in the fun. Use your SingStar mic or combine your smartphone with the SingStar Mic App, and get ready for your big moment.… Expand"}, {"name": "Pro Cycling Manager Season 2013: Le Tour de France - 100th Edition", "details_link": "https://www.metacritic.com/game/pc/pro-cycling-manager-season-2013-le-tour-de-france---100th-edition", "publisher": "Focus Home Interactive", "release_date": "Jun 20 2013", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Alternative", "Biking", "Sports", "Individual", "Biking"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/401ac4020b4805100321163c00aa9c71-98.jpg", "descriptions": "With its 2013 edition, Pro Cycling Manager pushes race realism with a more refined Career mode. Use its remodelled and improved interface to better prepare for your season. Negotiate the team’s objectives with your sponsors, and plan the races/your riders’ objectives according to the desiredWith its 2013 edition, Pro Cycling Manager pushes race realism with a more refined Career mode. Use its remodelled and improved interface to better prepare for your season. Negotiate the team’s objectives with your sponsors, and plan the races/your riders’ objectives according to the desired results and each rider’s expectations. Strive to satisfy each member of the team throughout the season with regard to their race schedule: take into account the prestige of each race, and ensure that the event matches the rider’s profile otherwise it may knock his satisfaction.… Expand"}, {"name": "Warhammer 40,000: Inquisitor - Martyr", "details_link": "https://www.metacritic.com/game/playstation-4/warhammer-40000-inquisitor---martyr", "publisher": "Bigben Interactive", "release_date": "Aug 23 2018", "developers": ["Maximum Games"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 65, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/2870559b6239fd683d7fc1c315245f68-98.jpg", "descriptions": "Enter the Chaos-infested Caligari Sector and purge the unclean with the most powerful agents of the Imperium of Man. Warhammer 40,000: Inquisitor Martyr is a grim Action-RPG featuring multiple classes of the Inquisition who will carry out the will of the Emperor even in the darkest reachesEnter the Chaos-infested Caligari Sector and purge the unclean with the most powerful agents of the Imperium of Man. Warhammer 40,000: Inquisitor Martyr is a grim Action-RPG featuring multiple classes of the Inquisition who will carry out the will of the Emperor even in the darkest reaches of the Imperium. THE NEXT MILESTONE IN THE EVOLUTION OF ARPGS. The first Action-RPG set in the grim future of the 41st Millennium takes the genre to its next level: an open-world sandbox game with a persistent universe with a huge variety of missions, tactical, brutal combat encounters in destructible environments and a storyline influenced by the community of players. Use the cover system for tactical advantage, shoot off limbs and perform executions in epic boss battles and become a Protector of any solar systems with your glorious actions!\r INQUISITORS: SECRET AGENTS AND SPECIALISTS\rForge your own playstyle with different character classes and specializations: hold your ground with the Crusader Inquisitor while enemies close in on you, bring in your finesse and cunning with the Death Cult Assassin background, or use the unspeakable powers of the Warp with the Primaris Psyker background. Choose from three specializations for each classes that fit your playstyle.\r TRAVERSE A WHOLE GALACTIC SECTOR\rExplore the Star Map of the vast Caligari Sector, travel in different subsectors and explore an immense amount of solar systems, visit a growing number of unique points of interests: investigate on different planets with distinctive terrain conditions, fight your way through corridors of infested Void Stations, abandoned Star Forts and other diverse environments!\r FIGHT THE CORRUPTION TOGETHER\rYou can go solo as a lonely Inquisitor, but you can also assemble a team of your friends! Play missions in co-operative mode with up to 4 team members, blast away your foes together claiming great rewards, and form Cabals to gather your close allies! Inquisitorial Cabals are groups of Inquisitors working together. Cabals can progress just like characters do, and being a member can often grant special missions. The Inquisition has a lot of different factions with different agendas, and Cabals sometimes clash with each other in the shadows.\r IMPROVE YOUR WEAPONS, CRAFT MISSIONS AND TWEAK YOUR SKILLS\rLooking for a specific loot or reward? Use Uther's Tarot to set the conditions of your next mission, collect Blueprints and use Crafting to improve your equipment, and use the Inoculator to fine-tune your different skills. Choose your loadout to your advantage for each mission!\r A LIVING, EXPANDING WORLD\rWarhammer 40,000: Inquisitor Martyr is an ever-growing, long-lasting experience. Expansions and regular free updates will introduce new enemy factions, new terrain settings, new missions and mission types, new story-driven investigations and new gameplay features. Seasons are big, free updates that will introduce longer story arcs in which players can shape the persistent world of the Caligari sector with their actions. Daily Quests, Tiers and Power Levels ensure new challenges there's always something new to explore or to collect!… Expand"}, {"name": "The Baconing", "details_link": "https://www.metacritic.com/game/playstation-3/the-baconing", "publisher": "Hothead Games", "release_date": "Aug 30 2011", "developers": ["Hothead Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "3D"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/1e10d35705188d87b32349070ca086e6-98.jpg", "descriptions": "DeathSpank returns in the sequel DeathSpank: The Baconing."}, {"name": "Dragon Ball: Revenge of King Piccolo", "details_link": "https://www.metacritic.com/game/wii/dragon-ball-revenge-of-king-piccolo", "publisher": "Namco Bandai Games America", "release_date": "Oct 20 2009", "developers": ["Media.Vision"], "platforms": "Wii", "genres": ["Action", "Adventure", "General", "General", "Beat-'Em-Up", "2D"], "meta_score": 65, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/caa57d7a75882e4a0cd23dfde85fa846-98.jpg", "descriptions": "Heading back to the early days of the Dragon Ball story, players control Kid Goku as he sets out on fantastic adventures with his friends. The title faithfully reproduces the uniqueness and special humour of the early Dragon Ball series, while adding an original blend of action and adventureHeading back to the early days of the Dragon Ball story, players control Kid Goku as he sets out on fantastic adventures with his friends. The title faithfully reproduces the uniqueness and special humour of the early Dragon Ball series, while adding an original blend of action and adventure to the mix.  With the original Japanese music and voiceover included for maximum authenticity, Dragon Ball: Revenge of King Piccolo offers fans a dazzling new experience with the characters and universe they know and love. The visuals in Dragon Ball: Revenge of King Piccolo take the series to a new level by faithfully reproducing on-screen the original drawings of legendary Dragon Ball artist Akira Toriyama down to the finest pen strokes.  Thanks to the high-quality, state-of-the-art graphics, fans immerse themselves in the Dragon Ball universe like never before. Game modes include Story mode which follows Kid Goku from the Red Ribbon Saga to the King Piccolo Saga with the ability to replay previously completed stages, and the unlockable VS mode where players can take different unlocked characters into battle. With in-game collectables, a host of unlockables, and more fun, fights and adventure than ever before all delivered in dazzling 3D, Dragon Ball: Revenge of King Piccolo is the definitive Dragon Ball videogame experience coming to Wii. [Namco Bandai Games]… Expand"}, {"name": "Heavy Weapon: Atomic Tank", "details_link": "https://www.metacritic.com/game/playstation-3/heavy-weapon-atomic-tank", "publisher": "PopCap", "release_date": "Jun 11 2009", "developers": ["PopCap"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/80b0482ebc376f2bffd0bb864bb40d29-98.jpg", "descriptions": "[Playstation Network] Heavy Weapon fans can enjoy a new feature created exclusively for the PS3, which is the ability to shoot down and destroy the supply helicopter as it delivers power ups to you. It makes some of the later levels a bit more challenging since you have to pay more attention[Playstation Network] Heavy Weapon fans can enjoy a new feature created exclusively for the PS3, which is the ability to shoot down and destroy the supply helicopter as it delivers power ups to you. It makes some of the later levels a bit more challenging since you have to pay more attention to your allies while you’re shooting down everything else in the sky. [Playstation]… Expand"}, {"name": "Skelattack", "details_link": "https://www.metacritic.com/game/playstation-4/skelattack", "publisher": "Konami", "release_date": "Jun  2 2020", "developers": ["Ukuza"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/f2fae8fd5c47c09414d343d323f62713-98.jpg", "descriptions": "A bell begins ringing incessantly in your quarters. A frantic friend paces nervously as you awaken from your undead slumber. He warns you of invading humans! It is up to you to heed his words, arm yourself for battle, and venture out into your unprotected underground home.You are Skully,A bell begins ringing incessantly in your quarters. A frantic friend paces nervously as you awaken from your undead slumber. He warns you of invading humans! It is up to you to heed his words, arm yourself for battle, and venture out into your unprotected underground home.You are Skully, an undead skeleton whose sole purpose is to protect the dungeon he and many others call home. Along with your bat companion Imber, you will travel through sewers, lush underground nature preserves, and many other perilous environments. You will do so in the name of protecting your friends, guarding your treasures, and keeping hidden the dungeon's deepest secrets.Skelattack puts an unconventional twist on your classic dungeon-crawler. Instead of playing the human hero fighting his way through the dungeon, killing all the baddies and pillaging all the loot, you play as one of the dungeon's typical skeleton NPCs. This is life (or rather, death) on the other side of the aisle: the plight of the creatures whose home is constantly under threat from those who reside above-ground.… Expand"}, {"name": "The Falconeer", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-falconeer", "publisher": "Wired Productions", "release_date": "Nov 10 2020", "developers": ["Tomas Sala"], "platforms": ["PC", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 65, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/e8e5ae8f4838287b2fdd8119235c5a01-98.jpg", "descriptions": "Generations of poisonous decisions and treason swirl in the deep, as factions collide. Become the Falconeer and soar through the skies aboard a devastatingly powerful Warbird. Uncover secrets lost to the sea as you join or oppose different factions and clans scattered throughout The GreatGenerations of poisonous decisions and treason swirl in the deep, as factions collide. Become the Falconeer and soar through the skies aboard a devastatingly powerful Warbird. Uncover secrets lost to the sea as you join or oppose different factions and clans scattered throughout The Great Ursee. Take advantage of multiple Falconeer classes with individual stats, weapons and warbirds that can be upgraded through winning battles, completing quests, discovering secrets, or applying Mutagens or Chants. Use ocean thermals and energy to dive, dodge, barrel-roll, and twist to gain an advantage. The Falconeer is an open-world air combat game, featuring fast, brutal aerial dogfights and deep exploration of an incredible fantasy open-world set not only above the clouds, but also amongst the waves and down through the sunken, ocean depths.… Expand"}, {"name": "Fragments of Him", "details_link": "https://www.metacritic.com/game/playstation-4/fragments-of-him", "publisher": "Sassybot", "release_date": "Sep 26 2017", "developers": ["Sassybot"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 65, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/42c15eb7fc46c58cf95bc5674bb458d8-98.jpg", "descriptions": "When a young man dies suddenly, his friends and family are left to pick up the pieces. What were his last thoughts, what were the moments in which he changed their lives, and how will their lives be without him?"}, {"name": "Tears to Tiara II: Heir of the Overlord", "details_link": "https://www.metacritic.com/game/playstation-3/tears-to-tiara-ii-heir-of-the-overlord", "publisher": "Atlus", "release_date": "Oct 14 2014", "developers": ["Aqua Plus"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Real-Time", "Fantasy", "Strategy", "Adventure", "Turn-Based", "Visual Novel", "General"], "meta_score": 65, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/5ee13cf69d9caa71e85bc9bf6bf9d589-98.jpg", "descriptions": "A Story of a Forgotten Goddess and an Overlord..."}, {"name": "Band Hero", "details_link": "https://www.metacritic.com/game/ds/band-hero", "publisher": "Activision", "release_date": "Nov  3 2009", "developers": ["Vicarious Visions"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/0ef6dae1a9993431d7597cae388f63bd-98.jpg", "descriptions": "Band Hero delivers an explosive social gameplay experience for Nintendo DS Lite with the addition of vocals and drums via an innovative new Drum Grip to the guitar and bass gameplay popularized by the Guitar Hero On Tour trilogy. Band Hero allows handheld gamers to choose the way they wantBand Hero delivers an explosive social gameplay experience for Nintendo DS Lite with the addition of vocals and drums via an innovative new Drum Grip to the guitar and bass gameplay popularized by the Guitar Hero On Tour trilogy. Band Hero allows handheld gamers to choose the way they want to play in multiplayer mode with any instrument combination of guitar, bass, drums and vocals as they strum, drum and belt out some of today's most popular tracks across multiple genres of music, including rock, pop, alternative and punk. With the largest and most diverse set list in a Nintendo DS Lite offering to-date, Band Hero offers fans 30 master recordings from today’s top artists including: Blink-182, Avril Lavigne, The Killers, KT Tunstall, and Fall Out Boy. With new features players can enjoy anytime, anywhere, a brand new Rockstar Editor to fully customize your band members, No Fail mode and Stage Stunts, Band Hero changes the way games can be played on the road. [Activision]… Expand"}, {"name": "Aven Colony", "details_link": "https://www.metacritic.com/game/pc/aven-colony", "publisher": "Mothership Entertainment", "release_date": "Jul 25 2017", "developers": ["Mothership Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/83d8bbab0d5543309ff8ee9d8a2c017b-98.jpg", "descriptions": "Aven Colony puts you in charge of humanity's first extrasolar settlement on Aven Prime, an alien planet of deserts, tundras, and jungles light years from earth. Build the infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity --Aven Colony puts you in charge of humanity's first extrasolar settlement on Aven Prime, an alien planet of deserts, tundras, and jungles light years from earth. Build the infrastructure, look after the well-being of your citizens, manage your resources, and guide your colony to prosperity -- all while dealing with the harsh and often dangerous realities of an alien world.\r Features:\r * Build: Take charge of humanity's first extrasolar settlement on a new alien world. Build and expand your small colonies into massive, sprawling cities.\r * Discover: Deploy your crack team of pioneers to take on alien lifeforms and unlock the secrets of Aven Prime, as you tackle the campaign and sandbox modes.\r * Survive: Prepare for harsh winters, electrical storms and much more in this cruel and often dangerous new environment.… Expand"}, {"name": "Dedede's Drum Dash Deluxe", "details_link": "https://www.metacritic.com/game/3ds/dededes-drum-dash-deluxe", "publisher": "Nintendo", "release_date": "Aug 29 2014", "developers": ["HAL Labs"], "platforms": "3DS", "genres": ["Action", "Miscellaneous", "Rhythm", "Music"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/dc1da8adb3fe64d390f8d80dfbcac388-98.jpg", "descriptions": "Bounce to the beat as Kirbys longtime rival in King Dededes rhythm action game! Jump on drums collecting coins and avoiding enemies while tapping buttons in sync with catchy Kirby tunes! This standalone deluxe game includes content not found in Kirby: Triple Deluxe, including all-new stages,Bounce to the beat as Kirbys longtime rival in King Dededes rhythm action game! Jump on drums collecting coins and avoiding enemies while tapping buttons in sync with catchy Kirby tunes! This standalone deluxe game includes content not found in Kirby: Triple Deluxe, including all-new stages, new obstacles and more!… Expand"}, {"name": "Antigraviator", "details_link": "https://www.metacritic.com/game/pc/antigraviator", "publisher": "Iceberg Interactive", "release_date": "Jun  6 2018", "developers": ["Iceberg Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 65, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/b1b3924378fdc59c0143b79c36619469-98.jpg", "descriptions": "Antigraviator is a sleek new take on the anti-gravity racing genre. Use traps, power-ups and boosts to overtake your opponents and dominate the track in single player or multiplayer mode. With no speed limit holding you back, Antigraviator delivers the fastest racing experience of the future."}, {"name": "Obscure", "details_link": "https://www.metacritic.com/game/playstation-2/obscure", "publisher": "DreamCatcher Interactive", "release_date": "Apr  6 2005", "developers": ["Hydravision"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action Adventure", "Horror"], "meta_score": 65, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/1/62acef900b77777dd4035582ffac1b49-98.jpg", "descriptions": "As many highschools, Leafmore High is no longer the highschool it used to be. Its walls are mouldering, its books are outdated, its teachers have lost their faith... Following the disappearance of one of their friends, a group of students decide to investigate their high school. This braveAs many highschools, Leafmore High is no longer the highschool it used to be. Its walls are mouldering, its books are outdated, its teachers have lost their faith... Following the disappearance of one of their friends, a group of students decide to investigate their high school. This brave step will lead them into a hell they will never forget. But, no matter what happens, they must stick together if they want to throw light on the dark and sordid history of their school. Play five different students, alone or in cooperation, every one of them having their own special aptitude, and use them wisely to defeat the monsters creeping around. [Hydravision]… Expand"}, {"name": "How to Survive: Storm Warning Edition", "details_link": "https://www.metacritic.com/game/playstation-4/how-to-survive-storm-warning-edition", "publisher": "505 Games", "release_date": "Nov  4 2014", "developers": ["EKO Software"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/a73c3fb51afb859cd3aa568ff1cf2613-98.jpg", "descriptions": "Survive on a zombie infested archipelago, satisfy your basic needs of food, water and shelter while facing natural and unnatural threats. An eccentric survival guide teaches you to craft dozens of weapons and tools: from fishing rods or bows, to chainsaws or explosives. Seven islands filledSurvive on a zombie infested archipelago, satisfy your basic needs of food, water and shelter while facing natural and unnatural threats. An eccentric survival guide teaches you to craft dozens of weapons and tools: from fishing rods or bows, to chainsaws or explosives. Seven islands filled with exuberant flora and fauna.… Expand"}, {"name": "Sengoku Basara: Samurai Heroes", "details_link": "https://www.metacritic.com/game/wii/sengoku-basara-samurai-heroes", "publisher": "Capcom", "release_date": "Oct 12 2010", "developers": ["Capcom"], "platforms": ["PlayStation 3", "Wii"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 65, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/39c2ae9bc11abd19d1b5afa7b2550e6b-98.jpg", "descriptions": "Featuring unique playable characters, as well as supporting generals who will make it easier to command and lead armies, players will see the battle from the perspective of each military commander with the ultimate goal of re-writing history to rule all of 16th century Japan. In the dynamicFeaturing unique playable characters, as well as supporting generals who will make it easier to command and lead armies, players will see the battle from the perspective of each military commander with the ultimate goal of re-writing history to rule all of 16th century Japan. In the dynamic new \"Hero's Story\" mode, the player's decisions impact history with a redesigned story mode. Based on choices made by the player, new drama unfolds as friends become enemies, enemies become friends, and a new Sengoku story unfolds. Adding a new strategic element to the game, forces can fight for control/taking over of camps and ultimately entire battlefields.… Expand"}, {"name": "Bee Movie Game", "details_link": "https://www.metacritic.com/game/playstation-2/bee-movie-game", "publisher": "Activision", "release_date": "Oct 30 2007", "developers": ["Beenox"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/9d85f67aa2fd7275016d723d160d2faf-98.jpg", "descriptions": "Based on the DreamWorks Animation movie written, produced by and starring Jerry Seinfeld, Bee Movie Game lets players race, chase and fly their way through an adrenaline-fueled world of adventure as they experience the hilarious antics of Barry B. Benson, a dynamic and daring bee who knowsBased on the DreamWorks Animation movie written, produced by and starring Jerry Seinfeld, Bee Movie Game lets players race, chase and fly their way through an adrenaline-fueled world of adventure as they experience the hilarious antics of Barry B. Benson, a dynamic and daring bee who knows there is more to life than making honey. [Activision]… Expand"}, {"name": "Crash of the Titans", "details_link": "https://www.metacritic.com/game/xbox-360/crash-of-the-titans", "publisher": "Sierra Entertainment", "release_date": "Oct  4 2007", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/a51aca21b8eb1a735945c35f7d4a5a79-98.jpg", "descriptions": "In Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their actionIn Crash of the Titans, players fight a nefarious plot hatched by Crash's arch nemeses Neo and Nina Cortex to mutate the local creatures into titanic abominations. Using Crash's legendary mix of outrageous antics and daredevil bravado, players \"hijack\" enemies to take control of their action and use their fearsome powers against all manner of enemies. \"Jack to Attack!\" – Control, play and battle as 15 enemies, including titanic creatures such as Scorporilla, Ratcicle, Magamadon and Shellephant. While in control of a monster players can throw toxic stink bombs, call lightning down from the sky, fire lasers beams from their eyes or even impale enemies with a massive scorpion tail - use all of the creatures' special abilities to defeat Neo and Nina Cortex. Crash now has a powerful acrobatic fighting system that includes punches and flying kicks, multiple attacks and special counter moves. Players can power-up skills to unlock new attacks and blazing combos. Crash can now interact with his world in totally new ways. Players can wall-run, swing from ropes and flip off springboards – Crash can even toss Aku Aku on the ground to surf, skate, grind and shred. At any point in the game, a second player can join in the fun and play as Carbon-Crash to help unleash total chaos. In a totally innovative twist to co-op action gaming, Crash can even jack Carbon-Crash (or vice versa) for some hysterical Crash \"jacked\"-Crash mayhem. [Sierra Entertainment]… Expand"}, {"name": "NHL 08", "details_link": "https://www.metacritic.com/game/pc/nhl-08", "publisher": "Electronic Arts", "release_date": "Sep 11 2007", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 65, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/8/32d4302c500ac1075bd6a790f97e0b37-98.jpg", "descriptions": "The Skill Stick gave you the power to deke the goalie in NHL 07 – now you can own the 1-on-1 matchup and undress opposing defenseman with complete control Use your stick to push the puck into space and walk around your defender. Once you're all alone in front, improved stick handling andThe Skill Stick gave you the power to deke the goalie in NHL 07 – now you can own the 1-on-1 matchup and undress opposing defenseman with complete control Use your stick to push the puck into space and walk around your defender. Once you're all alone in front, improved stick handling and shooting accuracy will give you the toolset to beat your goaltender for that decisive goal. Dynamic AI adjusts to your every move both on offense and defense, promising to challenge even the most skilled hockey players. The intelligent CPU scouts your tendencies like a coach and makes the necessary adjustments to shut down your money plays, forcing you to adjust your style of play. New analog speed control of the left stick gives you the variance you need to glide into the zone with control or get a burst of speed to step up on a defender. With new skating animations and responsiveness, you have the control to perform crossovers to maintain speed or carve tight turns for an immediate change in direction. 29 AHL teams – the top developmental league for the NHL – are exclusively featured and fully playable. Develop your talent with their minor affiliate until you are ready to call them up for the show. Be the GM and manage your team from the ground up while staying under the salary cap. [Electronic Arts]… Expand"}, {"name": "Gladiator: Sword of Vengeance", "details_link": "https://www.metacritic.com/game/playstation-2/gladiator-sword-of-vengeance", "publisher": "Acclaim", "release_date": "Nov  5 2003", "developers": ["Acclaim Studios Manchester"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/cdf7776aa579c4684b4b8b85636714d8-98.jpg", "descriptions": "A Warrior Slave... Chosen by the Gods... To restore the glory of an Empire. In the Year 106AD the Roman Empire is in terrible decline. After the untimely death of the much-liked Emperor Trajan, the despotic Emperor Arruntius has bled the once powerful Rome to its knees. Badly fought wars,A Warrior Slave... Chosen by the Gods... To restore the glory of an Empire. In the Year 106AD the Roman Empire is in terrible decline. After the untimely death of the much-liked Emperor Trajan, the despotic Emperor Arruntius has bled the once powerful Rome to its knees. Badly fought wars, famine and plague are rife in all corners of the Empire, whilst the Emperor and his elite enjoy every excess and vice that the emptying coffers can afford. As herald to this age of degradation, Arruntius has destroyed large portions of the city of Rome to create the battleground for the bloodiest gladiator event ever staged... [Acclaim]… Expand"}, {"name": "Harry Potter and the Sorcerer's Stone", "details_link": "https://www.metacritic.com/game/pc/harry-potter-and-the-sorcerers-stone", "publisher": "Electronic Arts", "release_date": "Nov 16 2001", "developers": ["KnowWonder"], "platforms": ["PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/a87786435adb77ec5e4cff2b596a8994-98.jpg", "descriptions": "Be Harry Potter learning to master all things magical in a world filled with wizardry, fun, and danger. Attend lessons, learn and cast spells, explore Hogwarts and its grounds, and take flight to play Quidditch. Interact with unforgettable characters such as Ron Weasley, Hermione Granger,Be Harry Potter learning to master all things magical in a world filled with wizardry, fun, and danger. Attend lessons, learn and cast spells, explore Hogwarts and its grounds, and take flight to play Quidditch. Interact with unforgettable characters such as Ron Weasley, Hermione Granger, Draco Malfoy, and Rubeus Hagrid. Overcome physical, mental, and magical challenges to defeat the evil plans of You-Know-Who. [Electronic Arts]… Expand"}, {"name": "Stretch Panic", "details_link": "https://www.metacritic.com/game/playstation-2/stretch-panic", "publisher": "Conspiracy Entertainment", "release_date": "Aug 28 2001", "developers": ["Treasure"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/2d4e13314831ba4df83517d5a416b2ce-98.jpg", "descriptions": "\"This is the unusual story of an unusual little girl,\" the game begins.  Play as cute little Linda who -- using only her scarf which has been imbued with incredible powers -- must save her 12 sisters who have been possessed by the demons of vanity."}, {"name": "Off-Road Redneck Racing", "details_link": "https://www.metacritic.com/game/pc/off-road-redneck-racing", "publisher": "Interplay", "release_date": "May  2 2001", "developers": ["Rage Software"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Automobile"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/4a44fa7d3700efd20371e2cfe8a80ca7-98.jpg", "descriptions": "Officially endorsed by Leonard and Bubba, this racer is \"a blast of seriously fun off-road racing action.\" Select from 16 different vehicles types - each with three styling variations making for a grand total of 48 unique racing machines - and take on the best drivers in the south across 24Officially endorsed by Leonard and Bubba, this racer is \"a blast of seriously fun off-road racing action.\" Select from 16 different vehicles types - each with three styling variations making for a grand total of 48 unique racing machines - and take on the best drivers in the south across 24 challenging tracks, spread across 6 environments. (Interplay)… Expand"}, {"name": "Super Runabout: San Francisco Edition", "details_link": "https://www.metacritic.com/game/dreamcast/super-runabout-san-francisco-edition", "publisher": "Interplay", "release_date": "Oct 28 2000", "developers": ["Climax Entertainment"], "platforms": "Dreamcast", "genres": ["Driving", "Mission-based"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/14002615c4922142380ba71d45b1388c-98.jpg", "descriptions": "Many games try to test your skill, but Super Runabout works to exercise your sense of frustration."}, {"name": "Walt Disney World Quest: Magical Racing Tour", "details_link": "https://www.metacritic.com/game/dreamcast/walt-disney-world-quest-magical-racing-tour", "publisher": "Eidos Interactive", "release_date": "Jul 19 2000", "developers": ["Crystal Dynamics"], "platforms": ["PC", "Dreamcast"], "genres": ["Driving", "Racing", "Kart"], "meta_score": 65, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/b6c01fac0b64c37269c0de9d82b78df7-98.jpg", "descriptions": "Catch The Magic!\r Experience the thrill of WALT DISNEY WORLD Quest - Magical Racing Tour and find all the missing pieces of the Fireworks Machine. Speed around 13 raceways based on popular WALT DISNEY WORLD Theme Parks and Water Parks, including: Space Mountain, Test Track at Epcot andCatch The Magic!\r Experience the thrill of WALT DISNEY WORLD Quest - Magical Racing Tour and find all the missing pieces of the Fireworks Machine. Speed around 13 raceways based on popular WALT DISNEY WORLD Theme Parks and Water Parks, including: Space Mountain, Test Track at Epcot and Rock 'n' Roller Coaster.… Expand"}, {"name": "Valkyrie Elysium", "details_link": "https://www.metacritic.com/game/playstation-5/valkyrie-elysium", "publisher": "Square Enix", "release_date": "Sep 29 2022", "developers": ["Square Enix", "Soleil Ltd."], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/e86033fabd087ad18ba07a0b1f1e1e94-98.jpg", "descriptions": "Long ago, Ragnarok - the End Times - loomed upon the realms. The All-Father, with the last of his strength, created an emissary of redemption; her sole task the salvation of a doomed world. And thence began the tale of a new Valkyrie... This brand-new game brings the VALKYRIE combines anLong ago, Ragnarok - the End Times - loomed upon the realms. The All-Father, with the last of his strength, created an emissary of redemption; her sole task the salvation of a doomed world. And thence began the tale of a new Valkyrie... This brand-new game brings the VALKYRIE combines an evocative world inspired by Norse mythology, thrillingly fast-paced combat and stunning audio-visual presentation to deliver an action-RPG like no other.… Expand"}, {"name": "Afro Samurai", "details_link": "https://www.metacritic.com/game/playstation-3/afro-samurai", "publisher": "Namco Bandai Games America", "release_date": "Jan 27 2009", "developers": ["Namco Bandai Games America", "Namco Bandai Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/ab1868a3d710c37567d792321056a8dd-98.jpg", "descriptions": "Follow Afro Samurai as he fights to become the number one warrior, a title currently held by Justice, the man who killed Afro’s father when he was a child.  The game follows the plot of the original series with added material and background for fans and new comers alike. Blood is beautifulFollow Afro Samurai as he fights to become the number one warrior, a title currently held by Justice, the man who killed Afro’s father when he was a child.  The game follows the plot of the original series with added material and background for fans and new comers alike. Blood is beautiful in this hip hop infused action adventure as Samuel L. Jackson reprises his role as Afro and Ninja Ninja. A striking art style gives Afro Samurai a unique look and feel across animated open environments as he wages war against his adversaries to become number one. Using an innovative gameplay system, enemy AI is affected by the beat of the musical score overseen and inspired by RZA of Wu-Tang Clan fame and composed and produced by Howard Drossin. These dynamic battles ensure stylized encounters throughout the game that affect the overall tone of gameplay.  Slice and dismember opponents as Afro acrobatically leaps from one location to the next, interacting with anything and everything in the environment to help him on his journey. [Namco Bandai Games]… Expand"}, {"name": "Brothers in Arms: D-Day", "details_link": "https://www.metacritic.com/game/psp/brothers-in-arms-d-day", "publisher": "Ubisoft", "release_date": "Dec  5 2006", "developers": ["Ubisoft Shanghai"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 65, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/587393831a1cce2c3bb2a07f0188cb37-98.jpg", "descriptions": "Experience the intensity of WWII through the stories of Sergeants Baker and Hartsock and your squad of paratroopers during the Normandy invasion. Brothers In Arms D-Day brings players the best of the Brothers In Arms franchise in a handheld gaming system. Players experience D-Day as aExperience the intensity of WWII through the stories of Sergeants Baker and Hartsock and your squad of paratroopers during the Normandy invasion. Brothers In Arms D-Day brings players the best of the Brothers In Arms franchise in a handheld gaming system. Players experience D-Day as a Screaming Eagle with more tactics and action exclusive to the PSP system. Now players can surprise the enemy for the ultimate advantage in firefights, leading a fire team throughout the entire Normandy campaign. For the first time, players will also be able to lead a bazooka team, order their squad on an MG42, or fire mortar rounds. An enhanced co-op mode (Skirmish) offers players a 12-mission campaign. Co-op multiplayer (Skirmish mode): Play with a friend over ad hoc (wireless) through 12 different Skirmish missions in four different game modes through the co-op campaign. [Ubisoft]… Expand"}, {"name": "Lovely Planet", "details_link": "https://www.metacritic.com/game/xbox-one/lovely-planet", "publisher": "tiny Build GAMES", "release_date": "Jan  8 2016", "developers": ["QUICKTEQUILA"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/e0afc3af7b970a56678a322924c5a450-98.jpg", "descriptions": "With boots of speed on your feet, an infinite supply of bullets for your semi-automatic and the ability to jump over twice your own height, you're well equipped to go up against any enemy on your quest to reach Lovely Planet! Balance between jumping around dodging bullets and taking aim forWith boots of speed on your feet, an infinite supply of bullets for your semi-automatic and the ability to jump over twice your own height, you're well equipped to go up against any enemy on your quest to reach Lovely Planet! Balance between jumping around dodging bullets and taking aim for a better shot at your enemies, don't waste time camping at cover spots and waiting for enemies to pop out - artfully evade the onslaught of bullets and defeat all baddies that stand in your way.… Expand"}, {"name": "Mini Ninjas Adventures", "details_link": "https://www.metacritic.com/game/xbox-360/mini-ninjas-adventures", "publisher": "Square Enix", "release_date": "Jun 29 2012", "developers": ["Side Kick LTD"], "platforms": "Xbox 360", "genres": ["Action", "General", "General"], "meta_score": 65, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/ca2591f789738cad11c914bc213bdf85-98.jpg", "descriptions": null}, {"name": "Powerstar Golf", "details_link": "https://www.metacritic.com/game/xbox-one/powerstar-golf", "publisher": "Microsoft Game Studios", "release_date": "Nov 22 2013", "developers": ["Zoe Mode"], "platforms": "Xbox One", "genres": ["Arcade", "Sports", "Traditional", "Individual", "Golf", "Arcade"], "meta_score": 65, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/32bf90b3aeb8874aca405556a8890056-98.jpg", "descriptions": "Tee up for fun with Powerstar Golf for Xbox One. Whether you’re playing a round to unwind and admire the amazing vistas or a pro trying to climb the leaderboards for bragging rights, it’s time to load up the cart and aim for the green."}, {"name": "WRC 2: FIA World Rally Championship 2011", "details_link": "https://www.metacritic.com/game/xbox-360/wrc-2-fia-world-rally-championship-2011", "publisher": "Ubisoft", "release_date": "Oct 14 2011", "developers": ["MileStone Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/896e42a82e8901d244aed89a545915d7-98.jpg", "descriptions": "Live the life of a real rally driver through the career mode of WRC 2. Start from scratch by creating your own racing team, win prestigious victories to increase your funds and improve your reputation. Among the brand new features this year, you can create your own team and manage themLive the life of a real rally driver through the career mode of WRC 2. Start from scratch by creating your own racing team, win prestigious victories to increase your funds and improve your reputation. Among the brand new features this year, you can create your own team and manage them during your ascent to the WRC. Find the best mechanics on the market to maximize the performance of your car, hire skilled managers to unlock profitable sponsorships ... and strive to earn a contract with one of the WRC teams. Are you ready to become the new champion of the world?… Expand"}, {"name": "Dead Space 2: Severed", "details_link": "https://www.metacritic.com/game/playstation-3/dead-space-2-severed", "publisher": "Electronic Arts", "release_date": "Mar  1 2011", "developers": ["Visceral Games"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/eb79532a8922d1cf7229cf8a8379f3fb-98.jpg", "descriptions": "Dead Space 2: Severed contains two new single-player chapters and new Trophies."}, {"name": "Eiyuden Chronicle: Rising", "details_link": "https://www.metacritic.com/game/switch/eiyuden-chronicle-rising", "publisher": "505 Games", "release_date": "May 10 2022", "developers": ["NATSUME ATARI Inc.", "Rabbit & Bear Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/9/4e8d711bc1893a666400fad8bcf8c230-98.jpg", "descriptions": "Eiyuden Chronicle: Rising combines a thrilling adventure through ancient ruins with the tale of one town’s rise from the ashes. Drawn by lenses and other treasure in the nearby Runebarrows, our heroes learn that the town is struggling to rebuild after an earthquake and decide to help. AlongEiyuden Chronicle: Rising combines a thrilling adventure through ancient ruins with the tale of one town’s rise from the ashes. Drawn by lenses and other treasure in the nearby Runebarrows, our heroes learn that the town is struggling to rebuild after an earthquake and decide to help. Along the way, they’ll resolve disputes between eager adventurers and wary locals who don’t think the Barrows should be disturbed. And they’ll learn more about each other’s reasons for seeking treasure, deepening their bonds in the process. As you will learn, these Runebarrows hide a great secret that has fateful implications for one of the characters. What begins as a simple treasure hunt turns into a dark conspiracy that will shake the world and plant seeds that carry over into the main story of Eiyuden Chronicle: Hundred Heroes. The game will introduce a portion of Eiyuden Chronicle’s cast of characters in an original story with thrilling action and engaging town-upgrading elements.\r… Expand"}, {"name": "Breakout: Recharged", "details_link": "https://www.metacritic.com/game/switch/breakout-recharged", "publisher": "Atari", "release_date": "Feb 10 2022", "developers": ["SneakyBox", "Adamvision Studios"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "genres": ["Action", "Arcade"], "meta_score": 65, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/3/c0f14a28574726c242ada3ba4a3266c8-98.jpg", "descriptions": "The original brick breaker returns with its toughest challenge yet. Survive as long as you can in arcade or take on one of 50 challenges picking up game-changing power-ups along the way. The grandfather of brick-breaking games is back with some of the toughest challenges yet! Breakout:The original brick breaker returns with its toughest challenge yet. Survive as long as you can in arcade or take on one of 50 challenges picking up game-changing power-ups along the way. The grandfather of brick-breaking games is back with some of the toughest challenges yet! Breakout: Recharged steps up the excitement with a fresh coat of paint, exciting power-ups, and another original soundtrack from award-winning video game composer Megan McDuffee.\r Breakout: Recharged will forever change what you expect from a brick-breaking title. The endless arcade mode and 50 challenge levels will push you to the limit of your skills. Don’t fret, however, as this wouldn’t be a Recharged title without game-changing powerups. Expect the aid of rail guns, homing missiles, and explosives to join the traditional multi-ball. You’ll need every tool in the arsenal and razor-sharp reflexes to climb the global leaderboards.\r Key Features:\r Old Meets New: Classic Breakout gameplay updated with refined control, and modern visual flourishes\r Power Up: Blast special bricks to pick up paddle-transforming power-ups a rail gun, explosive balls, missile launchers, and more\r Challenge: Compete in a series of 50 challenges designed to put even the most seasoned players to the test\r Compete: Reach the top of global leaderboards for arcade and individual challenge modes\r Bring a Friend: Play local co-op in every mode - breaking bricks is better together!\r Get in the Groove: Rock out to an original score by Megan McDuffee\r… Expand"}, {"name": "Ferrari Challenge Trofeo Pirelli", "details_link": "https://www.metacritic.com/game/wii/ferrari-challenge-trofeo-pirelli", "publisher": "Activision", "release_date": "Aug 26 2008", "developers": ["Eutechnyx"], "platforms": ["PlayStation 2", "PlayStation 3", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "Other", "Other", "GT / Street", "Automobile"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/1497f38a2bd294b3f17e42dca355ea02-98.jpg", "descriptions": "Ferrari Challenge Trofeo Pirelli's racing style is fast and accessible, yet the feel is more \"sim\" than arcade. It includes over 15 international racing circuits along with multiple gameplay modes such as Ferrari Challenge Seasons, Time Trial, Quick Race, and Endurance. [Activision]"}, {"name": "Just Cause 4", "details_link": "https://www.metacritic.com/game/playstation-4/just-cause-4", "publisher": "Square Enix", "release_date": "Dec  4 2018", "developers": ["Avalanche Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 65, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/2/7b91b156961f32d2a98de46681b61c8f-98.jpg", "descriptions": "Welcome to Solis, a huge South American world home of conflict, oppression and extreme weather conditions. Just Cause 4 sees rogue hero Rico Rodriguez land in Solis to hunt down the truth about his past, at any costs. Strap into your wingsuit, equip your fully customizable grappling hook,Welcome to Solis, a huge South American world home of conflict, oppression and extreme weather conditions. Just Cause 4 sees rogue hero Rico Rodriguez land in Solis to hunt down the truth about his past, at any costs. Strap into your wingsuit, equip your fully customizable grappling hook, and get ready to bring the thunder. Soar through the skies with your wingsuit - Skydive, Base Jump and Free Dive with no limits. Fight your enemies under extreme weather conditions, including treacherous tornadoes and tropical lightning storms, taking the iconic Just Cause action to insane new heights. Use extreme weather events to your advantage thanks to never seen before in-game physics. Spearhead the rebellion and defeat the Black Hand, a hi-tech private military organisation. Face off against Gabriela Morales – your most fierce, capable, and unpredictable adversary yet. Uncover the truth of Rico’s father’s past life on Solís’ and its extreme weather. Explore the remote South American country of Solís, home of conflict, secrets, and danger. Enjoy 100 square kilometres of exotic playground, from rainforest to desert, via snowy mountain peaks. Discover a plethora of wonders as you explore the world of Solís from bustling cities to rural grasslands. [Square Enix]\r … Expand"}, {"name": "Red Solstice 2: Survivors", "details_link": "https://www.metacritic.com/game/pc/red-solstice-2-survivors", "publisher": "Ironward", "release_date": "Jun 17 2021", "developers": ["Ironward"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 65, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/bc10ff6abd8eb7668b4bab55ac312350-98.jpg", "descriptions": "Sequel to the best-seller ​The Red Solstice​. Plan your strategy and infiltrate a real-time tactical battlefield - alone or with up to 7 squad members. Can you demonstrate the combat prowess to survive and secure a future for humanity?"}, {"name": "Tekken Hybrid", "details_link": "https://www.metacritic.com/game/playstation-3/tekken-hybrid", "publisher": "Namco Bandai Games America", "release_date": "Nov 22 2011", "developers": ["Namco Bandai Games"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/74efd97e2ab56e49df78babaa34e0f2d-98.jpg", "descriptions": "Tekken Hybrid contains the remake of Tekken Tag Tournament joined with the the 3D feature film Tekken Blood Vengeance 3D exclusively on the PlayStation 3."}, {"name": "Disney/Pixar Brave", "details_link": "https://www.metacritic.com/game/xbox-360/disneypixar-brave", "publisher": "Disney Interactive Studios", "release_date": "Jun 19 2012", "developers": ["Disney Interactive Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Linear"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/45376dc89867d60d8f6d30c1b82dbae9-98.jpg", "descriptions": "A third person action-adventure, \"Brave: The Video Game\" expands the tale beyond the movie's storyline. Gamers can play as Merida, an expert archer and heroine, and in the console versions, players can also play as other entertaining characters from the film.  In addition, theyA third person action-adventure, \"Brave: The Video Game\" expands the tale beyond the movie's storyline. Gamers can play as Merida, an expert archer and heroine, and in the console versions, players can also play as other entertaining characters from the film.  In addition, they will be able to go on quests through a magical world and solve puzzles to uncover secrets. … Expand"}, {"name": "Maneater", "details_link": "https://www.metacritic.com/game/switch/maneater", "publisher": "Deep Silver", "release_date": "May 25 2021", "developers": ["Tripwire Interactive", "Blindside Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Open-World"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/383ac08b77958e5d48d95254cee16824-98.jpg", "descriptions": "Maneater is a Single-Player Action RPG, set in the unforgiving waters of the Gulf Coast. Fight to survive in the open ocean, with danger lurking at every depth. Your only tools are your wits, your jaws, and an uncanny ability to evolve as you feed. Anything and everything is on the menu…Maneater is a Single-Player Action RPG, set in the unforgiving waters of the Gulf Coast. Fight to survive in the open ocean, with danger lurking at every depth. Your only tools are your wits, your jaws, and an uncanny ability to evolve as you feed. Anything and everything is on the menu… kill or be killed.… Expand"}, {"name": "Untold Legends: The Warrior's Code", "details_link": "https://www.metacritic.com/game/psp/untold-legends-the-warriors-code", "publisher": "Sony Online Entertainment", "release_date": "Mar 28 2006", "developers": ["Sony Online Entertainment"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 65, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/3248bce129af3e7fddf6bba703aebc6d-98.jpg", "descriptions": "While struggling to evade capture and death in the war-ravaged wilderness, some of these shape-shifter refugees stumble upon a carefully guarded and stunning secret that rekindles hope for freedom and peace to the realm. Can these refugees-turned-heroes bring the last surviving heir of theWhile struggling to evade capture and death in the war-ravaged wilderness, some of these shape-shifter refugees stumble upon a carefully guarded and stunning secret that rekindles hope for freedom and peace to the realm. Can these refugees-turned-heroes bring the last surviving heir of the dynasty to the capital city or will they lead him to the warlord's hand, dooming their race into extinction and their human cousins to endless oppression and strife? Untold Legends The Warrior's Code builds upon the success of the original through an all-new, epic storyline brought to life through dramatic in-game cinematics, a completely new combat experience and enhanced 3D graphics featuring improved graphics, special effects and lighting. Players now experience an evolution in the action-RPG genre through an upgraded combat engine designed for strategic combat, a wider variety of combat moves and special abilities, interactive boss battles with unique AI, and dynamic attacks of opportunity. [SOE]… Expand"}, {"name": "Stranded Deep", "details_link": "https://www.metacritic.com/game/playstation-4/stranded-deep", "publisher": "Telltale Games", "release_date": "Apr 23 2020", "developers": ["Beam Team Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 65, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/6/6f482be99907aa7d204db36d79da9191-98.jpg", "descriptions": "Assume the role of a plane crash survivor stranded somewhere in the Pacific Ocean. Come face-to-face with some of the most life-threatening scenarios that will result in a different experience each time you play as you scavenge for supplies in order to survive on this hostile island."}, {"name": "Resident Evil: Revelations 2", "details_link": "https://www.metacritic.com/game/playstation-vita/resident-evil-revelations-2", "publisher": "SCEA", "release_date": "Aug 18 2015", "developers": ["Frima Studio"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation Vita"], "num_players": "2 ", "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 65, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/ab66d9f7a1963e27c9139fac2dec34d2-98.jpg", "descriptions": "Resident Evil Revelations 2 follows two interwoven stories of terror across 4 episodes of intense survival horror. Episode One: Penal Colony Kidnapped by a unknown group of assailants, Claire and Moira awake to find themselves trapped on an isolated island infested with horrifying creaturesResident Evil Revelations 2 follows two interwoven stories of terror across 4 episodes of intense survival horror. Episode One: Penal Colony Kidnapped by a unknown group of assailants, Claire and Moira awake to find themselves trapped on an isolated island infested with horrifying creatures beyond imagination. Now they must desperately struggle to escape the horror.… Expand"}, {"name": "Farming Simulator 2013", "details_link": "https://www.metacritic.com/game/pc/farming-simulator-2013", "publisher": "Focus Home Interactive", "release_date": "Oct 25 2012", "developers": ["Giants Software"], "platforms": ["PlayStation 3", "PlayStation Vita", "Xbox 360", "PC"], "genres": ["Miscellaneous", "General", "Simulation", "General", "General", "Virtual", "Career"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/755d3b4de68e73c9af697d319c526065-98.jpg", "descriptions": "Farming Simulator 2013 keeps all the ingredients that make the staple of virtual farming, while incorporating many new machines, vehicles, crops, animals, and environments. Farming Simulator 2013 features equipment from the top 20 vehicle manufacturers. Dozens of new machines have foundFarming Simulator 2013 keeps all the ingredients that make the staple of virtual farming, while incorporating many new machines, vehicles, crops, animals, and environments. Farming Simulator 2013 features equipment from the top 20 vehicle manufacturers. Dozens of new machines have found their way into the game, such as the notable brand Case IH, as well as some gigantic farming machines, soon to be unveiled at Gamescom Cologne. … Expand"}, {"name": "Warhammer: Mark of Chaos - Battle March", "details_link": "https://www.metacritic.com/game/pc/warhammer-mark-of-chaos---battle-march", "publisher": "Namco Bandai Games", "release_date": "Sep  2 2008", "developers": ["Black Hole Games"], "platforms": "PC", "num_players": "6  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/8549a33d5d9c6ac079279b5bda2af661-98.jpg", "descriptions": "An expansion to Warhammer: Mark of Chaos for the PC, Warhammer: Mark of Chaos - Battle March builds upon the game's tactical foundation to offer new units for each army as well as an original campaign and new online modes. Players can experience the mysterious sorcery of the Dark Elves andAn expansion to Warhammer: Mark of Chaos for the PC, Warhammer: Mark of Chaos - Battle March builds upon the game's tactical foundation to offer new units for each army as well as an original campaign and new online modes. Players can experience the mysterious sorcery of the Dark Elves and the savage brutality of the Orcs and Goblins in an all-new chapter of the game’s single player campaign as they battle to overcome an invasion by the armies of Chaos. [Namco Bandai Games]… Expand"}, {"name": "Crayola Treasure Adventures", "details_link": "https://www.metacritic.com/game/ds/crayola-treasure-adventures", "publisher": "Crave", "release_date": "Oct  1 2007", "developers": ["Crave"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/9cd88509affa22eccb6b5858b767b2a9-98.jpg", "descriptions": "Crayola Treasure Adventures asks the explorer to color, draw, and think their way through numerous exotic locations, challenging puzzles, and exciting adventures. Crayola Treasure Adventures also offers a digital coloring book that lets the young artist run wild with their imaginationCrayola Treasure Adventures asks the explorer to color, draw, and think their way through numerous exotic locations, challenging puzzles, and exciting adventures. Crayola Treasure Adventures also offers a digital coloring book that lets the young artist run wild with their imagination through more than a hundred different digital crayons and pictures that the young artist may color. Crayola Treasure Adventures truly epitomizes the art of childhood by offering a creative escape for any young explorer or artist on their Nintendo DS! [Crave]… Expand"}, {"name": "Delta Force: Xtreme", "details_link": "https://www.metacritic.com/game/pc/delta-force-xtreme", "publisher": "NovaLogic", "release_date": "Apr 22 2005", "developers": ["NovaLogic"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 65, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/dc80933b2569b87c24720ed7390c1edb-98.jpg", "descriptions": "The game was developed to give gamers of all levels an easy pick-up-and-play FPS experience packed full of action. Delta Force: Xtreme includes a selection of the best single and multiplayer missions from the original PC game Delta Force, as well as new missions and a host of updated gameThe game was developed to give gamers of all levels an easy pick-up-and-play FPS experience packed full of action. Delta Force: Xtreme includes a selection of the best single and multiplayer missions from the original PC game Delta Force, as well as new missions and a host of updated game features. Improvements include a complete graphics overhaul, new renders, particle and weather effects, as well as new content in the form of missions, controllable vehicles and new online features. Delta Force: Xtreme also includes 20 co-op missions, online stat tracking and improved anti-cheat measures.… Expand"}, {"name": "Battleship", "details_link": "https://www.metacritic.com/game/xbox-one/battleship", "publisher": "Ubisoft", "release_date": "Aug  2 2016", "developers": ["Frima Studio"], "platforms": ["PlayStation 4", "Xbox One"], "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 65, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/fb4ee754224ced38de8606c3f9893620-98.jpg", "descriptions": "With a modern, dynamic and interactive 3D board, BATTLESHIP brings the classic franchise to a new level for a memorable experience.\r Deploy your fleet and shoot at your opponents grid to find and destroy enemy ships before yours are sunk. Enjoy the game you know and love with the ClassicWith a modern, dynamic and interactive 3D board, BATTLESHIP brings the classic franchise to a new level for a memorable experience.\r Deploy your fleet and shoot at your opponents grid to find and destroy enemy ships before yours are sunk. Enjoy the game you know and love with the Classic mode or get more tactical in a brand new way to play with the 'Clash at Sea!' mode.\r Play with your friend locally or online, or stand against the Artificial Intelligence of the game.… Expand"}, {"name": "Depth", "details_link": "https://www.metacritic.com/game/pc/depth", "publisher": "Digital Confectioners", "release_date": "Nov  3 2014", "developers": ["Digital Confectioners"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Shooter", "Modern", "Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/1225286f2df76b0a2a57b289c4f98008-98.jpg", "descriptions": "Depth is an indie game being developed with unreal engine 3 by several of the original minds behind 'Killing Floor'. Play as a shark or a diver in a dark aquatic world and overcome your enemies by employing cunning, teamwork, and stealth."}, {"name": "Titan Quest", "details_link": "https://www.metacritic.com/game/switch/titan-quest", "publisher": "THQ Nordic", "release_date": "Jul 31 2018", "developers": ["THQ Nordic"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/30960d39dbee6f76f31840c8940ac4e5-98.jpg", "descriptions": "Discover the Courage that Turns Heroes Into Legends.\rFrom Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative, all-new action role playing game set in ancient Greece, Egypt and Asia.\rThe Titans have escaped their eternal prison, wreaking havocDiscover the Courage that Turns Heroes Into Legends.\rFrom Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative, all-new action role playing game set in ancient Greece, Egypt and Asia.\rThe Titans have escaped their eternal prison, wreaking havoc upon the earth. The gods seek a hero who can turn the tide in an epic struggle that will determine the fate of both men and gods. Are you ready for the quest?\r *    Explore the Ancient World - Unlock arcane mysteries and battle the beasts of mythology as you journey to the Parthenon, Great Pyramids, Hanging Gardens of Babylon, The Great Wall and other legendary locations.\r*    Amazing Graphical Detail - Take a hero's journey through authentic Ancient World settings crafted in stunning, realistic, 3D detail.\r*    Conquer Monsters of Legend - Battle horrific monsters and mythical beasts in a story-driven campaign that will determine the fate of all existence.\r*    Highly Customizable Characters - Build and customize your characters with 28 classes and over 1000 pieces of unique and legendary items to create the ultimate champion.\r*    Create Your Own Worlds - Create your own maps with the easy-to-use World Editor for endless adventuring.\r*    Online Multiplayer Gameplay - Challenge others to experience your map creations in fast-action, 2-6 player online cooperative gameplay.… Expand"}, {"name": "Blood Stone: 007", "details_link": "https://www.metacritic.com/game/playstation-3/blood-stone-007", "publisher": "Activision", "release_date": "Nov  2 2010", "developers": ["Bizarre Creations"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Driving", "Shooter", "Mission-based", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/73f1ee4d279d9eb0d4c11dc02daa4f01-98.jpg", "descriptions": "Bizarre Creations is crafting a James Bond-branded game that will feature racing and vehicular combat elements."}, {"name": "Kapital: Sparks of Revolution", "details_link": "https://www.metacritic.com/game/pc/kapital-sparks-of-revolution", "publisher": "1C Entertainment", "release_date": "Apr 28 2022", "developers": ["Lapovich"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Real-Time", "General", "Strategy", "Management", "Government"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/c14519ad11ad1444f2fa9ba9796b5937-98.jpg", "descriptions": "Sandbox economic simulation game about class struggle. European country is in a deep crisis. You are the mayor of the capital. Social unrest is inevitable. What price will you pay to save your people from anarchy?"}, {"name": "Terminator: Resistance - Annihilation Line", "details_link": "https://www.metacritic.com/game/playstation-5/terminator-resistance---annihilation-line", "publisher": "Reef Entertainment", "release_date": "Dec 10 2021", "developers": ["Teyon"], "platforms": ["PC", "PlayStation 5"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/0f2b41d197d537f278bdac45d52cf5a4-98.jpg", "descriptions": "ANNIHILATION LINE picks up mid-way through the main campaign story. The Resistance has just defeated their first Infiltrator, but for Jacob Rivers, there’s no time to rest up. Orders have come down from John Connor himself that Jacob is to assist in the investigation of Northridge Outpost, aANNIHILATION LINE picks up mid-way through the main campaign story. The Resistance has just defeated their first Infiltrator, but for Jacob Rivers, there’s no time to rest up. Orders have come down from John Connor himself that Jacob is to assist in the investigation of Northridge Outpost, a civilian settlement which has mysteriously gone silent. Why did no-one from Northridge attempt to radio in? Is this the work of Skynet? And are the civilians still alive? To find answers, Rivers and a small team of Resistance soldiers led by Connor’s right-hand man Kyle Reese, must head into the most dangerous territory imaginable...the land beyond the Annihilation Line. … Expand"}, {"name": "Struggling", "details_link": "https://www.metacritic.com/game/pc/struggling", "publisher": "Chasing Rats Games", "release_date": "Aug 27 2020", "developers": ["Chasing Rats Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/0c635981a34af20d84a692ef19b18b78-98.jpg", "descriptions": "Struggling is a physics-based co-op platformer with a twisted spin on teamwork. Control the arms of a squishy abomination and lead it through a deranged world."}, {"name": "ZEN Pinball 2: Marvel's Avengers: Age of Ultron", "details_link": "https://www.metacritic.com/game/playstation-4/zen-pinball-2-marvels-avengers-age-of-ultron", "publisher": "Zen Studios", "release_date": "Apr 22 2015", "developers": ["Zen Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Pinball"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Inspired by Marvel's Avengers: Age of Ultron, the epic follow-up to the biggest Super Hero movie of all time, this table will let you experience when Tony Stark jumpstarts a dormant peacekeeping program and things go awry for Earths Mightiest Heroes, including Iron Man, Captain America,Inspired by Marvel's Avengers: Age of Ultron, the epic follow-up to the biggest Super Hero movie of all time, this table will let you experience when Tony Stark jumpstarts a dormant peacekeeping program and things go awry for Earths Mightiest Heroes, including Iron Man, Captain America, Thor, The Incredible Hulk, Black Widow and Hawkeye, as they are put to the ultimate test as they battle to save the planet from destruction at the hands of the villainous Ultron.\r Table Features:\r - Dedicated game modes for each Avenger, including a first-person minigame to test your sharpshooting skills as Hawkeye.\r- Utilize the power of the Avengers team to overcome the challenges ahead.\r- Spectacular aerial and melee combat sequences between Iron Man and Ultron.\r- Selectable difficulty to cater to your specific skill level.… Expand"}, {"name": "Mystery Case Files: The Malgrave Incident", "details_link": "https://www.metacritic.com/game/wii/mystery-case-files-the-malgrave-incident", "publisher": "Nintendo", "release_date": "Jun 29 2011", "developers": ["Sanzaru Games"], "platforms": "Wii", "genres": ["Miscellaneous", "Puzzle", "Hidden Object", "Puzzle", "General"], "meta_score": 65, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/8bb40ae41fa314cc1260923f8eb9205c-98.jpg", "descriptions": "Mystery Case Files: Dust to Dust brings the intrigue and sleuthing of Big Fish Games’ Mystery Case Files series to the Wii system for the first time. The game transports players to the enigmatic Malgrave Island, where they must hunt for hidden objects and solve puzzles to collect a magicallyMystery Case Files: Dust to Dust brings the intrigue and sleuthing of Big Fish Games’ Mystery Case Files series to the Wii system for the first time. The game transports players to the enigmatic Malgrave Island, where they must hunt for hidden objects and solve puzzles to collect a magically powerful dust scattered across the island. Anyone can delve quickly and easily into the game’s rich seek-and-solve action, using the Wii Remote controller to examine multi-layered hidden-object scenes, locate cleverly concealed items and obtain inventory items that will help to overcome brain-teasing obstacles. Multiplayer features allow players to team up and crack the case together or face off in a competitive hunt for hidden objects. (Additional controllers are required for multiplayer features and are sold separately.) No matter who’s playing, it’ll take sharp eyes and a keen mind to get to the bottom of Mystery Case Files: Dust to Dust.… Expand"}, {"name": "Zombie Panic in Wonderland", "details_link": "https://www.metacritic.com/game/wii/zombie-panic-in-wonderland", "publisher": "Akaoni Studio", "release_date": "May  3 2010", "developers": ["Akaoni Studio"], "platforms": ["3DS", "iPhone/iPad", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/d8b3a99d8487a37b0538f5010cd30028-98.jpg", "descriptions": "[WiiWare]   Momotaro, a young hero, has got involved in the sudden wave of zombies that is hitting Wonderland. To save his friends from the spell of the \"amorous zombies\", machine gun in hand, he will have to solve the mystery of the \"scented dwarves\" in time and put an end to the evil power[WiiWare]   Momotaro, a young hero, has got involved in the sudden wave of zombies that is hitting Wonderland. To save his friends from the spell of the \"amorous zombies\", machine gun in hand, he will have to solve the mystery of the \"scented dwarves\" in time and put an end to the evil power hidden in the castle in the northern city. [Akaoni]… Expand"}, {"name": "Daemonica", "details_link": "https://www.metacritic.com/game/pc/daemonica", "publisher": "Meridian4", "release_date": "Mar 31 2006", "developers": ["Cinemax", "RA Images"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/cafc4801c9c759f67455566050460063-98.jpg", "descriptions": "Daemonica is a 3D interactive mystery set in medieval England. Take on the role of Nicholas Farepoynt, an investigator who can talk to the Dead. You will explore the dark surroundings of the slowly dying city of Cavorn, talk to both the living and dead to gather information, punish theDaemonica is a 3D interactive mystery set in medieval England. Take on the role of Nicholas Farepoynt, an investigator who can talk to the Dead. You will explore the dark surroundings of the slowly dying city of Cavorn, talk to both the living and dead to gather information, punish the deserved, collect herbs to make potions and enhance your senses and slowly discover what role you will play in all of this. As you strive to solve the murder of a young girl, more dead appear and the town starts to slip into insanity. A grim, long-forgotten secret, something that should never see the light of day, again slowly awakes. [Meridian4]… Expand"}, {"name": "Fallout 3: Mothership Zeta", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-3-mothership-zeta", "publisher": "Bethesda Softworks", "release_date": "Aug  3 2009", "developers": ["Bethesda Softworks"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/e9ac5fb0c3d95a0d51c6b236dfafa587-98.jpg", "descriptions": "Defy hostile alien abductors and fight your way off of the massive Mothership Zeta, orbiting Earth miles above the Capital Wasteland. Mothership Zeta takes Fallout 3 in an entirely new direction - outer space. Meet new characters and join with them in a desperate bid to escape the Aliens'Defy hostile alien abductors and fight your way off of the massive Mothership Zeta, orbiting Earth miles above the Capital Wasteland. Mothership Zeta takes Fallout 3 in an entirely new direction - outer space. Meet new characters and join with them in a desperate bid to escape the Aliens' clutches. To do so, you'll wield powerful new weapons, like the Alien Atomizer, Alien Disintegrator, and Drone Cannon, and deck yourself out in brand new outfits, like the Gemini-Era Spacesuit and even Samurai Armor. A strange Alien signal is being broadcast throughout the Capital Wasteland, originating from a crashed UFO. Is it a distress call, or something far more sinister? That question is answered when you find yourself beamed aboard an enormous Alien spacecraft, with only one alternative - to fight your way to the bridge of the ship and secure your escape. [Bethesda Softworks]… Expand"}, {"name": "Dead or School", "details_link": "https://www.metacritic.com/game/switch/dead-or-school", "publisher": "Marvelous AQL", "release_date": "Mar 13 2020", "developers": ["Studio Nanafushi"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Action RPG"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/ced90115a1769fcf9486f8215d49da0f-98.jpg", "descriptions": "Underground dwelling girl Hisako is aiming for the surface in a zombie infested Tokyo. Hack and slash RPG! Obtain weapons and gear from enemies, and customize your skill tree to create your own unique and powerful a character."}, {"name": "Conarium", "details_link": "https://www.metacritic.com/game/playstation-4/conarium", "publisher": "Iceberg Interactive", "release_date": "Feb 12 2019", "developers": ["Zoetrope Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 65, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/c04542bc935b9ef1aea987aff7a6b5c1-98.jpg", "descriptions": "Conarium is a chilling Lovecraftian game, which follows a gripping story involving four scientists and their endeavor to challenge what we normally consider to be the 'absolute' limits of nature. Inspired by H.P. Lovecraft's novella \"At the Mountains of Madness\", but largely set after theConarium is a chilling Lovecraftian game, which follows a gripping story involving four scientists and their endeavor to challenge what we normally consider to be the 'absolute' limits of nature. Inspired by H.P. Lovecraft's novella \"At the Mountains of Madness\", but largely set after the original story.\r You, as Frank Gilman, open your eyes inside a room filled with strange, pulsating noises. Patterns of lights executing a Danse Macabre on the walls is presented by a queer device on the table. Having recalled nothing other than that you're in Upuaut, an Antarctic base located near south pole, you find the place deserted and have a distinct feeling of something being terribly wrong. Somehow knowing that your memories cannot guide you enforces a strange feeling of vulnerability, a familiar yet alien sensation of being a part of a peculiar whole... Soon you will discover that having used the device during the expedition, you have died but then returned subtly changed, speaking of strange memories and of strange places. You have lost something important or gained something sinister...\r Explore the antarctic base, as well as dreams and visions. Study clues, unlock secrets but avoid macabre beings at all cost.… Expand"}, {"name": "Blazing Angels: Squadrons of WWII", "details_link": "https://www.metacritic.com/game/pc/blazing-angels-squadrons-of-wwii", "publisher": "Ubisoft", "release_date": "Mar 28 2006", "developers": ["Ubisoft Romania"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "16  Online", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 65, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/9/d4ce3feebbf68b5b1b35cf37fbb9300b-98.jpg", "descriptions": "Experience the greatest air battles of World War II in famous locations from across the globe. Whether it's the Battle of Britain, the attack of Pearl Harbor or the fierce fighting for the desserts of North Africa, the player and his squadron of Blazing Angels will be tasked with turning theExperience the greatest air battles of World War II in famous locations from across the globe. Whether it's the Battle of Britain, the attack of Pearl Harbor or the fierce fighting for the desserts of North Africa, the player and his squadron of Blazing Angels will be tasked with turning the tide of war. Command three separate AI-wingmen and make use of each ones special abilities to both attack and defend their squadron leader. During the course of the twenty mission campaign, the pilot will be accompanied by his squadron and they will grow together as an ace fighting force through the entire length of WWII. Fly in close to Germany's industrial terrain for a bombing raid, strafe the islands of the pacific, or emerge from the cloud cover over London and engage the enemy. The environment is so real you'll feel like you're the pilot in a famous WWII movie. [Ubisoft]… Expand"}, {"name": "Serious Sam: Next Encounter", "details_link": "https://www.metacritic.com/game/playstation-2/serious-sam-next-encounter", "publisher": "Global Star Software", "release_date": "Apr 22 2004", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/32fe4c5df76d8ba137b19e66427f4866-98.jpg", "descriptions": "Serious Sam: Next Encounter finds Sam gearing up once again to defend the Earth from Mental and his limitless extra-terrestrial hordes. Sam is launched back in time to rid the alien scum from more than 40 levels spread throughout three beautifully rendered, massive new time periods AncientSerious Sam: Next Encounter finds Sam gearing up once again to defend the Earth from Mental and his limitless extra-terrestrial hordes. Sam is launched back in time to rid the alien scum from more than 40 levels spread throughout three beautifully rendered, massive new time periods Ancient Rome, Feudal China and legendary Atlantis. For the first time ever, Sam will have access to vehicles to help him mow down the enemies, and of course heÂ¹ll be armed to the teeth with an arsenal that contains old favorites and some high-powered new additions. Throughout it all, Serious Sam: Next Encounter maintains the same hilarious and high speed shoot-em-up action that fans have come to love, while introducing loads of new gameplay to keep old hands and newcomers alike coming back for more. [Take 2 Interactive]… Expand"}, {"name": "Naval Ops: Commander", "details_link": "https://www.metacritic.com/game/playstation-2/naval-ops-commander", "publisher": "Koei", "release_date": "Mar  9 2004", "developers": ["Micro Cabin"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Ship"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/f176a54e55a6fbc65ae3f3cc14b93ea5-98.jpg", "descriptions": "NAVAL OPS: COMMANDER is set in an alternate reality where the powerful nation of Virshia has deployed an armada of  \"Superships\" around the globe. Through Virshia's aggressive assault on the world?s oceans, nations quickly fell while others still hang in the balance. In the game, playersNAVAL OPS: COMMANDER is set in an alternate reality where the powerful nation of Virshia has deployed an armada of  \"Superships\" around the globe. Through Virshia's aggressive assault on the world?s oceans, nations quickly fell while others still hang in the balance. In the game, players command a lone Tactical Battle Group committed to fighting the Virshian fleet. The action takes place in two phases: Strategy and Battle. During the Strategy phase, players are briefed on the impending battle. Based on mission objectives and known threats, players can upgrade and adapt their ship using a full spectrum of integrated weapon and defense systems, propulsion hardware and aircraft. At this stage, players can also invest in new technology, develop new weapons, purchase parts, or choose from over 100 combat-ready vessels based on actual ships from the United States, Japan, Great Britain, and Germany. NAVAL OPS: COMMANDER introduces several new developments to the series. With the new TBG (Tactical Battle Group) system, players have real-time control of a primary warship and gain the option of changing the attack formation of escort ships that provide anti-aircraft, anti-ship, and assault support. [KOEI]… Expand"}, {"name": "Conflict: Desert Storm II - Back to Baghdad", "details_link": "https://www.metacritic.com/game/pc/conflict-desert-storm-ii---back-to-baghdad", "publisher": "Gotham Games", "release_date": "Oct  7 2003", "developers": ["Pivotal Games"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/4aafb47e90c89ce372fee9e1dd3d120f-98.jpg", "descriptions": "At the height of the 1991 Gulf War, 300 clicks into the heart of Iraq, you must command your squad of Special Forces operatives to strike at Iraq's evil dictator, and his fascist regime. Armed with an authentic arsenal of high-tech weapons and vehicles, your squad will face impossible oddsAt the height of the 1991 Gulf War, 300 clicks into the heart of Iraq, you must command your squad of Special Forces operatives to strike at Iraq's evil dictator, and his fascist regime. Armed with an authentic arsenal of high-tech weapons and vehicles, your squad will face impossible odds in this battle against tyranny. Only strategy and skill will ensure your survival through frantic firefights, gut-wrenching vehicular combat, and gripping stealth operations. \"The Mother of All Battles\" is coming to your console in Gotham Games' Conflict: Desert Storm II ? Back to Baghdad. The troops are in position, so lock and load, and get ready to GO LOUD! [Gotham Games]… Expand"}, {"name": "Disciples II: Servants of the Dark", "details_link": "https://www.metacritic.com/game/pc/disciples-ii-servants-of-the-dark", "publisher": "Strategy First", "release_date": "Jun 30 2003", "developers": ["Strategy First"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/d178fbe496ceda3787c1e65b42794285-98.jpg", "descriptions": "A stand-alone expansion that brings you into the never-ending quest for supremacy as either the Undead Hordes or the Legions of the Damned. On the dark side, the Legions of the Damned enact a plan to spread Bethrezen?s plague across Nevendaar. They sense the threat brought about by theA stand-alone expansion that brings you into the never-ending quest for supremacy as either the Undead Hordes or the Legions of the Damned. On the dark side, the Legions of the Damned enact a plan to spread Bethrezen?s plague across Nevendaar. They sense the threat brought about by the rebirth of the Elven god and will stop at nothing to steal this power for their own purposes. Perhaps most pivotal to the conflict, however, is Mortis and her army of Undead Hordes. After all, the rebirth of her husband Gallean was her doing. He had rejected her for what she had become, a twisted, heartless beast. Now she would teach her mate a lesson... one that would scar his people for eternity... [Strategy First]… Expand"}, {"name": "Worms Blast", "details_link": "https://www.metacritic.com/game/gamecube/worms-blast", "publisher": "Ubisoft", "release_date": "Oct 24 2002", "developers": ["Team17"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/bcbc37c59a05aac80dad1731653523f6-98.jpg", "descriptions": "Get ready for intense firefights in Worms Blast, a new puzzle game featuring wacky weaponry and power-ups. Your mission is to launch your worm into hostile waters and then attack your opponent with shotguns, bazookas, mines, laser beams, and sea monsters, while collecting various power-ups.Get ready for intense firefights in Worms Blast, a new puzzle game featuring wacky weaponry and power-ups. Your mission is to launch your worm into hostile waters and then attack your opponent with shotguns, bazookas, mines, laser beams, and sea monsters, while collecting various power-ups. Brave the high seas by facing rain, wind, solar eclipses, and even cosmic showers. Worms Blast includes eight head-to-head modes that challenge you to crush your opponents before they crush you.… Expand"}, {"name": "Mega Man X6", "details_link": "https://www.metacritic.com/game/playstation/mega-man-x6", "publisher": "Capcom", "release_date": "Dec  4 2001", "developers": ["Capcom"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/4e8c938a1c8a3632db55cde8e66fdefc-98.jpg", "descriptions": "It's been three weeks since Earth's near collision with the space colony Eurasia. The disaster was averted by Zero's heroics. Now, on a bruised and battered planet, tales of rampagning reploids are surfacing. It's up to Mega Man X to investigate these mysteries but it's not going to be easy.It's been three weeks since Earth's near collision with the space colony Eurasia. The disaster was averted by Zero's heroics. Now, on a bruised and battered planet, tales of rampagning reploids are surfacing. It's up to Mega Man X to investigate these mysteries but it's not going to be easy. Mega Man X must battle through a maze of levels and rescure reploids along the way. Return to battle agagin and again with the new Nightmare System, which randomizes level maps, enemies and endings based on how you play the game. Mega man X is back and now it's personal!… Expand"}, {"name": "ESPN NFL PrimeTime 2002", "details_link": "https://www.metacritic.com/game/playstation-2/espn-nfl-primetime-2002", "publisher": "Konami", "release_date": "Dec  2 2001", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/1d025cd09b8320ace2cffac61df780a7-98.jpg", "descriptions": "Manage your team for up to 15 seasons as Chris Berman and Tom Jackson go \"Inside the Numbers\" to breakdown your games. Create free agents or edit existing players with an in-depth Player Editor.  The game includes updated 2001 season rosters for all 31 NFL teams."}, {"name": "Tetris Worlds", "details_link": "https://www.metacritic.com/game/game-boy-advance/tetris-worlds", "publisher": "THQ", "release_date": "Sep  5 2001", "developers": ["3d6 Games"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "genres": ["Miscellaneous", "Puzzle", "Stacking"], "meta_score": 65, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/6ba1f5ef374f7980624c394987c980b9-98.jpg", "descriptions": "For over a decade, the Tetris series has made an appearance on every game system.  Tetris Worlds continues that streak, bringing their distinct brand of simple, yet addictive gameplay to the current generation of systems.  Small shapes called Tetraminoes fall from the top of the screen toFor over a decade, the Tetris series has made an appearance on every game system.  Tetris Worlds continues that streak, bringing their distinct brand of simple, yet addictive gameplay to the current generation of systems.  Small shapes called Tetraminoes fall from the top of the screen to the bottom and you must rotate them and fit them together to complete lines.  The game features six different variations of the classic Tetris, multiplayer mode for up to four players, and six different worlds.  Sound easy? Once you start, you can't stop.… Expand"}, {"name": "Razor Freestyle Scooter", "details_link": "https://www.metacritic.com/game/playstation/razor-freestyle-scooter", "publisher": "Crave", "release_date": "Dec 11 2000", "developers": ["Shaba Games"], "platforms": "PlayStation", "genres": ["Action", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/6668f42e79b2610495c428e92d362581-98.jpg", "descriptions": "While the game is aimed at a younger crowd, it still manages to be good, albeit short-term, fun."}, {"name": "Gunman Chronicles", "details_link": "https://www.metacritic.com/game/pc/gunman-chronicles", "publisher": "Sierra Entertainment", "release_date": "Nov 19 2000", "developers": ["Rewolf Software"], "platforms": "PC", "num_players": "1-12 ", "genres": ["Action", "General", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/9ee014e4ae3ba9d883d10eb62e82a953-98.jpg", "descriptions": "Though it's worth considering that this game was essentially developed by a group of amateur designers, there are many first-person shooters available that are much more worthwhile."}, {"name": "Eat Them!", "details_link": "https://www.metacritic.com/game/playstation-3/eat-them!", "publisher": "SCEA", "release_date": "Dec 21 2010", "developers": ["FluffyLogic"], "platforms": "PlayStation 3", "genres": ["Action", "General", "General"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/fc6f3efc95cb418dd41c43c5964f6186-98.jpg", "descriptions": "In Eat Them! the player gets to create their own giant monster which they then use to smash, crash and munch their way though the city.  The monster is people-powered  so eating folk is a prerequisite of keeping your monster in full-on destruction mode. The 3D game features eye-catchingIn Eat Them! the player gets to create their own giant monster which they then use to smash, crash and munch their way though the city.  The monster is people-powered  so eating folk is a prerequisite of keeping your monster in full-on destruction mode. The 3D game features eye-catching comic-render style graphics, fully customisable monster creation and lots and lots of missions from Maximum Destruction to Hunt.  The player has the option of single-player and split-screen multiplayer, head-to-head and co-operative missions.  Eat Them! promises  action, mayhem, destruction, humour and lots and lots of eating people!… Expand"}, {"name": "Trillion: God of Destruction", "details_link": "https://www.metacritic.com/game/playstation-vita/trillion-god-of-destruction", "publisher": "Idea Factory", "release_date": "Mar 29 2016", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/8b376f03fa461205c3fd2229c045023b-98.jpg", "descriptions": "The Underworld - The denizens of the Underworld lived a free life amid conflict against the Heavens. There arrived a mysterious threat, a giant evil creature. This is the \"God of Destruction.\" The eater of worlds...\r The Underworld is at a loss against its tremendous power. EvenThe Underworld - The denizens of the Underworld lived a free life amid conflict against the Heavens. There arrived a mysterious threat, a giant evil creature. This is the \"God of Destruction.\" The eater of worlds...\r The Underworld is at a loss against its tremendous power. Even the mighty Great Overlord Zeabolos falls against its greatness. Near the brink of death, Zeabolos hears a mysterious voice...\r \"Are you willing to offer your very soul to defeat it?\"\r The moment Zeabolos agreed, he revived into a patch worked body. And thus, Zeabolos rises once again with the mysterious girl, Faust, at his side, to face Trillion.\r Train the Overlords as candidates to be the next Great Overlord, and to defeat the God of Destruction!… Expand"}, {"name": "Izuna 2: The Unemployed Ninja Returns", "details_link": "https://www.metacritic.com/game/ds/izuna-2-the-unemployed-ninja-returns", "publisher": "Atlus", "release_date": "Jul 22 2008", "developers": ["Ninja Studio"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Roguelike"], "meta_score": 65, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/6be414021325978066ba9dc9f48674c2-98.jpg", "descriptions": "Izuna and her gang are back - and just in time for a wedding! Lured by the promise of free food (Why else would Izuna attend?), the festive event becomes a puzzling mystery when Izuna's sidekick Shino suddenly disappears, off in search of her long-lost sister. And making matters worse, theIzuna and her gang are back - and just in time for a wedding! Lured by the promise of free food (Why else would Izuna attend?), the festive event becomes a puzzling mystery when Izuna's sidekick Shino suddenly disappears, off in search of her long-lost sister. And making matters worse, the foreign gods have also arrived on Japanese soil, and they aren't very happy with the meddlesome, unemployed ninja. With disgruntled deities on the warpath, a sidekick to track down, and a missing sister out in the wild, it could all shape up to be one of Izuna's more exciting adventures. Sounds like a lot of work for a girl out of a job! [Atlus USA]… Expand"}, {"name": "007: Quantum of Solace", "details_link": "https://www.metacritic.com/game/ds/007-quantum-of-solace", "publisher": "Activision", "release_date": "Nov  4 2008", "developers": ["Vicarious Visions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Action", "Action Adventure", "General", "Modern", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/3cf255ea6835b904ea642423ed0c744c-98.jpg", "descriptions": "Introducing a more lethal and cunningly efficient Bond, the game blends intense first-person action with a unique third-person cover combat system that allows players to truly feel what it is like to be the ultimate secret agent as they use their stealth, precision shooting and lethal combatIntroducing a more lethal and cunningly efficient Bond, the game blends intense first-person action with a unique third-person cover combat system that allows players to truly feel what it is like to be the ultimate secret agent as they use their stealth, precision shooting and lethal combat skills to progress through missions. Blending the action of the \"Quantum of Solace\" feature film with the \"Casino Royale\" movie, the title propels players into the cinematic experience of international espionage.  Based on the Call of Duty 4: Modern Warfare game engine that has been specifically engineered to immerse players in the Bond universe, the Quantum of Solace game delivers high-definition graphics, reactive AI and visually stunning locations inspired by locales portrayed in the films. Quantum of Solace marks the first time players can become the dangerous and cunning Bond as portrayed by Daniel Craig. From silent take downs and sneaking through confined spaces, to one-on-one shoot outs and large scale battles, players experience a variety of gameplay that challenges them to think through situations and choose how they progress, whether it's through covert means or confronting enemies in full force. Advanced combat and Realistic AI: Players engage in both first-person and third-person gameplay that allows gamers to be Bond in unscripted battles against the world's most evil villains and mercenaries. Filled with armed combat, massive explosions and vertigo-inducing chases, gamers are immersed in an authentic Bond universe and drawn into epic movie moments with theatrical camera angles, split screen effects, picture-in-picture sequences, and amazing environments inspired by real world locations such as Montenegro, Venice, Bolivia and Austria. Bringing James Bond to next-gen consoles for the first time, gamers now have the ability to battle online in a variety of modes. [Activision]… Expand"}, {"name": "Fossil League: Dino Tournament Championship", "details_link": "https://www.metacritic.com/game/ds/fossil-league-dino-tournament-championship", "publisher": "D3Publisher", "release_date": "Jan 22 2007", "developers": ["MTO"], "platforms": "DS", "num_players": "2  Online", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/d2e3d7f75c173a48aa474052acc6e10f-98.jpg", "descriptions": "Fossil League follows the epic journey of boy action-star Taiga as he travels back in time to historic Jurassic eras to recover his stolen and most personal treasure, the \"Big Mother\" fossil. Fossil League (DTC) offers classic turn-based RPG play with players adventuring as Taiga to battle,Fossil League follows the epic journey of boy action-star Taiga as he travels back in time to historic Jurassic eras to recover his stolen and most personal treasure, the \"Big Mother\" fossil. Fossil League (DTC) offers classic turn-based RPG play with players adventuring as Taiga to battle, tame and collect realistic 3D dinosaur models, each with their own special powers. A \"dinopedia\" gives players true dinosaur facts as they engage in fun mini-games, utilize special attacks and experience cool archeological digs. Fossil League (DTC) allows players to adventure across 6 historic dinosaur eras to collect and battle more than 100 different 3D dinosaurs, each with their own effects. Players utilize the dual screen capabilities of the Nintendo DS to experience archeological digs and collect as many dinosaurs as possible to utilize wireless multiplayer mode for up to two players to compete in the Dinosaur Grand Prix at the end of the adventure. [D3 Publisher of America]… Expand"}, {"name": "Eternal Poison", "details_link": "https://www.metacritic.com/game/playstation-2/eternal-poison", "publisher": "Atlus Co.", "release_date": "Nov 11 2008", "developers": ["Flight-Plan"], "platforms": "PlayStation 2", "genres": ["Strategy", "General"], "meta_score": 65, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/86889ee25d0cc9ab70a5346f4b0278f3-98.jpg", "descriptions": "Our world descended into chaos the day the demonic realm of Besek appeared. Creatures known as the Majin emerged, wreaking havoc and destroying our way of life. They captured the Princess of Valdia and imprisoned her in their lair. Now, brave adventurers throughout the land have set out toOur world descended into chaos the day the demonic realm of Besek appeared. Creatures known as the Majin emerged, wreaking havoc and destroying our way of life. They captured the Princess of Valdia and imprisoned her in their lair. Now, brave adventurers throughout the land have set out to explore the Majin homeland. Some wish to rescue the princess; some seek fame and glory; some merely want revenge. However, there are those who look to harness the Majin's dark powers, for it is rumored that deep within Besek lies the Eternal Poison, a legendary treasure able to make your deepest desires come true. Travel the paths of some of these adventurers, and as their tales unfold, you will discover the true meanings of romance, heroism, madness, despair, and betrayal. Five stories in one—Walk the winding paths of five different parties as they journey deeper into hostile lands. With branching paths and optional encounters, you must chart each course carefully, for your choices have a direct impact on the outcome of each tale. All demons can be exploited - even bosses - so every battle offers the intriguing choice of binding or killing your foes. Bound demons can be summoned to fight at your side or be sacrificed for money or new spells. Step into a twisted fairytale world of demons, black magic, and a quest for the ultimate treasure. The kidnapping of the Princess and the temptation of finding the Eternal Poison have drawn your heroes into a world full of dangerous traps, fiendish monsters, and unexpected villains. Discover a world that is as rich in beauty as it is in corruption. [Atlus USA]… Expand"}, {"name": "Axis & Allies", "details_link": "https://www.metacritic.com/game/pc/axis-allies", "publisher": "Atari", "release_date": "Nov  2 2004", "developers": ["TimeGate Studios"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 65, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/b334af69566cc1898ddf0512e53b50ca-98.jpg", "descriptions": "In Axis & Allies: RTS, players relive and experience the most epic struggle in the history of mankind, World War II. Players direct the military and economic destiny of any one of the world's most powerful countries - United States, England, Germany, The Soviet Union or Japan. Axis & Allies:In Axis & Allies: RTS, players relive and experience the most epic struggle in the history of mankind, World War II. Players direct the military and economic destiny of any one of the world's most powerful countries - United States, England, Germany, The Soviet Union or Japan. Axis & Allies: RTS not only captures the intensity of war but also allows players to change the outcome of the major battles and campaigns of World War II. Confronted with the strategic and tactical situations experienced by the top generals and national leaders of the period, players have to make critical decisions that determine the fate and the destiny of the world. Axis & Allies: RTS features gameplay elements such as unique organization of units; command of land, sea, and air units in real-time; dynamic fronts and supply lines; interaction with Generals and Leaders of the era; and intense online play with a powerful random scenario generator. [Atari]… Expand"}, {"name": "Journey of a Roach", "details_link": "https://www.metacritic.com/game/pc/journey-of-a-roach", "publisher": "Daedalic Entertainment", "release_date": "Nov  4 2013", "developers": ["Koboldgames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "Puzzle", "General", "Puzzle", "Point-and-Click", "General"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/81470bc45463b613eb3e0878a65dfd56-98.jpg", "descriptions": "Journey of a Roach is developed by the Swiss team of Koboldgames in co-operation with Daedalic Entertainment. Players will visit a sarcastic, post-apocalyptic world where Roach Jim and his sidekick Bud are out and about to find their way from a deserted vault to the Earth's surface. PlayersJourney of a Roach is developed by the Swiss team of Koboldgames in co-operation with Daedalic Entertainment. Players will visit a sarcastic, post-apocalyptic world where Roach Jim and his sidekick Bud are out and about to find their way from a deserted vault to the Earth's surface. Players must steer them through classic point & click adventure game puzzles. Certain challenges can be overcome by using the roach's natural abilities. Being roaches, Jim and Bud have the ability to crawl up walls and on ceilings, as well as on items.… Expand"}, {"name": "Blanc", "details_link": "https://www.metacritic.com/game/switch/blanc", "publisher": "Gearbox Publishing", "release_date": "Feb 14 2023", "developers": ["Casus Ludi"], "platforms": ["PC", "Switch"], "num_players": "2 ", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 65, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/1/b76ad01b41e07711832df119704048cf-98.jpg", "descriptions": "Blanc is an artistic cooperative adventure that follows the journey of a wolf cub and a fawn stranded in a vast, snowy wilderness. They must come together in an unlikely partnership to find their families. Two players take control of either the wolf cub or the fawn. Guide them through theBlanc is an artistic cooperative adventure that follows the journey of a wolf cub and a fawn stranded in a vast, snowy wilderness. They must come together in an unlikely partnership to find their families. Two players take control of either the wolf cub or the fawn. Guide them through the environment, unforgiving weather, and obstacles that you must face together. Build a relationship together locally on the same screen or from far away with online play.… Expand"}, {"name": "MotoGP 08", "details_link": "https://www.metacritic.com/game/playstation-3/motogp-08", "publisher": "Capcom", "release_date": "Oct 28 2008", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/b72567457e3633a04f83557309457baf-98.jpg", "descriptions": "The official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GPThe official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GP class bikes. You'll also get an opportunity to race in teh new circuits of Indianapolis in the US an drace at night in Qatar. Be successful and you'll earn rider points that you can then use to upgrade your bike. [Capcom]… Expand"}, {"name": "Alex Kidd in Miracle World DX", "details_link": "https://www.metacritic.com/game/switch/alex-kidd-in-miracle-world-dx", "publisher": "Merge Games", "release_date": "Jun 22 2021", "developers": ["Jankenteam"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/4256e2817afa59a0efbff94affa32161-98.jpg", "descriptions": "Since his first appearance in 1986 with Alex Kidd in Miracle World, the iconic Alex Kidd makes his return to smash rocks, collect coins and tackle bosses once again in Alex Kidd in Miracle World DX!Return The Kingdom of Radaxian to its former glory and destroy the evil Janken the Great!Since his first appearance in 1986 with Alex Kidd in Miracle World, the iconic Alex Kidd makes his return to smash rocks, collect coins and tackle bosses once again in Alex Kidd in Miracle World DX!Return The Kingdom of Radaxian to its former glory and destroy the evil Janken the Great!Comprising of all levels from the original title as well as brand new levels which expand the lore of Alex Kidd, experience Miracle World like you've never seen it before with new animations, graphical detail and gameplay improvements.… Expand"}, {"name": "Dig Dug: Digging Strike", "details_link": "https://www.metacritic.com/game/ds/dig-dug-digging-strike", "publisher": "Namco", "release_date": "Oct 18 2005", "developers": ["Bullets"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "General", "Platformer", "2D", "2D"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/36cef8aecdbf676e02931896f7f261cc-98.jpg", "descriptions": "This 3D adventure combines the classic arcade digging action with new baddies, environments, weapons, mini-games and strategies to deliver the most action-packed Dig Dug game to date. Whether tackling the underground alone or wirelessly with a friend, gamers discover 15 stages with more thanThis 3D adventure combines the classic arcade digging action with new baddies, environments, weapons, mini-games and strategies to deliver the most action-packed Dig Dug game to date. Whether tackling the underground alone or wirelessly with a friend, gamers discover 15 stages with more than 80 areas in Dig Dug Digging Strike. Players explore 3D environments on the top screen of the DS, then plunge underground on the bottom screen to dig and connect fault lines that will trap monsters. Only by sinking enemy bosses do players move to the next level – and they encounter some familiar faces along the way. The dreaded Pooka and Fygar are back to threaten Dig Dug, along with a host of never-before-seen bosses. Dig Dug is armed with a series of thrilling weapons to combat monsters as well as elements from the environment including rolling rocks, quicksand and flowing lava. [Namco]… Expand"}, {"name": "Sniper Ghost Warrior Contracts", "details_link": "https://www.metacritic.com/game/playstation-4/sniper-ghost-warrior-contracts", "publisher": "CI Games", "release_date": "Nov 22 2019", "developers": ["CI Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/3945ca1c9917b610ca0e1121229f8806-98.jpg", "descriptions": "Fulfill contracts that offer clear objectives with a fixed monetary reward and options to complete bonus challenges for payouts. With hundreds of ways to take down a wide range of targets, Contracts offers precise, strategic sniping gameplay at its absolute best. Play as a paid assassin; aFulfill contracts that offer clear objectives with a fixed monetary reward and options to complete bonus challenges for payouts. With hundreds of ways to take down a wide range of targets, Contracts offers precise, strategic sniping gameplay at its absolute best. Play as a paid assassin; a hit man for hire, and beware of rival snipers who won’t hesitate to disrupt your best-laid plans. Open-ended contracts, bounties and challenges deliver strong replayability options to eliminate targets and collect cash to redeem for upgrades. An all-new Dynamic Reticle System offers the most realistic and intense sniping experience. Upgradeable AR Mask with the ability to scan the environment and highlight weakness or objects of interest. An arsenal of new gadgets to play with including drones, remote sniper turrets and gas grenades. Show off your stealth skills, execute silent takedowns and be rewarded for a strategic play style. Battle the brutal wilderness of Siberia and fight to survive the intensity of snow-covered mountains, lush forests and secret bases hidden deep in the mountainside.… Expand"}, {"name": "Battle Princess Madelyn", "details_link": "https://www.metacritic.com/game/switch/battle-princess-madelyn", "publisher": "Causal Bit Games", "release_date": "Dec 20 2018", "developers": ["Causal Bit Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/b2803c8a2a41b2f1df8bb88fe343dfe2-98.jpg", "descriptions": "Battle Princess Madelyn is a game that follows the journey of a young knight in training, Madelyn, and her ghostly pet dog, Fritzy. They set out on a journey to save her kingdom and her family from the clutches of an evil wizard."}, {"name": "Poi: Explorer Edition", "details_link": "https://www.metacritic.com/game/switch/poi-explorer-edition", "publisher": "PolyKid", "release_date": "Oct 23 2017", "developers": ["PolyKid"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/5ce4f0610e38aea8d091439ca0843839-98.jpg", "descriptions": "Embark on a classic 3D platforming adventure as you set sail on an airship to collect Explorer Medallions and unravel the mysteries of the Milky Way Globe. Explore uncharted lands, and meet wild new characters, while on a journey to collect all the medallions and become a true Master Explorer!"}, {"name": "Sword Art Online Re: Hollow Fragment", "details_link": "https://www.metacritic.com/game/playstation-4/sword-art-online-re-hollow-fragment", "publisher": "Namco Bandai Games", "release_date": "Jul 28 2015", "developers": ["Namco Bandai Games", "Bandai Namco Games", "Aquria"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/a1699774eec98dbcc82572d171f293ed-98.jpg", "descriptions": "Based on the light novel, manga and anime, Sword Art Online: Hollow Fragment captures the characters and storyline of the SAO universe – a series of virtual-reality worlds set in the near future. Players enter the VR worlds of SAO and discover that the creator of the game has locked theBased on the light novel, manga and anime, Sword Art Online: Hollow Fragment captures the characters and storyline of the SAO universe – a series of virtual-reality worlds set in the near future. Players enter the VR worlds of SAO and discover that the creator of the game has locked the players inside these worlds. To escape these worlds, players must explore and defeat the enemies contained within. Continuing to fight is key inside the VR world – if you die in the fantasy world, your character will die in real life. [Namco Bandai]… Expand"}, {"name": "Fairy Fencer F", "details_link": "https://www.metacritic.com/game/playstation-3/fairy-fencer-f", "publisher": "NIS America", "release_date": "Sep 16 2014", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/dcd3bf8a9bb6a3b4311765099eaa50c8-98.jpg", "descriptions": "Because they were equally matched, they both created a vast number of special weapons imbued with their godly energy, each containing the life force of a fairy. Armed with these weapons, the deities continued their conflict until they finally sealed each other away into the great unknown.Because they were equally matched, they both created a vast number of special weapons imbued with their godly energy, each containing the life force of a fairy. Armed with these weapons, the deities continued their conflict until they finally sealed each other away into the great unknown. Since then much time has passed. The weapons left behind by the Goddess and the Vile God are now known as \"Furies\". The warriors who wield those weapons are known as \"Fencers\". Due to their immense power, rumor has it that anyone who collects the Furies will have their wish granted. For this reason, Fencers have fought among themselves over possession of the Furies for countless years. As luck would have it, a young man named Fang has acquired one of the Furies. Shortly after becoming a new Fencer, he finds himself rescuing a young woman named Tiara, who is also a Fencer as well. This fateful encounter between two Fencers has dire consequences, and Fang soon finds himself involved in the ongoing conflict between the Goddess and Vile God... [NIS America]… Expand"}]