[{"name": "Super Street Fighter IV: Arcade Edition", "details_link": "https://www.metacritic.com/game/playstation-3/super-street-fighter-iv-arcade-edition", "publisher": "Capcom", "release_date": "Jun  7 2011", "developers": ["Capcom"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "2D", "2D", "3D"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/dcf171f1d0a5fe0492c4c3dd5eebd257-98.jpg", "descriptions": "Super Street Fighter IV Arcade Edition features a roster of 39 characters, with 4 new characters added."}, {"name": "SWAT 4: The Stetchkov Syndicate", "details_link": "https://www.metacritic.com/game/pc/swat-4-the-stetchkov-syndicate", "publisher": "Sierra Entertainment", "release_date": "Feb 28 2006", "developers": ["Irrational Games"], "platforms": "PC", "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Arcade"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/104635251572f86d1a949312f34f5f2b-98.jpg", "descriptions": "Crime is on the rise. More guns and drugs are appearing on the streets and the city is in crisis. SWAT is called in to take on a series of disturbances that eventually lead them to the root of the problem, an eastern European crime family that has taken up residence in the city. A finalCrime is on the rise. More guns and drugs are appearing on the streets and the city is in crisis. SWAT is called in to take on a series of disturbances that eventually lead them to the root of the problem, an eastern European crime family that has taken up residence in the city. A final showdown will place legendary SWAT tactics against the most dangerous and ruthless criminals yet, the Stetchkov Syndicate. New features for SWAT 4: The Stetchkov Syndicate include: 7 new single and multiplayer player levels; Voice over IP - Built in voice communication between teammates; 10 Player Coop - Up to 2 teams of 5; New multiplayer mode - Smash & Grab; New weapons and equipment for both SWAT members and suspects; Stat tracking and ladders and rankings for multiplayer; Held commands - Orders can be held in single player until the leader gives the GO command; Unique Leader in Coop - Option to have only one person issue commands and lead the team. [Vivendi Universal]… Expand"}, {"name": "Expeditions: Rome", "details_link": "https://www.metacritic.com/game/pc/expeditions-rome", "publisher": "THQ Nordic", "release_date": "Jan 20 2022", "developers": ["Logic Artists"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Real-Time", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/1ee0fa32b9a60844e7e56891414125b9-98.jpg", "descriptions": "Determine the destiny of Rome as you conquer foreign lands and navigate political intrigue in this turn-based RPG. Directly fight with your party of Praetorians, guide your legion to victory, and choose your own path in a story where every decision matters. How will you shape the future of Rome?"}, {"name": "NBA 2K21", "details_link": "https://www.metacritic.com/game/xbox-series-x/nba-2k21", "publisher": "2K Games", "release_date": "Nov 10 2020", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 10 ", "genres": ["Sports", "Team", "Basketball", "Arcade"], "meta_score": 80, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/7179e60d149913a2eca1c9d04fa77d34-98.jpg", "descriptions": "NBA 2K21 is the latest title in the world-renowned, best-selling NBA 2K series, delivering an industry-leading sports video game experience. With extensive improvements upon its best-in-class graphics and gameplay, competitive and community online features, and deep, varied game modes, NBANBA 2K21 is the latest title in the world-renowned, best-selling NBA 2K series, delivering an industry-leading sports video game experience. With extensive improvements upon its best-in-class graphics and gameplay, competitive and community online features, and deep, varied game modes, NBA 2K21 offers one-of-a-kind immersion into all facets of NBA basketball and culture - where Everything is Game.… Expand"}, {"name": "Thronebreaker: The Witcher Tales", "details_link": "https://www.metacritic.com/game/playstation-4/thronebreaker-the-witcher-tales", "publisher": "CD Projekt Red Studio", "release_date": "Dec  4 2018", "developers": ["CD Projekt Red Studio"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Strategy", "Turn-Based", "Card Battle"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/72d971588cfa849b0bee16b67ce6b2f9-98.jpg", "descriptions": "From the creators of The Witcher 3: Wild Hunt comes a brand new tale set in the brutal and twisted universe of witcher Geralt of Rivia. The world stands on the verge of chaos, as the tensions between the power-hungry Nilfgaardian Empire and proud Northern Realms grow. Facing an imminentFrom the creators of The Witcher 3: Wild Hunt comes a brand new tale set in the brutal and twisted universe of witcher Geralt of Rivia. The world stands on the verge of chaos, as the tensions between the power-hungry Nilfgaardian Empire and proud Northern Realms grow. Facing an imminent invasion, Meve — war-veteran Queen of Lyria and Rivia — is forced to once again enter the warpath, and set out on a dark journey of destruction and revenge.… Expand"}, {"name": "Dropsy", "details_link": "https://www.metacritic.com/game/pc/dropsy", "publisher": "Devolver Digital", "release_date": "Sep 10 2015", "developers": ["Tendershoot", "A Jolly Corpse"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/21c3c2de9e18deb80e22c528c1676274-98.jpg", "descriptions": "Dropsy is a non-traditional take on the classic point and click adventure formula starring the game’s perpetually carefree namesake clown as he explores a richly detailed world full of colorful characters and sinister secrets, doling out hugs along the way."}, {"name": "Company of Heroes 2: The British Forces", "details_link": "https://www.metacritic.com/game/pc/company-of-heroes-2-the-british-forces", "publisher": "Sega", "release_date": "Sep  2 2015", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/e663d51b2b894b51fcbd24d1e7208309-98.jpg", "descriptions": "This latest multiplayer standalone entry in the COH2 series features this iconic Allied army. Experience a unique tech-tree that challenges the player to balance the constant trade-off between mobility and defense. Surprise opponents with your development choices and an open end game configuration."}, {"name": "WWE SmackDown! vs. Raw", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-smackdown!-vs-raw", "publisher": "THQ", "release_date": "Nov  2 2004", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/a97633d5e6c6d651ad4ef69b178ade52-98.jpg", "descriptions": "From the most successful wrestling game series of all-time comes the next phenom in sports entertainment ? WWE SmackDown! vs. RAW.Two worlds will collide as the most elite Superstars square off on the Playstation 2. WWE programming comes to life with Superstar Voice Over and commentaryFrom the most successful wrestling game series of all-time comes the next phenom in sports entertainment ? WWE SmackDown! vs. RAW.Two worlds will collide as the most elite Superstars square off on the Playstation 2. WWE programming comes to life with Superstar Voice Over and commentary throughout the unparalleled season mode. An abundance of new gameplay mechanics provide full control over all aspects of the game including new stare-downs, chop battles, submission reversals, match tactics, and overhauled Royal Rumble controls. The Divas are hotter than ever with an enhanced bra and panties match and to polish off the robust roster, from the halls of immortality, come a handful of the most celebrated legends to ever lace up their boots. [THQ]… Expand"}, {"name": "Phoenix Wright: Ace Attorney Trilogy", "details_link": "https://www.metacritic.com/game/playstation-4/phoenix-wright-ace-attorney-trilogy", "publisher": "Capcom", "release_date": "Apr  9 2019", "developers": ["Capcom"], "platforms": ["3DS", "iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/365cddc3109f1c76d624869dfc950ca8-98.jpg", "descriptions": "Become Phoenix Wright and experience the thrill of battle as you fight to save your innocent clients in a court of law. Play all 14 episodes, spanning the first three games, in one gorgeous collection. Solve the intriguing mysteries behind each case and witness the final truth for yourself."}, {"name": "Darkwood", "details_link": "https://www.metacritic.com/game/pc/darkwood", "publisher": "Acid Wizard Studio", "release_date": "Jul 17 2017", "developers": ["Acid Wizard Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/f45b4506d3971ad84f757310b10e57de-98.jpg", "descriptions": "Darkwood is a game about survival, exploration and fear, set in mysterious woods somewhere in the territory of the Soviet Bloc. It is a top-down, free-roam, surreal horror experience with a randomized world, taking cues from classic games, where oftentimes you had to figure things out forDarkwood is a game about survival, exploration and fear, set in mysterious woods somewhere in the territory of the Soviet Bloc. It is a top-down, free-roam, surreal horror experience with a randomized world, taking cues from classic games, where oftentimes you had to figure things out for yourself. By blending RPG, roguelike and adventure elements together with a challenging difficulty, Darkwood aims to please players craving for a deep and rewarding experience.\r The fear of unknown is powerful  and the unknown will try to remain unseen, forcing you to watch your back. Your senses will be deceived, your sight fooled, your smell tricked by Darkwood's surreal terrors. No answer will be given to you for free, yet somewhere in the woods lies the truth, an explanation to what has happened in this godforsaken place.\r Looking for your weakness, your inner demons, only to devour you. Welcome to Darkwood.… Expand"}, {"name": "Ground Control II: Operation Exodus", "details_link": "https://www.metacritic.com/game/pc/ground-control-ii-operation-exodus", "publisher": "Sierra Entertainment", "release_date": "Jun 23 2004", "developers": ["Massive Entertainment"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General", "Tactics"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/069fbc9fb325fe66b112944ea2d6d670-98.jpg", "descriptions": "Prepare for Battle. Ground Control II: Operation Exodus is a real-time 3D action strategy set in a distant and futuristic universe. The game mainly focuses on explosive combat missions where the player will control squads of infantry, tanks, artillery and helicopters as the story unfolds.Prepare for Battle. Ground Control II: Operation Exodus is a real-time 3D action strategy set in a distant and futuristic universe. The game mainly focuses on explosive combat missions where the player will control squads of infantry, tanks, artillery and helicopters as the story unfolds. [Vivendi Universal]… Expand"}, {"name": "Pokemon White Version 2", "details_link": "https://www.metacritic.com/game/ds/pokemon-white-version-2", "publisher": "Nintendo", "release_date": "Oct  7 2012", "developers": ["Game Freak"], "platforms": "DS", "num_players": "Up to 5 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/42d894e47044dddca64d3a4b34a99c0c-98.jpg", "descriptions": "In the Pokemon White Version 2 game, players can explore new areas, discover gyms with new leaders and see how everything has changed in the last two years."}, {"name": "Pokemon Shield", "details_link": "https://www.metacritic.com/game/switch/pokemon-shield", "publisher": "Nintendo", "release_date": "Nov 15 2019", "developers": ["Game Freak"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 80, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/3/38c18f663b36b2c1e3fe622a3f1694a3-98.jpg", "descriptions": "Pokémon Sword and Pokémon Shield are set in Galar, an expansive region with many environments—idyllic countryside, contemporary cities, thick forests, and craggy, snow-covered mountains. The people and Pokémon live together in this region, and they’ve worked together to develop thePokémon Sword and Pokémon Shield are set in Galar, an expansive region with many environments—idyllic countryside, contemporary cities, thick forests, and craggy, snow-covered mountains. The people and Pokémon live together in this region, and they’ve worked together to develop the industries here. You’ll visit the various Gyms in the Galar region, aiming for the enviable and admirable title of Champion. [Nintendo]\r… Expand"}, {"name": "Diablo II: Resurrected", "details_link": "https://www.metacritic.com/game/xbox-series-x/diablo-ii-resurrected", "publisher": "Activision", "release_date": "Sep 23 2021", "developers": ["Blizzard Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/9/1348743a4ae1f912ec036d39c0acd8b4-98.jpg", "descriptions": "Diablo® II: Resurrected™ is a remastered version of the quintessential action RPG Diablo® II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal. Features: Remastered graphics—monsters, heroes, items,Diablo® II: Resurrected™ is a remastered version of the quintessential action RPG Diablo® II. Pursue the mysterious Dark Wanderer and fight the denizens of hell as you uncover the fate of the Prime Evils Diablo, Mephisto, and Baal. Features: Remastered graphics—monsters, heroes, items, spells, all resurrected. An epic story told through five distinct acts. Classic gameplay—the same Diablo II you know and love, preserved. Updated Battle.net support. Planned support for cross-progression—take your progress wherever you play. Diablo II: Resurrected includes all content from both Diablo II and its epic expansion Diablo II: Lord of Destruction®. Battle your way through icy caverns, horrific tombs filled with undead abominations, and frozen wastelands to the frigid summit of Mount Arreat and stop Baal, the Lord of Destruction. Raise hell with two Lord of Destruction playable classes—the cunning Assassin, master of traps and shadow disciplines, and the savage Druid, a bold shapeshifter and summoner who commands primal elemental magic.… Expand"}, {"name": "Bloodstained: Curse of the Moon 2", "details_link": "https://www.metacritic.com/game/pc/bloodstained-curse-of-the-moon-2", "publisher": "Inti Creates", "release_date": "Jul 10 2020", "developers": ["Inti Creates"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/26c5879ab904a7a37a5034dfbfa71b4e-98.jpg", "descriptions": "Koji Igarashi and Inti Creates are back with more retro sword-and-whip action!Curse of the Moon 2 brings classic 2D action and a dark, 8-Bit aesthetic together with modern playability. The multi-scenario structure of the previous title returns with an epic new story supervised by IGA (KojiKoji Igarashi and Inti Creates are back with more retro sword-and-whip action!Curse of the Moon 2 brings classic 2D action and a dark, 8-Bit aesthetic together with modern playability. The multi-scenario structure of the previous title returns with an epic new story supervised by IGA (Koji Igarashi) himself. Players take control of Zangetsu, a swordsman from the far east who bears a deep grudge against demonkind and the alchemists who summoned them. Zangetsu must battle his way to the demonic stronghold, but he doesn't have to do it alone! Zangetsu can ally himself with a brand new cast of characters he meets along the way and add them to the playable roster. Each new character adds a variety of gameplay options, abilities, and ways to complete the game's many stages. Game FlowBattle through stages filled with fearsome enemies and dangerous traps, each with a massive boss waiting at the end. A chance encounter with a potential ally awaits you after defeating a boss. Will they serve as a trustworthy partner on your perilous journey?Increase Combat AbilitiesYou can instantaneously switch between allies you have recruited at any time! Allies have their own life bars, so with each ally you recruit, you're survivability is greatly increased! Shortcuts that Only Allies Can AccessAllies have special, unique abilities which allow them to use shortcuts to skip parts of stages or access new areas! There are no special items obtainable by taking the long way around, so take every shortcut you can find! If your allies are out of commission, you'll have to take longer routes, where stronger enemies await! When your life gets low, be sure to switch then out so they'll be available when you need them.Multiple EpisodesThe story is told over the course of multiple episodes. Only the first episode is accessible at the beginning, but more episodes will unlock as you progress through the game. The events that unfold in each episode continue into the next one, so be sure to unlock all the episodes to see the true ending. Curse of the Moon 2 had two play styles, \"Veteran\" and \"Casual\". Veteran StyleChoose \"Veteran\" style to experiment a difficulty reminiscent of older games. An enemy's sttack knocks the player to their death...something very familiar to retro game fans. Casual StyleEven if you're a fan of challenging games, sometimes you just want to take it easy! Casual mode is perfect for times like that. On Casual Style, things are more forgiving. Attacks don't knock the player back and lives are unlimited, alongside other changes. Changing StyleStyle can be changed when starting a game, loading a save file, or on the Game Over screen.… Expand"}, {"name": "Shin Megami Tensei: Strange Journey", "details_link": "https://www.metacritic.com/game/ds/shin-megami-tensei-strange-journey", "publisher": "Atlus", "release_date": "Mar 23 2010", "developers": ["Atlus"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 80, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/ba3dd238f913c60ccdcbcf812274a222-98.jpg", "descriptions": "When the black spot appeared in the Antarctic, mankind became nervous; when it began to spread, that anxiety turned to panic. The Joint Project, convened to discuss how to deal with the expanding anomaly, decided to send in four ships carrying humanity's finest soldiers and most cutting-edgeWhen the black spot appeared in the Antarctic, mankind became nervous; when it began to spread, that anxiety turned to panic. The Joint Project, convened to discuss how to deal with the expanding anomaly, decided to send in four ships carrying humanity's finest soldiers and most cutting-edge technology. The mission: to investigate what lay on the other side of what had been dubbed the Schwarzwelt and find out if there was a way to stop it from eventually covering the Earth. You are an elite soldier hand-picked for the Strike Team, outfitted with a Demonica environment suit and posted to the Red Sprite under Commander Gore. Upon entering the Schwarzwelt, the crew finds itself forced to deal with harsh conditions, supernatural interference, and throngs of demons populating the bewildering world. What exactly is the Schwarzwelt? What awaits at the end of this strange journey? It is entirely in your hands to find out. [Atlus USA]… Expand"}, {"name": "NBA Live 2004", "details_link": "https://www.metacritic.com/game/pc/nba-live-2004", "publisher": "EA Sports", "release_date": "Nov 11 2003", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/8/7bcf59bdb3109622d363c69602c8712b-98.jpg", "descriptions": "Step up your game with NBA Live 2004. With brand-new 10-Man Freestyle, authentic gameplay, and stunning graphics, NBA Live 2004 delivers the definitive basketball experience. Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk, or locking downStep up your game with NBA Live 2004. With brand-new 10-Man Freestyle, authentic gameplay, and stunning graphics, NBA Live 2004 delivers the definitive basketball experience. Whether running the point with one-button Quick Plays, spinning free in the lane for a vicious dunk, or locking down on \"D\", NBA LIVE 2004 puts players in total control. With a dramatically enhanced Dynasty Mode, the ability to take the court at all NBA arenas, and all-new commentary from Marv Albert and Mike Fratello, NBA Live 2004 is all about authenticity. [Electronic Arts]… Expand"}, {"name": "NHL 2003", "details_link": "https://www.metacritic.com/game/xbox/nhl-2003", "publisher": "EA Sports", "release_date": "Oct  9 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/52e7d1d57f8533f112d29f6b2b74e044-98.jpg", "descriptions": "In order to become a superstar in the NHL, you'll need a combination of speed, power, and moves. NHL 2003 gives you the abilities of all the stars and teams of pro hockey, but it's up to you to master them. This time, you have full control of the puck with Dynamic Deke Control and accurateIn order to become a superstar in the NHL, you'll need a combination of speed, power, and moves. NHL 2003 gives you the abilities of all the stars and teams of pro hockey, but it's up to you to master them. This time, you have full control of the puck with Dynamic Deke Control and accurate puck physics. The game also features four game modes, including Create-a-Player, enhanced sounds and animations, and dynamic camera work to bring you closer to the NHL action.… Expand"}, {"name": "MLB Slugfest 20-03", "details_link": "https://www.metacritic.com/game/gamecube/mlb-slugfest-20-03", "publisher": "Midway", "release_date": "Sep  3 2002", "developers": ["Gratuitous Games"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/61de2340a53cc34b550289178736dc58-98.jpg", "descriptions": "MLB SlugFest 20-03 ignites America's national pastime with a torrid blend of aggressive, adrenaline-style action and authentic MLB credentials.  Along with the series' signature brand of blazing fastballs, screaming line drives, and hard-hitting wall crashes, this year's Slugfest featuresMLB SlugFest 20-03 ignites America's national pastime with a torrid blend of aggressive, adrenaline-style action and authentic MLB credentials.  Along with the series' signature brand of blazing fastballs, screaming line drives, and hard-hitting wall crashes, this year's Slugfest features more outrageous animations, fantasy players and stadiums, and extra DVD Content.  Bolster your lineup MLB superstars, including Alex Rodriguez, and take your game to the next level.  … Expand"}, {"name": "MDK 2: Armageddon", "details_link": "https://www.metacritic.com/game/playstation-2/mdk-2-armageddon", "publisher": "Interplay", "release_date": "Mar 26 2001", "developers": ["BioWare"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/decd9fe072f7868c044789e852bfcdee-98.jpg", "descriptions": "The sequel to Playstation's \"MDK\" adds depth to the theme of saving the world from aliens."}, {"name": "Jarrett & Labonte Stock Car Racing", "details_link": "https://www.metacritic.com/game/playstation/jarrett-labonte-stock-car-racing", "publisher": "Codemasters", "release_date": "Oct  3 2000", "developers": ["Codemasters"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/d6cc2c0b57586551df92234ae23adb36-98.jpg", "descriptions": "Jarrett and Labonte Stock Car Racing is a solid racing game that's great fun for anyone who really enjoys spending a great deal of time learning all the ins and outs of a totally in-depth racing game."}, {"name": "Fur Fighters", "details_link": "https://www.metacritic.com/game/dreamcast/fur-fighters", "publisher": "Acclaim", "release_date": "Jul 11 2000", "developers": ["Bizarre Creations"], "platforms": ["PC", "Dreamcast"], "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/f28c3d9b23fe318c879095a1569d5ef1-98.jpg", "descriptions": "The fluff has hit the fan! Introducing the Fur Fighters, an elite strike squad of cuddly commandos on a quest to liberate their families from the evil General Viggo and save the free world!"}, {"name": "Skate 3", "details_link": "https://www.metacritic.com/game/xbox-360/skate-3", "publisher": "Electronic Arts", "release_date": "May 11 2010", "developers": ["EA Black Box"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 6 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/ec11eaffa096e818c571772c7d91a25c-98.jpg", "descriptions": "SKATE 3  features an all-new co-op mode where teammates can complete challenges together while advancing each other’s careers. From rewarding epic bails and fails with a beefed up Hall of Meat mode to honing your craft with the all-new skate.School, players of all skill levels have multipleSKATE 3  features an all-new co-op mode where teammates can complete challenges together while advancing each other’s careers. From rewarding epic bails and fails with a beefed up Hall of Meat mode to honing your craft with the all-new skate.School, players of all skill levels have multiple ways to “kill it” in the game. The franchise also continues to raise the bar for user created content with the skate.Create feature suite, an innovative toolset that empowers gamers to truly express their skate style by creating their own graphics, videos, and skate parks. [Electronic Arts]… Expand"}, {"name": "Tiger Woods PGA Tour 12: The Masters", "details_link": "https://www.metacritic.com/game/playstation-3/tiger-woods-pga-tour-12-the-masters", "publisher": "Electronic Arts", "release_date": "Mar 29 2011", "developers": ["Electronic Arts"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/6545eb7b26a84207b55957189384f083-98.jpg", "descriptions": "For the first time in franchise history, players will be able to step onto the grounds of Augusta National and begin their own journey to capture the most sought-after prize in professional golf - the Green Jacket."}, {"name": "Puppeteer", "details_link": "https://www.metacritic.com/game/playstation-3/puppeteer", "publisher": "SCEA", "release_date": "Sep 10 2013", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/b316a758a68010f83101d14230dd1d60-98.jpg", "descriptions": "Puppeteer is a brand new franchise developed exclusively for PlayStation 3 by SCE JAPAN Studio. Set in a magical puppeteer's theatre, this title introduces you to a strange and fantastic world, where the environment is constantly changing. Players experience a rich, dark fairytale wherePuppeteer is a brand new franchise developed exclusively for PlayStation 3 by SCE JAPAN Studio. Set in a magical puppeteer's theatre, this title introduces you to a strange and fantastic world, where the environment is constantly changing. Players experience a rich, dark fairytale where surprises lurk around every corner.… Expand"}, {"name": "Tomb Raider: Legend", "details_link": "https://www.metacritic.com/game/xbox-360/tomb-raider-legend", "publisher": "Eidos Interactive", "release_date": "Apr 11 2006", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/e792ead9a416492bd94709a068819419-98.jpg", "descriptions": "Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. Lara comes alive with intricately animated expressions, moves and abilities. An arsenal of modern equipment, such as a magnetic grappling device, binoculars,Tomb Raider: Legend revives the athletic, intelligent and entertaining adventurer who won the hearts and minds of gamers worldwide. Lara comes alive with intricately animated expressions, moves and abilities. An arsenal of modern equipment, such as a magnetic grappling device, binoculars, frag grenades, personal lighting device and communications equipment, allows gamers to experience tomb raiding as never before. Eidos and Crystal Dynamics shaped Lara's look and movements to be an inherent extension of her skills, motivation and personality. Lara's character model features natural structure, realistic textures, detailed facial features, reactive eyes and fluid motion, all of which make her part of a living environment. New character animations and controls allow her to move through stunning environments with grace and precision, while an understanding of the game's original appeal reinvigorates the fundamental explore-and-solve adventure experience. [Eidos Interactive]… Expand"}, {"name": "The Eternal Cylinder", "details_link": "https://www.metacritic.com/game/playstation-4/the-eternal-cylinder", "publisher": "Good Shepherd Entertainment", "release_date": "Sep 30 2021", "developers": ["ACE Team"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "genres": ["Action Adventure", "Open-World"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/ba3815a860edcd72a67cbcf8977b4809-98.jpg", "descriptions": "In The Eternal Cylinder, players control a herd of adorable creatures called Trebhums and must explore a strange alien world filled with exotic lifeforms, surreal environments, and the constant threat of the Cylinder, a gargantuan rolling structure of ancient origin which crushes everythingIn The Eternal Cylinder, players control a herd of adorable creatures called Trebhums and must explore a strange alien world filled with exotic lifeforms, surreal environments, and the constant threat of the Cylinder, a gargantuan rolling structure of ancient origin which crushes everything in its path. This unique ecosystem is a massive, procedurally generated land with unique animal AI, real-time world destruction, and organic exploration and puzzle design to create emergent gameplay that ensures no two playthroughs are ever the same.Your Trebhums begin at the bottom of the natural food chain but can mutate and evolve with new physical attributes and abilities by eating a variety of flora and fauna. Discover and adapt dozens of mutations, including new traversal skills like flying and swimming to reach new areas, and new senses to help overcome puzzles, challenges and dangers. Your many Trebhums can each have different mutations, and new mutations don't replace ones you already have, letting you stack ability sets in dynamic ways. Each mutation will also change the physical look of a Trebhum and stacking these will generate near countless surprising new creature designs which players will be able to organically discover as they explore this unique alien ecosystem. Game Features:* Unforgettable Alien World to explore: Players must explore a gorgeous procedurally generated world which is populated with unforgettable vistas and unique landscapes which have something new to discover around every corner. The Eternal Cylinder features an open-world which allows players to reach and explore any areas which they can see on the horizon. This encourages constant exploration and ensures that there's always something new to see. * Real-Time World Destruction: Everything in the world can be destroyed in real-time by The Eternal Cylinder, so players must continuously evade its destructive path in order to survive whilst marveling at the visual splendor of its godlike power.Story Driven Open-World Survival: Unlike many open-world survival titles, The Eternal Cylinder features a deep and engrossing story for players to uncover as they continue to explore the vast world. The game explores themes of family and heritage, and the lasting power of knowledge.* Build Your Own Alien Family: Unlike standard survival games where you have a main shelter that you can build or improve, in Eternal Cylinder players develop a nomadic herd of unique alien creatures called Trebhums. Players control one Trebhum from the herd at a time and the rest follow (Al controlled) but players can switch to any individual member of their herd at will. Explore the world to rescue more of your brethren and continuously expand your family. Control a herd which can grow to more than 20 members at any given time and imbue each of your Trebhums with their own unique mutations and skill sets. Players can create a custom name for each of their Trebhum, increasing the emotional bond between player and their Trebhum family. * Unique Mutation System: Although Trebhum's are generally frail and start their lives at the very bottom of the world's food chain, they have the unique ability to mutate and unlock new skills by consuming natural edibles which populate the game world. So, players must explore and experiment with a vast array of fruits, flora and alien creatures to unlock new powers and gameplay options. * 50+ Mutations to discover: Players can unlock more than 50+ unique mutations as they explore the world, each one of which enable new gameplay options. These include new traversal options such as the ability to fly and swim, but also new offensive moves like the ability to spit fire and create loud warning noises. New mutations allow players to explore new areas and each mutation stacks thus creating a truly expansive skill set which is constantly evolving. * A Trebhum for everyone: Enjoy a virtually endless visual variety of Trebhum designs, as each mutation combine with one another to create surprising new creatures. This allows your herd to continue to evolve as players explore new areas and players can share the unique look of their Trebhum family with the rest of the world online. * Layered Survival: Players need to manage multiple layers of resources in order to be able to survive. These include hydration level, various temperatures each with their own impact and stamina. * Living and Breathing Ecosystems: The world of The Eternal Cylinder is populated with more than 30 memorable handcrafted alien creatures. These creatures vary greatly in size and range from those smaller than a Trebhum, all the way to skyscraper sized leviathans who dominate the horizon. Each of these creatures feature their own dedicated Al and behave in natural ways. Players must learn their unique behaviors and discover surprising ways to utilize the natural food chain to their advantage and interact with every creature. * Organic Puzzle Solving and Progression: The world of the Eternal Cylinder has been designed to empower players to organically solve its mysteries and progress without the need for obvious prompts and mission logs. This allows for fully immersive exploration which rewards players of every skill level, as the greater majority of the puzzles are not required for progression but do provide unique experiences. * 4 Unique Biodomes lo Discover ond Explore: Players can explore 4 unique biodomes including alien savannas and infected habitats, each with their own dedicated ecosystems and unique creatures to discover. * Truly Emergent Gameplay: The Eternal Cylinder's lush procedurally generated world, vast number of mutations to discover and unlock, unique creature Al system, living natural ecosystem, real-time world destruction and organically placed puzzles combine to create near endless possibilities for emergent gameplay and help to ensure that no two playthroughs will ever be there same.… Expand"}, {"name": "Valfaris", "details_link": "https://www.metacritic.com/game/playstation-4/valfaris", "publisher": "Big Sugar Films", "release_date": "Nov  5 2019", "developers": ["Steel Mantis"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/f15a6ca818f19731ed2f409055c500b6-98.jpg", "descriptions": "Set in the far reaches of space, Valfaris is a heavy metal infused 2D action-platformer and the next game from the team behind Unity Awards finalist, Slain: Back From Hell. Brutal combat. Deadly enemies. Stunning pixel art. Savage soundtrack. Get ready to rip the galaxy a new wormhole."}, {"name": "Under Night In-Birth Exe:Late", "details_link": "https://www.metacritic.com/game/playstation-3/under-night-in-birth-exelate", "publisher": "Aksys Games", "release_date": "Feb 24 2015", "developers": ["French-Bread"], "platforms": ["PC", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/4e04a4be6353534f48b1839d9a54d467-98.jpg", "descriptions": "From Fighting game experts Aksys Games and Arc System Works (Guilty Gear, BlazBlue series) and fan-favorite video game developer French Bread, comes Under Night In-Birth Exe:Late, a brand new 2D fighting game made for all gamers: seasoned pros, and even those just curious about the fightingFrom Fighting game experts Aksys Games and Arc System Works (Guilty Gear, BlazBlue series) and fan-favorite video game developer French Bread, comes Under Night In-Birth Exe:Late, a brand new 2D fighting game made for all gamers: seasoned pros, and even those just curious about the fighting game genre!… Expand"}, {"name": "Brutal Legend", "details_link": "https://www.metacritic.com/game/pc/brutal-legend", "publisher": "Double Fine Productions", "release_date": "Feb 26 2013", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 8 ", "genres": ["Action", "General", "Fantasy", "General", "Fantasy", "Action Adventure", "Open-World"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/587abb8714a16a98e8bee7d43f494a75-98.jpg", "descriptions": "From the mind of Tim Schafer (Psychonauts, Grim Fandango) comes Brutal Legend, a heavy metal action game starring Jack Black (School of Rock, Tenacious D). You are heavy metal roadie Eddie Riggs, hurled back in time to the mythical Age of Metal when the world was formed and ruled by theFrom the mind of Tim Schafer (Psychonauts, Grim Fandango) comes Brutal Legend, a heavy metal action game starring Jack Black (School of Rock, Tenacious D). You are heavy metal roadie Eddie Riggs, hurled back in time to the mythical Age of Metal when the world was formed and ruled by the power of Rock! Armed with a broadaxe, a guitar, and a big block V8 you set off on an epic quest to assemble an army of headbangers, hotrods, barbarians, demonic dominatrix and the undead. With the wings of a demon and the power of a Rock God, you must lead humanity in an epic war against its barbaric overlords, and carve your name forever into the Brutal Legend. In Brutal Legend, you'll roam through a massive open-world born from the hell fires of heavy metal. In this world you can rev up any vehicle, rock its weapons, and crush the enemies of metal. You'll also learn to devastate with your guitar, playing face-melting solos that actually melt the faces of your enemies, command savage armies, bang skulls in hand-to-hand combat, and rise like a bat out of hell to command blood-drenched action from above. As if that wasn't enough, you can slay your friends and foes online, then play guitar licks on their graves! Of course, Brutal Legend is only complete with the most ultimate heavy metal soundtrack ever assembled in a game.… Expand"}, {"name": "Tomb Raider: Underworld", "details_link": "https://www.metacritic.com/game/pc/tomb-raider-underworld", "publisher": "Eidos Interactive", "release_date": "Nov 18 2008", "developers": ["Nixxes Software"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/da51f9c1759a687346e06dbbdec51af1-98.jpg", "descriptions": "Master your surroundings: Reach new heights with the broadest range of acrobatic abilities and utilize objects within the environment to uncover new paths to explore. Explore epic and unknown worlds: Discover ancient mysteries of the underworld hidden within the coast of Thailand, frozenMaster your surroundings: Reach new heights with the broadest range of acrobatic abilities and utilize objects within the environment to uncover new paths to explore. Explore epic and unknown worlds: Discover ancient mysteries of the underworld hidden within the coast of Thailand, frozen islands of the Arctic Sea, the jungles of Mexico, and more. Each level is an elaborate multi-stage puzzle masked within an interactive environmental playground offering more flexibility over how the area is solved. New range of combat options: Choose to pacify or kill, target multiple enemies at once with the new dual-target system, and shoot with one hand while suspended with the other. New state-of-the-art gear: Utilize the latest technology in Lara's upgraded inventory to navigate the world including: Active Sonar map: A revolutionary new tool that emits an active sonar ping to create a 3D image of Lara's surroundings, perfect for uncovering hidden items and locations; Multi-purpose grapple: A claw-like device with a high-tension cable designed for climbing, rappelling, performing wall runs and manipulating objects within the environment; All-terrain hybrid motorbike: A unique vehicle design built to drive on everything from mud to snow and ice. [Eidos Interactive]… Expand"}, {"name": "Sega Ages: Thunder Force AC", "details_link": "https://www.metacritic.com/game/switch/sega-ages-thunder-force-ac", "publisher": "Sega", "release_date": "May 28 2020", "developers": ["M2", "TechnoSoft"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/464132cfe4d2ccb284b70d2a21057a40-98.jpg", "descriptions": "Fasten your seatbelts! It's gonna be an eye popping, pulse pounding, mind blowing ride! Your super-powered starship is under attack on land, air and sea in this Action/Arcade thriller. But you're prepared to go out with a bang. Zap! Blast your way through a fire storm. Splash! Use the waveFasten your seatbelts! It's gonna be an eye popping, pulse pounding, mind blowing ride! Your super-powered starship is under attack on land, air and sea in this Action/Arcade thriller. But you're prepared to go out with a bang. Zap! Blast your way through a fire storm. Splash! Use the wave weapon to pulverize an enemy. It's an 8-stage intergalactic fight to the finish. And even the multi-level scrolling and haunting sound effects are out of this world. Boss characters with the most chillingly realistic graphics try to show you who's the boss. But if you're quick enough and smart enough, you can prevail.… Expand"}, {"name": "The Walking Dead: The Telltale Series - A New Frontier Episode 1: Ties That Bind Part One", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---a-new-frontier-episode-1-ties-that-bind-part-one", "publisher": "Telltale Games", "release_date": "Dec 20 2016", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Adventure", "Point-and-Click"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/ff0a999af590cb76667d2733924201d7-98.jpg", "descriptions": "When family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken fromWhen family is all you have left…how far will you go to protect it? After society was ripped apart by undead hands, pockets of civilization emerge from the chaos. But at what cost? Can the living be trusted on this new frontier? As Javier, a young man determined to find the family taken from him, you meet a young girl who has experienced her own unimaginable loss. Her name is Clementine, and your fates are bound together in a story where every choice you make could be your last.… Expand"}, {"name": "Titan Quest: Immortal Throne", "details_link": "https://www.metacritic.com/game/pc/titan-quest-immortal-throne", "publisher": "THQ", "release_date": "Mar  5 2007", "developers": ["Iron Lore Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/f0c8f5d604c37a6d58e218ab77c0420e-98.jpg", "descriptions": "Titan Quest: Immortal Throne features an original storyline with more than 12 hours of single-player content per difficulty level. New game-play features include an all-new skill mastery that combines with existing masteries to form eight new playable character classes. Titan Quest: ImmortalTitan Quest: Immortal Throne features an original storyline with more than 12 hours of single-player content per difficulty level. New game-play features include an all-new skill mastery that combines with existing masteries to form eight new playable character classes. Titan Quest: Immortal Throne also adds dozens of terrifying new monsters, hundreds of unique weapons and an additional 10 levels of character and skill development. [THQ]… Expand"}, {"name": "Peter Jackson's King Kong: The Official Game of the Movie", "details_link": "https://www.metacritic.com/game/xbox-360/peter-jacksons-king-kong-the-official-game-of-the-movie", "publisher": "Ubisoft", "release_date": "Nov 21 2005", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/28e1347e57fc4d414b83075aef0332fc-98.jpg", "descriptions": "Embark on an epic adventure created in collaboration with Academy Award-winning director Peter Jackson and based on the Universal Pictures' film. Survive as Jack in a world crawling with predators and live the legend as Kong. Use weapons, traps, and your team wisely to survive inEmbark on an epic adventure created in collaboration with Academy Award-winning director Peter Jackson and based on the Universal Pictures' film. Survive as Jack in a world crawling with predators and live the legend as Kong. Use weapons, traps, and your team wisely to survive in first-person as Jack. Break jaws, slam enemies, and throw massive objects in Kong's colossal third-person battles. [Ubisoft]… Expand"}, {"name": "Prison Architect", "details_link": "https://www.metacritic.com/game/playstation-4/prison-architect", "publisher": "Double Eleven", "release_date": "Jun 28 2016", "developers": ["Introversion", "Double Eleven"], "platforms": ["iPhone/iPad", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Strategy", "General", "Management", "Business / Tycoon"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/5ca4bc77b493afbcec471fac49cebcb2-98.jpg", "descriptions": "Build a maximum security prison. Yu need to include all the essentials right down to the plumbing for the toilets, but what else do you include? Guard towers? A workout room? Prevent rioting and stop escapes in Prison Architect."}, {"name": "Metro Exodus", "details_link": "https://www.metacritic.com/game/playstation-4/metro-exodus", "publisher": "Deep Silver", "release_date": "Feb 15 2019", "developers": ["4A Games"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/5567fd628bb0578588a944818b805620-98.jpg", "descriptions": "In Metro Exodus, Artyom and a band of survivors must flee the shattered ruins of the Moscow Metro and embark on an epic, continent-spanning journey across the post-apocalyptic Russian wilderness. Explore vast, non-linear levels, lose yourself in an immersive, sandbox survival experience, andIn Metro Exodus, Artyom and a band of survivors must flee the shattered ruins of the Moscow Metro and embark on an epic, continent-spanning journey across the post-apocalyptic Russian wilderness. Explore vast, non-linear levels, lose yourself in an immersive, sandbox survival experience, and follow a story-line that spans an entire year in the greatest Metro adventure yet. [Deep Silver]… Expand"}, {"name": "La-Mulana (Remake)", "details_link": "https://www.metacritic.com/game/pc/la-mulana-remake", "publisher": "Asterizm Co., Ltd", "release_date": "Jul 13 2012", "developers": ["Nigoro"], "platforms": "PC", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/e62ff13b09030182dae1dbcf841aea32-98.jpg", "descriptions": "Will you fall prey to deadly traps or unravel the secrets of LA-MULANA?\r LA-MULANA is an \"Archaeological Ruin Exploration Action Game\" in which you search inside ancient ruins, seeking out the \"Secret Treasure of Life\" - which sleeps in the sprawling ruins ofWill you fall prey to deadly traps or unravel the secrets of LA-MULANA?\r LA-MULANA is an \"Archaeological Ruin Exploration Action Game\" in which you search inside ancient ruins, seeking out the \"Secret Treasure of Life\" - which sleeps in the sprawling ruins of \"LA-MULANA\" and is said to be the beginning of all civilization.\r Apart from the plethora of traps lying in wait to stop intruders, there are also monsters on the prowl, protecting the ruins.\r Head for the innermost depths of the ruins while solving a variety of mysteries, fending off monsters, and disarming traps.… Expand"}, {"name": "X-Men Legends II: Rise of Apocalypse", "details_link": "https://www.metacritic.com/game/pc/x-men-legends-ii-rise-of-apocalypse", "publisher": "Activision", "release_date": "Sep 20 2005", "developers": ["Raven Software", "Beenox"], "platforms": ["PlayStation 2", "PC"], "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/1ca9c314733b8922495be1c00db132a4-98.jpg", "descriptions": "X-Men Legends II: Rise of Apocalypse introduces the epic storyline of an uneasy alliance between the X-Men and the hated Brotherhood in a fight to reclaim Earth from Apocalypse's grasp. Gameplay enhancements include more than double the superpowers and customization capabilities, the debutX-Men Legends II: Rise of Apocalypse introduces the epic storyline of an uneasy alliance between the X-Men and the hated Brotherhood in a fight to reclaim Earth from Apocalypse's grasp. Gameplay enhancements include more than double the superpowers and customization capabilities, the debut of several new playable characters, over 100 diverse types of enemies, and a breathtaking range of exotic and real-world environments—from the Madri Temple to Egypt. [Activision]… Expand"}, {"name": "Zombie Army 4: Dead War", "details_link": "https://www.metacritic.com/game/switch/zombie-army-4-dead-war", "publisher": "Rebellion", "release_date": "Apr 26 2022", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/412394e362f90836f2725ce9e5da9aa6-98.jpg", "descriptions": "The resistance have defeated Zombie Hitler and cast him into Hell but the dead rise once again with greater hunger than before.Continue the alternate history of Zombie Army Trilogy in huge new levels, and uncover a sinister plan that takes the Survivor Brigade across Italy and beyond!The resistance have defeated Zombie Hitler and cast him into Hell but the dead rise once again with greater hunger than before.Continue the alternate history of Zombie Army Trilogy in huge new levels, and uncover a sinister plan that takes the Survivor Brigade across Italy and beyond!Fight the forces of darkness in corpse-riddled canals, survive a Zombie Zoo, and journey to dark, inexplicable places no person has been before and lived to tell the tale!… Expand"}, {"name": "DIRT 5", "details_link": "https://www.metacritic.com/game/playstation-5/dirt-5", "publisher": "Codemasters", "release_date": "Nov 12 2020", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 80, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/7c04df9f03b662d6b9a40475600f89de-98.jpg", "descriptions": "On PS5, experience technical advances brought to life in an amplified off-road racer, such as faster loading times, greater graphical fidelity and a 120FPS option. Dirt 5 also utilises ps5's dual sense Controller features, including haptic feedback and adaptive triggers, so you can feelOn PS5, experience technical advances brought to life in an amplified off-road racer, such as faster loading times, greater graphical fidelity and a 120FPS option. Dirt 5 also utilises ps5's dual sense Controller features, including haptic feedback and adaptive triggers, so you can feel every bump, scrape and slide behind the wheel. All dirt 5 players on PlayStation 4 are entitled to a free upgrade to the next-gen optimized version on PlayStation 5.… Expand"}, {"name": "NFL Blitz", "details_link": "https://www.metacritic.com/game/playstation-3/nfl-blitz", "publisher": "Electronic Arts", "release_date": "Jan  3 2012", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade"], "meta_score": 80, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/a9b7568b39633ecb05ccf55bca85cd60-98.jpg", "descriptions": "Featuring the twitch gameplay and ultra-responsive controls of the original game, combined with all-new single-player and cooperative game modes, NFL Blitz hits the virtual gridiron in HD for the first time with blazing 60fps/60Hz gameplay.    Battle your rivals 7-on-7, fight your wayFeaturing the twitch gameplay and ultra-responsive controls of the original game, combined with all-new single-player and cooperative game modes, NFL Blitz hits the virtual gridiron in HD for the first time with blazing 60fps/60Hz gameplay.    Battle your rivals 7-on-7, fight your way through a season of the Blitz Gauntlet, take over the online leaderboards in Blitz Battles, or create a true dream team by collecting player cards in Elite League.  Challenging to master, yet easy to pick up and play, NFL Blitz is reborn as the ultimate HD arcade football experience for a new generation.… Expand"}, {"name": "Persona 3 Portable", "details_link": "https://www.metacritic.com/game/playstation-4/persona-3-portable", "publisher": "Sega", "release_date": "Jan 19 2023", "developers": ["Atlus"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/86f9f91825c7dfc538ceade35e8a49be-98.jpg", "descriptions": "The Dark Hour, time \"hidden\" between one day and the next. Unfamiliar stillness swallows the city, people turn into eerie coffins, and otherworldly monsters called Shadows swarm. One night, the protagonist is attacked by these Shadows and the power of the heart, their Persona, is awakened.The Dark Hour, time \"hidden\" between one day and the next. Unfamiliar stillness swallows the city, people turn into eerie coffins, and otherworldly monsters called Shadows swarm. One night, the protagonist is attacked by these Shadows and the power of the heart, their Persona, is awakened.\r As a member of a secret school club, you must wield your inner power--Persona--and protect humanity from impending doom. Will you live to see the light of day?… Expand"}, {"name": "Yu-Gi-Oh! Master Duel", "details_link": "https://www.metacritic.com/game/pc/yu-gi-oh!-master-duel", "publisher": "Konami", "release_date": "Jan 19 2022", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 80, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/a54ad9c2f8cf9e6c58eb1125710be20c-98.jpg", "descriptions": "The definitive digital edition of the competitive card game that has been evolving for over 20 years! Duel at the highest level against Duelists all over the world."}, null, {"name": "The End Is Nigh", "details_link": "https://www.metacritic.com/game/switch/the-end-is-nigh", "publisher": "Nicalis", "release_date": "Dec 12 2017", "developers": ["Nicalis"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/443716c59e970af9ecc7ec73900574b6-98.jpg", "descriptions": "The End Is Nigh is a sprawling adventure platformer where the player takes control over Ash, one of few \"things\" that have \"survived\" the \"end of the world.\" Follow Ash as he flops his way through a future of pain and suffering. Feel his stress levels rise as you throw him into an endlessThe End Is Nigh is a sprawling adventure platformer where the player takes control over Ash, one of few \"things\" that have \"survived\" the \"end of the world.\" Follow Ash as he flops his way through a future of pain and suffering. Feel his stress levels rise as you throw him into an endless swarm of decaying, mutant animal-like creatures and help aid his final epic quest...to simply make a friend (out of pieces of people he finds along his journey). [Nintendo]… Expand"}, {"name": "Saviors of Sapphire Wings & Stranger of Sword City Revisited", "details_link": "https://www.metacritic.com/game/switch/saviors-of-sapphire-wings-stranger-of-sword-city-revisited", "publisher": "NIS America", "release_date": "Mar 16 2021", "developers": ["NIS America", "Experience Inc."], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/b87418cc0e8cb1ddc876b1efd2f93315-98.jpg", "descriptions": "Discover a tale of war, darkness, and the power of bonds, coming to the West for the first time! The world is plunged into ruin after Ol=Ohma, the Overlord of Darkness defeats the Knights of the Round, the last bastion of defense for mankind. 100 years later, a fallen hero returns to lifeDiscover a tale of war, darkness, and the power of bonds, coming to the West for the first time! The world is plunged into ruin after Ol=Ohma, the Overlord of Darkness defeats the Knights of the Round, the last bastion of defense for mankind. 100 years later, a fallen hero returns to life and must lead a new generation of heroes to defeat Ol=Ohma’s forces and restore light and hope to the world. Explore dungeons, use traps and combat prowess to defeat powerful monsters, and bond with your allies to unlock their true potential in this RPG gem. If you enjoyed your adventures in Saviors of Sapphire Wings, you can also dive into the world of Stranger of Sword City Revisited! Brimming with additional content such as expanded character creation options, in-game events, and new items and equipment, this remastered version of the original dungeon-crawling hit is bundled with Saviors of Sapphire Wings as a bonus game.… Expand"}, {"name": "Life is Strange 2: Episode 1 - Roads", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-2-episode-1---roads", "publisher": "Square Enix", "release_date": "Sep 27 2018", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 80, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/6/74b1594c5d545b0655ebbef939c5743e-98.jpg", "descriptions": "Two brothers, aged 16 and 9, are forced to run away from home after a tragic incident, while attempting to conceal a sudden and mysterious supernatural power."}, {"name": "Ironcast", "details_link": "https://www.metacritic.com/game/switch/ironcast", "publisher": "Ripstone", "release_date": "Aug 10 2017", "developers": ["Dreadbit"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/9278c65917e478b15e9257b7c838fb16-98.jpg", "descriptions": "Ironcast is a game of steampunk mech combat, set in a fictional version of the Victorian Era. Inspired by science fiction writers such as H.G. Wells and Jules Verne, Ironcast is set in an exciting alternative history; a time when refined men and women in top hats and bonnets commandedIroncast is a game of steampunk mech combat, set in a fictional version of the Victorian Era. Inspired by science fiction writers such as H.G. Wells and Jules Verne, Ironcast is set in an exciting alternative history; a time when refined men and women in top hats and bonnets commanded gigantic walking war machines, laying waste to the enemies of the British Empire!… Expand"}, {"name": "Wonder Boy: The Dragon's Trap", "details_link": "https://www.metacritic.com/game/xbox-one/wonder-boy-the-dragons-trap", "publisher": "DotEmu", "release_date": "Apr 18 2017", "developers": ["Lizardcube"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/4ad4af7d4dc04b327fc5f07f8156a391-98.jpg", "descriptions": "Featuring hand-drawn animations and a re-orchestrated soundtrack, the cult classic returns with a unique blend of exploration, action, and adventure. Play as the game’s classic character, Hu-Man, or as his brand-new, long-awaited co-star Hu-Girl and use their unique abilities to uncover theFeaturing hand-drawn animations and a re-orchestrated soundtrack, the cult classic returns with a unique blend of exploration, action, and adventure. Play as the game’s classic character, Hu-Man, or as his brand-new, long-awaited co-star Hu-Girl and use their unique abilities to uncover the land’s deepest secrets. [Xbox.com]… Expand"}, {"name": "SpellForce 2: Shadow Wars", "details_link": "https://www.metacritic.com/game/pc/spellforce-2-shadow-wars", "publisher": "Aspyr", "release_date": "May  5 2006", "developers": ["EA Phenomic"], "platforms": "PC", "num_players": "4  Online", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/80610e7339fe089dc4a701a7b1ca4494-98.jpg", "descriptions": "The most beautiful, perfect and deadly of the Dark Races -- the Dark Elves – are in league with the mysterious Shadows and are threatening to overrun the realms of all the races. Fighting against the sinister \"Pact\", players take on the role of the Avatar who was born from the blood of theThe most beautiful, perfect and deadly of the Dark Races -- the Dark Elves – are in league with the mysterious Shadows and are threatening to overrun the realms of all the races. Fighting against the sinister \"Pact\", players take on the role of the Avatar who was born from the blood of the last dragon and haunted by a dark secret. The Avatar must reforge old alliances in order to face the invasion and save the world of Eo – but the true battle is waged within his soul. [Aspyr Media]… Expand"}, {"name": "DOOM Eternal", "details_link": "https://www.metacritic.com/game/switch/doom-eternal", "publisher": "Bethesda Softworks", "release_date": "Dec  8 2020", "developers": ["id Software", "Panic Button"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/14a9f4d96e4f85b949949deb36930d57-98.jpg", "descriptions": "The demonic invasion is still in progress. Announced at the 2018 Bethesda E3 Showcase, DOOM Eternal is the direct sequel to the award-winning and best-selling DOOM (2016). Developed by id Software, DOOM Eternal will deliver the ultimate combination of speed and power, along with the nextThe demonic invasion is still in progress. Announced at the 2018 Bethesda E3 Showcase, DOOM Eternal is the direct sequel to the award-winning and best-selling DOOM (2016). Developed by id Software, DOOM Eternal will deliver the ultimate combination of speed and power, along with the next leap in push-forward, first-person combat.… Expand"}, {"name": "Fritz 8 Deluxe", "details_link": "https://www.metacritic.com/game/pc/fritz-8-deluxe", "publisher": "Viva Media", "release_date": "Dec  1 2004", "developers": ["ChessBase"], "platforms": "PC", "num_players": "2  Online", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/b5a526024420066632c4cd3eeab85afb-98.jpg", "descriptions": "Fritz Chess 8, written by Frans Morsch, is identical to the one that fascinated the world in the man vs Machine duel against the human world champion. Millions of chess fans watched the games live on the Internet - the match ended in a 4:4 tie. \"Deep Fritz is stronger than Deep Blue,\" saidFritz Chess 8, written by Frans Morsch, is identical to the one that fascinated the world in the man vs Machine duel against the human world champion. Millions of chess fans watched the games live on the Internet - the match ended in a 4:4 tie. \"Deep Fritz is stronger than Deep Blue,\" said world champion Vladimir Kramnik, who had carefully studied the program. But don't be afraid, Fritz is not just a chess playing monster. It is a friendly chess partner for beginners and amateurs. It will teach you to play chess from scratch, and can automatically adjust its playing strength to suit your needs. It will warn you when you go wrong in a game, giving you hints on how to play better. [Excalibur Publishing]… Expand"}, {"name": "Trine", "details_link": "https://www.metacritic.com/game/pc/trine", "publisher": "SouthPeak Games", "release_date": "Jul  2 2009", "developers": ["Frozenbyte", "Inc."], "platforms": ["PlayStation 3", "PC"], "num_players": "1-3 ", "genres": ["Action", "Action Adventure", "Fantasy", "General", "Platformer", "Fantasy", "2D"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/3432c9d6c2a5f1cf048822406638cdc8-98.jpg", "descriptions": "Trine is a physics-based action game where three characters allow clever solutions to challenges created by hazardous puzzles and threatening enemies. The gameplay is based on fully interactive physics - each character's different abilities and tactics can be used to invent new ways toTrine is a physics-based action game where three characters allow clever solutions to challenges created by hazardous puzzles and threatening enemies. The gameplay is based on fully interactive physics - each character's different abilities and tactics can be used to invent new ways to overcome obstacles and save the kingdom! [Frozenbyte]… Expand"}, {"name": "Mega Man X Legacy Collection 1 + 2", "details_link": "https://www.metacritic.com/game/switch/mega-man-x-legacy-collection-1-+-2", "publisher": "Capcom", "release_date": "Jul 24 2018", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/c7e84adf931e60e32db2eab67f60ced7-98.jpg", "descriptions": "The celebrated Mega Man X series comes to PlayStation 4, Xbox One, Nintendo Switch, and PC! Play as Mega Man X the powerful evolution of classic fighting robot Mega Man as he battles a variety of deadly bosses known as Mavericks in eight exhilarating action-platformer games. Mega Man XThe celebrated Mega Man X series comes to PlayStation 4, Xbox One, Nintendo Switch, and PC! Play as Mega Man X the powerful evolution of classic fighting robot Mega Man as he battles a variety of deadly bosses known as Mavericks in eight exhilarating action-platformer games. Mega Man X Legacy Collection includes the legendary 16-bit titles and the series' exciting foray into 32-bits: Mega Man X, Mega Man X2, Mega Man X3, and Mega Man X4. The heroic robot grows stronger as he takes down Mavericks and steals their weapons, and also has the ability to dash and wall jump for thrilling, fast-paced combat. Mega Man X's mysterious friend, Zero, also joins the fray as a playable character later in this collection.Mega Man X Legacy Collection 2 also spans two gaming eras, showcasing the evolution of the series with Mega Man X5, Mega Man X6, Mega Man X7, and Mega Man X8. A third playable character, Axl, joins the cast in Mega Man X7 and Mega Man X8 as the series jumps into a new realm of 3D character models and environments.In addition to eight iconic Mega Man X titles, both Mega Man X Legacy Collection and Mega Man Legacy Collection 2 come with an armory of new features. Test your Maverick-hunting skills in the new X Challenge mode, which pits players against two deadly bosses in a series of two-on-one battles. Think you can take down the slippery Chill Penguin and hulking Frost Walrus simultaneously? Give it your best shot! Additionally, Mega Man X Legacy Collection includes a huge museum filled with rare production art, catalogs of classic merchandise, a playlist of nostalgic commercials, and more. The collection also includes an animated a prequel film starring the origins of Mega Man X villain, Sigma.… Expand"}, {"name": "Dishonored: Definitive Edition", "details_link": "https://www.metacritic.com/game/playstation-4/dishonored-definitive-edition", "publisher": "Bethesda Softworks", "release_date": "Aug 25 2015", "developers": ["Arkane Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/2ed9ca44cdd1d6057868fb27e5696940-98.jpg", "descriptions": "Dishonored, and all of its additional content - Dunwall City Trials, The Knife of Dunwall, The Brigmore Witches and Void Walker's Arsenal."}, {"name": "Etrian Odyssey V: Beyond the Myth", "details_link": "https://www.metacritic.com/game/3ds/etrian-odyssey-v-beyond-the-myth", "publisher": "Atlus Co.", "release_date": "Oct 17 2017", "developers": ["Atlus Co.", "Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style", "Western-Style"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/1257d7a5250c67a43157cb1d6594d808-98.jpg", "descriptions": "Etrian Odyssey V chronicles the quest of a new adventurer as he or she attempts to reach the crown of the towering Yggdrasil Tree. For it is said that whoever braves the dangers of the dreaded Yggdrasil Labyrinth and reaches the summit will have their greatest wish fulfilled. Each cultureEtrian Odyssey V chronicles the quest of a new adventurer as he or she attempts to reach the crown of the towering Yggdrasil Tree. For it is said that whoever braves the dangers of the dreaded Yggdrasil Labyrinth and reaches the summit will have their greatest wish fulfilled. Each culture has their own myth, some say great power will be granted, others believe the great mysteries will be solved. Some believe the ultimate techniques can be mastered there, and a number believe the lost treasures can be found at the top of the Yggdrasil Tree's boughs. There's a reason why no one has ever reached the top. Dangerous creatures and terrifying FOEs roam the labyrinth on every floor, so prepare to test your mettle with challenging turn-based battles. Form your own party and partner up to unleash devastating attacks. Personalize your party to work to your advantage. With endless character customization, adventurers will cast and create their own party from four unique races and ten different classes to explore the uncharted labyrinth. [Nintendo]… Expand"}, {"name": "Sleeping Dogs", "details_link": "https://www.metacritic.com/game/xbox-360/sleeping-dogs", "publisher": "Square Enix", "release_date": "Aug 14 2012", "developers": ["United Front Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action Adventure", "Modern", "Open-World"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/696ba44aa0c5065c22506538c4ca6cec-98.jpg", "descriptions": "Sleeping Dogs is an open world cop drama set in the vibrant city of Hong Kong. Taking the role of undercover cop Wei Shen, players must take down one of the world's most lethal criminal organizations from the inside. Featuring imaginative combat systems, Sleeping Dogs empowers enablesSleeping Dogs is an open world cop drama set in the vibrant city of Hong Kong. Taking the role of undercover cop Wei Shen, players must take down one of the world's most lethal criminal organizations from the inside. Featuring imaginative combat systems, Sleeping Dogs empowers enables players to perform an array of martial arts moves, singlehandedly taking on numerous opponents. Players perform visceral kicks and combos, vicious counters and a cinematic set of environmental takedowns making use of real-world items from circular saws to phone booths, incinerators to refrigerator doors.… Expand"}, {"name": "Lumines Supernova", "details_link": "https://www.metacritic.com/game/playstation-3/lumines-supernova", "publisher": "Q Entertainment", "release_date": "Dec 23 2008", "developers": ["Q Entertainment"], "platforms": "PlayStation 3", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/a945555e7df7efa8355261f9f65ac6dc-98.jpg", "descriptions": "[Playstation Network]  Indulge in the fusion of puzzle, lights and music! The latest installment to the blockbuster franchise from Tetsuya Mizuguchi and Q Entertainment comes packed with brand new skins and new modes, exclusive to the PS3. LUMINES Supernova combines puzzles, block-dropping[Playstation Network]  Indulge in the fusion of puzzle, lights and music! The latest installment to the blockbuster franchise from Tetsuya Mizuguchi and Q Entertainment comes packed with brand new skins and new modes, exclusive to the PS3. LUMINES Supernova combines puzzles, block-dropping beats and video entertainment to create an addictively-fun gameplay experience that will keep you playing day after day. The game offers 40 skins in the Challenge Mode alone, with several brand new skins keeping the Lumines experience fresh. Choose from several different single player modes, battle it out with a friend or create your own background music in the all-new Sequencer Mode. [SCEA]… Expand"}, {"name": "Test Drive Unlimited", "details_link": "https://www.metacritic.com/game/psp/test-drive-unlimited", "publisher": "Atari", "release_date": "Mar 21 2007", "developers": ["Melbourne House"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/7f5544d08575241f1f1332bf445816f1-98.jpg", "descriptions": "Test Drive Unlimited is the only game that immerses you into the car and bike enthusiast lifestyle, with total freedom to race however and wherever you want within a huge, online-persistent environment. Visit the most sophisticated car and bike dealers to purchase new vehicles or simply takeTest Drive Unlimited is the only game that immerses you into the car and bike enthusiast lifestyle, with total freedom to race however and wherever you want within a huge, online-persistent environment. Visit the most sophisticated car and bike dealers to purchase new vehicles or simply take them for a spin. Collect and trade rare performance parts and customize each vehicle to make it one-of-a-kind. Test Drive Unlimited challenges players online to experience the most exotic and fastest vehicles on more than 1000 miles of diverse Hawaiian roads. Gamers win races, challenges, missions and tournaments to earn credits and purchase new cars, bikes, rare performance parts, clothes, apparel, homes and garages. Features more than 125 licensed vehicles from exclusive manufacturers including Lamborghini, Ducati, Aston Martin, Mercedes, Saleen, Shelby, and Jaguar; Upgrade each car or bike with options from the actual manufacturers' catalog. Players create characters, buy new homes and garages, and tune and upgrade vehicles with aftermarket parts; Extracurricular activities such as expanding your garage, getting clothes and fashion accessories for your avatar, helping hitchhikers catch planes, picking up girls, chasing car thieves, and escaping from a psychopath. [Atari]… Expand"}, {"name": "FIFA Soccer 06", "details_link": "https://www.metacritic.com/game/xbox/fifa-soccer-06", "publisher": "EA Sports", "release_date": "Oct  4 2005", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/e4a4e86988b4a4302d940e68c48f87ce-98.jpg", "descriptions": "You can experience the excitement of international soccer competition in FIFA 06. Extensive coaching options give you the opportunity to take control of all of your players on the pitch and determine their formation and strategy. FIFA 06 offers game modes ranging from a tournament toYou can experience the excitement of international soccer competition in FIFA 06. Extensive coaching options give you the opportunity to take control of all of your players on the pitch and determine their formation and strategy. FIFA 06 offers game modes ranging from a tournament to individual skill games. You can also play with real players from famous international teams from around the world. Multiplayer modes let you challenge other gamers.… Expand"}, {"name": "Hoyle Majestic Chess", "details_link": "https://www.metacritic.com/game/pc/hoyle-majestic-chess", "publisher": "VU Games", "release_date": "Aug 14 2003", "developers": ["Fluent"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/d5d6e79bbb8d277d1577466bfbfa5ae5-98.jpg", "descriptions": "Hoyle Majestic Chess is a unique chess game featuring a variety of play styles, traditional and non-traditional learning mechanisms, challenging online play and multiple chess-based challenges. With the abundance of options, Majestic Chess is uncharacteristically accessible to all levels ofHoyle Majestic Chess is a unique chess game featuring a variety of play styles, traditional and non-traditional learning mechanisms, challenging online play and multiple chess-based challenges. With the abundance of options, Majestic Chess is uncharacteristically accessible to all levels of players, providing hours of fun for both the expert as well as the casual gamer who enjoys puzzles and board games. A top-notch chess product from members of the original Chessmaster team, Majestic Chess can go head to head with Chessmaster on any feature point AND includes \"Chess Adventure\" - an entirely original game that introduces the fun of chess by presenting a variety of challenges and puzzles in the context of a larger adventure. [Vivendi Universal]… Expand"}, {"name": "Ace Combat 7: Skies Unknown", "details_link": "https://www.metacritic.com/game/playstation-4/ace-combat-7-skies-unknown", "publisher": "Bandai Namco Games", "release_date": "Jan 18 2019", "developers": ["Project Aces"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Simulation", "Flight", "Combat"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/05733fcd6f7367be02d5182bc404a856-98.jpg", "descriptions": "Strap yourself into the cockpit of some of the worlds most formidable fighter planes and skim through the clouds embarking on daring aerial stunts and nerve-shredding tactical dogfights.\r In Ace Combat 7, you take on the role of an Ace  an elite fighter pilot tasked with patrolling theStrap yourself into the cockpit of some of the worlds most formidable fighter planes and skim through the clouds embarking on daring aerial stunts and nerve-shredding tactical dogfights.\r In Ace Combat 7, you take on the role of an Ace  an elite fighter pilot tasked with patrolling the most open and intimidating space on Earth: the sky. Choose from an array of authentic modern and futurist aircraft and load them up with an arsenal of cutting-edge super weapons as unfolding events drive you into ever more dangerous aerial face-offs.\r PlayStation VR support will allow you to actually climb inside the cockpit with a series of exclusive features that create a new level of death-defying immersion.… Expand"}, {"name": "MLB 15: The Show", "details_link": "https://www.metacritic.com/game/playstation-4/mlb-15-the-show", "publisher": "SCEA", "release_date": "Mar 31 2015", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PlayStation Vita", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Traditional", "Sports", "Team", "Baseball", "Sim"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/175ddf2d1147970a78cb98debc457ddc-98.jpg", "descriptions": "With the addition of General Manager Contracts, you now must consider Ownership Expectations when operating your team, and your performance will determine the job offers that you'll be confronted with. Building a championship-caliber team is more dynamic than in previous iterations, with theWith the addition of General Manager Contracts, you now must consider Ownership Expectations when operating your team, and your performance will determine the job offers that you'll be confronted with. Building a championship-caliber team is more dynamic than in previous iterations, with the new Performance-based Player Progression, as well as improved Trade and Contract logic. Partner up with Brand Sponsors, giving your broadcast elements an official sponsor and earn some extra cash to spend on your team.… Expand"}, {"name": "Monster Hunter Generations Ultimate", "details_link": "https://www.metacritic.com/game/switch/monster-hunter-generations-ultimate", "publisher": "Capcom", "release_date": "Aug 28 2018", "developers": ["Capcom"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/7828465fd8ddf5500f77afac806907ae-98.jpg", "descriptions": "This critically acclaimed action RPG series makes its debut on Nintendo Switch. Take on epic hunts on the go or from the comfort of your own home! Choose from 14 different weapon types, mix and match them with unique Hunting Styles and Hunter Arts, or even play as an adorable but ferociousThis critically acclaimed action RPG series makes its debut on Nintendo Switch. Take on epic hunts on the go or from the comfort of your own home! Choose from 14 different weapon types, mix and match them with unique Hunting Styles and Hunter Arts, or even play as an adorable but ferocious Felyne in Prowler Mode! Featuring the largest cast of monsters for any game in the series, from returning fan favourites to mysterious never-before-seen monsters. You can join up to three other players for co-op multiplayer action, either online or in person using local wireless. Join the hunt in Monster Hunter Generations Ultimate for Nintendo Switch.\r… Expand"}, {"name": "Dishonored: The Knife of Dunwall", "details_link": "https://www.metacritic.com/game/pc/dishonored-the-knife-of-dunwall", "publisher": "Bethesda Softworks", "release_date": "Apr 16 2013", "developers": ["Arkane Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/c7b0c11ed96ff2466e3c37da9f9d95ef-98.jpg", "descriptions": "In The Knife of Dunwall you assume the role of Daud, the legendary assassin who killed the Empress, and access his weapons, gadgets, allies and supernatural abilities. After assassinating the Empress, and forever changing the fate of Dunwall, you embark on a search for redemption. TheIn The Knife of Dunwall you assume the role of Daud, the legendary assassin who killed the Empress, and access his weapons, gadgets, allies and supernatural abilities. After assassinating the Empress, and forever changing the fate of Dunwall, you embark on a search for redemption. The Outsider reveals the key to your atonement, but who-or what-is Delilah? Accompanied by the Whalers, your loyal band of mercenary assassins, your search will take you through never-before-seen districts of Dunwall as you face off against new and terrible foes. Employ a unique arsenal of new weapons and powers that enhance Dishonored's dynamic combat, mobility and stealth systems. In the struggle to hang onto the last shred of your humanity, the choices you make will ultimately determine your fate.… Expand"}, {"name": "The Walking Dead: 400 Days", "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-400-days", "publisher": "Telltale Games", "release_date": "Jul  5 2013", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Adventure", "General", "Compilation", "Point-and-Click"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/e8f284189c7e79d1a4c2ec26ca51b988-98.jpg", "descriptions": "Join five new characters as they struggle to survive in The Walking Dead: 400 Days"}, {"name": "NBA 2K7", "details_link": "https://www.metacritic.com/game/playstation-3/nba-2k7", "publisher": "2K Sports", "release_date": "Nov 13 2006", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/d434d906245bb06b988a57a672a0a78f-98.jpg", "descriptions": "Be a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity ProfileBe a Sharpshooter - The award winning technical achievement of 2K6 is new and improved. Take complete control of all of your shots with the shot stick. Run the Streets - Hit the street courts and showcase your playground game with completely all new streetball mode. Virtual Identity Profile - Learn the play style of your friends and foes with the V.I.P. System. The Association - Be the GM of your NBA team with the deepest Franchise Mode around. [2K Sports]… Expand"}, {"name": "Company of Heroes 2", "details_link": "https://www.metacritic.com/game/pc/company-of-heroes-2", "publisher": "Sega", "release_date": "Jun 25 2013", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 80, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/1/cbe1a52ddf20896700668649c42e3dad-98.jpg", "descriptions": "It is 1941 and the beginning of what will become the most brutal conflict of World War II, as Germany launches a full-scale invasion of the frozen tundra of the Soviet Union which would result in over 14 million military casualties.  Take command of the iconic Soviet Red Army in brutalIt is 1941 and the beginning of what will become the most brutal conflict of World War II, as Germany launches a full-scale invasion of the frozen tundra of the Soviet Union which would result in over 14 million military casualties.  Take command of the iconic Soviet Red Army in brutal frontline warfare to free Mother Russia from the invading Nazis. Your strategic skills and tactical expertise hold the power to tip the very balance of this conflict in the sequel to the critically acclaimed and multi award-winning Company of Heroes. Engage in visceral tactical combat that will define you as a military leader and challenge you to wield the might of the Soviet Empire as you smash your way to Berlin.… Expand"}, {"name": "RiME", "details_link": "https://www.metacritic.com/game/playstation-4/rime", "publisher": "Tequila Works", "release_date": "May 26 2017", "developers": ["Tequila Works"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/9b591c1f468fae7fca85cdc99d242dc3-98.jpg", "descriptions": "The story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse. An end, and a new beginning. A strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is key toThe story of a boy who must use his wits and ingenuity to survive - and ultimately escape from - a mysterious island and a terrible curse. An end, and a new beginning. A strange island with a sinister secret, and an open-world adventure with a difference. As a boy who finds he is key to solving a series of ancient puzzles, you'll use an enigmatic artefact to manipulate your environment and even time itself.\r Thanks to the innovative control offered by the DUALSHOCK 4 controller, you'll find that light, sound and touch are all essential in your bid to escape the island.… Expand"}, {"name": "Natural Selection 2", "details_link": "https://www.metacritic.com/game/pc/natural-selection-2", "publisher": "Unknown Worlds Entertainment", "release_date": "Oct 30 2012", "developers": ["Unknown Worlds Entertainment"], "platforms": "PC", "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Tactical", "Arcade"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/603805820a821d0e0671b8df94f63c87-98.jpg", "descriptions": "Natural Selection 2 is a revamped version of the Half-Life mod that will be available through Steam as a stand-alone purchase."}, {"name": "Trine 4: The Nightmare Prince", "details_link": "https://www.metacritic.com/game/playstation-4/trine-4-the-nightmare-prince", "publisher": "Maximum Games", "release_date": "Oct  8 2019", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/b12756c261d9e213926df896e705dcfc-98.jpg", "descriptions": "TheTrine series returns to the magic of 2.5D! Join three iconic heroes as they set off on a quest through fantastical fairytale landscapes to save the world from the Nightmare Prince’s shadows."}, {"name": "Red Steel 2", "details_link": "https://www.metacritic.com/game/wii/red-steel-2", "publisher": "Ubisoft", "release_date": "Mar 23 2010", "developers": ["Ubisoft Paris"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/87869a0bda9a94b6351fec9b006fb3d3-98.jpg", "descriptions": "Red Steel 2 returns with an artistic style and flair created just for Wii. Set in a desert-bound, high-tech metropolis, Red Steel 2 promises to be a revolution in the action-fighting genre, taking full advantage of the capabilities of the Wii MotionPlus accessory. Your movements areRed Steel 2 returns with an artistic style and flair created just for Wii. Set in a desert-bound, high-tech metropolis, Red Steel 2 promises to be a revolution in the action-fighting genre, taking full advantage of the capabilities of the Wii MotionPlus accessory. Your movements are faithfully replicated on-screen, putting the emphasis on swinging, shooting and fun!  With the ability of the Wii MotionPlus to sense the strength of a swing, you will literally be able to make an impact on your adversaries through power and precision. [Ubisoft]… Expand"}, {"name": "Crash Bandicoot N. Sane Trilogy", "details_link": "https://www.metacritic.com/game/playstation-4/crash-bandicoot-n-sane-trilogy", "publisher": "Activision", "release_date": "Jun 30 2017", "developers": ["Vicarious Visions"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/d3ae70e40b3518ba81e77d75ed5a4dc4-98.jpg", "descriptions": "Your favorite marsupial, Crash Bandicoot, is back. He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through theYour favorite marsupial, Crash Bandicoot, is back. He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through the three games that started it all, Crash Bandicoot, Crash Bandicoot 2: Cortex Strikes Back and Crash Bandicoot: Warped. Relive all your favorite Crash moments in their fully-remastered HD graphical glory and get ready to put some UMPH in your WUMP.… Expand"}, {"name": "Ninjatown", "details_link": "https://www.metacritic.com/game/ds/ninjatown", "publisher": "SouthPeak Games", "release_date": "Oct 28 2008", "developers": ["Venan Entertainment", "Cashmere Prod."], "platforms": "DS", "num_players": "2  Online", "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/7/e5bfd02f2a9737c5852624b9c7f7caf4-98.jpg", "descriptions": "Sunny skies, lush forest and rolling hills combine to form the land known as Ninjatown where adorable and honorable Ninjas populate this vibrant yet peaceful place. However, after the mysterious eruption of a nearby volcano, Ninjatown is attacked by hordes of sinister enemies lead by Mr.Sunny skies, lush forest and rolling hills combine to form the land known as Ninjatown where adorable and honorable Ninjas populate this vibrant yet peaceful place. However, after the mysterious eruption of a nearby volcano, Ninjatown is attacked by hordes of sinister enemies lead by Mr. Demon, who, for reasons unknown, is bent on destruction. It is now time to use each of the Ninjas' unique skills and powers - even the Ol' Master Ninja comes out of retirement to fight off the evil and secure Ninjatown, one district at a time. [SouthPeak Games]… Expand"}, {"name": "MotoGP '06", "details_link": "https://www.metacritic.com/game/xbox-360/motogp-06", "publisher": "THQ", "release_date": "Jun 12 2006", "developers": ["Climax Group", "Climax Studios"], "platforms": "Xbox 360", "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/b3dfd841aaf353b3a0fa495d905ce7bd-98.jpg", "descriptions": "(Also known as \"MotoGP 2006\")  With the inclusion of the new 2006 bikes, riders and tracks, for the first time ever MotoGP fans will be able to recreate the brand new season as it unfolds. MotoGP Mode: The Official game of the MotoGP Championship. Features the new 2006 season bikes, riders(Also known as \"MotoGP 2006\")  With the inclusion of the new 2006 bikes, riders and tracks, for the first time ever MotoGP fans will be able to recreate the brand new season as it unfolds. MotoGP Mode: The Official game of the MotoGP Championship. Features the new 2006 season bikes, riders and tracks, as well as the full 2005 season. 17 GP tracks, including the new Shanghai, Laguna Seca, and Istanbul circuits. Extreme Mode: 17 Extreme Mode street tracks, including new Monterey Costal Highway. Redesigned Extreme mode tracks to increase speed and raceability. Online Gaming: Up to 16 riders per online race. Superb online features including Spectator Mode & Commentator Mode. [THQ]… Expand"}, {"name": "Like a Dragon: Ishin!", "details_link": "https://www.metacritic.com/game/pc/like-a-dragon-ishin!", "publisher": "Sega", "release_date": "Feb 21 2023", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/b247f50cb4c799f1eb3c5f320d7d9372-98.jpg", "descriptions": "In 1860s Kyo, a solemn samurai's fight for justice stands to change the course of Japan's history forever. Draw your blade and join the revolution in this heated historical adventure."}, {"name": "Saturnalia", "details_link": "https://www.metacritic.com/game/pc/saturnalia", "publisher": "Santa Ragione", "release_date": "Oct 27 2022", "developers": ["Santa Ragione"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/637c99532fec293b52d9223f7fd7fafa-98.jpg", "descriptions": "A game inspired and heavily influenced by the folklore of Sardinia, Italy (a region rich with unique traditions and culture) where you play as four characters, experiencing a deeply connected storyline that ties back to the haunting traditions of an ancient village.Die, and watch theA game inspired and heavily influenced by the folklore of Sardinia, Italy (a region rich with unique traditions and culture) where you play as four characters, experiencing a deeply connected storyline that ties back to the haunting traditions of an ancient village.Die, and watch the village reconfigure itself into a new form. Solve puzzles and open shortcuts to new areas with tools and items you find along the way, unlocking every piece of the story with different characters, each with its own power and suited for another aspect of exploration and investigation.With a limited supply of matches to light your way and darkness encroaching, can you find your way through the fog to reveal the truth? Or will you be engulfed by the secrets this town doesn't want you to know?… Expand"}, {"name": "MultiVersus", "details_link": "https://www.metacritic.com/game/playstation-5/multiversus", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jul 26 2022", "developers": ["Player First Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/df7fa5d24bac29d6e8cbca3d9567a0d9-98.jpg", "descriptions": "In MultiVersus, the Multiverse is at your fingertips as you battle it out in intense 2v2 matches. Up against Batman & Shaggy? Try using Bugs Bunny & Arya Stark! This platform fighter lets you play out your fantasy matchups in a fun co-op or head-to-head fight for supremacy."}, {"name": "A Little Golf Journey", "details_link": "https://www.metacritic.com/game/switch/a-little-golf-journey", "publisher": "Playtonic Friends", "release_date": "Oct 14 2021", "developers": ["Okidokico"], "platforms": ["PC", "Switch"], "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/6a139d0d1ec3b17b906b3cb9c4e6d28f-98.jpg", "descriptions": "A Little Golf Journey is a relaxing adventure golf experience played on beautiful diorama courses across a variety of destinations. Unlock secrets, discover treasure and take on challenges. Your journey awaits."}, {"name": "Alba: a Wildlife Adventure", "details_link": "https://www.metacritic.com/game/switch/alba-a-wildlife-adventure", "publisher": "Plug In Digital", "release_date": "Jun  9 2021", "developers": ["ustwo"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/65d64d2896af9e2810d79bfd59574c3a-98.jpg", "descriptions": "From the BAFTA-Award winning studio behind Monument Valley and Assemble with Care comes something entirely new.Join Alba as she visits her grandparents on a Mediterranean island. She is ready for a peaceful summer of wildlife exploration with her friend Ines, but when she sees an animal inFrom the BAFTA-Award winning studio behind Monument Valley and Assemble with Care comes something entirely new.Join Alba as she visits her grandparents on a Mediterranean island. She is ready for a peaceful summer of wildlife exploration with her friend Ines, but when she sees an animal in danger, she realises she needs to do something about it.This is truly a Mediterranean paradise if you ignore all the litter! From the idyllic beaches to the ancient castle overlooking the town a whole island is ready to be explored. With Ines and your grandfather - who is a total bird nerd - by your side, you can start the movement to save the island. Maybe even the world after that.… Expand"}, {"name": "Dandy Ace", "details_link": "https://www.metacritic.com/game/pc/dandy-ace", "publisher": "Neowiz", "release_date": "Mar 25 2021", "developers": ["Mad Mimic"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "Action RPG", "Linear"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/7eac221501a9f13687979d4276ad92d8-98.jpg", "descriptions": "Dandy Ace is an over the top fast-paced roguelike experience that follows a fabulous magician seeking to combine and use his magical cards while fighting and looting his way to defeat the Green-Eyed Illusionist, Lele, who has imprisoned him in a cursed mirror. While battling your way throughDandy Ace is an over the top fast-paced roguelike experience that follows a fabulous magician seeking to combine and use his magical cards while fighting and looting his way to defeat the Green-Eyed Illusionist, Lele, who has imprisoned him in a cursed mirror. While battling your way through Lele’s ever changing palace, combine different cards with more than a thousand possibilities, each with their own playstyles and powers. Every run provides new challenges and combinations for players to explore as they progress closer to Lele. … Expand"}, {"name": "Tales from the Borderlands: A Telltale Game Series", "details_link": "https://www.metacritic.com/game/switch/tales-from-the-borderlands-a-telltale-game-series", "publisher": "Take-Two Interactive", "release_date": "Mar 23 2021", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/39bef55128ad81c7518994598ce31531-98.jpg", "descriptions": "On the unforgiving world of Pandora a Hyperion 'suit' and a con artist embark on an adventure to recover cash they both think is theirs. In this award-winning universe created by Gearbox Software, experience the story of Rhys and Fiona, unwilling partners on a quest for greatness."}, {"name": "ScourgeBringer", "details_link": "https://www.metacritic.com/game/switch/scourgebringer", "release_date": "Oct 21 2020", "developers": ["Flying Oak Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/196a62aecfafec50f858a06f352fc997-98.jpg", "descriptions": "ScourgeBringer is a fast-paced free-moving roguelite platformer. Help Kyhra to explore the unknown and slash her way through ancient machines guarding the seal of her past, and maybe the redemption of humanity."}, {"name": "Foregone", "details_link": "https://www.metacritic.com/game/xbox-one/foregone", "publisher": "Big Blue Bubble Inc.", "release_date": "Oct 13 2020", "developers": ["Big Blue Bubble Inc."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/a6e09a315838172cbe0c950079c0e31f-98.jpg", "descriptions": "Foregone has players take on the role of the city of Calagan’s strongest Arbiter, tasked with investigating the sudden resurgence of an all-corrupting force known as the Harrow. The Arbiter will destroy legions of enemies, battle formidable bosses, and collect a wide array of upgradeableForegone has players take on the role of the city of Calagan’s strongest Arbiter, tasked with investigating the sudden resurgence of an all-corrupting force known as the Harrow. The Arbiter will destroy legions of enemies, battle formidable bosses, and collect a wide array of upgradeable loot as she embarks on a twisted journey to unravel the haunting truth behind the Harrow. The intense, combat-focused title features fluid pixel artwork, combining old-school visual influences with modern 3D animation technology.… Expand"}, {"name": "Superliminal", "details_link": "https://www.metacritic.com/game/playstation-4/superliminal", "publisher": "Pillow Castle Games", "release_date": "Jul  7 2020", "developers": ["Pillow Castle Games"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/92bb3e5ed147f71e099b9a931375477a-98.jpg", "descriptions": "Perception is reality. In this mind-bending first-person puzzler, you explore a surreal dream world and solve impossible puzzles using the ambiguity of depth and perspective."}, {"name": "Mr. Driller: Drill Land", "details_link": "https://www.metacritic.com/game/switch/mr-driller-drill-land", "publisher": "Bandai Namco Games", "release_date": "Jun 25 2020", "developers": ["Bandai Namco Games", "Infinity"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/435e3b489046a1920acee95eef50d068-98.jpg", "descriptions": "The popular action puzzle game “Mr. DRILLER DrillLand” makes its Western debut on the Nintendo Switch™! You’re invited to a secret amusement park known as “DrillLand” – 500 meters underground! Explore and conquer the five “attractions” with simple, yet exciting, gameplay that guests of allThe popular action puzzle game “Mr. DRILLER DrillLand” makes its Western debut on the Nintendo Switch™! You’re invited to a secret amusement park known as “DrillLand” – 500 meters underground! Explore and conquer the five “attractions” with simple, yet exciting, gameplay that guests of all ages can enjoy!\r Mr. DRILLER returns! – The first Mr. DRILLER game for the Nintendo Switch™ featuring updated graphics and HD cutscenes! \r Dig your way to victory! – Each of the five attractions in DrillLand features their own set of unique gameplay rules. Can you dig your way through each attraction and defeat the final boss?!\r  Competitive multiplayer modes! – Play with up to 4 players on one console—race to the finish or battle it out in “Free-for-All” or “Pairs”! \r Take it easy! – All new “Casual Mode” for those who want to enjoy digging through DrillLand at a leisurely pace! \r … Expand"}, {"name": "Wintermoor Tactics Club", "details_link": "https://www.metacritic.com/game/pc/wintermoor-tactics-club", "publisher": "Versus Evil", "release_date": "May  5 2020", "developers": ["EVC"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/31143bb493e010a5c4b27b85dc91d149-98.jpg", "descriptions": "Wintermoor Tactics Club is a story about surviving high school, with gameplay inspired by tactics RPGs and visual novels. It was hard enough for Alicia at the famed Wintermoor Academy before it erupted into a snowball war! Now her club's only hope is to transform from nerdy nobodies intoWintermoor Tactics Club is a story about surviving high school, with gameplay inspired by tactics RPGs and visual novels. It was hard enough for Alicia at the famed Wintermoor Academy before it erupted into a snowball war! Now her club's only hope is to transform from nerdy nobodies into fantasy heroes. Unravel a reality-bending mystery. Test your strategic mettle against an avalanche of colorful characters. And don't forget to make friends.… Expand"}, {"name": "Dauntless", "details_link": "https://www.metacritic.com/game/playstation-4/dauntless", "publisher": "Epic Games", "release_date": "May 21 2019", "developers": ["Phoenix Labs"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/6/c235620bf5ab81cf6d91ffa9e0b12a85-98.jpg", "descriptions": "As a Slayer, you are all that stands between your world and the Behemoths that seek to devour it. Take on boss-sized monsters, forge powerful weapons, and craft armour from the very creatures you slay — all in a massive, free-to-play online world."}, {"name": "Resident Evil", "details_link": "https://www.metacritic.com/game/switch/resident-evil", "publisher": "Capcom", "release_date": "May 21 2019", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/6670273f1da414afd70604ce69fb797e-98.jpg", "descriptions": "The game that defined the survival-horror genre is back! Check out the remastered HD version of Resident Evil.\r In 1998 a special forces team is sent to investigate some bizarre murders on the outskirts of Raccoon City. Upon arriving they are attacked by a pack of blood-thirsty dogs andThe game that defined the survival-horror genre is back! Check out the remastered HD version of Resident Evil.\r In 1998 a special forces team is sent to investigate some bizarre murders on the outskirts of Raccoon City. Upon arriving they are attacked by a pack of blood-thirsty dogs and are forced to take cover in a nearby mansion. But the scent of death hangs heavy in the air. Supplies are scarce as they struggle to stay alive.\r Graphics:\r *    More detailed graphics that retain the horror.\r*    The environments come alive with detail thanks to resolution upgrades and non-static 3D models.\r*    Post-processing effects like Bloom filters, which were not easy to do at the time of the original release, have been added to make the HD graphics even more realistic.\r*    High-Resolution Environments - We've increased the resolution of the background environments by recreating them with a mix of high-res static images, plus animated 3D models.\r*    Widescreen (16:9) is supported, so players can experience a greater sense of immersion.\rIn widescreen mode, the screen will scroll. The parts of the screen that get cut off on the top and bottom will scroll into view automatically depending on the character's position.\r*    You can switch the display mode during gameplay in real time.\r Sound: \r\r*    High-Quality Sound - The audio has been remastered to increase the sampling rate, and of course 5.1ch output is also now supported.\r*    You can play using the original control scheme or an alternate control scheme that lets you just push the analog stick to move in the direction you want to go.\r*    You can switch the control scheme during gameplay in real time.… Expand"}, {"name": "Castlevania Anniversary Collection", "details_link": "https://www.metacritic.com/game/xbox-one/castlevania-anniversary-collection", "publisher": "Konami", "release_date": "May 16 2019", "developers": ["Konami", "M2"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/41227c3eabf96db068382f2cd0c4fed5-98.jpg", "descriptions": "Classics that defined the Castlevania series.This KONAMI Castlevania Collection is designed to be a collection around the origins of the historic franchise.\nIncluded is a unique eBook that has details provided by developers, artists and other inspired by the Castlevania legacy.\nReleased asClassics that defined the Castlevania series.This KONAMI Castlevania Collection is designed to be a collection around the origins of the historic franchise.Included is a unique eBook that has details provided by developers, artists and other inspired by the Castlevania legacy.Released as part of the KONAMI 50th Anniversary celebration, now the best time to relive these timeless classics that helped define the platformer genre. Game List:Castlevania (1987/US, 1988/EU)Enter At Your Own Risk! If you think it's scary on the outside, wait till you see the basement.You're in for the longest night of your life. Ghosts, goblins, demons, wolves, bats creatures lurking around every corner. Better pick up a weapon or two, because when you finally meet the Count, you know he'll be going for the jugular. Castlevania Simon's Quest1988/US, 1990/EU) NESThis title tells the tale of Simon's subsequent adventures following the events in Castlevania.Unlike the previous installment, this one was developed as an action RPG. It maintains the action elements of its predecessor but mainly focuses on exploration and puzzle solving within a far more expansive game world. Castlevania Dracula's Curse (1990/US, 1992/EU) NESLed by the immortal Count Dracula, the greatest army of evil ever assembled is poised to bury mankind in a tomb of terror. Destroying His legions will be the supreme challenge for the mightiest warrior.100 years before Simon Belmont's birth, Dracula is young at heart and it will take more than a stake to penetrate his evil. Luckily, you command the role of Trevor - Simon's forefather and the original vampire slayer. Super Castlevania (1991/US, 1992/EU) SNESA century of Transylvanian tranquility is about to come to a shocking end. Once again the mortifying screams of helpless villagers shake the ground as they shrink from new horrors unleashed by the Duke of Darkness, Count Dracula. And this time he has a tombstone with your name on it, Simon Belmont. Castlevania The Adventure (1989/US, 1991/EU) GBThis is the first title in the series to be released on the Game Boy handheld game console.The variety of power-ups available for the whip added depth to the strategy of the gameplay. Castlevania Belmont's Revenge (1991/US, 1992/EU) GBFifteen years after vanquishing the evil Count Dracula, Christopher Belmont now faces a vampire swearing vengeance. Drac's back. And he's turned your son, Soleil Belmont, into a deadly demon to do his dirty deeds. To rescue him from the Count's clutches, you must first track him down through four creep packed castles. Castlevania Bloodlines (1994) GENUnlike the medieval setting of the other titles, this installment takes place during World War I. It introduces new elements to the series, such as the ability to choose one of two characters when starting the game.Huge bosses with dynamic, multi-jointed limbs that move erratically are just one of the many examples of the cutting-edge effects the game had for the time. Kid Dracula (1990/Japan exclusive) NESWith its laugh-inducing content and world full of gags, this spinoff is unlike anything else in the series. Players take control of Dracula's son (or so he says...), Kid Dracula, as he goes on a hilarious adventure filled with laughs that also satisfies as a full-fledged action game.… Expand"}, {"name": "Blazing Beaks", "details_link": "https://www.metacritic.com/game/switch/blazing-beaks", "publisher": "QubicGames", "release_date": "May 10 2019", "developers": ["Applava"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/89b472476b2b43b6349d1699763c44ce-98.jpg", "descriptions": "Blaze your way armed to the beak through hordes of mutants, monsters & other creepy creatures. But beware, collecting too many shiny things can hurt you in this unique rogue-lite game."}, {"name": "Mutant Year Zero: Road to Eden", "details_link": "https://www.metacritic.com/game/xbox-one/mutant-year-zero-road-to-eden", "publisher": "Funcom", "release_date": "Dec  4 2018", "developers": ["High Voltage Software", "The Bearded Ladies Consulting"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/3ca2b73978a805d2743cc0f7948aaa0b-98.jpg", "descriptions": "A tactical adventure game combining the turn-based combat of XCOM with story, exploration, stealth, and strategy. Take control of a team of Mutants navigating a post-human Earth. Created by a team including former HITMAN leads and the designer of PAYDAY."}, {"name": "The Jackbox Party Pack 5", "details_link": "https://www.metacritic.com/game/playstation-4/the-jackbox-party-pack-5", "publisher": "Jackbox Games, Inc.", "release_date": "Oct 16 2018", "developers": ["Jackbox Games", "Inc."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/9192d36da51251ad3d0385e1829b0725-98.jpg", "descriptions": "It’s the biggest Party Pack yet with five party-saving games, including the return of the classic pop culture trivia mashup, You Don’t Know Jack. Use phones or tablets as controllers and play with up to eight players, plus an audience of up to 10,000."}, {"name": "Mega Man 11", "details_link": "https://www.metacritic.com/game/switch/mega-man-11", "publisher": "Capcom", "release_date": "Oct  2 2018", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/de076ae6d8b93224d45a65b73aeb5759-98.jpg", "descriptions": "Thirty years ago, in 1987, a super robot named Mega Man was created. In 2018 after 30 years of unforgettable adventures the fight for everlasting peace continues! The tight action-platformer gameplay that made the series a success is alive and well. To save the day, the Blue Bomber mustThirty years ago, in 1987, a super robot named Mega Man was created. In 2018 after 30 years of unforgettable adventures the fight for everlasting peace continues! The tight action-platformer gameplay that made the series a success is alive and well. To save the day, the Blue Bomber must battle Robot Masters and take their powerful weapons for himself, which now changes the hero's appearance with new levels of detail. A new, vivid visual style refreshes the series' iconic colorfulness, combining hand-drawn environments with detailed, 3D character models.… Expand"}, {"name": "Octahedron", "details_link": "https://www.metacritic.com/game/playstation-4/octahedron", "publisher": "Square Enix", "release_date": "Mar 20 2018", "developers": ["Demimonde"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/cfc74c9f66b17a32488dcebc28bc89f5-98.jpg", "descriptions": "OCTAHEDRON is a precision vertical action game about creating your own platforms. Ascend and escape strange subterranean world Veetragoul, and experience an otherworldly psychedelic adventure. To conquer and master each of the handcrafted levels, you must get into the flow of the pumping,OCTAHEDRON is a precision vertical action game about creating your own platforms. Ascend and escape strange subterranean world Veetragoul, and experience an otherworldly psychedelic adventure. To conquer and master each of the handcrafted levels, you must get into the flow of the pumping, atmospheric soundtrack, as enemies and traps move along with the rhythm. Discover new obstacles, adversaries and mechanics in every level, with clever gameplay that is easy to learn but difficult to master. Unlock powerful offensive abilities for your platform and fight back against Veetragoul’s peculiar foes. With its intuitive controls and tight and well-developed gameplay, OCTAHEDRON is a challenging and unique action game set in a mysterious neon world.… Expand"}, {"name": "Style Savvy: Styling Star", "details_link": "https://www.metacritic.com/game/3ds/style-savvy-styling-star", "publisher": "Nintendo", "release_date": "Dec 25 2017", "developers": ["Nintendo", "syn Sophia"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/f64f2d5add2179782fe51c9c4b3fbf2f-98.jpg", "descriptions": "Also known as \"Nintendo Presents: New Style Boutique 3 - Styling Star\""}, {"name": "The Legend of Heroes: Trails of Cold Steel", "details_link": "https://www.metacritic.com/game/pc/the-legend-of-heroes-trails-of-cold-steel", "publisher": "XSEED Games", "release_date": "Aug  2 2017", "developers": ["Falcom"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/6d489ff695fc7363ee0d12c7a52f6b8d-98.jpg", "descriptions": "Among the nations on the Zemurian continent, the mighty Erebonian Empire has been quick to stake its claim militarily; yet politically, ugly bouts of internal conflict between the upper class and commoners struggling to rise to power have been steadily intensifying with each passing month.Among the nations on the Zemurian continent, the mighty Erebonian Empire has been quick to stake its claim militarily; yet politically, ugly bouts of internal conflict between the upper class and commoners struggling to rise to power have been steadily intensifying with each passing month. The Noble and Reformist Factions have been none too kind to one another over the years, and tensions between the two only stand to worsen if compromises aren't reached in the very near future.\r Rean Schwarzer, like any other citizen of the Imperial nation, is no stranger to these rising conflicts: the class system has been deeply interwoven into the tapestry of Erebonian culture since the days of old. As a seventeen-year-old student preparing for his new life at Thors Military Academy, however, he notices that his crimson uniform differs from the standard outfits issued to his peerstypically green for commoners, and white for nobles.\r Enter, Class VII of Thors Military Academy. For the first time in the prestigious academy's history, rank means nothing and skill means everything. With nine hand-picked students of various backgrounds and abilities, Rean included, Class VII readies itself to dive deep into the political quagmire that threatens not only them, but the very foundations of the Empire.… Expand"}, {"name": "BioShock: The Collection", "details_link": "https://www.metacritic.com/game/pc/bioshock-the-collection", "publisher": "2K Games", "release_date": "Sep 16 2016", "developers": ["2K Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "First-Person", "Arcade"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/7c159f9b267d7aa62287282cec347dfd-98.jpg", "descriptions": "Return to the cities of Rapture and Columbia and experience the award-winning BioShock franchise like never before, beautifully remastered in 1080p. BioShock: The Collection contains all single-player content from BioShock, BioShock 2, and BioShock Infinite, all single-player add-on content,Return to the cities of Rapture and Columbia and experience the award-winning BioShock franchise like never before, beautifully remastered in 1080p. BioShock: The Collection contains all single-player content from BioShock, BioShock 2, and BioShock Infinite, all single-player add-on content, the Columbias Finest pack, and Directors Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson.\r BioShock is a shooter unlike any you've ever played, loaded with weapons and tactics never seen. You'll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you'll also be forced to genetically modify your DNA to create an even more deadly weapon: you. \r*Museum of Orphaned Concepts\r*Challenge Rooms\r BioShock 2\rSet approximately 10 years after the events of the original BioShock, the halls of Rapture once again echo with sins of the past. Along the Atlantic coastline, a monster has been snatching little girls and bringing them back to the undersea city of Rapture. Players step into the boots of the most iconic denizen of Rapture, the Big Daddy, as they travel through the decrepit and beautiful fallen city, chasing an unseen foe in search of answers and their own survival.\r*Minervas Den\r*Protector Trials\r BioShock Infinite\rBring us the girl, wipe away the debt. The year is 1912. Deep in debt, Booker DeWitt has only one opportunity for a clean slate: rescue Elizabeth, a mysterious girl imprisoned since childhood in the flying city of Columbia. \r*Clash in the Clouds\r*Burial at Sea 1&2\r*Columbias Finest Pack\r Features\r *Remastered in 1080p.\r*BioShock main game and all single player DLC.\r*BioShock 2 main game and all single player DLC.\r*BioShock Infinite main game and all single player DLC.\r*Directors Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson… Expand"}, {"name": "Samorost 3", "details_link": "https://www.metacritic.com/game/pc/samorost-3", "publisher": "Amanita Design", "release_date": "Mar 24 2016", "developers": ["Amanita Design"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/3508ce040b6a92f8087900496497c2d2-98.jpg", "descriptions": "As Samorost 3 begins, a little space gnome finds a strange magical flute that falls from the sky. He uses the instrument's powers to travel to the cosmos in search of its origins, scouring the alien landscapes of five planets and four moons to solve clever mysteries along the way. Each ofAs Samorost 3 begins, a little space gnome finds a strange magical flute that falls from the sky. He uses the instrument's powers to travel to the cosmos in search of its origins, scouring the alien landscapes of five planets and four moons to solve clever mysteries along the way. Each of Samorost 3’s organically inspired biomes presents a uniquely colorful world full of hidden surprises and achievements for keen players to discover.… Expand"}]