[{"name": "Tomb Raider: The Prophecy", "details_link": "https://www.metacritic.com/game/game-boy-advance/tomb-raider-the-prophecy", "publisher": "Ubisoft", "release_date": "Nov 12 2002", "developers": ["Ubisoft Milan"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 66, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/0/ba4664adaea2955b28e1225cad88fbb0-98.jpg", "descriptions": "Tomb Raider: The Prophecy delivers the full Tomb Raider experience with no compromises."}, {"name": "Enclave", "details_link": "https://www.metacritic.com/game/xbox/enclave", "publisher": "Conspiracy Entertainment", "release_date": "Jul 29 2002", "developers": ["Starbreeze"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/d63964c6b5fe92cb39d2d2bab8a834c3-98.jpg", "descriptions": "In the fantasy world of Enclave, a bottomless rift divides the people of the Celenheim and the Outlands.  Skirmishes along the border have become more and more frequent and it's only a matter of time before these altercations turn into a full-scale war.  Now you must choose whether to leadIn the fantasy world of Enclave, a bottomless rift divides the people of the Celenheim and the Outlands.  Skirmishes along the border have become more and more frequent and it's only a matter of time before these altercations turn into a full-scale war.  Now you must choose whether to lead the desperate people of Celenheim and save them from destruction, or ally with the dark hordes of the Outlands and overrun the Enclave.  Whatever you decision, get ready for intense medieval combat featuring different playable characters, five mighty end bosses, and dozens of weapons, objects, and magical items.… Expand"}, {"name": "Home Run King", "details_link": "https://www.metacritic.com/game/gamecube/home-run-king", "publisher": "Sega", "release_date": "Mar 18 2002", "developers": ["Wow Entertainment"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/60a77407a3e76afc512a9582b6b24b77-98.jpg", "descriptions": "From the first pitch on Opening Day to the final out of the World Series, Home Run KING brings all the fun and excitement of Major League Baseball to the Nintendo GameCube."}, {"name": "Combat Command 2: Danger Forward!", "details_link": "https://www.metacritic.com/game/pc/combat-command-2-danger-forward!", "publisher": "Shrapnel Games", "release_date": "Dec 17 2000", "developers": ["Boku Strategy Games"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Strategy", "Turn-Based", "Historic", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/585155d7b788decaf5b67895328fa33f-98.jpg", "descriptions": "A unique game system that authentically recreates the most exciting engagements of WWII. Emphasizing command control and combined arms, the first volume of the series, Danger Forward, focuses on the Mediterranean and Western Front, from 1940-1945.  [Shrapnel Games]"}, {"name": "Disney's The Emperor's New Groove", "details_link": "https://www.metacritic.com/game/playstation/disneys-the-emperors-new-groove", "publisher": "SCEA", "release_date": "Nov 13 2000", "developers": ["Disney Interactive"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/5fa7ca33dcdeaa13930e7684fc55d129-98.jpg", "descriptions": "Take on, self-absorbed Emperor named Kuzco. Add a devious royal advisor named Yzma, her brawny assistant Kronk and their potion that turns Kuzco into a llama. Introduce a good-hearted peasant named Pacha, to help Kuzco. And, what do you get? Al-paca trouble!"}, {"name": "Harvest Moon: Tree of Tranquility", "details_link": "https://www.metacritic.com/game/wii/harvest-moon-tree-of-tranquility", "publisher": "Natsume", "release_date": "Sep 30 2008", "developers": ["Marvelous Entertainment"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Breeding/Constructing", "General", "Management", "Breeding/Constructing", "Business / Tycoon"], "meta_score": 65, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/6f8f739262e253b809a0ecbc9bde23c0-98.jpg", "descriptions": "In Harvest Moon: Tree of Tranquility for the Nintendo Wii, you find yourself in a troubled island town which once prospered with life and energy, but is now in serious trouble. The mystical Mother Tree that once watched over the island has disappeared, and the Harvest Goddess is nowhere toIn Harvest Moon: Tree of Tranquility for the Nintendo Wii, you find yourself in a troubled island town which once prospered with life and energy, but is now in serious trouble. The mystical Mother Tree that once watched over the island has disappeared, and the Harvest Goddess is nowhere to be found! The island has lost its connection with nature and the inhabitants don't know what to do - it's up to you to save the island! You must help to rebuild the island by tending to the earth, befriending and raising animals, nurturing friendships, and creating a family. When the giant Mother Tree is reborn, the Harvest Goddess will return and bring prosperity to the island once again. Long-time Harvest Moon fans as well as new players will find an exciting, involving storyline and plenty of activities including cultivating crops, caring for animals, and participating in festivals. All-new controls for the Nintendo Wii Remote give players the chance to feel like they're really farming! [Natsume]… Expand"}, {"name": "Robotron: 2084", "details_link": "https://www.metacritic.com/game/xbox-360/robotron-2084", "publisher": "Midway", "release_date": "Dec 16 2005", "developers": ["Digital Eclipse"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/746a35b54b920ad1382a19bca88e1ec9-98.jpg", "descriptions": "[Xbox Live Arcade]  In 2084, man creates a species of super-advanced cyborgs known as Robotrons. Recognizing the imperfect nature of their creators, the Robotrons conclude that the inefficient human race must be exterminated. In Robotron: 2084, only you and a single family of clones remain.[Xbox Live Arcade]  In 2084, man creates a species of super-advanced cyborgs known as Robotrons. Recognizing the imperfect nature of their creators, the Robotrons conclude that the inefficient human race must be exterminated. In Robotron: 2084, only you and a single family of clones remain. If mankind is to survive, you must destroy the Grunts, Brains, Enforcers, and Tanks - but avoid the indestructible Hulks at all cost. Can you withstand wave after wave of android invasion and rescue Mommy, Daddy, and Mikey... before it's too late? [Xbox.com]… Expand"}, {"name": "Nintendo Pocket Football Club", "details_link": "https://www.metacritic.com/game/3ds/nintendo-pocket-football-club", "publisher": "Nintendo", "release_date": "Apr 17 2014", "developers": ["ParityBit"], "platforms": "3DS", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/bf5d45c678d7148646dfe6fd5ede9b1c-98.jpg", "descriptions": "Head up your own football team and shoot for the top. Nintendo Pocket Football Club puts you in the managers seat at your very own football club, only on Nintendo eShop on Nintendo 3DS. Can you keep the crowds chanting and guide your pint-sized players from the lower leagues to the wondersHead up your own football team and shoot for the top. Nintendo Pocket Football Club puts you in the managers seat at your very own football club, only on Nintendo eShop on Nintendo 3DS. Can you keep the crowds chanting and guide your pint-sized players from the lower leagues to the wonders of the world stage? As manager, train up your players and choose your tactics wisely to make the most of their abilities. Once youre satisfied, send your team forth and watch your decisions play out in matches packed with action  but dont be afraid to alter your approach if it all starts to unravel before your eyes. Delve deep and show plenty of skill on the sidelines and you could lead them all the way to the glorious treble of the Pro League 1, the Federation Cup and the European Challenge Cup. With enough work, you could even bring the World Club Classic back home.… Expand"}, {"name": "New Play Control! Mario Power Tennis", "details_link": "https://www.metacritic.com/game/wii/new-play-control!-mario-power-tennis", "publisher": "Nintendo", "release_date": "Mar  9 2009", "developers": ["Camelot Software Planning"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/832077ac27d9313786c78aa0be01858a-98.jpg", "descriptions": "The Mushroom Kingdom has hosted tennis tournaments before, but never one as explosive as this one. The wild multiplayer action of the smash Nintendo 64 hit, Mario Tennis, returns with even more powerful shots and new, character-specific power-ups guaranteed to make for the craziest matchesThe Mushroom Kingdom has hosted tennis tournaments before, but never one as explosive as this one. The wild multiplayer action of the smash Nintendo 64 hit, Mario Tennis, returns with even more powerful shots and new, character-specific power-ups guaranteed to make for the craziest matches ever. Everyone's favorite Mushroom Kingdom characters are here! Donkey Kong and Bowser can hit insanely powerful Megaton Balls, finesse players like Shy Guy can use instant Tornado Returns and defensive masters like Luigi have all kinds of tricks in their bags. Players of all ages can pick up the game and instantly start whacking tennis balls around and yet a deep level of skill awaits those willing to master it. Build up more and more skill points as you play to use stronger and stronger shots with all kinds of spin. [Nintendo]… Expand"}, {"name": "Immortals Fenyx Rising: Myths of the Eastern Realm", "details_link": "https://www.metacritic.com/game/pc/immortals-fenyx-rising-myths-of-the-eastern-realm", "publisher": "Ubisoft", "release_date": "Mar 25 2021", "developers": ["Ubisoft Quebec"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "Open-World"], "meta_score": 65, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/6a0a55fdb486b45cfd3584081adcd9c4-98.jpg", "descriptions": "Myths of the Eastern Realm introduces a new open world, characters, and story inspired by Chinese mythology, and centering on a new hero named Ku."}, {"name": "NHL 2K9", "details_link": "https://www.metacritic.com/game/wii/nhl-2k9", "publisher": "Take-Two Interactive", "release_date": "Sep  8 2008", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Sim", "Sim"], "meta_score": 65, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/1/f12416de1890eb6f6c33554916681f42-98.jpg", "descriptions": "Wii Remote Shooting – Execute wrist shots with the flick of the Wii Remote or put some power into shots by holding the B button while flicking the Wii Remote to blast a slapper. Wii Remote Fighting – Adding a never-before-seen layer of fun to hockey video games, NHL 2K9 features on-iceWii Remote Shooting – Execute wrist shots with the flick of the Wii Remote or put some power into shots by holding the B button while flicking the Wii Remote to blast a slapper. Wii Remote Fighting – Adding a never-before-seen layer of fun to hockey video games, NHL 2K9 features on-ice showdowns. Balance with the Nunchuk and punch with the Wii Remote to get your opponent off their feet. Precision Passing / Chain Passing – Exclusive to Wii, take the guesswork out of which player is going to receive a pass by selecting players with the Wii Remote cursor. One-timers, give-and-go and tic-tac-toe passing are executed by selecting multiple players prior to pressing the pass or A button. Wii Remote Goaltending – Gesture-based goaltending allows fans to get between the pipes and flash the leather. Even take control when it counts the most -- in shootouts! [2K Sports]… Expand"}, {"name": "Neo Contra", "details_link": "https://www.metacritic.com/game/playstation-2/neo-contra", "publisher": "Konami", "release_date": "Oct 19 2004", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/6753146c5b9160f5102d94a61ec71457-98.jpg", "descriptions": "Neo Contra integrates all of the classic shooting gameplay elements that have come to define this renowned series while bringing the experience to a 3D world. Longtime fans and newcomers to the franchise will find classic, fast-paced action as they battle huge bosses who will stop at nothingNeo Contra integrates all of the classic shooting gameplay elements that have come to define this renowned series while bringing the experience to a 3D world. Longtime fans and newcomers to the franchise will find classic, fast-paced action as they battle huge bosses who will stop at nothing to keep them from completing their mission. Players will need quick reflexes to dodge enemy attacks as well as access an arsenal of powerful weapons to defeat deadly enemies. Set in the distant future, Neo Contra continues the adventure of the legendary hero, Bill Rizer, and introduces a visually striking new character to the series - Genbei Jaguer Yagyu, a mysterious Samurai. In addition to stylized characters, players will also experience realistic environmental destruction and explosions as they make their way through extremely detailed stages. The game's incredible CG cinematic sequences will also enhance its engaging storyline and overall dynamic visual design. [Konami]… Expand"}, {"name": "The Dark Pictures Anthology: Little Hope", "details_link": "https://www.metacritic.com/game/xbox-one/the-dark-pictures-anthology-little-hope", "publisher": "Bandai Namco Games", "release_date": "Oct 30 2020", "developers": ["Supermassive Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 65, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/89d0e967f3e08d8804e42d56f2b94ad0-98.jpg", "descriptions": "Abandoned and all alone, 4 college students and their teacher become stranded in an isolated town miles from anywhere after their bus crashes in bad weather. Trapped by a mysterious fog in the town of Little Hope, they search desperately for a means of escape whilst visions from the pastAbandoned and all alone, 4 college students and their teacher become stranded in an isolated town miles from anywhere after their bus crashes in bad weather. Trapped by a mysterious fog in the town of Little Hope, they search desperately for a means of escape whilst visions from the past haunt them from the shadows. \r\rKey features:\r WELCOME TO LITTLE HOPE\rWitness terrifying visions of the past, haunted by the events of the XVIIth century Andover Witch Trials.\r SAVE YOUR SOULS...\rEscape the nightmarish apparitions that relentlessly pursue your cast\r DON'T PLAY ALONE\rPlay online with a friend or up to 5 friends offline, share your story and cooperate wisely to save your cast.\r Abandon Hope All who enter here… Expand"}, {"name": "Unchained Blades", "details_link": "https://www.metacritic.com/game/3ds/unchained-blades", "publisher": "XSEED Games", "release_date": "Jan  3 2013", "developers": ["FuRyu"], "platforms": "3DS", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/cd1d452196a1f9c33eb6a539bdc08cc7-98.jpg", "descriptions": "Though Fang is already renowned as the ruthless and feared Dragon Emperor, his lust for strength brings him to the doorsteps of the great Goddess Clunea.\r When he arrogantly demands that she find him a fitting opponent to defeat, the offended creator banishes him to crawl upon the groundThough Fang is already renowned as the ruthless and feared Dragon Emperor, his lust for strength brings him to the doorsteps of the great Goddess Clunea.\r When he arrogantly demands that she find him a fitting opponent to defeat, the offended creator banishes him to crawl upon the ground in a weakened state. Now Fang must traverse dangerous living temples of the Goddess' creation, known as Titans, in order to meet his maker once again and exact his revenge. But he cannot do it alone...… Expand"}, {"name": "Ferrari Challenge Trofeo Pirelli", "details_link": "https://www.metacritic.com/game/ds/ferrari-challenge-trofeo-pirelli", "publisher": "System 3", "release_date": "Aug 26 2008", "developers": ["Firebrand Games"], "platforms": ["PlayStation 2", "PlayStation 3", "DS"], "genres": ["Driving", "Racing", "Simulation", "Other", "Other", "GT / Street", "Automobile"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/a3470769a0ed80cfbfb9be010361628e-98.jpg", "descriptions": "The DS version features wireless play for up to 4 players game sharing with only one cartridge and up to 8 players using a cartridge in each system. Lifelike artificial intelligence - opponents’ reactive decisions generate a naturalistic driving behaviour on an unprecedented level. VariousThe DS version features wireless play for up to 4 players game sharing with only one cartridge and up to 8 players using a cartridge in each system. Lifelike artificial intelligence - opponents’ reactive decisions generate a naturalistic driving behaviour on an unprecedented level. Various unlockable tracks from the official European Ferrari Challenge series including Silverstone, Monza, Hockenheim, Mugello and many more, including the Ferrari test track at Fiorano. Features all the teams and cars of the series, including a mixture of Ferrari Challenge cars, such as the 355, the 360, the FXX, the 430 Challenge and GT cars, like the 575GT. Numerous game modes including Challenge, Arcade, Quick Race, Time Trial and Ferrari Collector Card Battle. Detailed environmental effects including dust, smoke, water sprays and splashes and reflective and shiny surfaces. [System 3]… Expand"}, {"name": "Stronghold: Crusader II", "details_link": "https://www.metacritic.com/game/pc/stronghold-crusader-ii", "publisher": "FireFly Studios", "release_date": "Sep 22 2014", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Historic", "Strategy", "Real-Time", "General", "Historic"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/d41b0a6c3f1f2f746ec9973001993f33-98.jpg", "descriptions": "When it was first released in 2002 Stronghold Crusader put a unique twist on the gameplay of the original Stronghold by focusing on skirmish gameplay and replayability above all else. Recently Stronghold Crusader HD gave the game a new lease of life, offered as a free update for existingWhen it was first released in 2002 Stronghold Crusader put a unique twist on the gameplay of the original Stronghold by focusing on skirmish gameplay and replayability above all else. Recently Stronghold Crusader HD gave the game a new lease of life, offered as a free update for existing owners of the game and made available for purchase on GOG and Steam. Crusader 2 has been on the mind of Lead Designer Simon Bradbury since the release of Stronghold Crusader in 2002. It is only now, having become a fully independent studio, that Firefly feel comfortable delivering a worthy sequel to their fans’ favourite game. As a developer their mission is to recapture the addictive, intense gameplay that made the original Crusader a classic. Players can also expect new visuals, a reworked battle interface, new AI characters, environmental threats, new units and real-time physics. … Expand"}, {"name": "Forge (2012)", "details_link": "https://www.metacritic.com/game/pc/forge-2012", "publisher": "Dark Vale Games", "release_date": "Dec  4 2012", "developers": ["Dark Vale Games"], "platforms": "PC", "genres": ["Action", "Role-Playing", "General", "General", "Massively Multiplayer"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/65a4799a54e8692016912b57cfd0d996-98.jpg", "descriptions": "In FORGE, a malicious being named The Devourer has swallowed the great pantheon of gods. Seeking escape, the trapped gods have deceptively turned great warriors into zealous adherents and placed them on a faceless world called FORGE, where every champion's death feeds the immortals power.In FORGE, a malicious being named The Devourer has swallowed the great pantheon of gods. Seeking escape, the trapped gods have deceptively turned great warriors into zealous adherents and placed them on a faceless world called FORGE, where every champion's death feeds the immortals power.  Choosing one of five unique warrior classes, the player must battle head-to-head against others in a bid to free their god from the clutches of The Devourer.  Armed with a set of powerful and unique abilities as well as a mystical and deadly ally, each warrior must overcome the varied challenges of FORGE where every victory is a sacrifice and every sacrifice brings them one step closer to freedom.… Expand"}, {"name": "Armored Core 4", "details_link": "https://www.metacritic.com/game/playstation-3/armored-core-4", "publisher": "Sega", "release_date": "Mar 20 2007", "developers": ["From Software"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/10547ea1fd0fdbf1e96dd42effc17cd1-98.jpg", "descriptions": "Armored Core 4 reinvigorates the brand by offering an all-new storyline, new environments, and online capability. The 10th anniversary of the acclaimed franchise is punctuated with a leap to next-generation platforms. Multiplayer functionality allows up to eight players to battle online.Armored Core 4 reinvigorates the brand by offering an all-new storyline, new environments, and online capability. The 10th anniversary of the acclaimed franchise is punctuated with a leap to next-generation platforms. Multiplayer functionality allows up to eight players to battle online. Join one of six factions specializing in different aspects of battle. 30 missions played out in detailed futuristic 3D environments. Fly through canyons and rip through cities battling multiple enemies. Deploy \"Quick Boost\" and \"Over Boost\" features for precise explosive movement and precision control of AC units. Engage \"Primal Armor\" the all-new defense shield that adjusts its strength according to specific battle conditions. [Sega]… Expand"}, {"name": "Saints Row", "details_link": "https://www.metacritic.com/game/xbox-series-x/saints-row", "publisher": "Deep Silver", "release_date": "Aug 23 2022", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "num_players": "2 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 65, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/4/d5bf6b959bd28d693b69216a82b3a9ab-98.jpg", "descriptions": "Developed by Deep Silver Volition, Saints Row is a complete reboot and features a brand new setting, brand new characters and a brand new tone, all refreshed for today’s gamer. Saints Row is set in Santo Ileso, a vibrant fictional city in the American Southwest and one of the most varied andDeveloped by Deep Silver Volition, Saints Row is a complete reboot and features a brand new setting, brand new characters and a brand new tone, all refreshed for today’s gamer. Saints Row is set in Santo Ileso, a vibrant fictional city in the American Southwest and one of the most varied and diverse city locations ever built for a Saints Row game. Three friends join you on your incredible journey to become self made. Neenah, the driver and mechanic with Los Panteros, Kevin who is a DJ and a member of The Idols, and Eli who came to Santo Ileso to make his fortune as an entrepreneur. You play as The Boss and get to decide who you want to be, while building your very own criminal empire. Along the way you must take on three brutal enemy factions who currently control Santo Ileso: Los Panteros are the muscle and the power, The Idols are motivated by fame and notoriety, and Marshall Defense Technologies are a private military conglomerate. Players will be able to enjoy seamless and untethered two-player co-op together, whether they’re playing on the PS4 or PS5.  In terms of PS5 specifics, we’re implementing features for next-generation consoles and can’t wait to divulge details closer to the launch of the game. … Expand"}, {"name": "Serious Sam 4: Planet Badass", "details_link": "https://www.metacritic.com/game/playstation-5/serious-sam-4-planet-badass", "publisher": "Devolver Digital", "release_date": "Dec 22 2021", "developers": ["Croteam"], "platforms": ["PC", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/7e998c6264190d1562a1665504ad135b-98.jpg", "descriptions": "Humanity is under siege as the full force of Mental's hordes spread across the world, ravaging what remains of a broken and beaten civilization. The last remaining resistance to the invasion is the Earth Defense Force led by Sam \"Serious\" Stone and his heavily-armed squad of misfitHumanity is under siege as the full force of Mental's hordes spread across the world, ravaging what remains of a broken and beaten civilization. The last remaining resistance to the invasion is the Earth Defense Force led by Sam \"Serious\" Stone and his heavily-armed squad of misfit commandos.Croteam returns with a high-powered prequel to the Serious Sam series that scales up chaos to unprecedented levels. The classic Serious Sam formula is revamped by putting an unstoppable arsenal up against an unimaginable number of enemies that requires players to circle-strafe and backpedal-blast their way out of impossible situations.… Expand"}, {"name": "Stronghold: Warlords", "details_link": "https://www.metacritic.com/game/pc/stronghold-warlords", "publisher": "FireFly Studios", "release_date": "Mar  9 2021", "developers": ["FireFly Studios"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/72ab278c1a32fbee32211522d955d5f0-98.jpg", "descriptions": "Besiege Great Khans, Imperial warlords and Shōgun commanders in Stronghold: Warlords, the latest 'castle sim' from Firefly Studios. Command AI warlords across the battlefield as you build a castle economy and new gunpowder-fuelled siege engines."}, {"name": "Ever Forward", "details_link": "https://www.metacritic.com/game/pc/ever-forward", "publisher": "Pathea Games", "release_date": "Aug 13 2020", "developers": ["Pathea Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/5d6e753da27963c7ff0c34a211b02a9a-98.jpg", "descriptions": "A girl trapped in a strange world somewhere between reality and imagination. Help her find her way in this adventure puzzle game."}, {"name": "Galaxy Champions TV", "details_link": "https://www.metacritic.com/game/switch/galaxy-champions-tv", "publisher": "Silesia Games", "release_date": "Oct  3 2019", "developers": ["aQuadiun"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 65, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/3/899665cf118f13cc62f83a6df6b5453b-98.jpg", "descriptions": "Get powerful weapons and power-ups, kill huge amount of enemies, level up, unlock upgrades and beat all the bosses to become the champion of the most violent TV show of all time! Are you ready to become the Champ?!"}, {"name": "Laserlife", "details_link": "https://www.metacritic.com/game/playstation-4/laserlife", "publisher": "Choice Provisions", "release_date": "Sep 22 2015", "developers": ["Choice Provisions"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Rail"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/4ac139cf62c5c180ef562ca4def8da1a-98.jpg", "descriptions": "Laserlife is an interactive biography focusing on a dead astronaut floating through deep space who is discovered by future intelligent beings who have no notion of humankind."}, {"name": "Aero Racer", "details_link": "https://www.metacritic.com/game/psp/aero-racer", "publisher": "Halfbrick Studios", "release_date": "Mar 11 2010", "developers": ["Halfbrick Studios"], "platforms": "PSP", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/be2d26ef18bba62bd73b2371d21f6016-98.jpg", "descriptions": "[PSP Minis]  Rocket Racing challenges your reflexes and daring across 24 levels in Grand Prix, Challenge and Quick Race events."}, {"name": "Diner Dash", "details_link": "https://www.metacritic.com/game/playstation-3/diner-dash", "publisher": "Big Fish Games", "release_date": "Nov 24 2009", "developers": ["GameLab"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/25b0e3e2d7bccff39811a0d795d1eca9-98.jpg", "descriptions": "[Playstation Network]  In Diner Dash, you play as the restaurant entrepreneur Flo, out to work her way up to the top of the food-service industry."}, {"name": "Cooking Mama 3: Shop & Chop", "details_link": "https://www.metacritic.com/game/ds/cooking-mama-3-shop-chop", "publisher": "Majesco Games", "release_date": "Oct 20 2009", "developers": ["Taito Corporation", "Office Create"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "General", "General", "Virtual", "Career"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/cf734122650c79f17c755c2d43da2cd9-98.jpg", "descriptions": "Mama is back, and she's traded in the trowel for the truffle in Cooking Mama 3: Shop & Chop! The stylus becomes the ultimate cooking utensil as players chop, grate, slice, stir, spread, sprinkle, roll and more through over 200 mini-games. The new box art and 10 screens included with thisMama is back, and she's traded in the trowel for the truffle in Cooking Mama 3: Shop & Chop! The stylus becomes the ultimate cooking utensil as players chop, grate, slice, stir, spread, sprinkle, roll and more through over 200 mini-games. The new box art and 10 screens included with this email show Mama making candy apples, donuts and more - a mere fraction of the new recipes available throughout the game. Additionally, six gameplay modes keep players on their feet, as they learn from mistakes in \"Let's Cook\" mode,  compete with up to 3 friends using local wi-fi play in \"Time Challenge\" mode, and keep a scrapbook of favorite dishes in \"Picture Diary\" mode. While progressing through the game, recipes go from simple to difficult and dishes advance from small to large, but Mama awards players who learn with bronze, silver or gold medals based on the quality of their cooking! [Majesco]… Expand"}, {"name": "Little Witch Nobeta", "details_link": "https://www.metacritic.com/game/playstation-4/little-witch-nobeta", "publisher": "Idea Factory", "release_date": "Mar  7 2023", "developers": ["Pupuya Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/46cc913357a14f9afbd756231b05c8ba-98.jpg", "descriptions": "Nobeta, the little wonder, came to the castle alone to solve the mystery of her own life. Constantly challenging powerful crafted souls, she learned all kinds of magical abilities and befriended a mysterious little black cat.What secrets hide in the depths of the castle? \n\nThe Little WitchNobeta, the little wonder, came to the castle alone to solve the mystery of her own life. Constantly challenging powerful crafted souls, she learned all kinds of magical abilities and befriended a mysterious little black cat.What secrets hide in the depths of the castle? The Little Witch Nobeta is a 3D action shooting game. Players will explore ancient, unknown castles and use different magic elements to fight against the soul!The game uses a comfortable Japanese art style, but the battles are quite challenging despite its cute looks.Underestimating your foes will lead to troublesome encounters. You must discover enemies' weaknesses and learn the precise time to dodge attacks in order to gain the advantage in combat.… Expand"}, {"name": "Ash of Gods: Redemption", "details_link": "https://www.metacritic.com/game/playstation-4/ash-of-gods-redemption", "publisher": "Buka Entertainment", "release_date": "Jan 31 2020", "developers": ["AurumDust"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/1/bd812ebd2d9b648b3d8598f11485b93f-98.jpg", "descriptions": "Ash of Gods is a tactical turn-based RPG with rich lore and detailed nonlinear storyline about three heroes facing an ancient mythical evil. Captain Thorn Brenin, the guard Lo Pheng and scribe Hopper Rouley don’t yet know that the Reapers have returned and are planning to drown the world inAsh of Gods is a tactical turn-based RPG with rich lore and detailed nonlinear storyline about three heroes facing an ancient mythical evil. Captain Thorn Brenin, the guard Lo Pheng and scribe Hopper Rouley don’t yet know that the Reapers have returned and are planning to drown the world in blood so they can awaken the slumbering gods.\r The story can change at any time depending on your choices, sometimes leading to a character’s death. This won’t end the game, however, as the narrative continues without the hero but takes into account the consequences of his demise on future events. Don’t rely on a single tactic or a powerful team to win the game – the AI in Ash of Gods adapts to your gaming style and forces you to be more cunning!… Expand"}, {"name": "Hyakki Castle", "details_link": "https://www.metacritic.com/game/pc/hyakki-castle", "publisher": "Happinet", "release_date": "Nov 14 2017", "developers": ["Asakusa Studios"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/67eff04c540bfd2c5df6abb3d45cece5-98.jpg", "descriptions": "A fantastical world based on ancient Japanese folklore. Hyakki Castle, a mysterious castle built in a land of exile. This castle is brimming with mysteries and fantasy... Slay the Lord of Hyakki Castle! New strategies and puzzle solving by dividing parties..."}, {"name": "Too Human", "details_link": "https://www.metacritic.com/game/xbox-360/too-human", "publisher": "Microsoft Game Studios", "release_date": "Aug 19 2008", "developers": ["Silicon Knights"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/935de43e9cc9c93ffe8ecc9a1d08ddb0-98.jpg", "descriptions": "As the Cybernetic God Baldur, you get thrust into the midst of an ongoing battle that threatens the existence of mankind. An ancient machine presence has forced the God’s hand. In the first of a three part trilogy, Baldur is charged with defending mankind from an onslaught of monstrous warAs the Cybernetic God Baldur, you get thrust into the midst of an ongoing battle that threatens the existence of mankind. An ancient machine presence has forced the God’s hand. In the first of a three part trilogy, Baldur is charged with defending mankind from an onslaught of monstrous war machines bent on eradication of human life. It takes more than brawn and raw strength to supplant the machine hordes. Utilize a sophisticated blend of seamless melee and firearms combat to vanquish foes close and far. Feel each punishing blow through advanced visual effects. Intuitive combat provides new level of accessibility: Perform Baldur’s elaborate and complex combat maneuvers through the press of a button and chain together rapid-fire combos with ease. Through the use of an intuitive combat system, Too Human provides gameplay that is easy to learn and rewarding to master and introduces combinations of weapons combat on a high level. The story chronicles the ongoing struggle between Cybernetic gods, machine giants and mortal men on a massive scale never before seen. Play the role of a cybernetic god charged with protecting the human race against a relentless onslaught of machines. [Microsoft]… Expand"}, {"name": "The Caligula Effect 2", "details_link": "https://www.metacritic.com/game/playstation-4/the-caligula-effect-2", "publisher": "NIS America", "release_date": "Oct 19 2021", "developers": ["historia Inc"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 65, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/5150ce3c46b8a85b8d6fbb66f73272c4-98.jpg", "descriptions": "Dive into a reality-warping adventure from Persona scenario-writer Tadashi Satomi and director Takuya Yamanaka!A virtuadoll named Regret has created the world of Redo in order to save people from their past regrets by unknowingly imprisoning them in a simulation. However, this \"Paradise\"Dive into a reality-warping adventure from Persona scenario-writer Tadashi Satomi and director Takuya Yamanaka!A virtuadoll named Regret has created the world of Redo in order to save people from their past regrets by unknowingly imprisoning them in a simulation. However, this \"Paradise\" is shaken to the core when a virtual idol named X breaks into Regret's virtual reality and restores a high school student's memories of the real world. In order to escape Redo, they form the Go-Home Club, a resistance group that seeks to fight against regret and her enforcers, the Obbligato Musicians.… Expand"}, {"name": "Slender: The Arrival", "details_link": "https://www.metacritic.com/game/pc/slender-the-arrival", "publisher": "Blue Isle Studios", "release_date": "Mar 26 2013", "developers": ["Blue Isle Studios"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/0f46c268dafb8d74765d5eabd20db87b-98.jpg", "descriptions": "Slender: The Arrival is the official continuation of Slender: The Eight Pages. A combined effort from the writers behind the Marble Hornets series and the development team at Blue Isle Studios, Slender: The Arrival features a brand new storyline and improved visuals."}, {"name": "LEGO Battles", "details_link": "https://www.metacritic.com/game/ds/lego-battles", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 10 2009", "developers": ["Hellbent Games"], "platforms": "DS", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 65, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/c9ee1eb36deec28ea615442fd5278007-98.jpg", "descriptions": "LEGO Battles pulls three LEGO themes together to create a unique extension of the LEGO build-and-play experience that stays true to the customization and humor that are the foundation of LEGO videogames. LEGO Battles offers a new kind of “build and battle” LEGO gameplay. Through six distinctLEGO Battles pulls three LEGO themes together to create a unique extension of the LEGO build-and-play experience that stays true to the customization and humor that are the foundation of LEGO videogames. LEGO Battles offers a new kind of “build and battle” LEGO gameplay. Through six distinct story lines, players build their own LEGO bases and battle teams as they engage in over 70 different levels, mixing and matching units to create the ultimate customized LEGO squad. These unique LEGO battles teams see pirate swordsmen fighting side-by-side with wizards and aliens; dragons battling ninjas; and pirate ships launching broadsides against spacecraft and knights! Players can also challenge friends on the battlefield in multiplayer mode through wireless DS multi-card play. [Warner Bros]… Expand"}, {"name": "Best Month Ever!", "details_link": "https://www.metacritic.com/game/pc/best-month-ever!", "publisher": "Klabater", "release_date": "May  5 2022", "developers": ["Warsaw Film School Video Game & Film Production Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/aaede4c093d66507471fef1be061592b-98.jpg", "descriptions": "Take part in a roller coaster of emotions with Louise embarking on a road trip of a lifetime through the late 1960s USA, trying to show her son Mitch how to navigate the often cruel modern world.Each choice you make in the crucial few moments we all know may change our lives for good in aTake part in a roller coaster of emotions with Louise embarking on a road trip of a lifetime through the late 1960s USA, trying to show her son Mitch how to navigate the often cruel modern world.Each choice you make in the crucial few moments we all know may change our lives for good in a split of a second, influence what kind of person Mitch turns out to be and what values shall guide him once he becomes his own man.Find clues as to why Louise's life is what it is today, take crucial decisions no other person would be strong enough to stomach, and show Mitch what he needs to see in order for him to become independent, suave, and brave enough to conquer the day.Travel across the country and meet a plethora of characters that may help or may dissuade Louise from her goals - including the most controversial groups many thought long gone.… Expand"}, {"name": "Kirby Fighters 2", "details_link": "https://www.metacritic.com/game/switch/kirby-fighters-2", "publisher": "Nintendo", "release_date": "Sep 23 2020", "developers": ["Nintendo", "HAL Labs"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/875660300014a849b75443f38e1ba94f-98.jpg", "descriptions": "Choose from a cast of Kirby’s most iconic copy abilities—including the brand-new Wrestler ability—and duke it out to be the last Kirby standing. Familiar friends and foes like Bandana Waddle Dee and King Dedede also make an appearance as playable characters in the Kirby Fighters 2 game,Choose from a cast of Kirby’s most iconic copy abilities—including the brand-new Wrestler ability—and duke it out to be the last Kirby standing. Familiar friends and foes like Bandana Waddle Dee and King Dedede also make an appearance as playable characters in the Kirby Fighters 2 game, available exclusively for the Nintendo Switch™ system.… Expand"}, {"name": "UFC Personal Trainer: The Ultimate Fitness System", "details_link": "https://www.metacritic.com/game/playstation-3/ufc-personal-trainer-the-ultimate-fitness-system", "publisher": "THQ", "release_date": "Jun 28 2011", "developers": ["THQ", "Heavy Iron Studios"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Miscellaneous", "General", "Exercise / Fitness"], "meta_score": 65, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/2/072ae1f1b3e1ddc54acc813cf34f68f9-98.jpg", "descriptions": "UFC Personal Trainer aims to get people in shape through similar training methods as the UFC superstars."}, {"name": "Hearts of Iron III: Semper Fi", "details_link": "https://www.metacritic.com/game/pc/hearts-of-iron-iii-semper-fi", "publisher": "Paradox Interactive", "release_date": "Jun  7 2010", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/d153ad1d35f699631bf3aea3704bba81-98.jpg", "descriptions": "It's time to dust off the field marshal's baton and take command of any nation in World War II; the largest conflict in history. The first expansion to the critically acclaimed Hearts of Iron III lets you take charge - or delegate - at any level, from divison to nation, through a variety ofIt's time to dust off the field marshal's baton and take command of any nation in World War II; the largest conflict in history. The first expansion to the critically acclaimed Hearts of Iron III lets you take charge - or delegate - at any level, from divison to nation, through a variety of scenarios. Guide your country to glory from 1936 to 1948: wage war on the battlefields, in the factories, and at the negotiating table, in the grandest of all World War II strategy games ever made. … Expand"}, {"name": "Elegy for a Dead World", "details_link": "https://www.metacritic.com/game/pc/elegy-for-a-dead-world", "publisher": "Dejobaan Games", "release_date": "Dec 10 2014", "developers": ["Popcannibal"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Text"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/c7e512193d1b1846c1274752d4550d72-98.jpg", "descriptions": "Three portals to long-dead civilizations await you. Your job is to explore these worlds, write about what you find, and share your stories with the rest of the universe. Other players will read what you write and assess it. Your goal is to write something so moving that a thousand othersThree portals to long-dead civilizations await you. Your job is to explore these worlds, write about what you find, and share your stories with the rest of the universe. Other players will read what you write and assess it. Your goal is to write something so moving that a thousand others applaud you. Each of the three worlds was inspired by the works of a British Romance-era poet: Shelley, Keats, and Byron.… Expand"}, {"name": "Zool Redimensioned", "details_link": "https://www.metacritic.com/game/pc/zool-redimensioned", "publisher": "Secret Mode", "release_date": "Aug 18 2021", "developers": ["Sumo Digital", "Sumo Digital Academy"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/9/9b161ff1c26f3062f8765f591465c3f8-98.jpg", "descriptions": "Originally released by Gremlin Graphics in 1992 on the Amiga to critical acclaim, iconic gaming mascot Zool returns in Zool Redimensioned!This brand-new reimagining of the classic action platforming adventure has been rebuilt from the ground up for modern audiences. Help Zool jump, spinOriginally released by Gremlin Graphics in 1992 on the Amiga to critical acclaim, iconic gaming mascot Zool returns in Zool Redimensioned!This brand-new reimagining of the classic action platforming adventure has been rebuilt from the ground up for modern audiences. Help Zool jump, spin and shoot his way across eight alien worlds, taking down menacing bosses and saving the universe from the nefarious influence of Krool.Zool's old school platforming action will challenge the most hardcore gamers, with modern enhancements that bring the game into the 21st century. Beat your speed run times, discover secrets hidden across every level, or go back in time and play the original classic game. Re-live the legend of the ninja that started it all!… Expand"}, null, {"name": "Military Madness: Nectaris", "details_link": "https://www.metacritic.com/game/xbox-360/military-madness-nectaris", "publisher": "Hudson Entertainment", "release_date": "Sep 30 2009", "developers": ["Backbone Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Strategy", "Real-Time", "Military", "General", "Military"], "meta_score": 65, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/f591fde2c87c131d0bc66901b2dcd6a5-98.jpg", "descriptions": "[Xbox Live Arcade]  The Military is back for a new generation of recruits! The classic turn-based strategy series Military Madness: Nectaris is exploding onto Xbox LIVE Arcade. With an all-new graphical barrage, an all-new commander unit, online team and vs. multiplayer, and a platoon of[Xbox Live Arcade]  The Military is back for a new generation of recruits! The classic turn-based strategy series Military Madness: Nectaris is exploding onto Xbox LIVE Arcade. With an all-new graphical barrage, an all-new commander unit, online team and vs. multiplayer, and a platoon of other new features, this is the maddest game in the series yet. [Hudson Soft]… Expand"}, {"name": "Dragon Quest Swords: The Masked Queen and the Tower of Mirrors", "details_link": "https://www.metacritic.com/game/wii/dragon-quest-swords-the-masked-queen-and-the-tower-of-mirrors", "publisher": "Square Enix", "release_date": "Feb 19 2008", "developers": ["Eighting", "Genius Sonority Inc."], "platforms": "Wii", "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Japanese-Style", "Western-Style"], "meta_score": 65, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/fc56abcc23c205fa3bee27f57a4b54bc-98.jpg", "descriptions": "Five years have passed since the defeat of the Deathbringer, and the kingdom of Avalonia joyously celebrates what seems to be an everlasting era of peace. However, a closer look reveals that things are amiss. Calamity arises within the kingdom, as unfamiliar and powerful monsters invade theFive years have passed since the defeat of the Deathbringer, and the kingdom of Avalonia joyously celebrates what seems to be an everlasting era of peace. However, a closer look reveals that things are amiss. Calamity arises within the kingdom, as unfamiliar and powerful monsters invade the outskirts of town. With the Deathbringer gone, what explanation is there for the onset of these monsters? And what of the queen, who has come to hide her face behind a strange mask?  Make your way through the perilous journey, solve the baffling mysteries and return order to Avalonia. [Square Enix]… Expand"}, {"name": "Yesterday", "details_link": "https://www.metacritic.com/game/pc/yesterday", "publisher": "Focus Home Interactive", "release_date": "Mar 22 2012", "developers": ["Pendulo Studios"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 65, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/9b8405e2e17e3054c5e9b8245c42a063-98.jpg", "descriptions": "(Also known as \"New York Crimes\") In New York City, beggars are disappearing one after another, only to be found burnt alive. Meanwhile, a Y-shaped scar forms in the palm of the hands of seemingly unrelated people. With the police and the media giving little attention to these events, Henry(Also known as \"New York Crimes\") In New York City, beggars are disappearing one after another, only to be found burnt alive. Meanwhile, a Y-shaped scar forms in the palm of the hands of seemingly unrelated people. With the police and the media giving little attention to these events, Henry White, a young and rich heir dedicated to a charitable organization, and his friend Cooper, are the first to investigate these disappearances. They are two of the three playable characters in Yesterday, the third being none other than the enigmatic John Yesterday, who is dragged into this incredible story after his memory is completely wiped.… Expand"}, {"name": "FIFA Soccer 08", "details_link": "https://www.metacritic.com/game/wii/fifa-soccer-08", "publisher": "EA Sports", "release_date": "Oct  9 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/5867c2e67cfe3516eab4a05d4a211dbc-98.jpg", "descriptions": "EA has created a unique character of the celebrated Brazilian International soccer star that is playable in FIFA Soccer 08 on Wii. The Wii-exclusive Ronaldinho hosts a game mode designed and created exclusively for Wii called Footii Party with Ronaldinho. With this mode, EA introduces uniqueEA has created a unique character of the celebrated Brazilian International soccer star that is playable in FIFA Soccer 08 on Wii. The Wii-exclusive Ronaldinho hosts a game mode designed and created exclusively for Wii called Footii Party with Ronaldinho. With this mode, EA introduces unique party games - including Table Soccer and Shoot Off – where you can play as your self-created Mii character to unlock Ronaldinho and take on the champ. Each Footii Party game is created as a multiplayer, social experience designed to engage and entertain fans of all ages. The game's FreeMotion controls help level the playing field for all players and turns FIFA Soccer 08 on Wii into a physical, social activity. It also provides gamers with an authentic soccer experience with more control. It's easy to pick-up and play and with the in-game Soccer Academy you can learn basic and advanced controls in more than 30 interactive tutorials. Each lesson teaches you how to master the FreeMotion controls and perform all the necessary movements to dominate on the pitch. [Electronic Arts]… Expand"}, {"name": "Not Tonight 2", "details_link": "https://www.metacritic.com/game/pc/not-tonight-2", "publisher": "No More Robots", "release_date": "Feb 11 2022", "developers": ["Panic Barn Ltd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 65, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/a57309a137782beeefe2956d290bb6b8-98.jpg", "descriptions": "In an alternative broken America, where capitalism and political greed have taken center stage, your friend has gone missing. Snatched during a protest, Eduardo Suarez has been seized by the authorities, and now sits ready for processing in the Miami gulag.Not Tonight 2 is an AmericanIn an alternative broken America, where capitalism and political greed have taken center stage, your friend has gone missing. Snatched during a protest, Eduardo Suarez has been seized by the authorities, and now sits ready for processing in the Miami gulag.Not Tonight 2 is an American document-checking road trip, fusing a time-pressure RPG with a politically charged, dark comedy where every decision matters. Will Eduardo's friends Malik, Kevin and Mari manage to locate and deliver his documents to Miami in time, or is this the end of the American dream?… Expand"}, {"name": "Bankshot Billiards 2", "details_link": "https://www.metacritic.com/game/xbox-360/bankshot-billiards-2", "publisher": "PixelStorm", "release_date": "Nov 22 2005", "developers": ["PixelStorm"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/1/999bb9cfe9cf60a52c4cde774b0eff1b-98.jpg", "descriptions": "[Xbox Live Arcade]  Prepare to release your inner pool shark! Bankshot Billiards 2 improves upon the original with nine different game styles: classic 8-Ball, 9-Ball, Cutthroat, Euro 8-Ball, 14.1 Continuous, 3-Ball, Trick Shots, Time Trial, and Golf. Turn on the Aiming Aid option and[Xbox Live Arcade]  Prepare to release your inner pool shark! Bankshot Billiards 2 improves upon the original with nine different game styles: classic 8-Ball, 9-Ball, Cutthroat, Euro 8-Ball, 14.1 Continuous, 3-Ball, Trick Shots, Time Trial, and Golf. Turn on the Aiming Aid option and practice your shots against the computer. When you’re ready, challenge your friends in your own living room or take on the world over Xbox Live. Earn achievements such as Trick Shot Master, Speed Freak, or Ultimate Hustler! [Xbox.com]… Expand"}, {"name": "Freekstyle", "details_link": "https://www.metacritic.com/game/game-boy-advance/freekstyle", "publisher": "Destination Software", "release_date": "Aug 30 2003", "developers": ["Full-Fat"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/03af7b8a56090aa1bc3a2840674c09c0-98.jpg", "descriptions": "Picture flying through rugged terrain performing massive jumps at more than 70 mph, hitting a 40-foot jump at the ledge of a 200-foot cliff, and pulling off a backflip, a Tsunami, and a 360 all before you land. In Freekstyle, you can perform these tricks on nine different tracks. Choose fromPicture flying through rugged terrain performing massive jumps at more than 70 mph, hitting a 40-foot jump at the ledge of a 200-foot cliff, and pulling off a backflip, a Tsunami, and a 360 all before you land. In Freekstyle, you can perform these tricks on nine different tracks. Choose from any of eight different riders with their own unique attitude and style, and then fly high in Circuit, Race, Freestyle, and Freeride game modes. If this sounds like your idea of a good time, then you're ready for the extreme lifestyle of motoX racing.… Expand"}, {"name": "NFL GameDay 2004", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-gameday-2004", "publisher": "SCEA", "release_date": "Aug 27 2003", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 65, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/7e6f09d21443302affdc460d01452e34-98.jpg", "descriptions": "The latest version of this popular NFL football franchise from the 989 Sports development team delivers exciting and authentic football action. Combining the true NFL intensity with all-new graphics and a deep Online Mode, NFL GameDay 2004 promises to kick off the season in proper footballThe latest version of this popular NFL football franchise from the 989 Sports development team delivers exciting and authentic football action. Combining the true NFL intensity with all-new graphics and a deep Online Mode, NFL GameDay 2004 promises to kick off the season in proper football fashion for football fans of all ages. NFL GameDay 2004 looks and plays better than ever before with enhanced \"motion blending\" technology, allowing for seamless animation transitions which help capture the power and speed of the NFL. In addition, new player models were developed as each NFL player has been recreated in amazing detail to look exactly like his real life counterpart. Stadium models have also been greatly improved as new lighting and textures and interactive crowds have been applied to make the user feel truly part of the action.… Expand"}, {"name": "World Destruction League: Thunder Tanks", "details_link": "https://www.metacritic.com/game/playstation-2/world-destruction-league-thunder-tanks", "publisher": "3DO", "release_date": "Dec 20 2000", "developers": ["3DO"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Car Combat"], "meta_score": 65, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/7452c901f68371a0c0782ffc1e78887e-98.jpg", "descriptions": "Welcome to Wednesday Night WarJetz, the year 2062's favorite post-nuclear war, televised aerial dogfighting extravaganza featuring fanatical pilots in nine different souped-up, artillery laden planes in 33 arenas which blast the living hell out of anything that moves, earning money en routeWelcome to Wednesday Night WarJetz, the year 2062's favorite post-nuclear war, televised aerial dogfighting extravaganza featuring fanatical pilots in nine different souped-up, artillery laden planes in 33 arenas which blast the living hell out of anything that moves, earning money en route to the WDL championship.… Expand"}, {"name": "Children of Mana", "details_link": "https://www.metacritic.com/game/ds/children-of-mana", "publisher": "Nintendo", "release_date": "Nov  1 2006", "developers": ["Nex Entertainment"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/2da53eea725ddefcdf1e960e3a376798-98.jpg", "descriptions": "In ages past, an island called Illusia floated at the center of the world. At the heart of the island towered an ancient, enormous tree that stretched up to the very heavens. For ages past, chaos and sorrow had engulfed the world until at last its salvation appeared in the form of a boy, aIn ages past, an island called Illusia floated at the center of the world. At the heart of the island towered an ancient, enormous tree that stretched up to the very heavens. For ages past, chaos and sorrow had engulfed the world until at last its salvation appeared in the form of a boy, a girl, and a holy sword. Time flowed on and peace returned. The sword and the tree remained, and they soon came to be known as the Sword of Mana and the Mana Tree. Followers of the Mana Tree returned to Illusia as the world started slowly but surely down the path to recovery. The eight elemental spirits are a staple of the Mana series. These powerful allies aid you with healing and special status effects. They can also unleash fearsome magic upon your foes. The greatest innovation of this installment of the Mana series is allowing four players to advance the story and solve quests together while maintaining the feel of an action RPG. Players' actions affect each other in a gameplay experience completely unlike previous action RPGS. [Square Enix]… Expand"}, {"name": "Remember Me", "details_link": "https://www.metacritic.com/game/pc/remember-me", "publisher": "Capcom", "release_date": "Jun  3 2013", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/be0c8dc8a2770582b463fbf9738d7a45-98.jpg", "descriptions": "Imagine Neo-Paris, 2084. Personal memories are now digitised, bought, sold and traded like commodities. The last vestiges of privacy and intimacy have been extinguished in what feels like a logical progression of the explosive growth of social networks at the start of the 21st century. TheImagine Neo-Paris, 2084. Personal memories are now digitised, bought, sold and traded like commodities. The last vestiges of privacy and intimacy have been extinguished in what feels like a logical progression of the explosive growth of social networks at the start of the 21st century. The citizens themselves have given in to this surveillance society in exchange for the comfort only smart technology can provide. This memory economy transfers immense power over society to just a small group of people. Remember Me is a third-person action adventure in which players assume the role of Nilin, a former elite memory hunter with the ability to penetrate people’s minds and steal or even alter their memories. The authorities, fearful of her knowledge and skills arrested Nilin and wiped away her memory. After her escape from prison, Nilin embarks on a mission to recover her identity, helped by her last and only friend. This search for her past leads to her being hunted by the very people that created this surveillance society.… Expand"}, {"name": "Batman: The Telltale Series - Episode 1: Realm of Shadows", "details_link": "https://www.metacritic.com/game/xbox-one/batman-the-telltale-series---episode-1-realm-of-shadows", "publisher": "Telltale Games", "release_date": "Aug  2 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 65, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/5cf111f0d488444c13a4303599b25f11-98.jpg", "descriptions": "Rendered to look like a living, breathing comic book, Telltale's vision of Batman featureS a cast of talent including Troy Baker in the role of Bruce Wayne, Travis Willingham as Harvey Dent, Erin Yvette as Vicki Vale, Enn Reitel as Alfred Pennyworth, Murphy Guyer as Lieutenant James Gordon,Rendered to look like a living, breathing comic book, Telltale's vision of Batman featureS a cast of talent including Troy Baker in the role of Bruce Wayne, Travis Willingham as Harvey Dent, Erin Yvette as Vicki Vale, Enn Reitel as Alfred Pennyworth, Murphy Guyer as Lieutenant James Gordon, Richard McGonagle as Carmine Falcone, and Laura Bailey as Selina Kyle. [Telltale]… Expand"}, {"name": "Call of Duty: Ghosts - Onslaught", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-ghosts---onslaught", "publisher": "Activision", "release_date": "Jan 28 2014", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 65, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/6/c014b186de4c0c58820517bf29708f83-98.jpg", "descriptions": "Onslaught includes four unique Multiplayer Maps. An all-new dual purpose Assault Rifle/Sniper Rifle/ The first installment in Extinction's four-part episodic narrative."}, {"name": "Aquanox Deep Descent", "details_link": "https://www.metacritic.com/game/pc/aquanox-deep-descent", "publisher": "Nordic Games Publishing", "release_date": "Oct 16 2020", "developers": ["Digital Arrow"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Simulation", "Marine", "Combat"], "meta_score": 65, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/ab22599988df466461ab3a88f6653e1c-98.jpg", "descriptions": "Aquanox Deep Descent is a first person underwater vehicle shooter, in which players control a variety of customizable ships to engage in fierce battles in the dystopian deep sea world of Aqua. In the near future the Earth's surface has become uninhabitable. What remains of humankind lives inAquanox Deep Descent is a first person underwater vehicle shooter, in which players control a variety of customizable ships to engage in fierce battles in the dystopian deep sea world of Aqua. In the near future the Earth's surface has become uninhabitable. What remains of humankind lives in former mining and research stations, deep below the surface of the sea. Born and raised in the only world we know, the loose network of underwater settlements, torn by the war for resources and dominance between various factions.\r Take control of a team of highly trained fighter pilots and experience an epic story in the dark world of Aquanox. Send your enemies down to Davy Jones's Locker with well-aimed torpedoes, mortars, mines and more. Explore the deepest corners of the oceans -- mysterious, hazardous, uncharted.… Expand"}, {"name": "Senran Kagura Burst Re:Newal", "details_link": "https://www.metacritic.com/game/playstation-4/senran-kagura-burst-renewal", "publisher": "XSEED Games", "release_date": "Jan 22 2019", "developers": ["Honey Parade Games"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 65, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/da41d21d92ed038078ab52759b6ae73c-98.jpg", "descriptions": "Originally released under the name SENRAN KAGURA Burst in Europe and serving as a \"director's cut\"-style take on the inaugural entry in this now storied series, SENRAN KAGURA Burst Re:Newal brings the prior release's classic 2.5D action to modern hardware with a full 3D remake and a freshOriginally released under the name SENRAN KAGURA Burst in Europe and serving as a \"director's cut\"-style take on the inaugural entry in this now storied series, SENRAN KAGURA Burst Re:Newal brings the prior release's classic 2.5D action to modern hardware with a full 3D remake and a fresh retelling of the story that started it all.\r This fast-paced brawler will provide updated combat mechanics and character models, as well as all-new special effects for a voluptuous visual feast! The series' popular Dressing Room mode continues to see expansions too, with a wealth of new outfits and options that allow players to customize their favorite girls' looks and styles.\r With additional DLC episodes to come that will reveal new story episodes for Yumi and Miyabi detailing their histories prior to meeting Asuka and Homura, SENRAN KAGURA Burst Re:Newal delivers an authentic recreation of the original game while ensuring that series fans will have plenty of new content to look forward to!… Expand"}, {"name": "Tiger Woods PGA Tour 08", "details_link": "https://www.metacritic.com/game/playstation-2/tiger-woods-pga-tour-08", "publisher": "EA Sports", "release_date": "Aug 28 2007", "developers": ["EA Salt Lake"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/f26dc6c29a361d9ca2250acf785bda46-98.jpg", "descriptions": "All-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. The Most Golf CoursesAll-new Shot Confidence tracks your performance on every hole, round, and golf course. Based on key factors, including club selection, hole, lie, and more, dig into past performances with the Confidence Meter to identify strengths and weaknesses before every shot. The Most Golf Courses EverExperience the all-new FedExCup championship format by playing a dream round of golf at Westchester Country Club, TPC Boston, Cog Hill, and East Lake. Take On PGA And LPGA Tour ProsChallenge the greatest PGA Tour pros, including Tiger Woods, John Daly, and Vijay Singh, plus LPGA Tour pros such as Annika Sorenstam, Natalie Gulbis, Christie Kerr, and Morgan Pressel. [Electronic Arts]… Expand"}, {"name": "Soccer Story", "details_link": "https://www.metacritic.com/game/pc/soccer-story", "publisher": "No More Robots", "release_date": "Nov 29 2022", "developers": ["Panic Barn Ltd"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 65, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/7/e931824ca54544a2d6aa4647cc92aea6-98.jpg", "descriptions": "It's been a year since The Calamity tore apart the very foundations of soccer as we know it, and since then, Soccer Inc. has made dang well sure that not a soul has been allowed to even look at a soccer ball, let alone kick it.Soccer may have been banned across the world... but now thereIt's been a year since The Calamity tore apart the very foundations of soccer as we know it, and since then, Soccer Inc. has made dang well sure that not a soul has been allowed to even look at a soccer ball, let alone kick it.Soccer may have been banned across the world... but now there is hope! A magical soccer ball has chosen you, our Savior of Soccer!Soccer Story is a physics-driven adventure RPG, where every problem can be solved with your trusty magic ball. Along the way, you'll need to best bad guys in 1v1s, compete in a range of different sports (with your soccer ball, of course), and sometimes use your brain just as much as your ballsIn a world that has long forgotten The Beautiful Game, can you remind them why soccer is top of the table, and best the most formidable teams, including the local toddlers and a group of sharks?… Expand"}, {"name": "Heroland", "details_link": "https://www.metacritic.com/game/switch/heroland", "publisher": "XSEED Games", "release_date": "Dec  3 2019", "developers": ["FuRyu"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/bfa34ba4fd970dc5bacdc9b3069e5e0f-98.jpg", "descriptions": "Highly customizable RPG - as a hero Tour guide, you choose what your party does, and when! Customize strategies, weapons, and more, including taking home treasure to decorate Lucky's room."}, {"name": "Heroes of Normandie", "details_link": "https://www.metacritic.com/game/pc/heroes-of-normandie", "publisher": "Slitherine", "release_date": "Oct  1 2015", "developers": ["Cat Rabbit"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 65, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/2/cf0c8aaeef65ba8c005b11fada5ce156-98.jpg", "descriptions": "Take one of the most modern, fun and engaging board games created in recent years. Match it with cutting-edge technology. Add a ridiculously well-crafted art style and a ton of extra content. This is the recipe to one of the most thrilling, charming and captivating strategy games you willTake one of the most modern, fun and engaging board games created in recent years. Match it with cutting-edge technology. Add a ridiculously well-crafted art style and a ton of extra content. This is the recipe to one of the most thrilling, charming and captivating strategy games you will ever find.Heroes of Normandie is fast-paced. You are placed in command of small squads in scenarios of varying sizes, in the middle of the D-Day campaign. In the spirit of the original board game, the game is bombastic and humorous yet full of subtle tactical decisions and features a vast array of unique units, equipment and abilities.Plenty of ways to play: complete the three full-fledged campaigns, engage in a quick skirmish, survive through the rogue like mini campaign or challenge a friend in multiplayer.… Expand"}, {"name": "Insecticide: Episode 1", "details_link": "https://www.metacritic.com/game/pc/insecticide-episode-1", "publisher": "Gamecock Media Group", "release_date": "Jun 13 2008", "developers": ["Creat Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 65, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/f7bb2d948accc85ce14657c1e01eed05-98.jpg", "descriptions": "Insecticide is a noir thriller set in an insect world that plays out through a wide variety of offbeat action and adventure levels. In a city overtaken by a sudden crime wave, rookie detective Chrys Liszt is on a crusade to rid the city of lowlifes. However, she immediately discovers that toInsecticide is a noir thriller set in an insect world that plays out through a wide variety of offbeat action and adventure levels. In a city overtaken by a sudden crime wave, rookie detective Chrys Liszt is on a crusade to rid the city of lowlifes. However, she immediately discovers that to reach her goal she will have to face the city of Troi’s most powerful criminal entities. Using only high tech pollen-based weapons, innate bug abilities, and hand-to-hand combat skills, Chrys must clean up Troi as well as learn more about her own past, which remains shrouded in mystery. Insecticide fuses elements from different videogame genres to create a seamless, engrossing story-driven gameplay experience. Lighting fast shootouts, a cityscape brimming with life and high production value voice-overs and cut-scenes result in entertainment on par with Hollywood’s best. [Gamecock Media]… Expand"}, {"name": "Custom Robo", "details_link": "https://www.metacritic.com/game/gamecube/custom-robo", "publisher": "Nintendo", "release_date": "May 10 2004", "developers": ["Noise Inc."], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 65, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/cf02b5e9010a794a5fc98537dc5121ba-98.jpg", "descriptions": "Get ready to enter a world of hypertech weapons, holosseums, and heavy-barrel battles. Custom Robo puts you in the pilot's seat of a state-of-the-art war machine in the not-too-distant future where crime and justice duke it out in virtual battlegrounds. With the game's powerful, innovativeGet ready to enter a world of hypertech weapons, holosseums, and heavy-barrel battles. Custom Robo puts you in the pilot's seat of a state-of-the-art war machine in the not-too-distant future where crime and justice duke it out in virtual battlegrounds. With the game's powerful, innovative customization, you can construct your robot from the ground up using an arsenal of more than 200 parts and weapons, from guns and bombs to robo models and homing pods. Many weapons are freely available on the market, but some--deadly and highly illegal--can only be acquired in secret robo gambling rooms and from the hands of crime syndicates. … Expand"}, {"name": "Dig Dug", "details_link": "https://www.metacritic.com/game/xbox-360/dig-dug", "publisher": "Namco Bandai Games", "release_date": "Oct 11 2006", "developers": ["Namco Bandai Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 4", "Switch", "Xbox One", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Puzzle", "General", "General", "Arcade"], "meta_score": 65, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/654ac5892a71f8e78cd812db1d2d8b9e-98.jpg", "descriptions": "[Xbox Live Arcade]  Experience the fast-paced action of this quarter-cruncher from 1982 as you take control of Dig Dug himself and vanquish Pookas and Fygars. Using your trusty pump, inflate your enemies until they pop, or squash them under rocks. Don't hesitate, or you could get squashed[Xbox Live Arcade]  Experience the fast-paced action of this quarter-cruncher from 1982 as you take control of Dig Dug himself and vanquish Pookas and Fygars. Using your trusty pump, inflate your enemies until they pop, or squash them under rocks. Don't hesitate, or you could get squashed yourself. Drive your high score up by taking out enemies further underground, or making more difficult kills. Dig! Propel Dig Dug through underground tunnels as he hunts down monsters. The more dirt you move, the more points you get. Watch out for treacherous rocks and use them to your advantage. Fight! Just because your enemies start in tunnels doesn't mean they have to stay there. Watch out for them sneaking up on you and make them pay! Collect! Drop more than two rocks and look for icons to start appearing in the center of the map! Collect these items, including the ship from the Xbox Live Arcade game Galaga, to drive your score higher. [Microsoft]… Expand"}, {"name": "Feeding Frenzy", "details_link": "https://www.metacritic.com/game/xbox-360/feeding-frenzy", "publisher": "Oberon Media", "release_date": "Mar 10 2006", "developers": ["Sprout Games"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 65, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/097a6aedb18314f2208b96f57c267347-98.jpg", "descriptions": "[Xbox Live Arcade]  Slurp, gulp, and crunch your way all along the Frenzy Coast in Feeding Frenzy! The rules here are simple: Eat anything that's smaller than you and swim clear of everything else. The more you eat, the bigger you get, and the bigger you get, the closer you come to taking on[Xbox Live Arcade]  Slurp, gulp, and crunch your way all along the Frenzy Coast in Feeding Frenzy! The rules here are simple: Eat anything that's smaller than you and swim clear of everything else. The more you eat, the bigger you get, and the bigger you get, the closer you come to taking on the fearsome Shark King. Starfish bubbles don't help you grow, but they’re an easy way to boost your score. Oysters offer up bonus points in the form of pearls, but be quick or the shell could snap shut with you inside! Nibbling on the tail of a patrolling barracuda is a risky way to earn extra points—he can turn on you in an instant. And the jellyfish - well, it's best to swim clear of them altogether. Did you know that tuna can swim up to 50 miles per hour? Or that a parrot fish can change its gender? Feeding Frenzy includes more than four dozen fascinating fish facts like these - one between each game level. [Xbox.com]… Expand"}, {"name": "Metal Gear Solid: Portable Ops Plus", "details_link": "https://www.metacritic.com/game/psp/metal-gear-solid-portable-ops-plus", "publisher": "Konami", "release_date": "Nov 13 2007", "developers": ["Kojima Productions"], "platforms": "PSP", "num_players": "Up to 6 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/53aa97b5efd06cc840a42ae040875377-98.jpg", "descriptions": "Metal Gear Solid: Portable Ops Plus is a standalone addition to last year’s award winning stealth action title of the same name. Focusing on a portable multiplayer experience, players will be able to enjoy more maps, more missions, and recruit a talented crew of war heroes for battling realMetal Gear Solid: Portable Ops Plus is a standalone addition to last year’s award winning stealth action title of the same name. Focusing on a portable multiplayer experience, players will be able to enjoy more maps, more missions, and recruit a talented crew of war heroes for battling real opponents in online arenas. Features: Unique Gameplay Modes and Missions – A new single player mode, “Infinity Mission”, and additional multiplayer modes will engage even the most experienced strategy veterans. Upload your saved data from the original Metal Gear Solid: Portable Ops to create instant squads. More Online Maps – Choose from a variety of new environment maps, such as an updated version of the REX Hangar area of the original Metal Gear Solid, for more multiplayer mayhem. More Playable Characters – Recruit brand new soldiers from the Metal Gear Solid universe, including Raiden and Snake from MGS4, to form a unique fighting crew. Wi-Fi HotSpot Support – As long as there is a Wi-Fi signal, you can be in the battlefield. With Wi-Fi HotSpot support, you can now play Metal Gear Solid: Portable Ops Plus online at any Wi-Fi HotSpot location. Improved Support – Tutorials and improved in-game support helps players of all skill levels to jump right into the action or hone their skills. [Konami]… Expand"}, {"name": "Armored Core: Verdict Day", "details_link": "https://www.metacritic.com/game/xbox-360/armored-core-verdict-day", "publisher": "Namco Bandai Games America", "release_date": "Sep 24 2013", "developers": ["From Software"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/e24e8347afbb32b1aa69c858dfc1c476-98.jpg", "descriptions": "Japanese game developer FromSoftware returns to its hardcore mech action franchise with ARMORED CORE: VERDICT DAY.  Command a squadron of advanced Armored Core mechs in a dystopian future ravaged by war and stripped of natural resources.  Players form squads of up to 20 members and enlistJapanese game developer FromSoftware returns to its hardcore mech action franchise with ARMORED CORE: VERDICT DAY.  Command a squadron of advanced Armored Core mechs in a dystopian future ravaged by war and stripped of natural resources.  Players form squads of up to 20 members and enlist into one of the various in-game factions to wrestle control of territories away from other players in the game's persistent multiplayer mode.  New gameplay features will be implemented into ARMORED CORE: VERDICT DAY to ensure that players who choose to play alone will be able to recruit a squad of A.I. controlled mechs and enjoy the robust feature sets of co-op and multiplayer modes, while new matchmaking system ensures that players will always find battles at a moment's notice.… Expand"}, {"name": "The Raven: Legacy of a Master Thief - A Murder of Ravens", "details_link": "https://www.metacritic.com/game/pc/the-raven-legacy-of-a-master-thief---a-murder-of-ravens", "publisher": "The Adventure Company", "release_date": "Sep 24 2013", "developers": ["KING Art"], "platforms": ["Xbox 360", "PC"], "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 65, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/8/fc0100162f95a79a4de2ae0058b2929e-98.jpg", "descriptions": "A Murder of Ravens primarily introduces the cool young tricksters and cat burglars (the Arab and the young woman). They are clever, likeable and want to outsmart the violent butler. Hope almost destroyed? Is their plan doomed to failure? How will this end? Another nice cliffhanger."}, {"name": "Arthur and the Invisibles: The Game", "details_link": "https://www.metacritic.com/game/pc/arthur-and-the-invisibles-the-game", "publisher": "Atari", "release_date": "Jan 12 2007", "developers": ["Etranges Libellules"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/782086e6640f2d490096da3186ee9f97-98.jpg", "descriptions": "Directly inspired by the animated film of the same name, Arthur and the Invisibles allows players to relive the adventures depicted in the film, which tells the story of young Arthur who finds the magical adventure of a lifetime in his own backyard. Players assume the role of Arthur and hisDirectly inspired by the animated film of the same name, Arthur and the Invisibles allows players to relive the adventures depicted in the film, which tells the story of young Arthur who finds the magical adventure of a lifetime in his own backyard. Players assume the role of Arthur and his two companions in their mission to save the Land of the Invisibles and its Minimoy inhabitants destruction. The game incorporates filmmaker Luc Besson's rich Minimoys universe with the same richness and extraordinary visuals of the film. Gameplay is based on the concept of the \"trio\" - each phase of a puzzle or combat requires utilizing the skills of all three characters (Arthur, Selenia and Betameche); Each character has unique but complimentary powers which players must use to their advantage. The three heroes have their own particular objectives, but they must also aid one other; More than 20 hours of gameplay, fighting, puzzles, driving and flying; Players can watch integrated scenes from the film offered in the form of parallel action phases. [Atari]… Expand"}, {"name": "Armored Core V", "details_link": "https://www.metacritic.com/game/playstation-3/armored-core-v", "publisher": "Namco Bandai Games America", "release_date": "Mar 20 2012", "developers": ["From Software"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 20 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 65, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/39e06cf83059b8ff6590237aab898a96-98.jpg", "descriptions": "The ARMORED CORE series is known in the mech action genre for its intense one-on-one battles and customization options. ARMORED CORE V is a new entry that ups the ante with more content than the previous games, a completely new atmosphere, and a robust offline mode. In addition, the onlineThe ARMORED CORE series is known in the mech action genre for its intense one-on-one battles and customization options. ARMORED CORE V is a new entry that ups the ante with more content than the previous games, a completely new atmosphere, and a robust offline mode. In addition, the online mode has been newly designed to focus on huge team-based battles on a global scale. … Expand"}, {"name": "Pac-Man World: Re-PAC", "details_link": "https://www.metacritic.com/game/switch/pac-man-world-re-pac", "publisher": "Bandai Namco Games", "release_date": "Aug 26 2022", "developers": ["Now Production", "Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/7afd912e0a08a91653389d7f71ce91c1-98.jpg", "descriptions": "Feed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, andFeed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, and face-off against the Ghosts’ boss, Toc-Man. With polished graphics, enhanced gameplay, and updated features – Pac-Man World Re-Pac is action/platforming fun for both experienced Pac-fans and new Pac-thusiasts the world over.… Expand"}, {"name": "Star Wars: The Force Unleashed", "details_link": "https://www.metacritic.com/game/switch/star-wars-the-force-unleashed", "publisher": "Aspyr", "release_date": "Apr 20 2022", "developers": ["Krome Studios", "Aspyr"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 65, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/051be97453a70f9c2bf8d8eddf8fa987-98.jpg", "descriptions": "The Star Wars saga continues in Star Wars: The Force Unleashed. You are Darth Vader's Secret Apprentice! The Dark Lord of the Sith himself has trained you to use a lightsaber and unleash the power of the Force, but now your destiny is your own. Will you join Vader as the next great Sith, orThe Star Wars saga continues in Star Wars: The Force Unleashed. You are Darth Vader's Secret Apprentice! The Dark Lord of the Sith himself has trained you to use a lightsaber and unleash the power of the Force, but now your destiny is your own. Will you join Vader as the next great Sith, or will you choose to defend peace and justice as a noble Jedi Knight?… Expand"}, {"name": "Afro Samurai", "details_link": "https://www.metacritic.com/game/xbox-360/afro-samurai", "publisher": "Namco Bandai Games America", "release_date": "Jan 27 2009", "developers": ["Namco Bandai Games America", "Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 65, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/eb79c9f704cd699819c708c1d700cc6d-98.jpg", "descriptions": "Follow Afro Samurai as he fights to become the number one warrior, a title currently held by Justice, the man who killed Afro’s father when he was a child.  The game follows the plot of the original series with added material and background for fans and new comers alike. Blood is beautifulFollow Afro Samurai as he fights to become the number one warrior, a title currently held by Justice, the man who killed Afro’s father when he was a child.  The game follows the plot of the original series with added material and background for fans and new comers alike. Blood is beautiful in this hip hop infused action adventure as Samuel L. Jackson reprises his role as Afro and Ninja Ninja. A striking art style gives Afro Samurai a unique look and feel across animated open environments as he wages war against his adversaries to become number one. Using an innovative gameplay system, enemy AI is affected by the beat of the musical score overseen and inspired by RZA of Wu-Tang Clan fame and composed and produced by Howard Drossin. These dynamic battles ensure stylized encounters throughout the game that affect the overall tone of gameplay.  Slice and dismember opponents as Afro acrobatically leaps from one location to the next, interacting with anything and everything in the environment to help him on his journey. [Namco Bandai Games]… Expand"}, {"name": "Warlander", "details_link": "https://www.metacritic.com/game/pc/warlander", "publisher": "PLAION", "release_date": "Jan 24 2023", "developers": ["Toylogic Inc.", "Toylogic"], "platforms": "PC", "num_players": "Up to more than 64 ", "genres": ["Action", "General", "Strategy", "Real-Time", "MOBA"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/17b64e666d67f8745b770f4d20d3dbe9-98.jpg", "descriptions": "Harness the almighty powers of god-like Warriors, Clerics, and Mages, with a unique style that mashes a Medieval-inspired setting, Fantastical items and abilities…and…EVEN POWERFUL ROBOTS! Master siege weapons and cataclysmic spells to control the battlefield and destroy the enemy's core!"}, {"name": "Aerial_Knight's Never Yield", "details_link": "https://www.metacritic.com/game/switch/aerial_knights-never-yield", "publisher": "Headup Games", "release_date": "May 19 2021", "developers": ["Aerial_Knight"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/9e30fa15f8abae8e332daeb27eebc1d5-98.jpg", "descriptions": "Survive A futuristic Tokyo style Detroit in this 3D runner that tells the story of Wally who has uncovered the evidence that can change his city forever. Explore a game world with a dope-tastic soundtrack featuring the authentic sounds of Detroit Artist. Take the role of Wally. A mysteriousSurvive A futuristic Tokyo style Detroit in this 3D runner that tells the story of Wally who has uncovered the evidence that can change his city forever. Explore a game world with a dope-tastic soundtrack featuring the authentic sounds of Detroit Artist. Take the role of Wally. A mysterious character that has recovered what was taken from him. Hopefully, you're fast enough to outrun your enemies. Expose the truth and try to uncover the mystery of what happened to them.… Expand"}, {"name": "My Hero One's Justice 2", "details_link": "https://www.metacritic.com/game/xbox-one/my-hero-ones-justice-2", "publisher": "Bandai Namco Games", "release_date": "Mar 13 2020", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 65, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/f0eec97a0ce2a057405bfb43334f3f11-98.jpg", "descriptions": "The battle for justice continues, but this time the fight gets bigger, badder, and more quirkier in MY HERO ONE’S JUSTICE 2. Based on the hit anime series, all of your favorite characters return in this 3D arena fighter that pits heroes and villains in the ultimate test for righteousness.The battle for justice continues, but this time the fight gets bigger, badder, and more quirkier in MY HERO ONE’S JUSTICE 2. Based on the hit anime series, all of your favorite characters return in this 3D arena fighter that pits heroes and villains in the ultimate test for righteousness.\r Play through the anime and experience memorable fights as you relive iconic scenes. Pick up after the finish of MY HERO ONE’S JUSTICE and see what happens to Deku and the class at UA.\r The cast from MY HERO ONE’S JUSTICE are back and they’re now joined by newly added characters from the series.With 40 playable characters, build your dream team with your favorite hero or villain. Fight to build up your PLUS ULTRAmeter and pull off quirks in special combos that goes beyond!… Expand"}, {"name": "DEXED", "details_link": "https://www.metacritic.com/game/playstation-4/dexed", "publisher": "Ninja Theory", "release_date": "Jan 31 2017", "developers": ["Ninja Theory"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Rail"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/06ecf94ca2d42ec985dc30a4d9bc1f7d-98.jpg", "descriptions": "From Ninja Theory, creators of Heavenly Sword and DmC: Devil May Cry comes Dexed, an on-rails VR shooter where dexterity is a must. Target and shoot flurries of enemies with two blasters, one launching ice to destroy fire and the other shooting fire to destroy ice. Journey throughFrom Ninja Theory, creators of Heavenly Sword and DmC: Devil May Cry comes Dexed, an on-rails VR shooter where dexterity is a must. Target and shoot flurries of enemies with two blasters, one launching ice to destroy fire and the other shooting fire to destroy ice. Journey through beautifully realized worlds and hone your skills in Challenge Mode before taking on the endless battle of Arcade Mode. [Playstation.com]… Expand"}, {"name": "Cradle", "details_link": "https://www.metacritic.com/game/pc/cradle", "publisher": "Flying Cafe for Semianimals", "release_date": "Jul 24 2015", "developers": ["Flying Cafe for Semianimals"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Adventure", "3D", "First-Person"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/2e685acd4dd2df8f00607d9bd2bacc5d-98.jpg", "descriptions": "Cradle is a sci-fi first-person-view quest designed for the player to explore the surrounding world. The story is built around the relations of the protagonist and a mechanical girl who by quirk of fate found themselves amidst the desert."}, {"name": "Payday 2: Crimewave Edition", "details_link": "https://www.metacritic.com/game/xbox-one/payday-2-crimewave-edition", "publisher": "505 Games", "release_date": "Jun 16 2015", "developers": ["Overkill Software"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "General", "Fantasy", "Arcade"], "meta_score": 65, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/1/2c9e0b2cdb472ead01a08a5eefbcbaea-98.jpg", "descriptions": "Payday 2 is an action-packed, four-player co-op heist shooter that once again lets gamers don the masks of the original Payday crew - Dallas, Hoxton, Wolf and Chains. The new CrimeNet network offers a huge range of dynamic contracts and players are free to choose anything from small-timePayday 2 is an action-packed, four-player co-op heist shooter that once again lets gamers don the masks of the original Payday crew - Dallas, Hoxton, Wolf and Chains. The new CrimeNet network offers a huge range of dynamic contracts and players are free to choose anything from small-time convenience store hits or kidnappings, to cyber-crime or emptying out bank vaults. As the crew progresses the jobs become bigger, better and more rewarding. Along with earning more money and becoming a legendary criminal comes a new character customization and crafting system that lets crews build and customize their own guns and gear.… Expand"}, {"name": "Flockers", "details_link": "https://www.metacritic.com/game/xbox-one/flockers", "publisher": "Team17", "release_date": "Sep 19 2014", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 65, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/3c06fdb0076dc79391fe5cabffa17c66-98.jpg", "descriptions": "Flockers is a modern day take on the classic A to B puzzle genre with a generous helping of dark humour for good measure."}, {"name": "Sorcery Saga: The Curse of the Great Curry God", "details_link": "https://www.metacritic.com/game/playstation-vita/sorcery-saga-the-curse-of-the-great-curry-god", "publisher": "Aksys Games", "release_date": "Dec 10 2013", "developers": ["Zerodiv"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Roguelike"], "meta_score": 65, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/591b9bd787622fb7c1831fed66c64a0c-98.jpg", "descriptions": "To graduate from the magic academy, Pupuru has to retrieve the Madokyuu from the Mado Tower. However, instead of the relic, she finds a book full of curry recipes inside and releases Ku-chan, a strange creature. For this, she is suspended from school. \r\rHowever, she isn't the type to mopeTo graduate from the magic academy, Pupuru has to retrieve the Madokyuu from the Mado Tower. However, instead of the relic, she finds a book full of curry recipes inside and releases Ku-chan, a strange creature. For this, she is suspended from school. \r\rHowever, she isn't the type to mope around, since a curry restaurant near the school is facing a crisis, she decides to use the recipes in the book to create Mado-Curry to save the restaurant, and for that, she needs four legendary ingredients.\r But standing in her way is an evil lord determined to marry her, a jealous witch who sees her as a rival and perverted wizards and heroes.… Expand"}, {"name": "Need for Speed: Undercover", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-undercover", "publisher": "Electronic Arts", "release_date": "Nov 17 2008", "developers": ["EA Black Box"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 65, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/47bca15cbb8badbe35690f082983d6a5-98.jpg", "descriptions": "Need for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a uniqueNeed for Speed Undercover has players racing through speedways, dodging cops and chasing rivals as they go deep undercover to take down an International crime syndicate. The game heralds the return of high-intensity police chases and introduces the all-new 'Heroic Driving Engine' -- a unique technology that generates incredible high-performance moves at 180 miles per hour during breathtaking highway battles. A mix of computer graphics and live-action movies immerses gamers in the rich world of the Tri-City Bay Area. The city’s open-world environment features over 80 miles of roads, including an enormous highway system that sets the stage for highway battles. These high-speed, high-stake chase sequences push players to the limit as they fight off cops and opponents while whipping through traffic at 180 miles per hour. An intelligent new A.I. mechanic delivers a realistic and high-energy action driving experience. Going back to the franchise’s roots, Need for Speed Undercover features more aggressive and intelligent cops whose sole purpose is to take down the player quickly and by any means necessary. Need for Speed Undercover also features the series' signature car customization, real-world damage and realistic driving physics. The game includes some of the hottest licensed cars such as the Audi R8, BMW M6 and Lexus IS-F. [Electronic Arts]… Expand"}, {"name": "Hinterland", "details_link": "https://www.metacritic.com/game/pc/hinterland", "publisher": "Tilted Mill", "release_date": "Sep 30 2008", "developers": ["Tilted Mill"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 65, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/bd2abf41748fdb86c11be8275d00ac86-98.jpg", "descriptions": "Loot, level and build with fast paced RPG combat and strategic base building! Your goal is to lead a handful of peasants to establish a small haven in the wild backcountry of a fantasy kingdom. Bring a diverse cast of followers to your settlement on the edge of the world and then carefullyLoot, level and build with fast paced RPG combat and strategic base building! Your goal is to lead a handful of peasants to establish a small haven in the wild backcountry of a fantasy kingdom. Bring a diverse cast of followers to your settlement on the edge of the world and then carefully select members of your village to put down their ploughs, leave their comfortable homes, and take whatever weapon they may have at hand to join you on expeditions of exploration and conquest in the surrounding lands. There you’ll encounter the characters and creatures of myth and folklore, and find much needed resources to expand your village whether it be iron to make weapons or a mystic tome to entice a great mage to join you. Should your forays meet with success, fame, fortune and prosperity await. But you must take care, for even the loss of a lowly farmer can spell disaster when harvest time comes. Can you build a vibrant settlement, lead your people to prosperity, and tame the wild Hinterland? [Tilted Mill]… Expand"}, {"name": "Atelier Rorona: The Alchemist of Arland", "details_link": "https://www.metacritic.com/game/playstation-3/atelier-rorona-the-alchemist-of-arland", "publisher": "NIS America", "release_date": "Sep 28 2010", "developers": ["Gust"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/a01ef3958a6390b16e94006e9a421a91-98.jpg", "descriptions": "Atelier Rorona is an all new alchemy RPG developed by Gust the creators of Mana Khemia and Ar tonelico\rseries for the PS2.  This all new game adopts a breathtaking anime 3D graphics while retaining the\rclassic RPG feel of the Atelier series.  Players can spent countless hours adventuringAtelier Rorona is an all new alchemy RPG developed by Gust the creators of Mana Khemia and Ar tonelico\rseries for the PS2.  This all new game adopts a breathtaking anime 3D graphics while retaining the\rclassic RPG feel of the Atelier series.  Players can spent countless hours adventuring unexplored lands and synthesize rare items.… Expand"}, {"name": "Ash of Gods: Redemption", "details_link": "https://www.metacritic.com/game/pc/ash-of-gods-redemption", "publisher": "AurumDust", "release_date": "Mar 23 2018", "developers": ["AurumDust"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 65, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/af358ea124cc7134f8eac75f1608a773-98.jpg", "descriptions": "Ash of Gods: Redemption is a turn-based RPG that combines tactical combat, CCG elements, and a constantly evolving story in which no one is safe from death, including the main characters."}, {"name": "MotoGP 08", "details_link": "https://www.metacritic.com/game/pc/motogp-08", "publisher": "Capcom", "release_date": "Oct 28 2008", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "num_players": "12  Online", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 65, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/6321e6915ae84c96973da123ae02b8ac-98.jpg", "descriptions": "The official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GPThe official game of the 2008 Season, Moto GP 08 features all the official riders, bikes and tracks from this year's event providing the definitive 2 wheeled racing experience. For the first time you can race as yourself in a team against the world's elite riders, across 125cc, 250cc and GP class bikes. You'll also get an opportunity to race in teh new circuits of Indianapolis in the US an drace at night in Qatar. Be successful and you'll earn rider points that you can then use to upgrade your bike. [Capcom]… Expand"}, {"name": "Teenage Mutant Ninja Turtles 2: Battle Nexus", "details_link": "https://www.metacritic.com/game/game-boy-advance/teenage-mutant-ninja-turtles-2-battle-nexus", "publisher": "Konami", "release_date": "Oct 19 2004", "developers": ["Konami"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/26e5d64b09e8fb432479bc0b32286073-98.jpg", "descriptions": "The Teenage Mutant Ninja Turtles return--this time featuring simultaneous play for up to four players. In both cooperative and head-to-head modes, you and your friends can play as your favorite green heroes: Leonardo, Michelangelo, Donatello, and Raphael. Punch, kick, and duck your wayThe Teenage Mutant Ninja Turtles return--this time featuring simultaneous play for up to four players. In both cooperative and head-to-head modes, you and your friends can play as your favorite green heroes: Leonardo, Michelangelo, Donatello, and Raphael. Punch, kick, and duck your way through battles against The Shredder and his evil pack of Foot Ninjas. Each Turtle has distinct characteristics and abilities, and you can combine moves to perform more than 30 different types of attacks. … Expand"}, {"name": "Enter the Matrix", "details_link": "https://www.metacritic.com/game/xbox/enter-the-matrix", "publisher": "Atari", "release_date": "May 14 2003", "developers": ["Shiny Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 65, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/62b9e935420d09864477a9e6399fbecf-98.jpg", "descriptions": "Enter the Matrix features awesome gunplay and spectacular martial arts that bend the rules of the Matrix, insane driving and stunts, and the chance to pilot the fastest hovercraft in the fleet.  This game isn't just set in the Matrix universe--it's an integral part of the entire MatrixEnter the Matrix features awesome gunplay and spectacular martial arts that bend the rules of the Matrix, insane driving and stunts, and the chance to pilot the fastest hovercraft in the fleet.  This game isn't just set in the Matrix universe--it's an integral part of the entire Matrix experience, with a story that weaves in and out of The Matrix: Reloaded, the second chapter of the movie trilogy.  Enter the Matrix is the story behind the story.… Expand"}, {"name": "No Gravity: The Plague of Mind", "details_link": "https://www.metacritic.com/game/psp/no-gravity-the-plague-of-mind", "publisher": "Anozor SARL", "release_date": "Feb 26 2009", "developers": ["Realtech VR"], "platforms": ["iPhone/iPad", "PSP"], "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 65, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/a14dce89e2f529ea868318fa76b77b59-98.jpg", "descriptions": "[Playstation Network] In a distant future, a mysterious mind disease is spreading and the road to the cure lies somewhere in the depths of space. Choose between the best pilots and complete a wide range of missions in this fast paced 3D space shooter. [SCEA]"}, {"name": "The Adventures of Jimmy Neutron Boy Genius: Attack of the Twonkies", "details_link": "https://www.metacritic.com/game/playstation-2/the-adventures-of-jimmy-neutron-boy-genius-attack-of-the-twonkies", "publisher": "THQ", "release_date": "Sep 13 2004", "developers": ["THQ"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 65, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/6bfde364c7c53c4f419ffe5537e8b577-98.jpg", "descriptions": "Jimmy Neutron: Attack of the Twonkies is jam-packed with brand new inventions and gadgets! Aliens from Twonkus-3 -- the annual comet that passes over Retroville -- overrun the town and threaten everything in their path. When music can be heard, the aliens becomes agitated -- multiplying andJimmy Neutron: Attack of the Twonkies is jam-packed with brand new inventions and gadgets! Aliens from Twonkus-3 -- the annual comet that passes over Retroville -- overrun the town and threaten everything in their path. When music can be heard, the aliens becomes agitated -- multiplying and growing to tremendous proportions, creating some very intimidating aliens! It's up to Jimmy Neutron to figure out combinations of everyday items and turn them into inventions that will defeat the Twonkus-3 aliens. He'd better hurry up because Retroville is in need of some serious \"Brain Blasts!\" Revolutionary Inventions System allows players to collect every day objects and combine them to create more than 28 gizmos, 11 inventions and 4 super inventions. 6 episodes spanning 15 levels including Jimmy's Lab, Twonkus-3, The Neighborhood, Downtown, Retroland and the Final Showdown. Secret gizmos hidden in each level give Jimmy Neutron enhanced power-ups. [THQ]… Expand"}, {"name": "Advance Guardian Heroes", "details_link": "https://www.metacritic.com/game/game-boy-advance/advance-guardian-heroes", "publisher": "Ubisoft", "release_date": "Sep 14 2004", "developers": ["Treasure"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/8b54b4b793be21248213b919a3fce428-98.jpg", "descriptions": "Based on the Sega Saturn's Guardian Heroes, Advance Guardian Heroes brings a classic game to life on your Game Boy Advance. Not your ordinary side-scrolling fighter, the game features more than 20 playable characters, 160 powerful moves, and different multiplayer scenarios. Each fighter hasBased on the Sega Saturn's Guardian Heroes, Advance Guardian Heroes brings a classic game to life on your Game Boy Advance. Not your ordinary side-scrolling fighter, the game features more than 20 playable characters, 160 powerful moves, and different multiplayer scenarios. Each fighter has unique moves and abilities, which you can upgrade as you progress through the game. Whether you play solo, with friends, or against friends, you can delve into a variety of challenges and battle arenas.… Expand"}, {"name": "Neptunia: Sisters vs. Sisters", "details_link": "https://www.metacritic.com/game/playstation-5/neptunia-sisters-vs-sisters", "publisher": "Idea Factory", "release_date": "Jan 24 2023", "developers": ["Compile Heart"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 65, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/0/1a52d4b205d13385c2c3578f50d8e95e-98.jpg", "descriptions": "While the Goddesses were out responding to a distress call from the faraway PC Continent, Nepgear and the other Candidates were sent to investigate an abandoned laboratory.It was there that they found the \"Ashen Goddess,\" who trapped them in a deep sleep capsule. By the time they awoke, 2While the Goddesses were out responding to a distress call from the faraway PC Continent, Nepgear and the other Candidates were sent to investigate an abandoned laboratory.It was there that they found the \"Ashen Goddess,\" who trapped them in a deep sleep capsule. By the time they awoke, 2 years had already passed.The latest smartphone, the \"rPhone,\" dominates the market.Neptune has been missing since her mission to the PC Continent, and in the absence of its Goddess and Candidate, Planeptune was ravaged by a strange new phenomenon, the Trendi Outbreaks.Suddenly finding herself robbed of home and family, Nepgear falls into a deep depression.This is a story about finding hope in the midst of despair, and the rebirth of a Goddess in the wake of destruction.… Expand"}, {"name": "GetsuFumaDen: Undying Moon", "details_link": "https://www.metacritic.com/game/switch/getsufumaden-undying-moon", "publisher": "Konami", "release_date": "Feb  9 2022", "developers": ["GuruGuru"], "platforms": ["PC", "Switch"], "genres": ["Action", "Platformer", "2D"], "meta_score": 65, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/3e50a180db0321ffb16dd503868ec5a2-98.jpg", "descriptions": "GetsuFumaDen: Undying Moon combines intense roguelite hack-and-slash action with a stunning dark fantasy world, brought to life through the stroke of traditional Japanese art.As the chosen leader and guardian of the land of the living, wield the otherworldy arsenal and powers of the GetsuGetsuFumaDen: Undying Moon combines intense roguelite hack-and-slash action with a stunning dark fantasy world, brought to life through the stroke of traditional Japanese art.As the chosen leader and guardian of the land of the living, wield the otherworldy arsenal and powers of the Getsu clan as you descend deeper into the depths of Hell to eradicate the source of the cataclysm.… Expand"}, {"name": "The Hardy Boys: Treasure on the Tracks", "details_link": "https://www.metacritic.com/game/ds/the-hardy-boys-treasure-on-the-tracks", "publisher": "Sega", "release_date": "Sep  1 2009", "developers": ["Her Interactive"], "platforms": "DS", "genres": ["Action Adventure", "Adventure", "Modern", "General", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/48e8f3508a3088e5a83bd85732c77826-98.jpg", "descriptions": "Ride the Rails to Royalty and Treasure in Russia. You, as the Hardy Boys, are invited onboard the Royal Express traveling from Paris to St Petersburg to follow the mysterious trail of the Romanov Family treasure. Take a ride on the Royal Express to track down the lost clues of the RoyalRide the Rails to Royalty and Treasure in Russia. You, as the Hardy Boys, are invited onboard the Royal Express traveling from Paris to St Petersburg to follow the mysterious trail of the Romanov Family treasure. Take a ride on the Royal Express to track down the lost clues of the Royal family in the great cities of Europe. Play as both the Hardy Boys and a mysterious female spy. Track down clues hidden in paintings. Explore Paris, St. Petersburg, Warsaw, Vienna, and Prague. Solve puzzles and play fun mini-games. [Sega]… Expand"}, {"name": "RC Cars", "details_link": "https://www.metacritic.com/game/pc/rc-cars", "publisher": "Whiptail Interactive", "release_date": "Dec 11 2003", "developers": ["Creat Studios"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 65, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/404423115a7c6398a9643756722cd96c-98.jpg", "descriptions": "R.C. Cars is an arcade racer where the player drives an R/C car over off-road levels that closely reproduce the real world. Within the race the player comes across people, animals, cars and a variety of real-life obstacles. The player drives his small radio-controlled car in an environmentR.C. Cars is an arcade racer where the player drives an R/C car over off-road levels that closely reproduce the real world. Within the race the player comes across people, animals, cars and a variety of real-life obstacles. The player drives his small radio-controlled car in an environment where daily life is in its full swing. He needs to overtake his opponents and finish first. [Whiptail Interactive]… Expand"}, {"name": "Battle Engine Aquila", "details_link": "https://www.metacritic.com/game/pc/battle-engine-aquila", "publisher": "Encore Software, Inc.", "release_date": "Oct 23 2003", "developers": ["Lost Toys"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 65, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/7105e0e69b6e85634ba287eaf7ec4a1f-98.jpg", "descriptions": "Pilot the Battle Engine Aquila ? the most advanced war machine ever created ? and protect your people from certain annihilation. Battle enemy forces on land or transform your mech into a super-sonic jet, and fight from the air. Combine awesome firepower and tactical sophistication with realPilot the Battle Engine Aquila ? the most advanced war machine ever created ? and protect your people from certain annihilation. Battle enemy forces on land or transform your mech into a super-sonic jet, and fight from the air. Combine awesome firepower and tactical sophistication with real time combat. 43 Advanced heart-stopping missions ? do you have what it takes to take on the white knuckle \"Evo Missions?\" 10 Powerful Weapons: Blow your enemies away with rail guns, flux missiles, spread bombs and more. 12 varied and detailed battle grounds for combat and exploration. Battle with or against a friend in 3 intense multiplayer modes ? Skirmish, Versus and Cooperative. [Encore Software]… Expand"}, {"name": "Indiana Jones and the Emperor's Tomb", "details_link": "https://www.metacritic.com/game/playstation-2/indiana-jones-and-the-emperors-tomb", "publisher": "LucasArts", "release_date": "Jun 26 2003", "developers": ["LucasArts"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 65, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/bb6273d5eb4737dc58f7c063524108f5-98.jpg", "descriptions": "Indiana Jones as he travels to 1935 China to prevent a powerful artifact from falling into evil hands. Indy's latest globe-spanning adventure takes you from the jungles of Ceylon and underwater palaces in Istanbul, to the deadly streets of Hong Kong and beyond. Racing against evil Nazis andIndiana Jones as he travels to 1935 China to prevent a powerful artifact from falling into evil hands. Indy's latest globe-spanning adventure takes you from the jungles of Ceylon and underwater palaces in Istanbul, to the deadly streets of Hong Kong and beyond. Racing against evil Nazis and the Asian underworld with mysterious, alluring partner Mei Ying, you'll leap, swim, climb and punch your way through exotic locales, fighting hand-to-hand combat from street brawls to martial arts battles. It will take more than just your trusty whip and pistol to avoid deadly traps and navigate through all the dangerous environments. Do you have what it takes to possess the mysterious \"Heart of the Dragon?\" [LucasArts]… Expand"}, {"name": "The Muppets: On With The Show!", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-muppets-on-with-the-show!", "publisher": "TDK Mediactive", "release_date": "Mar 18 2003", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 65, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": null}, {"name": "Casino Empire", "details_link": "https://www.metacritic.com/game/pc/casino-empire", "publisher": "Sierra Entertainment", "release_date": "Sep 23 2002", "developers": ["Sierra Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/f35116c34d129a34777a952722999b3f-98.jpg", "descriptions": "Build 8 authentic casinos. Create the hottest joint on the strip. But beware. Each is filled with its own unique challenges and pitfalls. Play in actual tournaments. Put your money where your mouth is and take the clientele in a high-stakes game. Take on rival casinos. Vegas isn't for theBuild 8 authentic casinos. Create the hottest joint on the strip. But beware. Each is filled with its own unique challenges and pitfalls. Play in actual tournaments. Put your money where your mouth is and take the clientele in a high-stakes game. Take on rival casinos. Vegas isn't for the weak of heart. Use all your resources to run comptition into the ground. Run the behind-the-scenes business operations. Set the stakes and the salaries to maximize your profits. [Sierra]… Expand"}, {"name": "Cel Damage", "details_link": "https://www.metacritic.com/game/xbox/cel-damage", "publisher": "Electronic Arts", "release_date": "Nov 14 2001", "developers": ["Pseudo Interactive"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 65, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/1032f9febeb555a071f8dc017af4ac79-98.jpg", "descriptions": "PART DEMOLITION DERBY, PART WHACKED-OUT CARTOON COME TO LIFE.\r*Deathmatch, capture-the-flag and gate racing action\r*36 wild, over-the-top weapons\r*10 tough 'toons\r*4-person split-screen multiplayer\r*12 interactive cartoon worlds."}, {"name": "Mad Dash Racing", "details_link": "https://www.metacritic.com/game/xbox/mad-dash-racing", "publisher": "Eidos Interactive", "release_date": "Nov 14 2001", "developers": ["Crystal Dynamics"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Driving", "Racing", "On-foot"], "meta_score": 65, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/4d3e057c0725c0b4eeed042a39c739ff-98.jpg", "descriptions": "An original title designed for the Xbox video game system, Mad Dash Racing combines high-speed combat racing and 3D adventure action with a crew of motley characters for an insane multi-player competition!\r Compete in a race for survival against the evil Hex, his dirty minions and yourAn original title designed for the Xbox video game system, Mad Dash Racing combines high-speed combat racing and 3D adventure action with a crew of motley characters for an insane multi-player competition!\r Compete in a race for survival against the evil Hex, his dirty minions and your unforgiving friends. Glide across rivers of hot, steaming lava, bash through mammoth boulders, and slide down icy glaciers to beat the other racers and escape Hex's wicked wrath. Do whatever it takes to cross the finish line first from shooting weapon power-ups, planning scheming attacks, or knocking your opponents off track with a sharp elbow nudge.… Expand"}]