[{"name": "Asteroids & Deluxe", "details_link": "https://www.metacritic.com/game/xbox-360/asteroids-deluxe", "publisher": "Atari", "release_date": "Nov 28 2007", "developers": ["Stainless Games"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Shooter", "Shooter", "Compilation", "Static", "Static"], "meta_score": 55, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/0e89b6abbbd574d5e57602e61653bace-98.jpg", "descriptions": "[Xbox Live Arcade] Two of the all-time classic arcade games come to Xbox LIVE Arcade in Asteroids, Asteroids Deluxe, a combo of intense action where players must save earth from a deadly bombardment of asteroids. The full historic game is available in its original form, along with a[Xbox Live Arcade] Two of the all-time classic arcade games come to Xbox LIVE Arcade in Asteroids, Asteroids Deluxe, a combo of intense action where players must save earth from a deadly bombardment of asteroids. The full historic game is available in its original form, along with a completely re-stylized version featuring evolved graphics. Released in 1979 by Atari, the simple black and white game was a masterpiece of vector graphics game design, and had millions of arcadegoers entranced by its simple mechanic of controlling a spaceship firing at and destroying asteroids. The sequel to the original, released in 1980, Asteroids Deluxe featured the same classic gameplay but added a new shield feature and dangerous satellite enemies. Play both the original and its sequel in all of its classic old-school style. But now, both games have evolved. Support is provided for both 4:3 and 16:9 aspect ratios, including HDTV. Full-screen anti-aliasing and Dolby Digital surround sound complete the gaming experience. Throttle Monkey mode: Both game versions come with a high-speed version known as Throttle Monkey. Can you survive? [Microsoft]… Expand"}, {"name": "Bomberman Land Portable", "details_link": "https://www.metacritic.com/game/psp/bomberman-land-portable", "publisher": "Hudson Entertainment", "release_date": "Jan 29 2008", "developers": ["Racjin"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "General", "Party", "Party", "Party / Minigame"], "meta_score": 55, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/2900385a28b63d36320141650dbe7460-98.jpg", "descriptions": "Bomberman Land brings together 3 exciting game modes into one. The series introduces a bevy of mini-games, where most can be played in multiplayer mode. The PSP system version features 50 mini-games, the Wii features 50, and the DS has 40 unique mini-games. In addition, the Bomberman LandBomberman Land brings together 3 exciting game modes into one. The series introduces a bevy of mini-games, where most can be played in multiplayer mode. The PSP system version features 50 mini-games, the Wii features 50, and the DS has 40 unique mini-games. In addition, the Bomberman Land series features a robust single-player Story Mode, where players can explore a fantasy land and solve quests and puzzles with the ultimate goal of restoring peace and tranquility to the beleaguered Bomberman world. Best of all, the game includes the Battle Pack Mode, the classic multiplayer Bomberman experience that gamers know and love. The PSP system and the DS versions both allow gamers to share one game cartridge and network with friends to create the ultimate party game. [Hudson Soft]… Expand"}, {"name": "Disney/Pixar Ratatouille", "details_link": "https://www.metacritic.com/game/playstation-3/disneypixar-ratatouille", "publisher": "THQ", "release_date": "Oct 23 2007", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 55, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/92271c9619e4e1bbe01cba3e74551d6e-98.jpg", "descriptions": "Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6Players relive the film's most thrilling moments as they assume the role of Remy, a young rat who dreams of becoming a great French chef, despite the obvious problem of being a rat. From the underground sewers to the bustling streets of Paris, players dash, glide and slide through 6 action-packed worlds filled with dangerous enemies, heists and perilous missions. Players can go head-to-head with their friends in multiplayer mini-games or navigate their way through a sensational rat race that turns the culinary world of Paris upside down. [THQ]… Expand"}, {"name": "Smash Court Tennis 3", "details_link": "https://www.metacritic.com/game/xbox-360/smash-court-tennis-3", "publisher": "Atari", "release_date": "Aug 19 2008", "developers": ["Bandai Namco Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 55, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/77206052478f300c06516f14711a6f94-98.jpg", "descriptions": "The first in the tennis simulation series for the new console generation, Smash Court Tennis 3 for Xbox 360 tests the player's skills against 16 of the world's finest international tennis players. From established stars such as world number one Roger Federer, Maria Sharapova, Rafael NadalThe first in the tennis simulation series for the new console generation, Smash Court Tennis 3 for Xbox 360 tests the player's skills against 16 of the world's finest international tennis players. From established stars such as world number one Roger Federer, Maria Sharapova, Rafael Nadal and Martina Hingis, to rising talents including Italy's Andreas Seppi and Nicole Vaidisova of the Czech Republic, each player has their own strengths and weaknesses which come into play on the game's painstakingly rendered courts. Making the most of the power of Xbox 360, Smash Court Tennis 3 boasts enhanced graphics including improved player animations, realistic shadows, skin shaders and High Dynamic Range rendering which combine to deliver a greater level of realism and immersion for the player. A host of customizing options allows players to choose rackets, shoes, hairstyles, skin tone and clothing to create their own unique star of the courts. New gameplay includes a system which lets all players, no matter what their skill level, benefit quickly from the powerful shots and finely honed skills of the star players. Gameplay modes include Tutorial, Arcade, Pro-Tour, and Exhibition mode where up to four players can go head to head offline. The game also features an online mode allowing players to play online via Xbox LIVE online entertainment network. In addition to Xbox LIVE voice chat and rankings, players can take on opponents in online tournaments and in a range of different matches. Online doubles matches let players team up side by side for a long distance match against another pair, bringing the action and interaction alive like never before. [Atari]… Expand"}, {"name": "Bullet Witch", "details_link": "https://www.metacritic.com/game/xbox-360/bullet-witch", "publisher": "Atari", "release_date": "Feb 27 2007", "developers": ["Cavia Inc."], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/8eaf29f05ebce6a51b6dd9bc3f8013af-98.jpg", "descriptions": "Bullet Witch is set on a bleak planet earth in the year 2013 with human kind on the brink of extinction and hideous demons creating a tidal wave of destruction and havoc. All hope of mankind's survival rests with Alicia, a witch blessed with magical skills and a swift trigger finger. Set inBullet Witch is set on a bleak planet earth in the year 2013 with human kind on the brink of extinction and hideous demons creating a tidal wave of destruction and havoc. All hope of mankind's survival rests with Alicia, a witch blessed with magical skills and a swift trigger finger. Set in a realistic world, Bullet Witch includes numerous features inspired by American horror and Japanese fantasy monsters. Combining shooting and magic, Bullet Witch takes advantage of Xbox 360's advanced physics engine by showcasing massive environmental damage, explosions and destruction. Through Xbox Live online entertainment network, Atari, Inc. provides fans with downloadable Bullet Witch content post-launch such as character costumes and extra levels. [Atari]… Expand"}, {"name": "Disney/Pixar The Incredibles", "details_link": "https://www.metacritic.com/game/pc/disneypixar-the-incredibles", "publisher": "THQ", "release_date": "Oct 29 2004", "developers": ["Heavy Iron Studios", "Beenox"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 55, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/bd8af9b4d9a254bfe575311b489b10a9-98.jpg", "descriptions": "Super strength. Super speed. Invisibility. Elasticity. These are your powers. Bombs. Bullets. Robots. Lasers. Your enemy controls them all. The only way to survive being The Incredibles is to truly be incredible. From the Academy Award-winning creators of \"Toy Story,\" \"Monsters, Inc.,\" andSuper strength. Super speed. Invisibility. Elasticity. These are your powers. Bombs. Bullets. Robots. Lasers. Your enemy controls them all. The only way to survive being The Incredibles is to truly be incredible. From the Academy Award-winning creators of \"Toy Story,\" \"Monsters, Inc.,\" and \"Finding Nemo\" comes a new movie written by Pixar Animation Studios' Brad Bird (Iron Giant, The Simpsons). The Incredibles tells the story of a family of undercover superheroes that are trying to live a quiet, suburban life, but are forced back into action in order to save the world. The action/adventure game from THQ is based on the plotline of the movie, allowing you to play as all the film's main characters. Live the film's action, adventure, and humor over 18 levels, which are packed with fighting, racing, and puzzle action/adventure gameplay featuring the characters' unique superpowers. [THQ]… Expand"}, {"name": "Metal Wolf Chaos XD", "details_link": "https://www.metacritic.com/game/xbox-one/metal-wolf-chaos-xd", "publisher": "Devolver Digital", "release_date": "Aug  6 2019", "developers": ["From Software", "General Arcade"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 55, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/562beab2971c7b4b9ebfbfd31e3da772-98.jpg", "descriptions": "Metal Wolf Chaos XD is a modernized re-release of FromSoftware's 2004 mech shooter with upgraded visual fidelity, refined controls and gameplay, a new save system, and 4K + 16:9 support for modern displays."}, {"name": "Cabela's Dangerous Hunts 2011", "details_link": "https://www.metacritic.com/game/xbox-360/cabelas-dangerous-hunts-2011", "publisher": "Activision", "release_date": "Oct 19 2010", "developers": ["Activision"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Hunting", "Hunting"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/2e46b8b5c8acb19f39dde1d5cead9584-98.jpg", "descriptions": "A global hunting adventure that quickly turns into a terrifying pursuit of the world's deadliest animals. In the ultimate battle of man versus nature, American marksman Cole Rainsford and his estranged father go on a safari to hunt for man-eating beasts in the heart of the African wilderness."}, {"name": "Akiba's Beat", "details_link": "https://www.metacritic.com/game/playstation-4/akibas-beat", "publisher": "XSEED Games", "release_date": "May 16 2017", "developers": ["Acquire"], "platforms": ["PlayStation Vita", "PlayStation 4"], "genres": ["Action Adventure", "Role-Playing", "Action RPG"], "meta_score": 55, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/91ab844bf1f712ca67186c7c0240619c-98.jpg", "descriptions": "Asahi Tachibana is a simple, jobless nerd, living a lazy, cozy life in Tokyo’s infamous “otaku mecca:” Akihabara. To him, every day is Sunday — but now, thanks to a time loop, every day really is Sunday! What’s more, people’s delusions are manifesting in reality, and only Asahi and hisAsahi Tachibana is a simple, jobless nerd, living a lazy, cozy life in Tokyo’s infamous “otaku mecca:” Akihabara. To him, every day is Sunday — but now, thanks to a time loop, every day really is Sunday! What’s more, people’s delusions are manifesting in reality, and only Asahi and his newfound friends are even aware that anything is amiss. Can they set things right, or will Akiba be beat? [Playstation.com]… Expand"}, {"name": "Classic NES Series: Donkey Kong", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-donkey-kong", "publisher": "Nintendo", "release_date": "Jun  2 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/ded25c3e48562a1d5247db912681f2bb-98.jpg", "descriptions": "Go head-to-head with an 800-lb gorilla all over again in the rerelease of Donkey Kong, part of the NES Classics series. As the story goes, Donkey Kong kidnaps a beautiful girl and Mario runs to the rescue. To reach the girl, however, Mario must avoid Donkey Kong's barrels, fireballs, andGo head-to-head with an 800-lb gorilla all over again in the rerelease of Donkey Kong, part of the NES Classics series. As the story goes, Donkey Kong kidnaps a beautiful girl and Mario runs to the rescue. To reach the girl, however, Mario must avoid Donkey Kong's barrels, fireballs, and bouncing rivets. Two players can take turns competing for the girl, either on the same Game Boy Advance or with the help of a Game Boy Advance Game Link Cable. … Expand"}, {"name": "NHL FaceOff 2003", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-faceoff-2003", "publisher": "SCEA", "release_date": "Nov  5 2002", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/a2246437f1cc6c1765649469049c9555-98.jpg", "descriptions": "A new presentation engine delivers a new level of emotion and intensity never seen before in the FaceOff franchise. Pre-game warm-ups, walks through the tunnel, players pushing and shoving between whistles, banter from the penalty box, post game celebrations and much more. [Sony]"}, {"name": "Codename: Outbreak", "details_link": "https://www.metacritic.com/game/pc/codename-outbreak", "publisher": "Virgin Interactive", "release_date": "Nov 24 2001", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 55, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/e1586d86534400f91e1e583ee3a10da0-98.jpg", "descriptions": "In the year 2034, Earth has barely escaped the collision with a comet. Passing in dangerous proximity to the Earth, the comet scorched the atmosphere and hundreds of meteorites poured their fiery rain down causing death and destruction and delivering alien life spores which started quicklyIn the year 2034, Earth has barely escaped the collision with a comet. Passing in dangerous proximity to the Earth, the comet scorched the atmosphere and hundreds of meteorites poured their fiery rain down causing death and destruction and delivering alien life spores which started quickly developing under the planet's conditions. Within several days after the catastrophe aliens spread across vast territories and captured many objectives. The game plot describes a military campaign to resist the invasion and the main character's participation in it.  [GSC Game World]… Expand"}, {"name": "Zack Zero", "details_link": "https://www.metacritic.com/game/pc/zack-zero", "publisher": "Crocodile Entertainment", "release_date": "Apr 29 2013", "developers": ["Crocodile Entertainment"], "platforms": ["PlayStation 3", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 55, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/52462cadee510e363eb48ef98ec2885e-98.jpg", "descriptions": "Zack Zero takes you on an action-packed platform adventure with incredible 3D graphics and the playability and entertainment of classic 2D games. Help Zack Zero save his beloved Marlene, kidnapped by the evil Zulrog in an effort to obtain the powerful substance that will allow him to travelZack Zero takes you on an action-packed platform adventure with incredible 3D graphics and the playability and entertainment of classic 2D games. Help Zack Zero save his beloved Marlene, kidnapped by the evil Zulrog in an effort to obtain the powerful substance that will allow him to travel back in time.… Expand"}, {"name": "IGPX: Immortal Grand Prix", "details_link": "https://www.metacritic.com/game/playstation-2/igpx-immortal-grand-prix", "publisher": "Namco Bandai Games America", "release_date": "Sep 12 2006", "developers": ["Namco Bandai Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/8cd7bcfbae9029420e91079bd04d1e58-98.jpg", "descriptions": "The thrill of the popular Cartoon Network series IGPX, comes to the PlayStation 2 in an exhilarating fashion. Delivering the intense chase as you battle against your opponents, IGPX provides a type of thrill never before experienced. By creating a strategic scenario with a variety ofThe thrill of the popular Cartoon Network series IGPX, comes to the PlayStation 2 in an exhilarating fashion. Delivering the intense chase as you battle against your opponents, IGPX provides a type of thrill never before experienced. By creating a strategic scenario with a variety of formations, players are able to participate in combinations with partners that will deliver high-impact attacks. [Namco Bandai]… Expand"}, {"name": "Blitzkrieg II: Fall of the Reich", "details_link": "https://www.metacritic.com/game/pc/blitzkrieg-ii-fall-of-the-reich", "publisher": "cdv Software", "release_date": "Feb 22 2007", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Tactics"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/61e90e5f706717be67e11298a01833f6-98.jpg", "descriptions": "Blitzkrieg 2: Fall of the Reich spans three major offensives from the final days of fighting on the Eastern front and covers both the Soviet and German campaigns in the long \"Siege of Budapest,” \"Fortress Kurland,\" and the Soviet \"Operation Bagration.\" Sixteen historically based missionsBlitzkrieg 2: Fall of the Reich spans three major offensives from the final days of fighting on the Eastern front and covers both the Soviet and German campaigns in the long \"Siege of Budapest,” \"Fortress Kurland,\" and the Soviet \"Operation Bagration.\" Sixteen historically based missions across 10 new maps will challenge beginning and veteran strategists as they try to either capture or defend the remnants of the German war machine during the final days of World War II in Europe. [CDV Software]… Expand"}, {"name": "Myst III: Exile", "details_link": "https://www.metacritic.com/game/xbox/myst-iii-exile", "publisher": "Ubisoft", "release_date": "Sep 22 2002", "developers": ["Presto Studios"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Adventure", "First-Person", "Fantasy"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/762f0287d98e0ad9a1416d4cb652a0e0-98.jpg", "descriptions": "In Myst III: Exile, you must track a new villain through several surrealistic Ages. Only by exploring the landscape and solving puzzles will you uncover the truth behind this new adversary. This chapter in the Myst series lets you pan 360 degrees within the environments, giving you moreIn Myst III: Exile, you must track a new villain through several surrealistic Ages. Only by exploring the landscape and solving puzzles will you uncover the truth behind this new adversary. This chapter in the Myst series lets you pan 360 degrees within the environments, giving you more freedom than ever before. Console versions of Myst III: Exile also include improved visuals, ambient sound, and a behind-the-scenes look at the making of Myst. … Expand"}, {"name": "Nadir: A Grimdark Deck Builder", "details_link": "https://www.metacritic.com/game/switch/nadir-a-grimdark-deck-builder", "publisher": "Black Eye Games", "release_date": "Feb  7 2023", "developers": ["Crunching Koalas"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/d0548095ff2c472894d0a983fe536c4f-98.jpg", "descriptions": "Nadir is a roguelike deck-builder with a twist: the cost to play a card is an enemy reaction you can predict. Craft your own cards to slay powerful demons. Gather resources, expand your city, grow in power and conquer the underworld."}, {"name": "Galaxy Warfighter", "details_link": "https://www.metacritic.com/game/switch/galaxy-warfighter", "publisher": "JoyBits", "release_date": "Apr 16 2020", "developers": ["Qplaze"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/e46ac0332acd704b6a7b4f94c972b0e7-98.jpg", "descriptions": "Taking its roots from the classic games in the shoot'em up genre, «Galaxy Warfighter» conveys the old ideas in a new way. Piloting your fighter ship, you have to fight hordes of enemies with unpredictable strategies and attack schemes. Well, and if you think that the usual enemies are tooTaking its roots from the classic games in the shoot'em up genre, «Galaxy Warfighter» conveys the old ideas in a new way. Piloting your fighter ship, you have to fight hordes of enemies with unpredictable strategies and attack schemes. Well, and if you think that the usual enemies are too easy, «Galaxy Warfighter» will put you face to face with the ruthless bosses. You should not underestimate them!… Expand"}, {"name": "Suicide Guy", "details_link": "https://www.metacritic.com/game/switch/suicide-guy", "publisher": "Chubby Pixel", "release_date": "May 10 2018", "developers": ["Chubby Pixel"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 55, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/a6ac727cf73533bfeeee33d6d6034782-98.jpg", "descriptions": "Suicide Guy is set in the incredibile and extraordinary dreams of its protagonist. What would you do in order to save the thing you love most? Immerse yourself into his weird dreams and help him to wake up before it's too late."}, {"name": "Robocraft Infinity", "details_link": "https://www.metacritic.com/game/xbox-one/robocraft-infinity", "publisher": "Freejam", "release_date": "Apr 11 2018", "developers": ["Freejam"], "platforms": "Xbox One", "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 55, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/e9fed368991abe5353bed5c5d2274b47-98.jpg", "descriptions": "Combine blocks in an easy-to-use editor to create whatever robot you desire. Jet cars, tanks, flying warships, helicopters, drones, dinosaurs, scorpions – the creative possibilities are endless. Jump into the pilot seat and take direct control of your robot in the testing grounds and againstCombine blocks in an easy-to-use editor to create whatever robot you desire. Jet cars, tanks, flying warships, helicopters, drones, dinosaurs, scorpions – the creative possibilities are endless. Jump into the pilot seat and take direct control of your robot in the testing grounds and against A.I. Learn where your robot is weakest and iterate to your heart’s content by swapping out components quickly and easily. Battle in multiple game modes optimized for fast-paced 5 vs 5 team combat against players from all over the world on dedicated servers.… Expand"}, {"name": "Touhou Genso Rondo: Bullet Ballet", "details_link": "https://www.metacritic.com/game/playstation-4/touhou-genso-rondo-bullet-ballet", "publisher": "NIS America", "release_date": "Sep  6 2016", "developers": ["Mediascape", "CUBETYPE"], "platforms": "PlayStation 4", "num_players": "2 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 55, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/81fea58193e443954f8f542a613c419c-98.jpg", "descriptions": "Touhou Genso Rondo is a remastered shoot 'em up that takes place in the Touhou universe."}, {"name": "Bohemian Killing", "details_link": "https://www.metacritic.com/game/pc/bohemian-killing", "publisher": "IQ Publishing", "release_date": "Jul 21 2016", "developers": ["The Moonwalls"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/eb01a4bc2d86e9727b4b6f1abceee2fb-98.jpg", "descriptions": "Nonlinear first person courtroom drama set in the streets of 19th century steampunk Paris. You find yourself on trial, accused of a brutal murder How far will you go to exonerate yourself? Will you lie?"}, {"name": "Magnetic: Cage Closed", "details_link": "https://www.metacritic.com/game/xbox-one/magnetic-cage-closed", "publisher": "Gambitious", "release_date": "Aug 28 2015", "developers": ["Guru Games"], "platforms": ["PC", "Xbox One"], "genres": ["Adventure", "3D", "First-Person", "Sci-Fi"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/b56796e3d3cf69d5881b679eb482818b-98.jpg", "descriptions": "Magnetic is a first person puzzle game that lets you manipulate and master magnetic forces. The mechanics are focused around a single tool: The Magnet Gun. This device is the only thing that helps you navigate the vast and deadly prison-maze youve been cast into."}, {"name": "The Amazing Spider-Man 2", "details_link": "https://www.metacritic.com/game/xbox-360/the-amazing-spider-man-2", "publisher": "Activision", "release_date": "Apr 29 2014", "developers": ["Beenox"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox One", "Xbox 360"], "genres": ["General", "Action", "Action Adventure", "General", "Open-World"], "meta_score": 55, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/c4962b9d469c98adff13e859fd206f79-98.jpg", "descriptions": "The Amazing Spider-Man, this all-new third-person action-adventure video game builds on the story of the previous game with an alternative take on the events of the upcoming movie, while also giving players an enhanced, free-roaming web-slinging experience through a greatly expanded New York City."}, {"name": "Battlestar Galactica", "details_link": "https://www.metacritic.com/game/xbox-360/battlestar-galactica", "publisher": "Sierra Online", "release_date": "Oct 24 2007", "developers": ["Auran"], "platforms": ["PC", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/6cddb6f32a3abebfb2741131d4df06fa-98.jpg", "descriptions": "[Xbox Live Arcade]  Sign up to defend the Galactica, or play as the ruthless Cylons as they seek to remove the Human Race from existence. Pilot iconic ships from the Viper II to the Heavy Raider and lead your squadron in enormous fast-action multiplayer space combat (with up to eight players[Xbox Live Arcade]  Sign up to defend the Galactica, or play as the ruthless Cylons as they seek to remove the Human Race from existence. Pilot iconic ships from the Viper II to the Heavy Raider and lead your squadron in enormous fast-action multiplayer space combat (with up to eight players online) or play through the exciting single-player campaign. Play online with up to eight players in this relentless space-based action shooter in Firefight, Skirmish, and Domination modes. Pilot four human and four Cylon ships, from the Viper II to the Heavy Raider, each with unique weapon capabilities. Special weapons: Coordinate attacks with an arsenal of destructive weapons including missiles, guns, and more. Defensive maneuvers: Avoid annihilation with the barrel roll, quick turnabouts, and other aerial moves. [Microsoft]… Expand"}, {"name": "Hard to be a God", "details_link": "https://www.metacritic.com/game/pc/hard-to-be-a-god", "publisher": "Akella", "release_date": "Oct 19 2007", "developers": ["Burut Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 55, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/2bef352eb9b97b887ed24b991f57ef7b-98.jpg", "descriptions": "A medieval universe and non-linear scenario based on the science-fiction novel, Hard to be a God, published in 1964, by the Soviet writers Arcady and Boris Strougatsky. A role playing game cleverly combining, adventure, espionage and science-fiction. A real and living world thanks to anA medieval universe and non-linear scenario based on the science-fiction novel, Hard to be a God, published in 1964, by the Soviet writers Arcady and Boris Strougatsky. A role playing game cleverly combining, adventure, espionage and science-fiction. A real and living world thanks to an advanced NPC system. Encounters of great depth: the attitude toward the hero changes considering the clothes he is wearing and his appearance, opening up a wider range of dialogues and leading to different possible results. A climatic change system featuring day/night alternation. More than 200 types of weapons and 200 types of armours. Access to futurist technology replaces the magic system. Journey throughout the Empire on horse back and fight. [Nobilis]… Expand"}, {"name": "GunGriffon: Allied Strike", "details_link": "https://www.metacritic.com/game/xbox/gungriffon-allied-strike", "publisher": "Tecmo", "release_date": "Dec 14 2004", "developers": ["Game Arts"], "platforms": "Xbox", "num_players": "8  Online", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/fa89d545c95912ce6c253d967615ad31-98.jpg", "descriptions": "GunGriffon takes place in a futuristic world where human factions fight for what's left of the earth's resources. As a renegade soldier, you are part of a group whose prime mission is to take down armored tanks. You'll have your own war machine, a \"High Mac\" (High-Mobility ArmoredGunGriffon takes place in a futuristic world where human factions fight for what's left of the earth's resources. As a renegade soldier, you are part of a group whose prime mission is to take down armored tanks. You'll have your own war machine, a \"High Mac\" (High-Mobility Armored Combat System) to help you fight ground machines and a battery of armed soldiers. This mech action game boasts full Xbox Live compatibility with a multiplayer online mode and a variety of intense missions.… Expand"}, {"name": "Blair Witch Volume III: The Elly Kedward Tale", "details_link": "https://www.metacritic.com/game/pc/blair-witch-volume-iii-the-elly-kedward-tale", "publisher": "Gathering", "release_date": "Nov 25 2000", "developers": ["Ritual Entertainment"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 55, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/7/16e21a5d67c8dfb6800c1c3c9bc2f2ab-98.jpg", "descriptions": "A suspense-filled action title with puzzle-solving elements and spell-based combat. Set in 1785, the game takes place a few weeks after Elly Kedward, the so-called Blair Witch, was banished to the dark woods surrounding the small town of Blair, Maryland. [Gathering of Developers]"}, {"name": "Trials of the Blood Dragon", "details_link": "https://www.metacritic.com/game/playstation-4/trials-of-the-blood-dragon", "publisher": "Ubisoft", "release_date": "Jun 13 2016", "developers": ["RedLynx"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 55, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/ab8b9b19052746042ae650709b015c1e-98.jpg", "descriptions": "The year is 2019. Roxanne and Slayter, the offspring of the legendary Rex Power Colt, are going to Vietnam War 4 to save freedom, and save the world."}, {"name": "Fable Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/fable-heroes", "publisher": "Microsoft Game Studios", "release_date": "May  2 2012", "developers": ["Lionhead Studios"], "platforms": "Xbox 360", "genres": ["Action", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 55, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/6/a00c44108872e2f0d4134a6ac3f56aaa-98.jpg", "descriptions": "Fable Heroes is an action-packed, hack-and-slash adventure built for Xbox LIVE Arcade. It delivers a fresh spin on the \"Fable\" franchise with a unique art style and gameplay that takes playful competition to the next level, with four-player multiplayer time trials and leaderboardsFable Heroes is an action-packed, hack-and-slash adventure built for Xbox LIVE Arcade. It delivers a fresh spin on the \"Fable\" franchise with a unique art style and gameplay that takes playful competition to the next level, with four-player multiplayer time trials and leaderboards on Xbox LIVE.* Whether on the couch or using Xbox LIVE co-op, players work together to defeat enemies while also competing with one another to collect gold coins and level up.… Expand"}, {"name": "Diner Dash: Sizzle & Serve", "details_link": "https://www.metacritic.com/game/psp/diner-dash-sizzle-serve", "publisher": "Eidos Interactive", "release_date": "May 22 2007", "developers": ["PlayFirst", "GameLab"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/2952e0bb4f06860d1240676f7ab64c50-98.jpg", "descriptions": "No show of superhuman speed goes unappreciated in this fast-paced game of culinary satisfaction. Play as Flo and serve yummy dishes, clean up icky messes, and keep your critic happy to score top reviews in this game that makes you work for your pay!  But watch out for screaming babies, longNo show of superhuman speed goes unappreciated in this fast-paced game of culinary satisfaction. Play as Flo and serve yummy dishes, clean up icky messes, and keep your critic happy to score top reviews in this game that makes you work for your pay!  But watch out for screaming babies, long wait times, and noisy cell-phone talkers – they may make your other guests unhappy. Only you hold the key to restaurant bliss in this game that makes you the master of your very own restaurant empire. [Eidos Interactive]… Expand"}, {"name": "Iron Front: Liberation 1944", "details_link": "https://www.metacritic.com/game/pc/iron-front-liberation-1944", "publisher": "Deep Silver", "release_date": "May 25 2012", "developers": ["X1 Software"], "platforms": "PC", "genres": ["Strategy", "General", "General"], "meta_score": 55, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/65026db965960e4ebbbf4958cd593927-98.jpg", "descriptions": "The player takes on the role of a Russian or German infantryman, using teamwork, tactical skill and authentic war machines to battle for victory. The German campaign focuses on slowing the advance of the Soviet troops, while the Soviet campaign is all about breaking through the enemy'sThe player takes on the role of a Russian or German infantryman, using teamwork, tactical skill and authentic war machines to battle for victory. The German campaign focuses on slowing the advance of the Soviet troops, while the Soviet campaign is all about breaking through the enemy's resistance. However, the player does not have to do all this on foot: Using their computers, tacticians will control tanks, including the famous German battle tank Panzerkampfwagen VI or \"Königstiger\" and the Russian Stalin tank JS2, or fighter planes such as the Focke Wulf 190 and dive bombers like the Stuka or the Petlyakov PE-2.… Expand"}, {"name": "Rune Factory: Tides of Destiny", "details_link": "https://www.metacritic.com/game/playstation-3/rune-factory-tides-of-destiny", "publisher": "Natsume", "release_date": "Oct  7 2011", "developers": ["Neverland"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Action RPG"], "meta_score": 55, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/39cd6ef0fed0bf1ec168309fe84bb159-98.jpg", "descriptions": "Featuring a vast region to explore, a wonderful cast of characters, and a huge variety of activities to enjoy, Rune Factory: Tides of Destiny is sure to make waves! Aden and Sonja, two lifelong friends, live a tranquil life on Fenith Island until they're struck by a mysterious curse: theyFeaturing a vast region to explore, a wonderful cast of characters, and a huge variety of activities to enjoy, Rune Factory: Tides of Destiny is sure to make waves! Aden and Sonja, two lifelong friends, live a tranquil life on Fenith Island until they're struck by a mysterious curse: they awaken to find both of their souls are now trapped in the same body! On top of this unusual calamity, the Fenith they knew is gone, replaced by a strange island populated with unfamiliar faces. Only by exploring this new world will they be able to solve the mystery of this curse and save their beloved Island. During the course of their journey, Aden and Sonja will be aided by a colorful cast of characters, as well as take command of the towering golem Ymir. Using their newfound giant friend, they'll cross vast seas, discover hidden islands and dungeons packed with riches, and battle fearsome monsters of the deep!… Expand"}, {"name": "Mario & Sonic at the Sochi 2014 Olympic Winter Games", "details_link": "https://www.metacritic.com/game/wii-u/mario-sonic-at-the-sochi-2014-olympic-winter-games", "publisher": "Nintendo", "release_date": "Nov 15 2013", "developers": ["Nintendo", "Sega Sports R&D"], "platforms": "Wii U", "num_players": "Up to 4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 55, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/a2031f2b3371c359dd00ddd3507a0d02-98.jpg", "descriptions": "Join Mario and Sonic and the rest of your favorite characters as they team up and compete in events at the Sochi 2014 Olympic Winter Games."}, {"name": "Mighty No. 9", "details_link": "https://www.metacritic.com/game/xbox-one/mighty-no-9", "publisher": "Deep Silver", "release_date": "Jun 21 2016", "developers": ["Inti Creates"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 55, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/9/4895684fe1ebab62c21afdaf0d118f37-98.jpg", "descriptions": "Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots,Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots, and the only one not infected by a mysterious computer virus that has caused mechanized creatures the world over to go berserk. Run, jump, blast, and transform your way through six stages (or more, via stretch goals) you can tackle in any order you choose, using weapons and abilities stolen from your enemies to take down your fellow Mighty Number robots and confront the final evil that threatens the planet. Once, you worked together, side-by-side but now, your fellow Mighty No. robots have lashed out, taking over key strategic locations across the globe and infesting them with their minions. You have no choice: the other Mighty Numbers...Must. Be. Destroyed.… Expand"}, {"name": "Criminal Girls: Invite Only", "details_link": "https://www.metacritic.com/game/playstation-vita/criminal-girls-invite-only", "publisher": "NIS America", "release_date": "Feb  3 2015", "developers": ["Image Epoch", "Imageepoch"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 55, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/e66cff6f51fae77bfc1ee18818a0e708-98.jpg", "descriptions": "7 delinquents, 7 sins, and only one way out. Just hired for a new, mysterious job, you quickly discover that this is not your routine prison gig. You have been entrusted with the care of a crew of girls whose sins have damned their souls to Hell and an eternity of punishment... Their sole7 delinquents, 7 sins, and only one way out. Just hired for a new, mysterious job, you quickly discover that this is not your routine prison gig. You have been entrusted with the care of a crew of girls whose sins have damned their souls to Hell and an eternity of punishment... Their sole hope of salvation is for you to recognize their unique histories, and to guide them along the path to redemption. Navigate through the four trials of the Redemption Program, and motivate your crew of delinquents to learn the skills to redeem themselves. [NIS America]… Expand"}, {"name": "Yar's Revenge", "details_link": "https://www.metacritic.com/game/xbox-360/yars-revenge", "publisher": "Atari", "release_date": "Apr 13 2011", "developers": ["Killspace Entertainment"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 55, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/536b0b7baef5cf8cf1d8ea6f349c5dab-98.jpg", "descriptions": "In Yars', players will take on the role of a nameless Yar, who has been brainwashed by the evil Qotile empire to do their bidding.  After being shot down and rescued by the ancient and mysterious Bar Yargler, she sets off on a ferociously focused mission, to seek revenge on her former masterIn Yars', players will take on the role of a nameless Yar, who has been brainwashed by the evil Qotile empire to do their bidding.  After being shot down and rescued by the ancient and mysterious Bar Yargler, she sets off on a ferociously focused mission, to seek revenge on her former master and his deadly squad of assassins. The bio-technological nightmare of the Qotile home world provides stunning backdrops for players to fly through in aerial combat with their enemy.  … Expand"}, {"name": "MX vs ATV Legends", "details_link": "https://www.metacritic.com/game/playstation-5/mx-vs-atv-legends", "publisher": "THQ Nordic", "release_date": "Jun 28 2022", "developers": ["Rainbow Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 16 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 55, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/9/1df797a70c3a6e7f8c0ee6fbe05edead-98.jpg", "descriptions": "MX vs ATV Legends is the latest installment within the MX vs ATV offroad racing universe. Players live the fantasy of becoming a world-famous, professional offroad rider. They´ll bask in the glory of fame and the adulation of both fans and sponsors alike while playing the career and onlineMX vs ATV Legends is the latest installment within the MX vs ATV offroad racing universe. Players live the fantasy of becoming a world-famous, professional offroad rider. They´ll bask in the glory of fame and the adulation of both fans and sponsors alike while playing the career and online modes. Race in 2 player split-screen and 16-player online mode with squad-based gameplay. Experience the brand new Trails mode for high intensity outdoor racing, - each turn can present new surprises, challenging your drivestyle in new ways. Compete in the new career mode where your choices lead to different paths, sponsorship opportunities and special invitational events. Experience the brand new Trails mode for high intensity outdoor racing, - each turn can present new surprises, challenging your drivestyle in new ways. Feel the refined physics system for higher precision racing even in the toughest situations like riding berms and ruts. Endure dynamic weather like rain and snow which adds a new dynamic to chasing the podium.… Expand"}, {"name": "Alone in the Dark", "details_link": "https://www.metacritic.com/game/pc/alone-in-the-dark", "publisher": "THQ Nordic", "release_date": "TBA", "developers": ["Pieces Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 0, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/5f286620e456c3b8bed8c4c1680136ad-98.jpg", "descriptions": "Deep in the 1920's south, Emily Hartwood's uncle has gone missing. Together with private investigator Edward Carnby, she embarks on a journey to Derceto Manor to uncover the secrets of this mysterious place and the circumstances of her relative's vanishing. Return to Derceto Manor in thisDeep in the 1920's south, Emily Hartwood's uncle has gone missing. Together with private investigator Edward Carnby, she embarks on a journey to Derceto Manor to uncover the secrets of this mysterious place and the circumstances of her relative's vanishing. Return to Derceto Manor in this reimagination of Alone in the Dark, a love letter to the 90's cult classic horror game. Encounter strange residents, nightmarish realms, dangerous monsters and ultimately unveil a plot of rising evil. At the intersection of reality, mystery, and insanity, an adventure waits that will challenge your core beliefs.Who can you trust, what will you believe, and what will you do next?… Expand"}, {"name": "Medal of Honor: Warfighter", "details_link": "https://www.metacritic.com/game/pc/medal-of-honor-warfighter", "publisher": "Electronic Arts", "release_date": "Oct 23 2012", "developers": ["Danger Close"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Modern", "Arcade"], "meta_score": 55, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/ace3e3341667b055234243721b5063e8-98.jpg", "descriptions": "Written by active U.S. Tier 1 Operators while deployed overseas and inspired by real world threats, Medal of Honor Warfighter delivers an aggressive, gritty, and authentic experience that puts gamers in the boots of today's most precise and disciplined warrior. Medal of Honor Warfighter isWritten by active U.S. Tier 1 Operators while deployed overseas and inspired by real world threats, Medal of Honor Warfighter delivers an aggressive, gritty, and authentic experience that puts gamers in the boots of today's most precise and disciplined warrior. Medal of Honor Warfighter is an up close and personal look at today's battlefield and the fight against the ongoing global terror threat.… Expand"}, {"name": "DreadOut", "details_link": "https://www.metacritic.com/game/pc/dreadout", "publisher": "Digital Happiness", "release_date": "May 15 2014", "developers": ["Digital Happiness"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Survival"], "meta_score": 55, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/4d13332f0dacd6c9d77a688c4d1dcec6-98.jpg", "descriptions": "When a group of high school students stray from their vacation trip, they discover an old deserted town. They begin to realize that something sinister is happening as soon as they enter the town. Linda, as the main protagonist, feels the stirrings of a strange and mystical power withinWhen a group of high school students stray from their vacation trip, they discover an old deserted town. They begin to realize that something sinister is happening as soon as they enter the town. Linda, as the main protagonist, feels the stirrings of a strange and mystical power within herself. This spiritual power just might be the only way to save herself and her friends from an unknown evil..… Expand"}, {"name": "WWE Survivor Series", "details_link": "https://www.metacritic.com/game/game-boy-advance/wwe-survivor-series", "publisher": "THQ", "release_date": "Oct 12 2004", "developers": ["Natsume"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 55, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/15f4f19e20d3eaf2866086e4599c22bf-98.jpg", "descriptions": "Get in the ring with the WWE's top superstars in WWE Survivor Series for the Game Boy Advance. You must fight through the ranks and challenge for the belts to become the champion in the all-new single-player mode. Turn the tables on the match with the new reversal system and momentum shifts.Get in the ring with the WWE's top superstars in WWE Survivor Series for the Game Boy Advance. You must fight through the ranks and challenge for the belts to become the champion in the all-new single-player mode. Turn the tables on the match with the new reversal system and momentum shifts. Survivor Series also lets you link up with your friends in eight match types, including cage, tag team, \"fatal four-way,\" and more.… Expand"}, {"name": "Rabbids Travel in Time 3D", "details_link": "https://www.metacritic.com/game/3ds/rabbids-travel-in-time-3d", "publisher": "Ubisoft", "release_date": "Apr 10 2011", "developers": ["Ubisoft"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "Adventure", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/9af05fad1e046ca8ea0a5c0f47b2e496-98.jpg", "descriptions": "Rabbids are bwaaack and this time they have an infallible plan: travel back in time and invade human history! Plunge into the past with the wacky Rabbids and revisit the greatest moments of history like the discovery of fire, the broken nose of the Sphinx or the legend of Arthur. Uncover howRabbids are bwaaack and this time they have an infallible plan: travel back in time and invade human history! Plunge into the past with the wacky Rabbids and revisit the greatest moments of history like the discovery of fire, the broken nose of the Sphinx or the legend of Arthur. Uncover how Rabbids wreaked havoc and changed the course of history...… Expand"}, {"name": "Crasher", "details_link": "https://www.metacritic.com/game/pc/crasher", "publisher": "Mindscape Inc.", "release_date": "Jan 28 2011", "developers": ["Punchers Impact"], "platforms": "PC", "genres": ["Simulation", "Driving", "Car Combat", "Vehicle", "Combat"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/23fdc0f50d32c25f59032eae52a75bef-98.jpg", "descriptions": "Crasher falls into the category of M.O.B.A.’s (multiplayer online battle arenas) and has new features called \"Stars,\" which are unique vehicles engaged in team combats or \"TvsT\" (Team vs Team), with a strong RPG aspect. The game requires team play: each team has itsCrasher falls into the category of M.O.B.A.’s (multiplayer online battle arenas) and has new features called \"Stars,\" which are unique vehicles engaged in team combats or \"TvsT\" (Team vs Team), with a strong RPG aspect. The game requires team play: each team has its tactics and each vehicle has its arsenal (heavy itemization) and skills (spell) in order to head straight for victory. A \"league\" mode where the players overtake areas and destroy bases (ladder rankings), various arcade modes, last man standing, death match, etc, are also featured. The final touch remains the Garage mode, which allows to unlock new \"Stars\" and new achievements in order to enhance a player’s equipment and customize his/her vehicle to the fullest.… Expand"}, {"name": "Teenage Mutant Ninja Turtles (2003)", "details_link": "https://www.metacritic.com/game/pc/teenage-mutant-ninja-turtles-2003", "publisher": "Konami", "release_date": "Nov 25 2003", "developers": ["Konami"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "Fighting", "2D", "3D"], "meta_score": 55, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/770e1492602813ce9af1e5596d096c74-98.jpg", "descriptions": "Be your favorite Teenage Mutant Ninja Turtle and master your ultimate ninja skills in their action packed world. Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of Foot Ninjas. Master ninja butt-kickin'Be your favorite Teenage Mutant Ninja Turtle and master your ultimate ninja skills in their action packed world. Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of Foot Ninjas. Master ninja butt-kickin' skills in action-based gameplay. Discover scrolls and items to unlock special attack moves and effects. Interact with characters such as Splinter and Casey Jones . Faithful representation of the FoxBox's TMNT animated series. [Konami]… Expand"}, {"name": "Endless Ages", "details_link": "https://www.metacritic.com/game/pc/endless-ages", "publisher": "Summitsoft Entertainment", "release_date": "Jun 27 2003", "developers": ["Avaria"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/33a3ec9ddf039013012d1d1260de346a-98.jpg", "descriptions": "Nature is used to describe the endless struggle that rages across the universe where only the strong survive. Time after time the defenseless suffer while the strong and ruthless control the fate of the weak. Each being lives and dies, each finding their place and each wondering what willNature is used to describe the endless struggle that rages across the universe where only the strong survive. Time after time the defenseless suffer while the strong and ruthless control the fate of the weak. Each being lives and dies, each finding their place and each wondering what will happen when their candle finally burns out. When it finally happens, very few find themselves correct. [Summitsoft]… Expand"}, {"name": "Space Channel 5: Ulala's Cosmic Attack", "details_link": "https://www.metacritic.com/game/game-boy-advance/space-channel-5-ulalas-cosmic-attack", "publisher": "THQ", "release_date": "Jun 17 2003", "developers": ["Art"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 55, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/6b4f56dfcd1f4a863e19a353f6544ef7-98.jpg", "descriptions": "Meet Ulala, the grooviest reporter in the galaxy! She's got the attitude, the moves, and the savvy to scoop a story, all while saving the universe from invading Morolians."}, {"name": "Zapper", "details_link": "https://www.metacritic.com/game/gamecube/zapper", "publisher": "Infogrames", "release_date": "Nov  6 2002", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 55, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/3/6857c889a8fccdf09f327e188150b06d-98.jpg", "descriptions": "In Zapper, you play a small creature that embarks on a great quest. Zapper is a cricket in search of brother Zipper, who was kidnapped by the evil Maggie the Magpie. Through 18 twisted levels, you'll evade bizarre enemies and deadly hazards using your electrified antennae and springyIn Zapper, you play a small creature that embarks on a great quest. Zapper is a cricket in search of brother Zipper, who was kidnapped by the evil Maggie the Magpie. Through 18 twisted levels, you'll evade bizarre enemies and deadly hazards using your electrified antennae and springy reflexes. Zap your foes, explore your surroundings, and find and destroy eggs before they hatch. Zapper's intense action continues as you unlock hidden areas, bonus levels, and play multiplayer games.… Expand"}, {"name": "Conflict: Desert Storm", "details_link": "https://www.metacritic.com/game/playstation-2/conflict-desert-storm", "publisher": "Gotham Games", "release_date": "Sep 30 2002", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 55, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/12787237c888056ac6836659c24e2977-98.jpg", "descriptions": "You're the best trained, best equipped Special Forces squad in the world. You have been deployed behind teh enemy lines where the terrain and conditions are barbaric. You will seek, locate and destroy the enemy while creating havoc and confusion against insane odds. [SCI Games]"}, {"name": "Driven", "details_link": "https://www.metacritic.com/game/gamecube/driven", "publisher": "Bam Entertainment", "release_date": "Mar 30 2002", "developers": ["Bam Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "genres": ["Driving", "Racing", "Formula One"], "meta_score": 55, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/b83ae56c9a06155008a6c1ac44b705b0-98.jpg", "descriptions": "Inspired by Sylvester Stallone's hit movie 'DRIVEN', race on 8 stunning tracks including California's Angel's Bay and Paris' Champs-Élysees. \r\rChallenge your racing skills in multiple racing styles - Arcade, Story and Multiplayer modes (2 player split screen). \rChoose from 12Inspired by Sylvester Stallone's hit movie 'DRIVEN', race on 8 stunning tracks including California's Angel's Bay and Paris' Champs-Élysees. \r\rChallenge your racing skills in multiple racing styles - Arcade, Story and Multiplayer modes (2 player split screen). \rChoose from 12 characters, each with distinct personalities and driving styles. \rExperience high impact crash sequences and even race through busy city streets. \rExclusive team mode - race as lead driver and blocker. \rFeaturing the vocal talents of Sylvester Stallone, Greg Proops and Eric Myers.… Expand"}, {"name": "Might and Magic IX", "details_link": "https://www.metacritic.com/game/pc/might-and-magic-ix", "publisher": "3DO", "release_date": "Mar 28 2002", "developers": ["3DO"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 55, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/5/2ce453be7b2072b3e26f01b134502962-98.jpg", "descriptions": "Explore a graphically realistic universe filled with dark foreboding dungeons and lush outdoor environments. Create and lead a party of four player characters and up to three non-player characters in your quest. Develop each character's skills in the talents of either Might or Magic. MasterExplore a graphically realistic universe filled with dark foreboding dungeons and lush outdoor environments. Create and lead a party of four player characters and up to three non-player characters in your quest. Develop each character's skills in the talents of either Might or Magic. Master the new intuitive interface, new Spell Combat system, and new Conversation system. It's a whole new adventure with an all-new look. [3DO]… Expand"}, {"name": "The Seven Deadly Sins: Knights of Britannia", "details_link": "https://www.metacritic.com/game/playstation-4/the-seven-deadly-sins-knights-of-britannia", "publisher": "Bandai Namco Games", "release_date": "Feb  9 2018", "developers": ["Bandai Namco Games", "NATSUME ATARI Inc."], "platforms": "PlayStation 4", "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/43fd3c1aac9237856d336238857004ec-98.jpg", "descriptions": "Assemble the Seven Deadly Sins and fight to save the Kingdom of Lioness in The Seven Deadly Sins: Knights of Britannia. Based on the manga, The Seven Deadly Sins by Nabaka Suzuki, enjoy stories of adventure and experience all of the action and excitement from the anime. Play throughAssemble the Seven Deadly Sins and fight to save the Kingdom of Lioness in The Seven Deadly Sins: Knights of Britannia. Based on the manga, The Seven Deadly Sins by Nabaka Suzuki, enjoy stories of adventure and experience all of the action and excitement from the anime. Play through memorable fights with famous characters such as Meliodas, Elizabeth, Hawk, and others in all of their unique fighting styles.\r FEATURES:\r * Assemble the Seven Deadly Sins: The popular hit anime The Seven Deadly Sins comes to console for the very first time.\r * Lush Environments: The world of Britannia comes to life in a scenic 3D environment, made possible by the power of the PS4.\r * Action Oriented: A high-tension and fast-paced action fighting style that is expected of the popular anime series.\r * Adventurous Storyline: Experience an enticing story line with your favorite characters to choose from and plenty of places in Britannia to explore.… Expand"}, {"name": "Showdown: Legends of Wrestling", "details_link": "https://www.metacritic.com/game/playstation-2/showdown-legends-of-wrestling", "publisher": "Acclaim", "release_date": "Jun 22 2004", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/d9259d989ac6d7e77ef13e079823fb54-98.jpg", "descriptions": "Legends of Wrestling: SHOWDOWN is the exclusive supercard of the immortals! Battle through the annals of time clashing with the greatest grapplers to set foot in the squared circle. Create dream matches, unlock classic feuds and travel down the path of pain in the first-ever era-based careerLegends of Wrestling: SHOWDOWN is the exclusive supercard of the immortals! Battle through the annals of time clashing with the greatest grapplers to set foot in the squared circle. Create dream matches, unlock classic feuds and travel down the path of pain in the first-ever era-based career mode to see if you have what it takes to beat the icons of professional wrestling! The only game with over 70 of the greatest ring warriors ever, including the recently announced Ultimate Warrior! Brand new \"Ready To Brawl\" controls for ultimate mat mayhem. Bone-breaking matches including Table, First Blood, Ladder, Cage, Battle Royal, 6 & 8 Man Elimination Bouts, Handicap, plus 3 & 4 Way Dances. Travel down the path of pain in the all-new era-based, feud-driven career mode. Never-before-seen Classic Matches with hidden licensed arenas. Two-man commentary. Wrestling tutorial from the \"excellence of execution\" Bret \"Hitman\" Hart. Create-A-Legend returns with all new textures allowing players to make their ultimate icon of wrestling. Signature entrances and taunts for each Legend, including all new licensed music composed by \"Mouth of the South\" Jimmy Hart. [Acclaim]… Expand"}, {"name": "Alien Spidy", "details_link": "https://www.metacritic.com/game/xbox-360/alien-spidy", "publisher": "Kalypso", "release_date": "Mar 20 2013", "developers": ["Enigma Software Productions"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Adventure", "General", "General", "Platformer", "2D"], "meta_score": 55, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/bcfd77c8e85950336345e0f062e13965-98.jpg", "descriptions": "Alien Spidy is a challenging platform adventure game set in a visually stunning 2D/3D environment."}, {"name": "NBA Ballers: Chosen One", "details_link": "https://www.metacritic.com/game/xbox-360/nba-ballers-chosen-one", "publisher": "Midway", "release_date": "Apr 21 2008", "developers": ["Midway"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 55, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/7/3b8399c5ece25bc1c093f22fb33d3063-98.jpg", "descriptions": "NBA Ballers: Chosen One is a fantasy basketball entertainment experience featuring one-on-one and two-on-two action with the NBA's elite players. More than 65 of the NBA's top superstar athletes come to life as the NBA Ballers franchise continues its legacy. NBA Ballers: Chosen One putsNBA Ballers: Chosen One is a fantasy basketball entertainment experience featuring one-on-one and two-on-two action with the NBA's elite players. More than 65 of the NBA's top superstar athletes come to life as the NBA Ballers franchise continues its legacy. NBA Ballers: Chosen One puts players up-close and into the action with new \"action movie\" style game cameras that highlight every move. Create-a-Baller and take on the challenge of the epic \"Chosen One Tournament\", brought to you live from the most exotic courts around the world. As you progress through the game, earn the right to use an NBA star's \"Shut 'Em Down\" Super Move or take your Baller online to test your playing skills against others. [Midway]… Expand"}, {"name": "Fade to Silence", "details_link": "https://www.metacritic.com/game/playstation-4/fade-to-silence", "publisher": "THQ Nordic", "release_date": "Apr 30 2019", "developers": ["Black Forest Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 55, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/1/10319356aae240eaefcbc663cf6409ca-98.jpg", "descriptions": "Fade to Silence is a Survival-RPG set in the cold and deadly world of a post-apocalyptic winter. You assume the role of Ash, a natural but tormented leader, exploring a post-apocalyptic frozen wasteland, gathering the resources necessary to establish a refuge for survival. With dwindlingFade to Silence is a Survival-RPG set in the cold and deadly world of a post-apocalyptic winter. You assume the role of Ash, a natural but tormented leader, exploring a post-apocalyptic frozen wasteland, gathering the resources necessary to establish a refuge for survival. With dwindling supplies, simple tasks like upgrading equipment and collecting materials require an immediate expedition to scavenge the necessary items. In the search for survival materials, players must navigate a vast territory, in which they will encounter Eldritch monsters and an even greater foe; the unrelenting winter. While freezing temperatures constantly take their toll on Ash, the deadliest event is a constant threat – a blizzard. If caught by surprise, it takes every ounce of skill, determination and luck to survive.… Expand"}, {"name": "Woolfe - The Red Hood Diaries", "details_link": "https://www.metacritic.com/game/pc/woolfe---the-red-hood-diaries", "publisher": "GriN Multimedia", "release_date": "May 17 2015", "developers": ["GriN Multimedia"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 55, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/ed1d53d2b53bbfb105dc8eec5459ae5f-98.jpg", "descriptions": "A cinematic fable featuring a vengeful Red Riding Hood. This twisted fairytale is presented as a 2.5D platformer in which our heroine runs, jumps, and puzzles her way through a rich fantasy setting of a once blooming city and evil forests, wielding her trusted axe."}, {"name": "The War of the Worlds", "details_link": "https://www.metacritic.com/game/xbox-360/the-war-of-the-worlds", "publisher": "Paramount Digital Entertainment", "release_date": "Oct 26 2011", "developers": ["Other Ocean Interactive"], "platforms": "Xbox 360", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 55, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/ecbd4fa4ad18b2a8f12c6d8f53a89469-98.jpg", "descriptions": "The War of the Worlds is a 2D cinematic platformer inspired by the work of author H.G. Wells"}, {"name": "Mugen Souls", "details_link": "https://www.metacritic.com/game/playstation-3/mugen-souls", "publisher": "NIS America", "release_date": "Oct 16 2012", "developers": ["Compile Heart", "GCREST"], "platforms": ["PC", "Switch", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 55, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/e693abd2ce994b55d57141f725f5eb3e-98.jpg", "descriptions": "There exists a small galaxy in the universe containing seven worlds, shimmering in seven colors... These worlds exist and act independent of one another. This has allowed them to develop and nurture rich, unique cultures. Then one day, a decree was sent out..."}, {"name": "Warhammer Quest", "details_link": "https://www.metacritic.com/game/pc/warhammer-quest", "publisher": "Chilled Mouse", "release_date": "Jan  7 2015", "developers": ["Rodeo Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General", "Fantasy"], "meta_score": 55, "users_score": 2.7, "image": "https://static.metacritic.com/images/products/games/0/75353fe23264f020311e32acb9b37350-98.jpg", "descriptions": "Helm a party of brave adventurers through the dangerous dungeons of the Warhammer world in the search for wealth and fame, as players uncover and explore new settlements.  In their quest for legendary weapons, players encounter enemies including evil Night Goblins, dangerous Orcs, giganticHelm a party of brave adventurers through the dangerous dungeons of the Warhammer world in the search for wealth and fame, as players uncover and explore new settlements.  In their quest for legendary weapons, players encounter enemies including evil Night Goblins, dangerous Orcs, gigantic River Trolls and hordes of the evil Skaven, hellbent on destroying the band of adventurers. … Expand"}, {"name": "Order Up!!", "details_link": "https://www.metacritic.com/game/playstation-3/order-up!!", "publisher": "Ignition Entertainment", "release_date": "Mar  1 2012", "developers": ["SuperVillain Studios"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Miscellaneous", "General", "General", "General", "Virtual", "Career"], "meta_score": 55, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/9/ac009bc80debf175ba9c9dd589703453-98.jpg", "descriptions": "Aspiring chefs, get ready to sharpen your knives and put your short order skills to the test in Order Up."}, {"name": "Cake Mania", "details_link": "https://www.metacritic.com/game/ds/cake-mania", "publisher": "Majesco Games", "release_date": "Apr  9 2007", "developers": ["Digital Embryo"], "platforms": ["PC", "DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/b84617fba474828072bd985eabb7578a-98.jpg", "descriptions": "Based on the hit online game from Sandlot Games, Cake Mania for the Nintendo DS translates this fast-paced culinary crisis into a Touch Screen experience. Wait for customer requests, bake their cakes, ice and decorate them, then hand them out and collect your cash. Serve up seasonalBased on the hit online game from Sandlot Games, Cake Mania for the Nintendo DS translates this fast-paced culinary crisis into a Touch Screen experience. Wait for customer requests, bake their cakes, ice and decorate them, then hand them out and collect your cash. Serve up seasonal confectionary delights to a variety of customers and see if you have what it takes to save the Evans' Bakery! [Majesco]… Expand"}, {"name": "BlowOut", "details_link": "https://www.metacritic.com/game/xbox/blowout", "publisher": "Majesco Games", "release_date": "Nov 26 2003", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 55, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/a90b1a25b031bd5e0f3ea996b050d064-98.jpg", "descriptions": "As Major John \"Dutch\" Cane, you'll lead an elite platoon of mercenary commandos, outfitted with the most deadly experimental weaponry, into the pit of evil. It's your job to rid the world of mutated beasts and alien insects through 10 levels of intense action. To ensure your team'sAs Major John \"Dutch\" Cane, you'll lead an elite platoon of mercenary commandos, outfitted with the most deadly experimental weaponry, into the pit of evil. It's your job to rid the world of mutated beasts and alien insects through 10 levels of intense action. To ensure your team's success, the military has given you access to a variety of weapons, including a 20mm pump-action shotgun, eight-meter flamethrower, plasma rifle, machine gun, and an eight-inch nailgun. Blast through walls, ceilings, and floors to discover secrets and power-ups that enhance your weapons.… Expand"}, {"name": "Trinity: Souls of Zill O'll", "details_link": "https://www.metacritic.com/game/playstation-3/trinity-souls-of-zill-oll", "publisher": "Koei", "release_date": "Feb  8 2011", "developers": ["Omega Force"], "platforms": "PlayStation 3", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 55, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/4c8d9c43edb35e18eb8c549c13b182b3-98.jpg", "descriptions": "For years, Omega Force has transcended the action genre to create one of video gaming's most legendary franchises. Now, it will unleash its imagination on the realm of fantasy with the upcoming TRINITY: Souls of Zill O'll."}, {"name": "SpellForce 2: Faith in Destiny", "details_link": "https://www.metacritic.com/game/pc/spellforce-2-faith-in-destiny", "publisher": "Nordic Games Publishing", "release_date": "Jun 19 2012", "developers": ["JoWooD Entertainment AG"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Role-Playing", "PC-style RPG", "PC-style RPG", "Western-Style"], "meta_score": 55, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/6e4dd17f761133ee7a5c0ec0bc5040e2-98.jpg", "descriptions": "What will lie beyond the gates of reality? SpellForce 2: Faith In Destiny finally brings all the different storylines from the previous SpellForce titles together. Combines Role Playing & Strategy Genre in a uniquely successful way New Multiplayer modes and maps guarantee a richerWhat will lie beyond the gates of reality? SpellForce 2: Faith In Destiny finally brings all the different storylines from the previous SpellForce titles together. Combines Role Playing & Strategy Genre in a uniquely successful way New Multiplayer modes and maps guarantee a richer SpellForce experience both online and offline (MMO-like features while preserving all the richness of the SpellForce universe)… Expand"}, {"name": "Warhammer: Battle March", "details_link": "https://www.metacritic.com/game/xbox-360/warhammer-battle-march", "publisher": "Namco Bandai Games", "release_date": "Sep  2 2008", "developers": ["Black Hole Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/066736a2878c93ece5ba5c541423d496-98.jpg", "descriptions": "On the Xbox 360, Warhammer: Battle March includes the original content from Warhammer: Mark of Chaos as well as all-new features, intuitive control schemes and support for online play via the Xbox LIVE. Thrusting players into Games Workshop's renowned fantasy world, players control sixOn the Xbox 360, Warhammer: Battle March includes the original content from Warhammer: Mark of Chaos as well as all-new features, intuitive control schemes and support for online play via the Xbox LIVE. Thrusting players into Games Workshop's renowned fantasy world, players control six unique armies – the Empire, Chaos, Skaven, High Elves as well as the all-new Dark Elf and Orcs & Goblins forces – as they battle for supremacy in a world torn apart by constant warfare. The individual units of each army can be customized in great detail, allowing players to put their own mark on their fighting force and strike fear into their opponents with terrifying combinations of weaponry and armor. Players can also control Heroes and Champions for each army, high-powered units that gain new abilities as they tear through the opposition. Placing the focus of gameplay on combat and tactics rather than tedious resource management, Warhammer: Battle March on the Xbox 360 features two control schemes for both master battlefield tacticians and novice warriors that offer full control over all aspects of the player’s army. On Xbox LIVE, up to four players can engage in massive multi-army clashes in head-to-head and team-based modes of play. [Namco Bandai Games]… Expand"}, {"name": "Scooby-Doo! Mystery Mayhem", "details_link": "https://www.metacritic.com/game/playstation-2/scooby-doo!-mystery-mayhem", "publisher": "THQ", "release_date": "Mar  2 2004", "developers": ["Artificial Mind and Movement"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 55, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/18902a13b677a779fe2edb16a5a18b42-98.jpg", "descriptions": "Scooby and the Gang are back in an all-new adventure! Join your favorite slackers as they try to solve a mystery of supernatural proportions. The gang starts out on a routine case in the search of ghosts. During their search, a scheming business tycoon, who will stop at nothing to grow hisScooby and the Gang are back in an all-new adventure! Join your favorite slackers as they try to solve a mystery of supernatural proportions. The gang starts out on a routine case in the search of ghosts. During their search, a scheming business tycoon, who will stop at nothing to grow his empire, uses The Tome of Doom to unlock some of the creepiest monsters our gang has every seen. Help Scooby and Shaggy find The Tome of Doom, capture monsters, and solve the mystery. Would you help Scooby and Shaggy solve this mystery for a Scooby Snack? Features an adventure style gameplay that includes solving puzzles, searching for clues, capturing monsters with The Tome of Doom, and out-running some of the creepiest monsters. Play as either Shaggy or Scooby with the switch of a button- each with their own unique abilities. Explore a movie set, the wild west, a bayou, and a creepy laboratory. Features the voice talent the Scooby-Doo cartoon voice actors. [THQ]… Expand"}, {"name": "Rugby 2004", "details_link": "https://www.metacritic.com/game/pc/rugby-2004", "publisher": "Electronic Arts", "release_date": "Nov  4 2003", "developers": ["HB Studios Multimedia"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Sports", "Alternative", "Team", "Rugby", "Rugby"], "meta_score": 55, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/1/cdaf17ccf7feb376aa5ab604654a8d39-98.jpg", "descriptions": "Choose from 20 international, all Super 12, and other domestic teams, then take your team to victory in the World Cup, Tri nations, Super 12 Series, Domestic, Master League and Friendly matches. Strap on your boots, this is World Cup Rugby at its body-ramming, bullet-passing, try-scoringChoose from 20 international, all Super 12, and other domestic teams, then take your team to victory in the World Cup, Tri nations, Super 12 Series, Domestic, Master League and Friendly matches. Strap on your boots, this is World Cup Rugby at its body-ramming, bullet-passing, try-scoring best! More than 60 Teams From Around the World: Featuring every Rugby World Cup qualifying team plus international teams that did not qualify for the tournament, and every Super 12, and European Cup team. Over 1,500 Players Ready to Scrum: All the top players in the world, from Jonah Lomu to Jonny Wilkinson. With the revamped player editor, change every element of your players including height, weight, look, and playing attributes. Make a run for the cup with a wide variety of game and tournament modes including: Training Pitch, World Cup, Tri Nations, Bledisloe Cup, Super 12, European Cup, British Lions Tour, and Master League, the flagship tournament that lets you fully trade and customize your player, team, and tournament, and play through a career-style game mode. [Electronic Arts]… Expand"}, {"name": "WWE Crush Hour", "details_link": "https://www.metacritic.com/game/gamecube/wwe-crush-hour", "publisher": "THQ", "release_date": "Mar 17 2003", "developers": ["Pacific Coast Power & Light"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Demolition Derby"], "meta_score": 55, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/177a32432d4f7b92d9eeefa8ba8762ca-98.jpg", "descriptions": "WWE Entertainment Crush Hour takes the intensity, competitiveness, and brute strength from the wrestling ring to the world of car combat. More than 20 WWE superstars jump into their super cars for brutal vehicular carnage. Lay the rubber down in the Rock's speedster, cruise and bruise in theWWE Entertainment Crush Hour takes the intensity, competitiveness, and brute strength from the wrestling ring to the world of car combat. More than 20 WWE superstars jump into their super cars for brutal vehicular carnage. Lay the rubber down in the Rock's speedster, cruise and bruise in the Hardy Boys' souped-up Woody, or pummel the competition in the Big Show's diesel. In 12 levels littered with deadly traps and hazards, it's going to take more than a three-count to win.… Expand"}, {"name": "NCAA Final Four 2001", "details_link": "https://www.metacritic.com/game/playstation/ncaa-final-four-2001", "publisher": "SCEA", "release_date": "Nov 13 2000", "developers": ["989 Sports"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/2662b685a88b7473f23f3e337e91f5c9-98.jpg", "descriptions": "NCCA Final Four 2001 features relatively entertaining arcade-style hoops action, but the game's subpar graphics, lack of options, annoying control flaws, and lack of on-court atmosphere keep it from meeting those expectations."}, {"name": "Mega Man Star Force 2: Zerker x Ninja", "details_link": "https://www.metacritic.com/game/ds/mega-man-star-force-2-zerker-x-ninja", "publisher": "Capcom", "release_date": "Jun 24 2008", "developers": ["Capcom"], "platforms": "DS", "num_players": "1-6 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 55, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/5017e8b934ccd5838685390fc677aa7c-98.jpg", "descriptions": "Mega Man Star Force 2 continues two months after the previous game left off. Geo Stelar and crew return to battle a whole host of UMA’s (unidentified animated beings) and a new rival character appears named \"Rogue.\" Amidst this new conflict, a mysterious organization emerges with plans toMega Man Star Force 2 continues two months after the previous game left off. Geo Stelar and crew return to battle a whole host of UMA’s (unidentified animated beings) and a new rival character appears named \"Rogue.\" Amidst this new conflict, a mysterious organization emerges with plans to revive the ancient civilization of \"Mu\" by utilizing the force of an ancient heritage \"OOPArt.\" It's up to Geo and his virus-busting buddy, Omega-Xis, to thwart this latest threat. Mega Man Star Force 2 blends a unique formula of RPG exploration elements with fast-paced action, as players travel and battle between coexisting worlds, the physical world and the virtual Wave World, to unravel the mystery around this new troublemaker. Players encounter enemies in the virtual Wave World and battle them on three-by-five battle grids with their Battle Card deck. Mega Man Star Force 2 also adds an upgraded Transer system. [Capcom]… Expand"}, {"name": "Rugby World Cup 2011", "details_link": "https://www.metacritic.com/game/xbox-360/rugby-world-cup-2011", "publisher": "505 Games", "release_date": "Sep  1 2011", "developers": ["HB Studios Multimedia"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Sports", "Alternative", "Team", "Rugby", "Rugby"], "meta_score": 55, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/6/55fd593900f074325934a57d3f6897a3-98.jpg", "descriptions": "RUGBY WORLD CUP 2011 will challenge players to pick from the 20 Rugby World Cup 2011 participating countries, and attempt to lead their team through the pool phase to progress to the Final and the opportunity to lift the prestigious Webb Ellis Cup."}, {"name": "The Lord of the Rings: Conquest", "details_link": "https://www.metacritic.com/game/xbox-360/the-lord-of-the-rings-conquest", "publisher": "Electronic Arts", "release_date": "Jan 13 2009", "developers": ["Pandemic Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/0c1b70a786b654902a6e206ccaf925cd-98.jpg", "descriptions": "For the first time, play as Evil characters in a brand new, 'Evil' campaign. Battle through scenarios after Frodo failed to destroy the One Ring; it’s good to be bad. Acclaimed Battlefront gameplay in a fantasy setting allows players to choose the way they fight, as Warrior, Archer, Mage orFor the first time, play as Evil characters in a brand new, 'Evil' campaign. Battle through scenarios after Frodo failed to destroy the One Ring; it’s good to be bad. Acclaimed Battlefront gameplay in a fantasy setting allows players to choose the way they fight, as Warrior, Archer, Mage or Scout in melee and ranged combat. Online multiplayer - pick your allegiance then battle in 16-player online clashes, or in 4-player co-op campaigns. Local multiplayer - split-screen with up to 4 players competitively or 2 player co-op. A massive cast of characters & weapons adds great depth to the gameplay: Heroes, Wargs, Ents, Oliphaunts, Cave-trolls, the Balrog, Nazgul, ballistae, and more. [Electronic Arts]… Expand"}, {"name": "Judge Dredd: Dredd VS Death", "details_link": "https://www.metacritic.com/game/pc/judge-dredd-dredd-vs-death", "publisher": "Evolved Games", "release_date": "Mar  3 2005", "developers": ["Rebellion"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 55, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/f1fff1d249be68c5ce1724a99a8fdb96-98.jpg", "descriptions": "It is the third decade of the 22nd century. Unemployment is endemic, boredom is universal and only the Judges can prevent total anarchy? Empowered to dispense instant justice, they are judge, jury and executioner all in one. The most feared and respected of all the Judges is Dredd ? he isIt is the third decade of the 22nd century. Unemployment is endemic, boredom is universal and only the Judges can prevent total anarchy? Empowered to dispense instant justice, they are judge, jury and executioner all in one. The most feared and respected of all the Judges is Dredd ? he is the Law! In the darkest depths of Mega-City One a group calling themselves the Death Cult are devising a fiendish plan to free the evil Dark Judges from their holding chamber in a Justice Department penitentiary. Meanwhile the Judges of PSI Division have foreseen that the Big Meg will be blighted by a terrible plague. Soon enough, as predicted, there are outbreaks of vampirism across the city. Is this the return of some ancient, forgotten evil? [Vivendi Universal]… Expand"}, {"name": "The Incredibles", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-incredibles", "publisher": "THQ", "release_date": "Oct 31 2004", "developers": ["Helixe"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 55, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/4e99344610231f0a57b38f0cdf956480-98.jpg", "descriptions": "Superstrength, superspeed, invisibility, and elasticity are all the powers you have to combat evil in The Incredibles. You'll need them, because your enemies throw bombs, bullets, and lasers at you. Based on the movie from Pixar, The Incredibles tells the story of a family of undercoverSuperstrength, superspeed, invisibility, and elasticity are all the powers you have to combat evil in The Incredibles. You'll need them, because your enemies throw bombs, bullets, and lasers at you. Based on the movie from Pixar, The Incredibles tells the story of a family of undercover superheroes that is trying to live a quiet, suburban life but is forced back into action to save the world. As the film's main characters, you must fight, race, and solve puzzles in more than 18 action-packed levels.… Expand"}, {"name": "The Park", "details_link": "https://www.metacritic.com/game/playstation-4/the-park", "publisher": "Funcom", "release_date": "May  3 2016", "developers": ["Funcom"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 55, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/4/386ecaf2d5b16fecb0892845fbeda293-98.jpg", "descriptions": "The Park is a single-player horror experience developed by Funcom, set against the backdrop of an amusement park where a dark and sinister secret is just waiting to be uncovered."}, {"name": "Babel Rising", "details_link": "https://www.metacritic.com/game/playstation-3/babel-rising", "publisher": "Ubisoft", "release_date": "Jun 12 2012", "developers": ["Mondo Productions"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Strategy", "General", "General"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/46bc0d00ae4f8e2678472e492d155283-98.jpg", "descriptions": "Ubisoft’s Babel Rising is the next-generation version of the popular iPhone game of the same name. In Babel Rising, gamers play as God, preventing humans from building the tower of Babel. Gamers can use their divine powers by hurling bolts of lightning, summoning massive earthquakes orUbisoft’s Babel Rising is the next-generation version of the popular iPhone game of the same name. In Babel Rising, gamers play as God, preventing humans from building the tower of Babel. Gamers can use their divine powers by hurling bolts of lightning, summoning massive earthquakes or unleashing gigantic floods upon the Babylonians. Developer Mando Productions has breathed new life into the game with 3D graphics and competitive and cooperative multiplayer modes.… Expand"}, {"name": "Conflict: Vietnam", "details_link": "https://www.metacritic.com/game/pc/conflict-vietnam", "publisher": "Global Star Software", "release_date": "Oct  5 2004", "developers": ["Pivotal Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Historic", "Historic", "Arcade"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/ecbefe2f4d5b3431da104f808f6ceab2-98.jpg", "descriptions": "Conflict: Vietnam follows the progress of four US soldiers, Ragman, Junior, Hoss and Cherry, cut off from their unit during the 1968 Tet Offensive and tasked with fighting their way back to friendly lines. A third person shooter where the player takes full control of all four squad members,Conflict: Vietnam follows the progress of four US soldiers, Ragman, Junior, Hoss and Cherry, cut off from their unit during the 1968 Tet Offensive and tasked with fighting their way back to friendly lines. A third person shooter where the player takes full control of all four squad members, Conflict: Vietnam does not set out to depict the course of the war; instead we witness four men struggling for survival in the hostile Vietnam jungle against a ruthless terrain and seemingly ever-present \"invisible\" enemy. With 14 missions spanning a variety of environments you must lead your squad down Vietnamese rivers manning the guns on a heavily armoured river boat, into local villages (with friendly and non-friendly fire) to rescue hostages, through ruined temples and the claustrophobic jungle and into the ancient Vietnamese capital of Hue. Armed with an array of heavy artillery your squad must also use make use of transportation abandoned by the Viet-Cong or discarded by captured US troops such as tanks, boats and helicopters, in addition to any surplus weaponry you acquire including gun placements and two-manned mortar sites. Lastly, and by no means least, keep a watchful eye out for the Viet-Cong booby traps, from grenade trip wires and water mines to the punji stake pit trap and the \"Bouncing Betty\" anti-personnel mine. [SCi Games]… Expand"}, {"name": "GERRRMS", "details_link": "https://www.metacritic.com/game/switch/gerrrms", "publisher": "Bugbomb Studio", "release_date": "Jul 23 2020", "developers": ["Bugbomb Studio"], "platforms": "Switch", "num_players": "Up to 4 ", "genres": ["Action", "Miscellaneous", "General", "Party / Minigame"], "meta_score": 55, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/72674414744bebe54355c22a44222b00-98.jpg", "descriptions": "Gerrrms is a party brawl game that puts you in the role of a microorganism fighting against its single-celled opponents. Take part in the eternal battle of the microbes! Become one of the sneaky bacteria and tech your friends their place in line. This is the best micro brawl game out there.Gerrrms is a party brawl game that puts you in the role of a microorganism fighting against its single-celled opponents. Take part in the eternal battle of the microbes! Become one of the sneaky bacteria and tech your friends their place in line. This is the best micro brawl game out there.\r Play as one of 11 unlockable characters with different personalities.\r There are as many as seven game modes!\rDeathmatch - this is the classic germ vs germ warfare.… Expand"}, {"name": "Warhammer: Battle for Atluma", "details_link": "https://www.metacritic.com/game/psp/warhammer-battle-for-atluma", "publisher": "Namco Bandai Games America", "release_date": "Nov 14 2006", "developers": ["Sabertooth Games"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/4/683e624ed3c04b5b6515d77724571bb7-98.jpg", "descriptions": "Based on the collectible card game set in the Warhammer world, WarCry: The Battle for Atluma delivers an extensive card game experience on the PSP. Enter the old world and battle your way through the armies of the Grand Alliance or the evil Hordes of Darkness. Discover the secrets of AtlumaBased on the collectible card game set in the Warhammer world, WarCry: The Battle for Atluma delivers an extensive card game experience on the PSP. Enter the old world and battle your way through the armies of the Grand Alliance or the evil Hordes of Darkness. Discover the secrets of Atluma as you collect more than 450 cards, but be quick - you'll have to use all your wits and strategy to beat your opponent to the ultimate goal, the Atluma Crystal. Wireless Multiplayer: Battle a friend by connecting wirelessly or trade cards with a friend. Live the struggle of battle through life and death decisions: Choosing the right or wrong battle can lead your army to victory or defeat as you wager and win new warriors from your friends. Build your custom army deck: Utilize more than 90 different units through recruitment, conquest and trade. Extensive tutorial system: Even beginners can jump into the action like a vetran with the in-depth tutorial system. [Namco Bandai Games]… Expand"}, {"name": "Transformers: The Game", "details_link": "https://www.metacritic.com/game/pc/transformers-the-game", "publisher": "Activision", "release_date": "Jun 26 2007", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 55, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/3b4d0e710252e836ef0f905f12d86107-98.jpg", "descriptions": "Based on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in DisguiseBased on the 2007 live-action feature film, Transformers: The Game lets gamers control the outcome in the battle for Earth as they choose to protect it as Autobots or destroy it as Decepticons. Players experience the unstoppable power and massive scale of their favorite Robots in Disguise such as BumbleBee, Barricade and others. As the Transformers robot's war comes to Earth, gamers make the choice to join the Autobots in protecting our planet or to join the Decepticons in destroying it. With dual campaigns, the fate of the world is in players' hands. Instantly change from a larger than life robot to a high-powered vehicle such as a sports car, fighter jet or helicopter. Players crush, topple and wreck every object, including buildings and vehicles, in their path or use the objects as weapons. An unprecedented line-up lets gamers experience the massive scale, unique abilities and sheer strength of an army of characters from the Transformers universe when they choose to play as Optimus Prime, Megatron, Ironhide, Starscream, BumbleBee and more. For head-to-head battles, fans engage in melee combat that reflects each Transformers robot's character, scale, weight and power along with melee weapons and special moves unique to each character. The game's ranged combat offers a wide array of projective weapons designed to take out enemies from afar. [Activision]… Expand"}, {"name": "Alias (2004)", "details_link": "https://www.metacritic.com/game/pc/alias-2004", "publisher": "Acclaim", "release_date": "Jun 17 2004", "developers": ["Acclaim Studios Cheltenham"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 55, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/66a0f2112e5a82e63fa5831059c68036-98.jpg", "descriptions": "Alias is a third-person action adventure containing a unique blend of action and stealth that puts you under fire and under pressure. Whether you're up against the clock or being hunted by the enemy, fighting against the odds or fleeing for your life, the action is relentless. Utilize yourAlias is a third-person action adventure containing a unique blend of action and stealth that puts you under fire and under pressure. Whether you're up against the clock or being hunted by the enemy, fighting against the odds or fleeing for your life, the action is relentless. Utilize your incredible spyware and array of disguises to complete the most dangerous covert missions across the globe. Experience all the heart-stopping action and tension of the award winning TV series. [Acclaim]… Expand"}, {"name": "The Great Escape", "details_link": "https://www.metacritic.com/game/xbox/the-great-escape", "publisher": "Gotham Games", "release_date": "Jul 23 2003", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 55, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/5ec96a50f4e20e465a619d2772607662-98.jpg", "descriptions": "Imprisoned in a tough German war camp during WWII, you must coordinate a daring escape and wreak havoc in the heart of the Nazi empire. Use your wits to elude your captors through stealth and espionage episodes as you equip your secret Allies army with the tools needed for this secret plot.Imprisoned in a tough German war camp during WWII, you must coordinate a daring escape and wreak havoc in the heart of the Nazi empire. Use your wits to elude your captors through stealth and espionage episodes as you equip your secret Allies army with the tools needed for this secret plot. Once you've broken through to freedom, draw your guns and blast your way through the gut of the Nazi war machine. Finally, you'll take to the highways in chases through the enemy lines--and on to freedom.… Expand"}, {"name": "The Simpsons: Road Rage", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-simpsons-road-rage", "publisher": "THQ", "release_date": "Jun 30 2003", "developers": ["Altron"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 55, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/294c0cb71a78ef0df18a2ec929caddbe-98.jpg", "descriptions": "Mr.  Burns is up to his greedy ways in Simpsons Road Rage, purchasing Springfield's busses and jacking up the fares.  Now, Springfield residents must turn their cars into cabs and work the streets.  Hopefully, making enough money to buy back the busses before the clock runs out.  Choose fromMr.  Burns is up to his greedy ways in Simpsons Road Rage, purchasing Springfield's busses and jacking up the fares.  Now, Springfield residents must turn their cars into cabs and work the streets.  Hopefully, making enough money to buy back the busses before the clock runs out.  Choose from over 30 of your favorite Simpsons characters and brave the jam-packed streets of six huge levels, performing big-air and powerslide stunts.  Compete for passengers in two-player, split screen action.  Go on a road rage, Simpsons-style.  … Expand"}, {"name": "The Italian Job", "details_link": "https://www.metacritic.com/game/playstation-2/the-italian-job", "publisher": "Eidos Interactive", "release_date": "Jun 25 2003", "developers": ["Climax Group"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/63c331408e7622a9c078a3e3002eac97-98.jpg", "descriptions": "GET IN. GET OUT. GET EVEN. Charlie Croker and his gang are left for dead in Venice after being double-crossed during one of the biggest gold heists ever. Taking on the role of Charlie and his gang members, you must wreak vengeance on the man who betrayed you and reclaim the gold. RecaptureGET IN. GET OUT. GET EVEN. Charlie Croker and his gang are left for dead in Venice after being double-crossed during one of the biggest gold heists ever. Taking on the role of Charlie and his gang members, you must wreak vengeance on the man who betrayed you and reclaim the gold. Recapture the high-octane thrills of the 2003 blockbuster movie by creating the largest traffic jam in L.A. history and attempting your escape in super-charged MINI Coopers. [Eidos Interactive]… Expand"}, {"name": "Gunfighter: The Legend of Jesse James", "details_link": "https://www.metacritic.com/game/playstation/gunfighter-the-legend-of-jesse-james", "publisher": "Ubisoft", "release_date": "Nov 30 2001", "developers": ["Rebellion"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 55, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/c64ec8e82e3a05ca39cb5d586454c06e-98.jpg", "descriptions": "It's steel justice in the Old West -- Gunslingin' outlaw Jesse James is layin' down the law on a posse of no-good bandits. These thieves have snatched Jesse's sweetheart, Zee, and done shot dead his partner, Cole. Now is high time to unshuck yer six shooter, save Zee and send them varmintsIt's steel justice in the Old West -- Gunslingin' outlaw Jesse James is layin' down the law on a posse of no-good bandits. These thieves have snatched Jesse's sweetheart, Zee, and done shot dead his partner, Cole. Now is high time to unshuck yer six shooter, save Zee and send them varmints packin' in a pine box!… Expand"}, {"name": "Driving Emotion Type-S", "details_link": "https://www.metacritic.com/game/playstation-2/driving-emotion-type-s", "publisher": "SquareSoft", "release_date": "Jan 29 2001", "developers": ["Escape"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 55, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/6/3bb8c1f17cf38d5752d4dee70fc7fa2c-98.jpg", "descriptions": "Many racing games have strived for this goal. Now technology has finally caught up with amibition, and racing games have enetered a new dimension."}, {"name": "Samurai Warriors 2: Empires", "details_link": "https://www.metacritic.com/game/playstation-2/samurai-warriors-2-empires", "publisher": "Koei", "release_date": "Feb 27 2007", "developers": ["Omega Force"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 55, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/ede5e4e2e099467fc2bdbf71acd26677-98.jpg", "descriptions": "Samurai Warriors 2 Empires, the follow-up to the Tactical Action game Samurai Warriors 2, combines aspects of Action, Fighting and Strategy games. Japan is divided into 25 warring states and it is up to you to resurrect a nation using equal amounts of strategy and strength. Before eachSamurai Warriors 2 Empires, the follow-up to the Tactical Action game Samurai Warriors 2, combines aspects of Action, Fighting and Strategy games. Japan is divided into 25 warring states and it is up to you to resurrect a nation using equal amounts of strategy and strength. Before each battle, you meet with their war council to discuss military and political affairs; then it's time for combat. Samurai Warriors 2 Empires is a unique blend of strategy and true warrior action. An account of Japan's Warring States era. A must-have for anyone fascinated by Samurai culture. Vicious multi-Musou attacks with up to four officers. 6 Regional scenarios, plus 5 Unification scenarios. 50 new policy cards based on Japanese history. 30 different tactics cards allow you to hire wind ninjas, set an ambush or form a blockade. – 90 policies in all. Create your own warrior in New Officer mode or choose from among 400 playable characters. 2-player co-op play. Forge alliances with rival clans and hire captured officers. Includes Empire mode, Free mode, and an extensive Archive section with rare art and information on Samurai history and tactics. [Koei]… Expand"}, {"name": "Terminator: Resistance", "details_link": "https://www.metacritic.com/game/xbox-one/terminator-resistance", "publisher": "Reef Entertainment", "release_date": "Dec 10 2019", "developers": ["Teyon"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 55, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/ef0290053e533566d54d9fa199dfec3a-98.jpg", "descriptions": "This story takes place in a post-apocalyptic Los Angeles, nearly 30 years after Judgement Day, and stars a brand new hero in the Terminator universe, Jacob Rivers, a soldier in the Resistance led by John Connor. Despite the fact that Jacob is just a lowly private, he'll soon discover thatThis story takes place in a post-apocalyptic Los Angeles, nearly 30 years after Judgement Day, and stars a brand new hero in the Terminator universe, Jacob Rivers, a soldier in the Resistance led by John Connor. Despite the fact that Jacob is just a lowly private, he'll soon discover that he's been specifically targeted by the latest threat from Skynet and marked for termination! Skynet may be destined to lose the war, but at what cost to Jacob? Experience the events leading up to the decisive final battle for the fate of mankind in the war against the machines!Features:* Choose what kind of action hero you want to be! Equip an epic arsenal of weaponry to run and gun or sneak and snipe through sprawling environments! The world isn't as forgiving as it used to be, so you'll need to find resources to help you out. If you can't find what you're looking for, then you better make it yourself.* Change the fate of mankind! Protect a motley crew of survivors, each with their own motivations and backstories. The actions you take throughout the game will impact their survival and change the ending you get.* Resist against the machines! Fight against a selection of iconic enemies from the films, including the T-800, as well as a host of enemies that are brand new to the Terminator universe!… Expand"}, {"name": "STONE", "details_link": "https://www.metacritic.com/game/pc/stone", "publisher": "Convict Games", "release_date": "Sep 21 2018", "developers": ["Convict Games"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Third-Person"], "meta_score": 55, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/8/79f61a6a5bc2d87a0cef5fc5db7024b8-98.jpg", "descriptions": "A hungover koala detective, STONE wakes to find his chookie Alex has been kidnapped. YOU need to find out what happened."}, {"name": "Darkout", "details_link": "https://www.metacritic.com/game/pc/darkout", "publisher": "Allgraf", "release_date": "Jan 14 2013", "developers": ["Allgraf"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "2D", "General", "Action Adventure", "Sandbox"], "meta_score": 55, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/df16115a3de1e7169bc088fcc99e3d0e-98.jpg", "descriptions": "Crashed and alone on a world mankind tried to leave behind, Darkout challenges players to survive on Illuna, in harsh, procedurally generated biomes, utilizing the game’s sandbox features to build shelters, craft weapons, and research new technologies. You are not alone."}, {"name": "The Cursed Crusade", "details_link": "https://www.metacritic.com/game/pc/the-cursed-crusade", "publisher": "Atlus", "release_date": "Oct 25 2011", "developers": ["Kylotonn"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 55, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/2/4cee27137e97cc94c868dda382a7f7d7-98.jpg", "descriptions": "The Cursed Crusade marries medieval Europe with adventure and dark fantasy."}, {"name": "Lost: Via Domus", "details_link": "https://www.metacritic.com/game/xbox-360/lost-via-domus", "publisher": "Ubisoft", "release_date": "Feb 26 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 55, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/269c64fd8da5e6b9aafab2a552586d6b-98.jpg", "descriptions": "After Oceanic Air flight 815 tore apart in mid-air and crashed on a seemingly deserted Pacific island, its survivors were forced to find inner strength they never knew they had in order to survive. The band of friends, family, enemies and strangers has become reluctant heroes who must workAfter Oceanic Air flight 815 tore apart in mid-air and crashed on a seemingly deserted Pacific island, its survivors were forced to find inner strength they never knew they had in order to survive. The band of friends, family, enemies and strangers has become reluctant heroes who must work together against the cruel weather and harsh terrain if they want to stay alive. Danger and mystery loom behind every corner on the island, and those they thought could be trusted may turn against them. Even heroes have secrets. As a passenger of Oceanic flight 815, you survived the crash and find yourself on an uncharted island somewhere in the Pacific Ocean. As you begin to unravel mysteries of the island, you begin to discover secrets of your own.  You will have to understand your past mistakes in order to survive and find your way home. Confront your dark past, seek your redemption, and ultimately find a way home. Explore familiar locations, unravel mysteries, and interact with the main characters from the show. Survive the challenges that the island throws at you: Solve puzzles, outsmart enemies, battle the smoke monster, and overcome many other challenges to survive the island and come out alive. [Ubisoft]… Expand"}, {"name": "Spider-Man: Friend or Foe", "details_link": "https://www.metacritic.com/game/ds/spider-man-friend-or-foe", "publisher": "Activision", "release_date": "Oct  2 2007", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 55, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/aa4c1573a7a6ea69d9e9b1b1a6d92c3b-98.jpg", "descriptions": "Spider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and oneSpider-Man: Friend or Foe challenges players to defeat and then join forces with notorious movie nemeses including Doc Ock, Green Goblin, Venom and Sandman, and other classic Spider-Man characters. Players embark on a global quest to overcome an evil threat, by controlling Spider-Man and one of numerous Super Hero or Super Villain sidekicks, as they master unique fighting moves and styles while switching between characters to execute team combos and defeat foes. Spider-Man: Friend or Foe features a unique co-op mode in which a friend can join the game at any time and take control of Spidey’s sidekick as they battle through the game side-by-side and replay favorite levels. [Activision]… Expand"}, {"name": "Teenage Mutant Ninja Turtles: Mutants in Manhattan", "details_link": "https://www.metacritic.com/game/xbox-one/teenage-mutant-ninja-turtles-mutants-in-manhattan", "publisher": "Activision", "release_date": "May 24 2016", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 55, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/38f3271eea4962596acc2aebbc0e4b59-98.jpg", "descriptions": "Battle with your brothers through the sewers, subways, and streets of New York to defeat Shredder and Krang’s evil organization, Foot by Foot. Unleash custom combat skills and powerful team combos to save Manhattan from the overwhelming dark forces growing in the shadows."}, {"name": "Marvel Super Hero Squad: The Infinity Gauntlet", "details_link": "https://www.metacritic.com/game/xbox-360/marvel-super-hero-squad-the-infinity-gauntlet", "publisher": "THQ", "release_date": "Nov 16 2010", "developers": ["THQ"], "platforms": ["3DS", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General"], "meta_score": 55, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/179ff200f787a960c7c8a122b75a6053-98.jpg", "descriptions": "Marvel Super Hero Squad: The Infinity Gauntlet continues the excitement of the original Marvel Super Hero Squad with an all-new storyline that follows Season 2 of the hit animated TV series as shown on Cartoon Network.  Players can \"Hero Up\" with friends in cooperative play masterMarvel Super Hero Squad: The Infinity Gauntlet continues the excitement of the original Marvel Super Hero Squad with an all-new storyline that follows Season 2 of the hit animated TV series as shown on Cartoon Network.  Players can \"Hero Up\" with friends in cooperative play master the unique Factor Power of each of the Marvel heroes in three game modes: Story Mode, Freeplay Mode and Challenge Mode.  The game also boasts a brand new puzzle component, in which players will need to utilize the characters' unique abilities to move or destroy objects, traverse through certain environments, and summon specific strengths to overcome obstacles.  With new adventures, tricky puzzles, an expanded selection of Marvel Super Hero Squad members to unlock and play as, Marvel Super Hero Squad: The Infinity Gauntlet is set to thrill gamers from here to Super Hero City.… Expand"}, {"name": "Way of the Samurai 3", "details_link": "https://www.metacritic.com/game/xbox-360/way-of-the-samurai-3", "publisher": "UFO Interactive", "release_date": "Oct 20 2009", "developers": ["Acquire"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 55, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/1350b9c0a1e8a85546f3905066df3dcd-98.jpg", "descriptions": "Take the role of a samurai and choose your own path, blazing a trail of honor, loyalty and respect or one of villainy, corruption and greed. The canonical series, best known for its high level of freedom and play style is back, with improved features, graphics and new game play mechanicsTake the role of a samurai and choose your own path, blazing a trail of honor, loyalty and respect or one of villainy, corruption and greed. The canonical series, best known for its high level of freedom and play style is back, with improved features, graphics and new game play mechanics sure to please fans of this enduring series. The Butterfly Effect - With over 15 different endings, every action you take will cause a change of events to occur, allowing for multiple outcomes and replay-ability. Every action has a reaction and the following consequences open up new paths to explore. Weapon Customization and Abilities - Craft your own unique weapons from over 200 different parts and materials, creating the ultimate weapon that suits your taste and fighting style. Create lethal blades, spears, pole axes and more while discovering new abilities and skills with increased use. Become a master of one or of many! Reward System and Samurai Rating - Performing different feats will reward a player with Samurai Points and a Title, which in turn will unlock new features and characters within the game. Fight honorably in the way of the samurai, live your life as a bandit or strive to uphold the government. These choices will net different points and values, encouraging multiple play throughs to unlock all features and content. The Pen Can Be Mightier Than The Sword - Fight your opposition with force or take the diplomatic route, using subtle gestures like the unsheathing of your sword. With extensive dialogue tree, weapons combo systems and more, this hybrid title delivers on multiple fronts. [UFO Interactive]… Expand"}, {"name": "Titan Quest", "details_link": "https://www.metacritic.com/game/playstation-4/titan-quest", "publisher": "THQ Nordic", "release_date": "Mar 20 2018", "developers": ["THQ Nordic"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 55, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/efc1be3e274c26d7e8e93dbc10b7f4c1-98.jpg", "descriptions": "Discover the Courage that Turns Heroes Into Legends.\rFrom Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative, all-new action role playing game set in ancient Greece, Egypt and Asia.\rThe Titans have escaped their eternal prison, wreaking havocDiscover the Courage that Turns Heroes Into Legends.\rFrom Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative, all-new action role playing game set in ancient Greece, Egypt and Asia.\rThe Titans have escaped their eternal prison, wreaking havoc upon the earth. The gods seek a hero who can turn the tide in an epic struggle that will determine the fate of both men and gods. Are you ready for the quest?\r *    Explore the Ancient World - Unlock arcane mysteries and battle the beasts of mythology as you journey to the Parthenon, Great Pyramids, Hanging Gardens of Babylon, The Great Wall and other legendary locations.\r*    Amazing Graphical Detail - Take a hero's journey through authentic Ancient World settings crafted in stunning, realistic, 3D detail.\r*    Conquer Monsters of Legend - Battle horrific monsters and mythical beasts in a story-driven campaign that will determine the fate of all existence.\r*    Highly Customizable Characters - Build and customize your characters with 28 classes and over 1000 pieces of unique and legendary items to create the ultimate champion.\r*    Create Your Own Worlds - Create your own maps with the easy-to-use World Editor for endless adventuring.\r*    Online Multiplayer Gameplay - Challenge others to experience your map creations in fast-action, 2-6 player online cooperative gameplay.… Expand"}, {"name": "The Incredible Hulk", "details_link": "https://www.metacritic.com/game/xbox-360/the-incredible-hulk", "publisher": "Sega", "release_date": "Jun  5 2008", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 55, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/dbbb906125b201fb560fbac8ad5d3ad1-98.jpg", "descriptions": "Fast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in TheFast-paced and action-packed, the blockbuster franchise and comic book saga unfolds for the first time on next-generation platforms, as Banner scours the planet trying to find anything to help him fight his involuntary rage. Take the role of one of Marvel's most powerful Super Heroes in The Incredible Hulk, a third-person action video game. Gamers can demolish anything in their path, including lampposts, passing cars and even buildings. The fury-fueled game also features key moments from the film, as well as additional plotlines and characters from The Incredible Hulk universe. Players crash through New York City, battling gigantic enemies amidst soaring skyscrapers in a massive open world. [Sega]… Expand"}, {"name": "Evil Dead: A Fistful of Boomstick", "details_link": "https://www.metacritic.com/game/playstation-2/evil-dead-a-fistful-of-boomstick", "publisher": "THQ", "release_date": "May 20 2003", "developers": ["VIS Entertainment"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 55, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/0/24a5ca7a9ed987cebcd0c50dabf2eb61-98.jpg", "descriptions": "Ash is back, baby! Fully \"armed\" with his chainsaw, trusty boomstick, and trademark quips, Ash must once again save Dearborn from the unspeakable horrors spawned from The Book of the Dead. When ambitious journalist Trisha Pettywood and occult author Alex Eldrige team up to try to expose theAsh is back, baby! Fully \"armed\" with his chainsaw, trusty boomstick, and trademark quips, Ash must once again save Dearborn from the unspeakable horrors spawned from The Book of the Dead. When ambitious journalist Trisha Pettywood and occult author Alex Eldrige team up to try to expose the mystery of famed Professor Knowby's murder, they unwittingly open a Vortex to the undead. As the deadites swarm through Dearborn they turn humans into the undead and the town is quickly overrun. Now, with Dearborn in chaos and citizens begging for help, Ash must hack and slash his way through the streets and figure out how to close the Vortex. Ash is soon to learn that all is not what it seems?those he trusts may be plotting against him and the history of Dearborn might be irrevocably changed. [THQ]… Expand"}]