[{"name": "Conquest: Frontier Wars", "details_link": "https://www.metacritic.com/game/pc/conquest-frontier-wars", "publisher": "Ubisoft", "release_date": "Aug 14 2001", "developers": ["Fever Pitch Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/0e9368b5caa2b7b5742ea6b318a77df8-98.jpg", "descriptions": "Master the technology and tactics of three clashing races as you control strategic wormholes, maintain precious supply lines, and forge an empire from hundreds of unique units to attain total control of the galaxy in this fleet-based real-time strategy game."}, {"name": "Gabriel Knight 3: Blood of the Sacred, Blood of the Damned", "details_link": "https://www.metacritic.com/game/pc/gabriel-knight-3-blood-of-the-sacred-blood-of-the-damned", "publisher": "Sierra Entertainment", "release_date": "Oct  5 1999", "developers": ["Sierra Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/295f70065381ea3ad1f9086afe33c865-98.jpg", "descriptions": "2000 years of heresy, betrayal and lies. One frightening truth. Solve a real-life mystery with the third title in the award-winning Gabriel Knight series. Game writer and designer Jane Jensen brings you Gabriel and Grace in their most controversial adventure ever. Enter the small French2000 years of heresy, betrayal and lies. One frightening truth. Solve a real-life mystery with the third title in the award-winning Gabriel Knight series. Game writer and designer Jane Jensen brings you Gabriel and Grace in their most controversial adventure ever. Enter the small French village pf Rennes-le-Château, and begin the path to your destiny ? unraveling an enigma that may shatter your most closely-held beliefs. Play as both Gabriel Knight and Grace Nakamura as you learn more about what is hidden in the hills of France. But beware your life, your faith and your soul. For once the truth is found, there is no erasing it. [Sierra]… Expand"}, {"name": "Jet Force Gemini", "details_link": "https://www.metacritic.com/game/nintendo-64/jet-force-gemini", "publisher": "Rare Ltd.", "release_date": "Sep 30 1999", "developers": ["Rare Ltd."], "platforms": "Nintendo 64", "num_players": "1-4 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/78897a3fef6bdcb35ebd221afa358229-98.jpg", "descriptions": "The insect invasion has begun... The galaxy is being infested by the evil Mizar and his horde of Drones. Already, the planet of Goldwood has been subjugated and the peaceful Tribals enslaved. With an arsenal of mega-weapons at their disposal, the Jet Force Gemini team must travel in searchThe insect invasion has begun... The galaxy is being infested by the evil Mizar and his horde of Drones. Already, the planet of Goldwood has been subjugated and the peaceful Tribals enslaved. With an arsenal of mega-weapons at their disposal, the Jet Force Gemini team must travel in search of Mizar's lair - rescuing Tribals and splattering Drones all along the way. But can Juno, Vela and their faithful dog, Lupus, exterminate the deadly threat before it's too late?… Expand"}, {"name": "Star Ocean: The Second Story", "details_link": "https://www.metacritic.com/game/playstation/star-ocean-the-second-story", "publisher": "Enix Corporation", "release_date": "May 31 1999", "developers": ["Tri-Ace"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/76aaa3be3cb7d614672a4a32ae359be2-98.jpg", "descriptions": "In an endless sea of stars, at the edge of the universe, a single fateful encounter is about to take place. The Gods have hurled a deadly meteorite into an unsuspecting planet, unleashing powerful mysterious and sudden chaos. Now, two people from different worlds will collide into a journeyIn an endless sea of stars, at the edge of the universe, a single fateful encounter is about to take place. The Gods have hurled a deadly meteorite into an unsuspecting planet, unleashing powerful mysterious and sudden chaos. Now, two people from different worlds will collide into a journey so deep, they might never make it back. … Expand"}, {"name": "Sid Meier's Pirates!", "details_link": "https://www.metacritic.com/game/xbox/sid-meiers-pirates!", "publisher": "2K Games", "release_date": "Jul 11 2005", "developers": ["Firaxis Games"], "platforms": ["iPhone/iPad", "PC", "Xbox"], "num_players": "1-4 ", "genres": ["Strategy", "General"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/3c8c240e0b93851ff6da3b06c0453544-98.jpg", "descriptions": "In Pirates! you take the leading role of a pirate captain in the 17th-century Caribbean, amassing fortune and fame in an attempt to seize your rightful place as one of the most revered (and feared) pirates in history. As your reputation and skills grow, so will the size and quality of yourIn Pirates! you take the leading role of a pirate captain in the 17th-century Caribbean, amassing fortune and fame in an attempt to seize your rightful place as one of the most revered (and feared) pirates in history. As your reputation and skills grow, so will the size and quality of your crew and your ability to take on larger enemy ships, raid and plunder heavily fortified ports, and locate ancient treasure. There's a whole cast of interesting and dangerous characters to meet, mysteries to solve, exotic island destinations to discover, and powerful alliances to forge.… Expand"}, {"name": "Tyranny", "details_link": "https://www.metacritic.com/game/pc/tyranny", "publisher": "Paradox Interactive", "release_date": "Nov 10 2016", "developers": ["Obsidian Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Western-Style"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/2d33093825adb599fc57cbfea36209eb-98.jpg", "descriptions": "In Tyranny, the grand war between good and evil is over – and the forces of evil, led by Kyros the Overlord, have won."}, {"name": "Gitaroo Man Lives!", "details_link": "https://www.metacritic.com/game/psp/gitaroo-man-lives!", "publisher": "Koei", "release_date": "Nov 14 2006", "developers": ["Koei/Inis"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/77f3835aada94968c52e12350f56aa3d-98.jpg", "descriptions": "Bus rides and train journeys will never be the same again with Gitaroo Man blasting out those power chords as he defends the universe from the clutches of Zowie and the Gravillian family. Utilising the PSP's analogue capabilities to brilliant effect the game will also enable players toBus rides and train journeys will never be the same again with Gitaroo Man blasting out those power chords as he defends the universe from the clutches of Zowie and the Gravillian family. Utilising the PSP's analogue capabilities to brilliant effect the game will also enable players to battle it out on two PSPs via wi-fi play or join forces in the brand new Duet mode. If you missed out on Gitaroo Man's first outing on PS2 this is your chance to indulge in a rhythm action experience like no other. [KOEI]… Expand"}, {"name": "Skul: The Hero Slayer", "details_link": "https://www.metacritic.com/game/pc/skul-the-hero-slayer", "publisher": "Neowiz", "release_date": "Jan 21 2021", "developers": ["SouthPAW Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/1034d54568a14a96825a53b7f2a21038-98.jpg", "descriptions": "The human race attacking the Demon King's castle is nothing new and has happened countless times before. What makes this time different though, is that the Adventurers decided to join forces with the Imperial Army and the 'Hero of Caerleon' to finally succeed in the total destruction of theThe human race attacking the Demon King's castle is nothing new and has happened countless times before. What makes this time different though, is that the Adventurers decided to join forces with the Imperial Army and the 'Hero of Caerleon' to finally succeed in the total destruction of the Demon stronghold. All of the demons in the castle were taken prisoner except for one lone skeleton named 'Skul'.\r Skul is no ordinary skeleton. In addition to his formidable fighting skills, he can gain new and exciting abilities depending on which skull he's wearing.Use up to 2 skulls at a time, each of which has its own unique attack range, speed and power. So choose ones that match your playing style and switch them in the heat of battle to bring your enemies to their knees. The power is in your hands!\r Skul has crossed paths with a party of Adventurers! They are powerful foes that hunt Demons for sport. But while Skul may be small, he still packs quite a punch. So just see who really is the hunter and who is the hunted...… Expand"}, {"name": "Football Manager 2017", "details_link": "https://www.metacritic.com/game/pc/football-manager-2017", "publisher": "Sega", "release_date": "Nov  4 2016", "developers": ["Sports Interactive"], "platforms": "PC", "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 80, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/2/dc9bd21bb2c900b83fdcf739764441b2-98.jpg", "descriptions": "2,500 real clubs to manage and over 500,000 real footballers and staff to sign. Full control of transfers and decide who plays, and who sits on the bench. You'll follow the match live with our acclaimed 3D match engine."}, {"name": "Super Time Force", "details_link": "https://www.metacritic.com/game/xbox-one/super-time-force", "publisher": "Capybara Games", "release_date": "May 14 2014", "developers": ["Capy Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One"], "genres": ["Action", "Platformer", "Shooter", "2D", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/ff531e533fa93c894d061c8b7b3ffc08-98.jpg", "descriptions": "Super Time Force is a frantic, hyper-action videogame filled with total mayhem, total madness and total non-stop shooty-shooty-bam-bam destruction. And yet, it also has super sweet, soothing, perhaps even sublime, moments of sloooow motion. Every level in Super Time Force contains 3Super Time Force is a frantic, hyper-action videogame filled with total mayhem, total madness and total non-stop shooty-shooty-bam-bam destruction. And yet, it also has super sweet, soothing, perhaps even sublime, moments of sloooow motion. Every level in Super Time Force contains 3 mysterious inter-dimensional objects called Shards, which can be used to control the flow of time, slowing it down like velvety smooth molasses, allowing players to unleash a truly heroic level of dodging, weaving, sniping and precision acrobatics.… Expand"}, {"name": "SoulCalibur VI", "details_link": "https://www.metacritic.com/game/pc/soulcalibur-vi", "publisher": "Bandai Namco Games", "release_date": "Oct 18 2018", "developers": ["Bandai Namco Games", "Project Soul"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 80, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/9/b1c25db540475e05e90c5b89aa6eb96e-98.jpg", "descriptions": "History Hides Away More Than One Truth... SOULCALIBUR VI represents the latest entry in the premier weapons-based, head-to-head fighting series and continues the epic struggle of warriors searching for the legendary Soul Swords. Taking place in the 16th century, revisit the events of theHistory Hides Away More Than One Truth... SOULCALIBUR VI represents the latest entry in the premier weapons-based, head-to-head fighting series and continues the epic struggle of warriors searching for the legendary Soul Swords. Taking place in the 16th century, revisit the events of the original SOULCALIBUR to uncover hidden truths. [Bandai Namco]… Expand"}, {"name": "The Artful Escape", "details_link": "https://www.metacritic.com/game/xbox-series-x/the-artful-escape", "publisher": "Annapurna Interactive", "release_date": "Sep  9 2021", "developers": ["Beethoven & Dinosaur"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "genres": ["Action", "Adventure", "General", "Platformer", "2D"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/653b2bbecf403b64631829b6fc45410c-98.jpg", "descriptions": "The Artful Escape of Francis Vendetti is a video game about great expectations, famous folk singers, lingering shadows, space Gods, hallucinogens, individuality, reptile shops, and wild imaginations. It's an action, adventure, exploration, narrative driven, musical-laser-light-battle kind of game."}, {"name": "Mutazione", "details_link": "https://www.metacritic.com/game/pc/mutazione", "publisher": "Akupara Games", "release_date": "Sep 19 2019", "developers": ["Die Gute Fabrik"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/7793b8e763bd47bde7eb7adbfcd9120d-98.jpg", "descriptions": "A mutant soap opera where small-town gossip meets the supernatural. Join Kai as she arrives in the mysterious community of Mutazione to care for her ailing grandfather. Discover scenic hangouts, magical gardens, new friends, and old secrets… They can survive an apocalyptic meteor strike, butA mutant soap opera where small-town gossip meets the supernatural. Join Kai as she arrives in the mysterious community of Mutazione to care for her ailing grandfather. Discover scenic hangouts, magical gardens, new friends, and old secrets… They can survive an apocalyptic meteor strike, but can they survive their small-town drama?… Expand"}, {"name": "SpellForce 3: Soul Harvest", "details_link": "https://www.metacritic.com/game/pc/spellforce-3-soul-harvest", "publisher": "THQ Nordic", "release_date": "May 28 2019", "developers": ["Grimlore Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Tactics"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/e114a3cd2cfbc6686d1929fbe9385936-98.jpg", "descriptions": "Three years after the Purity Wars, Nortander is on the cusp of a new era."}, {"name": "King's Quest Chapter 3: Once Upon a Climb", "details_link": "https://www.metacritic.com/game/xbox-one/kings-quest-chapter-3-once-upon-a-climb", "publisher": "Sierra Games", "release_date": "Apr 26 2016", "developers": ["The Odd Gentlemen"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/0c60f00b5244169b70a59caac178ed19-98.jpg", "descriptions": "Continuing Sierra and The Odd Gentlemen’s modern reimagining of the classic adventure game series, Once Upon A Climb focuses on King Graham’s quest to rescue his future bride—Queen Valanice—from the wicked witch Hagatha’s tower."}, {"name": "Life is Strange: Episode 5 - Polarized", "details_link": "https://www.metacritic.com/game/xbox-one/life-is-strange-episode-5---polarized", "publisher": "Square Enix", "release_date": "Oct 20 2015", "developers": ["DONTNOD Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/ad3bf4ed0114b11392c02a40504e0099-98.jpg", "descriptions": "In Episode 5: Polarized Max learns that time is impossible to control as she moves inexorably towards the most agonizing decision of her life. Arcadia Bay, meanwhile, is preparing to weather a huge storm as Life is Strange comes to a gripping and gut wrenching conclusion."}, {"name": "Westerado: Double Barreled", "details_link": "https://www.metacritic.com/game/pc/westerado-double-barreled", "publisher": "Adult Swim", "release_date": "Apr 16 2015", "developers": ["Ostrich Banditos"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/7a5097713d8396e285a301b6599a4ded-98.jpg", "descriptions": "Brought to you by the indie game developer Ostrich Banditos, Westerado takes you on a pixilated journey through the Old West where you must avenge the murder of your family. With a deep narrative and a new mystery every time you play, Westerado presents a full experience rarely seen in freeBrought to you by the indie game developer Ostrich Banditos, Westerado takes you on a pixilated journey through the Old West where you must avenge the murder of your family. With a deep narrative and a new mystery every time you play, Westerado presents a full experience rarely seen in free casual gaming. So strap on that six shooter and get ready for some serious avenging. It's time to play Westerado.… Expand"}, {"name": "Anomaly: Warzone Earth", "details_link": "https://www.metacritic.com/game/pc/anomaly-warzone-earth", "publisher": "11 bit studios", "release_date": "Apr  8 2011", "developers": ["11 bit studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Sci-Fi", "General"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/8c77fbcef58e0a4714e9aa37aa954872-98.jpg", "descriptions": "Blending fast-paced, explosive action with tactical battlefield command, Anomaly puts players in charge of a military convoy tasked with fighting back against the mysterious alien war machines that have begun to spring up in many of the world's largest cities. Players take part in battlesBlending fast-paced, explosive action with tactical battlefield command, Anomaly puts players in charge of a military convoy tasked with fighting back against the mysterious alien war machines that have begun to spring up in many of the world's largest cities. Players take part in battles personally to support and assist a hand-picked armor squad, utilizing their top-down tactical view to plot each and every turn of the convoy. As they progress through the story campaign and challenge modes, players will unlock upgrades and new units to build their ultimate destruction squad.… Expand"}, {"name": "Assassin's Creed: Revelations", "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-revelations", "publisher": "Ubisoft", "release_date": "Nov 15 2011", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/df06d2d38b962037a28aeb5e1ad8250b-98.jpg", "descriptions": "Revelations follows master assassin Ezio Auditore as he walks in the footsteps of his legendary mentor, Altair, on a journey to recover five ancient seals that hold the keys to the future of the Assassins brotherhood. It's a perilous path - one that will take Ezio to Constantinople, theRevelations follows master assassin Ezio Auditore as he walks in the footsteps of his legendary mentor, Altair, on a journey to recover five ancient seals that hold the keys to the future of the Assassins brotherhood. It's a perilous path - one that will take Ezio to Constantinople, the heart of the Ottoman Empire, where a growing army of Templars threatens to destabilize the region. … Expand"}, {"name": "Tiger Woods PGA Tour 06", "details_link": "https://www.metacritic.com/game/psp/tiger-woods-pga-tour-06", "publisher": "EA Sports", "release_date": "Sep 26 2005", "developers": ["Team Fusion"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/1b6b2017def82181808dd0c83ab51627-98.jpg", "descriptions": "Prove yourself as the greatest golfer of all time by taking on the legends in the prime of their careers -- on their terms. Do you have what it takes to beat Jack Nicklaus in his heyday with a bag full of wooden clubs or Tiger Woods with his modern-day equipment? For the first time, bothProve yourself as the greatest golfer of all time by taking on the legends in the prime of their careers -- on their terms. Do you have what it takes to beat Jack Nicklaus in his heyday with a bag full of wooden clubs or Tiger Woods with his modern-day equipment? For the first time, both analog sticks control each shot from tee to green. The left analog stick controls your swing, and the right analog Shape Stick dictates ball trajectory and putt strength. Back your challenges with wagers before any shot or round. Bigger odds are given to special accomplishments, so reap the largest rewards for nailing the toughest shots. Experience 15 beautifully detailed courses including Pebble Beach Golf Links, St Andrews, Reflection Bay, Doral Golf Resort, and more as you play as or against Tiger Woods and 16 other PGA TOUR players, including the newly added Chris DiMarco, Mike Weir, Ian Poulter, and Luke Donald. New Gamebreaker Meter: Build confidence to trigger Gamebreaker situations, and boost your power and accuracy by making great shots and posting low scores. [Electronic Arts]… Expand"}, {"name": "Age of Empires: The Age of Kings", "details_link": "https://www.metacritic.com/game/ds/age-of-empires-the-age-of-kings", "publisher": "Majesco Games", "release_date": "Feb 14 2006", "developers": ["Backbone Entertainment"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic", "Tactics"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/3a8e9efb05541b79275b09b02b08e192-98.jpg", "descriptions": "Age of Empires: The Age of Kings boasts turn-based strategy gameplay – a first for the franchise – as players move from the Dark Ages through the Middle Ages with one goal in mind: domination of the known world. Command one of five different civilizations: the Britons, Franks, Mongols,Age of Empires: The Age of Kings boasts turn-based strategy gameplay – a first for the franchise – as players move from the Dark Ages through the Middle Ages with one goal in mind: domination of the known world. Command one of five different civilizations: the Britons, Franks, Mongols, Saracens, or Japanese; Control special 'hero' units such as Richard the Lionheart, Robin Hood, Joan of Arc and Genghis Khan, whose special 'hero' powers affect the entire battlefield; Lead over 45 different types of units into battle -- from bowmen and monks to hand cannoneers, mercenaries and samurai; Players' can construct and upgrade buildings to help their units learn new skills and create resources for their civilizations; Research over 50 different technologies like chemistry, ballistics, siege craft and spying to advance civilization into the next age; A new Combat Advisor offers advice on certain campaign strategies and provides an assessment of the battle's outcome; Multi-player scenarios allow up to four players to wirelessly battle each other; By gaining Empire Points, players can unlock maps and units to improve their Emperor Rank. [Majesco]… Expand"}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-07", "publisher": "EA Sports", "release_date": "Aug 22 2006", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 80, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/527c1cb5f26a55e0ab6c49fde0f0f64d-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs. [Electronic Arts]… Expand"}, {"name": "Vitamin Connection", "details_link": "https://www.metacritic.com/game/switch/vitamin-connection", "publisher": "Limited Run Games", "release_date": "Jan 17 2020", "developers": ["WayForward"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/bd9976827d05be08922079d7ba97b126-98.jpg", "descriptions": "By blasting subatomic foes with your Vitamin Beam, utilizing a special claw tool, and navigating maze-like stages, you'll save the members of the Sable family - including the dog! - from a variety of hazardous and increasingly wacky predicaments. Each level also includes sub-games featuringBy blasting subatomic foes with your Vitamin Beam, utilizing a special claw tool, and navigating maze-like stages, you'll save the members of the Sable family - including the dog! - from a variety of hazardous and increasingly wacky predicaments. Each level also includes sub-games featuring rhythm challenges, Pong-like reflex tests, and more.… Expand"}, {"name": "Children of Morta", "details_link": "https://www.metacritic.com/game/switch/children-of-morta", "publisher": "11 bit studios", "release_date": "Nov 20 2019", "developers": ["Dead Mage"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Adventure", "General", "Action RPG"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/4d3b3c07de0294d4ea77467d4b0d3dd2-98.jpg", "descriptions": "Children of Morta is a narrative-based roguelike hack’n slash game for PC, Mac and Linux which will involve you in the adventures of a family."}, {"name": "Five Nights at Freddy's VR: Help Wanted", "details_link": "https://www.metacritic.com/game/playstation-4/five-nights-at-freddys-vr-help-wanted", "publisher": "Scott Cawthon", "release_date": "May 28 2019", "developers": ["Steel Wool Games", "Inc.", "Steel Wool Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/6bb5796b31d8997c1ad745e20f08cb58-98.jpg", "descriptions": "Five Nights at Freddy’s VR: Help Wanted is a collection of classic and original mini-games set in the Five Nights universe. Survive terrifying encounters with your favorite killer animatronics in a collection of new and classic Five Nights at Freddy’s experiences. “Where fantasy and fun comeFive Nights at Freddy’s VR: Help Wanted is a collection of classic and original mini-games set in the Five Nights universe. Survive terrifying encounters with your favorite killer animatronics in a collection of new and classic Five Nights at Freddy’s experiences. “Where fantasy and fun come to life!”… Expand"}, {"name": "NBA 2K18", "details_link": "https://www.metacritic.com/game/playstation-4/nba-2k18", "publisher": "2K Games", "release_date": "Sep 15 2017", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Arcade", "Sports", "Team", "Basketball", "Sim"], "meta_score": 80, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/4/68f0d1a626e7ab4d72b3845451dca74d-98.jpg", "descriptions": "The highest rated* annual sports title of this console generation returns with NBA 2K18, featuring unparalleled authenticity and improvements on the court.\r *According to 2008 - 2016 Metacritic.com"}, {"name": "Volume", "details_link": "https://www.metacritic.com/game/pc/volume", "publisher": "Mike Bithell", "release_date": "Aug 18 2015", "developers": ["Mike Bithell"], "platforms": ["PlayStation 4", "PlayStation Vita", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/2757bf3445f28e304a1a4e24c0d81d76-98.jpg", "descriptions": "Robert Locksley is a petty thief who happens upon a device known as \"Volume\". Originally intended to be utilized as part of a secret military coup, Robert now has the ability to simulate high-profile heists, so what does he choose to do? Broadcast these crimes over the internet. Make yourRobert Locksley is a petty thief who happens upon a device known as \"Volume\". Originally intended to be utilized as part of a secret military coup, Robert now has the ability to simulate high-profile heists, so what does he choose to do? Broadcast these crimes over the internet. Make your way through this postmodern twist on Let's Play videos with the help of Danny Wallace as the voice of the Volume artificial Intelligence. From Mike Bithell, creator of Thomas Was Alone.… Expand"}, {"name": "GRID 2", "details_link": "https://www.metacritic.com/game/pc/grid-2", "publisher": "Codemasters", "release_date": "May 27 2013", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 80, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/2/66e98bafcee8f314cea41dd7b9fb694d-98.jpg", "descriptions": "Prove yourself against advanced AI in aggressive races. Catapult your way to the top of a new world of motorsport. A separate online campaign features full RaceNet integration. Race a handpicked selection of iconic cars that represent what some consider to be the best in automotiveProve yourself against advanced AI in aggressive races. Catapult your way to the top of a new world of motorsport. A separate online campaign features full RaceNet integration. Race a handpicked selection of iconic cars that represent what some consider to be the best in automotive engineering from the last 40 years. Take on challenging licensed tracks, city streets and lethal mountain roads. Prove yourself by entering and winning events across three continents.… Expand"}, {"name": "The Evil Within 2", "details_link": "https://www.metacritic.com/game/pc/the-evil-within-2", "publisher": "Bethesda Softworks", "release_date": "Oct 12 2017", "developers": ["Tango Gameworks"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/c4fdc4d427bd2c365e3622ce91598f5c-98.jpg", "descriptions": "You are Detective Sebastian Castellanos and at your lowest point. But when given a chance to save your daughter, you must enter a world filled with nightmares and discover the dark origins of a once-idyllic town to bring her back. Horrifying threats emerge from every corner as the worldYou are Detective Sebastian Castellanos and at your lowest point. But when given a chance to save your daughter, you must enter a world filled with nightmares and discover the dark origins of a once-idyllic town to bring her back. Horrifying threats emerge from every corner as the world twists and warps around you. Will you face adversity head on with weapons and traps, or sneak through the shadows to survive?… Expand"}, {"name": "Mighty Switch Force! Hyper Drive Edition", "details_link": "https://www.metacritic.com/game/wii-u/mighty-switch-force!-hyper-drive-edition", "publisher": "WayForward", "release_date": "Nov 18 2012", "developers": ["WayForward"], "platforms": ["PC", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/6ebd302b8094605690e7799fedafd3c9-98.jpg", "descriptions": "Mighty Switch Force! Hyper Drive Edition has players enter the mechanical shape-shifting, dimension switching world and blow crime away."}, {"name": "FIFA 07 Soccer", "details_link": "https://www.metacritic.com/game/psp/fifa-07-soccer", "publisher": "EA Sports", "release_date": "Oct 17 2006", "developers": ["EA Sports"], "platforms": ["PC", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/3611bf32610b51130236bc55a9cea332-98.jpg", "descriptions": "FIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new onlineFIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new online mode that enables you to pit your club against supporters of your real-world opponents. The online interactive leagues feature the F.A. Premier League, Bundesliga, French League and the Mexican 1st Division. Experience the future of online gaming as you play your games according to the real-world schedule. When they play, you play. Track your team's progress as the aggregate results determine your club's position in the league table. This year, new intelligent A.I. ensures that your 11 men on the pitch make realistic decisions, finding space and passing like professionals. A complete overhaul of the game engine now means that you have to employ real world tactics, make split-second decisions and think like a player in order to win matches.  Watch as your players jostle and collide realistically while trying to win balls. Experience the realism of the world's superstars, who come to life with signature moves and authentic playing styles and a more sophisticated shooting mechanic that gives you greater control to produce finesse shots.  Plus you now have the ability to apply topspin or backspin to the ball for more creative set-pieces. [Electronic Arts]… Expand"}, {"name": "Metal Slug Anthology", "details_link": "https://www.metacritic.com/game/playstation-2/metal-slug-anthology", "publisher": "SNK Playmore", "release_date": "Mar 28 2007", "developers": ["Terminal Reality"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/3f14bfc333e9c212c4426e6208e7b8a2-98.jpg", "descriptions": "SNK Playmore, in celebration of the 10th Anniversary of their classic arcade franchise Metal Slug, releases the greatest array of Metal Slug titles ever assembled for the PSP including Metal Slug, Metal Slug 2, Metal Slug X, Metal Slug 3, Metal Slug 4, Metal Slug 5 and Metal Slug 6. [SNK Playmore]"}, {"name": "Amnesia: Rebirth", "details_link": "https://www.metacritic.com/game/pc/amnesia-rebirth", "publisher": "Frictional Games", "release_date": "Oct 20 2020", "developers": ["Frictional Games"], "platforms": ["PlayStation 4", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/8dcfbfce2b660c024866cab230d4412a-98.jpg", "descriptions": "You can't let out a breath. The creature is only inches away. Its sole purpose - to feed off your terror. And so you crouch in the dark, trying to stop the fear rising, trying to silence what lies within you. \"I know you. I know what you're capable of.\" In Amnesia: Rebirth, you are TasiYou can't let out a breath. The creature is only inches away. Its sole purpose - to feed off your terror. And so you crouch in the dark, trying to stop the fear rising, trying to silence what lies within you. \"I know you. I know what you're capable of.\" In Amnesia: Rebirth, you are Tasi Trianon, waking up deep in the desert of Algeria. Days have passed. Where have you been? What did you do? Where are the others? Retrace your journey, pull together the fragments of your shattered past; it is your only chance to survive the pitiless horror that threatens to devour you.\r \"Do not allow yourself anger, do not allow yourself to fear.\"\r Time is against you. Step into Tasi's shoes and guide her through her personal terror and pain. While you struggle to make your way through a desolate landscape, you must also struggle with your own hopes, fears, and bitter regrets. And still you must continue, step by step, knowing that if you fail you will lose everything.\r * First-person narrative horror experience\r* Explore environments and uncover their histories.\r* Overcome puzzles that stand in your way.\r* Carefully manage your limited resources, both physical and mental.\r* Encounter horrific creatures and use your wits and understanding of the world to escape them.… Expand"}, {"name": "Snipperclips - Cut it out, together!", "details_link": "https://www.metacritic.com/game/switch/snipperclips---cut-it-out-together!", "publisher": "Nintendo", "release_date": "Mar  3 2017", "developers": ["Nintendo", "SFB Games"], "platforms": "Switch", "genres": ["Puzzle", "General"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/43fbda249278ff6046912c46e3d817e6-98.jpg", "descriptions": "Cut paper characters into new shapes to solve dynamic puzzles and play activities in a wonderfully creative and imaginative world. Work together with friends to cut paper characters into new shapes and solve puzzles – Communicate and cooperate (or not) and move the paper characters on theCut paper characters into new shapes to solve dynamic puzzles and play activities in a wonderfully creative and imaginative world. Work together with friends to cut paper characters into new shapes and solve puzzles – Communicate and cooperate (or not) and move the paper characters on the screen. Get creative and cut shapes out of each other to interact with the environment, move objects, and solve puzzles.… Expand"}, {"name": "The Banner Saga", "details_link": "https://www.metacritic.com/game/pc/the-banner-saga", "publisher": "Versus Evil", "release_date": "Jan 14 2014", "developers": ["Stoic"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/1304a2bf9fb8b00e49403e931ef7faff-98.jpg", "descriptions": "Live through an epic role-playing Viking saga where your strategic choices directly affect your personal journey. Make allies as you travel with your caravan across this stunning yet harsh landscape. Carefully choose those who will help fight a new threat that jeopardizes an entire civilization."}, {"name": "Resident Evil 4", "details_link": "https://www.metacritic.com/game/switch/resident-evil-4", "publisher": "Capcom", "release_date": "May 21 2019", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/9b1dbf006b2b2e99b210203df8f493ba-98.jpg", "descriptions": "Six years after the destruction of Raccoon City, Leon Kennedy, now an agent with the US Secret Service, is sent on a rescue mission in Europe. His target is Ashley Graham, the president's daughter. Leon locates a man in a remote house in the mountains and inquires about Ashley's whereabouts,Six years after the destruction of Raccoon City, Leon Kennedy, now an agent with the US Secret Service, is sent on a rescue mission in Europe. His target is Ashley Graham, the president's daughter. Leon locates a man in a remote house in the mountains and inquires about Ashley's whereabouts, but receives no answer. Suddenly, the man turns and attempts to strike Leon! Visions of the horror of Raccoon City flood Leon's mind as he realizes his nightmare has not yet ended.… Expand"}, {"name": "WWE SmackDown vs. Raw 2010", "details_link": "https://www.metacritic.com/game/xbox-360/wwe-smackdown-vs-raw-2010", "publisher": "THQ", "release_date": "Oct 20 2009", "developers": ["Yuke's"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/9bc17f05892f0f957ffdc1b1e8a0d7e0-98.jpg", "descriptions": "CREATE-A-SUPERSTAR REDESIGN - The franchise’s renowned customization interface delivers a new look, improved graphical quality and a host of new parts, allowing players to create Superstars who are comparable in quality with their WWE counterparts.  Take creation one step further with a newCREATE-A-SUPERSTAR REDESIGN - The franchise’s renowned customization interface delivers a new look, improved graphical quality and a host of new parts, allowing players to create Superstars who are comparable in quality with their WWE counterparts.  Take creation one step further with a new Paint Tool to detail created Superstars with original tattoos, logos and other unique designs. SHARE THE CREATIVITY - Share created content with the WWE Universe by uploading created Superstars, entrances, finishing moves, highlight reels, created storylines and more.  Utilize the keyword search engine to view created content from around the world and download for use both offline and online. SUPERSTAR THREADS - For the first time in franchise history, create alternate ring gear for Superstars by customizing the colors of shirts, logos, face paint, elbow pads, boots and much more.  Save the alternate looks for use throughout the game and online to show off the Superstars in grand fashion. [THQ]… Expand"}, {"name": "Sam & Max Episode 202: Moai Better Blues", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-202-moai-better-blues", "publisher": "Telltale Games", "release_date": "Jan 10 2008", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/cd0c0a92cab6cbd618bbe996c2b2369e-98.jpg", "descriptions": "A surprise trip to the tropics turns into a working vacation when Sam & Max sign up to stop a massive volcano eruption. Will their special blend of bewildering wit and renegade justice be enough to win over the gods, not to mention the locals? [GameTap]"}, {"name": "Final Fantasy Tactics A2: Grimoire of the Rift", "details_link": "https://www.metacritic.com/game/ds/final-fantasy-tactics-a2-grimoire-of-the-rift", "publisher": "Square Enix", "release_date": "Jun 24 2008", "developers": ["Square Enix"], "platforms": "DS", "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "Fantasy", "Tactics"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/49585e15447636cf730f9ce82583d58f-98.jpg", "descriptions": "School is out for the summer, but mischievous Luso Clemens must first face detention to make up for his misbehavior. Alone in the library, he stumbles upon an ancient book with magical powers that summons him to the mystical land of Ivalice. Warped into the middle of a battlefield, LusoSchool is out for the summer, but mischievous Luso Clemens must first face detention to make up for his misbehavior. Alone in the library, he stumbles upon an ancient book with magical powers that summons him to the mystical land of Ivalice. Warped into the middle of a battlefield, Luso joins Cid and his clan to set off on an adventurous journey looking for a way home. Explore the fantastic world of Ivalice and join forces with famous heroes from FINAL FANTASY  XII – Vaan, Penelo and Al-Cid. All-new content and enhancements, including polished game mechanics, new jobs, new classes, and a new clan system that enrich the Ivalice experience for fans and newcomers alike. The North American release will allow players to command characters in battle and navigate through menus all with a tap of the stylus \rWitness vibrant and colorful visuals in dual-screen presentation, made possible by Nintendo DS. Increased replay value with up to 400 available quests, allowing players to immerse themselves in a multi-faceted storyline. [Square Enix]… Expand"}, {"name": "Fashion Police Squad", "details_link": "https://www.metacritic.com/game/switch/fashion-police-squad", "publisher": "No More Robots", "release_date": "Feb  2 2023", "developers": ["No More Robots"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/c70cfc7483b13ae5b4630effce19f5c6-98.jpg", "descriptions": "Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight againstCalling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!… Expand"}, {"name": "Card Shark", "details_link": "https://www.metacritic.com/game/pc/card-shark", "publisher": "Devolver Digital", "release_date": "Jun  2 2022", "developers": ["Nerial"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game", "Adventure", "General"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/a45c004072b4087a5dfe11f0649ca50c-98.jpg", "descriptions": "Card Shark is an adventure game full of cunning, intrigue, and delectable deceit. \"Our adversaries tonight? An unscrupulous group of scoundrels and rogues, rumoured to possess an unlimited fund between them. If we stick to the strategies you’ve learnt, this will be a walkover.\"\r- Comte deCard Shark is an adventure game full of cunning, intrigue, and delectable deceit. \"Our adversaries tonight? An unscrupulous group of scoundrels and rogues, rumoured to possess an unlimited fund between them. If we stick to the strategies you’ve learnt, this will be a walkover.\"\r- Comte de Saint-Germain\r LEARN AND MASTER NEW TRICKS\rCheat your way to the top of 18th-century French society. Master deceptions using card marking, false shuffles, deck switching, false deals, and more! Use your ill-gotten gains to buy your way into the closed world of high-stakes tables.\r UNCOVER A CONSPIRACY\r... as you climb from local card parlors to the King's table.\rA word of advice: Don't get caught. Your fellow gamblers do not take kindly to cheats…\r TRAVEL THROUGH 18TH CENTURY FRANCE\rDiscover small towns, remote mansions, and luxurious lounges imagined by Nerial team (Reigns), game creator Arnaud De Bock (Pikuniku). Immerse yourself in the ornate visual artwork of Nicolai Troshinsky. Have your every move accompanied by an original score from Andrea Boccadoro as interpreted by an orchestra.… Expand"}, {"name": "F.I.S.T.: Forged In Shadow Torch", "details_link": "https://www.metacritic.com/game/playstation-5/fist-forged-in-shadow-torch", "publisher": "bilibili", "release_date": "Sep  7 2021", "developers": ["TIGAMES"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "Metroidvania"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/78c4c0e6c2b52ea8e9ae43f531bdd9ad-98.jpg", "descriptions": "Six years ago, the Machine Legion invaded and colonized the Torch City, which was originally inhabited by animals. Rayton, the former soldier in the resistance war, has been living in seclusion since then. After his friend is forcibly arrested, Rayton reclaims his mechanical fist and stepsSix years ago, the Machine Legion invaded and colonized the Torch City, which was originally inhabited by animals. Rayton, the former soldier in the resistance war, has been living in seclusion since then. After his friend is forcibly arrested, Rayton reclaims his mechanical fist and steps to his journey fighting back. And he never expects that he has been involved in a bigger scheme between the mafia, the rebellion, and the legion.\r Exploring the Metroidvania game world with a dozen of areas with distinguishing vision themes and level designs. Earning the rewards by conquering the challenges of combats, puzzles and platformers in countless chambers, tunnels and shortcuts.\r Interconnected and automatically loading game map makes the detailed Torch City more convincing and beautiful.… Expand"}, {"name": "Trine 4: The Nightmare Prince", "details_link": "https://www.metacritic.com/game/switch/trine-4-the-nightmare-prince", "publisher": "Modus Games", "release_date": "Oct  8 2019", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/a7179e1fd19fd15eae006ea82e596371-98.jpg", "descriptions": "The Trine series returns to the magic of 2.5D with Trine 4: The Nightmare Prince! The three heroes of the best-selling adventure series are back, sent on a quest to retrieve the troubled young Prince Selius. Amadeus the Wizard, Pontius the Knight, and Zoya the Thief are joined together onceThe Trine series returns to the magic of 2.5D with Trine 4: The Nightmare Prince! The three heroes of the best-selling adventure series are back, sent on a quest to retrieve the troubled young Prince Selius. Amadeus the Wizard, Pontius the Knight, and Zoya the Thief are joined together once again on a thrilling quest through fantastical fairytale landscapes teeming with danger.   Prince Selius suffers from intensely dark dreams and, due to his magical talents, monstrous nightmares are able to slip into reality and wreak havoc on the waking world. Amadeus, Pontius, and Zoya must find the afflicted prince and resolve the desperate situation before the world is engulfed by the Nightmare Prince's shadows.… Expand"}, {"name": "Pinball FX3: Bethesda Pinball", "details_link": "https://www.metacritic.com/game/switch/pinball-fx3-bethesda-pinball", "publisher": "Zen Studios", "release_date": "Apr  4 2018", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Action", "Pinball"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": null}, {"name": "Age of Wonders III - Eternal Lords", "details_link": "https://www.metacritic.com/game/pc/age-of-wonders-iii---eternal-lords", "publisher": "Triumph Studios", "release_date": "Apr 14 2015", "developers": ["Triumph Studios"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/3/d02946963f2647132b0a385e6182425f-98.jpg", "descriptions": "Eternal Lords is the major, second expansion for the acclaimed strategy game Age of Wonders III. With the introduction of the Tigran and Frostling races and the new Necromancer class, players must adapt to a world on the brink of cataclysmic change. New features such as the Race GovernanceEternal Lords is the major, second expansion for the acclaimed strategy game Age of Wonders III. With the introduction of the Tigran and Frostling races and the new Necromancer class, players must adapt to a world on the brink of cataclysmic change. New features such as the Race Governance system, which allows players to tailor features of each race in their empire to meet their strategic needs, add new layers of depth to empire development and diplomacy. … Expand"}, {"name": "Game of Thrones: Episode Three - The Sword in the Darkness", "details_link": "https://www.metacritic.com/game/xbox-one/game-of-thrones-episode-three---the-sword-in-the-darkness", "publisher": "Telltale Games", "release_date": "Mar 25 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/e60279c8783660f460c9ea3dfac681c9-98.jpg", "descriptions": "Asher, the exile, proceeds to Mereen in search of an army to take on the Whitehills. Meanwhile in Westeros, Mira must deal with the lethal politics of King’s Landing. [Telltale Games]"}, {"name": "Pro Evolution Soccer 2013", "details_link": "https://www.metacritic.com/game/pc/pro-evolution-soccer-2013", "publisher": "Konami", "release_date": "Sep 25 2012", "developers": ["Konami"], "platforms": ["3DS", "PlayStation 2", "PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 80, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/203aa09368a8140e095dbd8d259153c4-98.jpg", "descriptions": "Pro Evolution Soccer 2013 brings Konami's football franchise back for another year."}, {"name": "Red Dead Redemption: Liars and Cheats", "details_link": "https://www.metacritic.com/game/playstation-3/red-dead-redemption-liars-and-cheats", "publisher": "Rockstar Games", "release_date": "Sep 21 2010", "developers": ["Rockstar San Diego"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/e8a6ddd944a4233576f3a5800f8bdf46-98.jpg", "descriptions": "Red Dead Redemption: Liars and Cheats introduces Stronghold, a team based Competitive Multiplayer Mode, and the Explosive Rifle, a new, destructive addition to the arsenal."}, {"name": "FIFA 07 Soccer", "details_link": "https://www.metacritic.com/game/gamecube/fifa-07-soccer", "publisher": "EA Sports", "release_date": "Oct  3 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/6d67fae39e0088b42a542520bd88f213-98.jpg", "descriptions": "FIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new onlineFIFA 07 delivers complete authenticity with licenses for all the world's top leagues, including MLS and Mexican 1st Division in North America, and 26 others from over 20 nations. This year, you have the power to shape your club's destiny in the EA Sports Interactive Leagues, a new online mode that enables you to pit your club against supporters of your real-world opponents. The online interactive leagues feature the F.A. Premier League, Bundesliga, French League and the Mexican 1st Division. Experience the future of online gaming as you play your games according to the real-world schedule. When they play, you play. Track your team's progress as the aggregate results determine your club's position in the league table. This year, new intelligent A.I. ensures that your 11 men on the pitch make realistic decisions, finding space and passing like professionals. A complete overhaul of the game engine now means that you have to employ real world tactics, make split-second decisions and think like a player in order to win matches. Watch as your players jostle and collide realistically while trying to win balls. Experience the realism of the world's superstars, who come to life with signature moves and authentic playing styles and a more sophisticated shooting mechanic that gives you greater control to produce finesse shots. Plus you now have the ability to apply topspin or backspin to the ball for more creative set-pieces.… Expand"}, {"name": "Tiger Woods PGA Tour 10", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-10", "publisher": "Electronic Arts", "release_date": "Jun  8 2009", "developers": ["EA Tiburon"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/843d8de04655c53c56132631b7e2550f-98.jpg", "descriptions": "Tiger Woods PGA Tour 10 takes golf fans inside-the-ropes to experience the drama and emotion of tournament golf. In addition, the U.S. Open, a USGA championship, and the USGA’s Rules of Golf is available in Tiger Woods PGA Tour 10 for the first time in franchise history. As you hear the roarTiger Woods PGA Tour 10 takes golf fans inside-the-ropes to experience the drama and emotion of tournament golf. In addition, the U.S. Open, a USGA championship, and the USGA’s Rules of Golf is available in Tiger Woods PGA Tour 10 for the first time in franchise history. As you hear the roar of the crowd from the next hole over, can you handle the mounting pressure while you stand over your tournament-winning putt? Expanded crowds surround every hole; adding to the tension and excitement of each shot. A first for the franchise, real-time weather is reflected on every course, ensuring the in-game experience matches that of the current weather conditions. Tiger Woods PGA Tour 10 also features a television broadcast style presentation, which include instantaneous updates and a new announcer team of ESPN’s Scott Van Pelt and the Golf Channel’s Kelly Tilghman. [Electronic Arts]… Expand"}, {"name": "Hot Shots Golf Fore!", "details_link": "https://www.metacritic.com/game/playstation-2/hot-shots-golf-fore!", "publisher": "SCEA", "release_date": "Aug 17 2004", "developers": ["Clap Hanz"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Arcade"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/d743b87c6234a3f94434c4e2d9a56ba5-98.jpg", "descriptions": "(Also known as \"Minna No Golf 4,\" or \"Everybody's Golf 4\") Join in on the off-the-wall fun, true-to-life physics and new Online gameplay. With more courses and more characters than ever before Hot Shots Golf FORE! delivers more of what HSG fanatics have grown to love. Join a full cast of(Also known as \"Minna No Golf 4,\" or \"Everybody's Golf 4\") Join in on the off-the-wall fun, true-to-life physics and new Online gameplay. With more courses and more characters than ever before Hot Shots Golf FORE! delivers more of what HSG fanatics have grown to love. Join a full cast of off-the-wall characters from the Clubhouse. 34 in all. Enjoy a variety of 15 different courses, from challenging 18-hole layouts, par 3 executive courses, and back by popular demand, Miniature Golf. Breathtaking graphics feature fully detailed course layouts with tree-lined fairways, manicured greens and treacherous hazards. Brilliant lighting effects and dramatic camera angles add energy and drama to spectacular shots and untimely 'shanks'. True-to-life golf physics and touch sensitive controls demand your careful consideration to golf?s many variables, such as wind, ball lie and course elevation. Intuitive controls and adjustable difficulty settings provide easy access for hackers and challenging gameplay for seasoned veterans. Fast paced arcade style gameplay eliminates waiting for load times...or slow foursomes. Test your golf skills in several different modes including, Tour, VS, and Training modes. Online play...Share the course with thousands of Hot Shots Golf fanatics from across the nation. [Sony]… Expand"}, {"name": "Assassin's Creed: Revelations", "details_link": "https://www.metacritic.com/game/playstation-3/assassins-creed-revelations", "publisher": "Ubisoft", "release_date": "Nov 15 2011", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Historic", "Historic", "Open-World"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/422e5c5359c7f91af4f97b352ca90f6d-98.jpg", "descriptions": "Revelations follows master assassin Ezio Auditore as he walks in the footsteps of his legendary mentor, Altair, on a journey to recover five ancient seals that hold the keys to the future of the Assassins brotherhood. It's a perilous path - one that will take Ezio to Constantinople, theRevelations follows master assassin Ezio Auditore as he walks in the footsteps of his legendary mentor, Altair, on a journey to recover five ancient seals that hold the keys to the future of the Assassins brotherhood. It's a perilous path - one that will take Ezio to Constantinople, the heart of the Ottoman Empire, where a growing army of Templars threatens to destabilize the region. … Expand"}, {"name": "Osmos", "details_link": "https://www.metacritic.com/game/pc/osmos", "publisher": "Hemisphere Games", "release_date": "Aug 18 2009", "developers": ["Hemisphere Games"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/c122e676e601dff96059ebe9a5bfe4de-98.jpg", "descriptions": "Enter the ambient world of Osmos: elegant, physics-based gameplay, dreamlike visuals, and a minimalist, electronic soundtrack. Your objective is to grow by absorbing other motes. Propel yourself by ejecting matter behind you. But be wise: ejecting matter also shrinks you. Relax - good thingsEnter the ambient world of Osmos: elegant, physics-based gameplay, dreamlike visuals, and a minimalist, electronic soundtrack. Your objective is to grow by absorbing other motes. Propel yourself by ejecting matter behind you. But be wise: ejecting matter also shrinks you. Relax - good things come to those who wait. [Steam]… Expand"}, {"name": "Assassin's Creed Valhalla", "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-valhalla", "publisher": "Ubisoft", "release_date": "Nov 10 2020", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/69c6bb593d196b21bfc299e53de26928-98.jpg", "descriptions": "Build your own Viking Legend. Become Eivor, a Viking raider raised to be a fearless warrior, and lead your clan from icy desolation in Norway to a new home amid the lush farmlands of ninth-century England. Find your settlement and conquer this hostile land by any means to earn a place inBuild your own Viking Legend. Become Eivor, a Viking raider raised to be a fearless warrior, and lead your clan from icy desolation in Norway to a new home amid the lush farmlands of ninth-century England. Find your settlement and conquer this hostile land by any means to earn a place in Valhalla. England in the age of the Vikings is a fractured nation of petty lords and warring kingdoms. Beneath the chaos lies a rich and untamed land waiting for a new conqueror. Will it be you? Write Your Viking Saga. Blaze your own path across England with advanced RPG mechanics. Fight brutal battles, lead fiery raids or use strategy and alliances with other leaders to bring victory. Every choice you make in combat and conversation is another step on the path to greatness. Lead Epic Raids. Lead a crew of raiders and launch lightning-fast surprise attacks against Saxon armies and fortresses. Claim the riches of your enemies' lands for your clan and expand your influence far beyond your growing settlement. ENGAGE IN VISCERAL COMBAT. Unleash the ruthless fighting style of a Viking warrior as you dual-wield axes, swords, or even shields against relentless foes. Decapitate opponents in close-quarters combat, riddle them with arrows, or assassinate them with your Hidden Blade. Grow Your Settlement. Your clan's new home grows with your legend. Customise your settlement by building upgradable structures. Unlock new features and quests by constructing a barracks, a blacksmith, a tattoo parlour, and much more. Share Your Custom Raider. Recruit mercenary Vikings designed by other players or create and customise your own to share online. Sit back and reap the rewards when they fight alongside your friends in their game worlds. A Dark Age Open World. Sail across the icy North Sea to discover and conquer the broken kingdoms of England. Immerse yourself in activities like hunting and drinking games or engage in traditional Norse competitions like flyting – or, as it's better known, verbally devastating rivals through the art of the Viking rap battle. [Ubisoft]… Expand"}, {"name": "Ys IX: Monstrum Nox", "details_link": "https://www.metacritic.com/game/playstation-4/ys-ix-monstrum-nox", "publisher": "NIS America", "release_date": "Feb  2 2021", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/207207e04192abbaf6501b9f4fb6a214-98.jpg", "descriptions": "Renowned adventurer Adol “the Red” Christin and his companion Dogi arrive at Balduq, a city annexed by the Romun Empire, only for Adol to be detained before setting foot inside. While imprisoned, he meets a mysterious woman named Aprilis who turns him into a Monstrum, a being withRenowned adventurer Adol “the Red” Christin and his companion Dogi arrive at Balduq, a city annexed by the Romun Empire, only for Adol to be detained before setting foot inside. While imprisoned, he meets a mysterious woman named Aprilis who turns him into a Monstrum, a being with supernatural Gifts and the power to exorcise monsters. Now, Adol must ally with his fellow Monstrums to fend off the fearsome threats emerging from a shadowy dimension called the Grimwald Nox, as well as unravel the mysteries of the Monstrum curse, and the truth behind the unrest within Balduq. … Expand"}, {"name": "Assassin's Creed: The Rebel Collection", "details_link": "https://www.metacritic.com/game/switch/assassins-creed-the-rebel-collection", "publisher": "Ubisoft", "release_date": "Dec  6 2019", "developers": ["Ubisoft"], "platforms": "Switch", "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/f06343dd879ff4cd30373fe2582085c2-98.jpg", "descriptions": "Become the most feared pirate in the Caribbean in Assassin’s Creed IV Black Flag. Take part in an award-winning naval experience and explore a massive open world. Become the ultimate assassin hunter in Assassin’s Creed® Rogue, and play as a Templar for the first time in franchise history.Become the most feared pirate in the Caribbean in Assassin’s Creed IV Black Flag. Take part in an award-winning naval experience and explore a massive open world. Become the ultimate assassin hunter in Assassin’s Creed® Rogue, and play as a Templar for the first time in franchise history. Experience enhanced features like Handheld Mode, HD Rumble, Touch Screen Interface, and Motion Control Aiming.… Expand"}, {"name": "Subnautica", "details_link": "https://www.metacritic.com/game/playstation-4/subnautica", "publisher": "Unknown Worlds Entertainment", "release_date": "Dec  4 2018", "developers": ["Unknown Worlds Entertainment", "Panic Button"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Sandbox"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/59128c22c7cddcb7b794dab39ee38665-98.jpg", "descriptions": "Descend into the depths of an alien underwater world filled with resources, creatures, wonder and threats. Craft equipment and submarines to explore lush coral reefs, volcanoes, cave systems, and more  all while trying to survive."}, {"name": "Hand of Fate 2", "details_link": "https://www.metacritic.com/game/pc/hand-of-fate-2", "publisher": "Defiant Development", "release_date": "Nov  7 2017", "developers": ["Defiant Development"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/48363ab6fde738db4d8529a4f5a204da-98.jpg", "descriptions": "Hand of Fate 2 is a dungeon crawler set in a world of dark fantasy. Master a living board game where every stage of the adventure is drawn from a deck of legendary encounters chosen by you."}, {"name": "Battlefield 4", "details_link": "https://www.metacritic.com/game/playstation-3/battlefield-4", "publisher": "Electronic Arts", "release_date": "Oct 29 2013", "developers": ["EA DICE"], "platforms": ["PC", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 22 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 80, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/650394bd02f28c65598190aedd8121b8-98.jpg", "descriptions": "Battlefield 4 is an action blockbuster that aims for unrivaled destruction. Fueled by Frostbite 3, Battlefield 4 allows you to demolish the buildings shielding your enemy. You will lead an assault from the back of a gun boat. Battlefield grants you the freedom to do more and be more whileBattlefield 4 is an action blockbuster that aims for unrivaled destruction. Fueled by Frostbite 3, Battlefield 4 allows you to demolish the buildings shielding your enemy. You will lead an assault from the back of a gun boat. Battlefield grants you the freedom to do more and be more while playing to your strengths and carving your own path to victory. Beyond its hallmark multiplayer, Battlefield 4 features an intense, dramatic character-driven campaign that starts with the evacuation of American VIPs from Shanghai and follows your squad's struggle to find its way home. Change the landscape in real-time with interactive environments that react to your every move. Dominate land, air and sea with all-new, intense water-based vehicular combat.… Expand"}, {"name": "Disney Infinity 3.0 Edition", "details_link": "https://www.metacritic.com/game/playstation-4/disney-infinity-30-edition", "publisher": "Disney Interactive Studios", "release_date": "Aug 30 2015", "developers": ["Avalanche Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/49fa25ee07fce0e0e8f48535630bafeb-98.jpg", "descriptions": "Twilight of the Republic is an all-new, original chapter of the Star Wars Saga, set in the Episodes I-III timeline. Get ready to use the Force and Lightsabers in epic battles as Anakin Skywalker, Ahsoka Tano, Obi-Wan Kenobi, Yoda, and Darth Maul."}, {"name": "Fire Emblem Engage", "details_link": "https://www.metacritic.com/game/switch/fire-emblem-engage", "publisher": "Nintendo", "release_date": "Jan 20 2023", "developers": ["Intelligent Systems"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/e0ffbb047edcb35ec65801d8693fc347-98.jpg", "descriptions": "In a war against the Fell Dragon, four kingdoms worked together with heroes from other worlds to seal away this great evil. One-thousand years later, this seal has weakened and the Fell Dragon is about to reawaken. As a Divine Dragon, use rich strategies and robust customization to meet yourIn a war against the Fell Dragon, four kingdoms worked together with heroes from other worlds to seal away this great evil. One-thousand years later, this seal has weakened and the Fell Dragon is about to reawaken. As a Divine Dragon, use rich strategies and robust customization to meet your destiny—to collect Emblem Rings and bring peace back to the Continent of Elyos.\r Team up with iconic heroes from past Fire Emblem games\r Summon valiant heroes like Marth and Celica with the power of Emblem Rings and add their power to yours in this brand-new Fire Emblem story. Aside from merging appearances, Engaging lets you inherit weapons, skills, and more from these battle-tested legends. The turn-based, tactical battle system returns with a fresh cast of characters you can customize and Engage to carefully craft your strategy.… Expand"}, {"name": "Eternal Sonata", "details_link": "https://www.metacritic.com/game/playstation-3/eternal-sonata", "publisher": "Namco Bandai Games America", "release_date": "Oct 21 2008", "developers": ["Tri-Crescendo"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/addd0959678808e734dcac368363b7d7-98.jpg", "descriptions": "On his deathbed, the famous composer, Chopin, drifts between this life and the next. In his final hours, he experiences a fantastical dream where he encounters a young girl facing a terrible destiny and the boy who will fight to save her. On the border between dreams and reality, ChopinOn his deathbed, the famous composer, Chopin, drifts between this life and the next. In his final hours, he experiences a fantastical dream where he encounters a young girl facing a terrible destiny and the boy who will fight to save her. On the border between dreams and reality, Chopin discovers the light that shines in all of us in this enduring tale of good and evil, love and betrayal. [Namco Bandai Games]… Expand"}, {"name": "Dungeon Siege II", "details_link": "https://www.metacritic.com/game/pc/dungeon-siege-ii", "publisher": "Microsoft Game Studios", "release_date": "Aug 16 2005", "developers": ["Gas Powered Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/1/1b72ac908b025e8db27ce47e89e669f8-98.jpg", "descriptions": "It's been a generation since you vanquished the evil that plagued the Land of Ehb, and now a new menace has awakened. In Dungeon Siege II, you will be called on to again wield sword and spell to save the world from a growing abomination many years in the making. A thousand years ago, theIt's been a generation since you vanquished the evil that plagued the Land of Ehb, and now a new menace has awakened. In Dungeon Siege II, you will be called on to again wield sword and spell to save the world from a growing abomination many years in the making. A thousand years ago, the crusaders of Azunai crossed swords with the legions of Zaramoth in the final battle of a century-long rebellion. As the tyrannical god Zaramoth struck the final blow through Azunai's trembling shield, the earth shook. In that moment, the forces of magic were unchained, and both armies were consumed in a brilliant cataclysm that stretched for leagues across the Plain of Tears. Only a scarred wasteland remained as final testament to the First Age of Man. And for a millennium, magic has continued to spread to the farthest corners of the world, freely flowing to any who would command it. But the tide of magic has begun to wane, heeding instead the call of an ancient legacy. From the Plain of Tears a new heir beckons, and with each day his strength grows. Consuming those who submit, eradicating those who resist. With none to oppose his ascendance, the circle will be complete, and an ancient age will begin anew. What fate will befall the Second Age of Man? The time for judgment is nigh. [Microsoft]… Expand"}, {"name": "Street Fighter Alpha 3 MAX", "details_link": "https://www.metacritic.com/game/psp/street-fighter-alpha-3-max", "publisher": "Capcom", "release_date": "Feb  7 2006", "developers": ["Capcom"], "platforms": "PSP", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/f683a7edcd66cb73da6a0d3ac0ebed25-98.jpg", "descriptions": "A direct conversion of the critically acclaimed arcade fighting game, Street Fighter Alpha 3, Street Fighter Alpha 3 Max is enhanced with additional original content specifically designed for the portable system including Wi-Fi functionality and extra gameplay modes. Adding to an impressiveA direct conversion of the critically acclaimed arcade fighting game, Street Fighter Alpha 3, Street Fighter Alpha 3 Max is enhanced with additional original content specifically designed for the portable system including Wi-Fi functionality and extra gameplay modes. Adding to an impressive roster of more than 30 renowned characters from the world famous Street Fighter universe, four additional fighters are joining the fierce competition. Utilizing the PSP system's superior performance and technology, Street Fighter Alpha 3 Max features new content specifically designed for the system. A gameplay mode new to the Street Fighter Alpha series, Variable Battle Mode, has been implemented to allow real-time tag team brawls. Tag out and the second fighter enters performing a jump attack, a move useful for escaping tight situations. Yun, Maki and Eagle, from Capcom vs. SNK 2, as well as Ingrid from Capcom Fighting Evolution, enter the arena and are perfectly reproduced with all new original storylines. Versus battles heat up with the Wi-Fi League Battle Mode that allow a maximum of eight players to duke it out in round-robin mini tournaments. [Capcom]… Expand"}, {"name": "Dead Island", "details_link": "https://www.metacritic.com/game/pc/dead-island", "publisher": "Deep Silver", "release_date": "Sep  5 2011", "developers": ["Techland"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "4  Online", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/95441509886a7bf9767ec09d15518adb-98.jpg", "descriptions": "A couple flying to the vacation of their dreams is torn apart by a violent plane crash. Take on a harrowing quest to find your lost wife. Enter into the dark world of a devastated tropical paradise now plunged into chaos. It's a place where the word \"dead\" has an entirely new meaning. FaceA couple flying to the vacation of their dreams is torn apart by a violent plane crash. Take on a harrowing quest to find your lost wife. Enter into the dark world of a devastated tropical paradise now plunged into chaos. It's a place where the word \"dead\" has an entirely new meaning. Face the nightmare and fight for survival. Explore the secrets hidden in the darkest regions of the island and fight your way through. Survival is your main goal! Dead Island is a non-linear FPP (First Person Perspective) survival horror title. The ultra-realistic combat system will ensure that every confrontation is a thrilling experience. Use anything you find in your surroundings as a weapon. Make decisions that influence the entire world around you. Take advantage of opponent behavior and game physics. Dead Island is a mix of intense action and chilling horror environments in an engaging, strikingly realistic story. [Techland]… Expand"}, {"name": "Sam & Max Episode 104: Abe Lincoln Must Die!", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-104-abe-lincoln-must-die!", "publisher": "Telltale Games", "release_date": "Feb 22 2007", "developers": ["Telltale Games"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/0d4910a87853c765c83337922c8eca3d-98.jpg", "descriptions": "The president's lost it. Federally mandated group hugs, a pudding embargo...what's next, gun control? Sam & Max are off to Washington to take care of this bozo, but the political climate will only get stormier...and a new power will rise. [TellTale Games]"}, {"name": "SSX On Tour", "details_link": "https://www.metacritic.com/game/gamecube/ssx-on-tour", "publisher": "EA Sports Big", "release_date": "Oct 11 2005", "developers": ["EA Canada"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/52fa6d9111b0c85495d970f565a12ea3-98.jpg", "descriptions": "You can ski or snowboard yourself into stardom in SSX On Tour. The game includes 12 levels for racing and performing stunts. You can earn yourself a spot on the professional tour by winning events and improving your skills. Your success moves you up the rankings until you can call yourselfYou can ski or snowboard yourself into stardom in SSX On Tour. The game includes 12 levels for racing and performing stunts. You can earn yourself a spot on the professional tour by winning events and improving your skills. Your success moves you up the rankings until you can call yourself the best on the mountain. This version of SSX features new graphical effects and controller feedback designed to capture the speed of your races and the massive air of your tricks. SSX On Tour also includes new music, art, and characters.… Expand"}, {"name": "Transpose", "details_link": "https://www.metacritic.com/game/playstation-4/transpose", "publisher": "Secret Location", "release_date": "Nov  6 2018", "developers": ["Secret Location"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/7a78e6cf964489f17130645475f02b26-98.jpg", "descriptions": "Transpose is a dreamlike VR puzzle game set in a universe where time and gravity are used as tools to manipulate the world. By creating and working with looped recordings of their actions, players must solve increasingly complex physics puzzles in a mysterious setting where notions of spaceTranspose is a dreamlike VR puzzle game set in a universe where time and gravity are used as tools to manipulate the world. By creating and working with looped recordings of their actions, players must solve increasingly complex physics puzzles in a mysterious setting where notions of space and time no longer apply.… Expand"}, {"name": "BlazBlue: Chrono Phantasma Extend", "details_link": "https://www.metacritic.com/game/playstation-4/blazblue-chrono-phantasma-extend", "publisher": "Aksys Games", "release_date": "Jun 30 2015", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox One", "PlayStation 4"], "num_players": "Up to 64 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/d603e57ec9ef47c8274c7f22ebca1d4f-98.jpg", "descriptions": "With the revamped Guard Gauge system, players will determine when to attack/block using the Barrier Gauge meter. They  can dish out super-powerful Guard Crush attacks when their opponent's Barrier Gauge is low with the revamped Guard system."}, {"name": "Deus Ex: Invisible War", "details_link": "https://www.metacritic.com/game/pc/deus-ex-invisible-war", "publisher": "Eidos Interactive", "release_date": "Dec  2 2003", "developers": ["Ion Storm"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/e7bdaff592423c4350d1de57726afc57-98.jpg", "descriptions": "Fifteen years following the events depicted in the multi-award winning \"Deus Ex,\" the world is just beginning to recover from catastrophic depression. As an elite anti-terrorist agent, you must fight numerous militant factions bent on violently reshaping the world to suit their own agendas.Fifteen years following the events depicted in the multi-award winning \"Deus Ex,\" the world is just beginning to recover from catastrophic depression. As an elite anti-terrorist agent, you must fight numerous militant factions bent on violently reshaping the world to suit their own agendas. Using high-tech gadgetry and futuristic body modification (or biomods), you are granted near superhuman powers. Travel the globe while uncovering fiendish plots of world domination. Unmask the conspirators, while uncovering the shocking truth behind your own origins.… Expand"}, {"name": "EyeToy: Play", "details_link": "https://www.metacritic.com/game/playstation-2/eyetoy-play", "publisher": "SCEA", "release_date": "Nov  4 2003", "developers": ["SCEE", "Zoe Mode"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "General"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/3c76fb274c5501b53c17111469fc284f-98.jpg", "descriptions": "EyeToy includes 12 exciting interactive games based on music, puzzles, sports and other original genres. Each mini-game requires the player to use their body in unique ways, from quick jabs in Boxing Chump, high leg kicking in Kung Foo, rhythmically tapping hands and feet in Beat Freak, andEyeToy includes 12 exciting interactive games based on music, puzzles, sports and other original genres. Each mini-game requires the player to use their body in unique ways, from quick jabs in Boxing Chump, high leg kicking in Kung Foo, rhythmically tapping hands and feet in Beat Freak, and even using high-knees and headers in Keep Ups. The multiplayer mode offers numerous additional challenges and a chance to compete against and laugh with, and at, friends. With no need for a controller, anyone can have fun with EyeToy, and no previous gaming experience is required. Watch as players jump, kick, and flail their arms to create entertaining action with EyeToy. [Sony]… Expand"}, {"name": "The Sims: Makin' Magic", "details_link": "https://www.metacritic.com/game/pc/the-sims-makin-magic", "publisher": "EA Games", "release_date": "Oct 28 2003", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/8b5907d1e00f597ba62a1b0ea81c2b22-98.jpg", "descriptions": "Your Sims can now harness the supernatural, casting spells with playful or mischievous intentions. With a new magical, carnival-themed location, over 175 new items, and a host of quirky new characters, Makin? Magic is the largest Sims Expansion Pack ever. New gameplay includes making,Your Sims can now harness the supernatural, casting spells with playful or mischievous intentions. With a new magical, carnival-themed location, over 175 new items, and a host of quirky new characters, Makin? Magic is the largest Sims Expansion Pack ever. New gameplay includes making, gathering, and questing for ingredients to brew magic spell recipes. Get help around the house from magical minions, turn pesky neighbors into toads, or make that hard-to-get Sim fall in love with you. But watch out, spells can backfire if you?re not careful. Either way, the neighborhood will never be the same. [Electronic Arts]… Expand"}, {"name": "The Mark of Kri", "details_link": "https://www.metacritic.com/game/playstation-2/the-mark-of-kri", "publisher": "SCEA", "release_date": "Jul 29 2002", "developers": ["SCEA"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/9/eb720c47848aaa28f640be1224b29576-98.jpg", "descriptions": "Set in richly detailed 3D environments, each with its own distinct styles and themes, Rau, a fierce warrior, must battle the denizens of the dark world to prevent the invoking of an ancient spell that holds the power to unleash great evil throughout the land. Along with his loyal and trustedSet in richly detailed 3D environments, each with its own distinct styles and themes, Rau, a fierce warrior, must battle the denizens of the dark world to prevent the invoking of an ancient spell that holds the power to unleash great evil throughout the land. Along with his loyal and trusted spirit guide, Kuzo, a large black bird, Rau embarks on an exhilarating journey that requires a combination of stealth, aggressive-action moves and calculated planning. Kuzo plays a strategic role in the quest with the ability to scout ahead to perches for a better view of looming danger, retrieve items and distract opponents. [SCEA]… Expand"}, {"name": "Broken Sword: The Shadow of the Templars", "details_link": "https://www.metacritic.com/game/game-boy-advance/broken-sword-the-shadow-of-the-templars", "publisher": "Bam Entertainment", "release_date": "Mar 17 2002", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PC", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/29b86b35e6b740d544f96e50d156e4e6-98.jpg", "descriptions": "A quiet drink in a Cafe in Paris is the start of a mysterious adventure for young American George Stobbart. Unwittingly he is drawn into a web of archaic and sinister plots, with origins that extend back to the earty 14th Century and the deadly order of the Knights Templar. Dive into anA quiet drink in a Cafe in Paris is the start of a mysterious adventure for young American George Stobbart. Unwittingly he is drawn into a web of archaic and sinister plots, with origins that extend back to the earty 14th Century and the deadly order of the Knights Templar. Dive into an adventure of global exploration: cryptic puzzle solving; and fight for survival. Feast on over 60 beautifully animated characters in over 70 breathtaking, hand drawn locations. Answer the call to action and challenge yourself to the limit with compelling game play for the would-be adventure.… Expand"}, {"name": "Bomberman Online", "details_link": "https://www.metacritic.com/game/dreamcast/bomberman-online", "publisher": "Sega", "release_date": "Oct 30 2001", "developers": ["Hudson"], "platforms": "Dreamcast", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/4dcfd86bc6e6d00d4e57ed03291da1c3-98.jpg", "descriptions": "Blast your way through the levels by destroying your opponents with strategically placed bombs. You need to use your bombs effectively, but you also better know when to run! Brand new stages and frantic new modes create an endless chain reaction of fun!"}, {"name": "Project Justice", "details_link": "https://www.metacritic.com/game/dreamcast/project-justice", "publisher": "Capcom", "release_date": "May 16 2001", "developers": ["Capcom"], "platforms": "Dreamcast", "genres": ["Action", "Fighting", "3D"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/08365d6592dbd26e9098fcf5cf7dea88-98.jpg", "descriptions": "A group of long time friends now unite in the pursuit of honor and excellence. Setting all past rivalries aside, they band together to uncover the mystery behind an unusual series of events. Join over 20 playable characters, each with their own unique skills and custom attacks, as theyA group of long time friends now unite in the pursuit of honor and excellence. Setting all past rivalries aside, they band together to uncover the mystery behind an unusual series of events. Join over 20 playable characters, each with their own unique skills and custom attacks, as they compete in 3-on-3 battles in beautifully rendered 3-D worlds. Assemble your team and perform incredible fighting combos all for one united goal...Project Justice!… Expand"}, {"name": "Uncharted: Golden Abyss", "details_link": "https://www.metacritic.com/game/playstation-vita/uncharted-golden-abyss", "publisher": "SCEA", "release_date": "Feb 15 2012", "developers": ["Naughty Dog", "Sony Bend"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Linear"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/a459c6019f9af12b03cc666e2ae0830f-98.jpg", "descriptions": "Uncover the dark secret behind the 400-year-old massacre of a Spanish expedition as Nathan Drake tracks the murderous trail of an ancient and secret Spanish sect. Caught in the middle of a rivalry between Jason Dante - his old friend - and Marisa Chase - the granddaughter of an archeologistUncover the dark secret behind the 400-year-old massacre of a Spanish expedition as Nathan Drake tracks the murderous trail of an ancient and secret Spanish sect. Caught in the middle of a rivalry between Jason Dante - his old friend - and Marisa Chase - the granddaughter of an archeologist who has mysteriously vanished without a trace - Nathan Drake delves into the treacherous river basins, undiscovered temple ruins and karst caverns of Central America in search of a legendary lost city, only to find himself pushed to the edge of the Golden Abyss. [Sony]… Expand"}, {"name": "Spider-Man 2", "details_link": "https://www.metacritic.com/game/playstation-2/spider-man-2", "publisher": "Activision", "release_date": "Jun 28 2004", "developers": ["Treyarch"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/1/29f55d9d0676df30a45b775101bb08ae-98.jpg", "descriptions": "Based on the big screen sequel to the original \"Spider-Man\" with Tobey Maguire and Kirsten Dunst, Spider-Man 2 features a new bad guy, Dr. Otto Octavius, who becomes grafted to a set of four mechanical arms which he can use to amazing effect... as a \"mad scientist\" some call \"Doctor Octopus\"Based on the big screen sequel to the original \"Spider-Man\" with Tobey Maguire and Kirsten Dunst, Spider-Man 2 features a new bad guy, Dr. Otto Octavius, who becomes grafted to a set of four mechanical arms which he can use to amazing effect... as a \"mad scientist\" some call \"Doctor Octopus\" or \"Doc Ock.\" Can Spidey avoid getting clobbered by two of Doc Ock's metallic appendages while avoiding the other two? The gameplay of this sequel, unlike that of the straightforward, mostly linear original, lends itself much more to the sense of freedom and exploration made popular with \"Grand Theft Auto III.\"… Expand"}, {"name": "Pix the Cat", "details_link": "https://www.metacritic.com/game/playstation-4/pix-the-cat", "publisher": "Pasta Games", "release_date": "Oct  7 2014", "developers": ["Pasta Games"], "platforms": ["PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "Arcade"], "meta_score": 80, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/c327565fdce52a823d4dd557b9a84aa1-98.jpg", "descriptions": "PIX the CAT is an arcade game designed to make your pads sore. Rescue forsaken ducklings from the nested levels of the infamous GRID of INFINITY. Perfect your skills to SPEED and COMBO UP until you reach the FEVER TIME. Defeat your friends at home in the combat ARENA and compete online withPIX the CAT is an arcade game designed to make your pads sore. Rescue forsaken ducklings from the nested levels of the infamous GRID of INFINITY. Perfect your skills to SPEED and COMBO UP until you reach the FEVER TIME. Defeat your friends at home in the combat ARENA and compete online with the GHOST feature. Surprising surprises are hidden along your adventure, eager to please you when you least expect it.… Expand"}, {"name": "Yakuza Kiwami", "details_link": "https://www.metacritic.com/game/playstation-4/yakuza-kiwami", "publisher": "Sega", "release_date": "Aug 29 2017", "developers": ["Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/c09295b0ca0a589e022c610b6d55caee-98.jpg", "descriptions": "In 2005, a legend was born on the PS2 – the legend of Kazuma Kiryu, the Dragon of Dojima, in his video game debut with Yakuza. Now, 11 years after that release, a new generation of players is be able to experience the action and drama of the Yakuza series with the rebuilt-from-scratch HDIn 2005, a legend was born on the PS2 – the legend of Kazuma Kiryu, the Dragon of Dojima, in his video game debut with Yakuza. Now, 11 years after that release, a new generation of players is be able to experience the action and drama of the Yakuza series with the rebuilt-from-scratch HD remake exclusive to PlayStation 4, Yakuza Kiwami.  “Kiwami” literally translates to “Extreme”: Kiwami adds new story depth over the PS2 original, new distractions around the in-game setting of Kamurocho, added side quests, updated mechanics and combat, and more. [Sony]\r… Expand"}, {"name": "Condemned 2: Bloodshot", "details_link": "https://www.metacritic.com/game/xbox-360/condemned-2-bloodshot", "publisher": "Sega", "release_date": "Mar 11 2008", "developers": ["Monolith Productions"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/4e1592b53283957c9c04679582245a54-98.jpg", "descriptions": "Featuring new fighting mechanics and online multiplayer functionality, Condemned 2: Bloodshot is a first-person action thriller immersing players in a world of psychological terror.  Following a string of gruesome murders, players must use their deductive skills and brute force to track downFeaturing new fighting mechanics and online multiplayer functionality, Condemned 2: Bloodshot is a first-person action thriller immersing players in a world of psychological terror.  Following a string of gruesome murders, players must use their deductive skills and brute force to track down sadistic serial killers. Players assume the identity of Ethan Thomas, former Serial Crimes Unit investigator, who has been called back to duty to track down his missing partner. The disturbing events from Ethan's past have left him a broken man – a desperate burnout drifting aimlessly through society in an inexplicable decline. Fighting inner demons throughout his one-man investigation into a sinister conspiracy, Ethan needs to use anything and everything in the environment to survive as he unravels the mysteries shrouding the city in darkness. As Ethan, players engage in visceral combat using a variety of firearms, blunt instruments and a new fighting system complete with defensive and offensive combo chains, as well as grapples and holds. To help track the killer and solve the mysteries behind Condemned 2: Bloodshot, players crack open an all-new set of high-tech forensic tools. Using wits and brute strength, murders can be solved a number of different ways to keep players guessing throughout each suspenseful investigation. Condemned 2: Bloodshot introduces a variety of online multiplayer modes, including deathmatch. [Sega]… Expand"}, {"name": "Shin Megami Tensei: Strange Journey Redux", "details_link": "https://www.metacritic.com/game/3ds/shin-megami-tensei-strange-journey-redux", "publisher": "Atlus", "release_date": "May 15 2018", "developers": ["Atlus"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Western-Style"], "meta_score": 80, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/14011a11e6c5dd55c7b342ba05cceac1-98.jpg", "descriptions": "A spatial distortion full of demons appeared in Antarctica, threatening to engulf the Earth in Shin Megami Tensei: Strange Journey. The United Nations responded by tasking a team of highly advanced specialists with piercing the anomaly and figuring out how to stop it from the source. Well,A spatial distortion full of demons appeared in Antarctica, threatening to engulf the Earth in Shin Megami Tensei: Strange Journey. The United Nations responded by tasking a team of highly advanced specialists with piercing the anomaly and figuring out how to stop it from the source. Well, get ready to don your Demonica once again in this new expanded port: Shin Megami Tensei: Strange Journey Redux. Expect new story content, additional endings, a new dungeon to explore, and more in the return of this sci-fi tinged SMT adventure.… Expand"}, {"name": "Far Cry 3: Blood Dragon", "details_link": "https://www.metacritic.com/game/xbox-360/far-cry-3-blood-dragon", "publisher": "Ubisoft", "release_date": "May  1 2013", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Stadia", "Xbox One", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/95cf400047395daed0b2d588fc2d03eb-98.jpg", "descriptions": "Far Cry 3 Blood Dragon is THE Kick-Ass Cyber Shooter set in a bizarre open-world island teeming with evil. Welcome to an 80’s VHS vision of the future. The year is 2007 and you assume the role Sargent Rex Colt, a Mark IV Cyber Commando who is fighting against a cyborg army gone irreversiblyFar Cry 3 Blood Dragon is THE Kick-Ass Cyber Shooter set in a bizarre open-world island teeming with evil. Welcome to an 80’s VHS vision of the future. The year is 2007 and you assume the role Sargent Rex Colt, a Mark IV Cyber Commando who is fighting against a cyborg army gone irreversibly rogue. Your mission: get the girl, kill the bad guys, and save the world. Experience every cliché of a VHS era vision of a nuclear future, where cyborgs, blood dragons, mutants, and Michael Biehn (Terminator, Aliens, Navy Seals) collide. [Blood Dragon doesn't require a copy of Far Cry 3.]… Expand"}, {"name": "Driver: San Francisco", "details_link": "https://www.metacritic.com/game/xbox-360/driver-san-francisco", "publisher": "Ubisoft", "release_date": "Sep  6 2011", "developers": ["Ubisoft Reflections"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/00d61dec2ef46db464432b47d6a2f4c4-98.jpg", "descriptions": "Developed by Ubisoft Reflections under the direction of the creators of the original title, DRIVER San Francisco marks the return of the established video game series that has sold 14 million copies worldwide. Gamers will play as Detective John Tanner on a relentless manhunt for crime lordDeveloped by Ubisoft Reflections under the direction of the creators of the original title, DRIVER San Francisco marks the return of the established video game series that has sold 14 million copies worldwide. Gamers will play as Detective John Tanner on a relentless manhunt for crime lord Charles Jericho through the hills of the City by the Bay. Thanks to a groundbreaking gameplay feature, players can now seamlessly \"shift\" between well over a hundred licensed vehicles, keeping them constantly in the heart of the action. With its timeless setting, unique car handling and renewed playability, DRIVER San Francisco will revitalize the classic free-roaming, cinematic car chase experience for the current generation of gaming platforms.… Expand"}, {"name": "The Excavation of Hob's Barrow", "details_link": "https://www.metacritic.com/game/pc/the-excavation-of-hobs-barrow", "publisher": "Wadjet Eye Games", "release_date": "Sep 28 2022", "developers": ["Cloak and Dagger Games"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Adventure", "Point-and-Click"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/ac6d4ca694447e35890d4ec8ae8fe9af-98.jpg", "descriptions": "The Excavation of Hob's Barrow is a folk horror narrative-driven adventure. Explore the isolated moors of rural Victorian England as you uncover the mysteries of Hob's Barrow. The answers lie in the soil..."}, {"name": "Monster Prom 2: Monster Camp", "details_link": "https://www.metacritic.com/game/pc/monster-prom-2-monster-camp", "publisher": "Beautiful Glitch", "release_date": "Oct 23 2020", "developers": ["Beautiful Glitch"], "platforms": ["Switch", "PC"], "num_players": "Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/03158c445cc30da0860b65831fbf26a2-98.jpg", "descriptions": "\"Monster Prom 2: Monster Camp\" brings you more of the world's best (and maybe only?) multiplayer dating sim; but in a way you've never expected! The sequel brings you into a new setup (summer camp) with new characters to romance, including old faces and new ones: Damien, Calculester, Milo,\"Monster Prom 2: Monster Camp\" brings you more of the world's best (and maybe only?) multiplayer dating sim; but in a way you've never expected! The sequel brings you into a new setup (summer camp) with new characters to romance, including old faces and new ones: Damien, Calculester, Milo, Dahlia, Joy and Aaravi. But that's not all, Monster Camp comes with twists here and there: from the campfire mechanics to a new stage full of magic mixed drinks.… Expand"}, {"name": "Under Night In-Birth Exe:Late[cl-r]", "details_link": "https://www.metacritic.com/game/playstation-4/under-night-in-birth-exelatecl-r", "publisher": "Aksys Games", "release_date": "Feb 20 2020", "developers": ["French-Bread"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/899d11af2de5e51f8f1b396d021ecb52-98.jpg", "descriptions": "Cold friends & New under night In-Birth exe: late[cl-r] introduces a brand new character-icyy Fighter londrekia and his frosty new set of moves. Balancing act the new game features new moves and balance adjustments to every character-totalingg roughly 1, 000 improvements."}, {"name": "Sine Mora EX", "details_link": "https://www.metacritic.com/game/xbox-one/sine-mora-ex", "publisher": "Nordic Games Publishing", "release_date": "Aug  8 2017", "developers": ["Digital Reality"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/4a7449292b6e21e34e5b4ec3e4547603-98.jpg", "descriptions": "Sine Mora is a side-scrolling shoot ’em up that provides a unique challenge, where time is the ultimate factor. Mixing classic shooter sensibilities with contemporary presentation, Sine Mora is a gorgeous shooter offering both a Story Mode that weaves an over-the-top tale and an Arcade ModeSine Mora is a side-scrolling shoot ’em up that provides a unique challenge, where time is the ultimate factor. Mixing classic shooter sensibilities with contemporary presentation, Sine Mora is a gorgeous shooter offering both a Story Mode that weaves an over-the-top tale and an Arcade Mode that provides deep, satisfying gameplay to challenge fans of the genre.… Expand"}, {"name": "Flinthook", "details_link": "https://www.metacritic.com/game/pc/flinthook", "publisher": "Tribute Games", "release_date": "Apr 18 2017", "developers": ["Tribute Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/fb548c9906dc7f761c421b8e407c3689-98.jpg", "descriptions": "Live the life of space captain Flinthook! Armed with your mighty hookshot, your uncanny slow-motion powers and your trusty blasma pistol, plunder and fight your way through an infinite variety of randomly-assembled spaceships for treasure, loot and fame!"}, {"name": "LEGO Star Wars: The Complete Saga", "details_link": "https://www.metacritic.com/game/wii/lego-star-wars-the-complete-saga", "publisher": "LucasArts", "release_date": "Nov  6 2007", "developers": ["Traveller's Tales"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "General", "Compilation"], "meta_score": 80, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/6/daec2725e74c5993175961d3510922fe-98.jpg", "descriptions": "From the Trade Federation's \"negotiations\" with Obi-Wan Kenobi and Qui-Gon Jinn in The Phantom Menace to the space battle above Endor in Return of the Jedi, The Complete Saga allows players to kick some brick through 36 Story Mode levels, including Episode II's newly added high-speed pursuitFrom the Trade Federation's \"negotiations\" with Obi-Wan Kenobi and Qui-Gon Jinn in The Phantom Menace to the space battle above Endor in Return of the Jedi, The Complete Saga allows players to kick some brick through 36 Story Mode levels, including Episode II's newly added high-speed pursuit of bounty hunter Zam Wessell. Traveller’s Tales has revamped levels from the original LEGO Star Wars to match the gameplay evolutions found in LEGO Star Wars II, and Prequel Trilogy characters can now be mixed and matched with those from the Original Trilogy – more than 160 in all. [LucasArts]… Expand"}, {"name": "Tom Clancy's Splinter Cell: Double Agent", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-splinter-cell-double-agent", "publisher": "Ubisoft", "release_date": "Nov  7 2006", "developers": ["Ubisoft Shanghai"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 80, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/31f46143559a35486944006d58c2fcf7-98.jpg", "descriptions": "Veteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life asVeteran agent Sam Fisher is back. But he's never faced an enemy like this before. To stop a devastating terrorist attack, he must infiltrate a vicious terrorist group and destroy it from within. For the first time ever, experience the relentless tension and gut-wrenching dilemmas of life as a double agent. As you infiltrate a terrorist organization in its American headquarters, you must carefully weigh the consequences of your actions. Kill too many criminals and you'll blow your cover. Hesitate too long and millions will die. Do whatever it takes to complete your mission, but get out alive. Dual objectives to fulfill: NSA government agents and terrorists will each want you to accomplish opposing tasks at the same time. Discover the tension of being a double agent: Use actual tactics employed by today’s real-life double agents to sabotage the terrorists' plans. Explore a branching storyline with multiple endings: Your choices have an impact on how the story and game play unfolds. Missions from all over the world, from Asia to Africa to the heart of the US. Experience extreme situations: underwater or in a sandstorm, hiding behind the dust or smoke – and even skydiving. Master the latest weapons and gadgets used by NSA government agents in addition to black-market terrorist weapons. [Ubisoft]… Expand"}, {"name": "Blood & Truth", "details_link": "https://www.metacritic.com/game/playstation-4/blood-truth", "publisher": "Sony Interactive Entertainment", "release_date": "May 28 2019", "developers": ["SCEE London Studio"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/4f041228d69f1a248cedb6b77e304c97-98.jpg", "descriptions": "Blood & Truth takes place in modern day London against the city's backdrop of glamour and grit, making it the perfect location for a criminal underworld to inhabit. The capabilities of PS VR puts you into the shoes of an action hero in a way you won't have experienced before. From the momentBlood & Truth takes place in modern day London against the city's backdrop of glamour and grit, making it the perfect location for a criminal underworld to inhabit. The capabilities of PS VR puts you into the shoes of an action hero in a way you won't have experienced before. From the moment you slip on the headset, you become Ryan Marks, an elite Special Forces soldier who is on a dangerous mission to save his family from a ruthless criminal overlord. Playing as Ryan, you will come face to face with enemies, uncover secrets and experience the thrill of the chase.… Expand"}, {"name": "Medal of Honor: Pacific Assault", "details_link": "https://www.metacritic.com/game/pc/medal-of-honor-pacific-assault", "publisher": "EA Games", "release_date": "Nov  4 2004", "developers": ["EA LA"], "platforms": "PC", "num_players": "32  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/a4d0a714a6df025b0c49c3a816b27aef-98.jpg", "descriptions": "Medal of Honor Pacific Assault gives players a sense of the courage it took to fight the Imperial Japanese Army from the shock of Pearl Harbor to triumph on the shores of the Tarawa Atoll. Set in the Pacific Theatre of Operations from 1941-1944, players will assume the role of Marine recruitMedal of Honor Pacific Assault gives players a sense of the courage it took to fight the Imperial Japanese Army from the shock of Pearl Harbor to triumph on the shores of the Tarawa Atoll. Set in the Pacific Theatre of Operations from 1941-1944, players will assume the role of Marine recruit Tom Conlin as he survives the attack on Pearl Harbor, leads the assault on Guadalcanal, and finally charges up the beaches for the climatic battle at Tarawa. Armed with their wits and a variety of authentic weapons, it's up to players to stop the Japanese war machine in its tracks. Medal of Honor Pacific Assault follows the tradition of previous Medal of Honor products with a brand new arsenal of weapons, new enemies, and new storyline. In addition, Pacific Assault features new multiplayer modes in which up to 32 players can choose soldiers from American, British, Japanese, and other armies. [Electronic Arts]… Expand"}, {"name": "Going Under", "details_link": "https://www.metacritic.com/game/playstation-4/going-under", "publisher": "Team17", "release_date": "Sep 24 2020", "developers": ["AggroCrab"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/d615e0ccbf3747dec93d5ae172e278a5-98.jpg", "descriptions": "Going Under is a roguelite-inspired dungeon crawler about exploring the cursed ruins of failed tech startups. You’ll wield office junk as weapons as you battle your way through the forsaken office complexes. Stab a demon with a thumbtack one moment, run over a goblin with a smart car theGoing Under is a roguelite-inspired dungeon crawler about exploring the cursed ruins of failed tech startups. You’ll wield office junk as weapons as you battle your way through the forsaken office complexes. Stab a demon with a thumbtack one moment, run over a goblin with a smart car the next–your options in combat are constantly changing. … Expand"}, {"name": "N++", "details_link": "https://www.metacritic.com/game/switch/n++", "publisher": "Metanet Software Inc.", "release_date": "May 24 2018", "developers": ["Metanet Software Inc."], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/0bab3279431d91ec96e5928ccf8931f8-98.jpg", "descriptions": null}, {"name": "Guns, Gore & Cannoli 2", "details_link": "https://www.metacritic.com/game/pc/guns-gore-cannoli-2", "publisher": "Crazy Monkey Studios", "release_date": "Mar  2 2018", "developers": ["Crazy Monkey Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/b332f4204d2341814e16a74b15a6aba0-98.jpg", "descriptions": "Guns, Gore & Cannoli 2 revives the good, old, action platform run & gun genre, but this time with a bunch of humor and buckets of blown off body parts. In this sequel to Guns, Gore & Cannoli, Vinnie Cannoli’s story continues and this time it’s personal."}, {"name": "Battle Brothers", "details_link": "https://www.metacritic.com/game/pc/battle-brothers", "publisher": "Overhype Studios", "release_date": "Mar 24 2017", "developers": ["Overhype Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/ccf8815e70ad89bd9ad11b1c67b507a2-98.jpg", "descriptions": "Battle Brothers is a turn based strategy RPG mix which has you leading a mercenary company in a gritty, low-power, medieval fantasy world."}, {"name": "BoxBoxBoy!", "details_link": "https://www.metacritic.com/game/3ds/boxboxboy!", "publisher": "Nintendo", "release_date": "Jun 30 2016", "developers": ["HAL Labs"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/92d7a90d1224364dab72b58726848b54-98.jpg", "descriptions": "Our boxy hero, Qbby, has a brand-new power that lets him duplicate his blocky bod into TWO sets of boxes. He'll put every box to use to survive perilous traps across 11+ worlds of puzzling levels. Learn new tricks and box formations to get past obstacles, like switches, spikes, and evenOur boxy hero, Qbby, has a brand-new power that lets him duplicate his blocky bod into TWO sets of boxes. He'll put every box to use to survive perilous traps across 11+ worlds of puzzling levels. Learn new tricks and box formations to get past obstacles, like switches, spikes, and even lazers. [Nintendo]… Expand"}, {"name": "Space Invaders Extreme", "details_link": "https://www.metacritic.com/game/xbox-360/space-invaders-extreme", "publisher": "Taito Corporation", "release_date": "May  6 2009", "developers": ["Backbone Entertainment"], "platforms": ["PC", "Xbox 360"], "num_players": "4  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Vertical"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/20907655bc2adf7ba06270f473c70023-98.jpg", "descriptions": "[Xbox Live Arcade]  Space Invaders Extreme is a total reinvention of the classic Space Invaders, offering a true high-definition experience with upbeat electronic tracks, and dazzling new graphics and gameplay. Multiplayer features are now expanded with four-player versus and co-op[Xbox Live Arcade]  Space Invaders Extreme is a total reinvention of the classic Space Invaders, offering a true high-definition experience with upbeat electronic tracks, and dazzling new graphics and gameplay. Multiplayer features are now expanded with four-player versus and co-op multiplayer modes for even more Xbox LIVE fun. There's something here for fans and new players alike. Space Invaders Extreme stays true to the simple, yet highly addictive core gameplay of the classic Space Invaders arcade game and its 2-D aesthetics, while introducing innovative new features, faster gameplay, and new modes for an even more fun and intense game. [Taito]… Expand"}, {"name": "Trine 4: The Nightmare Prince", "details_link": "https://www.metacritic.com/game/xbox-one/trine-4-the-nightmare-prince", "publisher": "Maximum Games", "release_date": "Oct  8 2019", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/cd4f49ddc3b723af9ce51d090dd293ba-98.jpg", "descriptions": "TheTrine series returns to the magic of 2.5D! Join three iconic heroes as they set off on a quest through fantastical fairytale landscapes to save the world from the Nightmare Prince’s shadows."}]