[{"name": "Destiny 2", "details_link": "https://www.metacritic.com/game/playstation-4/destiny-2", "publisher": "Activision", "release_date": "Sep  6 2017", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 85, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/e846d8387ce7ada5466c9d972a619414-98.jpg", "descriptions": "In Destiny 2, the last safe city on Earth has fallen and lays in ruins, occupied by a powerful new enemy and his elite army, the Red Legion. Every player creates his own character called a “Guardian,” humanity’s chosen protectors.  As a Guardian in Destiny 2, players must master newIn Destiny 2, the last safe city on Earth has fallen and lays in ruins, occupied by a powerful new enemy and his elite army, the Red Legion. Every player creates his own character called a “Guardian,” humanity’s chosen protectors.  As a Guardian in Destiny 2, players must master new abilities and weapons to reunite the city’s forces, stand together and fight back to reclaim their home. In Destiny 2 players embark on a fresh story filled with new destinations around our solar system to explore, and an expansive amount of activities to discover.  There is something for almost every type of gamer in Destiny 2, including gameplay for solo, cooperative and competitive players set within a vast, evolving and exciting universe. [Bungie]… Expand"}, {"name": "AMID EVIL", "details_link": "https://www.metacritic.com/game/pc/amid-evil", "publisher": "New Blood Interactive", "release_date": "Jun 20 2019", "developers": ["Indefatigable"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 85, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/bdd8a118b4a02201b2e50c5bee8565ed-98.jpg", "descriptions": "A retro FPS for the ages! Once branded a HERETIC. Now YOU have been chosen as our champion! Reclaim our sacred weapons. Take back our ancient lands. If you can stand... AMID EVIL."}, {"name": "Mario Kart 7", "details_link": "https://www.metacritic.com/game/3ds/mario-kart-7", "publisher": "Nintendo", "release_date": "Dec  4 2011", "developers": ["Retro Studios", "Entertainment Analysis & Development Division"], "platforms": "3DS", "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Kart", "Automobile"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/663dfff581b7464f5870dbd2f59ea144-98.jpg", "descriptions": "The latest installment of the Mario Kart franchise brings Mushroom Kingdom racing fun into 3D. For the first time, drivers explore new competitive kart possibilities such as soaring through the skies or plunging to the depths of the sea. New courses, strategic new abilities and customizableThe latest installment of the Mario Kart franchise brings Mushroom Kingdom racing fun into 3D. For the first time, drivers explore new competitive kart possibilities such as soaring through the skies or plunging to the depths of the sea. New courses, strategic new abilities and customizable karts bring the racing excitement to new levels. … Expand"}, {"name": "Prince of Persia: The Two Thrones", "details_link": "https://www.metacritic.com/game/xbox/prince-of-persia-the-two-thrones", "publisher": "Ubisoft", "release_date": "Dec  1 2005", "developers": ["Ubisoft"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/f731329596784c76851cca21737033dd-98.jpg", "descriptions": "The Prince of Persia returns to his kingdom to find it decimated by war and turned against him in Prince of Persia: The Two Thrones. You can play as the time-bending prince or his evil alter-ego as he tries to return to the throne that is rightfully his. Now there are two distinctThe Prince of Persia returns to his kingdom to find it decimated by war and turned against him in Prince of Persia: The Two Thrones. You can play as the time-bending prince or his evil alter-ego as he tries to return to the throne that is rightfully his. Now there are two distinct characters, each with their own abilities and backgrounds, as you explore the urban setting of Babylon. Prince of Persia: The Two Thrones adds new Sands of Time abilities and an all-new setting for the third chapter in the Prince of Persia story.… Expand"}, {"name": "Halo: The Master Chief Collection", "details_link": "https://www.metacritic.com/game/xbox-one/halo-the-master-chief-collection", "publisher": "Microsoft Game Studios", "release_date": "Nov 11 2014", "developers": ["343 Industries"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Miscellaneous", "Compilation", "Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/6eb1ac42c31447859845d764d97cf3f7-98.jpg", "descriptions": "The Master Chief's complete story available one console. Features a re-mastered Halo 2: Anniversary, along with Halo: Combat Evolved Anniversary, Halo 3, and Halo 4, new digital series, Halo: Nightfall, and access to the Halo 5: Guardians Beta."}, {"name": "Batman: The Enemy Within - Episode 5: Same Stitch", "details_link": "https://www.metacritic.com/game/pc/batman-the-enemy-within---episode-5-same-stitch", "publisher": "Telltale Games", "release_date": "Mar 26 2018", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/595c1ec048000b02058d4176ccd7c2ea-98.jpg", "descriptions": "Same Stitch is the fifth and final episode of Batman: The Enemy Within. The episode will follow Batman as he confronts either Amanda Waller and the Agency or a menace he has helped create."}, {"name": "NCAA Football 11", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-football-11", "publisher": "Electronic Arts", "release_date": "Jul 13 2010", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/6e4a2767370f4fe7ef2d227329eff967-98.jpg", "descriptions": "With presentation and gameplay improvements, along with an online-based feature, NCAA Football 11 promises to give players real college offenses that, for the first time , reflect the authentic style of all 120 NCAA FBS schools in-game.  With team-specific pre-game run-outs and ESPN’sWith presentation and gameplay improvements, along with an online-based feature, NCAA Football 11 promises to give players real college offenses that, for the first time , reflect the authentic style of all 120 NCAA FBS schools in-game.  With team-specific pre-game run-outs and ESPN’s broadcast graphics package, NCAA Football 11 attempts to recreate the intensity of college football Saturdays, hoping to achieve all-new levels of quality in presentation and core gameplay by delivering an experience true to your school and providing 120 ways to win. NCAA Football also includes the new Dynasty Wire online feature.  With Dynasty Wire, players create stories that recap their Dynasty game, complete with video and photo highlights, then share the news of the victorious triumph or devastating loss by publishing the story through social networking sites for the world to read. [Electronic Arts]… Expand"}, {"name": "MVP Baseball 2005", "details_link": "https://www.metacritic.com/game/pc/mvp-baseball-2005", "publisher": "EA Sports", "release_date": "Feb 22 2005", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/bdd1b3f23cf8e0042bc3ad46b16eaa5f-98.jpg", "descriptions": "Key features for MVP Baseball 2005 include the following: Own the Plate: Change your position in the box to adjust to where the pitcher is working you, or keep the defense honest with a bunt for a hit. Precision Pitching: Paint the corners or send a message with the new Precision PitchKey features for MVP Baseball 2005 include the following: Own the Plate: Change your position in the box to adjust to where the pitcher is working you, or keep the defense honest with a bunt for a hit. Precision Pitching: Paint the corners or send a message with the new Precision Pitch Meter, or catch runners napping with unparalleled pickoff control. Enhanced Big Play Control: Make an underhand toss to the pitcher as he sprints to cover first, slide around a tag at home, and make user-controlled stretches and dives. While leading off base, exercise your reflexes by beating pickoff throws with the all-new manual leadoff control. Control every aspect of your organization in all-new Owner Mode. Create your line-up based on player progression during Spring Training, or help build player attributes by competing in a variety of mini-games. All-New Create Ballpark: In Owner Mode, build a pitcher’s paradise or a hitter’s dream. Will you spend your earnings to upgrade your ballpark or to sign that key free agent who could bring you a championship? Expanded Minor Leagues: Advanced Single A squads and additional stadiums have been added to round out the list of teams available in the minor league system. [Electronic Arts]… Expand"}, {"name": "Phantasy Star Online Episode I & II", "details_link": "https://www.metacritic.com/game/gamecube/phantasy-star-online-episode-i-ii", "publisher": "Sega", "release_date": "Oct 29 2002", "developers": ["Sonic Team"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Role-Playing", "Massively Multiplayer Online", "Sci-Fi"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/1/e2572303fa171aacffed1025c7200522-98.jpg", "descriptions": "The Phantasy Star adventure that began on the PC now comes to your GameCube with new gaming modes and new content. Phantasy Star Online I & II features new character classes, weapons, enemies, items, and quests. A new split-screen feature allows three of your friends to join you on yourThe Phantasy Star adventure that began on the PC now comes to your GameCube with new gaming modes and new content. Phantasy Star Online I & II features new character classes, weapons, enemies, items, and quests. A new split-screen feature allows three of your friends to join you on your adventure, as well as in other game modes, on the same console. Episode I includes all of the content from the original PSO and PSO Version 2, while Episode II brings a new, full-length adventure.… Expand"}, {"name": "Doki Doki Literature Club Plus!", "details_link": "https://www.metacritic.com/game/switch/doki-doki-literature-club-plus!", "publisher": "Serenity Forge", "release_date": "Jun 30 2021", "developers": ["Team Salvato"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/3a03de04279a481ad70520813a9c98a0-98.jpg", "descriptions": "Welcome to the club! Write poems for your crush and experience the terror of school romance in this critically-acclaimed psychological horror story.\r Enter the #1 Psychological Horror Experience!\r\n\r\nWelcome to a terrifying world of poetry and romance! Write poems for your crush and eraseWelcome to the club! Write poems for your crush and experience the terror of school romance in this critically-acclaimed psychological horror story.\r Enter the #1 Psychological Horror Experience!\r Welcome to a terrifying world of poetry and romance! Write poems for your crush and erase any mistakes along the way to ensure your perfect ending. Now’s your chance to discover why DDLC is one of the most beloved psychological horror games of the decade!\r You play as the main character, who reluctantly joins the Literature Club in search of a romantic interest. With every poem you write and every choice you make, you’ll charm your crush and begin to unfold the horrors of school romance. Do you have what it takes to crack the code of dating sims and get the perfect ending?\r Now, the original mind-shattering DDLC experience is packed with tons of new features and content exclusive to Doki Doki Literature Club Plus!… Expand"}, {"name": "The Forgotten City", "details_link": "https://www.metacritic.com/game/playstation-5/the-forgotten-city", "publisher": "Maximum Games", "release_date": "Jul 28 2021", "developers": ["Modern Storyteller"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/1901ba0565b776a295deade52494227e-98.jpg", "descriptions": "The Forgotten City is a mature narrative-driven game, and a re-imagining of the critically acclaimed mod that won a national Writers’ Guild award and racked up over 3 million downloads. Trapped in a secret underground city during the Roman Empire, twenty-three lost souls cling to life. InThe Forgotten City is a mature narrative-driven game, and a re-imagining of the critically acclaimed mod that won a national Writers’ Guild award and racked up over 3 million downloads. Trapped in a secret underground city during the Roman Empire, twenty-three lost souls cling to life. In this precarious utopia, if one person breaks the mysterious Golden Rule, everyone dies. As a time-traveler drawn two thousand years into the past, you’ll relive their final moments in an endless loop, exploring and interrogating, and changing the course of the day with each secret you uncover. Only by cleverly exploiting the time loop and making difficult moral choices can you hope to solve this epic mystery. Here, your decisions matter. The fate of the city is in your hands.… Expand"}, {"name": "Assault Android Cactus", "details_link": "https://www.metacritic.com/game/playstation-4/assault-android-cactus", "publisher": "Witch Beam", "release_date": "Mar  8 2016", "developers": ["Witch Beam"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["General", "Scrolling", "Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/f489f72fc7fc8501a4a254158e81c626-98.jpg", "descriptions": "Assault Android Cactus is an intense arcade style twin stick shooter - pick from one of nine unique synthetic heroines and blast your way through overwhelming robots hordes to save the ship from its own workforce. Supports single player and local co-op game modes."}, {"name": "Persona 4 Arena Ultimax", "details_link": "https://www.metacritic.com/game/xbox-360/persona-4-arena-ultimax", "publisher": "Atlus", "release_date": "Sep 30 2014", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Xbox 360"], "genres": ["Action", "Fighting", "2D"], "meta_score": 85, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/3c18d53f24b244b279f5e28672be70f5-98.jpg", "descriptions": "In P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the wholeIn P4AU, the characters from Persona 4 and Persona 3 once again find themselves teaming up to face off in the P-1 Climax, a series of battles which must be won before the world ends. The original cast of characters from Persona 3 and 4 are back to discover the mastermind behind the whole tournament, while a few new faces join the fight, including Junpei Iori, Yukari Takeba, Rise Kujikawa, and more. But standing in their way is the dual katana-wielding Sho Minazuki, a huge threat to everyone involved in the P-1 Climax. Worse yet, there's a Sho lookalike who can wield a Persona...… Expand"}, {"name": "Darksiders II", "details_link": "https://www.metacritic.com/game/wii-u/darksiders-ii", "publisher": "THQ", "release_date": "Nov 18 2012", "developers": ["Vigil Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action Adventure", "Fantasy", "Fantasy", "Open-World"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/e88a915a70c588d685da22bc8121443a-98.jpg", "descriptions": "Darksiders II follows the exploits of DEATH, one of the 4 horsemen of the Apocalypse, in a weaving tale that runs parallel to the events in the original Darksiders game. This epic journey propels DEATH through various light and dark realms as he tries to redeem his brother WAR, the horsemanDarksiders II follows the exploits of DEATH, one of the 4 horsemen of the Apocalypse, in a weaving tale that runs parallel to the events in the original Darksiders game. This epic journey propels DEATH through various light and dark realms as he tries to redeem his brother WAR, the horseman who was blamed for prematurely starting the Apocalypse in Darksiders.… Expand"}, {"name": "Guitar Hero: Metallica", "details_link": "https://www.metacritic.com/game/wii/guitar-hero-metallica", "publisher": "Activision", "release_date": "Mar 29 2009", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/2a2f7740a686969f4d3042f6c77e4c7e-98.jpg", "descriptions": "Guitar Hero: Metallica takes music fans through the band’s fabled library of songs, plus the music and musicians who influence them. When the house lights go down, virtual rock stars across the globe will shred, drum and wail to an explosive set list featuring over 45 tracks from Metallica’sGuitar Hero: Metallica takes music fans through the band’s fabled library of songs, plus the music and musicians who influence them. When the house lights go down, virtual rock stars across the globe will shred, drum and wail to an explosive set list featuring over 45 tracks from Metallica’s illustrious career and a wide variety of other legendary artists personally selected by the band, such as Queen, Foo Fighters, Bob Seger, Lynyrd Skynyrd, Slayer and Judas Priest. Featuring tracks from every Metallica studio album, the complete Guitar Hero Metallica on-disc set list includes their following hits: All Nightmare Long, Battery, Creeping Death, Disposable Heroes, Dyers Eve, Enter Sandman, Fade To Black, Fight Fire With Fire, For Whom The Bell Tolls, Frantic, Fuel, Hit The Lights, King Nothing, Master of Puppets, Mercyful Fate, No Leaf Clover, Nothing Else Matters, One, Orion, Sad But True, Seek And Destroy, The Memory Remains, The Shortest Straw, The Thing That Should Not Be, The Unforgiven, Welcome Home (Sanitarium), Wherever I May Roam, and Whiplash. Complementing Metallica’s intensity are 21 rockin’ tracks personally chosen by the band, including \"War Ensemble\" by Slayer. [Activision]… Expand"}, {"name": "Pikmin 3 Deluxe", "details_link": "https://www.metacritic.com/game/switch/pikmin-3-deluxe", "publisher": "Nintendo", "release_date": "Oct 30 2020", "developers": ["Eighting", "Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/e506eb03b69f963ea94425e58933feb4-98.jpg", "descriptions": "No mission is too big for the tiny Pikmin. Touch down on a world of rich adventure with Pikmin 3 Deluxe for Nintendo Switch. Command a capable crop of tiny creatures and explore a hostile planet in this exciting blend of action and strategy. Use each Pikmin type's unique skills to overcomeNo mission is too big for the tiny Pikmin. Touch down on a world of rich adventure with Pikmin 3 Deluxe for Nintendo Switch. Command a capable crop of tiny creatures and explore a hostile planet in this exciting blend of action and strategy. Use each Pikmin type's unique skills to overcome obstacles and open up a diverse world around you. Seek out valuable items, solve puzzles and overcome powerful creatures in a richly detailed world full of surprises. What's new? Whether you've played Pikmin 3 on Wii U or it's your first venture on planet \"PNF-404\", Pikmin 3 Deluxe comes packed with exciting new modes and features:\r * 2P co-op: Journey through the main story in two player co-op* on the same console!\r* New adventures: Go it alone or team up with a friend to take on brand new prologue and epilogue stories starring Pikmin and Pikmin 2 heroes Olimar and Louie!\r* Quality of life improvements: Expand your exploration with an enhanced lock-on targeting system, enemy balancing changes, multiple difficulty modes, optional hints and more.\r* Piklopedia: Unlock profile entries for each character and find out their unique perspectives on each creature you discover. \r\rSquad up!\rIf you need a break from your plucky adventure, more fun awaits with returning additional modes. Get competitive with another player in Bingo Battle, or complete unique challenges alone or cooperatively in Mission Mode which includes all DLC from the Wii U version!… Expand"}, {"name": "Fire Emblem: Path of Radiance", "details_link": "https://www.metacritic.com/game/gamecube/fire-emblem-path-of-radiance", "publisher": "Nintendo", "release_date": "Oct 17 2005", "developers": ["Intelligent Systems"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 85, "users_score": 9.1, "image": "https://static.metacritic.com/images/products/games/8/728876610cf0ddb171d8809c0f19fd56-98.jpg", "descriptions": "Fire Emblem: Path of Radiance brings back to consoles the strategic combat series Fire Emblem from the Game Boy Advance. In this installment, you can control units such as knights, mages, and winged creatures, and use their unique fighting styles to win battles and gain experience. FireFire Emblem: Path of Radiance brings back to consoles the strategic combat series Fire Emblem from the Game Boy Advance. In this installment, you can control units such as knights, mages, and winged creatures, and use their unique fighting styles to win battles and gain experience. Fire Emblem: Path of Radiance also includes a detailed story that connects the battles and characters together.… Expand"}, {"name": "Final Fantasy XI", "details_link": "https://www.metacritic.com/game/playstation-2/final-fantasy-xi", "publisher": "SCEA", "release_date": "Mar 23 2004", "developers": ["Square Enix"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Fantasy"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/513438a0d58ad19a8a6715f0320e04b1-98.jpg", "descriptions": "The world of Vana'diel stands at the brink of war. Three powerful nations, united in their plight against the beastmen forces, look to their last hope -- brave adventurers like you! Will the beastmen gain the upper hand, and thrust the once-peaceful Vana'diel into another war? Step into theThe world of Vana'diel stands at the brink of war. Three powerful nations, united in their plight against the beastmen forces, look to their last hope -- brave adventurers like you! Will the beastmen gain the upper hand, and thrust the once-peaceful Vana'diel into another war? Step into the world of Vana'diel and journey forth on grand adventures with players from all across the globe! Final Fantasy XI is the first online game in the award-winning FINAL FANTASY series. How you play is up to you, with limitless possibilities for adventure. Set out on your own to discover the countless secrets of Vana'diel, or form a party with your friends to purge the beastman forces and bring home sensational spoils! [Square Enix]… Expand"}, {"name": "Hitman 3", "details_link": "https://www.metacritic.com/game/playstation-4/hitman-3", "publisher": "Io Interactive", "release_date": "Jan 20 2021", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/d6f54403b68b0232608a8884304b6ec3-98.jpg", "descriptions": "Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.Death Awaits \r\rHITMAN 3 is the dramatic conclusion to the World of Assassination trilogy and takes players around the world on a globetrotting adventure to sprawling sandbox locations. Agent 47 returns as a ruthless professional for the most important contracts of his entire career.\r Supported by his Agency handler, Diana Burnwood, 47 joins forces with his long-lost friend Lucas Grey. Their ultimate mission is to eliminate the partners of Providence, but they are forced to adapt as their hunt intensifies. When the dust settles, 47 and the world he inhabits will never be the same again. \r\rTop of the World\rEvery mission location in HITMAN 3 is meticulously detailed and packed full of creative opportunities. Players will have unrivalled freedom to complete their objectives and the game world will react to everything they do. \r\rA Platform of Assassination\rThe World of Assassination trilogy is fully realised with HITMAN 3 as the ultimate place to play all three games. Players of previous HITMAN games will be pleased to know that it will be possible to 'import' locations that they own from the previous two HITMAN games into HITMAN 3, essentially putting all 20+ locations from the entire trilogy in one place.\r Playing the entire trilogy from beginning to end, from within HITMAN 3, also means that the progression systems in HITMAN 3 work across all locations. You can unlock an item in Dubai and take it with you to Paris, for example. HITMAN 2 players will have the option to carry over their hard-earned unlocks and progression into HITMAN 3.… Expand"}, {"name": "Full Metal Furies", "details_link": "https://www.metacritic.com/game/pc/full-metal-furies", "publisher": "Cellar Door Games", "release_date": "Jan 17 2018", "developers": ["Cellar Door Games"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/e73ef269d0b8cdbc092280e50a956100-98.jpg", "descriptions": "From the creators of Rogue Legacy comes a \"true-cooperative\" action RPG. FULL METAL FURIES puts an emphasis on team play with a unique combat system where everyone is important. Play on the couch, alone or with friends, or make it an online party for up to four players."}, {"name": "Super Mega Baseball", "details_link": "https://www.metacritic.com/game/playstation-4/super-mega-baseball", "publisher": "Metalhead Software", "release_date": "Dec 16 2014", "developers": ["Metalhead Software"], "platforms": ["PC", "PlayStation 3", "Xbox One", "PlayStation 4"], "genres": ["Traditional", "Sports", "Team", "Baseball", "Arcade"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/5c08575d8839f0d598f713b878d288e6-98.jpg", "descriptions": "Hammer Longballo and a friendly cast of semi-athletic baseball stars invite you to saddle up on the couch with friends for some relaxed solo or co-op play. Or some fierce, relationship-testing competition."}, {"name": "NASCAR Thunder 2004", "details_link": "https://www.metacritic.com/game/xbox/nascar-thunder-2004", "publisher": "EA Games", "release_date": "Sep 16 2003", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/6abf204218f8c8fd3cea3de34a0d50fc-98.jpg", "descriptions": "The green flag has dropped with NASCAR Thunder 2004.  From 200 MPH super-speedways to hairpin turns on 11 fantasy tracks, tuning your car and finding the line is no longer enough.  Now you're running to the edge against 42 other unique NASCAR personalities every race, drivers who rememberThe green flag has dropped with NASCAR Thunder 2004.  From 200 MPH super-speedways to hairpin turns on 11 fantasy tracks, tuning your car and finding the line is no longer enough.  Now you're running to the edge against 42 other unique NASCAR personalities every race, drivers who remember your every move and won't think twice about paying you back.  Out-smart and out-drive them as you battle three-wide from green to checkers.  Online or on your own, racing just became a contact sport.… Expand"}, {"name": "DDRMAX: Dance Dance Revolution", "details_link": "https://www.metacritic.com/game/playstation-2/ddrmax-dance-dance-revolution", "publisher": "Konami", "release_date": "Oct 28 2002", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Dancing"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/094e2e9d4da0bb761d1d9dd63b6994b3-98.jpg", "descriptions": "DDRMAX will have you working up a sweat to over 65 songs. The 100+ minutes of music include licensed tracks, fresh dance hits, and cool new songs exclusive to the North American release. DDRMAX delivers never-before-seen in-game videos, new gameplay options, blistering 60-frames per secondDDRMAX will have you working up a sweat to over 65 songs. The 100+ minutes of music include licensed tracks, fresh dance hits, and cool new songs exclusive to the North American release. DDRMAX delivers never-before-seen in-game videos, new gameplay options, blistering 60-frames per second frame rates and the largest song library in franchise history. Further enhancing the gameplay experience is the introduction of the FREEZE ARROW option that freezes on-screen arrows and forces you to modify your dance steps thus increasing complexity and adding a twist to the routine. Popular gameplay options that return in DDRMAX are the Edit Mode that enables you to customize your own dance steps, and the special Work Out mode that tracks the number of calories burned with every move.… Expand"}, {"name": "NASCAR Thunder 2002", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-thunder-2002", "publisher": "Electronic Arts", "release_date": "Oct 15 2001", "developers": ["EA Sports"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/9f6cfaf497081bb5b04ec5214d56a29f-98.jpg", "descriptions": "Includes over 50 drivers (Gordon, Earnhardt Jr., Jarrett, and unlockable NASCAR® Busch Series drivers) and all 23 tracks from the NASCAR Winston Cup® series and allows you to Create-A-Car and earn money and sponsors to build your own racing dynasty.  [EA Sports]"}, {"name": "NHL 2001", "details_link": "https://www.metacritic.com/game/playstation-2/nhl-2001", "publisher": "EA Sports", "release_date": "Oct 25 2000", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/653008f516410235d92e0e8d0cb5f2c6-98.jpg", "descriptions": "EA's first hockey game to grace a next-gen system features all 30 NHL teams (including the Wild & Blue Jackets) and emphasizes speed, with the \"big hit,\" \"deke\" and \"speed burst\" buttons making their return along with such precise adjustable factors as pass speed, shot accuracy, puckEA's first hockey game to grace a next-gen system features all 30 NHL teams (including the Wild & Blue Jackets) and emphasizes speed, with the \"big hit,\" \"deke\" and \"speed burst\" buttons making their return along with such precise adjustable factors as pass speed, shot accuracy, puck elasticity, and puck friction (?!?).… Expand"}, {"name": "F355 Challenge", "details_link": "https://www.metacritic.com/game/dreamcast/f355-challenge", "publisher": "Acclaim", "release_date": "Sep 19 2000", "developers": ["Sega"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/7d6ae90365c6fc4583a37bb8e5049eda-98.jpg", "descriptions": "F355 Challenge is the best driving game currently available on any console, let alone the Dreamcast, and once you crest the game's steep learning curve, the addictive need to constantly best other players' lap times will provide weeks of replayability."}, {"name": "The Elder Scrolls III: Bloodmoon", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-iii-bloodmoon", "publisher": "Bethesda Softworks", "release_date": "Jun  3 2003", "developers": ["Bethesda Softworks"], "platforms": "PC", "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/19748c1bc1a2a3e04c66c67fef5e78be-98.jpg", "descriptions": "Bloodmoon takes you to the frozen Island of Solstheim where the Empire is establishing a new mining colony - a venture being threatened by the prophecy of the Bloodmoon and rumors of werewolves. [Bethesda Softworks]"}, {"name": "Boom Blox", "details_link": "https://www.metacritic.com/game/wii/boom-blox", "publisher": "Electronic Arts", "release_date": "May  6 2008", "developers": ["EA LA"], "platforms": "Wii", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/62518eff5663965df91dc570c682aa4c-98.jpg", "descriptions": "Boom Blox is the first game developed in collaboration between EA and director and producer, Steven Spielberg. This high-energy game features over three hundred levels, a variety of activities, a cast of over thirty wacky characters, and an easy-to-use in-game editor that allows players toBoom Blox is the first game developed in collaboration between EA and director and producer, Steven Spielberg. This high-energy game features over three hundred levels, a variety of activities, a cast of over thirty wacky characters, and an easy-to-use in-game editor that allows players to express their creativity. Fun for kids and the entire family, Boom Blox offers action-packed interactive activities that takes Wii play to a new level of creativity and fun with single player, co-op, and versus gameplay. Players can explore the visceral gameplay—perfectly suited for the Wii’s interactivity—that keeps them destroying their way through brain-twisting challenges. They can interact with entertaining characters such as the Blox-laying chickens or the baseball throwing monkeys, who bring personality to the Tiki, Medieval, Frontier, and Haunted themed environments. Additionally, players can remix any level of the game in Create Mode using props, blocks, or characters that have been unlocked during the game. Players can also virtually build anything they can dream up. Plus, their designs can then be shared with friends or used to challenge others to solve their newly created puzzle via WiiConnect24. [Electronic Arts]… Expand"}, {"name": "Madden NFL 08", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-08", "publisher": "EA Sports", "release_date": "Aug 14 2007", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 85, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/43785bcf92f5bdcf8d9c4c47612f6574-98.jpg", "descriptions": "All-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. All-New Front Office Mode: Take full controlAll-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. All-New Front Office Mode: Take full control of every aspect of an NFL franchise. Construct a state-of-the-art stadium, set concession prices, hire your coaching staff, draft players, and manage the entire operation from the top down to build your dynasty. Your Ring of a Champion: Increase your Madden Gamer Level to help create and customize your own in-game championship ring. Madden Unmatched: All-new player moves, including auto-motion, backward passes and low-hitting tackles, plus ultra-smooth gameplay provide the most realistic NFL gaming experience ever. Control receivers and make spectacular catches or key possession receptions, or roam the secondary and jar the ball loose with big hits and ball-stripping tackles. [EA Sports]… Expand"}, {"name": "Pro Evolution Soccer 2016", "details_link": "https://www.metacritic.com/game/xbox-one/pro-evolution-soccer-2016", "publisher": "Konami", "release_date": "Sep 15 2015", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 85, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/9641648e288308b35b7626ab5b826ebc-98.jpg", "descriptions": "The upgraded feint moves allow for sudden directional changes that can cause defenders to lose their balance. But the developers have added a new system to the defenders arsenal. With Perfect Defence, players who time their tackles perfectly are able to powerfully shove their opponent out ofThe upgraded feint moves allow for sudden directional changes that can cause defenders to lose their balance. But the developers have added a new system to the defenders arsenal. With Perfect Defence, players who time their tackles perfectly are able to powerfully shove their opponent out of the way and instantly secure the ball, allowing to create direct turnarounds and counter opportunities.… Expand"}, {"name": "Far Cry 2", "details_link": "https://www.metacritic.com/game/playstation-3/far-cry-2", "publisher": "Ubisoft", "release_date": "Oct 21 2008", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 85, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/10ccf5f50b968bf2ab5915a4b3ec76c9-98.jpg", "descriptions": "Caught between two rival factions in war-torn Africa, you are sent to take out \"The Jackal,\" a mysterious character who has rekindled the conflict between the warlords, jeopardizing thousands of lives. In order to fulfil your mission you will have to play the factions against each other,Caught between two rival factions in war-torn Africa, you are sent to take out \"The Jackal,\" a mysterious character who has rekindled the conflict between the warlords, jeopardizing thousands of lives. In order to fulfil your mission you will have to play the factions against each other, identify and exploit your their weaknesses, and neutralize their superior numbers and firepower with surprise, subversion, cunning and, of course, brute force. Real-time story telling, systemic auto-healing, minimal in-game interface are just few of the features that make you feel the tension of being alone against barbarous warlords that threaten thousands of innocent lives. Choose from a wide range of weapons to make your way to your primary target. Meet the fight head-on with your machine-gun, go berserk with your machete or make stealth kills as a Sniper. If you feel that the atmosphere is not warm enough, light up your flamethrower and let your enemies and everything around them feel the heat. [Ubisoft]… Expand"}, {"name": "Rogue Legacy", "details_link": "https://www.metacritic.com/game/pc/rogue-legacy", "publisher": "Cellar Door Games", "release_date": "Jun 27 2013", "developers": ["Cellar Door Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/068a430495aed9b75bf368d57679b897-98.jpg", "descriptions": "Rogue Legacy is a rogue-\"lite\" game for PC, Mac and Linux. You'll die, but your children will avenge you. They might be genetically deficient, but that's ok. You still love your colour-blind baby. Or do you?"}, {"name": "BattleBlock Theater", "details_link": "https://www.metacritic.com/game/xbox-360/battleblock-theater", "publisher": "Microsoft Game Studios", "release_date": "Apr  3 2013", "developers": ["The Behemoth"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/87f3dce24483472f1dd5d89befb790aa-98.jpg", "descriptions": "Shipwrecked. Captured. Betrayed. Forced to perform for an audience of cats? You’ve only just unlocked the door to BattleBlock Theater! There is no turning back once you have embarked upon your quest to free your imprisoned friends from evil technological cats! Immerse yourself in thisShipwrecked. Captured. Betrayed. Forced to perform for an audience of cats? You’ve only just unlocked the door to BattleBlock Theater! There is no turning back once you have embarked upon your quest to free your imprisoned friends from evil technological cats! Immerse yourself in this mind-bending tale of treachery as you battle your way through hundreds of levels in to discover the puzzling truth behind BattleBlock Theater.… Expand"}, {"name": "Dragon Quest Builders 2", "details_link": "https://www.metacritic.com/game/switch/dragon-quest-builders-2", "publisher": "Square Enix", "release_date": "Jul 12 2019", "developers": ["Square Enix"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "General", "Action Adventure", "Sandbox"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/6117b26c6c658f30ae3363be7c3b937a-98.jpg", "descriptions": "To stop the worshippers of an ancient evil, you must join forces with the mysterious Malroth and build a ravaged world into the realm of your dreams. In this RPG adventure, you’ll explore huge islands, gather and craft with materials, design towns, level them up, and defend them fromTo stop the worshippers of an ancient evil, you must join forces with the mysterious Malroth and build a ravaged world into the realm of your dreams. In this RPG adventure, you’ll explore huge islands, gather and craft with materials, design towns, level them up, and defend them from monsters and bosses alongside townspeople. As you progress, you’ll unearth crafting and building recipes. Dash, glide, explore underwater, fast travel, and play in optional first-person perspective as you try to find them all. In the Isle of Awakening, you and up to three other Builders can explore together in local wireless*; or play online** together too.… Expand"}, {"name": "Castlevania: Lords of Shadow", "details_link": "https://www.metacritic.com/game/playstation-3/castlevania-lords-of-shadow", "publisher": "Konami", "release_date": "Oct  5 2010", "developers": ["Mercury Steam"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/14f23154b14fc5dfcdd28c456d916045-98.jpg", "descriptions": "Castlevania: Lords of Shadow takes place at the end of days. The Earth's alliance with the Heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow - darkness reins the world.  Across this shattered land, the souls of the dead wander unable to find peace,Castlevania: Lords of Shadow takes place at the end of days. The Earth's alliance with the Heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow - darkness reins the world.  Across this shattered land, the souls of the dead wander unable to find peace, whilst creatures of evil roam free wreaking chaos and death upon the living.  Gabriel is a member of the Brotherhood of Light, an elite group of holy knights who protect and defend the innocent against the supernatural. His beloved wife was brutally murdered by the evil forces of darkness and her soul trapped for eternity. Neither living nor dead she realizes the horrific truth of what is at stake and guides Gabriel to his destiny - and hopefully salvation for the world... but at what cost? Thus, Gabriel must travel the destroyed world, defeating the evil tyrants in order to use their powers to bring balance back to the world. Armed with the versatile Combat Cross - the world's last hope must encounter the three factions of the Lords of Shadow and end their unholy rule. Mercury Steam has created a rich, open game world that traverses snowy mountain ranges, Gothic castles, and undead-strewn wastelands in a devastated Southern Europe during the Middle Ages. [Konami]… Expand"}, {"name": "Pokemon Diamond Version", "details_link": "https://www.metacritic.com/game/ds/pokemon-diamond-version", "publisher": "Nintendo", "release_date": "Apr 22 2007", "developers": ["Game Freak"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/4556b6ee2bc5688317e305d0461d5088-98.jpg", "descriptions": "Pokemon Diamond and Pearl are traditional Pokemon RPGs that takes place in a region called Sinnoh. When you set off on your travels, you'll be able to play as either a boy or girl Trainer. Pokemon fans have caught glimpses of Lucario, Munchlax and Weavile in Pokemon movies, and these PokemonPokemon Diamond and Pearl are traditional Pokemon RPGs that takes place in a region called Sinnoh. When you set off on your travels, you'll be able to play as either a boy or girl Trainer. Pokemon fans have caught glimpses of Lucario, Munchlax and Weavile in Pokemon movies, and these Pokemon will are debuting in this adventure. Diamond and Pearl utilize the DS's dual slots to transfer Pokemon from the GBA Pokemon games. Also, you can link up with Pokemon Ranger to access more special content. [Nintendo]… Expand"}, {"name": "Virtua Fighter 5", "details_link": "https://www.metacritic.com/game/playstation-3/virtua-fighter-5", "publisher": "Sega", "release_date": "Feb 20 2007", "developers": ["Sega AM2"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/fba561c330c6911172be9cbb3c043c9b-98.jpg", "descriptions": "Virtua Fighter 5 features an all-star cast of 17 fighters, including characters from the previous iterations along with two new characters named El Blaze and Eileen. El Blaze is a Mexican fighting champion who defeats opponents with his quick Lucha Libre fighting style. Eileen, originallyVirtua Fighter 5 features an all-star cast of 17 fighters, including characters from the previous iterations along with two new characters named El Blaze and Eileen. El Blaze is a Mexican fighting champion who defeats opponents with his quick Lucha Libre fighting style. Eileen, originally from China, uses a Monkey Kung-Fu fighting style that she learned from her grandfather, a former Kung-Fu master. Players are able to customize their characters by selecting from four uniquely patterned costumes and a wide range of attachable items that can be placed onto each fighter’s various body parts. Virtua Fighter 5 delivers fast-paced, adrenaline-pumping action as players head into battle, taking on a host of popular characters. Players not only achieve victory by defeating highly-skilled opponents, but also by competing for prizes which earn them in-game money allowing them to buy many items at in-game shop. These items allow players to customize their ultimate warrior and become the top Virtua Fighter. In addition, the game introduces \"Offensive Move\", a new maneuver that allows players to easily approach opponents from the side, adding a more strategic element to the battle. The game supports 720p HD resolution. [Sega]… Expand"}, {"name": "Ikaruga", "details_link": "https://www.metacritic.com/game/gamecube/ikaruga", "publisher": "Atari", "release_date": "Apr 15 2003", "developers": ["Treasure"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/8/024078684bf213d1f635d97a8b8a9651-98.jpg", "descriptions": "Battle fiercely, move swiftly, and act cleverly in a space crusade of intense firepower and hypnotic beauty.  Take control of the ship Ikaruga--alter your energy field, evade epic maelstroms of fire, and terminate enemies with a devastating arsenal--all to protect an aging, exiled people.Battle fiercely, move swiftly, and act cleverly in a space crusade of intense firepower and hypnotic beauty.  Take control of the ship Ikaruga--alter your energy field, evade epic maelstroms of fire, and terminate enemies with a devastating arsenal--all to protect an aging, exiled people.  Battle the evil Horai by yourself or with a friend.  This combination of manga-style storytelling and exciting arcade heroics challenges you to find the calm amid the chaos.… Expand"}, {"name": "Yakuza Kiwami 2", "details_link": "https://www.metacritic.com/game/playstation-4/yakuza-kiwami-2", "publisher": "Sega", "release_date": "Aug 28 2018", "developers": ["Sega", "Ryu ga Gotoku Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/079ea2b98f823109252776610872a60a-98.jpg", "descriptions": "Kazuma Kiryu thought his Tojo Clan days were behind him. He and his young ward, Haruka Sawamura, have built a peaceful life from the ashes of conflict. All it took was a single gunshot to shatter that peace. Yukio Terada, the fifth chairman of the Tojo Clan, has been assassinated. With warKazuma Kiryu thought his Tojo Clan days were behind him. He and his young ward, Haruka Sawamura, have built a peaceful life from the ashes of conflict. All it took was a single gunshot to shatter that peace. Yukio Terada, the fifth chairman of the Tojo Clan, has been assassinated. With war on the horizon, the legendary Dragon of Dojima is pulled back into the world he wanted to leave behind. … Expand"}, {"name": "Thief: Deadly Shadows", "details_link": "https://www.metacritic.com/game/pc/thief-deadly-shadows", "publisher": "Eidos Interactive", "release_date": "May 25 2004", "developers": ["Ion Storm"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/9d5cbaf7e19be65df156d33efddd3932-98.jpg", "descriptions": "In Thief: Deadly Shadows, gamers once again take on the role of Garrett, a master thief. Garrett is rarely seen, never caught and capable of breaking into the most ingeniously secured places. Garrett steals from the wealthy and gives to himself, making his living in the dark and forebodingIn Thief: Deadly Shadows, gamers once again take on the role of Garrett, a master thief. Garrett is rarely seen, never caught and capable of breaking into the most ingeniously secured places. Garrett steals from the wealthy and gives to himself, making his living in the dark and foreboding City. Preferring to be left alone to ply his trade, prophecies of an impending Dark Age dictate a different plan for the thief. In Garrett?s efforts to prevent this approaching Dark Age, he has inadvertently roused an ancient hidden evil. Without allies, Garrett finds himself standing alone between the City and the forces that would crush it. [Eidos Interactive]… Expand"}, {"name": "Heroes of Hammerwatch - Ultimate Edition", "details_link": "https://www.metacritic.com/game/switch/heroes-of-hammerwatch---ultimate-edition", "publisher": "BlitWorks", "release_date": "Jul 29 2020", "developers": ["Crackshell"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/234b81d3c02896c6342c53edc0b87723-98.jpg", "descriptions": "Action RPG rogue-lite Heroes of Hammerwatch is finally out on Nintendo Switch™ in its most complete form, as this Ultimate Edition comes with all the DLCs. Encounter endless hordes of enemies, traps, puzzles, secrets and tons of loot, as you battle your way through procedurally generatedAction RPG rogue-lite Heroes of Hammerwatch is finally out on Nintendo Switch™ in its most complete form, as this Ultimate Edition comes with all the DLCs. Encounter endless hordes of enemies, traps, puzzles, secrets and tons of loot, as you battle your way through procedurally generated levels to reach the top of the Forsaken Spire. Upgrade to grant your persistent heroes with various enhancements that will further help you in your quest, and even bring them to your friends' game.… Expand"}, {"name": "Borderlands: The Secret Armory of General Knoxx", "details_link": "https://www.metacritic.com/game/xbox-360/borderlands-the-secret-armory-of-general-knoxx", "publisher": "2K Games", "release_date": "Feb 23 2010", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/6/fa9b5833d27e4c52102551b8cb385cc8-98.jpg", "descriptions": "(Downloadable Content)  Borderlands goes to ELEVEN! You may have seen some games raise their level cap by 5, or maybe even 10, but with The Crimson Lance Assassination Squads wreaking havoc and Crawmerax the Invincible being all invulnerable and stuff we knew you'd need more than just 10.(Downloadable Content)  Borderlands goes to ELEVEN! You may have seen some games raise their level cap by 5, or maybe even 10, but with The Crimson Lance Assassination Squads wreaking havoc and Crawmerax the Invincible being all invulnerable and stuff we knew you'd need more than just 10. And that's why Borderlands goes to ELEVEN! The Secret Armory of General Knoxx is an add-on pack for Borderlands that adds new guns, new Class Mods, new vehicles, new missions, new enemy types, and increases the level cap to 61. [Xbox.com]… Expand"}, {"name": "West of Loathing", "details_link": "https://www.metacritic.com/game/switch/west-of-loathing", "publisher": "Asymmetric Publications", "release_date": "May 31 2018", "developers": ["Asymmetric Publications"], "platforms": ["PC", "Stadia", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/202a01eaab4dc7d1d19c0316b351ebbb-98.jpg", "descriptions": "West of Loathing is a single-player slapstick comedy adventure role-playing game set in the wild west of the Kingdom of Loathing universe. Traverse snake-infested gulches, punch skeletons wearing cowboy hats, grapple with demon cows, and investigate a wide variety of disgusting spittoons.West of Loathing is a single-player slapstick comedy adventure role-playing game set in the wild west of the Kingdom of Loathing universe. Traverse snake-infested gulches, punch skeletons wearing cowboy hats, grapple with demon cows, and investigate a wide variety of disgusting spittoons. Talk your way out of trouble as a silver-tongued Snake Oiler, plumb the refried mysteries of the cosmos as a wise and subtle Beanslinger, or let your fists do the talking as a fierce Cow Puncher. Explore a vast open world and encounter a colorful cast of characters, some of whom are good, many of whom are bad, and a few of whom are ugly. [Nintendo]… Expand"}, {"name": "Sam & Max: The Devil's Playhouse - Episode 2: The Tomb of Sammun-Mak", "details_link": "https://www.metacritic.com/game/playstation-3/sam-max-the-devils-playhouse---episode-2-the-tomb-of-sammun-mak", "publisher": "Telltale Games", "release_date": "May 18 2010", "developers": ["Telltale Games"], "platforms": ["PC", "PlayStation 3"], "genres": ["Miscellaneous", "Adventure", "General", "3D", "Compilation", "Third-Person"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/c992de034a470a4c5b11703e566b9162-98.jpg", "descriptions": "In this episode, our heroes cross paths with an even more bizarre and dangerous pair of characters -- their own great-grandparents! These characters set out on their trippiest trip yet in The Tomb of Sammun-Mak, leapfrogging across ten decades and possibly as many continents (we haven'tIn this episode, our heroes cross paths with an even more bizarre and dangerous pair of characters -- their own great-grandparents! These characters set out on their trippiest trip yet in The Tomb of Sammun-Mak, leapfrogging across ten decades and possibly as many continents (we haven't counted) in search of the mysterious force that's causing all the trouble. … Expand"}, {"name": "UFC Undisputed 3", "details_link": "https://www.metacritic.com/game/xbox-360/ufc-undisputed-3", "publisher": "THQ", "release_date": "Feb 14 2012", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2 ", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/958bffaaf8d6f3753010413eae87f4ed-98.jpg", "descriptions": "The critically acclaimed and best-selling MMA videogame franchise returns to take players inside the Octagon with UFC Undisputed 3,  delivering intense UFC action focused on brutal toe-to-toe combat, impressive visual presentation and increased accessibility."}, {"name": "South Park: The Stick of Truth", "details_link": "https://www.metacritic.com/game/playstation-3/south-park-the-stick-of-truth", "publisher": "Ubisoft", "release_date": "Mar  4 2014", "developers": ["Obsidian Entertainment"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/a20319cbf4a28e39d3fe25fed96d87b7-98.jpg", "descriptions": "South Park: The Game is an epic role-playing adventure that will allow the user to befriend Stan, Kyle, Cartman and Kenny and explore the quiet little mountain town like never before. \r\rFrom the perilous battlefields of the 4th-grade playground, a young hero will rise, destined to be SouthSouth Park: The Game is an epic role-playing adventure that will allow the user to befriend Stan, Kyle, Cartman and Kenny and explore the quiet little mountain town like never before. \r\rFrom the perilous battlefields of the 4th-grade playground, a young hero will rise, destined to be South Park’s savior. From the creators of South Park, Trey Parker and Matt Stone, comes an epic quest to become… cool. Introducing South Park: The Stick of Truth. For a thousand years, the battle has been waged. The sole reason humans and elves are locked in a neverending war: The Stick of Truth. But the tides of war are soon to change as word of a new kid spreads throughout the land, his coming foretold by the stars. As the moving vans of prophecy drive away, your adventure begins. Arm yourself with weapons of legend to defeat crabpeople, underpants gnomes, hippies, and other forces of evil. Discover the lost Stick of Truth and earn your place at the side of Stan, Kyle, Cartman, and Kenny as their new friend. Succeed, and you shall be South Park’s savior, cementing your social status in South Park Elementary. Fail, and you will forever be known… as a loser. [Ubisoft]… Expand"}, {"name": "The Wolf Among Us: Episode 5 - Cry Wolf", "details_link": "https://www.metacritic.com/game/xbox-360/the-wolf-among-us-episode-5---cry-wolf", "publisher": "Telltale Games", "release_date": "Jul  9 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "Point-and-Click"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/a4de2273090cabd587cca8f178ce2e8e-98.jpg", "descriptions": "Following a bloody trail of murder and corruption, Bigby Wolf faces a powerful enemy: a dark force that has been feeding on the desperation of Fabletown’s seedy underbelly. But when hidden truths are revealed, you must decide exactly what justice means in the gripping season finale of TheFollowing a bloody trail of murder and corruption, Bigby Wolf faces a powerful enemy: a dark force that has been feeding on the desperation of Fabletown’s seedy underbelly. But when hidden truths are revealed, you must decide exactly what justice means in the gripping season finale of The Wolf Among Us.… Expand"}, {"name": "Rogue Legacy", "details_link": "https://www.metacritic.com/game/playstation-4/rogue-legacy", "publisher": "Cellar Door Games", "release_date": "Jul 29 2014", "developers": ["Cellar Door Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/3bcf4ab9f72bd3e9d6bbba6853a3670c-98.jpg", "descriptions": "Each time you die, your child will succeed you. Every child is unique. One child might be colorblind, another might have tourettes-- they could even be a dwarf.\r That's OK, because no one is perfect, and you don't have to be perfect to win this game. But you do have to be pretty darn goodEach time you die, your child will succeed you. Every child is unique. One child might be colorblind, another might have tourettes-- they could even be a dwarf.\r That's OK, because no one is perfect, and you don't have to be perfect to win this game. But you do have to be pretty darn good because this game is HARD. Fortunately, every time you die all the gold you've collected can be used to upgrade you manor, giving your next child a step up in life and another chance at vanquishing evil.… Expand"}, {"name": "Brothers: A Tale of Two Sons", "details_link": "https://www.metacritic.com/game/playstation-3/brothers-a-tale-of-two-sons", "publisher": "505 Games", "release_date": "Sep  3 2013", "developers": ["Starbreeze"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox 360", "Xbox One", "PlayStation 3"], "genres": ["Action Adventure", "Fantasy", "Fantasy", "Linear"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/53eb66c214309d4186dda87ef93db926-98.jpg", "descriptions": "Two sons must set out on a perilous journey to bring back the Water of Life to their ailing father."}, {"name": "Return to Monkey Island", "details_link": "https://www.metacritic.com/game/switch/return-to-monkey-island", "publisher": "Devolver Digital", "release_date": "Sep 19 2022", "developers": ["Terrible Toybox"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/cbd5317aba8939766eaac1f285a69a05-98.jpg", "descriptions": "Announcing Return to Monkey Island, the long-awaited follow-up to the legendary Secret of Monkey Island and Monkey Island 2: LeChuck's Revenge by Ron Gilbert's Terrible Toybox in collaboration with Devolver Digital and Lucasfilm Games, coming 2022."}, {"name": "Kirby and the Forgotten Land", "details_link": "https://www.metacritic.com/game/switch/kirby-and-the-forgotten-land", "publisher": "Nintendo", "release_date": "Mar 25 2022", "developers": ["Nintendo", "HAL Labs"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 85, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/7/0fe34bd10db8575900fc3afe2332e72f-98.jpg", "descriptions": "Join Kirby in an unforgettable journey through a mysterious world in a 3D platforming adventure. Float off on an all-new adventure as the powerful puffball, Kirby. Explore in 3D stages as you discover a mysterious world with abandoned structures from a past civilization—like a shoppingJoin Kirby in an unforgettable journey through a mysterious world in a 3D platforming adventure. Float off on an all-new adventure as the powerful puffball, Kirby. Explore in 3D stages as you discover a mysterious world with abandoned structures from a past civilization—like a shopping mall?! Copy enemies’ abilities like the new Drill and Ranger and use them to attack, explore your surroundings, and save the kidnapped Waddle Dees from the ferocious Beast Pack alongside the mysterious Elfilin. Hope you’re hungry for an unforgettable adventure!\r Join up with a pointy partner, Bandana Waddle Dee, in co-op play\r Pass a Joy-Con™ controller to a buddy to play as the spear-wielding Bandana Waddle Dee and help each other explore and battle through this colorful world. While Kirby can float and inhale enemies, Bandana Waddle Dee can spin and stab with his sturdy spear. Find friendship in this forgotten world and save the Waddle Dees!  \rFloat over obstacles and fight through enemies on your way to each stage’s goal as you slash, poke, freeze, and hammer using Kirby’s copy abilities. \r\rEach themed stage you travel through will hide several friendly Waddle Dees in peril! Save them to grow the home base of your adventure, the once-deserted Waddle Dee Town. The Waddle Dees you rescue will unlock shops and leaderboards*. You’ll also be able to enjoy some of the townsfolk’s favorite games.… Expand"}, {"name": "Football Manager 2014", "details_link": "https://www.metacritic.com/game/pc/football-manager-2014", "publisher": "Sega", "release_date": "Oct 30 2013", "developers": ["Sports Interactive"], "platforms": "PC", "genres": ["Sports", "Traditional", "Team", "Soccer", "Management", "Management"], "meta_score": 85, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/a05a95567511ef94396bf93277e23ed8-98.jpg", "descriptions": "FM 2014 features a rehauled transfer module in which opposing clubs and managers adopt a more realistic approach when making or responding to transfer offers. Additional, a host of new ‘real world’ transfer clauses have been added, such as the facility to loan a player back to the club heFM 2014 features a rehauled transfer module in which opposing clubs and managers adopt a more realistic approach when making or responding to transfer offers. Additional, a host of new ‘real world’ transfer clauses have been added, such as the facility to loan a player back to the club he has just been bought from and the option to offer a combination of money and loan players, as well as new contract clauses such as a sub bench appearance fee. Beyond this, the old ‘turn-based’ system of transfer negotiations can now be accomplished two ways, the tried and tested system and a new ‘live’ system, similar to that used in Football Manager’s contract negotiations.… Expand"}, {"name": "AI: The Somnium Files - nirvanA Initiative", "details_link": "https://www.metacritic.com/game/playstation-4/ai-the-somnium-files---nirvana-initiative", "publisher": "Spike Chunsoft", "release_date": "Jun 24 2022", "developers": ["Spike Chunsoft"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/3/216bfdcba65d0ddbca6906b1bcd59912-98.jpg", "descriptions": "Six years ago, the right half of a corpse was discovered under mysterious circumstances. The left half was never found...until six years later, when it was discovered completely fresh with no signs of decay, as though the victim was alive until just recently. Now, newly-appointed SpecialSix years ago, the right half of a corpse was discovered under mysterious circumstances. The left half was never found...until six years later, when it was discovered completely fresh with no signs of decay, as though the victim was alive until just recently. Now, newly-appointed Special Agent Mizuki and her AI partner Aiba are tasked to solve the bizarre Half Body serial killings...… Expand"}, {"name": "Age of Wonders: Planetfall", "details_link": "https://www.metacritic.com/game/xbox-one/age-of-wonders-planetfall", "publisher": "Paradox Interactive", "release_date": "Aug  6 2019", "developers": ["Triumph Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Strategy", "Turn-Based", "General", "4X"], "meta_score": 85, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/34732ae72a70b4985ced87cdf635ea6c-98.jpg", "descriptions": "Age of Wonders: Planetfall is the new strategy game from Triumph Studios, creators of the critically acclaimed Age of Wonders series, bringing all the exciting tactical turn-based combat and in-depth empire building of its predecessors to space in an all-new, sci-fi setting."}, {"name": "System Shock: Enhanced Edition", "details_link": "https://www.metacritic.com/game/pc/system-shock-enhanced-edition", "publisher": "Origin", "release_date": "Sep 22 2015", "developers": ["Looking Glass Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 85, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/6bbde488be3db6ca879be4a4845c856f-98.jpg", "descriptions": "The Enhanced Edition adds a modern touch to this classic gem, without taking anything from its unmistakable atmosphere."}, {"name": "Metal Gear Solid: The Twin Snakes", "details_link": "https://www.metacritic.com/game/gamecube/metal-gear-solid-the-twin-snakes", "publisher": "Konami", "release_date": "Mar  9 2004", "developers": ["Silicon Knights"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 85, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/afe392ce2f413dc4b3096c01ee0a3c1d-98.jpg", "descriptions": "Solid Snake debuts on the GameCube in Metal Gear Solid: The Twin Snakes.  This game revives the first two Metal Gear Solid games--Metal Gear Solid and Metal Gear Solid 2: Sons of Liberty--and combines their best features into one unique experience.  You are Solid Snake--a spy called out ofSolid Snake debuts on the GameCube in Metal Gear Solid: The Twin Snakes.  This game revives the first two Metal Gear Solid games--Metal Gear Solid and Metal Gear Solid 2: Sons of Liberty--and combines their best features into one unique experience.  You are Solid Snake--a spy called out of retirement to infiltrate an Alaskan nuclear base.  During your mission, you'll discover secret military projects and surprising details about your past.  Stealth is usually key to a successful mission, but if all else fails, you have a vast arsenal of weapons--including a silenced pistol, a rifle, guided missiles, and a sniper rifle--to dispose of your enemies.… Expand"}, {"name": "EverQuest: Gates of Discord", "details_link": "https://www.metacritic.com/game/pc/everquest-gates-of-discord", "publisher": "Sony Online Entertainment", "release_date": "Feb  9 2004", "developers": ["Sony Online Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/efa98c9a66b248af5b31ee2080704cd7-98.jpg", "descriptions": "The greatest threat to the world of Norrath has been unleashed in EverQuest! The lost continent of Taelosia has been discovered and a massive assault force, the Legion of Mata Muram, is creating chaos and devastation on this once peaceful continent! Experience EverQuest: Gates of Discord andThe greatest threat to the world of Norrath has been unleashed in EverQuest! The lost continent of Taelosia has been discovered and a massive assault force, the Legion of Mata Muram, is creating chaos and devastation on this once peaceful continent! Experience EverQuest: Gates of Discord and help protect your world while adventuring in many new zones, including a stony city, sprawling temples, a myriad of catacombs, and a maze of sewers. And meet the Berserker, the newest EverQuest character class and perhaps your closest allies in melee combat against the invading hoard of fearless, deadly monstrosities from the chaotic Realm of Discord. [Sony Online Entertainment]… Expand"}, {"name": "The Lord of the Rings: The Return of the King", "details_link": "https://www.metacritic.com/game/playstation-2/the-lord-of-the-rings-the-return-of-the-king", "publisher": "EA Games", "release_date": "Nov  5 2003", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/f085220a88d7c24f23251ec11c0e10d7-98.jpg", "descriptions": "Return to Middle-earth in the only video game based on the epic final chapter of the highly-acclaimed The Lord of the Rings movie trilogy. Developed using the same digital assets as the films, The Return of the King re-creates in stunning detail the final events of the War of the Ring.Return to Middle-earth in the only video game based on the epic final chapter of the highly-acclaimed The Lord of the Rings movie trilogy. Developed using the same digital assets as the films, The Return of the King re-creates in stunning detail the final events of the War of the Ring. Become the heroes who determine the fate of Middle-earth as you traverse the haunted Paths of the Dead, defend Minas Tirith from the onslaught of thousands of Sauron's minions, and even play co-op multiplayer with a friend as you march against the impenetrable Black Gates of Mordor. Eight playable characters, including Gandalf, Aragorn, Legolas, Gimli, Sam, and Frodo with exclusive voice-over provided by the films’ actors. The fate of Middle-earth is in your hands. [Electronic Arts]… Expand"}, {"name": "The Sims", "details_link": "https://www.metacritic.com/game/gamecube/the-sims", "publisher": "EA Games", "release_date": "Mar 25 2003", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Virtual Life"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Build, buy, and live.  The Sims give you the chance to create simulated people and build their homes, then help your Sims pursue careers, earn money, make friends, and find romance--or totally mess up their lives.  Keep your Sims happy by decorating your home with over 150 objects in theBuild, buy, and live.  The Sims give you the chance to create simulated people and build their homes, then help your Sims pursue careers, earn money, make friends, and find romance--or totally mess up their lives.  Keep your Sims happy by decorating your home with over 150 objects in the game and downloadable ones from TheSims.com.  Test your \"people skills\" as you deal with family, friends, careers, and chaos.  There is no right or wrong way to play the game.  … Expand"}, {"name": "NASCAR Thunder 2003", "details_link": "https://www.metacritic.com/game/gamecube/nascar-thunder-2003", "publisher": "Electronic Arts", "release_date": "Sep 19 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 85, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/e87e7426238ea216b57d9a7dfee742c6-98.jpg", "descriptions": "Get behind the wheel of the world's tightest, sleekest stock cars and get ready for an intense ride.  NASCAR Thunder 2003 elevates the series to another level with deeper modes, new tracks, and a greater sense of speed.  Experience life in the fast lane through 20 seasons of Career mode, inGet behind the wheel of the world's tightest, sleekest stock cars and get ready for an intense ride.  NASCAR Thunder 2003 elevates the series to another level with deeper modes, new tracks, and a greater sense of speed.  Experience life in the fast lane through 20 seasons of Career mode, in which you must compete for top sponsors, the best crewmembers, and the latest racing technology.  All 23 Winston Cup tracks and the Daytona Beach road course can be raced with 14 tracks featuring both day and night racing.  NASCAR Thunder 2003 brings the speed and precision of NASCAR to your fingertips.… Expand"}, {"name": "FIFA 2001 Major League Soccer", "details_link": "https://www.metacritic.com/game/pc/fifa-2001-major-league-soccer", "publisher": "EA Sports", "release_date": "Oct 30 2000", "developers": ["EA Sports"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 85, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/9a9bc6492258540b5026a30ce55737d5-98.jpg", "descriptions": "FIFA 2001's environment is alive -- this is not just a simulation: sidelines bustle with activity from spectators, coaches, and teammates as the weather and lighting change.  [EA Sports]"}, {"name": "Fight Night 2004", "details_link": "https://www.metacritic.com/game/xbox/fight-night-2004", "publisher": "EA Sports", "release_date": "Apr  5 2004", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/ef2e7d094230191d3b3a9264f064e42a-98.jpg", "descriptions": "EA Sports returns to the boxing ring with Fight Night 2004. Built to deliver all the drama and pageantry of a heavyweight title bout, Fight Night 2004 features real fighters with authentic moves. With Total Punch Control, the analog sticks become intuitive extensions of your fists, givingEA Sports returns to the boxing ring with Fight Night 2004. Built to deliver all the drama and pageantry of a heavyweight title bout, Fight Night 2004 features real fighters with authentic moves. With Total Punch Control, the analog sticks become intuitive extensions of your fists, giving you more control over punches, blocks, and dodges. Create your own fighter in Career mode, customize your ring entrance, and then work your way from amateur to undisputed champion.… Expand"}, {"name": "Wipeout: Omega Collection", "details_link": "https://www.metacritic.com/game/playstation-4/wipeout-omega-collection", "publisher": "Sony Interactive Entertainment", "release_date": "Jun  6 2017", "developers": ["Sony Interactive Entertainment"], "platforms": "PlayStation 4", "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/9f4adf52e696518f45b7f7fb5b6d12b7-98.jpg", "descriptions": "A name synonymous with PlayStation, Wipeout is the rapid combat racer that defies gravity and defines generations. Known for its blistering speed, iconic music and pure multiplayer mayhem, Wipeout has starred on every PlayStation format since 1995  and is now set to rip through the air onA name synonymous with PlayStation, Wipeout is the rapid combat racer that defies gravity and defines generations. Known for its blistering speed, iconic music and pure multiplayer mayhem, Wipeout has starred on every PlayStation format since 1995  and is now set to rip through the air on PlayStation4 and PlayStation4 Pro. Featuring all the content from Wipeout HD, Fury and 2048, Wipeout Omega Collection packs in 26 reversible circuits, 46 unique ships, a ton of game modes and some new and classic music tracks. Its time for Wipeout veterans to come out of retirement and new pilots to make their debut.… Expand"}, {"name": "Octopath Traveler II", "details_link": "https://www.metacritic.com/game/switch/octopath-traveler-ii", "publisher": "Square Enix", "release_date": "Feb 24 2023", "developers": ["Square Enix", "Acquire"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/c1a321c77f6eeebc39fcc0db5198611c-98.jpg", "descriptions": "This game is a brand-new entry in the OCTOPATH TRAVELER series, the first installment of which was initially released in 2018 and sold over 3 million copies worldwide. It takes the series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, to even greater heights.\rIn the world ofThis game is a brand-new entry in the OCTOPATH TRAVELER series, the first installment of which was initially released in 2018 and sold over 3 million copies worldwide. It takes the series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, to even greater heights.\rIn the world of Solistia, eight new travelers venture forth into an exciting new era.\rWhere will you go? What will you do? Whose tale will you bring to life?\rEvery path is yours to take.\rEmbark on an adventure all your own.\r 1. Begin your adventure as one of eight new travelers, each with their own origins, motivations, and unique skills.\r 2. The series’ HD-2D graphics, a fusion of retro pixel art and 3DCG, have reached even greater heights.\r 3. The story takes place in Solistia, where diverse cultures thrive from east to west and the industries of the new era flourish. You can sail the seas and explore every corner of a world that changes from day to night.\r 4. Each traveler has a unique set of Path Actions they can use to battle townspeople, obtain items, take others along in their travels, and more. Where will you go? What will you do? Every path is yours to take.\r 5. Familiar mechanics from the original game have been preserved, like the freedom to develop your travelers’ jobs and skills, as well as the Break and Boost system that made battles so exhilarating. New mechanics have also been added.… Expand"}, {"name": "Tangle Tower", "details_link": "https://www.metacritic.com/game/switch/tangle-tower", "publisher": "SFB Games", "release_date": "Oct 22 2019", "developers": ["SFB Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/16495728a7b59d92f4123c80e5f2fe74-98.jpg", "descriptions": "Unravel a mystery by exploring a strange and twisted mansion, discovering curious clues, interrogating peculiar suspects and solving unique puzzles. Will you be able to uncover the secrets of Tangle Tower?"}, {"name": "Mortal Kombat XL", "details_link": "https://www.metacritic.com/game/playstation-4/mortal-kombat-xl", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Mar  1 2016", "developers": ["NetherRealm Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/297a93224c7b5b1bcd63b201b45864a0-98.jpg", "descriptions": "Includes main game, and new playable characters Alien, Leatherface, Triborg, and Bo'Rai Cho. Previously released playable characters include Predator, Jason Voorhees, Tremor, Tanya, and Goro. Also includes new skins pack Apocalypse Pack and all previously released skins packs."}, {"name": "Lego Star Wars II: The Original Trilogy", "details_link": "https://www.metacritic.com/game/xbox/lego-star-wars-ii-the-original-trilogy", "publisher": "LucasArts", "release_date": "Sep 12 2006", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1-2 ", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/5044b903bbd85b4af16a63de91fee0be-98.jpg", "descriptions": "Lego Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you buildLego Star Wars II takes the fun and customization ability of the LEGO play pattern and combines it with the epic story, characters and action from the revolutionary Star Wars: Episodes IV, V and VI. With a unique tongue-in-cheek take on the Original Trilogy, LEGO Star Wars II lets you build and battle your way through your favorite film moments. From Darth Vader's pursuit of Princess Leia aboard her Blockade Runner to Luke's final confrontation with Emperor Palpatine. For the first time ever, characters can get in and out of vehicles, as well as ride creatures. Because it's LEGO style, you can also mix and match the body parts of more than 50 playable characters to create one of millions of possible LEGO Star Wars heroes. And on PS2, Xbox and Windows platforms, a game save from the first LEGO Star Wars can unlock another 50-plus additional characters for Free Play mode -- that's more than 100 total characters. Other exciting additions include free-roaming vehicle levels, the ability to switch ships at will in Free Play mode, cool new character-specific attacks and maneuvers, playable mini-kit vehicles, an adaptive difficulty option and more.… Expand"}, {"name": "Sid Meier's Civilization V: Brave New World", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-v-brave-new-world", "publisher": "2K Games", "release_date": "Jul  8 2013", "developers": ["Firaxis Games"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "4X"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/af91ddc5676133ad828f71cb65bdaa29-98.jpg", "descriptions": "The second expansion for Sid Meier's Civilization V, Brave New World, introduces nine new civilizations, international trade, and victory through cultural dominance."}, {"name": "The Warriors", "details_link": "https://www.metacritic.com/game/xbox/the-warriors", "publisher": "Rockstar Games", "release_date": "Oct 17 2005", "developers": ["Rockstar Toronto"], "platforms": ["PlayStation 2", "PlayStation 4", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 85, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/8ec1e4083d61ba191057d6805697e5c3-98.jpg", "descriptions": "A battle on the streets of New York. The armies of the night number 60,000 strong, and tonight they're all after The Warriors - a street gang wrongly accused of killing a rival gang leader. The Warriors must make their way from one end of New York to their turf on the other side of the city.A battle on the streets of New York. The armies of the night number 60,000 strong, and tonight they're all after The Warriors - a street gang wrongly accused of killing a rival gang leader. The Warriors must make their way from one end of New York to their turf on the other side of the city. All that stands between The Warriors and their survival are 20 miles and thousands of street gang members. The army of gangs owns the streets and there's no turning back, they must fight for their lives and learn the meaning of loyalty as danger and uncertainty emerge from the city night. Based on the 1979 Paramount Pictures cult classic movie and developed by Rockstar Toronto, The Warriors expands the stylized cinematic journey of the film into a gritty interactive experience set in 1970s New York.… Expand"}, {"name": "Red Faction: Guerrilla", "details_link": "https://www.metacritic.com/game/xbox-360/red-faction-guerrilla", "publisher": "THQ", "release_date": "Jun  2 2009", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/3b7ccd147777529b3526e237dd8faf6a-98.jpg", "descriptions": "Red Faction: Guerrilla is a 3rd person, open-world action shooter set on Mars, 50 years after the events of the original Red Faction. Players assume the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive EarthRed Faction: Guerrilla is a 3rd person, open-world action shooter set on Mars, 50 years after the events of the original Red Faction. Players assume the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Throughout their fight for freedom, players carve their own path, wreaking havoc across the vast, open-world environment of Mars, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos. Utilizing improvised weapons, explosives and re-purposed mining equipment and vehicles, Red Faction: Guerrilla allows players to tear through fully destructible environments in an unforgiving Martian landscape swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire. Red Faction: Guerrilla also features a robust multiplayer component, including several modes focused on destruction-based gameplay. [THQ]… Expand"}, {"name": "Geometry Wars 3: Dimensions", "details_link": "https://www.metacritic.com/game/playstation-4/geometry-wars-3-dimensions", "publisher": "Sierra Games", "release_date": "Nov 25 2014", "developers": ["Lucid Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/1bf1933ee1ec5a36dbf48845fcca50e8-98.jpg", "descriptions": "Over fifty single player levels including Adventure and Classic Arcade modes. 3D grids and over ten battle modes including Pacifism, King and Claustrophobia. Four distinct companion drones such as Attack, Collector, Ram and Snipe. Co-op and Online Competitive Multiplayer modes."}, {"name": "Ratchet & Clank", "details_link": "https://www.metacritic.com/game/playstation-4/ratchet-clank", "publisher": "SCEA", "release_date": "Apr 12 2016", "developers": ["Insomniac Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/0f048f0dcc5dc5919079c2e31e5fa86e-98.jpg", "descriptions": "Play the game, based on the movie, based on the game. Ratchet & Clank (PS4) is a new game based on elements from the original Ratchet & Clank (PS2). Developed alongside the major motion CG-animated picture coming to theatres in 2016, Ratchet & Clank (PS4) marks the PlayStation 4 debut ofPlay the game, based on the movie, based on the game. Ratchet & Clank (PS4) is a new game based on elements from the original Ratchet & Clank (PS2). Developed alongside the major motion CG-animated picture coming to theatres in 2016, Ratchet & Clank (PS4) marks the PlayStation 4 debut of PlayStation's greatest heroes. Join Ratchet, Clank, Captain Qwark and new friends as they battle to save the Solana Galaxy from the evil Chairman Drek. With an hour of new cinematics (including footage from the film), Ratchet & Clank (PS4) takes a deeper look at the characters' origin stories and modernizes the original gameplay. Explore the galaxy in a game that features new planets, new and updated gameplay segments, all-new bosses, all-new Clank gameplay, all-new flight sequences, and much more --- with completely new visuals built to demonstrate the power of the PS4. Battle your enemies with an out-of-this-world arsenal, including new weapons and fan-favorite tools of destruction from the Ratchet & Clank Future series. From the brand new Pixelizer (which transforms enemies into explosive 8-bit pixels) to franchise favorites like the dance-party-inducing Groovitron and wise-cracking robotic bodyguard Mr. Zurkon, Ratchet & Clank's arsenal has never been better. Help Ratchet and Clank save the galaxy for the first time, again, exclusively on PlayStation 4.… Expand"}, {"name": "MLB The Show 16", "details_link": "https://www.metacritic.com/game/playstation-4/mlb-the-show-16", "publisher": "SCEA", "release_date": "Mar 29 2016", "developers": ["SCEA San Diego Studios"], "platforms": ["PlayStation 3", "PlayStation 4"], "genres": ["Sports", "Team", "Baseball", "Arcade", "Sim"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/3ab64bcfae4edd5cd0ba854f83120028-98.jpg", "descriptions": "ShowTime takes critical in-game Road To The Show moments and slows them down to give you maximum control. Make Gold Glove plays and come through in the clutch with this tool that allows finer, more focused user control. Immersive Road To The Show – With a curated in-game environment and aShowTime takes critical in-game Road To The Show moments and slows them down to give you maximum control. Make Gold Glove plays and come through in the clutch with this tool that allows finer, more focused user control. Immersive Road To The Show – With a curated in-game environment and a revamped training system that includes Gameplay Perks, The Show 16 offers a more personalized experience that acknowledges key moments of your career as you travel from a nobody to the Hall of Fame. An improved “Topps Prospect Showcase” includes Bowman Scout Day and a new 20-80 scale scouting report. Streamlined game logic maximizes the time spent in situations that matter. Conquest Mode – This single-player online experience takes your Diamond Dynasty team on the road as you travel through North America en route to becoming America's most popular team. As you earn fans, strategically move them to hold territories or help take over new territories as you attempt to achieve baseball manifest destiny.… Expand"}, {"name": "Football Manager 2021", "details_link": "https://www.metacritic.com/game/pc/football-manager-2021", "publisher": "Sega", "release_date": "Nov 24 2020", "developers": ["Sports Interactive"], "platforms": ["iPhone/iPad", "Xbox One", "Xbox Series X", "PC"], "num_players": "Online Multiplayer", "genres": ["Sports", "Team", "Soccer", "Management"], "meta_score": 85, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/88ac830af8449ec7a07d5e87312a0241-98.jpg", "descriptions": "The manager is the beating heart of every football club. In Football Manager 2021 dynamic, true-to-life management experiences and next-level detail renews that focus on you like never before, equipping you with all the tools to achieve elite status.\r With more than 50 nations and 2,500The manager is the beating heart of every football club. In Football Manager 2021 dynamic, true-to-life management experiences and next-level detail renews that focus on you like never before, equipping you with all the tools to achieve elite status.\r With more than 50 nations and 2,500 clubs at every level of the football pyramid to choose from, the possibilities are endless. It’s over to you, boss.\r Choose your colours and the challenge that best suits your ambitions and then work with your club’s hierarchy to ensure you meet theirs… or face the consequences.\r  Join forces with your backroom staff to assess the strength and depth of your playing squad before dipping into the transfer market. There’s likely to be a starlet in your Academy knocking on the door of the first team…\r  Craft tactical strategies, formations and styles of play for every occasion to maximise your club’s chances of winning football matches and getting those three points.\r  Immerse yourself in the spectacle of match day and revel in the glory of management as your planning pays off on the pitch.… Expand"}, {"name": "Valkyria Chronicles 4", "details_link": "https://www.metacritic.com/game/playstation-4/valkyria-chronicles-4", "publisher": "Sega", "release_date": "Sep 25 2018", "developers": ["Sega", "Media.Vision"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/09680137c02233ab748aac2d0c400dec-98.jpg", "descriptions": "A Continent Engulfed in the Bitter Flames of War. Commander Claude Wallace and his childhood friends set out to fight in a desperate war, but bone-chilling blizzards, waves of imperial soldiers, and the godlike powers of the Valkyria stand between them and victory."}, {"name": "Final Fantasy IV", "details_link": "https://www.metacritic.com/game/ds/final-fantasy-iv", "publisher": "Square Enix", "release_date": "Jul 21 2008", "developers": ["Matrix Software"], "platforms": ["iPhone/iPad", "PC", "DS"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 85, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/b3c37572af564ce20ad13d6700d006f4-98.jpg", "descriptions": "Four elemental Crystals, each possessing awesome power, lie scattered throughout the realm. However, men are quick to covet things which offer strength, and easily corrupted by the might which they possess. Seduced by the promised power of the Crystals, the kingdom of Baron begins employingFour elemental Crystals, each possessing awesome power, lie scattered throughout the realm. However, men are quick to covet things which offer strength, and easily corrupted by the might which they possess. Seduced by the promised power of the Crystals, the kingdom of Baron begins employing unprovoked force to seize them from peaceful nations. The dark knight Cecil – Lord Captain of Baron’s elite force, the Red Wings – is ordered by his king to obtain the Crystals, but soon begins to question the monarch's motives. Stricken with grief at his own actions, yet burdened by his loyalty to his country and his personal sense of honor, Cecil at last decides to turn from the path of darkness and destruction. Enraged, the king accuses him of disloyalty, strips Cecil of his command, and sends him off to slay a mysterious beast that lurks in the nearby Valley of Mist. Cecil embarks on a fateful journey that will bring trials, betrayals, friendship, loss and self-discovery. Can Cecil open his eyes and become the man of honor that he must be? Dive into the first RPG to incorporate the innovative Active Time Battle system, now further enhanced and refined for the Nintendo DS. Train and customize Whytkin by playing a variety of mini-games and challenge another player to head-to-head battle via local wireless connection. [Square Enix]… Expand"}, {"name": "Marvel vs. Capcom 2", "details_link": "https://www.metacritic.com/game/playstation-3/marvel-vs-capcom-2", "publisher": "Capcom", "release_date": "Aug 13 2009", "developers": ["Backbone Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1-2 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/bd080d78b8e0a4e22d18de3fd745ee68-98.jpg", "descriptions": "[Playstation Network]  MARVEL VS. CAPCOM 2 brings legendary characters from throughout Marvel and Capcom history to duke it out in an insane tag-team fighting experience. From Ryu to Wolverine, pit your favorite heroes in dream match-ups thanks to an unprecedented 56-character roster. With[Playstation Network]  MARVEL VS. CAPCOM 2 brings legendary characters from throughout Marvel and Capcom history to duke it out in an insane tag-team fighting experience. From Ryu to Wolverine, pit your favorite heroes in dream match-ups thanks to an unprecedented 56-character roster. With all new online play, take the fight across the globe and decide who really has the best \"dream team.\" Widescreen support, enhanced HD graphics, and a robust leaderboard makes one of the best fighting games even better! Unique fighting: Try 3-on-3 tag-team matches, and the new online matching mode, including the \"Quarter Match\" mode from Super Street Fighter II Turbo HD Remix. Accessibility: Four button controls introduce new players to the joy of fighting games. New visuals: The new optional visual filter smoothes out the game's graphics. [Capcom]… Expand"}, {"name": "A Plague Tale: Requiem", "details_link": "https://www.metacritic.com/game/xbox-series-x/a-plague-tale-requiem", "publisher": "Focus Entertainment", "release_date": "Oct 18 2022", "developers": ["Asobo Studio"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/8367b4555750e5e09b572d8d99dacdda-98.jpg", "descriptions": "Embark on a heartrending journey into a brutal, breathtaking world twisted by supernatural forces. After escaping their devastated homeland, Amicia and Hugo travel far south, to new regions and vibrant cities. There, they attempt to start a new life and control Hugo's curse. But, when Hugo'sEmbark on a heartrending journey into a brutal, breathtaking world twisted by supernatural forces. After escaping their devastated homeland, Amicia and Hugo travel far south, to new regions and vibrant cities. There, they attempt to start a new life and control Hugo's curse. But, when Hugo's powers reawaken, death and destruction return in a flood of devouring rats. Forced to flee once more, the siblings place their hopes in a prophesized island that may hold the key to saving Hugo.\r Discover the cost of saving those you love in a desperate struggle for survival. Strike from the shadows or unleash hell, overcoming foes and challenges with a variety of weapons, tools and unearthly powers.… Expand"}, {"name": "Death Stranding: Director's Cut", "details_link": "https://www.metacritic.com/game/pc/death-stranding-directors-cut", "publisher": "505 Games", "release_date": "Mar 30 2022", "developers": ["Kojima Productions"], "platforms": ["PlayStation 5", "PC"], "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/aa7ba9671a7cd26ec383cecfb0794f5e-98.jpg", "descriptions": "From legendary game creator Hideo Kojima comes a genre-defying experience, now expanded and remastered for the PS5 console in this definitive Director's Cut.Can you reunite the shattered world, one step at a time?"}, {"name": "Destiny 2: The Witch Queen", "details_link": "https://www.metacritic.com/game/xbox-series-x/destiny-2-the-witch-queen", "publisher": "Bungie", "release_date": "Feb 22 2022", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/0f1401a1f63950b08a9f9e41269d4d0c-98.jpg", "descriptions": "The Definitive Destiny Campaign. Delve into Savathûn’s Throne World to uncover the mystery of how she and her Lucent Hive stole the Light. Learn the secrets to crafting new weapons, the new Glaive, and survive the truth within her web of lies. New Destination. A twisted wonderland ofThe Definitive Destiny Campaign. Delve into Savathûn’s Throne World to uncover the mystery of how she and her Lucent Hive stole the Light. Learn the secrets to crafting new weapons, the new Glaive, and survive the truth within her web of lies. New Destination. A twisted wonderland of corruption and splendor, Savathûn’s Throne World plays host to a fragile balance of power. From her palace to the swamp, all that she hides can be found here. Weapon Crafting. Create custom weaponry with unique mod, shader, and stat combinations. Master the new Glaive weapon type and unleash powerful melee combos, projectile attacks, and a deployable energy shield. … Expand"}, {"name": "Steins;Gate Elite", "details_link": "https://www.metacritic.com/game/switch/steinsgate-elite", "publisher": "Spike Chunsoft", "release_date": "Feb 19 2019", "developers": ["5pb", "Mages."], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Visual Novel"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/4b240f73bcfbb099381215460198ba43-98.jpg", "descriptions": "Follow a group of young, tech-savvy “lab members” who discover the means of changing the past via e-mail using a modified microwave. Their experiments in pushing the boundaries of time begin to spiral out of control as they become entangled in a conspiracy surrounding SERN, the organizationFollow a group of young, tech-savvy “lab members” who discover the means of changing the past via e-mail using a modified microwave. Their experiments in pushing the boundaries of time begin to spiral out of control as they become entangled in a conspiracy surrounding SERN, the organization behind the Large Hadron Collider, and John Titor, who claims to be from a dystopian future. … Expand"}, {"name": "Darkest Dungeon", "details_link": "https://www.metacritic.com/game/switch/darkest-dungeon", "publisher": "Red Hook Studios", "release_date": "Jan 18 2018", "developers": ["Red Hook Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 85, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/8344281531f0023de5eceb44ec83fb7b-98.jpg", "descriptions": "Darkest Dungeon is a gothic roguelike RPG dungeon crawler about the psychological stresses of adventuring. You will lead a band of four heroes on a perilous side-scrolling descent, dealing with a prodigious number of threats to their bodily health, and worse, a relentless assault on theirDarkest Dungeon is a gothic roguelike RPG dungeon crawler about the psychological stresses of adventuring. You will lead a band of four heroes on a perilous side-scrolling descent, dealing with a prodigious number of threats to their bodily health, and worse, a relentless assault on their mental fortitude! Five hundred feet below the earth you will not only fight unimaginable foes, but famine, disease, and the stress of the ever-encroaching dark. Darkest Dungeon focuses on the humanity and psychological vulnerability of the heroes and asks: What emotional toll does a life of adventure take?… Expand"}, {"name": "Mutant Mudds Collection", "details_link": "https://www.metacritic.com/game/switch/mutant-mudds-collection", "publisher": "Renegade Kid", "release_date": "Dec 14 2017", "developers": ["Renegade Kid", "Atooi LLC"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Platformer", "Compilation", "2D"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/0ebafd0e2bf2d5e324b774c5ff385a67-98.jpg", "descriptions": "Love pixels? Fond of platformers? Is there a special place in your heart for the 8-bit and 16-bit era? Want to have fun? Yes!? Well, you've come to the right place, my friend. Mutant Mudds is a \"12-bit\" action platformer full of pixels and platforming fun! Our hero, Max, may beLove pixels? Fond of platformers? Is there a special place in your heart for the 8-bit and 16-bit era? Want to have fun? Yes!? Well, you've come to the right place, my friend. Mutant Mudds is a \"12-bit\" action platformer full of pixels and platforming fun! Our hero, Max, may be just a 2D sprite, but he can leap into the third dimension by jetting between the background and the foreground playfields with his trusty jetpack in this unique dimensionally-woven experience. Armed with a heavy-duty water cannon, Max has what he needs to vanquish his long-term nemesi: the Mutant Mudds. Max must blast and hover his way across the soiled landscape to seek out mysterious Water Sprites. Legend says collecting all of the mysterious Water Sprites will wash the filthy Mutant Mudds away for good!… Expand"}, {"name": "NeuroVoider", "details_link": "https://www.metacritic.com/game/switch/neurovoider", "publisher": "Plug In Digital", "release_date": "Sep  7 2017", "developers": ["Flying Oak Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/66ada73b181421144c7d1a1b9c3d051b-98.jpg", "descriptions": "NeuroVoider is a twin-stick shooter RPG set in a cyber futuristic world about brains shooting around evil robots with nuclear rocket launchers. Battle through the horde of vigilant robots, boost your character with the smoking remains of your victims, and defeat the master NeuroVoider to endNeuroVoider is a twin-stick shooter RPG set in a cyber futuristic world about brains shooting around evil robots with nuclear rocket launchers. Battle through the horde of vigilant robots, boost your character with the smoking remains of your victims, and defeat the master NeuroVoider to end this eternal war. Play it coop with up to 4 friends, or go alone in an adventure of hack'n'slash rampage, with a pinch of rogue-lite, and some permadeath. … Expand"}, {"name": "Mortal Kombat", "details_link": "https://www.metacritic.com/game/playstation-vita/mortal-kombat", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "May  1 2012", "developers": ["NetherRealm Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PlayStation Vita"], "genres": ["Action", "Fighting", "Fighting", "3D", "2D"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/5b4f27df8cb82a856b0b04edf92b1d3a-98.jpg", "descriptions": "Get ready to re-enter the tournament wherever you are. A full reboot of the franchise, this latest version of the game combines innovative mature oriented fighter gameplay with a deep story mode, enhanced graphics and game technology and new game modes. The game features a storyline thatGet ready to re-enter the tournament wherever you are. A full reboot of the franchise, this latest version of the game combines innovative mature oriented fighter gameplay with a deep story mode, enhanced graphics and game technology and new game modes. The game features a storyline that takes you back to the original tournament, exclusive Vita functionality, fatalities presented in graphic detail never imagined in earlier release, and completely new game modes. … Expand"}, {"name": "Total War: Three Kingdoms", "details_link": "https://www.metacritic.com/game/pc/total-war-three-kingdoms", "publisher": "Sega", "release_date": "May 23 2019", "developers": ["Creative Assembly"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 85, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/c16ec914a0e34c6eb78f1b58e4640f67-98.jpg", "descriptions": "Total War: THREE KINGDOMS is the first in the award-winning series to recreate epic conflict across ancient China. Combining a gripping turn-based campaign of empire-building & conquest with stunning real-time battles, THREE KINGDOMS redefines the series in an age of heroes & legends."}, {"name": "The Last Door: Season 2", "details_link": "https://www.metacritic.com/game/pc/the-last-door-season-2", "publisher": "Phoenix Online Publishing", "release_date": "Mar 29 2016", "developers": ["The Game Kitchen"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 85, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/4c9337ab194ae1bf53d8c127147e0deb-98.jpg", "descriptions": "In Season 2 of The Last Door, the search for his missing client will bring psychiatrist John Wakefield deeper into a conspiracy of darkness and closer to the heart of madness than ever before."}, {"name": "F.E.A.R.", "details_link": "https://www.metacritic.com/game/xbox-360/fear", "publisher": "Vivendi Games", "release_date": "Oct 31 2006", "developers": ["Day 1 Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/e1d6ba404efd145ab8d51555b39f9942-98.jpg", "descriptions": "F.E.A.R. (First Encounter Assault and Recon), is an intense first person close-quarters combat experience with rich atmosphere and an engaging storyline. The story begins as an unidentified paramilitary force infiltrates a multi-billion dollar aerospace compound. The government responds byF.E.A.R. (First Encounter Assault and Recon), is an intense first person close-quarters combat experience with rich atmosphere and an engaging storyline. The story begins as an unidentified paramilitary force infiltrates a multi-billion dollar aerospace compound. The government responds by sending in Special Forces, but loses contact as an eerie signal interrupts radio communications. When the interference subsides moments later, the team has been literally torn apart. As part of a classified strike team created to deal with threats no one else can handle, your mission is simple: Eliminate the intruders at any cost. Determine the origin of the signal. And contain this crisis before it spirals out of control. [Vivendi]… Expand"}, {"name": "Thronebreaker: The Witcher Tales", "details_link": "https://www.metacritic.com/game/pc/thronebreaker-the-witcher-tales", "publisher": "CD Projekt Red Studio", "release_date": "Nov  9 2018", "developers": ["CD Projekt Red Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Strategy", "Turn-Based", "Card Battle"], "meta_score": 85, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/611e5fc2094a588ccc86f1d4e2b028a3-98.jpg", "descriptions": "From the creators of The Witcher 3: Wild Hunt comes a brand new tale set in the brutal and twisted universe of witcher Geralt of Rivia. The world stands on the verge of chaos, as the tensions between the power-hungry Nilfgaardian Empire and proud Northern Realms grow. Facing an imminentFrom the creators of The Witcher 3: Wild Hunt comes a brand new tale set in the brutal and twisted universe of witcher Geralt of Rivia. The world stands on the verge of chaos, as the tensions between the power-hungry Nilfgaardian Empire and proud Northern Realms grow. Facing an imminent invasion, Meve — war-veteran Queen of Lyria and Rivia — is forced to once again enter the warpath, and set out on a dark journey of destruction and revenge.… Expand"}, {"name": "Brothers in Arms: Earned in Blood", "details_link": "https://www.metacritic.com/game/xbox/brothers-in-arms-earned-in-blood", "publisher": "Ubisoft", "release_date": "Oct  6 2005", "developers": ["Gearbox Software"], "platforms": "Xbox", "num_players": "4  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 85, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/4aca22102b00553644fe64e6f5b57f96-98.jpg", "descriptions": "You can play as Sergeant Joe Hartsock during the liberation of Normandy in Brothers in Arms: Earned in Blood. This sequel to Brothers in Arms: The Road to Hill 30 includes new single- and multiplayer missions, as well as new competitive and cooperative multiplayer game modes. You can alsoYou can play as Sergeant Joe Hartsock during the liberation of Normandy in Brothers in Arms: Earned in Blood. This sequel to Brothers in Arms: The Road to Hill 30 includes new single- and multiplayer missions, as well as new competitive and cooperative multiplayer game modes. You can also employ new weapons and vehicles against the game's improved AI. … Expand"}, {"name": "Far Cry 4", "details_link": "https://www.metacritic.com/game/playstation-4/far-cry-4", "publisher": "Ubisoft", "release_date": "Nov 18 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "First-Person", "Modern", "Arcade"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/40c7b1fe6d75bda51bd876e36eed4ff9-98.jpg", "descriptions": "Hidden in the towering Himalayas lies a country steeped in tradition and violence. You are Ajay Ghale, returning to the country of your birth, the lush forests and harsh snow capped summits of Kyrat, to fulfill your mother’s dying wish of spreading her ashes. This vast and unpredictableHidden in the towering Himalayas lies a country steeped in tradition and violence. You are Ajay Ghale, returning to the country of your birth, the lush forests and harsh snow capped summits of Kyrat, to fulfill your mother’s dying wish of spreading her ashes. This vast and unpredictable country offers visitors opportunity and danger. You quickly find yourself caught up in a rebellion to overthrow the oppressive regime of Pagan Min, a figure known as much for his sense of style and charisma as for his cruelty and naked brutality. Navigating the treacherous landscape, you find your fate increasingly determined by the choices you make because in Kyrat, and every second is a story. In Far Cry 4, you’ll conquer fortress outposts from the back of a 6-ton elephant and take to the skies as you rain down explosives from your moving perch in the gyrocopter. The vertical landscape of the Himalayas isn’t just a gorgeous backdrop, but a playground that encourages the player to fight, hunt and explore, grappling cliffs or launching into the air, plummeting to the valley below in a controlled free fall with your wing suit. You’ll carry with you a truly unique arsenal of weaponry that lets you play your way, whether it’s sniping, sneaking or all-out assault. When all else fails, animals can be your biggest allies or your greatest peril, as Kyrat’s wilderness delivers on the promise of a true open world anecdote factory.… Expand"}, {"name": "Tetris", "details_link": "https://www.metacritic.com/game/psp/tetris", "publisher": "EA Mobile", "release_date": "Oct  1 2009", "developers": ["EA Mobile"], "platforms": ["iPhone/iPad", "PSP"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Stacking", "General"], "meta_score": 85, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/3934aaf34b32edef544c8690535332de-98.jpg", "descriptions": "[PSP Minis]  Tetris on the PSP."}, {"name": "Final Fantasy XI", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-xi", "publisher": "Square Enix", "release_date": "Oct 28 2003", "developers": ["SquareSoft", "Square Enix"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/b8d660a64fdc6fd9b620958b4cb3eb36-98.jpg", "descriptions": "The world of Vana'diel stands at the brink of war. Three powerful nations, united in their plight against the beastmen forces, look to their last hope -- brave adventurers like you! Will the beastmen gain the upper hand, and thrust the once-peaceful Vana'diel into another war? Step into theThe world of Vana'diel stands at the brink of war. Three powerful nations, united in their plight against the beastmen forces, look to their last hope -- brave adventurers like you! Will the beastmen gain the upper hand, and thrust the once-peaceful Vana'diel into another war? Step into the world of Vana'diel and journey forth on grand adventures with players from all across the globe! Final Fantasy XI is the first online game in the award-winning FINAL FANTASY series. How you play is up to you, with limitless possibilities for adventure. Set out on your own to discover the countless secrets of Vana'diel, or form a party with your friends to purge the beastman forces and bring home sensational spoils! [Square Enix]… Expand"}, {"name": "Trine 2", "details_link": "https://www.metacritic.com/game/xbox-360/trine-2", "publisher": "Atlus", "release_date": "Dec 21 2011", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 85, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/8d0403d66d3e4d5ce3b7d9f8cbad0eff-98.jpg", "descriptions": "Trine 2 is the sequel to the 2009 downloadable PlayStation 3 and PC action platformer."}, {"name": "Valkyrie Profile: Lenneth", "details_link": "https://www.metacritic.com/game/playstation-5/valkyrie-profile-lenneth", "publisher": "Square Enix", "release_date": "Dec 22 2022", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5"], "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 85, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/f02a8f1db243e41668844ed8535b9020-98.jpg", "descriptions": "The Gods are at War.\rYou must gather the souls of fallen warriors and train them to fight at Odin's side. From the creators of STAR OCEAN The Second Story, Valkyrie Profile sets new standards for role playing games on the PlayStation game console.\r- Epic storyline set in the world of NorseThe Gods are at War.\rYou must gather the souls of fallen warriors and train them to fight at Odin's side. From the creators of STAR OCEAN The Second Story, Valkyrie Profile sets new standards for role playing games on the PlayStation game console.\r- Epic storyline set in the world of Norse mythology\r- Multiple endings and 50+ hours of gameplay.\r- Intricate character development.\r- Innovative combo-driven combat system.\r- Stunning hand-painted backdrops and animated visuals.\r- Spectacular special effects.… Expand"}, {"name": "Need for Speed Underground", "details_link": "https://www.metacritic.com/game/playstation-2/need-for-speed-underground", "publisher": "Electronic Arts", "release_date": "Nov 17 2003", "developers": ["EA Black Box"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/f65de51ea4134201054406017a5d4434-98.jpg", "descriptions": "Enter the world of urban street racing and high performance tuner cars with the latest title in the hit Need for Speed series: Need for Speed Underground. Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, building the ultimate street machine byEnter the world of urban street racing and high performance tuner cars with the latest title in the hit Need for Speed series: Need for Speed Underground. Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, building the ultimate street machine by earning cash to pay for custom body kits and a host of licensed car performance mods. But just creating a custom street racing machine will not get you to the top; it takes a certain amount of attitude and razor sharp driving skills to compete in the tough world of urban racing. A number of diverse events set in gritty, nighttime environments make up the heart of street competition. Players become complete street racers by perfecting skills in each event by nailing the perfect shift in drag racing and by putting their street cred on the line, racing through the city streets at all hours of the night. Prove you belong in the elite street racing circles, work your way up the underground rankings and take on the best of the best in each discipline. [Electronic Arts]… Expand"}, {"name": "Serious Sam: The Second Encounter", "details_link": "https://www.metacritic.com/game/pc/serious-sam-the-second-encounter", "publisher": "Gathering", "release_date": "Feb  4 2002", "developers": ["Croteam"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 85, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/eb7a5516b453555e3c3dc65bb9733783-98.jpg", "descriptions": "Sam is back in the all new Second Episode of his battles with his arch-enemy Mental! After finding the Sirian spacecraft in ancient Egypt, Sam \"Serious\" Stone hijacked it and headed for Mental himself! But this, sadly, was not to be, as Sam lost control of the the alien craft and crashSam is back in the all new Second Episode of his battles with his arch-enemy Mental! After finding the Sirian spacecraft in ancient Egypt, Sam \"Serious\" Stone hijacked it and headed for Mental himself! But this, sadly, was not to be, as Sam lost control of the the alien craft and crash landed in the South American mountains. Now, Surrounded by an even stronger army of Mental's evil forces, Sam is forced to battle his way towards Mental's fortress and put a stop once and for all to his plans of world domination. [Take 2]… Expand"}, {"name": "The Sims: Hot Date", "details_link": "https://www.metacritic.com/game/pc/the-sims-hot-date", "publisher": "EA Games", "release_date": "Nov 12 2001", "developers": ["Maxis"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 85, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/1bf87d18f6291616a072353995f3f91e-98.jpg", "descriptions": "Play matchmaker to your Sims and watch the sparks fly or fizzle. Get them out of the house and into the all-new downtown area where they?ll gossip over a candlelit dinner, buy gifts for their dates or just cruise the Strip in hopes of getting lucky. Will your Sims find true love or bePlay matchmaker to your Sims and watch the sparks fly or fizzle. Get them out of the house and into the all-new downtown area where they?ll gossip over a candlelit dinner, buy gifts for their dates or just cruise the Strip in hopes of getting lucky. Will your Sims find true love or be destined to a lifetime membership in the lonely hearts club? [Electronic Arts]… Expand"}, {"name": "American McGee's Alice", "details_link": "https://www.metacritic.com/game/pc/american-mcgees-alice", "publisher": "Electronic Arts", "release_date": "Dec  6 2000", "developers": ["Rogue Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 85, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/8bede1be82284be795eb11d66c20a1af-98.jpg", "descriptions": "When Alice answers a summons to return to Wonderland, she barely recognizes the place. From the fungal rot of the Mushroom Forest to the chemistry of the Mad Hatter's Domain, Wonderland festers to its core. Undaunted by the diseased ambiance and mortal danger that surround her, Alice mustWhen Alice answers a summons to return to Wonderland, she barely recognizes the place. From the fungal rot of the Mushroom Forest to the chemistry of the Mad Hatter's Domain, Wonderland festers to its core. Undaunted by the diseased ambiance and mortal danger that surround her, Alice must undo the chaos.  [Electronic Arts]… Expand"}, {"name": "Turok: Dinosaur Hunter", "details_link": "https://www.metacritic.com/game/nintendo-64/turok-dinosaur-hunter", "publisher": "Acclaim", "release_date": "Feb 28 1997", "developers": ["Iguana Entertainment"], "platforms": ["PC", "Nintendo 64"], "num_players": "1 Player", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 85, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/e2d7a904f763292ed9d6ae74d09cee4f-98.jpg", "descriptions": "The mantle has been passed. You've become Protector of the Earth. You are now Turok Dinosaur Hunter."}]