[{"name": "Disney's Stitch: Experiment 626", "details_link": "https://www.metacritic.com/game/playstation-2/disneys-stitch-experiment-626", "publisher": "Disney Interactive Studios", "release_date": "Jun 19 2002", "developers": ["High Voltage Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/0ba570306d6c5ba16ab56f516b412d74-98.jpg", "descriptions": "The game takes place before the Lilo & Stitch film begins, showing the massive space universe only hinted at in the movie. The player controls Stitch, using his powers to the fullest: climbing walls and ceilings, dashing with amazing speed, shooting up to four weapons at once (one in eachThe game takes place before the Lilo & Stitch film begins, showing the massive space universe only hinted at in the movie. The player controls Stitch, using his powers to the fullest: climbing walls and ceilings, dashing with amazing speed, shooting up to four weapons at once (one in each hand), flying with the jetpack, and swinging using the grapple gun. The game features several of the film's memorable characters, including Jumba, Gantu, and Grand Councilwoman.… Expand"}, {"name": "The Watchmaker (2001)", "details_link": "https://www.metacritic.com/game/pc/the-watchmaker-2001", "publisher": "Got Game Entertainment", "release_date": "Jun  1 2002", "developers": ["Trecision"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/33887dacca526a871183259f9144bfa2-98.jpg", "descriptions": "A taxi deposits Victoria and Darrel at the gates of a mysterious and imposing castle in present day Austria. Their assigned mission is to recover a device resembling a large pendulum. The device has been stolen by a fringe group of religious fanatics and is believed to be hidden in theA taxi deposits Victoria and Darrel at the gates of a mysterious and imposing castle in present day Austria. Their assigned mission is to recover a device resembling a large pendulum. The device has been stolen by a fringe group of religious fanatics and is believed to be hidden in the castle. The pendulum's ability to maximize the earth?s energy, coupled with a rapidly approaching solar eclipse, now poses a serious threat to human survival. Victoria and Darrel must find the pendulum and stop it before midnight to avoid a catastrophe of potentially global consequences. [Got Game]… Expand"}, {"name": "Disney's Tarzan Untamed", "details_link": "https://www.metacritic.com/game/playstation-2/disneys-tarzan-untamed", "publisher": "Ubisoft", "release_date": "Nov 14 2001", "developers": ["Ubisoft"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/2e3e2b2631920cea5200e4739a7b00cb-98.jpg", "descriptions": "Tarzan?s peaceful world falls under siege as a mad Victorian scientist and vicious poachers descend upon the jungle to brutally capture his animal allies. As the primal action hero Tarzan, you must rely on your raw animal instinct and extreme action skills to maneuver through the denseTarzan?s peaceful world falls under siege as a mad Victorian scientist and vicious poachers descend upon the jungle to brutally capture his animal allies. As the primal action hero Tarzan, you must rely on your raw animal instinct and extreme action skills to maneuver through the dense jungle and rescue your animal friends. [Ubi Soft]… Expand"}, {"name": "Tomb Raider: Chronicles", "details_link": "https://www.metacritic.com/game/dreamcast/tomb-raider-chronicles", "publisher": "Eidos Interactive", "release_date": "Nov 19 2000", "developers": ["Core Design Ltd."], "platforms": ["PC", "Dreamcast"], "genres": ["Action Adventure", "Modern"], "meta_score": 59, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/8b6f8ee9f31297b48af2747ae400020a-98.jpg", "descriptions": "Tomb Raider: Chronicles reveals four newly discovered, and previously untold adventures, taking you on a journey from the ruins of Rome, to the bowels of a German U boat, to the rooftops of a hi-tech city in a search of four ancient artifacts.\r In light of Lara's recent disappearance,Tomb Raider: Chronicles reveals four newly discovered, and previously untold adventures, taking you on a journey from the ruins of Rome, to the bowels of a German U boat, to the rooftops of a hi-tech city in a search of four ancient artifacts.\r In light of Lara's recent disappearance, those closest to her gather together at the Croft Estate on a gray, rainy day for a memorial service in her honor. Afterwards, the friends sit quietly together in the study of the Croft Mansion and provide new insights about Lara's past exploits; exploits that have until now remained a secret... … Expand"}, {"name": "The Adventures of Tintin: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/the-adventures-of-tintin-the-game", "publisher": "Ubisoft", "release_date": "Dec  6 2011", "developers": ["Ubisoft Montpellier"], "platforms": ["3DS", "PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/6fe7f3d3801b1007c1eac156d8c5b3f2-98.jpg", "descriptions": "The Adventures of Tintin is a game based off its movie counterpart."}, {"name": "Chibi-Robo! Zip Lash", "details_link": "https://www.metacritic.com/game/3ds/chibi-robo!-zip-lash", "publisher": "Nintendo", "release_date": "Oct  9 2015", "developers": ["Nintendo", "Skip Ltd."], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/ee23101c4e6fc0b231fd62cd0c29505f-98.jpg", "descriptions": "In this side-scrolling game, Chibi-Robo uses his plug and cord to whip enemies, grapple onto ledges, and swing across chasms. Power-up the plug and cord to search for collectables and explore previously out of reach areas."}, {"name": "How to Survive", "details_link": "https://www.metacritic.com/game/xbox-360/how-to-survive", "publisher": "505 Games", "release_date": "Oct 23 2013", "developers": ["EKO Software"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/50fdf900798ffc93f83cd730d3c1be4d-98.jpg", "descriptions": "Featuring a robust crafting system, unique survival guide and a host of playable characters, How to Survive strands players on a remote archipelago off the coast of Colombia in the aftermath of an unexplained accident...but you're not alone. In order to survive, you must fulfill the mostFeaturing a robust crafting system, unique survival guide and a host of playable characters, How to Survive strands players on a remote archipelago off the coast of Colombia in the aftermath of an unexplained accident...but you're not alone. In order to survive, you must fulfill the most basic of needs - seeking out food, water and shelter, as well as crafting dozens of tools and weapons from fishing rods to Molotov cocktails. Players can also team up with other survivors in local and online multiplayer story and challenge modes to take on a growing array of the infected.… Expand"}, {"name": "Star Wars: The Force Unleashed II", "details_link": "https://www.metacritic.com/game/pc/star-wars-the-force-unleashed-ii", "publisher": "LucasArts", "release_date": "Oct 26 2010", "developers": ["LucasArts"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/71e2376c57a397ef60784e127a734c2e-98.jpg", "descriptions": "With Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IVWith Star Wars: The Force Unleashed II, the epic story continues as players once again assume the role of the devastatingly powerful Starkiller - Darth Vader's secret apprentice set during the largely unexplored era between Star Wars: Episode III Revenge of the Sith and Star Wars: Episode IV A New Hope.… Expand"}, {"name": "Dark Void", "details_link": "https://www.metacritic.com/game/xbox-360/dark-void", "publisher": "Capcom", "release_date": "Jan 19 2010", "developers": ["Airtight Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 59, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/8/59de6ead1c0b96b6b1d8a4484f32f620-98.jpg", "descriptions": "Dark Void is a sci-fi action-adventure game that combines an adrenaline-fuelled blend of aerial and on-foot combat set in a parallel universe called \"The Void\". Players assume the role of Will; a pilot dropped into incredible circumstances while on a routine air cargo flight crashes in theDark Void is a sci-fi action-adventure game that combines an adrenaline-fuelled blend of aerial and on-foot combat set in a parallel universe called \"The Void\". Players assume the role of Will; a pilot dropped into incredible circumstances while on a routine air cargo flight crashes in the Bermuda triangle leading him to be trapped in the Void. This unlikely hero soon finds himself swept into a desperate struggle for survival at the head of a group called The Survivors. Trapped in the Void, these resistance fighters are battling to hold off a mysterious alien race that plans to threaten Earth. Dark Void's unique combination of in-air and on-ground combat creates a thrilling new gameplay dynamic to the third-person shooter experience. Taking 3D action to a whole new level, Dark Void's vertical combat system allows players to dangle from thousand foot drops as they take cover and drop enemies from above and below, bringing a whole new sense of vulnerability and thrill to the player. Defying gravity in vertical combat is only half the battle as, over time, Will is upgraded to a powerful rocket pack which allows for fierce in-air combat as gamers are able to fly through the void at unparallel speeds shooting down anything that gets in their path. Blasting away at massive bosses has never been this much fun as Dark Void offers a unique grip system made up of a variety of grip-based mini-games including skyjacking UFOs mid-flight. [Capcom]… Expand"}, {"name": "Disney Epic Mickey 2: The Power of Two", "details_link": "https://www.metacritic.com/game/playstation-3/disney-epic-mickey-2-the-power-of-two", "publisher": "Disney Interactive Studios", "release_date": "Nov 18 2012", "developers": ["Blitz Games Studios"], "platforms": ["PC", "PlayStation Vita", "Wii U", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/3/e7613b10a30c47f0c5220c38878cb6cb-98.jpg", "descriptions": "In Disney Epic Mickey 2: The Power of Two, gamers play as Mickey Mouse and Oswald the Lucky Rabbit, Walt Disney's 1st cartoon star, in an all-new co-op adventure."}, {"name": "Sniper: Ghost Warrior 3", "details_link": "https://www.metacritic.com/game/pc/sniper-ghost-warrior-3", "publisher": "City Interactive", "release_date": "Apr 25 2017", "developers": ["City Interactive"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/96075ba3152f5f0dedf9526f3c0e2813-98.jpg", "descriptions": "Go behind enemy lines with the ultimate modern military shooter. Choose your missions across an unforgiven open world.\r Stay low and leave no traces in this third game of the tactical shooter franchise. Set in a modern day conflict based in Eastern Europe, players in Sniper: Ghost WarriorGo behind enemy lines with the ultimate modern military shooter. Choose your missions across an unforgiven open world.\r Stay low and leave no traces in this third game of the tactical shooter franchise. Set in a modern day conflict based in Eastern Europe, players in Sniper: Ghost Warrior 3 will be thrust into the role of a sniper caught between three warring factions, played out in a realistic and immersive environment. Dig deep into the Ghost Warrior DNA as you choose between taking out your targets up close or from a distance, while at the same time focusing on your survival through evasion and stealth. Non-linear, sandbox-style gameplay on large open-ended maps gives players the flexibility to play and replay the missions in a number of different ways. Sniper: Ghost Warrior 3 will offer intriguing challenges for tactically-minded gamers, while still remaining accessible to first-person shooter fans.… Expand"}, {"name": "Shaman King: Legacy of the Spirits, Soaring Hawk", "details_link": "https://www.metacritic.com/game/game-boy-advance/shaman-king-legacy-of-the-spirits-soaring-hawk", "publisher": "Konami", "release_date": "Feb  8 2005", "developers": ["KCEJ"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/bd38792a8c1415762b31873350ede93a-98.jpg", "descriptions": "Assume the role of Yoh Asakura in the ultimate quest to become Shaman King. Strategically change spirits during battles and use special items to defeat and capture your opponents. Build the strongest spirit party by gathering an array of spirits to prepare for the ultimate challenge.Assume the role of Yoh Asakura in the ultimate quest to become Shaman King. Strategically change spirits during battles and use special items to defeat and capture your opponents. Build the strongest spirit party by gathering an array of spirits to prepare for the ultimate challenge. Features more than 1,000 types of spirits.… Expand"}, {"name": "Arc the Lad: End of Darkness", "details_link": "https://www.metacritic.com/game/playstation-2/arc-the-lad-end-of-darkness", "publisher": "Namco", "release_date": "Jun 14 2005", "developers": ["Cattle Call"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 59, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/a9e065354fe13fbce944de61887b14c4-98.jpg", "descriptions": "(Also known as \"Arc the Lad Generation\" in Japan)  Arc the Lad: End of Darkness takes place five years after, yet in the same world as Arc the Lad: Twilight of the Spirits. Players take the role of Edda, a young man whose youth is marked by a \"boring island life\". His serenity is shattered,(Also known as \"Arc the Lad Generation\" in Japan)  Arc the Lad: End of Darkness takes place five years after, yet in the same world as Arc the Lad: Twilight of the Spirits. Players take the role of Edda, a young man whose youth is marked by a \"boring island life\". His serenity is shattered, however, when he meets Kirika, a rude young woman, on the beach. Shortly after, Edda tries to help a hunter capture vicious criminals, but the latter gets killed. Edda notices Kirika standing nearby, and his suspicions begin to grow about the mysterious young woman. Edda who has awakened as a full-fledged exorcist becomes a hunter himself, and realizing a sense of responsibility to save the weakened world, he sets out on a remarkable journey that will ultimately pit civilization against nature. [Namco]… Expand"}, {"name": "Immortal Legacy: The Jade Cipher", "details_link": "https://www.metacritic.com/game/playstation-4/immortal-legacy-the-jade-cipher", "publisher": "Viva Games", "release_date": "Apr 16 2019", "developers": ["Viva Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/29fd8d91e64a333ae0e9cb6eb12ce378-98.jpg", "descriptions": "The search for immortality is just one reason that brings you to Yingzhou Island, located deep in the Dragon’s Triangle. Playing as ex-special forces soldier Tyre, you’re also here to discover the truth behind your mother’s mysterious death. Finding out how that event and her enigmatic pastThe search for immortality is just one reason that brings you to Yingzhou Island, located deep in the Dragon’s Triangle. Playing as ex-special forces soldier Tyre, you’re also here to discover the truth behind your mother’s mysterious death. Finding out how that event and her enigmatic past are tied to the secrets that lie at the heart of the island will see you battle through not only a mercenary army sent in to excavate it, but the horrors they’ve unwittingly set free. … Expand"}, {"name": "Feist", "details_link": "https://www.metacritic.com/game/xbox-one/feist", "publisher": "Finji", "release_date": "Dec 13 2016", "developers": ["Finji"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/1640f5055711920e6d6d8f469a81acc6-98.jpg", "descriptions": null}, {"name": "Spectral Force 3", "details_link": "https://www.metacritic.com/game/xbox-360/spectral-force-3", "publisher": "Atlus", "release_date": "Jul 29 2008", "developers": ["Xpec"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 59, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/4f71f9ce80cddacdda206be98760844c-98.jpg", "descriptions": "Magic Era: 996. The ten kingdoms of the land, seizing the opportunity provided by Overlord Janus's death, are attempting to unify the continent under their own banners. This is the beginning of the Great Neverland War. In order to bolster their defenses, kingdoms have begun hiring mercenaryMagic Era: 996. The ten kingdoms of the land, seizing the opportunity provided by Overlord Janus's death, are attempting to unify the continent under their own banners. This is the beginning of the Great Neverland War. In order to bolster their defenses, kingdoms have begun hiring mercenary units. As new members of the Norius Mercenaries, you and your friend Diaz are eager to prove yourselves. When the squad's commander Judo is mortally wounded in battle, the mantle of leadership is entrusted to you, and so the adventure begins. The long-running strategy RPG series enters the next generation of gaming. Over 50 hours of gameplay spanning more than 150 challenging missions. Up to 40 different characters to recruit into your party, each with their own unique individual attacks. Craft Your Items – collect and assemble different components to form new accessories. [Atlus USA]… Expand"}, {"name": "KrissX", "details_link": "https://www.metacritic.com/game/xbox-360/krissx", "publisher": "Konami", "release_date": "Jan 27 2010", "developers": ["Regolith Games ltd"], "platforms": ["PC", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Logic", "General"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/54be41159357af15c335de28f7c9ca6b-98.jpg", "descriptions": "[Xbox Live Arcade]  Join Wordsworth the Owl on his mission to solve \"KrissX\"-ed word puzzles, for the first time on Xbox LIVE Arcade! Switch around letters to complete mind boggling terms and use helpful hints to achieve reward badges and high scores. Venture through 150 colorful stages,[Xbox Live Arcade]  Join Wordsworth the Owl on his mission to solve \"KrissX\"-ed word puzzles, for the first time on Xbox LIVE Arcade! Switch around letters to complete mind boggling terms and use helpful hints to achieve reward badges and high scores. Venture through 150 colorful stages, time yourself, or play at your leisure for hours on end. Uncover thousands of different word puzzles and test your skills in quick thinking, trivia, and knowledge! [Xbox.com]… Expand"}, {"name": "Winnie the Pooh's Rumbly Tumbly Adventure", "details_link": "https://www.metacritic.com/game/gamecube/winnie-the-poohs-rumbly-tumbly-adventure", "publisher": "Ubisoft", "release_date": "Feb  8 2005", "developers": ["Phoenix Games Studio"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/509f1cd712cf2bd92d8f336c8b936725-98.jpg", "descriptions": "Join Winnie the Pooh and his friends on five birthday-themed adventures. In Winnie the Pooh Rumbly Tumbly Adventures, you can play as Tigger, Piglet, Eeyore, and Winnie the Pooh. Find as many honey pots as you can, but beware of the mischievous Heffalumps and Woozles, who steal honey.Join Winnie the Pooh and his friends on five birthday-themed adventures. In Winnie the Pooh Rumbly Tumbly Adventures, you can play as Tigger, Piglet, Eeyore, and Winnie the Pooh. Find as many honey pots as you can, but beware of the mischievous Heffalumps and Woozles, who steal honey. Whether you're finding a new house for Eeyore or helping Tigger out of a sticky situation, you'll experience all the adventures of Pooh and his friends in the Hundred Acre Wood.… Expand"}, {"name": "SBK Superbike World Championship", "details_link": "https://www.metacritic.com/game/playstation-3/sbk-superbike-world-championship", "publisher": "Crave", "release_date": "Mar 10 2009", "developers": ["Milestone S.r.l"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Simulation", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/1/d3d9fc362016041053327353b83b13cc-98.jpg", "descriptions": "Pick up and play arcade mode allowing the player to access the race in just a few seconds. A genuinely technically accurate extreme simulation mode for real petrol heads. 4 well balanced racing styles giving genuine progression and satisfaction to the gamer. 6 game modes - Basic, Arcade,Pick up and play arcade mode allowing the player to access the race in just a few seconds. A genuinely technically accurate extreme simulation mode for real petrol heads. 4 well balanced racing styles giving genuine progression and satisfaction to the gamer. 6 game modes - Basic, Arcade, Advanced, Simulation, Extreme and Custom. Next generation giving players the chance to challenge their friends and opponents all over the world. [Black Bean Games]… Expand"}, {"name": "Kong: The 8th Wonder of the World", "details_link": "https://www.metacritic.com/game/game-boy-advance/kong-the-8th-wonder-of-the-world", "publisher": "Ubisoft", "release_date": "Nov 21 2005", "developers": ["Ubisoft"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/45af4090ddf31adee6719e65b6260105-98.jpg", "descriptions": "Solve challenging puzzles as you play Jack, Ann, and Carl. Battle planes, tanks, and more as the colossal beast King Kong. Survive savage creature battles deep in the perilous jungle. Includes Bonus Map."}, {"name": "Phantasy Star Universe", "details_link": "https://www.metacritic.com/game/pc/phantasy-star-universe", "publisher": "Sega", "release_date": "Oct 24 2006", "developers": ["Sonic Team"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "6  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/de5ed4b9620cbd559b8b72e1d0271180-98.jpg", "descriptions": "Phantasy Star Universe offers two complete RPG experiences - a single-player action adventure spanning multiple planets, and a robust online multi-player component. The game offers long-time fans the epic experience they have been clamoring for. The solo adventure features more than 40 hoursPhantasy Star Universe offers two complete RPG experiences - a single-player action adventure spanning multiple planets, and a robust online multi-player component. The game offers long-time fans the epic experience they have been clamoring for. The solo adventure features more than 40 hours of gameplay, an emotionally engaging story, traditional cut scenes, and strong character development. The title's hero is Ethan Waber, a 17-year old cadet intent on saving his sister, who is living on a planet under siege by mysterious life forces called THE SEED. In Online Mode, players are given the opportunity to create their own characters from a range of races, and they get to explore all three planets in the Grarl solar system. Fans can travel with a squad of other adventurers, enter urban sprawls teeming with hundreds of other players, and build their avatars into powerful warriors. [Sega]… Expand"}, {"name": "Mario Party: The Top 100", "details_link": "https://www.metacritic.com/game/3ds/mario-party-the-top-100", "publisher": "Nintendo", "release_date": "Nov 10 2017", "developers": ["Nintendo", "Nd Cube"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/b6fd6b626389650b6f0159015221ef68-98.jpg", "descriptions": "Test your memory, speed, and luck in a variety of multiplayer minigame types. With Download Play, up to 4 players can party on their own system with just 1 Game Card. This time the fun comes faster, thanks to some fresh features, including a Favorites option for quicker minigame selectionTest your memory, speed, and luck in a variety of multiplayer minigame types. With Download Play, up to 4 players can party on their own system with just 1 Game Card. This time the fun comes faster, thanks to some fresh features, including a Favorites option for quicker minigame selection and streamlined instructions. Start playing and pretty soon you'll find there's only enough room for the best at this funfest. [Nintendo]… Expand"}, {"name": "Frantix: A Puzzle Adventure", "details_link": "https://www.metacritic.com/game/psp/frantix-a-puzzle-adventure", "publisher": "Sony Online Entertainment", "release_date": "Sep 19 2005", "developers": ["Killer Game"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 59, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/8322cace90cdec5fa7c3d48d55705db5-98.jpg", "descriptions": "Frantix is one of the first character-based 3D puzzle-solving adventures for the PSP system. Frantix offers frenzied puzzle-solving action, beautiful 3D graphics, more than 150 challenging levels for players to enjoy, power pick-ups, and a diverse array of monsters and unique obstacles. TheFrantix is one of the first character-based 3D puzzle-solving adventures for the PSP system. Frantix offers frenzied puzzle-solving action, beautiful 3D graphics, more than 150 challenging levels for players to enjoy, power pick-ups, and a diverse array of monsters and unique obstacles. The game features quick-paced action, surreal environments and challenging levels with deadly traps and dangerous hazards for a fun and captivating gameplay experience. [Sony Online Entertainment]… Expand"}, {"name": "Curved Space", "details_link": "https://www.metacritic.com/game/playstation-5/curved-space", "publisher": "Maximum Games", "release_date": "Jun 29 2021", "developers": ["Only By Midnight"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/4/a0bcb87480c8759d2d21617a9cf20fd0-98.jpg", "descriptions": "Curved Space is an intense arcade-style twin-stick shooter that takes the classic formula and plunges it into the weirdest reaches of space. Battle cosmic space-invading spiders across curved landscapes where bullets hug the terrain while the horizon drops sharply out of sight."}, {"name": "THE SHORE", "details_link": "https://www.metacritic.com/game/pc/the-shore", "publisher": "Ares Dragonis", "release_date": "Feb 19 2021", "developers": ["Ares Dragonis"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 59, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/401769bade41500b77249decdc825b0c-98.jpg", "descriptions": "THE SHORE is a first person story driven game with an atmospheric environment and narrations, You will encounter mysterious creatures and unravel the secrets behind them. Strong elements of horror, struggle to survive an unknown world that will make you question your own sanity."}, {"name": "Blair Witch", "details_link": "https://www.metacritic.com/game/switch/blair-witch", "publisher": "Bloober Team", "release_date": "Jun 25 2020", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/2ac0b2ebaf6b55328f60137c430b5b04-98.jpg", "descriptions": "Your darkest fears will awaken in these woods.It's 1996. A young boy disappears in the Black Hills Forest near Burkittsville, Maryland. As Ellis, a former police officer with a troubled past, you join the search. What starts as an ordinary investigation soon turns into an endless nightmareYour darkest fears will awaken in these woods.It's 1996. A young boy disappears in the Black Hills Forest near Burkittsville, Maryland. As Ellis, a former police officer with a troubled past, you join the search. What starts as an ordinary investigation soon turns into an endless nightmare as you confront your fears and the Blair Witch, a mysterious force that haunts the woodsBlair Witch is a first-person, story-driven psychological horror game based on the cinematic lore of Blair Witch.A STORY OF THE HUMAN DESCENT INTO DARKNESSFrom the creative minds behind the critically acclaimed Layers of Fear, experience first-hand the toll that fear can take on the mind in an original story inspired by the cinematic lore of Blair Witch.FIND THE WAY THROUGH THE HAUNTED WOODSWith just your loyal dog Bullet by your side, navigate your way through a cursed forest that warps and distorts both time and space.YOUR SANITY AGAINST HER CURSEStand against the horrors of the Blair Witch and the decaying sanity of a man burdened by his past.HOW WILL YOU FACE YOUR FEARS?As you delve deeper into the woods, how you react to danger and behave under pressure will ultimately teach you more about yourself.… Expand"}, {"name": "Subject 13", "details_link": "https://www.metacritic.com/game/pc/subject-13", "publisher": "Microids", "release_date": "May 28 2015", "developers": ["Paul Cuisset"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/df27c13002e68ec462e77f729b3cb0e0-98.jpg", "descriptions": "Assume the role of Franklin Fargo, an unassuming physics professor who has led a bitter existence ever since his fiancée died in a holdup in which he was intended to be the victim. One morning, he wakes up in the middle of an abandoned scientific facility. His only link with the outsideAssume the role of Franklin Fargo, an unassuming physics professor who has led a bitter existence ever since his fiancée died in a holdup in which he was intended to be the victim. One morning, he wakes up in the middle of an abandoned scientific facility. His only link with the outside world is a voice that calls him \"Subject 13\". … Expand"}, {"name": "Fantasy Hero: Unsigned Legacy", "details_link": "https://www.metacritic.com/game/playstation-vita/fantasy-hero-unsigned-legacy", "publisher": "Arc System Works", "release_date": "Dec  2 2014", "developers": ["Arc System Works"], "platforms": ["Switch", "PlayStation Vita"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/3458dfde4dcaa91597797b5a7b21aa2d-98.jpg", "descriptions": "The game is an action Role-Playing Game through which your character scraps with monsters that have overtaken the globe. The game features local co-op and features 4 assumable characters, each sporting a unqiue play style."}, {"name": "Mass Effect 3: From Ashes", "details_link": "https://www.metacritic.com/game/xbox-360/mass-effect-3-from-ashes", "publisher": "Electronic Arts", "release_date": "Mar  6 2012", "developers": ["BioWare"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 59, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/6/81a6505279405e62e08b76be9ad2fd58-98.jpg", "descriptions": "Unearth lost secrets from the past and recruit the Prothean squad member in The Prothean Pack. Also includes a new appearance for each squad member. NOTE: Collectors Edition copies of Mass Effect 3 include a code for this content. [Xbox.com]"}, {"name": "Mobile Light Force 2", "details_link": "https://www.metacritic.com/game/playstation-2/mobile-light-force-2", "publisher": "XS Games", "release_date": "Mar 19 2003", "developers": ["Alfa System"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Scrolling"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/75132fde823e0da0d0a42f55becd3184-98.jpg", "descriptions": "Find and destroy the murderers! Use your special attack or launch an all out aerial assault. Take survival into your control! Each level has a tougher enemy foe and the highest score defeats them."}, {"name": "Godfall", "details_link": "https://www.metacritic.com/game/pc/godfall", "publisher": "Gearbox Publishing", "release_date": "Nov 19 2020", "developers": ["Counterplay Games"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "Up to 3 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/8/d65fced10724379766ce5075a2723d08-98.jpg", "descriptions": "Save Aperion. You are the last of the Valorian knights, masters of combat equipped with legendary armor called Valorplates. Ascend in Godfall, a first-of-its-kind, looter-slasher, melee action-RPG."}, {"name": "Late Shift", "details_link": "https://www.metacritic.com/game/playstation-4/late-shift", "publisher": "Wales Interactive", "release_date": "Apr 18 2017", "developers": ["Wales Interactive"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 59, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/66206af19b8485c2bc605b7c04132bf6-98.jpg", "descriptions": "Late Shift is a high stakes FMV crime thriller. Forced into a brutal London heist, you must choose your own adventure in this interactive cinematic experience with adaptable storylines that lead to one of seven conclusions. Your decisions are you."}, {"name": "Saint Seiya: Soldiers' Soul", "details_link": "https://www.metacritic.com/game/playstation-4/saint-seiya-soldiers-soul", "publisher": "Bandai Namco Games", "release_date": "Oct  6 2015", "developers": ["Dimps Corporation"], "platforms": ["PC", "PlayStation 3", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/09209bae25cf08d9e81bb2789648c346-98.jpg", "descriptions": "Follow the adventures of your favorite characters through all the chapters of the manga, from the Twelve Zodiac Temples to Hades dark kingdom. And for the first time ever, travel to the frozen land of Asgard to defeat Polaris Hilda and her mighty army of God Warriors."}, {"name": "Bionicle Heroes", "details_link": "https://www.metacritic.com/game/pc/bionicle-heroes", "publisher": "Eidos Interactive", "release_date": "Nov 14 2006", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "First-Person", "Third-Person", "Arcade"], "meta_score": 59, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/f61bb404278af78bbdb6e925c259e971-98.jpg", "descriptions": "Bionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by masteringBionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by mastering the powers and special abilities of the greatest Bionicle heroes will he be able to overcome the many challenges ahead. [Eidos Interactive]… Expand"}, {"name": "Saw", "details_link": "https://www.metacritic.com/game/playstation-3/saw", "publisher": "Konami", "release_date": "Oct  6 2009", "developers": ["Zombie Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/a7fab3b3ad09f0fc3bc377d25ea0c528-98.jpg", "descriptions": "Jigsaw has killed your partner and destroyed your life.  Now he has trapped you in an abandoned insane asylum that he alone controls. If you can defeat his brutal traps and survive, you may just discover the truth behind what drives this twisted serial killer. SAW is a third-personJigsaw has killed your partner and destroyed your life.  Now he has trapped you in an abandoned insane asylum that he alone controls. If you can defeat his brutal traps and survive, you may just discover the truth behind what drives this twisted serial killer. SAW is a third-person perspective, survival horror game based on the SAW film franchise.  The game features many of the deadly mechanical traps seen in the film, as well as terrifying new ones. Players pit their wits against Jigsaw as they navigate his world in an attempt to evade and escape his gruesome traps, while also struggling against his minions in brutal combat by using weapons found within the environment. SAW, the video game, is based on a treatment from Zombie Studios and the creators of the SAW franchise, Leigh Whannell and James Wan. The timeline for the game takes place between the movies: SAW and SAW II, giving the game its own story, yet fitting within the narratives of the movies.  The story centers on Detective David Tapp who awakens in a decrepit, abandoned asylum.  He has been captured by his longtime nemesis, Jigsaw. Obsessed with catching this serial killer, Tapp’s mission has consumed him and ruined his family, resulting in divorce, mental imbalance, and abandonment. Worse yet, this frantic hunt destroyed Tapp’s career while he watched his long-time friend and partner get killed by one of Jigsaw’s traps.  Now Jigsaw has the upper hand and has captured the detective. Tapp must play a deadly game - the likes of which he has been investigating for years - to escape, and in order to do so he must survive the lethal traps and puzzles that Jigsaw has put in place for him and others. But each victim has a dark connection to Tapp. Will Tapp save them? Can he survive his obsession to find the Jigsaw killer? [Konami]… Expand"}, {"name": "Worms Ultimate Mayhem", "details_link": "https://www.metacritic.com/game/xbox-360/worms-ultimate-mayhem", "publisher": "Team17", "release_date": "Sep 28 2011", "developers": ["Team17"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "Turn-Based", "General", "General", "Artillery"], "meta_score": 59, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/3d3c592e37dc4b3c1c71d0f79031ae75-98.jpg", "descriptions": "Worms Ultimate Mayhem is a souped-up, re-vamped, high definition reimagining of Worms 3D and Worms 4: Mayhem, bringing both games together in one incredibly over-stuffed, over-the-top package for Xbox 360 from Xbox LIVE, for PlayStation 3 from  Playstation Network and also for PC from Steam.Worms Ultimate Mayhem is a souped-up, re-vamped, high definition reimagining of Worms 3D and Worms 4: Mayhem, bringing both games together in one incredibly over-stuffed, over-the-top package for Xbox 360 from Xbox LIVE, for PlayStation 3 from  Playstation Network and also for PC from Steam. Including all of the content from the original games, Worms Ultimate Mayhem also brings a whole host of anarchic additions ï¿½ more single player missions, more puzzles, more customisation, more worms!… Expand"}, {"name": "Final Fantasy Crystal Chronicles: Remastered Edition", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-crystal-chronicles-remastered-edition", "publisher": "Square Enix", "release_date": "Aug 27 2020", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/21ed49c7465afcd9d35b680216e1c1a6-98.jpg", "descriptions": "The Return of a MasterpieceFINAL FANTASY CRYSTAL CHRONICLES is back and more beautiful than ever on Nintendo Switch and PlayStation 4, fifteen years after the classic original.\n\nFINAL FANTASY CRYSTAL CHRONICLES Remastered Edition follows a young group, known as the Crystal Caravans, asThe Return of a MasterpieceFINAL FANTASY CRYSTAL CHRONICLES is back and more beautiful than ever on Nintendo Switch and PlayStation 4, fifteen years after the classic original.FINAL FANTASY CRYSTAL CHRONICLES Remastered Edition follows a young group, known as the Crystal Caravans, as they embark on an epic journey to search for myrrh, a precious and rare liquid needed to cleanse and maintain a crystal protecting their world from the deadly gas, miasma.Team up with faraway friends to take down fearsome foes! Enlist comrades to your crystal caravan in an online multiplayer mode for up to four players.… Expand"}, {"name": "Samurai Jack: The Shadow of Aku", "details_link": "https://www.metacritic.com/game/playstation-2/samurai-jack-the-shadow-of-aku", "publisher": "Sega", "release_date": "Mar 24 2004", "developers": ["Adrenium"], "platforms": ["iPhone/iPad", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 59, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/5fd3be673e8013a8ede70632f6f503fb-98.jpg", "descriptions": "Thrust into the future by the evil Aku, a lone Samurai warrior must quickly find the time portal to the past to rescue his defenseless people. Ancestors of the displaced Samurai call him \"Jack\" and help him through four enemy-filled realms with 24 interactive levels. Samurai Jack suffersThrust into the future by the evil Aku, a lone Samurai warrior must quickly find the time portal to the past to rescue his defenseless people. Ancestors of the displaced Samurai call him \"Jack\" and help him through four enemy-filled realms with 24 interactive levels. Samurai Jack suffers various states of undress if he fails to dodge fireballs and sword strikes, but slow-motion attacks, devastating combo moves, and sushi snacks empower the hearty warrior. Through a burning village, the bustling Aku City, and on, Jack blasts through doors, finds hidden pathways, and frees caged locals, bringing him ever closer to fulfilling his great destiny - the defeat of Aku once and for all. Defeat enemies with signature combat moves, plus three elemental Swords, Throwing Stars, and a Bow and Arrow. Defeat enemies with Sakai Mode (slow-motion action). Fight against well-known Samurai Jack foes such as Aku, the Scotsman, Mad Jack, and other unique enemies. Select from three difficulty levels to match your gameplay style. Contributions from the cartoon series creator, artists, voice actors, and composers create an authentic Samurai Jack experience. [Sega]… Expand"}, {"name": "Legends of Wrestling II", "details_link": "https://www.metacritic.com/game/gamecube/legends-of-wrestling-ii", "publisher": "Acclaim", "release_date": "Nov 26 2002", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/87c76280aed63e61969ecd8c77668f38-98.jpg", "descriptions": "Legends of Wrestling II takes you through the wrestling hall of fame with the top grapplers that are battling for squared-circle supremacy. Play as your favorite wrestler--including Hulk Hogan, Andre \"The Giant,\" and Bret \"Hitman\" Hart--each with signature entrances,Legends of Wrestling II takes you through the wrestling hall of fame with the top grapplers that are battling for squared-circle supremacy. Play as your favorite wrestler--including Hulk Hogan, Andre \"The Giant,\" and Bret \"Hitman\" Hart--each with signature entrances, taunts, and moves. A new storyline and career mode let you battle for the respect of promoters and fans while fighting for the heavyweight championship crown. The game also features tag-team tournaments, a $15,000 Body Slam Challenge, and a variety of match types.… Expand"}, {"name": "Namco Museum", "details_link": "https://www.metacritic.com/game/xbox/namco-museum", "publisher": "Namco", "release_date": "Oct  9 2002", "developers": ["Mass Media"], "platforms": ["PlayStation 2", "Switch", "Xbox"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/b8f77debfc658d3d807ace21cbf379a4-98.jpg", "descriptions": "All your favorite Namco classics are now in one package.  Namco Museum 1 includes Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, and Pole Position.  But the fun doesn't stop there, since Namco has added all new arrangement modes plus other hidden games.  Whether it's eating ghosts,All your favorite Namco classics are now in one package.  Namco Museum 1 includes Pac-Man, Ms. Pac-Man, Galaga, Galaxian, Dig Dug, and Pole Position.  But the fun doesn't stop there, since Namco has added all new arrangement modes plus other hidden games.  Whether it's eating ghosts, shooting aliens, digging a hole, or racing toward the finish line, the addictive gameplay of Namco Museum has proven it can stand the test of time.… Expand"}, {"name": "Stuart Little 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/stuart-little-2", "publisher": "Activision", "release_date": "Jul 12 2002", "developers": ["Creations"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/87b37d9c9b3c6bf5222c02db5b45b7e4-98.jpg", "descriptions": "Stuart's new best friend. Margalo, has disappeared, and so has Mrs. Little's wedding ring. As Stuart, it's up to you to solve both mysteries. One thing's for sure--you're in for non-sto fun in this high-flying adventure!"}, {"name": "Lethal Skies Elite Pilot: Team SW", "details_link": "https://www.metacritic.com/game/playstation-2/lethal-skies-elite-pilot-team-sw", "publisher": "Sammy Studios", "release_date": "May 31 2002", "developers": ["Bit Town"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Flight", "Modern Jet"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/be4b515af6ed74ef481f338b54ace26c-98.jpg", "descriptions": "Feel the adrenaline rush as you take off into uncharted skies! Players are thrust into non-stop action as an elite pilot of The International Alliance's Team SW. Choose from an array of fighters and battle the enemy all across the globe in numerous air-to-air and air-to-ground missions. InFeel the adrenaline rush as you take off into uncharted skies! Players are thrust into non-stop action as an elite pilot of The International Alliance's Team SW. Choose from an array of fighters and battle the enemy all across the globe in numerous air-to-air and air-to-ground missions. In Lethal Skies, the heart-pounding experience of flying a real-life warplane is yours to have.… Expand"}, {"name": "ESPN NBA 2Night 2002", "details_link": "https://www.metacritic.com/game/playstation-2/espn-nba-2night-2002", "publisher": "Konami", "release_date": "Feb 25 2002", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/ab3ecfbf0bc4882c27f3f9be22d3baa2-98.jpg", "descriptions": "Blow by defenders and drive through the lane by utilizing ESPN NBA 2Night's new turbo function. The game features new rim-shattering dunks and championship defense including backboard pins, blocked jump shots and steals in the open court. Includes commentary from Brent Musberger, ESPN'sBlow by defenders and drive through the lane by utilizing ESPN NBA 2Night's new turbo function. The game features new rim-shattering dunks and championship defense including backboard pins, blocked jump shots and steals in the open court. Includes commentary from Brent Musberger, ESPN's Stuart Scott, and 76ers point guard Eric Snow.… Expand"}, {"name": "Soldier of Fortune: Gold Edition", "details_link": "https://www.metacritic.com/game/playstation-2/soldier-of-fortune-gold-edition", "publisher": "Majesco Games", "release_date": "Nov 11 2001", "developers": ["Pipe Dream Interactive"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/f6820ee08c4730600c3e741deac0ebc3-98.jpg", "descriptions": "As John Mullins, decorated Vietnam Vet, you must use any means necessary to find and secure three stolen warheads. Track and stop the terrorist organization responsible for the theft before they can carry out their threat to national security. Dispatch as many terrorists, skinheads, andAs John Mullins, decorated Vietnam Vet, you must use any means necessary to find and secure three stolen warheads. Track and stop the terrorist organization responsible for the theft before they can carry out their threat to national security. Dispatch as many terrorists, skinheads, and enemy soldiers as necessary to complete your mission. [Majesco]… Expand"}, {"name": "Green Berets: Powered by Myth II", "details_link": "https://www.metacritic.com/game/pc/green-berets-powered-by-myth-ii", "publisher": "Take-Two Interactive", "release_date": "Jul 26 2001", "developers": ["Take-Two Interactive"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Strategy", "General", "General"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/0aa1979212faab3766f32b53d265a258-98.jpg", "descriptions": "A squad-based tactical strategy game set in the treacherous jungles of Southeast Asia. Carefully plan your surgical strike, blast your way through enemy camps, or sneak deep behind enemy lines. Destroy radio towers, defend bases, or eliminate high-ranking VC officers! Your objectives areA squad-based tactical strategy game set in the treacherous jungles of Southeast Asia. Carefully plan your surgical strike, blast your way through enemy camps, or sneak deep behind enemy lines. Destroy radio towers, defend bases, or eliminate high-ranking VC officers! Your objectives are clear, but your path will be dark and dangerous!  [Take 2 Interactive]… Expand"}, {"name": "Dino Crisis", "details_link": "https://www.metacritic.com/game/pc/dino-crisis", "publisher": "Capcom", "release_date": "Dec  4 2000", "developers": ["Capcom"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 59, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/82201404a01f7095efae8c1317af9535-98.jpg", "descriptions": "Though it has some startling moments and a few fun sections, it's mostly just a mediocre version of a mediocre game."}, {"name": "Hello Neighbor 2", "details_link": "https://www.metacritic.com/game/pc/hello-neighbor-2", "publisher": "tinyBuild", "release_date": "Dec  6 2022", "developers": ["tinyBuild", "Eerie Guest"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Open-World", "First-Person"], "meta_score": 59, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/4/0ca822899ae8bda60a90832d7beb94cd-98.jpg", "descriptions": "Hello Neighbor 2 is a stealth horror game where you’re being stalked by a mysterious creature as you try to track down Mr. Peterson (The Neighbor) who has disappeared after the events of the first game. Play against an advanced, self-learning AI that tracks and adapts to your every move.Hello Neighbor 2 is a stealth horror game where you’re being stalked by a mysterious creature as you try to track down Mr. Peterson (The Neighbor) who has disappeared after the events of the first game. Play against an advanced, self-learning AI that tracks and adapts to your every move. Raven Brooks is an ordinary suburb, yet oddly filled with too many ravens. Mysterious events are happening in the city, often resembling a Tim Burton-style nightmare. You play as a private investigator tracking down Mr. Peterson. You break into his abandoned house searching for clues, only to find a bizarre, bird-like looking creature inhabiting it. From there, you explore Raven Brooks in an open world, survival horror-style fashion while staying true to the roots of the original stealth horror theme.… Expand"}, {"name": "Surgeon Simulator CPR", "details_link": "https://www.metacritic.com/game/switch/surgeon-simulator-cpr", "publisher": "Bossa Studios", "release_date": "Sep 13 2018", "developers": ["Bossa Studios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 59, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/14ac9967c4e59d0dcc565f039d221dcc-98.jpg", "descriptions": "Didn’t fancy seven years at medical school? Skip straight to the operating table with the critically-acclaimed Surgeon Simulator CPR, fully revived and feeling better-than-ever on the Nintendo Switch. Now featuring all-new motion control functionality as well as local co-op play, it’s timeDidn’t fancy seven years at medical school? Skip straight to the operating table with the critically-acclaimed Surgeon Simulator CPR, fully revived and feeling better-than-ever on the Nintendo Switch. Now featuring all-new motion control functionality as well as local co-op play, it’s time to scrub up for the most immersive version yet of the infamous operation sim.… Expand"}, {"name": "Lost Sea", "details_link": "https://www.metacritic.com/game/playstation-4/lost-sea", "publisher": "EastAsiaSoft", "release_date": "Jul  4 2016", "developers": ["EastAsiaSoft"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Strategy", "Action Adventure", "General", "Survival"], "meta_score": 59, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/03e4d0fb9811198885fc6f622ce833f2-98.jpg", "descriptions": "Lost Sea is a 3D strategy-action game that takes place inside a procedurally generated archipelago. It's up to the player to form a ragtag crew of survivors and explore the surrounding islands as they hunt for the necessary resources to upgrade their ship and escape the Bermuda Triangle."}, {"name": "The Evil Within: The Executioner", "details_link": "https://www.metacritic.com/game/playstation-4/the-evil-within-the-executioner", "publisher": "Bethesda Softworks", "release_date": "May 25 2015", "developers": ["Tango Gameworks"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 59, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/f975e8a2d7907b5a80a524c3e2a524e7-98.jpg", "descriptions": "Experience firsthand the powerful force that is The Keeper in The Evil Within: The Executioner. This third and final add-on for The Evil Within places players in a series of battle arenas all from the first-person perspective of The Keeper. Initially armed with The Keepers signature hammer,Experience firsthand the powerful force that is The Keeper in The Evil Within: The Executioner. This third and final add-on for The Evil Within places players in a series of battle arenas all from the first-person perspective of The Keeper. Initially armed with The Keepers signature hammer, players will fight against a host of The Evil Withins iconic villains to earn new weapons and upgrades. Set in the Manor House of the Victoriano Estate, The Executioner features first-person melee combat combined with exploration and discovery as players unearth the story of a man forced to become The Keeper.… Expand"}, {"name": "Kyotokei", "details_link": "https://www.metacritic.com/game/wii/kyotokei", "publisher": "Microforum", "release_date": "Aug 11 2011", "developers": ["Microforum"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/b9cd137b1ffa167b80cb645138d20230-98.jpg", "descriptions": "The powerful witch Rika has invaded the peaceful realm of Estaria with an army of monsters! The magic brothers Kyo and Kei are the only ones who can stop her! Use your powerful aura of protection to absorb the enemy spells and unleash their power all at once! Travel through the dark swamps,The powerful witch Rika has invaded the peaceful realm of Estaria with an army of monsters! The magic brothers Kyo and Kei are the only ones who can stop her! Use your powerful aura of protection to absorb the enemy spells and unleash their power all at once! Travel through the dark swamps, cold mountains, dangerous caves full of lava and much more! Face Rika and free Estaria from her menace!… Expand"}, {"name": "WWE SmackDown vs. Raw 2008", "details_link": "https://www.metacritic.com/game/wii/wwe-smackdown-vs-raw-2008", "publisher": "THQ", "release_date": "Nov 13 2007", "developers": ["Yuke's"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/7f065c3a213199c67e47865be755dfd0-98.jpg", "descriptions": "WWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and naturalWWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and natural control over their WWE Superstars by using the game's popular analog controls. Realism and strategy are at the forefront, as players now control the amount of pressure they apply to their opponents. In addition, WWE SmackDown! vs. Raw 2008 features a significant Extreme Championship Wrestling (ECW) presence, including a variety of Superstars, arenas and weapons. The game is also packed with significant updates requested by fans, including new rosters, more environmental hotspots, a combined Season and General Manager Mode experience, improved out-of-ring action, enhanced online community support and much more. [THQ]… Expand"}, {"name": "The Godfather: Mob Wars", "details_link": "https://www.metacritic.com/game/psp/the-godfather-mob-wars", "publisher": "Electronic Arts", "release_date": "Sep 19 2006", "developers": ["Page 44 Studios"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Linear", "Open-World"], "meta_score": 59, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/c45275b5cbbb9a3e01f1e4f43a47fa2e-98.jpg", "descriptions": "The book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mobThe book by Mario Puzo and classic film by Paramount Pictures serve as inspiration for The Godfather, as gamers join the Corleone family and earn respect through loyalty and fear as they rise through the ranks to become Don in a living 1945-1955 New York. Gamers create their own mob character in the game, putting themselves into the action while reliving classic moments from the fiction and experiencing original missions alongside memorable characters from the film.  After a life of small-time jobs and petty thefts the player is accepted into the Corleone family, America's most famous criminal organization. It is up to the player to carry out orders, earn respect and make New York City their own. Featuring non-linear action-adventure gameplay, The Godfather offers gamers countless choices for solving the family’s problems with brutal violence, skillful diplomacy, or a cunning mixture of both. From mob hits and bank heists to drive-bys and extortion, step deep inside the world of The Godfather where intimidation and negotiation are your tickets to the top.  Players use their powers of loyalty and fear to earn respect through interactions with characters in the world.  Decisions made by the player in the game have lasting consequences, just as it was in the mob underworld featured in The Godfather fiction. James Caan, Robert Duvall, and the late Marlon Brando provided voice acting and likenesses for the game. [Electronic Arts]… Expand"}, {"name": "Platypus", "details_link": "https://www.metacritic.com/game/psp/platypus", "publisher": "MumboJumbo", "release_date": "Nov 17 2006", "developers": ["Squashy Software"], "platforms": ["iPhone/iPad", "PC", "PSP"], "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 59, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/e5c2614e2ef1f0f74bda41ee9e95f0cc-98.jpg", "descriptions": "Platypus, a side-scrolling shooter game, puts you right in the middle of the action with a unique visual presentation and addictive gameplay. Your mission is to guide your ship, \"PLATYPUS,\" through 30 challenging and action-packed levels. With unique, hand-molded 3D clay graphics,Platypus, a side-scrolling shooter game, puts you right in the middle of the action with a unique visual presentation and addictive gameplay. Your mission is to guide your ship, \"PLATYPUS,\" through 30 challenging and action-packed levels. With unique, hand-molded 3D clay graphics, electrifying power-ups and invading enemy forces, Platypus can be played by yourself or with a friend, adding a whole new dimension to the already exhilarating action. Whether played by rookies or hardcore gamers, Platypus presents an easily accessible yet hard to master game that shoots its way past the competition. [MumboJumbo]… Expand"}, {"name": "Ancient Wars: Sparta", "details_link": "https://www.metacritic.com/game/pc/ancient-wars-sparta", "publisher": "Eidos Interactive", "release_date": "Apr 24 2007", "developers": ["WorldForge"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic", "Command"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/c76c2034863d9388a68db4d28227bf71-98.jpg", "descriptions": "Anciet Wars: Sparta is based on the history of the ancient ages and their main nations. Spartans, Persians and Egyptians are fighting for influence around Little Asia, Europe and North Africa. Historical correct timeline is 700-300 BC and the action takes place with different campaigns forAnciet Wars: Sparta is based on the history of the ancient ages and their main nations. Spartans, Persians and Egyptians are fighting for influence around Little Asia, Europe and North Africa. Historical correct timeline is 700-300 BC and the action takes place with different campaigns for all three races. Sparta represents 3D strategy in real time with the new developed Ancient Wars Engine (AWE), where the player will have to use each nation’s powers to be superior over other competitors and build up a driving and ruling faction. The main emphasis is on large-scaled battles and complex tactical manoeuvres. Additional to this, a new method of army equipment is represented. Warriors can be equipped with weapons and shields, can be put on horses or on chariots and be given special abilities. The player can collect abandoned weapons after battles or import powerful weapons from other cultures to build more powerful and different special units. Additionally the forces of nature are very important, because fire, find etc. will affect the whole environment. Cities can be upgraded (e.g. turned to fortresses), workers gather resources to ensure the economic part. [Playlogic]… Expand"}, {"name": "Lucidity", "details_link": "https://www.metacritic.com/game/pc/lucidity", "publisher": "LucasArts", "release_date": "Oct  7 2009", "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 59, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/0/6bb19f9019d0bc34fd221beef1c5f95a-98.jpg", "descriptions": "[Downloadable Game]  From the team that re-imagined The Secret of Monkey Island, comes Lucidity, an addictive puzzle platformer set in the surreal childlike dreamscapes of the little girl Sofi. In this challenging puzzler, keep Sofi safe as she drifts deeper into the strange new world of her[Downloadable Game]  From the team that re-imagined The Secret of Monkey Island, comes Lucidity, an addictive puzzle platformer set in the surreal childlike dreamscapes of the little girl Sofi. In this challenging puzzler, keep Sofi safe as she drifts deeper into the strange new world of her dreams. Featuring stunning hand-illustrated visuals, a spellbinding original score and unique puzzle platformer gameplay, Lucidity challenges your wits, tests your reflexes, and mesmerizes your senses. A surreal fantasy: Take a trip into the surreal childlike dreamscapes of Sofi, a little girl filled with a persistent desire to explore new worlds and overcome all obstacles in her way. As she drifts into a vivid dream world where, beckoned by the kind words of her grandmother, she learns to overcome her fears, test your skills in this addictive puzzle platformer where through quick reactions and placement of unique puzzle pieces, you must create a path to help Sofi traverse safely through 27 visually stunning, hand-illustrated dreamscapes. Mesmerizing dreamscapes: Like a children's storybook come to life, get lost in mesmerizing dreamscapes detailed with beautiful hand-drawn contemporary art. Addictive puzzle-platformer gameplay: Skillfully place unique puzzle pieces designed to propel Sofi to and from suspended platforms, or over and under obstacles, in an effort to maintain her state of perpetual motion. [LucasArts]… Expand"}, {"name": "Cross of the Dutchman", "details_link": "https://www.metacritic.com/game/pc/cross-of-the-dutchman", "publisher": "Triangle Studios", "release_date": "Sep 10 2015", "developers": ["Triangle Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/ed30f230668983c2104bbf8528b5a108-98.jpg", "descriptions": "Cross of the Dutchman is an action-adventure game based on the folk legend of \"Grutte\" Pier Gerlofs Donia. In Cross of the Dutchman, you as the player take the role of Grutte Pier, a Frisian freedom fighter from the 16th century. On your journey you will encounter many challenges, andCross of the Dutchman is an action-adventure game based on the folk legend of \"Grutte\" Pier Gerlofs Donia. In Cross of the Dutchman, you as the player take the role of Grutte Pier, a Frisian freedom fighter from the 16th century. On your journey you will encounter many challenges, and experience the world of medieval Western Europe like no game before. Will you be able to live up to the legend and liberate Frisia?… Expand"}, {"name": "FIFA Street 2", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-street-2", "publisher": "EA Sports Big", "release_date": "Feb 28 2006", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 59, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/743cf0129f9d9ef53b913ea33e69e073-98.jpg", "descriptions": "Prove you have what it takes in four on four gameplay action which captures the passion and flair of real street soccer in this fresh arcade experience.  Humiliate your opponents with the new trick stick beat system, over the top juggling moves and all-new gamebreakers that allow you to winProve you have what it takes in four on four gameplay action which captures the passion and flair of real street soccer in this fresh arcade experience.  Humiliate your opponents with the new trick stick beat system, over the top juggling moves and all-new gamebreakers that allow you to win a game like never before. Beat the best in the world by traveling to new International locations ranging from the famous Westway Leisure Centre in London to the beautiful beachside of Brazil. Featuring all new authentic tricks, FIFA Street 2 provides new gameplay experiences by making over the top moves and skills even bigger in this fast paced sequel. Take to the streets, unleash your tricks, and humble your rivals with or without the ball. [Electronic Arts]… Expand"}, {"name": "Micro Machines World Series", "details_link": "https://www.metacritic.com/game/playstation-4/micro-machines-world-series", "publisher": "Codemasters", "release_date": "Jun 30 2017", "developers": ["Codemasters", "Just Add Water"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "General", "Arcade", "Automobile"], "meta_score": 59, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/4/0c8b3c9fe196557eda14c4569d212c0c-98.jpg", "descriptions": "Whether driving the Spy Car destroying a Hovercraft with a NERF Blaster in the Games Room, or the Dump Truck blowing up a Tank with a Dynamite Launcher in the garden, Micro Machines World Series will have players of all ages smiling from ear-to-ear while delivering absolute carnage."}, {"name": "FIFA Street", "details_link": "https://www.metacritic.com/game/playstation-2/fifa-street", "publisher": "EA Sports Big", "release_date": "Feb 22 2005", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Arcade"], "meta_score": 59, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/c5fbf84be7bf9b10a6bf575394dad2a7-98.jpg", "descriptions": "FIFA Street is a combination of arcade action blended with the culture of freestyle street soccer. By removing the rules from the simulation soccer experience, FIFA Street exposes the heart of the world's beautiful game, on-the-ball flare and individual style. Leading this movement are theFIFA Street is a combination of arcade action blended with the culture of freestyle street soccer. By removing the rules from the simulation soccer experience, FIFA Street exposes the heart of the world's beautiful game, on-the-ball flare and individual style. Leading this movement are the worlds top professional players, showing off their skills and individual style in 4-on-4 match-ups against the backdrop of global venues that represent the true culture of street soccer. As the first game to support dynamic 1-on-1 encounters, beating your opponent will require skill, technique, and the careful selection of specific moves. As a gamer you'll take on the best and be required to earn their respect, gradually building your reputation and team into an unstoppable force that leads the tide of street soccer. [Electronic Arts]… Expand"}, {"name": "Sisters Royale: Five Sisters Under Fire", "details_link": "https://www.metacritic.com/game/switch/sisters-royale-five-sisters-under-fire", "publisher": "Chorus Worldwide", "release_date": "Jan 30 2020", "developers": ["Alfa System", "Alpha System"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/5af561b9e1904850ae38d5a58d406e86-98.jpg", "descriptions": "The first new game in 12 years from Alfa System, the team that brought you.the Shoot 'Em Up \"Castle of Shikigami III\" in the \"Castle of Shikigami\" series. Five uniquely talented sisters are squabbling over which of them will marry the angel Yashin. Enjoy the heroic(?) strategies of all five.The first new game in 12 years from Alfa System, the team that brought you.the Shoot 'Em Up \"Castle of Shikigami III\" in the \"Castle of Shikigami\" series. Five uniquely talented sisters are squabbling over which of them will marry the angel Yashin. Enjoy the heroic(?) strategies of all five. The Tension Bonus System (TBS) means your score and number of coins multiplies based on your  distance from enemies and their attacks, and the Powershot System changes normal attacks into strong attacks, further ramping up the tension.… Expand"}, {"name": "James Cameron's Avatar: The Game", "details_link": "https://www.metacritic.com/game/pc/james-camerons-avatar-the-game", "publisher": "Ubisoft", "release_date": "Dec  1 2009", "developers": ["Ubisoft", "Ubisoft Montreal"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/ab19a0f3626479af5aae754a6933f8ea-98.jpg", "descriptions": "Based on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video gamesBased on James Cameron's film, the game takes you deep into the heart of Pandora, an alien planet that is beyond imagination. Gamers encounter the Na'vi, Pandora's indigenous people and discover creatures and other wildlife the likes of which have never been seen in the world of video games before. When conflict erupts between the RDA Corporation, a space-faring consortium in search of valuable resources, and the Na'vi, players find themselves thrust into a fight for the heart of a planet and the fate of a civilization. [Ubisoft]… Expand"}, {"name": "Sega Bass Fishing", "details_link": "https://www.metacritic.com/game/wii/sega-bass-fishing", "publisher": "Sega", "release_date": "Feb 26 2008", "developers": ["Cavia Inc."], "platforms": "Wii", "num_players": "1 Player", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/12d987ec99b88f97f3cb50bfe2d8e92e-98.jpg", "descriptions": "The sun is out, the fish are biting and your tackle box is filled with 20 different types of lures. With content created exclusively for the Wii, you'll motor out, find your favorite fishing hole, cast off using the Wii Remote and snag one of four types of bass. When you hook a fighter, yourThe sun is out, the fish are biting and your tackle box is filled with 20 different types of lures. With content created exclusively for the Wii, you'll motor out, find your favorite fishing hole, cast off using the Wii Remote and snag one of four types of bass. When you hook a fighter, your motion sensor will let you know, so hang on and enjoy the ride. Four fun-filled modes. Arcade, Tournament, Practice and Nature Trip modes. 15 stages. Find your favorite fishing spot in seven brand new stages created exclusively for the Wii, or re-live your glory fishing days in four classic arcade and four Dreamcast stages. Four types of bass. Hook four breeds of bass: Florida Large Mouth, Red Eye, Small Mouth and Northern Spike Large Mouth. Reinvention of a classic. This classic title first made a splash in the arcades and now the gameplay and graphics have been updated for the Wii. Authentic simulated fishing experience. New features have been created to take full advantage of the Wii Remote, including driving the boat with the control stick and reeling in your fish with the motion sensor. [Sega]… Expand"}, {"name": "Gauntlet: Seven Sorrows", "details_link": "https://www.metacritic.com/game/playstation-2/gauntlet-seven-sorrows", "publisher": "Midway", "release_date": "Dec 12 2005", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/3f6ca896cd0eac962f1129474314deb4-98.jpg", "descriptions": "Blending an intuitive combat system, accessible RPG elements, and new junction skills, Seven Sorrows features the dynamic co-op it's known for, and, for the first time ever, it is online supporting up to four players. Centuries ago, four immortal heroes set out to kill the most powerfulBlending an intuitive combat system, accessible RPG elements, and new junction skills, Seven Sorrows features the dynamic co-op it's known for, and, for the first time ever, it is online supporting up to four players. Centuries ago, four immortal heroes set out to kill the most powerful emperor their age had ever known. They failed, and for their crimes, three were crucified on a great tree at the bottom of the world. Mysteriously set free, the heroes set out to finish what they had started, only to find that they must now save their tormentor from his own dreams and madness. Driven to grief by seven acts of deep cruelty and selfishness, the emperor seeks to undo the one that pains him the most: the murder of his lover, Cusirimay. If the ancient heroes cannot undo the emperor's deeds on their own, his mad plans may tear apart the world. Seven Sorrows is the fusion of fantasy fighting action with the strategy of user-friendly RPG elements, providing gamers a deep, engaging gameplay experience complete with solo play, co-op and an online community. The new fighting system allows for easy pick-up-and-play while simultaneously offering deeper choices for more advanced players. Additionally, online RPG and collection elements add significant replay value to the game. [Midway]… Expand"}, {"name": "Shot Online", "details_link": "https://www.metacritic.com/game/pc/shot-online", "publisher": "OnNet", "release_date": "Jun 28 2005", "developers": ["OnNet"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/f40ef8b2fb671d649e74fda4ad6e4f99-98.jpg", "descriptions": "Shot-Online is not just an online sports game either, but it is a highly accurate simulation and a deep role-playing experience. It is the RPG quality that makes Shot-Online the unique game it is, especially with the community interaction and the enhancement and leveling of your character.Shot-Online is not just an online sports game either, but it is a highly accurate simulation and a deep role-playing experience. It is the RPG quality that makes Shot-Online the unique game it is, especially with the community interaction and the enhancement and leveling of your character. Speaking of community and role-playing, Shot-Online offers both realistic and rare items drawn from the celebrated history of golf. Practicing every day, competing against players with different skills, allows the gamer to advance their characters abilities. Quests and item exchanging and more add to the community feel. A proprietary physics engine was used in Shot-Online to accurately recreate the ball and course dynamics. In other words, the ball will behave as it should over the geography of the course. Characters also benefit from accuracy through technology. Motion captured golf swings from a PGA golfer were used to match the most spot-on feel of a real golf swing, putting, chip shot, and other golfing actions. As a gallery, watching a game played on Shot-Online is like seeing a professional golf sportscast on television, with the overall presentation, the numerous camera angles and the gallery mode. Whether you're watching or playing, Shot-Online golf is designed to both play and look as close to reality as possible. [OnNet]… Expand"}, {"name": "Rule of Rose", "details_link": "https://www.metacritic.com/game/playstation-2/rule-of-rose", "publisher": "Atlus Co.", "release_date": "Sep 12 2006", "developers": ["Punchline", "Shirogumi"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 59, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/f450a1ade34a1e631fc9b67cadb914ed-98.jpg", "descriptions": "March, 1930. A young girl named Jennifer, whose parents were killed in a tragic airship accident, is taken to the Rose Garden Orphanage, located in a remote portion of the English countryside. What Jennifer discovers is a dilapidated building and a ragtag mob of children who call themselvesMarch, 1930. A young girl named Jennifer, whose parents were killed in a tragic airship accident, is taken to the Rose Garden Orphanage, located in a remote portion of the English countryside. What Jennifer discovers is a dilapidated building and a ragtag mob of children who call themselves the \"Aristocracy of the Red Crayon.\" The demented residents of Rose Garden kidnap Jennifer and take her into the dark heart of an impossibly large zeppelin, on a meandering course for a distant land. Now, with the help of a canine companion named Brown, Jennifer has to find valuable gifts for the Aristocracy, or suffer a fatal punishment for her insolence...Befriend a faithful dog and work together to locate crucial items. Intense melee combat against bloodthirsty monsters. Multiple endings and hidden extras. [Atlus USA]… Expand"}, {"name": "Aaru's Awakening", "details_link": "https://www.metacritic.com/game/pc/aarus-awakening", "publisher": "Lumenox ehf", "release_date": "Feb 23 2015", "developers": ["Lumenox ehf"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 59, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/8/9a0aebf15e2b2d3b172ca6d20a24ed1b-98.jpg", "descriptions": "A hand-drawn 2D action platformer set in the mythical world of Lumenox. Master the synergy of Teleportation and charge to defeat evil."}, {"name": "Disney/Pixar Cars 3: Driven to Win", "details_link": "https://www.metacritic.com/game/xbox-one/disneypixar-cars-3-driven-to-win", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 13 2017", "developers": ["Avalanche Software"], "platforms": ["PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/961f0f04730aef6b13a9717a4ef7adb4-98.jpg", "descriptions": "Speed into the world of Cars as you determine your path to racing mastery in Cars 3: Driven to Win, the game inspired by the Disney Pixar film. Play with over 20 customizable characters including Lightning McQueen, Jackson Storm, Cruz Ramirez and the next generation of racers in over 20Speed into the world of Cars as you determine your path to racing mastery in Cars 3: Driven to Win, the game inspired by the Disney Pixar film. Play with over 20 customizable characters including Lightning McQueen, Jackson Storm, Cruz Ramirez and the next generation of racers in over 20 tracks set in iconic locations from the film such as Radiator Springs. Train and advance your abilities in 6 game modes and challenge your family and friends in the Battle Race to become the Ultimate Champion. On the road to becoming a Hall of Fame Driver, training and skill will give you an edge in a race that anyone can win.… Expand"}, {"name": "Splatterhouse", "details_link": "https://www.metacritic.com/game/playstation-3/splatterhouse", "publisher": "Namco Bandai Games America", "release_date": "Nov 23 2010", "developers": ["Namco Bandai Games America", "Namco Bandai Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 59, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/e91d5b29b382ad4a591d26656433424b-98.jpg", "descriptions": "Inspired by the landmark 1988 arcade hit, Splatterhouse combines visceral, adrenaline-soaked combat with horror elements to deliver an original gaming experience that defies the boundaries of the traditional action category with over-the-top gore and shocking new gameplay mechanics.Inspired by the landmark 1988 arcade hit, Splatterhouse combines visceral, adrenaline-soaked combat with horror elements to deliver an original gaming experience that defies the boundaries of the traditional action category with over-the-top gore and shocking new gameplay mechanics. Splatterhouse follows college student Rick Taylor as he tries to rescue his girlfriend, Jennifer, who has disappeared after entering the mysterious and run-down West Mansion. Confronted by horrific other-worldly creatures, Rick comes across a mystical sentient mask that promises to give him the power to find Jennifer. Full of desperation and rage, Rick puts on the \"Terror Mask\" and is transformed into a juggernaut of pure violence and destruction. Featuring an original storyline by critically-acclaimed comic book writer Gordon Rennie (Necronauts, Judge Dredd), Splatterhouse takes Rick beyond the mansion as he scours the ends of the world to rescue his beloved Jennifer. Embodying the unfiltered, primal aggression of its namesake, Splatterhouse gives players countless ways to decimate the mansion's assortment of demons, monstrosities and abominations. Featuring a dynamic combat system, Rick can use his brute strength to perform bone-crushing melee combos, savage grapples and wield an assortment of makeshift weapons including the series' trademark 2x4 and even limbs and heads ripped from enemies themselves. Players can also reanimate the corpses of fallen enemies to fight alongside Rick, imparting strategic depth to the game's battle and unique puzzle systems. More agile than ever before, Rick can now leap great distances and propel himself to out of reach areas by swinging from outcroppings in the environment, adding an all-new level of exploration to the series. [Namco Bandai Games]… Expand"}, {"name": "Pac-Man Party", "details_link": "https://www.metacritic.com/game/wii/pac-man-party", "publisher": "Namco Bandai Games America", "release_date": "Nov 16 2010", "developers": ["TOSE"], "platforms": ["3DS", "Wii"], "genres": ["Miscellaneous", "Adventure", "General", "Party", "Party", "Party / Minigame"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/846b175f3a6e0547bc01b678e73efcdb-98.jpg", "descriptions": "Reigning as one of the top pop cultural icons since his introduction in 1980, PAC-MAN remains a global phenomenon that has yielded hundreds of products including video games. PAC-MAN Party continues this legacy by offering a game that captures the spirit of the franchise and providesReigning as one of the top pop cultural icons since his introduction in 1980, PAC-MAN remains a global phenomenon that has yielded hundreds of products including video games. PAC-MAN Party continues this legacy by offering a game that captures the spirit of the franchise and provides engaging entertainment that can be enjoyed by people of all ages. With more than 45 exciting mini-games, PAC-MAN Party provides a rewarding and challenging social gaming experience regardless of skill level. From the time-based trials of rolling a giant snowball and knocking your friends off a mountain top, to adventures that require more precision and endurance, players will be fully engaged as they use the Wii Remote's motion, pointing and button control capabilities.… Expand"}, {"name": "Lunar: Dragon Song", "details_link": "https://www.metacritic.com/game/ds/lunar-dragon-song", "publisher": "Ubisoft", "release_date": "Sep 27 2005", "developers": ["Game Arts", "Japan Art Media (JAM)"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 59, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/4f4e2154bd13245025d5ac5ff6242658-98.jpg", "descriptions": "(Also known as \"Lunar Genesis\" in JPN)  The first original installment of the Lunar franchise to be released in more than 10 years - Lunar: Dragon Song - is also the first traditional fantasy RPG for Nintendo DS and takes players to 1,000 years before the events that occurred in the first(Also known as \"Lunar Genesis\" in JPN)  The first original installment of the Lunar franchise to be released in more than 10 years - Lunar: Dragon Song - is also the first traditional fantasy RPG for Nintendo DS and takes players to 1,000 years before the events that occurred in the first game of the Lunar series, \"Lunar: The Silver Star.\" The world of Lunar is at peace under the protection of the goddess Althena, creator of Lunar. At the fringes of this peaceful existence, vicious demons have started to slowly invade, and there are few with power enough to know how to deal with this demon invasion. Players experience the world of Lunar as the human boy, Jian, and his group of friends. Jian’s story begins simply but quickly evolves as he and his friends unravel the evil plot being laid against Althena and discover that they alone can save Lunar from the forces of evil. [Ubisoft]… Expand"}, {"name": "Rustler", "details_link": "https://www.metacritic.com/game/playstation-5/rustler", "publisher": "Maximum Games", "release_date": "Aug 31 2021", "developers": ["Jutsu Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "Open-World"], "meta_score": 59, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/3a9a5d20105cdb982185141218bac309-98.jpg", "descriptions": "Become a medieval thug in a crazy open-world action game, full of pop-culture references. Complete insane quests, kill heroes, steal horses, fight guards, rob peasants, listen to some bard music, and much more! All packed in old-school gameplay style!"}, {"name": "Starsky & Hutch", "details_link": "https://www.metacritic.com/game/gamecube/starsky-hutch", "publisher": "Bam Entertainment", "release_date": "Aug 24 2004", "developers": ["Supersonic Software"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/064dc8770236bcdc5f987482d52f3bf0-98.jpg", "descriptions": "Based on the 70's television show, Starsky & Hutch lets you race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum--but don't go thinking this will be a joy ride.  If your driving and shooting skills can't keep the TV audience onBased on the 70's television show, Starsky & Hutch lets you race through Bay City in Starsky's bright red Ford Torino, while Hutch takes aim at criminals with his .357 Magnum--but don't go thinking this will be a joy ride.  If your driving and shooting skills can't keep the TV audience on the edge of their sofas, your ratings will plummet, the show will be cancelled, and it's \"game over.\"  Don't think you can handle all the high-speed thrills by yourself?  Find a partner and let them shoot while you drive.… Expand"}, {"name": "Frogger's Adventures: The Rescue", "details_link": "https://www.metacritic.com/game/playstation-2/froggers-adventures-the-rescue", "publisher": "Konami", "release_date": "Oct 29 2003", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 59, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/7/6b8594d738f2c91008f7811058167818-98.jpg", "descriptions": "Frogger's Adventures The Rescue goes beyond Firefly Swamp and brings a multiplayer mode to Frogger fans for the first time on next generation platforms. The series' famous \"hop-n-dodge\" gameplay return as Frogger travels across seven diverse worlds, searches for clues to solve challengingFrogger's Adventures The Rescue goes beyond Firefly Swamp and brings a multiplayer mode to Frogger fans for the first time on next generation platforms. The series' famous \"hop-n-dodge\" gameplay return as Frogger travels across seven diverse worlds, searches for clues to solve challenging puzzles and avoids menacing enemies. \"Hop-n-dodge\" style gamplay to appeal to players of all levels. Wide range of mini-quests and side stories. Seven worlds with over 25 levels. [Konami]… Expand"}, {"name": "AquaNox 2: Revelation", "details_link": "https://www.metacritic.com/game/pc/aquanox-2-revelation", "publisher": "Encore Software, Inc.", "release_date": "Aug 22 2003", "developers": ["Massive Development"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Marine", "Futuristic Sub", "Futuristic Sub", "Combat"], "meta_score": 59, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/51517a8f8b4170d54d51fd2acbea8c69-98.jpg", "descriptions": "A new story of the underwater world Aqua. In 2666 a young freighter pilot called William Drake sets out to search for the heritage of a mythical ancestor. He is looking for adventure - and finds greed, ruthlessness, merciless hatred... and also unexpected help. But very soon he has toA new story of the underwater world Aqua. In 2666 a young freighter pilot called William Drake sets out to search for the heritage of a mythical ancestor. He is looking for adventure - and finds greed, ruthlessness, merciless hatred... and also unexpected help. But very soon he has to realize that he is not the only one hunting for his ancestor's legendary treasure.  [JoWood Productions]… Expand"}, {"name": "Futurama", "details_link": "https://www.metacritic.com/game/playstation-2/futurama", "publisher": "VU Games", "release_date": "Aug 14 2003", "developers": ["UDS"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 59, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/bba1c753ef59373ecf56cd06710c20fc-98.jpg", "descriptions": "Futurama begins when Professor Farnsworth sells his delivery ship Planet Express to the evil businesswoman Mom, giving her ownership of over fifty percent of the Earth, making her the supreme ruler. You must prevent Mom from enslaving humanity and dominating the universe by taking the PlanetFuturama begins when Professor Farnsworth sells his delivery ship Planet Express to the evil businesswoman Mom, giving her ownership of over fifty percent of the Earth, making her the supreme ruler. You must prevent Mom from enslaving humanity and dominating the universe by taking the Planet Express crew back in time to stop the deal from taking place. Play as Fry, Bender, Leela and Dr. Zoidberg, each with their own special fighting skills and weapons as you visit familiar scenes from the hit series: Planet Express, the Red Light District, New New York, as well as a host of new environments. With each character's unique skills, you can master their power ups and complete their tasks leading them to victory against Mom and her death bot troopers. [Vivendi Universal]… Expand"}, {"name": "Yu-Gi-Oh! The Duelists of the Roses", "details_link": "https://www.metacritic.com/game/playstation-2/yu-gi-oh!-the-duelists-of-the-roses", "publisher": "Konami", "release_date": "Feb 16 2003", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Card Battle"], "meta_score": 59, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/772554e4c181a4effe10666b498b1bdc-98.jpg", "descriptions": "The lineage of Yugi and Kaiba clash again! Choose your side in the final Rose War in England and fight to collect the opposing army's rose cards and overthrow the enemy. Attack with your powerful deck in order to defeat duelists seen in the hit animated series. An all-new card movementThe lineage of Yugi and Kaiba clash again! Choose your side in the final Rose War in England and fight to collect the opposing army's rose cards and overthrow the enemy. Attack with your powerful deck in order to defeat duelists seen in the hit animated series. An all-new card movement system allows full control of over 600 different monsters and introduces advanced strategies never before seen in the Yu-Gi-Oh! world. Card Movement Battle System enhances the strategy. Side with Yugi or Kaiba to determine the course of the game. 680 beautifully rendered monsters in full 3D. 3 exclusive game cards included. [Konami]… Expand"}, {"name": "Tom Clancy's Ghost Recon", "details_link": "https://www.metacritic.com/game/gamecube/tom-clancys-ghost-recon", "publisher": "Ubisoft", "release_date": "Feb  9 2003", "developers": ["Red Storm Entertainment"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 59, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/8b915234d076a8ed5839262650f0819c-98.jpg", "descriptions": "When new leaders in Russia attempt to rebuild the Iron Curtain, war escalates, casualties mount, hostages are taken, and the Ghosts are sent in.  Take a highly skilled Ghost team through a series of missions that range from demolitions to search-and-rescue and all-out firefights forWhen new leaders in Russia attempt to rebuild the Iron Curtain, war escalates, casualties mount, hostages are taken, and the Ghosts are sent in.  Take a highly skilled Ghost team through a series of missions that range from demolitions to search-and-rescue and all-out firefights for survival.  You can carry dozens of standard and special-issue weapons such as the M16A2, the M4 carbine, and the fearsome and deadly OICW.  Bring a friend into the firefight in split-screen multiplayer mode.  Your team--and the world--is counting on you.… Expand"}, {"name": "007: NightFire", "details_link": "https://www.metacritic.com/game/pc/007-nightfire", "publisher": "Electronic Arts", "release_date": "Nov 28 2002", "developers": ["Gearbox Software"], "platforms": "PC", "num_players": "Up to 32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/98ded8914dd98a1efd777a592289c756-98.jpg", "descriptions": "The ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire. Explore new heights and depths like never before-infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through the streetsThe ultimate secret agent is back in his most dangerous adventure yet in James Bond 007: NightFire. Explore new heights and depths like never before-infiltrate towering skyscrapers, take on treacherous underwater missions, and maneuver your sleek Aston Martin V12 Vanquish through the streets of Tokyo while turning on the Bond charm with glamorous (and sometimes deadly) Bond women. New state-of-the-art upgradeable gadgets and weapons and original missions including zero-gravity assignments will leave you shaken and stirred. [Electronic Arts]… Expand"}, {"name": "Legends of Wrestling II", "details_link": "https://www.metacritic.com/game/playstation-2/legends-of-wrestling-ii", "publisher": "Acclaim", "release_date": "Nov 26 2002", "developers": ["Acclaim"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/49964fb2176b09865ea4a40bd4619c72-98.jpg", "descriptions": "Features over 65 of the greatest ring warriors ever including the icon Hulk Hogan, Andre \"The Giant\", Rowdy Roddy Piper, Bruno Sammartino, Bret \"Hitman\" Hart, Sid Vicious, \"Big Poppa Pump\" Scott Steiner, Jerry \"The King\" Lawler, and many more! Cranium-crushing match types, such as 6- andFeatures over 65 of the greatest ring warriors ever including the icon Hulk Hogan, Andre \"The Giant\", Rowdy Roddy Piper, Bruno Sammartino, Bret \"Hitman\" Hart, Sid Vicious, \"Big Poppa Pump\" Scott Steiner, Jerry \"The King\" Lawler, and many more! Cranium-crushing match types, such as 6- and 8-man Elimination Bouts, Cage, Battle Royal, Ladder, Table and 3- and 4-way dances. Never-before-seen $15,000 Body Slam Challenge with Big John Studd. [Acclaim]… Expand"}, {"name": "Total Immersion Racing", "details_link": "https://www.metacritic.com/game/playstation-2/total-immersion-racing", "publisher": "Empire Interactive", "release_date": "Nov 20 2002", "developers": ["Razorworks Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 59, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/21b4f6463a95da3afc8f6338b67288a4-98.jpg", "descriptions": "In Total Immersion Racing, other drivers will remember your actions on track. Always listen to your Team Manager. Be careful that you don't block a rival on track, or destroy the chances of a driver i na lower class, as he will remember your actions going into the next race and beyond.In Total Immersion Racing, other drivers will remember your actions on track. Always listen to your Team Manager. Be careful that you don't block a rival on track, or destroy the chances of a driver i na lower class, as he will remember your actions going into the next race and beyond. Remember that rivalries never die, and later on in your career you may regret the time you upset another driver - as they may decide to get revenge by ruining your championship run. [Empire Interactive]… Expand"}, {"name": "The Lord of the Rings: The Fellowship of the Ring", "details_link": "https://www.metacritic.com/game/pc/the-lord-of-the-rings-the-fellowship-of-the-ring", "publisher": "Black Label Games", "release_date": "Oct 22 2002", "developers": ["Surreal Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Shooter", "General", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 59, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/2e1b1bb5127818c623a6b03f26dffeef-98.jpg", "descriptions": "Undertake a fantastic journey following the same path as the Fellowship in the book. Play as either Frodo, Aragorn, or Gandalf the Grey. As you take the fabled One Ring closer to its fate, you will explore the most dangerous wilds of Middle-earth from the Shire to the very edge of Mordor.Undertake a fantastic journey following the same path as the Fellowship in the book. Play as either Frodo, Aragorn, or Gandalf the Grey. As you take the fabled One Ring closer to its fate, you will explore the most dangerous wilds of Middle-earth from the Shire to the very edge of Mordor. [Universal Interactive]… Expand"}, {"name": "Davis Cup Tennis", "details_link": "https://www.metacritic.com/game/game-boy-advance/davis-cup-tennis", "publisher": "Ubisoft", "release_date": "Oct 14 2002", "developers": ["Hokus Pokus"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/5297c1c4d713b45f73a58c3bf2862221-98.jpg", "descriptions": "Enter a battle among tennis legends. With 142 nations abattling to possess the Silver Trophy, the biggest war of the tennis world is about to begin! Play in the Davis CupTournament or challenge friends to fierce 2-on-2 multiplayer matches. Gain experience points for your team and pit themEnter a battle among tennis legends. With 142 nations abattling to possess the Silver Trophy, the biggest war of the tennis world is about to begin! Play in the Davis CupTournament or challenge friends to fierce 2-on-2 multiplayer matches. Gain experience points for your team and pit them against your friends in multiplayer mode. Master your game on clay, carpet, and grass.… Expand"}, {"name": "Legion", "details_link": "https://www.metacritic.com/game/pc/legion", "publisher": "Strategy First", "release_date": "Jun  3 2002", "developers": ["Slitherine"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic", "General"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/c5b12c316aa1ee342c02723502f5d7c3-98.jpg", "descriptions": "Augustus, Julius Caesar, Mark Antony, Hannibal, leaders that became legend during this chaotic time of Roman history. Now's your chance to join the ranks of these great strategists and conquer Europe during the time of the Roman Empire. Legion is a revolutionary, high-level strategy game,Augustus, Julius Caesar, Mark Antony, Hannibal, leaders that became legend during this chaotic time of Roman history. Now's your chance to join the ranks of these great strategists and conquer Europe during the time of the Roman Empire. Legion is a revolutionary, high-level strategy game, which unfolds during the rich history that was the Roman Empire. The game features both strategic and tactical elements. At the strategic level, you control vast armies and attempt to carve an Empire from the assortment of tribes and city-states that occupied ancient Italy, France and Britain. At the tactical level, you must position your armies to take advantage of terrain and make use of the best formations, in order to achieve victory. The battles are a spectacle as well as a game play feature and players will enjoy them purely for the fun of watching hundreds of men fighting a bloody engagement. [Strategy First Inc.]… Expand"}, {"name": "Empire of the Ants (2001)", "details_link": "https://www.metacritic.com/game/pc/empire-of-the-ants-2001", "publisher": "Strategy First", "release_date": "Jul 17 2001", "developers": ["Microids"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "General", "General", "Command"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/b1c7b1a506a87c42bd2b31e784ac4c9e-98.jpg", "descriptions": "Empire of the Ants takes you into the undergrowth of the frantic world of colonization and dominance within the insect kingdom. Build up huge colonies, lead your armies into battle for supremacy, hunt down food and breed to improve your numbers. The ANTicipation is over?it is time toEmpire of the Ants takes you into the undergrowth of the frantic world of colonization and dominance within the insect kingdom. Build up huge colonies, lead your armies into battle for supremacy, hunt down food and breed to improve your numbers. The ANTicipation is over?it is time to experience a whole new world!  [Strategy First]… Expand"}, {"name": "Contrast", "details_link": "https://www.metacritic.com/game/playstation-4/contrast", "publisher": "Focus Home Interactive", "release_date": "Nov 15 2013", "developers": ["Compulsion Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Platformer", "3D", "Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 59, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/dcbf967892d2323279090c870efd9eba-98.jpg", "descriptions": "Contrast is a 2D/3D puzzle platformer in which you can shift between the striking 3D fantasy world and the mysterious 2D shadowscape."}, {"name": "Mars: War Logs", "details_link": "https://www.metacritic.com/game/pc/mars-war-logs", "publisher": "Focus Home Interactive", "release_date": "Apr 26 2013", "developers": ["Spiders"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 59, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/7714ff29e78bfbb278653a52ade66104-98.jpg", "descriptions": "Mars: War Logs takes you to the red planet over a century after the catastrophe that threw the planet and its colonists into chaos. Water has become the most precious resource on the arid planet with a few companies fighting a perpetual war for its control. In the middle of this struggle,Mars: War Logs takes you to the red planet over a century after the catastrophe that threw the planet and its colonists into chaos. Water has become the most precious resource on the arid planet with a few companies fighting a perpetual war for its control. In the middle of this struggle, players take on the role of Roy Temperance, a renegade with multiple talents, and plunge into a thrilling cyberpunk RPG on the Red Planet! Players develop Roy and his combat style by choosing among dozens of skills and perks, and fight for his life in dynamic real-time combat against the fearsome creatures of Mars. The crafting system lets players create and modify equipment to maintain an edge over enemies. Dialogue choices as well as actions and decisions made will influence the destiny of the people Roy crosses paths with...and perhaps the fate of all colonies on Mars. … Expand"}, {"name": "Warcraft III: Reforged", "details_link": "https://www.metacritic.com/game/pc/warcraft-iii-reforged", "release_date": "Jan 28 2020", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 59, "users_score": 0.6, "image": "https://static.metacritic.com/images/products/games/2/44c28b1eae50c0df568a58161ff0429d-98.jpg", "descriptions": "A Classic Favorite, Reforged. Warcraft III: Reforged is a reimagining of the real-time strategy game that laid the foundation for Azeroth's most epic stories. It is a remake featuring a thorough visual overhaul, a suite of contemporary social and matchmaking features, and more. Command theA Classic Favorite, Reforged. Warcraft III: Reforged is a reimagining of the real-time strategy game that laid the foundation for Azeroth's most epic stories. It is a remake featuring a thorough visual overhaul, a suite of contemporary social and matchmaking features, and more. Command the Night Elves, Undead, Orcs, and Humans as alliances shift and armies clash in this timeless real-time strategy game.\r AZEROTH, BORN ANEW!\r Experience an Epic Story\rThe founding of Orgrimmar. The fall of Lordaeron. The reign of the Burning Legion. The rise of the Lich King. Veterans and newcomers alike will experience these pivotal events in Azeroth's history like never before.\r The Battlefield Awaits\rPlay through the points of view of four distinct factions: the mighty Orcs, the noble Humans, the ancient Night Elves, and the insidious Undead. Gather resources, build your base, and assemble an army. Recruit powerful heroes to lead your forces, and meet your foes in battle. Destroy the enemy base to win the game!\r Vast Campaigns\rRelive the events of Warcraft III: Reign of Chaos and The Frozen Throne. Enjoy an epic saga retold with over four hours of reshot cutscenes and updated voice-overs that breathe new life into the earliest renditions of Azeroth's key characters, across more than 60 single-player missions that span Kalimdor, Northrend, Lordaeron, and beyond.\r Reimagined Visuals\rEvery character, structure, and environment has been recreated to emphasis the depth, dimension, and personality of this rough-hewn fantasy world. Behold Warcraft III's classic units in glorious 4K, with updated animations that bring them to life like you've never seen.\r World Editor & Custom Maps\rReturn to the game that started it all. Discover a vast universe of player-created games, including tower defense, MOBAs, RPGs, survival games, and moreor build your own with the upgraded World Editor.\r Multiplayer Matchmaking\rChallenge opponents with modern multiplayer matchmaking, search for custom game lobbies, and connect with friends through the Blizzard Battle.net app. With updated UI and countless quality-of-life improvements, its never been easier to get into Warcraft III.… Expand"}, {"name": "Rogue Trooper Redux", "details_link": "https://www.metacritic.com/game/playstation-4/rogue-trooper-redux", "publisher": "Sold Out", "release_date": "Oct 17 2017", "developers": ["Sold Out"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 59, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/b25e51f4a3d5bd2da81f315bcb2f7214-98.jpg", "descriptions": "A tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by yourA tactical shooter and comic book adaptation, Rogue Trooper is back, remastered in high definition. Experience combat and third person action in this tale of betrayal and revenge at the far reaches of the galaxy. You are the last Genetic Infantryman (GI). Bred for war and betrayed by your superiors at the Quartz Zone Massacre, you stalk the battlefield as a one-man squad, carrying the sentient biochips of three fallen soldiers in your rifle, pack and helmet. Your mission? Fight your way across the chemical-blasted wastes of Nu-Earth -- a planet ravaged by an endless apocalyptic war  in search of the Traitor General and payback.… Expand"}, {"name": "F1 2011", "details_link": "https://www.metacritic.com/game/3ds/f1-2011", "publisher": "Codemasters", "release_date": "Dec  6 2011", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "3DS"], "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 59, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/2cd8c372990dd3ffb706d33162a538b1-98.jpg", "descriptions": "In F1 2011 players will be challenged to ‘Be the driver, live the life, go compete,’ with wide-ranging technical and gameplay advancements on and off track and vastly extended competitive and co-operative multiplayer components.  F1 2011 will feature all of the official teams, drivers andIn F1 2011 players will be challenged to ‘Be the driver, live the life, go compete,’ with wide-ranging technical and gameplay advancements on and off track and vastly extended competitive and co-operative multiplayer components.  F1 2011 will feature all of the official teams, drivers and circuits from the highly anticipated 2011 FIA FORMULA ONE WORLD CHAMPIONSHIP, including the current FIA FORMULA ONE Drivers’ World Champion Sebastian Vettel.  The 2011 season also sees the debut of the 2011 FORMULA 1 GRAND PRIX OF INDIA at Delhi’s Jaypee International Race Circuit and the return of the iconic Nürburgring to the calendar. … Expand"}, {"name": "Witch Strandings", "details_link": "https://www.metacritic.com/game/pc/witch-strandings", "publisher": "Modern Wolf", "release_date": "Jul  7 2022", "developers": ["Strange Scaffold", "vwudqjh vfdiirog"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Strategy", "General"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/0c89698a4e17468cbcca41dfbfd9d475-98.jpg", "descriptions": "You are a point of light in a new open world Strand-type game. Create pathways through the darkness, nurture the creatures of the Forest, repair ancient structures, and ultimately: confront the Witch who broke this place."}, {"name": "Hydrophobia", "details_link": "https://www.metacritic.com/game/xbox-360/hydrophobia", "publisher": "Microsoft Game Studios", "release_date": "Sep 29 2010", "developers": ["Dark Energy Digital"], "platforms": "Xbox 360", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/408bb7a611c42f50a850162522182531-98.jpg", "descriptions": "In the near future, a city-sized super ship, an enclave for rich people and shady businesses, is the setting for an ideological conflict began by terrorist attacks."}, {"name": "Gods Will Fall", "details_link": "https://www.metacritic.com/game/switch/gods-will-fall", "publisher": "Deep Silver", "release_date": "Jan 28 2021", "developers": ["Clever Beans"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 59, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/5b965c4a4208cffc17a214913ac5d490-98.jpg", "descriptions": "You are the last hope for humanity. The gods’ torturous rule over humanity has lasted for millennia. Bent on cruelty and suffering, they demand to be served with blind worship through an oath of fealty pledged from every man, woman, and child. To those who don’t submit to the gods’ will, aYou are the last hope for humanity. The gods’ torturous rule over humanity has lasted for millennia. Bent on cruelty and suffering, they demand to be served with blind worship through an oath of fealty pledged from every man, woman, and child. To those who don’t submit to the gods’ will, a slow and merciless death awaits. Experience the brutal trials of a venturous band of warriors in their desperate plight to sever the gods’ callous grip on humanity. Every man and woman who can muster a blade, having suffered the brutality of the gods’ reign for too long, will be called upon to form your clan of eight Celtic survivors and rise up to take on the legions of horrific beasts and minions that dwell in each of the gods’ hellish realms. A personal tale emerges with every decision made. Succeed and see legends born. Fail and watch lives turn to dust.… Expand"}, {"name": "Avatar: The Last Airbender", "details_link": "https://www.metacritic.com/game/playstation-2/avatar-the-last-airbender", "publisher": "THQ", "release_date": "Oct 10 2006", "developers": ["THQ Australia"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 59, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/038f1de008da8a7f9dd72cc2403b98fd-98.jpg", "descriptions": "Bring to life an adventure of intrigue, deceit and revelation in Avatar The Last Airbender. Play as Aang, Katara, Haru and Sokka as you grow your team into an unstoppable force making discoveries in a thrilling blend of magic and martial arts combat. Use your fully customizable bendingBring to life an adventure of intrigue, deceit and revelation in Avatar The Last Airbender. Play as Aang, Katara, Haru and Sokka as you grow your team into an unstoppable force making discoveries in a thrilling blend of magic and martial arts combat. Use your fully customizable bending powers to master the four elements of Earth, Air, Water and Fire and explore the beautifully detailed environments of the Avatar nations. Single-player game featuring unique martial arts style combat. Fully customizable \"bending powers\" mastering the four elements of Water, Air, Earth and Fire. Journey through all the Great Nations of the Avatar world. Enjoy environments and characters from the TV show plus never before seen enemies and creatures. [THQ]… Expand"}, {"name": "Dynasty Warriors 6 Empires", "details_link": "https://www.metacritic.com/game/xbox-360/dynasty-warriors-6-empires", "publisher": "Koei", "release_date": "Jun 23 2009", "developers": ["Omega Force"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 59, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/a9a2232837d6a660bc98673322a23633-98.jpg", "descriptions": "Designed for the legions of Dynasty Warriors fans, DYNASTY WARRIORS 6: Empires is game that brings together the best aspects of the action and strategy genres. In this latest edition, players can experience Ancient China’s greatest and most glorious war as an all-powerful lord or as anDesigned for the legions of Dynasty Warriors fans, DYNASTY WARRIORS 6: Empires is game that brings together the best aspects of the action and strategy genres. In this latest edition, players can experience Ancient China’s greatest and most glorious war as an all-powerful lord or as an officer. As a lord, gamers must think strategically. By deciding when to attack, when to resist invasion, or when to initiate policies, a lord can expand their power and influence. An easy-to-learn card collecting system lets players enact policies that will increase their empire’s strength, improve the abilities of their forces, and more. The cards that a player receives will depend on the attributes of the officers and their army. Players can also pledge their allegiance to a kingdom to become an officer. As an officer, players can suggest policies in the kingdom’s war council, complete missions for rewards, or even turn against their ruler should relations sour. Most eagerly awaited by fans is a game mode that allows players to create their own warrior. DYNASTY WARRIORS 6: Empires features an extensive character editing system with options to customize a warrior’s gender, build, skin tone, facial features, voice, clothing, weapon and more. Whomever players choose to be, they can now use mountain ledges and waterways to infiltrate enemy bases and launch surprise attacks on supply depots to change the flow of battle. [Koei]… Expand"}, {"name": "Loadout", "details_link": "https://www.metacritic.com/game/playstation-4/loadout", "publisher": "Edge of Reality", "release_date": "Dec 16 2014", "developers": ["Edge of Reality"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Third-Person", "Modern", "Arcade"], "meta_score": 59, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/a2e5905a3f623e7cd8b569d557124584-98.jpg", "descriptions": "Loadout is a new free-to-play take on fast-paced, multiplayer shooters. Players invent and customize their own outrageous weapons to carry into furious, over-the-top shooter action that truly distinguishes itself from the vast array of modern combat titles. Earn new weapon parts, characterLoadout is a new free-to-play take on fast-paced, multiplayer shooters. Players invent and customize their own outrageous weapons to carry into furious, over-the-top shooter action that truly distinguishes itself from the vast array of modern combat titles. Earn new weapon parts, character customizations, equipment, and accessories as you gain prestige and wealth. The more you play, the more you can customize. There are endless possibilities to truly set yourself apart from your opponents. We'll continue to update Loadout with new items, customizations, game-play modes, features and much more.… Expand"}, {"name": "Dust 514", "details_link": "https://www.metacritic.com/game/playstation-3/dust-514", "publisher": "CCP", "release_date": "May 14 2013", "developers": ["CCP"], "platforms": "PlayStation 3", "genres": ["Role-Playing", "First-Person", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 59, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/8d4d86fed7cff13d27b11c11b505f0cb-98.jpg", "descriptions": "DUST 514 is a free-to-play console-based hybrid massively multiplayer online first-person shooter set within the EVE universe and interacts directly with EVE Online."}, {"name": "Hellpoint", "details_link": "https://www.metacritic.com/game/playstation-4/hellpoint", "publisher": "tinyBuild", "release_date": "Jul 30 2020", "developers": ["Cradle Games"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 59, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/a21f611f9a6e4ed6a29a06436ba833ac-98.jpg", "descriptions": "Hellpoint is an intense action RPG taking place on Irid Novo, a derelict space station soaked in an intoxicating dark sci fi atmosphere. Fight dreadful creatures, face the Cosmic Gods and unravel their twisted story. Should the challenge be too great, play with a friend in local or online coop."}, {"name": "The Spiderwick Chronicles", "details_link": "https://www.metacritic.com/game/xbox-360/the-spiderwick-chronicles", "publisher": "Sierra Entertainment", "release_date": "Feb  5 2008", "developers": ["Stormfront Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 59, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/dcb11d52934f8bbf6bd20ae4f5addcaa-98.jpg", "descriptions": "The Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon andThe Spiderwick Chronicles is a video game based on the theatrical release by Paramount Pictures and Nickelodeon Films. The game recreates the fantastical world of the Spiderwick film and best-selling book series. The Spiderwick Chronicles video game recreates the world of Jared, Simon and Mallory Grace, putting gamers in their shoes as they discover a hidden world of fantastical creatures - sprites, ogres, goblins, brownies and more. [Sierra Entertainment]… Expand"}, {"name": "Override: Mech City Brawl", "details_link": "https://www.metacritic.com/game/playstation-4/override-mech-city-brawl", "publisher": "Modus Games", "release_date": "Dec  4 2018", "developers": ["The Balance", "Inc"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 59, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/466036a577a734943508441bd602f604-98.jpg", "descriptions": "No gears, no glory! Control gigantic robots and duke it out across fantastic cityscapes in this 3D mech-based brawler! Epic and explosive battles await with distinctive mechs in local and online versus mode, party co-op with two to four players, and a single-player campaign."}]