[{"name": "Unmechanical: Extended Edition", "details_link": "https://www.metacritic.com/game/xbox-one/unmechanical-extended-edition", "publisher": "Grip Games", "release_date": "Jan 30 2015", "developers": ["Grip Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox One"], "genres": ["Action", "Puzzle", "General", "Platformer", "2D"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/4c3dc62e724c0cab787a8e513d1dbbdb-98.jpg", "descriptions": "Set in a fantastic world of flesh, rock and steel, a little robot is trapped in an underground complex. His journey to freedom will require you to solve a great variety of puzzling challenges. And while the game is easy to pick up and play, many of the challenges will test your logic, memorySet in a fantastic world of flesh, rock and steel, a little robot is trapped in an underground complex. His journey to freedom will require you to solve a great variety of puzzling challenges. And while the game is easy to pick up and play, many of the challenges will test your logic, memory and wits.… Expand"}, {"name": "Final Fantasy Crystal Chronicles: The Crystal Bearers", "details_link": "https://www.metacritic.com/game/wii/final-fantasy-crystal-chronicles-the-crystal-bearers", "publisher": "Square Enix", "release_date": "Dec 26 2009", "developers": ["Square Enix"], "platforms": "Wii", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 66, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/8/284712a6c0e6e24c195ebc550edb7fd8-98.jpg", "descriptions": "Final Fantasy Crystal Chronicles: The Crystal Bearers provides a fresh take on the FINAL FANTASY CRYSTAL CHRONICLES series as it combines the storytelling depth, expansive world and graphical quality of FINAL FANTASY with motion-driven, real-time action gameplay. In this world, realisticFinal Fantasy Crystal Chronicles: The Crystal Bearers provides a fresh take on the FINAL FANTASY CRYSTAL CHRONICLES series as it combines the storytelling depth, expansive world and graphical quality of FINAL FANTASY with motion-driven, real-time action gameplay. In this world, realistic gameplay and fantastical art direction are brought together for a truly unique experience for Wii users around the globe. [Square Enix]… Expand"}, {"name": "Frogger Helmet Chaos", "details_link": "https://www.metacritic.com/game/psp/frogger-helmet-chaos", "publisher": "Konami", "release_date": "Sep 29 2005", "developers": ["Konami Computer Entertainment Hawaii"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/a8c39dfbeb25a0b58975c9eda3e6d049-98.jpg", "descriptions": "Frogger, one of the most beloved video game characters of all time, returns! In this latest escapade, Frogger finds himself called upon to stop an evil force that threatens his home, Firefly Swamp, and the nearby kingdom of Bunnington Hollow. To stop the insidious Dr. Wani and hisFrogger, one of the most beloved video game characters of all time, returns! In this latest escapade, Frogger finds himself called upon to stop an evil force that threatens his home, Firefly Swamp, and the nearby kingdom of Bunnington Hollow. To stop the insidious Dr. Wani and his destructive mining efforts, Frogger must use all of his hopping and dodging skills, along with many new talents, to infiltrate the masterminds lair and bring his evil plans crashing down. [Konami]… Expand"}, {"name": "Doki-Doki Universe", "details_link": "https://www.metacritic.com/game/playstation-vita/doki-doki-universe", "publisher": "SCEA", "release_date": "Dec 10 2013", "developers": ["SCEA"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "genres": ["General", "Miscellaneous", "General"], "meta_score": 66, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/de0aae95825d420f2a3925d7ede01b1e-98.jpg", "descriptions": "Doki-Doki Universe is a charming interactive game that takes you on a journey to explore humanity and personal discovery.\r Doki-Doki Universe is a charming interactive game world that takes you on a journey to explore the concept of humanity. Players will travel to uniquely themed planetsDoki-Doki Universe is a charming interactive game that takes you on a journey to explore humanity and personal discovery.\r Doki-Doki Universe is a charming interactive game world that takes you on a journey to explore the concept of humanity. Players will travel to uniquely themed planets and asteroids to meet some of the most bizarre characters in an effort to learn more about them, and hopefully, learn a little bit more about themselves along the way.… Expand"}, {"name": "Classic NES Series: Dr. Mario", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-dr-mario", "publisher": "Nintendo", "release_date": "Oct 25 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/7bac1af3ccafdd64e625f433dce657d4-98.jpg", "descriptions": "Dr. Mario's simple yet addictive gameplay helped it to become an instant classic on the NES. Now this puzzle game lives on as part of the Classic NES Series on the Game Boy Advance. Dr. Mario challenges you to cure a virus outbreak by matching colorful pills with their viral counterparts.Dr. Mario's simple yet addictive gameplay helped it to become an instant classic on the NES. Now this puzzle game lives on as part of the Classic NES Series on the Game Boy Advance. Dr. Mario challenges you to cure a virus outbreak by matching colorful pills with their viral counterparts. The viruses and capsules disappear when four of the same color are lined up. With a wireless adapter or game link cable, you can play head-to-head with a friend.… Expand"}, {"name": "Super Trucks Racing", "details_link": "https://www.metacritic.com/game/playstation-2/super-trucks-racing", "publisher": "XS Games", "release_date": "Oct 29 2003", "developers": ["Jester Interactive"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/0b3363dda90206c6508c64fa1196db5e-98.jpg", "descriptions": "Features official teams, driver, circuits and trucks with action so realistic you can almost smell the diesel fumes! Super Trucks offers competitive challenges with a unique A.I. system that responds to your aggressive driving skills in various games modes such as single race, championshipFeatures official teams, driver, circuits and trucks with action so realistic you can almost smell the diesel fumes! Super Trucks offers competitive challenges with a unique A.I. system that responds to your aggressive driving skills in various games modes such as single race, championship modes, last one-standing, skid pan or challenge your friend in two player mode. If you live and breathe racing gaming this will offer you a quick fueled adrenaline rush that all race fans have been waiting for.… Expand"}, {"name": "Freaky Flyers", "details_link": "https://www.metacritic.com/game/playstation-2/freaky-flyers", "publisher": "Midway", "release_date": "Aug  5 2003", "developers": ["Midway Studios - San Diego"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/3426e92754bc6e29bbeb7e9916677fcc-98.jpg", "descriptions": "Never before has such a vibrant and interactive animated world been delivered to a flying videogame until Freaky Flyers, the first and only, fast and furious, fully-open 3-D airplane racing adventure, which drops you into the cockpits with the most unique and engaging cast of characters toNever before has such a vibrant and interactive animated world been delivered to a flying videogame until Freaky Flyers, the first and only, fast and furious, fully-open 3-D airplane racing adventure, which drops you into the cockpits with the most unique and engaging cast of characters to ever explore, adventure and dogfight in the videogame skies. [Midway]… Expand"}, {"name": "Auto Modellista", "details_link": "https://www.metacritic.com/game/playstation-2/auto-modellista", "publisher": "Capcom", "release_date": "Mar 25 2003", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/c891b4409239959e541592f335fa1cda-98.jpg", "descriptions": "(U.S. Version with Online capability) The future of online racing is now! Experience the first cell-shaded 3D arcade racing game of its kind on the PS2. Race head-to-head, up to 8 drivers online, up to 2 offline. Revolutionary VJ Feature: edit your instant replay footage and screen effects,(U.S. Version with Online capability) The future of online racing is now! Experience the first cell-shaded 3D arcade racing game of its kind on the PS2. Race head-to-head, up to 8 drivers online, up to 2 offline. Revolutionary VJ Feature: edit your instant replay footage and screen effects, music or save for later review. Easily customizable cars: tires, brakes, suspension, turbine kit, muffler, transmission and more with hundreds of parts to choose from! Sophisticated car physics and opponent car AI along with innovative cell-shaded graphics let you capture the true essence of racing. [Capcom]… Expand"}, {"name": "UFC: Tapout 2", "details_link": "https://www.metacritic.com/game/xbox/ufc-tapout-2", "publisher": "TDK Mediactive", "release_date": "Mar 20 2003", "developers": ["DreamFactory"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/b37c3ebd95e4a0aa43e0627e1632ae5b-98.jpg", "descriptions": "UFC: Tapout 2 takes \"real fighting\" to the next round, adding more realism, more fighters, and more moves to the series. Now you can go head-to-head with more than 35 real UFC fighters--each with their own set of moves and personalities. Create your own customizable fighter fromUFC: Tapout 2 takes \"real fighting\" to the next round, adding more realism, more fighters, and more moves to the series. Now you can go head-to-head with more than 35 real UFC fighters--each with their own set of moves and personalities. Create your own customizable fighter from scratch in Career mode, and then move up the ranks in single-player modes or in Tournament mode against your friends. You can even bash heads to the sounds of a new music soundtrack or your own personalized music from the Xbox hard drive.… Expand"}, {"name": "Disaster Report", "details_link": "https://www.metacritic.com/game/playstation-2/disaster-report", "publisher": "Agetec Inc.", "release_date": "Feb 15 2003", "developers": ["Irem"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/109dde3d9f78ffd3d6c74b6256dcc9a3-98.jpg", "descriptions": "Disaster Report (also known as \"SOS: The Final Escape\") places you in the role of a newspaper reporter stuck on an island that is continuously hit with severe aftershocks from a major earthquake. The objective is to escape-but to do so with as much of the story behind the destruction ofDisaster Report (also known as \"SOS: The Final Escape\") places you in the role of a newspaper reporter stuck on an island that is continuously hit with severe aftershocks from a major earthquake. The objective is to escape-but to do so with as much of the story behind the destruction of Capital City as possible. Considering the Government would like to keep the truth to itself, you'll soon find out that the wrath of nature may be less dangerous than upsetting the status quo of the Government. [Agetec]… Expand"}, {"name": "Defender", "details_link": "https://www.metacritic.com/game/gamecube/defender", "publisher": "Midway", "release_date": "Nov  3 2002", "developers": ["Inevitable Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/f0df5da29a2670b8d6e01460dd56ae1b-98.jpg", "descriptions": "Defender undergoes a 3D makeover, featuring fast-paced action, strategy, and an army of aliens. A remake of an arcade classic, Defender sends you on a mission to defend your solar system and save the human race from alien invasion. In addition to space combat action, the game showcasesDefender undergoes a 3D makeover, featuring fast-paced action, strategy, and an army of aliens. A remake of an arcade classic, Defender sends you on a mission to defend your solar system and save the human race from alien invasion. In addition to space combat action, the game showcases elements of strategy, multiple types of humans to protect and use, ground units for players to defend and position, and bases to build and expand. And now, you can upgrade your Defender ships with special weapons, shields, and other technologies.… Expand"}, {"name": "RPG Maker", "details_link": "https://www.metacritic.com/game/playstation/rpg-maker", "publisher": "Agetec Inc.", "release_date": "Sep 19 2000", "developers": ["Kuusou Kagaku"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/46750f05ed7393b383d8f7052800acc9-98.jpg", "descriptions": "For the first time ever, RPG fanatics are given the chance to be true game designers. You construct an entire RPG using the massive library of in-game design tools: plot your story path, create an incredibly nasty boss, customize dungeons and maps, even animate your own title screen. WhenFor the first time ever, RPG fanatics are given the chance to be true game designers. You construct an entire RPG using the massive library of in-game design tools: plot your story path, create an incredibly nasty boss, customize dungeons and maps, even animate your own title screen. When your RPG masterpiece is complete, save it and challenge friends to play through your one-of-a-kind fantasy adventure creation.… Expand"}, {"name": "Manual Samuel", "details_link": "https://www.metacritic.com/game/xbox-one/manual-samuel", "publisher": "Perfectly Paranormal", "release_date": "Oct 14 2016", "developers": ["Perfectly Paranormal"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Role-Playing", "Adventure", "General"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/60fba057a169993bb0a416e3af1b5832-98.jpg", "descriptions": "After a tough collision with a septic truck Samuel finds himself bargaining for his life. Eventually he agrees a deal for his life with chronically-uncool 90s throwback, Death, and now has to survive 24 hours doing everything manually."}, {"name": "Rise of Venice", "details_link": "https://www.metacritic.com/game/pc/rise-of-venice", "publisher": "Kalypso", "release_date": "Sep 27 2013", "developers": ["Kalypso"], "platforms": "PC", "genres": ["Strategy", "General", "General"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/c3214cf4caee18f5d27df198063af2d2-98.jpg", "descriptions": "Rise of Venice drops players in the Renaissance era, where they start out as a young merchant, looking to make his mark and build a trading empire.  Begin with a meager group of trading ships and build them into a mercantile fleet that will make your enemies and friends alike green withRise of Venice drops players in the Renaissance era, where they start out as a young merchant, looking to make his mark and build a trading empire.  Begin with a meager group of trading ships and build them into a mercantile fleet that will make your enemies and friends alike green with jealousy as you fill your coffers with gold! Rise of Venice is much more than trading, however, as Renaissance Europe was filled with treachery and political machinations of all sorts - which you must take part in if you plan to succeed!… Expand"}, {"name": "Colour Bind", "details_link": "https://www.metacritic.com/game/pc/colour-bind", "publisher": "Punch Puppy Productions", "release_date": "Sep 24 2012", "developers": ["Puppy Punch Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/9d84021a77584c0dce3c725c8c75ee82-98.jpg", "descriptions": "Colour Bind is a physics platform-puzzler set in an abstract world where gravity is determined not by mass, but by colour. Navigate this unique world by manipulating colour and gravity to solve each level. Beating each unique puzzle in Colour Bind will take patience, intelligence, quickColour Bind is a physics platform-puzzler set in an abstract world where gravity is determined not by mass, but by colour. Navigate this unique world by manipulating colour and gravity to solve each level. Beating each unique puzzle in Colour Bind will take patience, intelligence, quick reflexes and sometimes even a helping hand from a friend.… Expand"}, {"name": "Jam Sessions 2", "details_link": "https://www.metacritic.com/game/ds/jam-sessions-2", "publisher": "Ubisoft", "release_date": "Oct 20 2009", "developers": ["Plato"], "platforms": "DS", "genres": ["Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/5c755f14b7e6fe1f86f0bad3e6df323b-98.jpg", "descriptions": "Jam Sessions 2 is a guitar-game that makes learning to play the electric guitar fun and rewarding. Each song in the gameplay mode serves a different role in advancing players’ guitar skills and song writing abilities. By progressing through the songbook, players learn the guitar withoutJam Sessions 2 is a guitar-game that makes learning to play the electric guitar fun and rewarding. Each song in the gameplay mode serves a different role in advancing players’ guitar skills and song writing abilities. By progressing through the songbook, players learn the guitar without realizing they have been taught. Armed with their new skills, they can play songs and share their own original music with others. [Ubisoft]… Expand"}, {"name": "DC Super Hero Girls: Teen Power", "details_link": "https://www.metacritic.com/game/switch/dc-super-hero-girls-teen-power", "publisher": "Nintendo", "release_date": "Jun  4 2021", "developers": ["Nintendo", "TOYBOX"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/ddb4e218e75eb35f4b0c1786478eb056-98.jpg", "descriptions": "Suit up as the DC Super Hero Girls and save Metropolis. Join the fight as Wonder Woman, Supergirl, and Batgirl from the animated series DC Super Hero Girls, and save Metropolis from some of DC’s most notorious Super-Villains! Each hero can battle baddies with a unique set of abilities:Suit up as the DC Super Hero Girls and save Metropolis. Join the fight as Wonder Woman, Supergirl, and Batgirl from the animated series DC Super Hero Girls, and save Metropolis from some of DC’s most notorious Super-Villains! Each hero can battle baddies with a unique set of abilities: Wonder Woman uses her warrior skills with the Lasso of Truth and Flying Shield, Supergirl has Heat Vision and Super-Breath, and Batgirl can invent crime-fighting gadgets like the Batarang and Bat-Hook. But when you’re not out fighting crime, you have to balance the super life with their lives as teenagers!\r Freely explore the city as teenage Super Heroes\r Don’t forget to meet up at the best hangout spots from the show like Metropolis High School and Sweet Justice, which also happen to be great places where you can snap photos to share on Superstapost. But stay alert because you always have to protect your secret identity and you might even run into some of the city’s most mischievous Super-Villains like Harley Quinn, Catwoman, and Star Sapphire.… Expand"}, {"name": "Ultra Street Fighter II: The Final Challengers", "details_link": "https://www.metacritic.com/game/switch/ultra-street-fighter-ii-the-final-challengers", "publisher": "Capcom", "release_date": "May 26 2017", "developers": ["Capcom"], "platforms": "Switch", "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/de4ca30a4fa89b4978f9aa759ce4646b-98.jpg", "descriptions": "Street Fighter II, the game that defined the fighting game genre in the 1990s, is back on the Nintendo Switch. The newest iteration of SFII in nearly 10 years features all of the classic characters, a host of new features, as well as two new fighters; Evil Ryu and Violent Ken. Features aStreet Fighter II, the game that defined the fighting game genre in the 1990s, is back on the Nintendo Switch. The newest iteration of SFII in nearly 10 years features all of the classic characters, a host of new features, as well as two new fighters; Evil Ryu and Violent Ken. Features a stellar line-up of characters, including all the original fighters and bosses, the characters added in Super Street Fighter II, plus new additions Evil Ryu and Violent Ken. Choose between classic pixel-art graphics for a retro nostalgia trip, or enjoy a refined new modern look. Use the Joy-Con to challenge a second player anytime, anywhere. Pull off flashy super combos and show your opponent who the strongest is around. In addition to versus action, you can now team up with a friend to take on a CPU opponent. \r … Expand"}, {"name": "Ragnarok Odyssey", "details_link": "https://www.metacritic.com/game/playstation-vita/ragnarok-odyssey", "publisher": "XSEED Games", "release_date": "Oct 30 2012", "developers": ["Game Arts"], "platforms": "PlayStation Vita", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a9d217c9ad188713e963168ba3680e41-98.jpg", "descriptions": "Ragnarok Odyssey is set in an original world based on Norse mythology where a battle is being waged between humans and giants after the fall of the gods had previously separated the races."}, {"name": "Neopets Petpet Adventures: The Wand of Wishing", "details_link": "https://www.metacritic.com/game/psp/neopets-petpet-adventures-the-wand-of-wishing", "publisher": "SCEA", "release_date": "Mar 14 2006", "developers": ["SCEA"], "platforms": "PSP", "num_players": "24  Online", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/1b2c794c3bf16164972b1cb1e35318ea-98.jpg", "descriptions": "Neopets: Petpet Adventures -- The Wand of Wishing is an action RPG game that brings the hidden world of the petpets to life in 3D for the first time. Players can choose from a variety of popular petpet characters to play and, utilizing the wireless Ad-Hoc mode, they will also be able toNeopets: Petpet Adventures -- The Wand of Wishing is an action RPG game that brings the hidden world of the petpets to life in 3D for the first time. Players can choose from a variety of popular petpet characters to play and, utilizing the wireless Ad-Hoc mode, they will also be able to compete head-to-head in the Battledome and buy, sell and trade special items in the search to recover the fabled wand of wishing. [SCEA]… Expand"}, {"name": "Paradise Lost", "details_link": "https://www.metacritic.com/game/playstation-4/paradise-lost", "publisher": "All in! Games", "release_date": "Mar 24 2021", "developers": ["PolyAmorous"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/0/d210dad1906e3d8c8fe685302ae7496c-98.jpg", "descriptions": "It's winter, 1980. Szymon, a boy raised in a post-apocalyptic wasteland, finds an abandoned Nazi bunker. Will he find what he’s looking for? Play Paradise Lost and explore an underground world, where Slavic mythology mixes with retrofuturistic technology. Discover the last story on Earth."}, {"name": "Rad Rodgers", "details_link": "https://www.metacritic.com/game/playstation-4/rad-rodgers", "publisher": "THQ Nordic", "release_date": "Feb 21 2018", "developers": ["THQ Nordic"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/7/89c0512bc7b525273bec3c030d771505-98.jpg", "descriptions": "Rad is a rambunctious but spirited young boy who maybe plays too many video games. After dozing off at the tail end of a long night of gaming, Rad awakens to find his dusty old console has turned itself back on."}, {"name": "RIDE", "details_link": "https://www.metacritic.com/game/playstation-4/ride", "publisher": "Bandai Namco Games", "release_date": "Oct  6 2015", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "General", "Automobile"], "meta_score": 66, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/98ac431f7ebf6cad0a9ae8b771bf79d9-98.jpg", "descriptions": "The game features over one hundred bike models across 4 different categories: Superbikes, Supersports, Naked Bikes and Historic Bikes."}, {"name": "NFL Head Coach", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-head-coach", "publisher": "EA Sports", "release_date": "Jun 20 2006", "developers": ["EA Tiburon"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Management"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/79e3f4fd75c75853b93eaee295202f75-98.jpg", "descriptions": "NFL Head Coach reinvents football gaming by introducing the first 3D strategy sports game that challenges gamers to build and manage every aspect of a football team from the ground up. A simple conversation system and an engaging 3D graphical interface allow users to immerse themselves intoNFL Head Coach reinvents football gaming by introducing the first 3D strategy sports game that challenges gamers to build and manage every aspect of a football team from the ground up. A simple conversation system and an engaging 3D graphical interface allow users to immerse themselves into the lives of an NFL head coach. As head coach, you develop a team strategy, execute it on and off the field, and try to build a winning organization year after year. Your status as a coaching legend will rise and fall based on all of your actions as you strive to become the greatest head coach of all time. Behind the desk, on the practice field, or while wearing the headset on game days, take the reins of your favorite NFL team and lead it to victory. [Electronic Arts]… Expand"}, {"name": "Hidden Agenda", "details_link": "https://www.metacritic.com/game/playstation-4/hidden-agenda", "publisher": "Supermassive Games", "release_date": "Oct 24 2017", "developers": ["Supermassive Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Adventure", "3D", "Party / Minigame", "Third-Person"], "meta_score": 66, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/65adea755211466ca2538ec4116b69aa-98.jpg", "descriptions": "Blending the best elements of movies and games, this story-based adventure drops you into a tale rife with chilling moral dilemmas."}, {"name": "Dragon Age II: Legacy", "details_link": "https://www.metacritic.com/game/pc/dragon-age-ii-legacy", "publisher": "Electronic Arts", "release_date": "Jul 26 2011", "developers": ["BioWare"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "PC-style RPG", "Action RPG"], "meta_score": 66, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/4/87bea1539c11bfe33ec1f1dd68c12855-98.jpg", "descriptions": "Dragon Age II: Legacy is the first major story-based DLC for the PS3, 360, and PC."}, {"name": "Tak: The Great Juju Challenge", "details_link": "https://www.metacritic.com/game/ds/tak-the-great-juju-challenge", "publisher": "THQ", "release_date": "Sep 19 2005", "developers": ["Altron"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/0eca81d308acbad472934939a8008b24-98.jpg", "descriptions": "The third chapter in THQ's Tak series lets the player reprise the role of Tak, a shaman who uses magic to defeat enemies. Tak: The Great Juju Challenge features a new cooperative mode in which two players can solve puzzles together."}, {"name": "Super Meat Boy Forever", "details_link": "https://www.metacritic.com/game/switch/super-meat-boy-forever", "publisher": "Team Meat", "release_date": "Dec 23 2020", "developers": ["Team Meat"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 66, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/1d123ffe607a6ce4a174318893d32a10-98.jpg", "descriptions": "Super Meat Boy Forever takes place a few years after the events of Super Meat Boy. Meat Boy and Bandage Girl have been living a happy life free of Dr. Fetus for several years and they now have a wonderful little baby named Nugget. Nugget is joy personified and she is everything to Meat BoySuper Meat Boy Forever takes place a few years after the events of Super Meat Boy. Meat Boy and Bandage Girl have been living a happy life free of Dr. Fetus for several years and they now have a wonderful little baby named Nugget. Nugget is joy personified and she is everything to Meat Boy and Bandage Girl. One day while our heroes were on a picnic, Dr. Fetus snuck up on them, beat Meat Boy and Bandage Girl unconscious with a shovel and kidnapped Nugget! When our heroes came to and found that Nugget was missing, they knew who to go after. They cracked their knuckles and decided to never stop until they got Nugget back and taught Dr. Fetus a very important lesson. A lesson that can only be taught with punches and kicks.\r The challenge of Super Meat Boy returns in Super Meat Boy Forever. Levels are brutal, death is inevitable, and players will get that sweet feeling of accomplishment after beating a level. Players will run, jump, punch and kick their way through familiar settings and totally new worlds.\r What’s better than playing through Super Meat Boy Forever once? The answer is simple: Playing through Super Meat Boy Forever several times and having new levels to play each time. Levels are randomly generated and each time the game is completed the option to replay the game appears and generates a whole new experience by presenting different levels with their own unique secret locations. We’ve handcrafted literally thousands of levels for players to enjoy and conquer. You can replay Super Meat Boy Forever from start to finish several times before ever seeing a duplicate level. It is truly a remarkable feat of engineering and a monumental example of ignoring the limits of rational game design and production.… Expand"}, {"name": "Trivial Pursuit", "details_link": "https://www.metacritic.com/game/playstation-3/trivial-pursuit", "publisher": "Electronic Arts", "release_date": "Mar 10 2009", "developers": ["EA Bright Light"], "platforms": ["iPhone/iPad", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Board Games", "Board Games", "Board / Card Game"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/00e010408834e2c75e2e12aea33567dd-98.jpg", "descriptions": "The console version of Trivial Pursuit brings the party to the living room TV allowing players to customize the experience with several ways to play. Players can connect with friends in classic Trivial Pursuit mode, hone their knowledge with the single player mode, and gather their buddiesThe console version of Trivial Pursuit brings the party to the living room TV allowing players to customize the experience with several ways to play. Players can connect with friends in classic Trivial Pursuit mode, hone their knowledge with the single player mode, and gather their buddies and bet on their brains with the high stakes mode where every answer counts. [Electronic Arts]… Expand"}, {"name": "Armored Core: Formula Front - Extreme Battle", "details_link": "https://www.metacritic.com/game/psp/armored-core-formula-front---extreme-battle", "publisher": "Agetec", "release_date": "Dec 15 2005", "developers": ["From Software"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 66, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/3b5e96a2b76312b2e1856ed052f13043-98.jpg", "descriptions": "Agetec delivers the popular Armored Core series to the PSP. In this special edition for US gamers, Agetec has completely revamped the title with added features from its Japanese counterpart. Armored Core: Formula Front - Special Edition has everything the fans love from the Armored CoreAgetec delivers the popular Armored Core series to the PSP. In this special edition for US gamers, Agetec has completely revamped the title with added features from its Japanese counterpart. Armored Core: Formula Front - Special Edition has everything the fans love from the Armored Core series plus more, such as, artificial intelligence (AI) designing and wireless head-to-head action. [Agetec]… Expand"}, {"name": "DreamWorks Monsters vs. Aliens", "details_link": "https://www.metacritic.com/game/playstation-3/dreamworks-monsters-vs-aliens", "publisher": "Activision", "release_date": "Mar 24 2009", "developers": ["Beenox"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 66, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/6fe37e2a9559c211ff0cda1a62f67a7c-98.jpg", "descriptions": "Based on the DreamWorks 3D feature film, Monsters vs. Aliens puts the fate of the planet in players' hands, to save the world as only a monster can. Bash, skate, and ooze as the macho half-ape, half-fish The Missing Link, the 49’11\" tall woman, Ginormica, and the gelatinous, indestructible,Based on the DreamWorks 3D feature film, Monsters vs. Aliens puts the fate of the planet in players' hands, to save the world as only a monster can. Bash, skate, and ooze as the macho half-ape, half-fish The Missing Link, the 49’11\" tall woman, Ginormica, and the gelatinous, indestructible, and brainless B.O.B, with the help of the monstrous 350’ tall grub Insectosaurus. Plus, team up with the brilliant but insect-headed Dr. Cockroach, Ph.D. in co-op mode, to save the earth from the megalomaniacal alien Gallaxhar. Unleash unique powers as all your favorite monsters from the film - The Missing Link: Bash, bounce, swing, tail whip, and climb as this prehistoric brawler! B.O.B: Ooze through cracks, stick to ceilings, and absorb and spit out enemies as this gooey blob! Ginormica: Tower over the landscape, test your strength, and use cars as roller-skates as this battling behemoth. Battle through locations from the movie and beyond - Adventure across 20 distinct levels set in locations from the film and beyond, including the streets of San Francisco, Gallaxhar’s gargantuan spaceship, and the government’s super-secret monster containment facility. Play as a team in co-op mode - A second player can pick up a controller and drop in at anytime as Dr. Cockroach Ph.D. As the most brilliant scientist in the world, players can blast apart robots, toss away enemies, plus grab hard-to-reach upgrades and other rewards.… Expand"}, {"name": "Atelier Meruru: The Apprentice of Arland", "details_link": "https://www.metacritic.com/game/playstation-3/atelier-meruru-the-apprentice-of-arland", "publisher": "NIS America", "release_date": "May 29 2012", "developers": ["Gust"], "platforms": ["PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 66, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/a749e69006ece918d33eb167cb042009-98.jpg", "descriptions": "Atelier Meruru: The Apprentice of Arland is the third and final Atelier game set within the Arland world."}, {"name": "MechAssault: Phantom War", "details_link": "https://www.metacritic.com/game/ds/mechassault-phantom-war", "publisher": "Majesco Games", "release_date": "Sep 12 2006", "developers": ["Backbone Entertainment"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 66, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/507a4e4753b8a127324a8835e909fd31-98.jpg", "descriptions": "The year is 3134 and after 60 years of peace and prosperity, the Republic of the Sphere is now living in a dark age of ex-communication.  Nearly all Hyperpulse Generators (HPGs), the pinnacles of interstellar communication, have been struck by a virus leaving worlds cut off from allThe year is 3134 and after 60 years of peace and prosperity, the Republic of the Sphere is now living in a dark age of ex-communication.  Nearly all Hyperpulse Generators (HPGs), the pinnacles of interstellar communication, have been struck by a virus leaving worlds cut off from all information.  With involuntary blinders on, no one in the Republic knows when, or where, the next attack could be coming from. Their only hope is to turn the HPG into an instrument of war. [Majesco]… Expand"}, {"name": "Gretzky NHL 2005", "details_link": "https://www.metacritic.com/game/playstation-2/gretzky-nhl-2005", "publisher": "SCEA", "release_date": "Nov  9 2004", "developers": ["Page 44 Studios"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 66, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/b6f111d0e79600fdf1916c3aef017376-98.jpg", "descriptions": "Gretzky NHL 2005 features players with detailed facial animations that convey the power and emotion of their sport, EyeToy functionality, which allows gamers to put their face into the game and become an NHL player, and breathtaking arenas complete with arena-specific game intros, goal hornsGretzky NHL 2005 features players with detailed facial animations that convey the power and emotion of their sport, EyeToy functionality, which allows gamers to put their face into the game and become an NHL player, and breathtaking arenas complete with arena-specific game intros, goal horns and interactive crowds. To challenge the skill levels of all hockey videogame fans, Gretzky NHL 2005 offers an extensive list of gameplay modes including Tournament Mode with customizable tournaments, Franchise (Season) Mode where gamers act as owners, Online Mode with downloadable roster updates and Rivalry Mode, which sets the stage to revisit the ultimate heated match-up time after time. By combining authentic gameplay, intuitive play controls and an enhanced presentation with the fast, fluid, hard-hitting intensity of arcade style play, Gretzky NHL 2005 delivers the look, feel and passion of hockey and provides gamers with a true-to-life simulation. [989 Sports]… Expand"}, {"name": "Arthur and the Invisibles", "details_link": "https://www.metacritic.com/game/playstation-2/arthur-and-the-invisibles", "publisher": "Atari", "release_date": "Jan  9 2007", "developers": ["Etranges Libellules"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/78253324c297f9fdcef443a86d34c748-98.jpg", "descriptions": "Directly inspired by the animated film of the same name, Arthur and the Invisibles allows players to relive the adventures depicted in the film, which tells the story of young Arthur who finds the magical adventure of a lifetime in his own backyard. Players assume the role of Arthur and hisDirectly inspired by the animated film of the same name, Arthur and the Invisibles allows players to relive the adventures depicted in the film, which tells the story of young Arthur who finds the magical adventure of a lifetime in his own backyard. Players assume the role of Arthur and his two companions in their mission to save the Land of the Invisibles and its Minimoy inhabitants destruction. The game incorporates filmmaker Luc Besson's rich Minimoys universe with the same richness and extraordinary visuals of the film. Gameplay is based on the concept of the \"trio\" - each phase of a puzzle or combat requires utilizing the skills of all three characters (Arthur, Selenia and Betameche); Each character has unique but complimentary powers which players must use to their advantage. The three heroes have their own particular objectives, but they must also aid one other; More than 20 hours of gameplay, fighting, puzzles, driving and flying; Players can watch integrated scenes from the film offered in the form of parallel action phases. [Atari]… Expand"}, {"name": "Crystar", "details_link": "https://www.metacritic.com/game/switch/crystar", "publisher": "NIS America", "release_date": "Mar 29 2022", "developers": ["FuRyu", "Gemdrops"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/3de8b31eedd131660348eca541e814c9-98.jpg", "descriptions": "Crystar sets you in a grim world where lost souls dwell and your tears grant you power. Swap between a cast of unique playable characters and use their strengths to challenge deranged hordes of Specters and Revenants. Build up your Tear Gauge in battle and use it to summon mighty GuardiansCrystar sets you in a grim world where lost souls dwell and your tears grant you power. Swap between a cast of unique playable characters and use their strengths to challenge deranged hordes of Specters and Revenants. Build up your Tear Gauge in battle and use it to summon mighty Guardians to stand alongside you. And when the Torments from defeated foes threaten to overwhelm you with despair, weep and grieve to achieve catharsis and draw strength from your woes to enhance your attacks and armor.… Expand"}, {"name": "Winds & Leaves", "details_link": "https://www.metacritic.com/game/playstation-4/winds-leaves", "publisher": "Trebuchet", "release_date": "Jul 27 2021", "developers": ["Trebuchet"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "First-Person"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/f872d930812471d98fc8f2ba00b3f22e-98.jpg", "descriptions": "Learn to read the signs of the various climates, awaken old landmarks, and grow your own forests in this PlayStation VR flora builder. Stranded in a barren landscape, you are the only being capable of mastering the ancient art of growing vegetation. Journey across the Steppe to discoverLearn to read the signs of the various climates, awaken old landmarks, and grow your own forests in this PlayStation VR flora builder. Stranded in a barren landscape, you are the only being capable of mastering the ancient art of growing vegetation. Journey across the Steppe to discover landmarks left behind from a previous time. Uncover their secrets in order to unlock new equipment and gather ancient dormant seed varieties. Find the perfect conditions to plant them in and you'll witness magnificent trees grow to maturity and transform the landscape.\r… Expand"}, {"name": "Fairy Tail", "details_link": "https://www.metacritic.com/game/pc/fairy-tail", "publisher": "Koei Tecmo Games", "release_date": "Jul 15 2020", "developers": ["Gust"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/a6e47a82e692c4aee2fc8cea6fdec719-98.jpg", "descriptions": "Fight for Your Guild with Powerful Magical Abilities in FAIRY TAIL FAIRY TAIL, based on Hiro Mashima's best-selling manga and anime series of the same name, follows the spell-binding plot from \"The Grand Magic Games\" story arc -- enabling gamers to re-live, or experience for the firstFight for Your Guild with Powerful Magical Abilities in FAIRY TAIL FAIRY TAIL, based on Hiro Mashima's best-selling manga and anime series of the same name, follows the spell-binding plot from \"The Grand Magic Games\" story arc -- enabling gamers to re-live, or experience for the first time, the exciting episodes of this fan-favorite storyline. Not only will they be able to experience stories previously told in the manga and anime, but they will even be able to enjoy never before seen story and quest elements.Throughout their journey, players will be able to form a party from a selection of over ten iconic characters, including: the fire dragon slayer, Natsu Dragneel; the celestial mage, Lucy Heartfilia; the ice-make mage, Gray Fullbuster; the fairy queen 'Titania', Erza Scarlet; and the young sky dragon slayer, Wendy Marvell. With a wealth of guild members to recruit to their party, players can form their own dream team even including an unlikely group of allies for their own unique adventure.The fiery and intense magical battles from the series are breathtakingly brought to life in FAIRY TAIL's environment; with a diverse range of magic available for the extraordinary characters to wield. Renowned moves from the series light up the screen, with some characters such as Natsu being able to take advantage of mode changes like utilizing the eye-popping Lightning Fire Dragon Mode. In addition, some guild members will be available to support in battle; including the Fairy Tail Guild Master, Makarov Dreyar, who can be called in to provide powerful aid on the battlefield.In FAIRY TAIL, completing battles and quests will not only level up party members, it will lead to character bonding scenarios, provide options to upgrade the guild, and eventually raise the 'Guild Rank' enabling players to take on more challenging missions in their quest to become the greatest guild in Fiore.… Expand"}, {"name": "Night Call", "details_link": "https://www.metacritic.com/game/switch/night-call", "publisher": "Raw Fury", "release_date": "Jun 24 2020", "developers": ["BlackMuffin Studio"], "platforms": ["PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/3e91527ee57577d9dc4dde6919a8bbe8-98.jpg", "descriptions": "A mysterious serial killer stalks the streets of modern-day Paris. The body count rises, and the police are no closer to catching the culprit. You are a taxi driver and survivor to the killer's most recent attacks, having barely escaped with your life. You have seven nights to help find theA mysterious serial killer stalks the streets of modern-day Paris. The body count rises, and the police are no closer to catching the culprit. You are a taxi driver and survivor to the killer's most recent attacks, having barely escaped with your life. You have seven nights to help find the killer, or the police will pin it on you. These next few shifts will be far from ordinary or safe...Night Call is a non-linear, narrative-driven noire investigation game. You are no detective, but you do have a gift. Around you, people feel more at ease. They talk. They share their thoughts, their emotions, their stories... their secrets. To passengers, you are more than just a driver; you are also a friend, a confidant, a shrink. A voyeur catching a glimpse under the masked but very real lives throughout the City of Light. And you'll need to play these roles well if you want to catch the killer.Use the limited time you have available each night to gather clues while earning money to pay your bills. Drive passengers to their destinations, hear their stories and choose your responses carefully -- some are just regular people with a tale to tell, while others might reveal a clue that's key to your investigation. Follow the right leads to uncover new info about the suspects, and don't forget to make enough money to buy gas and pay your bills.Can you solve the mystery before it's too late? Better hurry -- both the clock and the meter are running...… Expand"}, {"name": "American Fugitive", "details_link": "https://www.metacritic.com/game/pc/american-fugitive", "publisher": "Curve Digital", "release_date": "May 21 2019", "developers": ["Fallen Tree Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox", "Open-World"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/e57e345d0fe79ca1c390eaaf8fd00c59-98.jpg", "descriptions": "A modern take on classic sandbox action. Framed for your father’s murder, you’ll need to do whatever it takes to unveil the real culprit. Tackle thrilling missions for the criminal underworld — just don’t let the cops track you down! Set in the deep south of the 80s, American Fugitive is aA modern take on classic sandbox action. Framed for your father’s murder, you’ll need to do whatever it takes to unveil the real culprit. Tackle thrilling missions for the criminal underworld — just don’t let the cops track you down! Set in the deep south of the 80s, American Fugitive is a love-letter to the classic movies and games of old.… Expand"}, {"name": "Vaporum", "details_link": "https://www.metacritic.com/game/xbox-one/vaporum", "publisher": "Merge Games", "release_date": "Apr 10 2019", "developers": ["Merge Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/8feb1401e89affee1973d28216b554c7-98.jpg", "descriptions": "Vaporum is a grid-based dungeon crawler RPG in an original steampunk setting, inspired by old-school classics of the genre. Stranded in the middle of an ocean, in front of a gigantic tower, the hero has to find out what the place is, what happened there, and most importantly, who he is."}, {"name": "Call of Cthulhu", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-cthulhu", "publisher": "Focus Home Interactive", "release_date": "Oct 30 2018", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Survival"], "meta_score": 66, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/6/b6eec01fa679e1678f69924be6a05dd2-98.jpg", "descriptions": "Plunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods withinPlunge into Cyanide Studio's Call of Cthulhu, the official Cthulhu videogame inspired by Chaosium's classic pen and paper RPG. Uncover the chilling mysteries of this RPG-investigation game, descending deep into a world of cosmic horrors, creeping madness, and shrouded Old Gods within Lovecraft's iconic universe.\r The Cthulhu Mythos has been fascinating audiences for generations, growing to become one of the largest shared universes ever envisioned and giving birth to countless stories, novels, movies, tabletop and videogames since the original publication of H.P. Lovecraft's The Call of Cthulhu. Adaptions and references have formed a widespread legacy stretching back to the very beginning of the 20th century, latching on to the key fear of the human psyche: that of the unknown. Now, Call of Cthulhu will bring the mythos to life like never before, on PlayStation 4, Xbox One and PC.\r In this world, nothing is as it seems. Sanity is an irregular bedfellow, all too often replaced by the whisperings in the dark. Strange creatures, weird science, and shadowy cults dominate the Cthulhu Mythos, intent on realizing their mad schemes to bring about the end of everything. Your mind will suffer -- balancing a razor-thin line between sanity and madness, your senses will be disrupted until you question the reality of everything around you. Trust no one. Creeping shadows hide lurking figures... and all the while, the Great Dreamer prepares for his awakening.… Expand"}, {"name": "Through the Woods", "details_link": "https://www.metacritic.com/game/xbox-one/through-the-woods", "publisher": "Antagonist", "release_date": "May  2 2018", "developers": ["Antagonist"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/730babad77673981f44cd959a93b53ea-98.jpg", "descriptions": "Set on the coast of Norway, Through the Woods tells the story of the extremes a mother would go to in order to save her child.  The narrative begins with the mother, Karen, who is being interrogated regarding the mysterious disappearance of her son.  Gameplay starts as she recounts theSet on the coast of Norway, Through the Woods tells the story of the extremes a mother would go to in order to save her child.  The narrative begins with the mother, Karen, who is being interrogated regarding the mysterious disappearance of her son.  Gameplay starts as she recounts the terrible events surrounding this tragedy.… Expand"}, {"name": "Titan Quest", "details_link": "https://www.metacritic.com/game/xbox-one/titan-quest", "publisher": "THQ Nordic", "release_date": "Mar 20 2018", "developers": ["THQ Nordic"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/c61605d209f3666a2e033e08ecd3e7e1-98.jpg", "descriptions": "Discover the Courage that Turns Heroes Into Legends.\rFrom Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative, all-new action role playing game set in ancient Greece, Egypt and Asia.\rThe Titans have escaped their eternal prison, wreaking havocDiscover the Courage that Turns Heroes Into Legends.\rFrom Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative, all-new action role playing game set in ancient Greece, Egypt and Asia.\rThe Titans have escaped their eternal prison, wreaking havoc upon the earth. The gods seek a hero who can turn the tide in an epic struggle that will determine the fate of both men and gods. Are you ready for the quest?\r *    Explore the Ancient World - Unlock arcane mysteries and battle the beasts of mythology as you journey to the Parthenon, Great Pyramids, Hanging Gardens of Babylon, The Great Wall and other legendary locations.\r*    Amazing Graphical Detail - Take a hero's journey through authentic Ancient World settings crafted in stunning, realistic, 3D detail.\r*    Conquer Monsters of Legend - Battle horrific monsters and mythical beasts in a story-driven campaign that will determine the fate of all existence.\r*    Highly Customizable Characters - Build and customize your characters with 28 classes and over 1000 pieces of unique and legendary items to create the ultimate champion.\r*    Create Your Own Worlds - Create your own maps with the easy-to-use World Editor for endless adventuring.\r*    Online Multiplayer Gameplay - Challenge others to experience your map creations in fast-action, 2-6 player online cooperative gameplay.… Expand"}, {"name": "Infinite Minigolf", "details_link": "https://www.metacritic.com/game/switch/infinite-minigolf", "publisher": "Zen Studios", "release_date": "Aug  3 2017", "developers": ["Zen Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/0c0645a3a3eb2655a317732e8086fc81-98.jpg", "descriptions": "Create and play on an unlimited amount of minigolf courses in Infinite Minigolf, a never ending minigolf experience from the experts at Zen Studios! Take part in competitive tournaments and challenges, unlock and utilize powerups, and experience unique gameplay, amazing graphics, and moreCreate and play on an unlimited amount of minigolf courses in Infinite Minigolf, a never ending minigolf experience from the experts at Zen Studios! Take part in competitive tournaments and challenges, unlock and utilize powerups, and experience unique gameplay, amazing graphics, and more wrapped up in the coolest minigolf game available. Infinite Minigolf crafts an astounding minigolf experience with accurate physics, dazzling graphics and detailed environments, each one with a distinct visual theme and gameplay features. Use the gam'es robust toolset to create your own amazing minigolf courses and share them with the community, showcasing your creative abilities to other players worldwide. Create, share and play with the Infinite Minigolf community now.\r… Expand"}, {"name": "MonsterBag", "details_link": "https://www.metacritic.com/game/playstation-vita/monsterbag", "publisher": "SCEA", "release_date": "Apr  7 2015", "developers": ["IguanaBee"], "platforms": "PlayStation Vita", "genres": ["Puzzle", "Action", "General"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/e7adf5327e1277717366caaf0b21ae2c-98.jpg", "descriptions": "Forgetful Nia leaves behind her monster backpack, V, on her way to the bus stop. In a world afraid of monsters, help V catch up to Nia while avoiding been seen by the humans. Oh, yeah! Watch out for the apocalypse."}, {"name": "The Last Tinker: City of Colors", "details_link": "https://www.metacritic.com/game/playstation-4/the-last-tinker-city-of-colors", "publisher": "LOOT Entertainment", "release_date": "Aug 19 2014", "developers": ["LOOT Entertainment"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/3/adb5ddcd4bde8a7d0318b669e1d53ef1-98.jpg", "descriptions": "The indie-developed rebirth of platform games.\r A joyous platformer frequently compared to Jak and Daxter, The Last Tinker is a colorful adventure set in Colortown, a world built upon creativity, emotion and collaboration. A dark force named The Bleakness has emerged and seeks to tear theThe indie-developed rebirth of platform games.\r A joyous platformer frequently compared to Jak and Daxter, The Last Tinker is a colorful adventure set in Colortown, a world built upon creativity, emotion and collaboration. A dark force named The Bleakness has emerged and seeks to tear the colors apart, draining all joy and life from the world. Koru, a young boy from the slums of Colortown, is forced to act. He embarks on an epic and one of a kind adventure to combat the Bleakness and to restore joy and color to his home.… Expand"}, {"name": "Strike Suit Infinity", "details_link": "https://www.metacritic.com/game/pc/strike-suit-infinity", "publisher": "Born Ready Games", "release_date": "Apr 30 2013", "developers": ["Born Ready Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/9feaf7b3a82f65a88ec8fc06ad241b42-98.jpg", "descriptions": "In Strike Suit Infinity, players fight to stay alive as long as possible against a never-ending armada of enemies, with the intention of surviving each round and climbing as high up the leaderboards as possible. Each round is comprised of numerous waves of enemies, which get progressivelyIn Strike Suit Infinity, players fight to stay alive as long as possible against a never-ending armada of enemies, with the intention of surviving each round and climbing as high up the leaderboards as possible. Each round is comprised of numerous waves of enemies, which get progressively harder.\rIn order to reach the top of the leaderboard, players will need to successfully chain their scoring to increase their score multiplier. The multiplier will decay however, so players must maintain rhythm while quickly dispatching enemy ships.… Expand"}, {"name": "Puzzle Agent", "details_link": "https://www.metacritic.com/game/playstation-3/puzzle-agent", "publisher": "Telltale Games", "release_date": "Apr 19 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3"], "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/7/4241d9f5938f991a8b2bf1951f246b3c-98.jpg", "descriptions": "As the government's sole Puzzle Agent, Tethers has his hands full: the strange case of Scoggins plunges him into a mystery that will challenge every ounce of his expertise, and possibly his very wits too. Tethers must overcome brainteasers at every turn, including mazes, logic puzzles andAs the government's sole Puzzle Agent, Tethers has his hands full: the strange case of Scoggins plunges him into a mystery that will challenge every ounce of his expertise, and possibly his very wits too. Tethers must overcome brainteasers at every turn, including mazes, logic puzzles and riddles. He soon realizes that these - along with the clinically pre-occupied townspeople, secret societies, and mysterious sounds from the forest - are intimately connected to the core conundrum. And what's with the gnomes?… Expand"}, {"name": "Michael Jackson The Experience", "details_link": "https://www.metacritic.com/game/playstation-3/michael-jackson-the-experience", "publisher": "Ubisoft", "release_date": "Apr 12 2011", "developers": ["Ubisoft Montreal"], "platforms": ["3DS", "iPhone/iPad", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "1-4 ", "genres": ["Action", "Miscellaneous", "Rhythm", "General", "Dancing", "Dancing"], "meta_score": 66, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/4aaeb1b15dec5ffc66cea7739ac8140f-98.jpg", "descriptions": "Michael Jackson, one of the most widely beloved entertainers and the most popular global icons of all time, leaves an indelible imprint on popular music and culture. During his extraordinary career Jackson sold an estimated 750 million records worldwide, released 13 No.1 singles and becameMichael Jackson, one of the most widely beloved entertainers and the most popular global icons of all time, leaves an indelible imprint on popular music and culture. During his extraordinary career Jackson sold an estimated 750 million records worldwide, released 13 No.1 singles and became one of a handful of artists to be inducted twice into the Rock and Roll Hall of Fame. He won 13 Grammy Awards and received the American Music Award's Artist of the Century Award. His album “Thriller” is the world’s best-selling album of all time with more than 110 million copies sold. … Expand"}, {"name": "DJ Star", "details_link": "https://www.metacritic.com/game/ds/dj-star", "publisher": "Deep Silver", "release_date": "Nov 10 2009", "developers": ["Game Life"], "platforms": "DS", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/1bfa3d2ed315e2fc63e8c3d6b2a14866-98.jpg", "descriptions": "Two main modes include Career and Creation."}, {"name": "Octomania", "details_link": "https://www.metacritic.com/game/wii/octomania", "publisher": "Conspiracy Entertainment", "release_date": "Mar 31 2008", "developers": ["Compile Heart"], "platforms": "Wii", "num_players": "2  Online", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f0d99748b8278c68e40aed03c2bdae45-98.jpg", "descriptions": "On a peaceful day in the land of Lonronpia, Kari, an apprentice magician, is summoning up her favorite treat. When her spell goes horribly awry, hundreds of thousands of colored octopi suddenly rain down from the clouds. A guardian angel appears before her, asking Kari to rid the land of theOn a peaceful day in the land of Lonronpia, Kari, an apprentice magician, is summoning up her favorite treat. When her spell goes horribly awry, hundreds of thousands of colored octopi suddenly rain down from the clouds. A guardian angel appears before her, asking Kari to rid the land of the octopi and undo the damage of her failed spell. Encounter zany foes on your quest to rid Lonronpia of octopi! Story mode takes you to multiple locales to battle a variety of clever and humorous opponents, while Arcade mode lets you jump straight into the action. You can even opt to play in \"Endless mode,\" where it's all about how long you can hang in there before your screen fills up. Local head-to-head and Nintendo Wi-Fi Connection multiplayer modes. Whether you're playing alone, alongside a friend, or against a random player online, the fast-paced puzzle gameplay promises to be a blast. Two players can face off online, and up to four players can play in local multiplayer. Combo chains, special attacks, multiple difficulty levels... Experienced gamers will find a lot to enjoy, but newcomers will find just as much fun to be had. And with the included tutorial mode, anyone can pick it up and play. [Conspiracy Entertainment]… Expand"}, {"name": "The House of the Dead 2 & 3 Return", "details_link": "https://www.metacritic.com/game/wii/the-house-of-the-dead-2-3-return", "publisher": "Sega", "release_date": "Mar 11 2008", "developers": ["Sega"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Miscellaneous", "Shooter", "Compilation", "Light Gun"], "meta_score": 66, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/6e142b412d51c8844b137a50753adaff-98.jpg", "descriptions": "Two grisly titles from the popular THE HOUSE OF THE DEAD series are being compiled into one action-packed horror shooter for the Wii. Both THE HOUSE OF THE DEAD 2 and III feature the original arcade experience, complete with branching storylines, over six ghoul-filled game modes and bonusTwo grisly titles from the popular THE HOUSE OF THE DEAD series are being compiled into one action-packed horror shooter for the Wii. Both THE HOUSE OF THE DEAD 2 and III feature the original arcade experience, complete with branching storylines, over six ghoul-filled game modes and bonus content. Re-live your glory days in the arcades and mow down packs of clawing, biting undead with the new rapid-fire Wii Zapper. Experience the popular arcade shooting action at home. Blast the undead with the quick trigger action of the Wii Zapper. Co-op gameplay. Grab a friend and destroy the undead together including Arcade mode and Original mode. Gory arcade graphics. THE HOUSE OF THE DEAD 2 & 3 RETURN retains the rich arcade graphics you love. [Sega]… Expand"}, {"name": "The Sims 2: Castaway", "details_link": "https://www.metacritic.com/game/ds/the-sims-2-castaway", "publisher": "Electronic Arts", "release_date": "Oct 22 2007", "developers": ["Full Fat"], "platforms": ["PC", "PlayStation 2", "DS"], "num_players": "1 Player", "genres": ["Simulation", "Miscellaneous", "General", "Virtual", "Virtual Life"], "meta_score": 66, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/63b796d310be94780c3fc1677c0d7353-98.jpg", "descriptions": "Help your Sims build a life from scratch after washing ashore on a deserted tropical island. Overcome the forces of nature to help them become the ultimate survivors and thrive in this undiscovered paradise while unearthing clues that will lead them back to civilization. Build shelters,Help your Sims build a life from scratch after washing ashore on a deserted tropical island. Overcome the forces of nature to help them become the ultimate survivors and thrive in this undiscovered paradise while unearthing clues that will lead them back to civilization. Build shelters, craft unique items, and discover many useful treasures and ancient mysteries hidden deep within a diverse jungle environment filled with plants, fruits, and even wildlife. Your Sims change as they take on the challenges of island life and learn to survive in style. Create a new life for your Sims on an uncharted island in The Sims 2 Castaway. [Electronic Arts]… Expand"}, {"name": "Wanted: A Wild Western Adventure", "details_link": "https://www.metacritic.com/game/pc/wanted-a-wild-western-adventure", "publisher": "The Adventure Company", "release_date": "Oct  3 2004", "developers": ["Revistonic", "Revistronic"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "Historic", "Historic", "Point-and-Click"], "meta_score": 66, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/eb8142f491aee1ca9eb32207c63884ed-98.jpg", "descriptions": "(Also known as \"Fenimore Fillmore: The Westerner\")  Riding his horse out somewhere in the Wild West, our hero, Fenimore Fillmore comes to a place where some farmers have settled down. A powerful rancher, lord and master of the whole area, wants to get rid of the farmers, who he sees as (Also known as \"Fenimore Fillmore: The Westerner\")  Riding his horse out somewhere in the Wild West, our hero, Fenimore Fillmore comes to a place where some farmers have settled down. A powerful rancher, lord and master of the whole area, wants to get rid of the farmers, who he sees as invaders of name of the evil rancher, has a small army of gunmen and thugs, who spend their time threatening and terrifying the farmers, who are few in number and poorly armed. Fenimore, of course,  will side with the weakest and will help them take on Starek. After going to a meeting on the farmers, where they tell him about their problems, Fenimore knows what he must do and he feels it even more keenly when he's checked out the whole area, visiting the village, which is also under Starek's control. The sheriff, the banker, the station master and the others all work for the same boss, which means that Fenimore won't be able to count on them, in fact just the opposite, he'll have to take them all on. There's just one person apart from Fenimore on the farmers' side and that the wicked Starek's own niece, a beautiful girl called Rhiannon, who works, against her uncle's wishes, as teacher of the farmers' children. Fenimore, of course, falls straightaway under the spell of the girl, which gives him a good reason to fight even harder for the farmers. Fenimore faces up to endless trials, both great and small as he tries to defend them, taking on Starek's men, first in a fist fight in the village and later with his gun in an ambush. In short: non-stop action, humor, a range of tough but amusing sitations, and all with the unmistakable flabor of the Wild West. [Revistronic]… Expand"}, {"name": "SSX Tricky", "details_link": "https://www.metacritic.com/game/game-boy-advance/ssx-tricky", "publisher": "EA Sports Big", "release_date": "Oct 31 2002", "developers": ["Visual Impact"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/23f29e994ee185c228c34a042bc43454-98.jpg", "descriptions": "SSX Tricky launches you into a world of monster air, intense tracks, and death-defying tricks. Six all-new competitors plus six riders from the original SSX make up the circuit. Compete in the World Circuit, go head-to-head in the Showoff versions of nine courses on the World Circuit, orSSX Tricky launches you into a world of monster air, intense tracks, and death-defying tricks. Six all-new competitors plus six riders from the original SSX make up the circuit. Compete in the World Circuit, go head-to-head in the Showoff versions of nine courses on the World Circuit, or just practice in Free Ride. With all-new Garibaldi and Valdez courses, you'll have plenty of huge cliff drops to catch big air and pull off Uber tricks.… Expand"}, {"name": "Crash Bandicoot: The Wrath of Cortex", "details_link": "https://www.metacritic.com/game/playstation-2/crash-bandicoot-the-wrath-of-cortex", "publisher": "VU Games", "release_date": "Oct 29 2001", "developers": ["Traveller's Tales"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/6984eff2186a2ab5a418048b150b3e38-98.jpg", "descriptions": "Dr. Cortex, a beaten genius, creates something so devious and so underhanded that the entire world will fall to its feet in fear. By harnessing the destructive energies of earth, fire, air and water he creates Crunch, a Super-Bandicoot that is ready to demolish all that lies before him.Dr. Cortex, a beaten genius, creates something so devious and so underhanded that the entire world will fall to its feet in fear. By harnessing the destructive energies of earth, fire, air and water he creates Crunch, a Super-Bandicoot that is ready to demolish all that lies before him.  Will Crash and Coco be up to the challenge? [Universal]… Expand"}, {"name": "The Bouncer", "details_link": "https://www.metacritic.com/game/playstation-2/the-bouncer", "publisher": "Square EA", "release_date": "Mar  5 2001", "developers": ["DreamFactory"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 66, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/6859963940fcca3e5c4d6b4879837219-98.jpg", "descriptions": "A typical evening at a local bar erupts into chaos as members of a Special Forces strike team descend through the roof to kidnap a young girl, Dominique. Three bouncers--Sion, Volt, and Kou--come to the rescue, only to see the invaders grab Dominique, retreat through a window, and escape.A typical evening at a local bar erupts into chaos as members of a Special Forces strike team descend through the roof to kidnap a young girl, Dominique. Three bouncers--Sion, Volt, and Kou--come to the rescue, only to see the invaders grab Dominique, retreat through a window, and escape. Now it's up to you to save Dominique either alone or simultaneously with three friends. With The Bouncer's 3D combat environment, battles can take place anywhere. … Expand"}, {"name": "NASCAR 2001", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-2001", "publisher": "EA Sports", "release_date": "Nov  6 2000", "developers": ["EA Sports"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/30806610bbfa70ccc35461393b4ba63e-98.jpg", "descriptions": "Easily the most ambitious NASCAR game to date on any platform, NASCAR 2001 has been designed from the ground up with completely original programming code that takes advantage of the power of the PlayStation 2. With the advanced power of the Emotion Engine, the designers for NASCAR 2001 haveEasily the most ambitious NASCAR game to date on any platform, NASCAR 2001 has been designed from the ground up with completely original programming code that takes advantage of the power of the PlayStation 2. With the advanced power of the Emotion Engine, the designers for NASCAR 2001 have been able to duplicate key driving points and strategies of some of the biggest names in the racing field. Gone are the days of one-dimensional AI, thanks to independent artificial intelligence routines geared towards each racer's personality--older drivers will wisely hold back until key moments, while the rookies and speed demons will be more prone to charging recklessly into turns. Thirty-five active drivers with their respective cars (complete with sponsors) are available to rip around 14 different tracks--including night races and (in a NASCAR game first) Daytona. Body deformation, particle effects (like smoke and fire), sparks, tire marks on the road, and wall marks ensure that it looks as good as it plays.… Expand"}, {"name": "Universe at War: Earth Assault", "details_link": "https://www.metacritic.com/game/xbox-360/universe-at-war-earth-assault", "publisher": "Sega", "release_date": "Mar 25 2008", "developers": ["Petroglyph"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 66, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/e33e1fb804cb7139dd356abe10ce73f7-98.jpg", "descriptions": "Developed by Petroglyph, this combat-intensive real-time strategy game enlists players in an epic struggle to prevent total alien domination of planet Earth. Universe at War: Earth Assault is set in the near-future when multiple factions from across the galaxy have come to Earth to wage epicDeveloped by Petroglyph, this combat-intensive real-time strategy game enlists players in an epic struggle to prevent total alien domination of planet Earth. Universe at War: Earth Assault is set in the near-future when multiple factions from across the galaxy have come to Earth to wage epic warfare. Containing numerous features and customization options never-before-seen in the RTS genre, Universe at War: Earth Assault creates an exceptional strategy experience for single-player and especially multiplayer battles. The game employs a unique balance system called \"Tactical Dynamics\" that allows players to retrain and customize units in the midst of battle to better cope with enemy forces and tactical situations. Weaponry and defenses can be modified in true real-time to take advantage of constantly shifting battlefield conditions. Fully customizable tech trees allow players to control the development of technologies that they deem key to victory. Battles in Universe at War: Earth Assault are large in scope and take place in malleable and deforming environments. Deadly sci-fi weapons and alien powers will allow players to destroy cities and whole territories on a global scale. Because the world of Universe at War: Earth Assault is persistent, players can revisit previous battlegrounds to find them still smoldering in ruins. The game gives players achievements points, rewards, and medals in a balanced environment to further encourage players to move forward in the game. Players from around the world battle in persistent-style online campaigns for ultimate faction supremacy across a virtual representation of the Earth. The Xbox 360 game employs a control scheme built from the ground up to ensure smooth gameplay and ease of command for console gamers. [Sega]… Expand"}, {"name": "Fuel", "details_link": "https://www.metacritic.com/game/xbox-360/fuel", "publisher": "Codemasters", "release_date": "Jun  2 2009", "developers": ["Asobo Studio"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "General", "General"], "meta_score": 66, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/c7ed8008d46cca6eb56cad17090f8f14-98.jpg", "descriptions": "Get fuelled up and prepare to race and explore the world's largest ever racing environment - over 5,000 square miles of spectacular wilderness. Set to revolutionise multi-terrain, multi-vehicle racing, FUEL is a fiercely competitive game without boundaries. On and off-road, two andGet fuelled up and prepare to race and explore the world's largest ever racing environment - over 5,000 square miles of spectacular wilderness. Set to revolutionise multi-terrain, multi-vehicle racing, FUEL is a fiercely competitive game without boundaries. On and off-road, two and four-wheeled vehicles race a massively diverse environment, from scaling the highest snow-capped mountain to racing the deepest arid canyon. In a fictional present, vast swathes of the United States have been ravaged by the extreme effects of accelerated global warming: tornados, brush fires, hurricanes and tsunamis have driven people from their homes leaving huge areas of America abandoned. Now these dangerous areas have created the perfect playground for a new breed of adrenaline junkies who set out to conquer each other, and Mother Nature, in closely fought races. There are over 70 different vehicles with which to take on any challenge that FUEL’s stunning environment throws at you. On-road and off-road bikes, cars, quads, trucks, buggies and dragsters take dangerous short-cuts, perform death-defying jumps and tear through spectacular cross-over points. FUEL's landscape is powered by cutting-edge technology and, using satellite data, features some of the most exciting and inspiring areas of America - including the Grand Canyon, Yosemite National Park, Mount Rainier and much more. In FUEL, if you can see it, you can drive to it, taking any route - on or off-road - that you want.  With a draw distance of 40KM, 100,000 miles of roads, tracks and trails and hundreds of race events FUEL’s epic world demands to be explored. [Codmasters]… Expand"}, {"name": "Kingdom Hearts III - Re Mind", "details_link": "https://www.metacritic.com/game/playstation-4/kingdom-hearts-iii---re-mind", "publisher": "Square Enix", "release_date": "Jan 23 2020", "developers": ["Square Enix"], "platforms": ["Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/6/3b2e6d44082d51ae90fca93c4af56e91-98.jpg", "descriptions": "Re Mind—The other tale that unfolded during the climax of KINGDOM HEARTS III. Determined to rescue Kairi, Sora travels to the Keyblade Graveyard a short time before the final battle was to take place. Lacking a corporeal form, he traces the hearts of the seven guardians of light. ThroughRe Mind—The other tale that unfolded during the climax of KINGDOM HEARTS III. Determined to rescue Kairi, Sora travels to the Keyblade Graveyard a short time before the final battle was to take place. Lacking a corporeal form, he traces the hearts of the seven guardians of light. Through experiencing their personal battles firsthand, Sora is about to discover truths that he has never before imagined.… Expand"}, {"name": "The Last Remnant", "details_link": "https://www.metacritic.com/game/pc/the-last-remnant", "publisher": "Square Enix", "release_date": "Mar 24 2009", "developers": ["Square Enix"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 66, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/7db1fe98f00d9146cda1c9b7f83d52f3-98.jpg", "descriptions": "Long ago, the world was filled with Remnants — mysterious artifacts from an ancient civilization. But as time passed, the powers of the Remnants began to shift the world's balance. As the rift widened between those who ruled and those who were ruled over, a new era dawned: one of countlessLong ago, the world was filled with Remnants — mysterious artifacts from an ancient civilization. But as time passed, the powers of the Remnants began to shift the world's balance. As the rift widened between those who ruled and those who were ruled over, a new era dawned: one of countless frays brought upon the world by those enslaved by their own lust for power. A thousand years later, the journey of one young man begins... Imagine a vast, war-torn battlefield, scarred by years of conflict. Countless enemies surround the player, who is backed up by his own army. Threatened by numerous foes and saved in the nick of time by allies, players feel the true tension of a soldier on the battlefield. In The Last Remnant, as many as seventy units duke it out at once in fierce yet beautiful battles. [Square Enix]… Expand"}, {"name": "Dark Fall: Lights Out", "details_link": "https://www.metacritic.com/game/pc/dark-fall-lights-out", "publisher": "The Adventure Company", "release_date": "Aug 31 2004", "developers": ["XXV Productions"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person", "Modern", "Modern"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/51c05f2498cab8be268c2f1ad29a169c-98.jpg", "descriptions": "A young cartographer, Parker, is sent to the Cornish harbour town of Trewarthan, where he is to map the lethal rocks that have claimed lives through the centuries. A thick fog rolls in from the English Channel as the faithful light of Fetch Rock Lighthouse is plunged into darkness, puttingA young cartographer, Parker, is sent to the Cornish harbour town of Trewarthan, where he is to map the lethal rocks that have claimed lives through the centuries. A thick fog rolls in from the English Channel as the faithful light of Fetch Rock Lighthouse is plunged into darkness, putting the lives of those at sea in peril. Parker may be their only hope. Armed with his compass, charts and wits he sets off to uncover the mystery. Along the way he discovers that Fetch Rock and its lighthouse have a very sinister history? Is time running out? Or does it have an agenda of its own...More than 50 realistic locations to uncover and explore. Spectral activity to observe and interact with. A virtual cast of actors with voice acting by the original Dark Fall cast (the Dark Fall Players). Explore the lighthouse in three different historical time settings. [Adventure Company]… Expand"}, {"name": "Blazing Angels: Squadrons of WWII", "details_link": "https://www.metacritic.com/game/xbox-360/blazing-angels-squadrons-of-wwii", "publisher": "Ubisoft", "release_date": "Mar 23 2006", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "16  Online", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 66, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/9a399e1a103494f6ec70114e138d8f9f-98.jpg", "descriptions": "During the course of the 18-mission campaign, players will evolve along with their wingmen into an ace fighting force. Spectacular graphics enhance the combat experience in true World War II battle sites such as England, Germany, France, Morocco, Pearl Harbor, Midway and Tokyo. The heroicDuring the course of the 18-mission campaign, players will evolve along with their wingmen into an ace fighting force. Spectacular graphics enhance the combat experience in true World War II battle sites such as England, Germany, France, Morocco, Pearl Harbor, Midway and Tokyo. The heroic storyline that follows the evolution of a single squadron and the cinematic presentation create moments reminiscent of classic World War II movies. Pilots fly in close to Germany’s industrial terrain during a bombing raid or emerge from the fog and cloud cover over London to engage the enemy. Up to 16 players online can engage over Xbox Live online game service in head-to-head dogfights or cooperative team play between squadrons in 10 additional missions. [Ubisoft]… Expand"}, {"name": "nail'd", "details_link": "https://www.metacritic.com/game/playstation-3/naild", "publisher": "Deep Silver", "release_date": "Nov 30 2010", "developers": ["Techland"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/76df9fd59ea36a83bf04f17a3fc77b5f-98.jpg", "descriptions": "nail’d is all about eschewing boring realism for over the top arcade fun. It’s a racer that challenges everything from player reflexes through to the rules of physics. Riding on ATVs and motocross bikes with powerful boost controls, players will race down near-vertical courses of incrediblenail’d is all about eschewing boring realism for over the top arcade fun. It’s a racer that challenges everything from player reflexes through to the rules of physics. Riding on ATVs and motocross bikes with powerful boost controls, players will race down near-vertical courses of incredible jumps, stunts and obstacles. The brutal challenge of the Yosemite National Park is but one of the places they’ll learn the meaning of verticality.… Expand"}, {"name": "LEGO Indiana Jones 2: The Adventure Continues", "details_link": "https://www.metacritic.com/game/pc/lego-indiana-jones-2-the-adventure-continues", "publisher": "LucasArts", "release_date": "Nov 17 2009", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/090d79548fab6ab7b6124f73daf720b3-98.jpg", "descriptions": "LEGO Indiana Jones 2 presents a tongue-in-cheek take on all four cinematic adventures of pop culture’s most iconic archaeologist, including for the first time ever Indiana Jones and the Kingdom of the Crystal Skull and will give players the ability to create levels of their own! [LucasArts]"}, {"name": "Disney Pirates of the Caribbean: At World's End", "details_link": "https://www.metacritic.com/game/ds/disney-pirates-of-the-caribbean-at-worlds-end", "publisher": "Disney Interactive Studios", "release_date": "May 22 2007", "developers": ["Amaze Entertainment"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "DS"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Linear"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/9/4caaa21c3a19d094910fec5921f12987-98.jpg", "descriptions": "At World's End video games from Disney Interactive Studios invite players to \"live and die by the sword\" as they venture to the worlds of the films and beyond while playing as Captain Jack Sparrow, Will Turner and Elizabeth Swann. [Disney Interactive Studios]"}, {"name": "Close to the Sun", "details_link": "https://www.metacritic.com/game/pc/close-to-the-sun", "publisher": "Wired Productions", "release_date": "May  2 2019", "developers": ["Storm in a Teacup"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 66, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/a3efb139d03c69dfd40bc8077edcc647-98.jpg", "descriptions": "It’s 1897. Deep in international waters, the Helios stands still. Dark clouds loom overhead as unforgiving waves crash against the hull. Colossal effigies of gold, decorated with magnificent finery, stretch as far as the eye can see.\r Born of Nikola Tesla’s vision, the Helios serves as aIt’s 1897. Deep in international waters, the Helios stands still. Dark clouds loom overhead as unforgiving waves crash against the hull. Colossal effigies of gold, decorated with magnificent finery, stretch as far as the eye can see.\r Born of Nikola Tesla’s vision, the Helios serves as a haven for the greatest scientific minds. An unbound utopia for research, independent from state and isolated from the gaze of society. Free to push the boundaries of matter and time.\r Journalist Rose Archer steps aboard the Helios in search of her sister Ada. She quickly discovers not all is as it seems. Grand halls stand empty. The stench of rotting flesh lingers in the air. Silence. A single word is painted across the entrance… QUARANTINE!… Expand"}, {"name": "Berserk and the Band of the Hawk", "details_link": "https://www.metacritic.com/game/playstation-4/berserk-and-the-band-of-the-hawk", "publisher": "Koei Tecmo Games", "release_date": "Feb 21 2017", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/08a75c772c705ef9fa00490faced59db-98.jpg", "descriptions": "This story is set in a time of chaos, in a land where the Midland Kingdom and the Chuder Empire have been locked in a widespread war for over one hundred years. During one battle, a lone mercenary, Guts, attracts the attention of the mercenaries of the Band of the Hawk, and is ambushed byThis story is set in a time of chaos, in a land where the Midland Kingdom and the Chuder Empire have been locked in a widespread war for over one hundred years. During one battle, a lone mercenary, Guts, attracts the attention of the mercenaries of the Band of the Hawk, and is ambushed by some of them on the road. After losing in a duel to the leader of the Hawks, Griffith, Guts is forced to join their band, where he acquires many new comrades, including a woman named Casca, a Unit Commander in the band. With Guts fighting as the Raiders Captain, the Band of the Hawk continues to come off victorious in all of their battles, and finally earns recognition from the King of Midland himself. Fighting now under the Midland banner, the Band raids a castle occupied by a legendary swordsman and rumored immortal named Nosferatu Zodd. Zodd defeats both Guts and Griffith, but in the last moment he notices the Crimson Behelit that Griffith wears around his neck, and leaves without killing them. The Band of the Hawk continues to gain fame on the battlefield, and in the end, using only 5000 men fighting with their backs to the river, manages to capture the impregnable Fortress of Doldrey. This victory brings the end to the war between Midland and Chuder. [KOEI]… Expand"}, {"name": "Major League Baseball 2K6", "details_link": "https://www.metacritic.com/game/xbox-360/major-league-baseball-2k6", "publisher": "2K Sports", "release_date": "Apr 10 2006", "developers": ["Kush Games"], "platforms": ["PlayStation 2", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 66, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/3/fd2b23d0d386726f061b23b931aadffc-98.jpg", "descriptions": "As the exclusive and official Major League Baseball multi-platform video game, Major League Baseball 2K6 includes innovative features such as a new movement system and realistic player collisions on the infield and outfield. New broadcast elements include flashback replays, and a uniqueAs the exclusive and official Major League Baseball multi-platform video game, Major League Baseball 2K6 includes innovative features such as a new movement system and realistic player collisions on the infield and outfield. New broadcast elements include flashback replays, and a unique player morale system will unfold the drama like never before in a baseball video game. The World Baseball Classic is featured exclusively in Major League Baseball 2K6. [2K Sports]… Expand"}, {"name": "Lightning Returns: Final Fantasy XIII", "details_link": "https://www.metacritic.com/game/playstation-3/lightning-returns-final-fantasy-xiii", "publisher": "Square Enix", "release_date": "Feb 11 2014", "developers": ["Square Enix"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General", "Japanese-Style"], "meta_score": 66, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/37a49a44770cf85304316eb75e5404c8-98.jpg", "descriptions": "A direct sequel to the unhelpfully titled Final Fantasy XIII-2, Lightning Returns is another action-RPG, this time with a retooled gameplay system and a story that picks up a mere 500 years later, concluding the FFXIII saga."}, {"name": "Monster Energy Supercross - The Official Videogame 4", "details_link": "https://www.metacritic.com/game/playstation-5/monster-energy-supercross---the-official-videogame-4", "publisher": "Koch Media", "release_date": "Mar  8 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 16 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/7b49f52ef9c7e4d8a34752b602cbb92e-98.jpg", "descriptions": "Cross is Super Again. The official videogame of the Monster Energy AMA Supercross Championship is back with its fourth edition, promising to be the most extreme ever.\r A SUPER CAREER\r\nMake your way along the path that will lead you to success. A new career mode will put your abilities toCross is Super Again. The official videogame of the Monster Energy AMA Supercross Championship is back with its fourth edition, promising to be the most extreme ever.\r A SUPER CAREER\rMake your way along the path that will lead you to success. A new career mode will put your abilities to the test in order to bring out the champion inside you!\rLearn new riding abilities in the ''Future'' category; refine them and obtain new sponsors in the ''Rookie'' category. Become a real ''Pro'' by taking your riding style to the limit and challenging the toughest adversaries in the 450SX class.\r CREATOR OF YOUR OWN FUN\rUnbridle your imagination with the new editor. Build unique tracks with the modules inspired by the official tracks and share your creations with the community.\r THE NEW COMPOUND\rExplore, seek out new adventures, train, and challenge your friends in the new compound. Hurtle through fantastic island scenarios. Satisfy your desire for thrills!\r SUPER RIDERS, SUPER TRACKS\rChoose your favorite rider from an army of over 100 riders as you range over the 450SX and 250SX categories. Race in the 11 stadiums and on the 17 tracks of the season.\r FULL CUSTOMIZATION… Expand"}, {"name": "Redout 2", "details_link": "https://www.metacritic.com/game/playstation-5/redout-2", "publisher": "Saber Interactive", "release_date": "Jun 16 2022", "developers": ["34BigThings"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 6 ", "genres": ["Racing", "Arcade", "Futuristic"], "meta_score": 66, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/0026d79b0023163cee8e7652c0e16174-98.jpg", "descriptions": "The fastest racing game in the universe. Redout 2 is a tribute to classic arcade racing games and the sequel to the critically acclaimed Redout. Reach impossible speeds in exhilarating futuristic races across an extensive single-player campaign and competitive multiplayer."}, {"name": "The Cruel King and the Great Hero", "details_link": "https://www.metacritic.com/game/playstation-4/the-cruel-king-and-the-great-hero", "publisher": "NIS America", "release_date": "Mar 15 2022", "developers": ["Nippon Ichi Software"], "platforms": ["Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 66, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/1bb3bbbd1c606ed57f6384d9e7dce28e-98.jpg", "descriptions": "The Wicked King and the Noble Hero is an RPG with a human child named Yuu and the dragon that acts as her foster parent.\r In the game, the world was ruled by the dragon overlord, and it was defeated by the hero. But instead of killing the dragon, the hero decided just to cut off its hornsThe Wicked King and the Noble Hero is an RPG with a human child named Yuu and the dragon that acts as her foster parent.\r In the game, the world was ruled by the dragon overlord, and it was defeated by the hero. But instead of killing the dragon, the hero decided just to cut off its horns where his power came from, and the two became friends. One day, the hero returns to the dragon with his daughter named Yuu asking to look after her.\r The dragon telling to Yuu about her father's feat and then she decided to become a hero like her father.… Expand"}, {"name": "Marvel's Avengers", "details_link": "https://www.metacritic.com/game/xbox-one/marvels-avengers", "publisher": "Square Enix", "release_date": "Sep  1 2020", "developers": ["Crystal Dynamics", "Eidos Montreal"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox Series X", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 66, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/0/4812b073113df8000071b5614ab14e6e-98.jpg", "descriptions": "Marvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend theMarvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend the Earth from escalating threats.… Expand"}, {"name": "The Golf Club", "details_link": "https://www.metacritic.com/game/playstation-4/the-golf-club", "publisher": "HB Studios Multimedia", "release_date": "Aug 19 2014", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Traditional", "Sports", "Individual", "Golf", "Sim"], "meta_score": 66, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/9/f8dca568da945deb4663667cf0475603-98.jpg", "descriptions": "The Golf Club is HB Studios' next generation golf simulation. What really takes The Golf Club into the next generation is the procedural generation of courses and depth of social interaction. The Course Creator can generate a brand new course in seconds which can be shared and playedThe Golf Club is HB Studios' next generation golf simulation. What really takes The Golf Club into the next generation is the procedural generation of courses and depth of social interaction. The Course Creator can generate a brand new course in seconds which can be shared and played immediately online with friends and other gamers across the world. There are also full editing capabilities for courses, Tournaments and Tours. Challenge your friends on a new or existing course in real time or try to beat their best recorded round. Add to this a myriad of stat tracking and personal bests of friends and rivals to beat, notifications, challenges and social media integration.… Expand"}, {"name": "Armored Core: Verdict Day", "details_link": "https://www.metacritic.com/game/playstation-3/armored-core-verdict-day", "publisher": "Namco Bandai Games America", "release_date": "Sep 24 2013", "developers": ["From Software"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Simulation", "Sci-Fi", "Vehicle", "Mech", "Mech", "Combat"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/0f932506ed6e75bae2cac41cf2904e8a-98.jpg", "descriptions": "Japanese game developer FromSoftware returns to its hardcore mech action franchise with ARMORED CORE: VERDICT DAY.  Command a squadron of advanced Armored Core mechs in a dystopian future ravaged by war and stripped of natural resources.  Players will form squads of up to 20 members andJapanese game developer FromSoftware returns to its hardcore mech action franchise with ARMORED CORE: VERDICT DAY.  Command a squadron of advanced Armored Core mechs in a dystopian future ravaged by war and stripped of natural resources.  Players will form squads of up to 20 members and enlist into one of the various in-game factions to wrestle control of territories away from other players in the game's persistent multiplayer mode.  New gameplay features will be implemented into ARMORED CORE: VERDICT DAY to ensure that players who choose to play alone will be able to recruit a squad of A.I. controlled mechs and enjoy the robust feature sets of co-op and multiplayer modes, while new matchmaking system ensures that players will always find battles at a moment's notice.… Expand"}, {"name": "Medal of Honor: Above and Beyond", "details_link": "https://www.metacritic.com/game/pc/medal-of-honor-above-and-beyond", "publisher": "Electronic Arts", "release_date": "Dec 10 2020", "developers": ["Respawn Entertainment"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/18aa6bb00189780bf421b3b0b3596c32-98.jpg", "descriptions": "Medal of Honor: Above and Beyond is an action-packed and incredibly immersive VR experience set in World War II, where you step into the boots of an agent of the Office of Strategic Services (OSS) in war torn Europe. A deep single-player campaign takes you through historic events on land,Medal of Honor: Above and Beyond is an action-packed and incredibly immersive VR experience set in World War II, where you step into the boots of an agent of the Office of Strategic Services (OSS) in war torn Europe. A deep single-player campaign takes you through historic events on land, air, and sea, sabotaging Nazi bases, subverting enemy plans, aiding the French Resistance, and much, much more. With the Oculus Rift, we’re bringing players into the Medal of Honor series in an entirely new way, with an experience that transports you back to Europe in the 1940s. It’s the closest thing to a time machine you’ll ever see.… Expand"}, {"name": "State of Decay 2", "details_link": "https://www.metacritic.com/game/xbox-one/state-of-decay-2", "publisher": "Microsoft Game Studios", "release_date": "May 18 2018", "developers": ["Undead Labs"], "platforms": ["PC", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Survival", "Open-World"], "meta_score": 66, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/5bcddbacfc74c3f7ddd846f89a9f635c-98.jpg", "descriptions": "Small-Town America, one year from today. The dead have risen, and civilization has fallen. Even the military couldn’t stop the zombies, and now humanity stands on the brink of extinction. It's up to you to gather survivors and build a community, explore your lasting legacy, and redefine whatSmall-Town America, one year from today. The dead have risen, and civilization has fallen. Even the military couldn’t stop the zombies, and now humanity stands on the brink of extinction. It's up to you to gather survivors and build a community, explore your lasting legacy, and redefine what it means to survive. It’s up to you to build your base, develop your characters, and manage resources to survive as a group in this post-apocalyptic zombie open world. RPG progression - Develop each survivor’s skills to improve their capabilities and strengthen your community. Play solo or team up with up to three friends to explore an open world filled with dynamic zombies, human enemies, and the valuable gear necessary to keep your community alive. In the zombie apocalypse, you must create your own moral code. Every decision has lasting consequences that you must face. How you decide to survive may surprise you. [Microsoft]… Expand"}, {"name": "The Elder Scrolls V: Skyrim - Dawnguard", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-v-skyrim---dawnguard", "publisher": "Bethesda Softworks", "release_date": "Aug  2 2012", "developers": ["Bethesda Game Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/b0edf2c6302d2a4909b589d110c88b03-98.jpg", "descriptions": "Dawnguard is the first game add-on for The Elder Scrolls V: Skyrim."}, {"name": "L.A. Noire: Reefer Madness", "details_link": "https://www.metacritic.com/game/xbox-360/la-noire-reefer-madness", "publisher": "Rockstar Games", "release_date": "Jul 12 2011", "developers": ["Team Bondi"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Modern", "Third-Person", "Modern"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/699e30932e6b5d835d4779653ce6783e-98.jpg", "descriptions": "Vice Narcotics receives a tip from one Freddie Calhoun, junkie, snitch and all around no-hoper. Freddie seems to be playing it straight for once, sharing information on a city-wide marijuana distribution ring. Detective Phelps and Earle will search, question and raid their way to the top ofVice Narcotics receives a tip from one Freddie Calhoun, junkie, snitch and all around no-hoper. Freddie seems to be playing it straight for once, sharing information on a city-wide marijuana distribution ring. Detective Phelps and Earle will search, question and raid their way to the top of the operation, and in the process learn how the crooks could be smuggling fifty pound shipments of dope in plain sight.… Expand"}, {"name": "High Velocity Bowling", "details_link": "https://www.metacritic.com/game/playstation-3/high-velocity-bowling", "publisher": "SCEA", "release_date": "Dec  6 2007", "developers": ["SCEA"], "platforms": "PlayStation 3", "genres": ["Sports", "Alternative", "Individual", "Bowling", "Bowling"], "meta_score": 66, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/ffb0ba267684707870e9df5548db1214-98.jpg", "descriptions": "[Downloadable Game]  It's time to bowl - High Velocity style! Meet the High Velocity Bowlers. Each High Velocity Bowler has their own unique personality, skill-set, and attributes. Use the SIXAXIS wireless controller to simulate a genuine bowling swing with real lane environments, providing[Downloadable Game]  It's time to bowl - High Velocity style! Meet the High Velocity Bowlers. Each High Velocity Bowler has their own unique personality, skill-set, and attributes. Use the SIXAXIS wireless controller to simulate a genuine bowling swing with real lane environments, providing a truly next-gen bowling game. Compete to unlock eight distinctive characters and progress through eight themed alleys on their way to bowling domination. 1-4 Multiplayer - 8 unique characters with their own themed alley to unlock through game play. Fully controlled by the SIXAXIS motion sensors to simulate a real bowling swing. Challenge Mode - Progress through a series of tournaments, matches, and trick shot showmanship to unlock hidden characters and lanes. Trophy Room – View all the trophies, rings, and patches you’ve accumulated. [SCEA]… Expand"}, {"name": "Agatha Christie: Evil Under the Sun", "details_link": "https://www.metacritic.com/game/pc/agatha-christie-evil-under-the-sun", "publisher": "The Adventure Company", "release_date": "Oct 16 2007", "developers": ["AWE Games"], "platforms": "PC", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 66, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/ac85c4f7cfc21342691dfb4755eebdbc-98.jpg", "descriptions": "Famous detective Hercule Poirot is back in typical style, turning up at just the right time to begin an investigation into the murder of a famous actress during what should have been the start of a relaxing holiday. Taking on the role of Hercule Poirot, players can scour a stunning tropicalFamous detective Hercule Poirot is back in typical style, turning up at just the right time to begin an investigation into the murder of a famous actress during what should have been the start of a relaxing holiday. Taking on the role of Hercule Poirot, players can scour a stunning tropical island for clues and delve deeper into the mysterious relationships between over 20 unique characters to search out the killer. [The Adventure Company]… Expand"}, {"name": "The Novelist", "details_link": "https://www.metacritic.com/game/pc/the-novelist", "publisher": "Orthogonal Games", "release_date": "Dec 10 2013", "developers": ["Orthogonal Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General"], "meta_score": 66, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/585948ad022628234457f7469cdbfc8b-98.jpg", "descriptions": "The Novelist asks one central question: can you achieve your dreams without pushing away the people you love? The game focuses on Dan Kaplan, a novelist struggling to write the most important book of his career while trying to be the best husband and father he can be. The Kaplans have comeThe Novelist asks one central question: can you achieve your dreams without pushing away the people you love? The game focuses on Dan Kaplan, a novelist struggling to write the most important book of his career while trying to be the best husband and father he can be. The Kaplans have come to a remote coastal home for the summer, unaware that they're sharing the house with a mysterious ghostly presence: you. Read the family's thoughts. Explore their memories. Uncover their desires and intervene in their lives. But stay out of sight; you can't help the Kaplans if they know there's a ghost in the house. It's up to you to decide how Dan's career and family life will evolve, but choose carefully; there are no easy answers, and every choice has a cost. Dan's relationships - to his work, his wife, and his son - react and shift in response to your choices. With a different sequence of events in every playthrough, The Novelist gives life to a unique experience each time you play. The decisions you make will define the Kaplans' lives, but they may also tell you something about yourself.… Expand"}, {"name": "Sinner: Sacrifice for Redemption", "details_link": "https://www.metacritic.com/game/xbox-one/sinner-sacrifice-for-redemption", "publisher": "Another Indie", "release_date": "Oct 18 2018", "developers": ["DarkStar Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 66, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/0/8a8e8b3221692131ae456849983a9a03-98.jpg", "descriptions": "Emerge from the depths a crumbling kingdom and to the challenge of defeating increasingly difficult demonic bosses. Choose aspects of yourself to weaken before defeating the avatars of Sin."}, {"name": "The Settlers: Rise of an Empire", "details_link": "https://www.metacritic.com/game/pc/the-settlers-rise-of-an-empire", "publisher": "Ubisoft", "release_date": "Sep 25 2007", "developers": ["Blue Byte"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "General", "Management", "Government"], "meta_score": 66, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/52d371822e9f67b48d11516efd1bf9e7-98.jpg", "descriptions": "In The Settlers: Rise of an Empire, the player builds lively, bustling towns in a medieval world. Each settler has his or her own daily routine, with a range of different actions and behaviors that can be observed by the player at all times. This enables the player to get the best out of theIn The Settlers: Rise of an Empire, the player builds lively, bustling towns in a medieval world. Each settler has his or her own daily routine, with a range of different actions and behaviors that can be observed by the player at all times. This enables the player to get the best out of the settlers, build up a flourishing economy, tend to the settlers’ needs and protect the empire against danger from the outside. By expanding the empire, the player can aspire to becoming a legendary king or queen. The game features an immersive, yet transparent economic system based on the resources, wares and goods produced by the settlers in their various trades and occupations. Create big, bustling medieval cities: Plot your expansion, manage your resources wisely and provide for your people. The Settlers Rise of an Empire offers gameplay that is easy to pick up and allows everybody from newbies to strategy experts to enjoy the game. Protect your citizens and your empire: Build up armies, vehicles and walls to protect your empire. Everything depends on your economy: Is your empire wealthy enough to supply a powerful defense force? Work together with one friend and play against another team: Will your division of labor be efficient enough to beat your opponent? A full living, detailed atmosphere: The RenderWare engine creates an extremely detailed universe with numerous plants, animals and other details that will attract the player. Four climatic zones: The four climatic zones and four seasons have full impact on recourse management and gameplay. Natural interaction of Settlers: All Settlers have their own daily lives and they interact naturally with each other. [Ubisoft]… Expand"}, {"name": "The Amazing Spider-Man", "details_link": "https://www.metacritic.com/game/wii-u/the-amazing-spider-man", "publisher": "Activision", "release_date": "Mar  5 2013", "developers": ["Beenox"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Xbox 360", "Wii U"], "genres": ["Action", "Action Adventure", "General", "General", "Open-World"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/af1b35c42970c3e6d6d2cc7efb299362-98.jpg", "descriptions": "Harness Spider-Man's powers with Manhattan as your playground. Set shortly after the events of Columbia Pictures' summer 2012 blockbuster, The Amazing Spider-Man throws New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge ofHarness Spider-Man's powers with Manhattan as your playground. Set shortly after the events of Columbia Pictures' summer 2012 blockbuster, The Amazing Spider-Man throws New York City's brand new hero back into free-roaming, web-slinging action, as he protects the Big Apple from a deluge of unimaginable threats.… Expand"}, {"name": "Classic NES Series: Excitebike", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-excitebike", "publisher": "Nintendo", "release_date": "Jun  2 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/0c748c54cd97087a5273c36f3ea8208f-98.jpg", "descriptions": "Nintendo rereleases Excitebike on the Game Boy Advance, complete with all the high-flying action from the original NES game. As in the original, your biker must keep his balance while flying through the air, avoid getting clipped by other racers, and prevent his bike from overheating. InNintendo rereleases Excitebike on the Game Boy Advance, complete with all the high-flying action from the original NES game. As in the original, your biker must keep his balance while flying through the air, avoid getting clipped by other racers, and prevent his bike from overheating. In Design mode, you can make your own course--with all the ramps, mounds, bridges, and other obstacles in the game--and then save the design for your friends to race on.… Expand"}, {"name": "Mafia", "details_link": "https://www.metacritic.com/game/xbox/mafia", "publisher": "Gathering", "release_date": "Mar 13 2004", "developers": ["Illusion Softworks"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 66, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/28b9a279f327e337b97683c2ef4e9984-98.jpg", "descriptions": "Play the role of Tommy, a man unhappy with his job as a driver in the Mafia.  You control Tommy through the streets of 1930's American city, complete with simulated traffic and authentic buildings.  Unwillingly accept assignments such as mob hits, car chases, bootlegging, shootouts,Play the role of Tommy, a man unhappy with his job as a driver in the Mafia.  You control Tommy through the streets of 1930's American city, complete with simulated traffic and authentic buildings.  Unwillingly accept assignments such as mob hits, car chases, bootlegging, shootouts, assassinations and bank robberies.  Drive over 60 cars based on real models from the 30's.  Choose from over 12 weapons ranging from baseball bats to the Tommy gun, to deal with those that dare to cross your path.  In the Mafia, there's never a dull moment.… Expand"}, {"name": "Real Myst", "details_link": "https://www.metacritic.com/game/pc/real-myst", "publisher": "Ubisoft", "release_date": "Nov 14 2000", "developers": ["Cyan Worlds"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "First-Person", "Fantasy"], "meta_score": 66, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/e36caf60aed52841060506e797db1560-98.jpg", "descriptions": "Now you can experience Myst the way the Miller Brothers originally envisioned it -- truly immersed in a world that lives and breathes around you, where the weather changes, the sun rises and sets, the trees sway in the wind, and animals scurry by.  [Mattel Interactive]"}, {"name": "Bust A Groove 2", "details_link": "https://www.metacritic.com/game/playstation/bust-a-groove-2", "publisher": "Enix Corporation", "release_date": "Mar 31 1999", "developers": ["Metro"], "platforms": "PlayStation", "num_players": "1-4 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 66, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/087929a7e830e50266217e7b9be0ddb1-98.jpg", "descriptions": "In the tradition of Bust a Groove, Bust a Groove 2 is a captivating game about music, rhythm, dancing, style and competition. In Bust a Groove 2, you control one of 18 characters who compete in an epic dance-a-thon in dynamic dance venues around the world and the universe. Bust a Groove 2In the tradition of Bust a Groove, Bust a Groove 2 is a captivating game about music, rhythm, dancing, style and competition. In Bust a Groove 2, you control one of 18 characters who compete in an epic dance-a-thon in dynamic dance venues around the world and the universe. Bust a Groove 2 has spectacular, fluid dance moves that allow even a casual gamer to become a natural dancer after just a few minutes.… Expand"}, {"name": "Battletoads", "details_link": "https://www.metacritic.com/game/pc/battletoads", "publisher": "Rare Ltd.", "release_date": "Aug 20 2020", "developers": ["Rare Ltd.", "Dlala Studios"], "platforms": ["Xbox One", "PC"], "num_players": "Up to 3 ", "genres": ["Action", "General"], "meta_score": 66, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/f239582b9ec1f43e38ae4928c153830a-98.jpg", "descriptions": "The Battletoads are Back. Rash, Zitz and Pimple are returning at last to Morph Attack their way through an all-new action-packed adventure of choreographed chaos, and couch co-op may never be the same again. 1-3 players take control of the Battletoads and team up to storm through wild andThe Battletoads are Back. Rash, Zitz and Pimple are returning at last to Morph Attack their way through an all-new action-packed adventure of choreographed chaos, and couch co-op may never be the same again. 1-3 players take control of the Battletoads and team up to storm through wild and unpredictable stages with only one rule expect the unexpected. Teamwork makes the dream work in a drop-in, drop-out gameplay blast, filled with over-the-top combat that anyone can enjoy, but only a True 'Toad can master. With a unique hand-animated cartoon style and packed with memorable characters and locations, the Battletoads are back for a larger-than-life brawl across the universe that promises to be fun alone, and unforgettable together.… Expand"}, {"name": "MotoGP 18", "details_link": "https://www.metacritic.com/game/playstation-4/motogp-18", "publisher": "Milestone S.r.l", "release_date": "Jun  7 2018", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 66, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/56e12e375a2b3d1c01daf25161dd609b-98.jpg", "descriptions": "Become the star of the 2018 MotoGP season. Pursue your career as a professional rider starting from the Red Bull MotoGP Rookies Cup up to the Premier class of the MotoGP."}, {"name": "FlatOut 4: Total Insanity", "details_link": "https://www.metacritic.com/game/xbox-one/flatout-4-total-insanity", "publisher": "Strategy First", "release_date": "Mar 17 2017", "developers": ["Strategy First", "Kylotonn"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 66, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/fb47bfecfa4256ab2f44689f4a7b2dd5-98.jpg", "descriptions": "Flatout 4: Total Insanity elevates the level of hard hitting, fast paced action in the demolition derby style racing genre. The game offers bigger, louder, better and more outrageous stunts and collisions. Also, fans of the genre can still enjoy some of the popular classic stunts too, asFlatout 4: Total Insanity elevates the level of hard hitting, fast paced action in the demolition derby style racing genre. The game offers bigger, louder, better and more outrageous stunts and collisions. Also, fans of the genre can still enjoy some of the popular classic stunts too, as FlatOut 4: Total Insanity offers something for FlatOut fans both new and familiar. … Expand"}, {"name": "Chaos Code: New Sign of Catastrophe", "details_link": "https://www.metacritic.com/game/playstation-4/chaos-code-new-sign-of-catastrophe", "publisher": "Arc System Works", "release_date": "Mar 15 2017", "developers": ["FK Digital"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 66, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/718769f325baf0a804cdb4846f829ec7-98.jpg", "descriptions": "Chaos Code -New Sign of Catastrophe- is a simple 2D fighter in which players can enjoy the thrill of fighting with flashy moves. Choose from 16 unique characters and fight in ranked matches to earn the top spot. [Playstation.com]"}, {"name": "Fallout: New Vegas - Honest Hearts", "details_link": "https://www.metacritic.com/game/pc/fallout-new-vegas---honest-hearts", "publisher": "Bethesda Softworks", "release_date": "May 17 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 66, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/49e3751ca3dd71b906399d935f623f09-98.jpg", "descriptions": "Honest Hearts takes you on an expedition to the unspoiled wilderness of Utah's Zion National Park. Things go horribly wrong when your caravan is ambushed by a tribal raiding band. As you try to find a way back to the Mojave, you become embroiled in a war between tribes and a conflict betweenHonest Hearts takes you on an expedition to the unspoiled wilderness of Utah's Zion National Park. Things go horribly wrong when your caravan is ambushed by a tribal raiding band. As you try to find a way back to the Mojave, you become embroiled in a war between tribes and a conflict between a New Canaanite missionary and the mysterious Burned Man. The decisions you make will determine the fate of Zion.… Expand"}, {"name": "Armada 2526", "details_link": "https://www.metacritic.com/game/pc/armada-2526", "publisher": "Tri Synergy", "release_date": "Nov 17 2009", "developers": ["Ntronium Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Action Adventure", "Turn-Based", "Fantasy", "General", "Fantasy", "4X"], "meta_score": 66, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/e6c8fb6812b1ea781ca9db5b9209422d-98.jpg", "descriptions": "Armada 2526 continues the great tradition of space opera games. You guide your race from its first interstellar journeys, until it becomes a mighty galactic empire. Along the way, you'll explore the galaxy, conduct research, diplomacy and trade, found new colonies, maneuver mighty starArmada 2526 continues the great tradition of space opera games. You guide your race from its first interstellar journeys, until it becomes a mighty galactic empire. Along the way, you'll explore the galaxy, conduct research, diplomacy and trade, found new colonies, maneuver mighty star fleets, and fight epic battles. Although the game is complex, and the possible strategies endless, powerful help and advisor features help you get up to speed quickly. [Matrix Games]… Expand"}, {"name": "Song of the Deep", "details_link": "https://www.metacritic.com/game/xbox-one/song-of-the-deep", "publisher": "Insomniac Games", "release_date": "Jul 12 2016", "developers": ["Insomniac Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 66, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/220d67afcd8eb04f5cb2f047dbc9c004-98.jpg", "descriptions": "In this game you’ll explore a huge undersea world, both free-diving and in a submarine. It’s a metroidvania style of progression where you are constantly getting new abilities and figuring out ways to upgrade them as you take on the seemingly impossible obstacles that stand in your way. It’sIn this game you’ll explore a huge undersea world, both free-diving and in a submarine. It’s a metroidvania style of progression where you are constantly getting new abilities and figuring out ways to upgrade them as you take on the seemingly impossible obstacles that stand in your way. It’s a challenging journey, designed to test your mind and your reflexes in equal amounts. [Insomniac]… Expand"}, {"name": "Fable II: Knothole Island", "details_link": "https://www.metacritic.com/game/xbox-360/fable-ii-knothole-island", "publisher": "Microsoft Game Studios", "release_date": "Jan 13 2009", "developers": ["Lionhead Studios"], "platforms": "Xbox 360", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 66, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/ae2806c55955d7d0e2025c31f1377925-98.jpg", "descriptions": "[Xbox Live Downloadable Content]  Discover new quests, locations, characters and more in the premium Knothole Island download. Meet Gordon the submariner in the Bowerstone docks, where you'll be showered with unique gifts to entice you to the mysterious island. There you will embark on new[Xbox Live Downloadable Content]  Discover new quests, locations, characters and more in the premium Knothole Island download. Meet Gordon the submariner in the Bowerstone docks, where you'll be showered with unique gifts to entice you to the mysterious island. There you will embark on new adventures, fight new creatures and find Albion's rarest weapons, clothes and potions. You will also be able to check your standing in over 50 new Leaderboards on Lionhead.com. If you have the Knothole Island (Premium) pack and want to play co-op in any part of Albion, your co-op partner must have the Fable II Knothole Island (Free) or (Premium) pack. To enjoy the complete Knothole Island experience in co-op play, both players must download the Knothole Island (Premium) pack. [Microsoft]… Expand"}]