[{"name": "Desperados: Wanted Dead or Alive", "details_link": "https://www.metacritic.com/game/pc/desperados-wanted-dead-or-alive", "publisher": "Infogrames", "release_date": "Jul 23 2001", "developers": ["Spellbound"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "General", "General"], "meta_score": 78, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/5/98fe9dc8edff1e6a75372c000997289d-98.jpg", "descriptions": "Lead Cooper and his gang through 25 levels of this character-based real-time strategy game  in which you're hired to find the banditos responsible for a train robbery in the old American frontier."}, {"name": "Mars Matrix", "details_link": "https://www.metacritic.com/game/dreamcast/mars-matrix", "publisher": "Capcom", "release_date": "Apr 30 2001", "developers": ["Takumi Corporation"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/6b1cb89d91e8beaa3d4cf183100a60f9-98.jpg", "descriptions": "Half a century has passed since the colonization of Mars. Life on the red planet is productive and peaceful. Earth has placed the Mars Development Agency (MDA) is control of Mars' self-governing sectors, yet retains a tight grip on its colony. Without warning, an ominous transmission isHalf a century has passed since the colonization of Mars. Life on the red planet is productive and peaceful. Earth has placed the Mars Development Agency (MDA) is control of Mars' self-governing sectors, yet retains a tight grip on its colony. Without warning, an ominous transmission is received on Earth declaring Martian independence and all contact with Mars is lost. Now, the threat of war with mars has Earth seeing red. Massive fleets of experimental, yet very powerful new fighters are on their way to Mars on a mission that could escalate into inter-planetary war.… Expand"}, {"name": "Zone of the Enders", "details_link": "https://www.metacritic.com/game/playstation-2/zone-of-the-enders", "publisher": "Konami", "release_date": "Mar 26 2001", "developers": ["KCEJ"], "platforms": ["PlayStation 3", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/e4c114a996d2b0d233e4ad3f02bcde35-98.jpg", "descriptions": "Konami's \"Z.O.E.\", which just so happens to contain a demo of \"Metal Gear Solid 2\" (also designed by Hideo Kojima), features Leo Starbuck, an Ender on a space station orbiting Jupiter, battles to return a giant robot to its rightful owners while battling other pesky robots in the process."}, {"name": "Dirt Track Racing: Sprint Cars", "details_link": "https://www.metacritic.com/game/pc/dirt-track-racing-sprint-cars", "publisher": "WizardWorks", "release_date": "Oct 19 2000", "developers": ["Ratbag"], "platforms": "PC", "num_players": "1-10 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/72d44a51772c737e556ef09e22d7913f-98.jpg", "descriptions": "It completely reinvigorates the original game by adding four new car types, 20 racetracks, and a host of updated graphics and gameplay mechanics."}, {"name": "Roguebook", "details_link": "https://www.metacritic.com/game/pc/roguebook", "publisher": "Abrakam SA", "release_date": "Jun 17 2021", "developers": ["Abrakam SA"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle", "Tactics"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/6ee8331a1f9fd384320ee31a81c12de3-98.jpg", "descriptions": "The ancients speak of a Book written since time immemorial containing all the world's legends. After many fabulous adventures, recounted in Faeria Chronicles of Gagana, this relic was lost in a well of Faeria. Through contact with this source of magic, the Book developed a wicked free willThe ancients speak of a Book written since time immemorial containing all the world's legends. After many fabulous adventures, recounted in Faeria Chronicles of Gagana, this relic was lost in a well of Faeria. Through contact with this source of magic, the Book developed a wicked free will of its own and became the Roguebook!You are trapped in the Book of Lore of Faeria, and each page represents a new challenge. Lead your two heroes to victory in this roguelike deckbuilder developed in partnership with Richard Garfield, creator of Magic: The Gathering. Put together the best synergies between cards, relics and abilities, and take on the Roguebook.… Expand"}, {"name": "Tinykin", "details_link": "https://www.metacritic.com/game/pc/tinykin", "publisher": "tinyBuild", "release_date": "Aug 30 2022", "developers": ["Splashteam"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Real-Time", "Platformer", "3D", "Command"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/9d40d47e2ec0864276acdd7af9214f12-98.jpg", "descriptions": "Milo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!\n\nFind a way home through a sprawling ant-sized metropolis, andMilo arrives on Earth to find that he's way too small, everybody's gone and a day hasn't passed since 1991!Catch hundreds of mysterious tinykin and use their unique powers to create ladders, bridges, explosions and a lot more!Find a way home through a sprawling ant-sized metropolis, and unravel Earth's biggest mystery!… Expand"}, {"name": "Star Trek: Bridge Crew", "details_link": "https://www.metacritic.com/game/pc/star-trek-bridge-crew", "publisher": "Ubisoft", "release_date": "May 30 2017", "developers": ["Ubisoft", "Red Storm Entertainment"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/d8e02440556e950462278214b81b3b82-98.jpg", "descriptions": "Developed specifically for VR, Star Trek: Bridge Crew is the only game to offer a true-to-life level of immersion in the Star Trek universe, where- as officers of the Federation- every action and decision you make together will determine the fate of your ship and crew."}, {"name": "Disney Alice in Wonderland", "details_link": "https://www.metacritic.com/game/ds/disney-alice-in-wonderland", "publisher": "Disney Interactive Studios", "release_date": "Mar  2 2010", "developers": ["Etranges Libellules"], "platforms": ["PC", "DS"], "genres": ["Action", "Action Adventure", "General", "General", "Fantasy"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/1679a535f48ebc8dde44876106c1c52f-98.jpg", "descriptions": "Have you ever wondered what it would be like to fall down the rabbit hole? Explore a visually stunning world filled with whimsical settings, optical illusions, curiously challenging puzzles, and formidable adversaries. Play as the Mad Hatter, White Rabbit, Cheshire Cat and other memorableHave you ever wondered what it would be like to fall down the rabbit hole? Explore a visually stunning world filled with whimsical settings, optical illusions, curiously challenging puzzles, and formidable adversaries. Play as the Mad Hatter, White Rabbit, Cheshire Cat and other memorable characters from the film. [Disney]… Expand"}, {"name": "Eastshade", "details_link": "https://www.metacritic.com/game/pc/eastshade", "publisher": "Eastshade Studios", "release_date": "Feb 13 2019", "developers": ["Eastshade Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/787f02298ab651f46843d1286ce709cc-98.jpg", "descriptions": "You are a traveling painter, exploring the island of Eastshade. Capture the world on canvas using your artist’s easel. Talk to the inhabitants to learn about their lives. Make friends and help those in need. Visit cities, scale summits, unearth mysteries, and discover forgotten places."}, {"name": "Hyrule Warriors: Definitive Edition", "details_link": "https://www.metacritic.com/game/switch/hyrule-warriors-definitive-edition", "publisher": "Nintendo", "release_date": "May 18 2018", "developers": ["Koei Tecmo Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/1deff3c99bffd6b0b81d6122ddd4206d-98.jpg", "descriptions": "A new, ultimate version of the exhilarating action game set in the Zelda universe will include every map and mission, plus all 29 playable characters from both the Wii U and Nintendo 3DS versions of the game, along with all of the previous paid downloadable content. Play as Link, Zelda,A new, ultimate version of the exhilarating action game set in the Zelda universe will include every map and mission, plus all 29 playable characters from both the Wii U and Nintendo 3DS versions of the game, along with all of the previous paid downloadable content. Play as Link, Zelda, Midna, Skull Kid and dozens more in action-packed battles at home or on the go. Additionally, the game includes new outfits for Link and Zelda based on the Legend of Zelda: Breath of the Wild game.… Expand"}, {"name": "Chernobylite", "details_link": "https://www.metacritic.com/game/playstation-5/chernobylite", "publisher": "All in! Games", "release_date": "Apr 21 2022", "developers": ["The Farm 51"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/01c6d2980f5118dbdbcd249453fa2055-98.jpg", "descriptions": "Chernobylite is a new game from the creators of the critically-acclaimed Get Even.\rIt's a science-fiction survival horror experience, mixing the free exploration of its disturbing world with challenging combat, unique crafting, and non-linear storytelling. Play as a physicist, one of theChernobylite is a new game from the creators of the critically-acclaimed Get Even.\rIt's a science-fiction survival horror experience, mixing the free exploration of its disturbing world with challenging combat, unique crafting, and non-linear storytelling. Play as a physicist, one of the Chernobyl Power Plant's ex-employees, and investigate the mysterious disappearance of your beloved. Try to survive and reveal the contamination zone's twisted secrets. Remember, the military presence is not your only concern.\r Get ready for a thrilling adventure of survival, conspiracy, horror, love, and obsession. One that will prove to you that it's not about how you face your fears, it's about how you survive them.\r SURVIVE\rAlly or compete with other stalkers of the Chernobyl zone to survive. Remember that life is fragile, and it's your decisions that determine the fate of your companions. You can spend as long as you need preparing, however, be aware that your story is still being written. Every passing moment, your chances of success are dwindling: comrades are dying, supplies are running out, or an unexpected patrol could discover you. And on top of all this, supernatural dangers are arising around you in mysterious patterns. Each day brings new challenges with the ever-increasing severity of your current situation. Plan your strategy carefully if you want to survive.\r PLAY BY YOUR OWN RULES\rCraft your gear and weapons to protect yourself from the hostile military personnel and supernatural threats lurking in the zone. Make use of the sophisticated tools at your disposal to aid you in your struggle while navigating the rough and contaminated environment. Stay undetected and gather all the evidence you can to piece together events from the past.\rDecide what happens in the world around you by making choices and finding, or avoiding, the truth.\r EXPERIENCE\rMaintain your resolve and keep your wits about you the Chernobyl Nuclear Power Plant is not what it once was. No one can foresee the horrors that may have befallen your beloved.\r CHERNOBYLITE MAIN FEATURES:\r * Explore the beautiful and horrifyingly accurate 3D-scanned recreation of the Chernobyl Exclusion Zone.\r* Collaborate or compete with other stalkers of the Zone, but whatever you do, never fully trust them. Remember everybody has a hidden agenda. Always.\r* Face and survive the natural and supernatural threats.\r* Immerse yourself in the thrilling non-linear science-fiction horror story.\r* Make good use of your character's physics and chemistry knowledge to craft your equipment and manage your supplies.\r* Fight against the savage creatures pouring from the alternate reality.\r* Investigate and collect data with a set of sophisticated environment and substance analyzing tools.… Expand"}, {"name": "Scott Pilgrim vs. the World: The Game - Complete Edition", "details_link": "https://www.metacritic.com/game/xbox-one/scott-pilgrim-vs-the-world-the-game---complete-edition", "publisher": "Ubisoft", "release_date": "Jan 14 2021", "developers": ["Ubisoft", "Engine Software"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/33141a3cd08457ac756d86dd472d0732-98.jpg", "descriptions": "Play as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesomePlay as Scott Pilgrim, Ramona Flowers, Stephen Stills, Knives Chau, and more. Level up your characters and unique abilities as you fight your way through waves tough enemies. Team up with 3 of your friends locally or online, combine your skills in battle or compete with them in awesome mini-games to see who ends up on top! Can you defeat Ramona's League of Evil Exes as you try to win her heart? Epic battles with Lucas Lee, Gideon Graves, and more await Scott Pilgrim and his friends. Zombie hordes? Dodgeball? Battle Royale? Just a few of the things you'll find playing through this Complete Edition. Compete in sub-space mini-games, experience a killer soundtrack, and much more as you re-live the beloved story of Scott Pilgrim vs. the World.… Expand"}, {"name": "The Walking Dead: The Telltale Series - The Final Season", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---the-final-season", "publisher": "Telltale Games", "release_date": "Aug 14 2018", "developers": ["Telltale Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/9ae3f6c2f92d6245d76663112f465f01-98.jpg", "descriptions": "After years on the road facing threats both living and dead, a secluded school might finally be Clementine’s chance for a home. But protecting it will mean sacrifice. In this gripping, emotional final season, your choices will define your relationships and determine how Clementine’s story ends."}, {"name": "Ridge Racer 7", "details_link": "https://www.metacritic.com/game/playstation-3/ridge-racer-7", "publisher": "Namco Bandai Games", "release_date": "Nov 13 2006", "developers": ["Namco Bandai Games"], "platforms": "PlayStation 3", "num_players": "Up to 14 ", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/d336808125c8526491357b631d50adfc-98.jpg", "descriptions": "A first in franchise history, Ridge Racer 7 offers 375,000 ways to make your machine unique, with up to 7,150 combinations to tailor the performance of each machine. The game's new customization features include: Create the Ultimate Exterior: Players can choose from a variety of body kits,A first in franchise history, Ridge Racer 7 offers 375,000 ways to make your machine unique, with up to 7,150 combinations to tailor the performance of each machine. The game's new customization features include: Create the Ultimate Exterior: Players can choose from a variety of body kits, colors and decals to change the look of their machines, as well as a large selection of wheels. Improved Performance: Perform engine tune-ups and performance upgrades to improve your chances in the extensive GP series. Customizable Handling: Improve cornering performance by adjusting tires and suspension to customize drift characteristics. Variable Nitrous: Various nitrous options are now available. Strengthen your normal or ultimate charge, increase the number of nitrous tanks, select auto-charge or reverse charge, or even use flex nitrous, which can be turned on or off at any time. Three, all-new powerful, head-turning RIDGE RACER 7 machines: Centellee: The latest super sports vehicle from Terrazi boasts a 4000cc V8 engine, a top speed of 210mph and a handcrafted body, making this machine no match for its competitors. Magnifico: With an extremely practical and luxurious interior, this powerful and sporty car possesses a drastically lightened body, an inline 2000cc 4-cylinder engine, and a top speed of 178mph. Jujak: This high-tech sports coupe features multi-torque control for variable road and weather conditions, an inline 2700cc 4-cylinder engine and a top speed of 156mph. Jujak is the cutting-edge sports car. [Namco Bandai Games]… Expand"}, {"name": "EA SPORTS UFC 4", "details_link": "https://www.metacritic.com/game/playstation-4/ea-sports-ufc-4", "publisher": "Electronic Arts", "release_date": "Aug 14 2020", "developers": ["Electronic Arts"], "platforms": ["Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "2 ", "genres": ["Sports", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 78, "users_score": 1.8, "image": "https://static.metacritic.com/images/products/games/1/2ad6480354cda9ae8e6cbdad226d66b7-98.jpg", "descriptions": "In EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality. Develop and customize your character through a unified progression system across all modes. Go from unknown amateur to UFC superstar in the new Career Mode, experience theIn EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality. Develop and customize your character through a unified progression system across all modes. Go from unknown amateur to UFC superstar in the new Career Mode, experience the origins of combat sports in two all-new environments; The Kumite and The Backyard, or challenge the world in new Blitz Battles or Online World Championships to become the undisputed champ. In gameplay, fluid clinch-to-strike combinations offer more responsive and authentic stand-up gameplay, while overhauled takedown and ground mechanics deliver more control in those key phases of the fight. No matter how, or where, you play EA SPORTS UFC 4 puts 'you' at the center of every fight.… Expand"}, {"name": "Crash Bandicoot N. Sane Trilogy", "details_link": "https://www.metacritic.com/game/switch/crash-bandicoot-n-sane-trilogy", "publisher": "Activision", "release_date": "Jun 29 2018", "developers": ["Vicarious Visions", "Toys for Bob"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/5e9c109046a79370c64f9c392082503b-98.jpg", "descriptions": "Your favorite marsupial, Crash Bandicoot, is back! He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through theYour favorite marsupial, Crash Bandicoot, is back! He's enhanced, entranced & ready-to-dance with the N. Sane Trilogy game collection. Now you can experience Crash Bandicoot like never before in Fur-K. Spin, jump, wump and repeat as you take on the epic challenges and adventures through the three games that started it all, Crash Bandicoot, Crash Bandicoot 2: Cortex Strikes Back and Crash Bandicoot: Warped. Relive all your favorite Crash moments in their fully-remastered HD graphical glory and get ready to put some UMPH in your WUMP!… Expand"}, {"name": "ABZU", "details_link": "https://www.metacritic.com/game/playstation-4/abzu", "publisher": "505 Games", "release_date": "Aug  2 2016", "developers": ["Giant Squid"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/f81304e55a994fcdd1b1cc7102c65d27-98.jpg", "descriptions": "ABZÛ is an grand descent into the depths of the sea, where players explore ocean environments with fluid swimming controls. The experience draws inspiration from the deep innate narrative that we carry within our subconscious: the story of ABZÛ is a universal myth that resonates acrossABZÛ is an grand descent into the depths of the sea, where players explore ocean environments with fluid swimming controls. The experience draws inspiration from the deep innate narrative that we carry within our subconscious: the story of ABZÛ is a universal myth that resonates across cultures. The name references a concept from the oldest mythologies; it is the combination of the two ancient words AB, meaning ocean, and ZÛ, meaning to know. ABZÛ is the ocean of wisdom. [505 Games]… Expand"}, {"name": "Bad Apple Wars", "details_link": "https://www.metacritic.com/game/playstation-vita/bad-apple-wars", "publisher": "Aksys Games", "release_date": "Oct 13 2017", "developers": ["Otomate"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/e8de368093e8454a4730e71bb1d7d4e5-98.jpg", "descriptions": "After a sudden car accident on her first day of school, the protagonist finds herself in the afterlife, standing before a strange school for lost souls. The confounded protagonist attends the school’s opening ceremony. Then, chaos strikes…"}, {"name": "Toki Tori 2 +", "details_link": "https://www.metacritic.com/game/playstation-4/toki-tori-2-+", "publisher": "Two Tribes", "release_date": "Feb 23 2016", "developers": ["Two Tribes"], "platforms": ["PC", "Switch", "Wii U", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 78, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/7/9c48a3b26daad95656f27094f7e67296-98.jpg", "descriptions": "Experience Toki Tori’s Epic Puzzle Adventure. Explore a forest island, learn magical songs and interact with the local wildlife to solve environmental puzzles. Toki Tori 2+’s game design requires just two moves: whistle and stomp. It's super accessible, yet it builds up to incredibleExperience Toki Tori’s Epic Puzzle Adventure. Explore a forest island, learn magical songs and interact with the local wildlife to solve environmental puzzles. Toki Tori 2+’s game design requires just two moves: whistle and stomp. It's super accessible, yet it builds up to incredible complexity later on. There’s a ton to do, too. After puzzle-solving your way to five Ancient Frogs and saving the island from a strange pollution, you can still find 100s of golden wings, snap dozens of creature pictures and go Achievement hunting.\r - A unique take on the Metroidvania formula\r  - Follow the path, or stray off-road and tackle the expert puzzles\r  - Whistle magical songs to rewind, fast-travel and more\r  - Snap dozens of Tokidex creature pictures… Expand"}, {"name": "Joe Dever's Lone Wolf HD Remastered", "details_link": "https://www.metacritic.com/game/pc/joe-devers-lone-wolf-hd-remastered", "publisher": "505 Games", "release_date": "Nov 27 2014", "developers": ["Forge Reply"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/cb608fe3a33f1683ce1c8280da1e4180-98.jpg", "descriptions": "Lone Wolf is back, as a video game with a brand-new story, a deep combat system, stunning graphics and much more! Make meaningful choices and carve your own path through this epic non-linear adventure. Test your strength in dynamic turn-based battles, prove your skill with the lock-pickingLone Wolf is back, as a video game with a brand-new story, a deep combat system, stunning graphics and much more! Make meaningful choices and carve your own path through this epic non-linear adventure. Test your strength in dynamic turn-based battles, prove your skill with the lock-picking minigame and accept the challenge of wits posed by the mysterious Shianti Cube!The author Joe Dever has played an active role in the development of the game. The story he has written fits with the original continuity, but it also sheds a new light on Lone Wolf's world, Magnamund! For Sommerlund and the Kai!… Expand"}, {"name": "Every Extend Extra Extreme", "details_link": "https://www.metacritic.com/game/xbox-360/every-extend-extra-extreme", "publisher": "Q Entertainment", "release_date": "Oct 17 2007", "developers": ["Cyclone Zero"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 78, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/5390612e4037a16e84cad2b2cb45ffb1-98.jpg", "descriptions": "[Xbox Live Arcade]  The latest creation by Q Entertainment, is a unique action-packed shooter. Time your self-destruction perfectly, create chain reactions by exploding enemies, and extend the game life. Enjoy a trippy, trancey clubbing experience through the combination of highly addictive[Xbox Live Arcade]  The latest creation by Q Entertainment, is a unique action-packed shooter. Time your self-destruction perfectly, create chain reactions by exploding enemies, and extend the game life. Enjoy a trippy, trancey clubbing experience through the combination of highly addictive gameplay, music, and sharp visuals. E4 features five exciting game modes as you collect bonus items and detonate your craft to the beat to multiply your scores. Outrageous visuals and high-quality sound add to the richness of the gameplay. There are a hundred times more enemies, a hundred times more chain reactions, and a stylish collection of newly designed visualizers all exploding in high definition with 5.1 surround sound support. Play E4 The Game Unlimited, a reverse action-shooter where the goal is to self-destruct, create large chain reactions of explosions by defeating enemies, and extend the life of the game by collecting the items they leave behind. Other game modes include E4 The Game Limited, that challenges with a Time Attack version of the main mode. Take on R4 The Revenge, a genuine shooter with up to 100 stages. And go head to head in H4 Versus Live, against other players on Xbox LIVE. Add your own music in the S4 Wiz Ur Muzik mode. Enjoy a customized E4 gameplay experience by adding your own tracks and playing to your favorite music. [Microsoft]… Expand"}, {"name": "Life is Strange: Before the Storm - Episode 1: Awake", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-before-the-storm---episode-1-awake", "publisher": "Square Enix", "release_date": "Aug 31 2017", "developers": ["Deck Nine Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/5bb4470c22ac583ba6f0121c2cfc56aa-98.jpg", "descriptions": "Life is Strange: Before the Storm is a new three part standalone story adventure set three years before the events of the first game. This time play as Chloe Price, a rebel who forms an unlikely friendship with Rachel Amber in a dramatic new story in the BAFTA award winning franchise."}, {"name": "Tropico 4", "details_link": "https://www.metacritic.com/game/pc/tropico-4", "publisher": "Kalypso", "release_date": "Aug 30 2011", "developers": ["Haemimont", "Haemimont Games"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Government"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/b1a1feb51a1e7533fe007ffb324aaa9c-98.jpg", "descriptions": "Tropico 4 sees you return as El Presidente, the tyrannical (or benevolent) dictator of the island paradise of Tropico. The world is changing and Tropico is moving with the times ï¿½ geographical powers rise and fall and the world market is dominated by new players with newTropico 4 sees you return as El Presidente, the tyrannical (or benevolent) dictator of the island paradise of Tropico. The world is changing and Tropico is moving with the times ï¿½ geographical powers rise and fall and the world market is dominated by new players with new demands and offers -- and you, as El Presidente, face a whole new set of challenges. If you are to triumph over your naysayers you will need to gain as much support from your people as possible. Your decisions will shape the future of your nation, and more importantly, the size of your Swiss bank account. … Expand"}, {"name": "Narita Boy", "details_link": "https://www.metacritic.com/game/playstation-4/narita-boy", "publisher": "Team17", "release_date": "Mar 30 2021", "developers": ["Studio Koba"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/a8f02bdd56ef8476da613fb230ce00c6-98.jpg", "descriptions": "Become symphonic in Narita Boy! A radical action-adventure as a legendary pixel hero trapped as a mere echo within the Digital Kingdom. Discover the mysteries behind the Techno-sword, lock swords with the corrupt and tainted Stallions. Save the world!"}, {"name": "PGA Tour 2K21", "details_link": "https://www.metacritic.com/game/xbox-one/pga-tour-2k21", "publisher": "2K Games", "release_date": "Aug 21 2020", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Golf", "Sim"], "meta_score": 78, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/6/1607c55fb719e3097ce688dabe9ed895-98.jpg", "descriptions": "ALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\r  PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life coursesALL-NEW PGA TOUR CAREER MODE:Prove you’ve got what it takes to become FedExCup Champion. Take on PGA TOUR Pros during your very own career, earning rewards and gear along the way.\r  PGA TOUR PROS AND NEW COURSES: Play against Justin Thomas and 11 top pros on stunning, real-life courses including TPC Sawgrass, East Lake Golf Club, and more.\r  BUILD YOUR MYPLAYER & DREAM COURSE: Create and personalize your MyPLAYER with equipment and apparel from brands you love. Design your ultimate course with 1,000s of custom options.\r  DOMINATE THE GREEN AT ANY SKILL LEVEL: Rookies can take advantage of real-time tutorials, tips and shot suggestions. Already a pro? Master your game with Pro Vision, Distance Control, Putt Preview, and other innovations.\r  GET THE PARTY STARTED: Hit the links with friends by playing local and online matches, including Alt-Shot, Stroke Play, Skins and 4-Player Scramble.\r  MAKE YOUR OWN RULES: Command your Clubhouse with Online Societies. Run full seasons and tournaments and earn bragging rights on the course. Create entry rules and requirements as well as handicap and event settings.\r  THE MOST REALISTIC COURSES EVER: Real-world scanning brings the fairway, green, bunkers, trees, lakes and ponds to life! True-to-form PGA TOUR broadcast presentation features slick graphics, dynamic cut-scenes and a seamless replay system, all anchored by the play-by-play commentary of Luke Elvy and Rich Beem.… Expand"}, {"name": "Transference", "details_link": "https://www.metacritic.com/game/pc/transference", "publisher": "Ubisoft", "release_date": "Sep 18 2018", "developers": ["SpectreVision"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/4884edfcc803edc3f84e17afd06014b4-98.jpg", "descriptions": "Transference is a psychological thriller and the first game collaboration between SpectreVision and Ubisoft. Bridging the gap between movies and games, we invite you to lose yourself in the destructive tale of a man's obsession as you explore his digitally recreated memories. Experience theTransference is a psychological thriller and the first game collaboration between SpectreVision and Ubisoft. Bridging the gap between movies and games, we invite you to lose yourself in the destructive tale of a man's obsession as you explore his digitally recreated memories. Experience the limits of techno-psychology, and escape a maze-like puzzle concealing a corrupted truth. Get projected into the digital consciousness of troubled case subjects and maybe you will influence their fate.… Expand"}, {"name": "Call of Duty: Infinite Warfare", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-infinite-warfare", "publisher": "Activision", "release_date": "Nov  4 2016", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 78, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/0/67b8fc2475b59ef5d04ec0940a9f1dc2-98.jpg", "descriptions": "Infinite Warfare is the first game in the franchise to venture beyond the reaches of Earth, framing a plausible future war in our solar system.  Infinite Warfare also introduces an original cooperative Zombies mode that takes players on a wild ride through a new storyline with uniqueInfinite Warfare is the first game in the franchise to venture beyond the reaches of Earth, framing a plausible future war in our solar system.  Infinite Warfare also introduces an original cooperative Zombies mode that takes players on a wild ride through a new storyline with unique gameplay features and mechanics. [Infinity Ward]… Expand"}, {"name": "Mary Skelter Finale", "details_link": "https://www.metacritic.com/game/switch/mary-skelter-finale", "publisher": "Idea Factory", "release_date": "Sep 30 2021", "developers": ["Compile Heart"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/81d8c66d1f28b37a7ca978159d84024b-98.jpg", "descriptions": "Jail - a living prison for humans, buried 666 meters underground.A group of prisoners, Jack and the Blood Maidens, were reincarnations of fairy tales who dared to escape. They climbed from the bottom of the tower up to the surface, filled with hope...\n\nBut outside were thousands of corpsesJail - a living prison for humans, buried 666 meters underground.A group of prisoners, Jack and the Blood Maidens, were reincarnations of fairy tales who dared to escape. They climbed from the bottom of the tower up to the surface, filled with hope...But outside were thousands of corpses soaking in a sea of blood. There stood beings known as Massacre Pink, smiling.In that moment, hope was destroyed. Separated, they are each drawn to the devouring Jail that floats in the sky...This is the finale to the tale of the Blood Maidens.… Expand"}, {"name": "EVERSPACE: Stellar Edition", "details_link": "https://www.metacritic.com/game/switch/everspace-stellar-edition", "publisher": "ROCKFISH Games", "release_date": "Dec 11 2018", "developers": ["ROCKFISH Games"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Action Adventure", "Space", "Open-World", "Combat"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/839c6da23b59cd41f1330cc06142581f-98.jpg", "descriptions": "EVERSPACE is a roguelike 3Dspace shooter for Windows PC."}, {"name": "Starlink: Battle for Atlas", "details_link": "https://www.metacritic.com/game/xbox-one/starlink-battle-for-atlas", "publisher": "Ubisoft", "release_date": "Oct 16 2018", "developers": ["Ubisoft Toronto"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Space", "Combat"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/6b2eb09bc40eab47e9da1f224ef1e8e8-98.jpg", "descriptions": "Starlink: Battle for Atlas is an action-adventure game through which you assemble a custom Starship model mounted to your game controller to launch into an interplanetary adventure. Lead a group of heroic interstellar pilots who use modular starships to mix and match their unique gear andStarlink: Battle for Atlas is an action-adventure game through which you assemble a custom Starship model mounted to your game controller to launch into an interplanetary adventure. Lead a group of heroic interstellar pilots who use modular starships to mix and match their unique gear and skills on the fly. Travel the stars to unite the galaxy against villainous destructive forces. Modular, customizable starships: Mix and match pilots, hulls, wings, and weapons to assemble the starship of your dreams with a level of customization and creativity. Changes to your physical ship instantly appear in-game allowing you to immediately jump into the battle. Starships at your fingertips - Take control of your starship in a whole new way. Your custom starship attaches directly to your game controller as you pilot through Atlas. Open, living star system - Travel seamlessly through the vast exotic alien worlds of the Atlas Star System, full of unique challenges to discover and overcome. Explore 7 massive unique planets and space. Plus, fly directly from the planet into space for more battles and back to another world. Creative combat - Build your unique play style. Experiment with different pilot abilities and weapons to discover and unleash devastating combos upon your enemies and overcome deadly challenges. [Ubisoft]… Expand"}, {"name": "Ironcast", "details_link": "https://www.metacritic.com/game/xbox-one/ironcast", "publisher": "Ripstone", "release_date": "Mar  4 2016", "developers": ["Dreadbit"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Puzzle", "Matching"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/c0a6406daff5eed68e64eab036370dfa-98.jpg", "descriptions": "Ironcast is a game of steampunk mech combat, set in a fictional version of the Victorian Era. Inspired by science fiction writers such as H.G. Wells and Jules Verne, Ironcast is set in an exciting alternative history; a time when refined men and women in top hats and bonnets commandedIroncast is a game of steampunk mech combat, set in a fictional version of the Victorian Era. Inspired by science fiction writers such as H.G. Wells and Jules Verne, Ironcast is set in an exciting alternative history; a time when refined men and women in top hats and bonnets commanded gigantic walking war machines, laying waste to the enemies of the British Empire!… Expand"}, {"name": "AR-K Episode 3: The Great Escape", "details_link": "https://www.metacritic.com/game/pc/ar-k-episode-3-the-great-escape", "publisher": "Gato Salvaje Studio", "release_date": "Jul 14 2015", "developers": ["Gato Salvaje Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/2422bf1ed1ac3670cb7e517f20cdfe8a-98.jpg", "descriptions": "AR-K: The Great Escape is the third episode in the classic point and click saga of AR-K. Help Alicia Van Volish to escape from District 8 and discover the source of the mysterious Golden Sphere through a great story, written by the 3 times Eisner award-winning writer Greg Rucka."}, {"name": "World Class Poker with T.J. Cloutier", "details_link": "https://www.metacritic.com/game/pc/world-class-poker-with-tj-cloutier", "publisher": "Masque Publishing", "release_date": "Aug 22 2005", "developers": ["Masque Publishing"], "platforms": "PC", "genres": ["Miscellaneous", "Parlor", "Gambling", "Gambling"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/8e82b5721635c8655494232713ca1975-98.jpg", "descriptions": "2 CD's filled with in-game expert play recommendations, loads of scenario tips, and numerous quiz questions with thoroughly explained answers, all from the world's winningest poker player, T.J. Cloutier. The replay mode allows you to see all your opponents' hole cards as well as each2 CD's filled with in-game expert play recommendations, loads of scenario tips, and numerous quiz questions with thoroughly explained answers, all from the world's winningest poker player, T.J. Cloutier. The replay mode allows you to see all your opponents' hole cards as well as each person's probability to make his or her hand. Includes no limit, limit and satellite tournaments, heads up play, as well as Texas Hold'em, Omaha, 7 Card Stud and 5 Card Draw games. The most comprehensive poker strategy tutorial ever created doesn't just teach you how to play Texas Hold'em, you'll learn what to play, when, where and why. [Masque Publishing]… Expand"}, {"name": "Puzzle Quest: Challenge of the Warlords", "details_link": "https://www.metacritic.com/game/playstation-2/puzzle-quest-challenge-of-the-warlords", "publisher": "D3", "release_date": "Nov 13 2007", "developers": ["Infinite Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Matching"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/ee2255f6bf7081eab0be5bbf22b224ae-98.jpg", "descriptions": "Designed specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a puzzle boardDesigned specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a puzzle board setting. Set in the Warlords universe, the game challenges players to create, develop and customize the ultimate hero in order to save the land of Etheria from evil Lord Bane. To advance their character, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinct gameplay modes: Single-player allows gamers to battle against the AI as they embark on over 150 challenging quests, Instant Action allows gamers to jump in and immediately play continuous battles to level-up characters without participating in quests, and Multiplayer allows gamers to battle live opponents. Victory will advance the player’s hero, magical arsenal, creature companions and more - ultimately rewarding gamers at nearly every turn and providing endless hours of replayability. [D3Publisher of America]… Expand"}, {"name": "Tales From The Borderlands: Episode 2 - Atlas Mugged", "details_link": "https://www.metacritic.com/game/pc/tales-from-the-borderlands-episode-2---atlas-mugged", "publisher": "Telltale Games", "release_date": "Mar 17 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/9e3f06862de3fb8717cd94ae5b3417b3-98.jpg", "descriptions": "Discovering the Gortys Project fuels a madcap race to definitively figure out what the Atlas Corporation was up to prior to Hyperion's take over of Pandora. Our heroes are not the only ones on the trail. Vault Hunters, Bounty Hunters, Vasquez, and a giant monster thing with a mouth thatDiscovering the Gortys Project fuels a madcap race to definitively figure out what the Atlas Corporation was up to prior to Hyperion's take over of Pandora. Our heroes are not the only ones on the trail. Vault Hunters, Bounty Hunters, Vasquez, and a giant monster thing with a mouth that looks like a...well, you'll see...are all in pursuit. And to further complicate matters, Rhys is being haunted by dreams of a dead despot AND what Vaughn looks like without his shirt on. Can Fiona and Sasha hold everything together? That's up to you. [Telltale]… Expand"}, {"name": "Injustice: Gods Among Us", "details_link": "https://www.metacritic.com/game/playstation-3/injustice-gods-among-us", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr 16 2013", "developers": ["NetherRealm Studios"], "platforms": ["Wii U", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/19d6a85d95d1ad1fd3362cfba810bdee-98.jpg", "descriptions": "Injustice: Gods Among Us kicks off a new fighting game series that begins to weave an original tale featuring a cast of favorite DC Comics icons such as Batman, Harley Quinn, Solomon Grundy, Superman, The Flash, Wonder Woman and others.  Set in a world where the distinction between good andInjustice: Gods Among Us kicks off a new fighting game series that begins to weave an original tale featuring a cast of favorite DC Comics icons such as Batman, Harley Quinn, Solomon Grundy, Superman, The Flash, Wonder Woman and others.  Set in a world where the distinction between good and evil is often unclear, players pit heroes and villains in grandiose battles on a massive scale.… Expand"}, {"name": "Star Wars: Squadrons", "details_link": "https://www.metacritic.com/game/xbox-one/star-wars-squadrons", "publisher": "Electronic Arts", "release_date": "Oct  2 2020", "developers": ["Motive Studios"], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Simulation", "Space", "Combat"], "meta_score": 78, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/a7787989ec022dc9a8bbb0ecbd61b97c-98.jpg", "descriptions": "Master the art of starfighter combat in the authentic piloting experience Star Wars: Squadrons. Buckle up and feel the adrenaline of first-person multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic andMaster the art of starfighter combat in the authentic piloting experience Star Wars: Squadrons. Buckle up and feel the adrenaline of first-person multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic and Imperial fleets and fight in strategic 5 vs. 5 space battles. Modify your starfighter and adjust the composition of your squadron to suit varying playstyles and crush the opposition. Pilots will triumph as a team and complete tactical objectives across known and never-before-seen battlefields, including the gas giant of Yavin Prime and the shattered moon of Galitan.\r Take control of starfighters such as the X-wing and TIE fighter. Customize loadouts and cosmetics, divert power between weapons, shields, and engines, while immersing yourself in the cockpit. In addition, players will have the option to play the entirety of the game in virtual reality on PSVR and PC!\r Learn what it means to be a pilot in a thrilling Star Wars single-player story set after the events of Return of the Jedi. Seen from alternating perspectives between two factions, iconic and emerging leaders on both sides are battling for the galaxy. The New Republic fights for freedom. The Empire demands order. We need you to join the galaxy's finest.… Expand"}, {"name": "The Count Lucanor", "details_link": "https://www.metacritic.com/game/pc/the-count-lucanor", "publisher": "Baroque Decay", "release_date": "Mar  3 2016", "developers": ["Baroque Decay"], "platforms": ["PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/fecb5785a70d66871efa51026e117a44-98.jpg", "descriptions": "Join Hans in a fantasy world and experience a unique adventure, full of surprises and challenges. Get hooked on an immersive tale, where every decision counts and every clue is a piece to solve the puzzle and get the treasure. Unravel the sordid secrets of the castle, meet colorfulJoin Hans in a fantasy world and experience a unique adventure, full of surprises and challenges. Get hooked on an immersive tale, where every decision counts and every clue is a piece to solve the puzzle and get the treasure. Unravel the sordid secrets of the castle, meet colorful characters, and remember: horror always lurks beneath the surface.… Expand"}, {"name": "Five Nights at Freddy's", "details_link": "https://www.metacritic.com/game/pc/five-nights-at-freddys", "publisher": "Scott Cawthon", "release_date": "Aug  8 2014", "developers": ["animdude"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/e68fbc1a0e67e0ccb0b8644507dd65fe-98.jpg", "descriptions": "Welcome to your new summer job at Freddy Fazbear's Pizza, where kids and parents enter for entertainment and food as far as the eye can see. The main attraction is Freddy Fazbear, of course; and his couple offriends. They are animatronic robots, programmed to please the crowds. The robots'Welcome to your new summer job at Freddy Fazbear's Pizza, where kids and parents enter for entertainment and food as far as the eye can see. The main attraction is Freddy Fazbear, of course; and his couple offriends. They are animatronic robots, programmed to please the crowds. The robots' behavior has become somewhat unpredictable at night however, and it was much cheaper to hire you as a security guard than to find a repairman. From your small office you must watch the security cameras carefully. You have a very limited amount of electricity that you're allowed to use per night (corporate budget cuts, you know). That means when you run out of power for the night- no more security doors and no more lights! If something isn't right- namely if Freddybear or his friends aren't in their proper places, you must find them on the monitors and protect yourself if needed.… Expand"}, {"name": "Baseball Mogul 2007", "details_link": "https://www.metacritic.com/game/pc/baseball-mogul-2007", "publisher": "Enlight Software", "release_date": "Apr 12 2006", "developers": ["Sports Mogul"], "platforms": "PC", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Team", "Baseball", "Management", "Management", "Sim"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/e665fdca99cd95153bd8849acaa3d52f-98.jpg", "descriptions": "NEW Animated Play-By-Play: All-new in-game Manager Mode lets you call plays and make substitutions as if you were in the dugout. Or retire to the owner's box and let your coaches and players control the action. It's up to you. NEW Pitch-By-Pitch Mode. Fully interactive pitch-by-pitch modeNEW Animated Play-By-Play: All-new in-game Manager Mode lets you call plays and make substitutions as if you were in the dugout. Or retire to the owner's box and let your coaches and players control the action. It's up to you. NEW Pitch-By-Pitch Mode. Fully interactive pitch-by-pitch mode puts you in complete control of the game. New graphical batting and pitching interface gives you pinpoint control over each pitch. Brush back the batter with an inside fastball, then put him away with a splitter in the dirt. NEW Custom Pitcher Database. Sports Mogul unveils a 30,000 line database with data for over 1,200 pitchers that you can't find anywhere else. Includes individually researched ratings for every pitch in each pitcher's arsenal, going back to 1901. From Gaylord Perry's spitball to Daisuke Matsuzaka's \"Gyroball\", Baseball Mogul 2007 is the most complete baseball simulation you can buy. [Sports Mogul Inc.]… Expand"}, {"name": "Outlast", "details_link": "https://www.metacritic.com/game/playstation-4/outlast", "publisher": "Red Barrels", "release_date": "Feb  4 2014", "developers": ["Red Barrels"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/13055a44bfb81b6b93e2524679de55a1-98.jpg", "descriptions": "Investigate the inside of Mount Massive Asylum and live to uncover the mystery. In the remote mountains of Colorado, horrors await inside Mount Massive Asylum. A long-abandoned home for the mentally ill, it has been recently re-opened by the research and charity branch of the transnationalInvestigate the inside of Mount Massive Asylum and live to uncover the mystery. In the remote mountains of Colorado, horrors await inside Mount Massive Asylum. A long-abandoned home for the mentally ill, it has been recently re-opened by the research and charity branch of the transnational Murkoff Corporation and operates in strict secrecy... until now. Acting on a tip from an anonymous source, independent journalist Miles Upshur breaks into the facility and what he discovers treads a terrifying line between science, religion, nature and something else entirely. Once inside, his only hope of escape lies with the terrible truth at the heart of Mount Massive. Outlast is a true survival horror experience which shows that the most terrifying monsters of all come from the human mind itself. Are you prepared?… Expand"}, {"name": "NASCAR 06: Total Team Control", "details_link": "https://www.metacritic.com/game/playstation-2/nascar-06-total-team-control", "publisher": "EA Sports", "release_date": "Aug 30 2005", "developers": ["EA Sports"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/c4f2cacfb803cba8bcdd5fbbe3cb1656-98.jpg", "descriptions": "As the first console racing game to use voice-recognition technology, you have the edge. Call out to teammates for help, talk to your crew chief for real-time info on track conditions, as well as activate in-game menu options. New Dynamic Car Swapping: Using the right analog stick, takeAs the first console racing game to use voice-recognition technology, you have the edge. Call out to teammates for help, talk to your crew chief for real-time info on track conditions, as well as activate in-game menu options. New Dynamic Car Swapping: Using the right analog stick, take control of your teammate's car during a race and bring him to the front. New Interactive Crew Chief: With eight new controller commands such as Pitting With Teammates and Blocking and Holding Position, you will feel what it's like to race as a team and move to the front of the pack. Every driver has his own personality and performance characteristics matching their real-life counterparts. Create your character and work your way up the NASCAR ranks, building-up the ultimate team. Take the helm of your own racing organization and position yourself to out-perform real-world NASCAR teams, or even own them. [Electronic Arts]… Expand"}, {"name": "Pac-Man Championship Edition 2", "details_link": "https://www.metacritic.com/game/pc/pac-man-championship-edition-2", "publisher": "Bandai Namco Games", "release_date": "Sep 13 2016", "developers": ["Bandai Namco Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 78, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/c20683c265e3295b9c4cd7ccc51c1785-98.jpg", "descriptions": "A new sequel in the PAC-MAN Championship Edition series comes to next-generation consoles and PC. Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for the future Featuring 3DA new sequel in the PAC-MAN Championship Edition series comes to next-generation consoles and PC. Taking highlights from the past, PAC-MAN Championship Edition 2 takes the best aspects from Championship Edition and Championship Edition DX and evolves the game for the future Featuring 3D graphics and funky visuals, the latest version of the classic game takes chomping and chasing through mazes to a new level.… Expand"}, {"name": "Call of Duty: Black Ops III - Zombies Chronicles", "details_link": "https://www.metacritic.com/game/playstation-4/call-of-duty-black-ops-iii---zombies-chronicles", "publisher": "Activision", "release_date": "May 16 2017", "developers": ["Treyarch"], "platforms": ["Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/101b32e7ad40dd5d9b024f4349dd23c6-98.jpg", "descriptions": "Call of Duty®: Black Ops III - Zombies Chronicles is available now on PS4™, delivering 8 remastered classic Zombies maps from Call of Duty®: World at War, Call of Duty®: Black Ops and Call of Duty®: Black Ops II. Complete maps from the original saga are fully remastered and HD playable,Call of Duty®: Black Ops III - Zombies Chronicles is available now on PS4™, delivering 8 remastered classic Zombies maps from Call of Duty®: World at War, Call of Duty®: Black Ops and Call of Duty®: Black Ops II. Complete maps from the original saga are fully remastered and HD playable, within Call of Duty®: Black Ops III.… Expand"}, {"name": "Crashlands", "details_link": "https://www.metacritic.com/game/pc/crashlands", "publisher": "Butterscotch Shenanigans", "release_date": "Jan 21 2016", "developers": ["Butterscotch Shenanigans"], "platforms": ["iPhone/iPad", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/41fed4ba7fbf983b01b8ce530bbc2890-98.jpg", "descriptions": "Crashlands is a story-driven crafting ARPG set in an outlandish world of hidden magic and high technology. Fight and tame alien beasts, craft resources into menacing weaponry, befriend the locals, and go toe-to-chin with a world-domineering maniac."}, {"name": "DOOM Eternal: The Ancient Gods Part Two", "details_link": "https://www.metacritic.com/game/pc/doom-eternal-the-ancient-gods-part-two", "publisher": "Bethesda Softworks", "release_date": "Mar 18 2021", "developers": ["id Software"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 3 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/5/fa7c203e2aed2fe5ce8d5febe1867a02-98.jpg", "descriptions": "Unite the Sentinel armies and take the war to the stronghold of the Dark Lord himself in one last effort to seal away evil once and for all. With the all-new Sentinel Hammer in hand, the Slayer will rip, tear and now smash every demon in his path across ancient Sentinel settlements,Unite the Sentinel armies and take the war to the stronghold of the Dark Lord himself in one last effort to seal away evil once and for all. With the all-new Sentinel Hammer in hand, the Slayer will rip, tear and now smash every demon in his path across ancient Sentinel settlements, devastated Earth cities and beyond, tackling stronger new enemy variants as he nears his final battle.Everything you've fought for has led to this moment. Your war against Hell ends here.… Expand"}, {"name": "Iratus: Lord of the Dead", "details_link": "https://www.metacritic.com/game/pc/iratus-lord-of-the-dead", "publisher": "Unfrozen", "release_date": "Apr 23 2020", "developers": ["Unfrozen"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Roguelike"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/c8072a82fd6e90d96f5d1901ef993697-98.jpg", "descriptions": "Iratus: Lord of the Dead is a dark, challenging turn-based roguelike RPG through which you play as an evil necromancer escaping from your dungeon prison to once again embark on the domination of the world."}, {"name": "King's Bounty: Crossworlds", "details_link": "https://www.metacritic.com/game/pc/kings-bounty-crossworlds", "publisher": "1C", "release_date": "Sep 17 2010", "developers": ["Katauri Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 78, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/683610a8eaf6404972c6dfa8c2c3d9d0-98.jpg", "descriptions": "King's Bounty: Crossworlds is a stand-alone expansion to the award-winning King’s Bounty: Armored Princess. The game will feature two new campaigns, quests, spells, units and a full-scale game editor."}, {"name": "Everybody's Gone to the Rapture", "details_link": "https://www.metacritic.com/game/playstation-4/everybodys-gone-to-the-rapture", "publisher": "SCEA", "release_date": "Aug 11 2015", "developers": ["The Chinese Room"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "General", "General", "Adventure", "3D", "First-Person"], "meta_score": 78, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/a094771e9459004eb8637b6eb1601df6-98.jpg", "descriptions": "Everybody’s Gone to the Rapture transports the player back to the brief moments leading up to the apocalypse to explore the choices people make when they’re faced with world-shattering events beyond their control."}, {"name": "Horizon Chase Turbo", "details_link": "https://www.metacritic.com/game/playstation-4/horizon-chase-turbo", "publisher": "Aquiris Game Studio", "release_date": "May 15 2018", "developers": ["Aquiris Game Studio"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/846eab9a965efd38f3615718afd6ee06-98.jpg", "descriptions": "Horizon Chase Turbo is a racing game inspired by the great hits of the 80’s and 90’s: Out Run, Top Gear, Rush, among others. It recreates classic arcade gameplay and offers you unbound speed limits of fun."}, {"name": "Offworld Trading Company", "details_link": "https://www.metacritic.com/game/pc/offworld-trading-company", "publisher": "Stardock", "release_date": "Apr 28 2016", "developers": ["Mohawk Games"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Real-Time", "General", "Strategy", "Management", "Business / Tycoon"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/737177264702edb8122b81c865e2d381-98.jpg", "descriptions": "Offworld Trading Company is a new direction for real-time strategy, where money is both your deadliest weapon and toughest defense. After the Earth is tapped out and the asteroids claimed by faceless megacorporations, the stark Martian surface is the final frontier on which dreamers andOffworld Trading Company is a new direction for real-time strategy, where money is both your deadliest weapon and toughest defense. After the Earth is tapped out and the asteroids claimed by faceless megacorporations, the stark Martian surface is the final frontier on which dreamers and entrepreneurs can make something of themselves by staking their claim to the red planet’s abundant resources and building an economic engine capable of out-producing the competition.… Expand"}, {"name": "Olija", "details_link": "https://www.metacritic.com/game/switch/olija", "publisher": "Devolver Digital", "release_date": "Jan 28 2021", "developers": ["Skeleton Crew Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Open-World", "2D"], "meta_score": 78, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/d57668395d7e329322e392b21869d3f0-98.jpg", "descriptions": "Olija is a game about Faraday's quest, a man shipwrecked then trapped in the mysterious country of Terraphage.\r Armed with a legendary harpoon, he and other castaways try to leave this hostile country to return to their homelands.\r\n\r\nThrough adventurous exploration, narration and razorOlija is a game about Faraday's quest, a man shipwrecked then trapped in the mysterious country of Terraphage.\r Armed with a legendary harpoon, he and other castaways try to leave this hostile country to return to their homelands.\r Through adventurous exploration, narration and razor sharp combat, the player will discover a strange world and its inhabitants, including Olija, an enigmatic lady that Faraday finds himself bound to over time. Inspired by swashbuckling tales and cinematic adventure games, Olija is a story about facing the unknown in adversity.\r - Explore a mysterious and handcrafted world inspired by sailor's legends and Asian fantasy.\r - Wield the Harpoon of legend and rethink movement through platforming, puzzle and combat.\r - Rescue fellow castaways and meet curious characters to learn more about Terraphage and the enigmatic Olija.\r - Beautiful melancholic soundtrack inspired by Flamenco, lo-fi and traditional Japanese music.\r - Craft magic hats!… Expand"}, {"name": "Dawn of Discovery: Venice", "details_link": "https://www.metacritic.com/game/pc/dawn-of-discovery-venice", "publisher": "Ubisoft", "release_date": "Feb 26 2010", "developers": ["Related Designs"], "platforms": "PC", "genres": ["Simulation", "General", "General"], "meta_score": 78, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/2cf0ea34665573f886f1ecd51bba3387-98.jpg", "descriptions": "(Also known as \"Anno 1404: Venice\")  New Venetian setting: The rich Dawn of Discovery environment is complemented with a new Venetian setting offering new possibilities of interaction: Build two new Venetian ship types: the small and big tradesman cog. Develop secret cabinets, infiltrate(Also known as \"Anno 1404: Venice\")  New Venetian setting: The rich Dawn of Discovery environment is complemented with a new Venetian setting offering new possibilities of interaction: Build two new Venetian ship types: the small and big tradesman cog. Develop secret cabinets, infiltrate your enemies and sabotage their expansion. Multiplayer: Play Dawn of Discovery online in multiplayer mode: Choose to play versus or co-op to defeat the AI by combining your techniques. Up to 8 players. New Challenges and Quests: Up to 60 new items and 300 new quests with two new types: trading race and ship boarding. Discover and exploit a new type of island, the Volcano island. New scenarios to face new challenges with new achievements, medals and crests. [Ubisoft]… Expand"}, {"name": "EyeToy: Play 2", "details_link": "https://www.metacritic.com/game/playstation-2/eyetoy-play-2", "publisher": "SCEA", "release_date": "Aug 16 2005", "developers": ["SCEE"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Miscellaneous", "General"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/666c8cc0393e20fb26e310c14d9a9a02-98.jpg", "descriptions": "(Currently available in the UK/EU only)  Things have come a long way since the original Play; EyeToy: Play 2 expands significantly on the mini-game formula, cramming over 70 wildly different quick-fire challenges into 12 spectacular new games and a variety of bonus mini-games. In addition,(Currently available in the UK/EU only)  Things have come a long way since the original Play; EyeToy: Play 2 expands significantly on the mini-game formula, cramming over 70 wildly different quick-fire challenges into 12 spectacular new games and a variety of bonus mini-games. In addition, the PlayRoom has now become the home for a variety of amazing EyeToy experiments that will change your perception of what's possible with the wonder camera. Improved Multi Player mode lets up to four people compete over 50 mini-games. Catch out intruders with SpyToy security. Interact with a 3D model of your own or your friend's head with EyeToy: Cameo. Wide range of experimental PlayRoom effects - interact using movement, sound and even fruit. [SCEE]… Expand"}, {"name": "Destiny 2: Shadowkeep", "details_link": "https://www.metacritic.com/game/pc/destiny-2-shadowkeep", "publisher": "Activision", "release_date": "Oct  1 2019", "developers": ["Bungie"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 78, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/0975977d013e7a2732977946a3682598-98.jpg", "descriptions": "New nightmares have emerged from the shadows of our Moon. Called forth by haunting visions, Eris Morn has returned. Join her to slay these nightmares before they reach out beyond the Moon to cast humanity back into an age of darkness. Features: New Missions, & Quests; New Destination &New nightmares have emerged from the shadows of our Moon. Called forth by haunting visions, Eris Morn has returned. Join her to slay these nightmares before they reach out beyond the Moon to cast humanity back into an age of darkness. Features: New Missions, & Quests; New Destination & Dungeon; New Weapons and Gear to Earn; An All New Raid; and more.… Expand"}, {"name": "Pro Evolution Soccer 2010", "details_link": "https://www.metacritic.com/game/xbox-360/pro-evolution-soccer-2010", "publisher": "Konami", "release_date": "Nov  3 2009", "developers": ["Konami"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/0d9fc366fd9851cf1f7c970a713bdc28-98.jpg", "descriptions": "PES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccerPES 2010 focuses on enhancing the excitement of matches between players, making for a truly challenging experience that constantly tests the player. Intuitive zonal defending covers spaces and players need to look constantly for new ways to attack. PES 2010 focuses on being a real soccer simulation, as it requires both strategic play and quick reactions, as in real life. In addition to key out-field elements, goalkeepers are more versatile and with abilities matching those of modern shot-stoppers. The game's referees have also been reworked, with smarter AI elements allowing them to make more balanced calls during matches. PES 2010 has undergone a major visual revamp, with its celebrated player likenesses and animations now even closer to those of real-life players - including live player expressions to be depicted with an improved lighting system which differentiates between various conditions! [Konami]… Expand"}, {"name": "FIFA 22", "details_link": "https://www.metacritic.com/game/playstation-5/fifa-22", "publisher": "Electronic Arts", "release_date": "Sep 27 2021", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 78, "users_score": 2.6, "image": "https://static.metacritic.com/images/products/games/0/f2242750730a7c9cdbff403deedc9504-98.jpg", "descriptions": "Powered by Football™, EA SPORTS™ FIFA 22 brings the game even closer to the real thing with fundamental gameplay advances and a new season of innovation across every mode. New gameplay features in FIFA 22 give you more consistency between the posts with a goalkeeper rewrite that brings morePowered by Football™, EA SPORTS™ FIFA 22 brings the game even closer to the real thing with fundamental gameplay advances and a new season of innovation across every mode. New gameplay features in FIFA 22 give you more consistency between the posts with a goalkeeper rewrite that brings more composure to the most important position on the pitch, alongside new ball physics, explosive sprint that better matches the acceleration of the game’s quickest players, and new attacking tactics that let you take control of how your team plays. In Career Mode, live out your football dreams as you create and manage the game’s newest club to glory. VOLTA FOOTBALL rewards you for your flair with restyled small-sided gameplay and new ways to play and progress each season. Get the squad together in Pro Clubs with enhanced team customization and updated progression that puts you in control of your Virtual Pro’s development, and welcome back some of football’s most memorable players as new FUT Heroes in FIFA Ultimate Team™ with a redefined competition structure that makes testing your skills against other players more accessible. However you play, enjoy unrivaled authenticity everywhere with over 17,000 players, 700+ teams, and more than 30 leagues including the UEFA Champions League, CONMEBOL Libertadores, and the brand new UEFA Europa Conference League - only available in FIFA 22.\rGAMEPLAY\rReimagined gameplay creates fundamental advances that you’ll feel across every mode in FIFA 22. A goalkeeper rewrite brings more composure and consistency to the most important position on the pitch, new ball physics reimagine every pass, shot, and goal, and explosive sprint lets you feel the acceleration of the game’s quickest players.\r•\tGoalkeeper Rewrite - A brand new goalkeeper system brings a new level of intelligence to the last line of defence, unlocking more reliable shot-stopping and smarter decision-making between the posts. In FIFA 22, goalkeeper positioning personality replicates the different styles of keepers throughout the game - from the lightning-fast reflexes of world-class shot stoppers like Jan Oblak to the aggression of sweeper keepers such as Ederson.\r•\tTrue Ball Physics - Real-world data imported into FIFA 22 takes the game’s ball physics to a new level of realism. Tuned parameters including speed, swerve, air drag, air resistance, ground friction, and rolling friction mean every touch, trap, shot, volley, pass, and dribble will look, move, and fly like the real thing.\r•\tExplosive Sprint - A new gameplay mechanic that changes the dynamic of one-on-one situations, Explosive Sprint gives you more control over acceleration when dribbling or defending. Lure opponents in and choose when to unleash your full speed to get away from the defender as you drive your team forward in attack.\r… Expand"}, {"name": "Mega Man 10", "details_link": "https://www.metacritic.com/game/playstation-3/mega-man-10", "publisher": "Capcom", "release_date": "Mar 11 2010", "developers": ["Inti Creates"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/988356a78e24bd6ba21e0a5fad147988-98.jpg", "descriptions": "[Playstation Network]  The original 2-D classic Mega Man returns in the all new Mega Man 10! Mega Man 10 continues to bring the series back to its old-school roots, with retro platforming action and classic 8-bit graphics and sound. Rediscover Mega Man with new, classically-inspired boss[Playstation Network]  The original 2-D classic Mega Man returns in the all new Mega Man 10! Mega Man 10 continues to bring the series back to its old-school roots, with retro platforming action and classic 8-bit graphics and sound. Rediscover Mega Man with new, classically-inspired boss characters, each with unique weapons and vulnerabilities. The year is 20XX and Robotenza - the Robot Flu - has spread like wildfire, incapacitating robots everywhere. One month after the outbreak, the situation worsens. Infected robots have gone out of control and have destroyed the city! It's up to Mega Man to get to the bottom of this viral mystery.… Expand"}, {"name": "Warhammer 40,000: Shootas, Blood & Teef", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-shootas-blood-teef", "publisher": "Rogueside", "release_date": "Oct 20 2022", "developers": ["Rogueside"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/0af8be1bd9145a53e681419623dcfb11-98.jpg", "descriptions": "The Orks, a savage race commonly known as the 'Green Tide', sweep across the stars with unrivalled violence in frenzied crusades known as a Waaagh! They are savage, brutal and crude, outnumbering all other races that lay in their path of destruction.Become the spearhead of an Ork invasionThe Orks, a savage race commonly known as the 'Green Tide', sweep across the stars with unrivalled violence in frenzied crusades known as a Waaagh! They are savage, brutal and crude, outnumbering all other races that lay in their path of destruction.Become the spearhead of an Ork invasion as you bash, smash and shoot your way through the hive city of Luteus Prime on a mission to retrieve your hair squig and claim vengeance on your warlord! And just maybe become the warboss of a WAAAGH! along the way? Survival of the strongest has never been so violently fun!Never enough Dakka! Destroy your foes using a great arsenal of weapons and rain destruction down upon them. No one can stand in your way! Massive explosions and flying body parts ain't never been this fun!WAAAGH! Feel the emotion and violence build up until it bursts out as a storm of bullets! Violence begets violence as the massive destruction you cause builds up into a full blown unstoppable WAAAGH! Because Orks are made for two things: fightingand winning! Orks together strong! Grab your friends and take on the forces of the Astra Militarum, the Genestealer Cults and the Space Marines together. Or you know, bash their head in instead and determine who is the fiercest Ork in the clan!… Expand"}, {"name": "Fights in Tight Spaces", "details_link": "https://www.metacritic.com/game/pc/fights-in-tight-spaces", "publisher": "Mode 7 Games", "release_date": "Dec  2 2021", "developers": ["Ground Shatter Ltd."], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Card Battle"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/85200eacae46dc744f1b93fac366fa00-98.jpg", "descriptions": "A stylish blend of deck-building, turn-based tactics, and thrilling animated fight sequences in classic action-movie settings. Learn to balance your hand, momentum, and positioning to overcome the odds to defeat your adversaries. Build your deck, control the space and live to fight another day."}, {"name": "Evil Genius 2: World Domination", "details_link": "https://www.metacritic.com/game/playstation-5/evil-genius-2-world-domination", "publisher": "Rebellion", "release_date": "Nov 30 2021", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 78, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/e1ecb48368da5491679408dfce9ab6ed-98.jpg", "descriptions": "Evil Genius 2 is a satirical spy-fi lair builder, where players take control of an Evil Genius and set their plans for world domination in motion. When it feels this good to be bad, the Forces of Justice don't stand a chance. Build your own unique evil lair and cover operation, train a forceEvil Genius 2 is a satirical spy-fi lair builder, where players take control of an Evil Genius and set their plans for world domination in motion. When it feels this good to be bad, the Forces of Justice don't stand a chance. Build your own unique evil lair and cover operation, train a force of criminal minions, defend your lair from the Forces of Justice, and dominate the world with a doomsday device in this direct sequel to the 2004 cult classic!… Expand"}, {"name": "Death's Gambit: Afterlife", "details_link": "https://www.metacritic.com/game/switch/deaths-gambit-afterlife", "publisher": "Serenity Forge", "release_date": "Sep 30 2021", "developers": ["White Rabbit Interactive"], "platforms": ["PC", "PlayStation 4", "Switch"], "genres": ["Action", "Role-Playing", "Platformer", "Action RPG", "Metroidvania"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/672acb118e23245b1f0a29492e3722ee-98.jpg", "descriptions": "A contract binds you to Death who seeks to eradicate immortality. Will you do his bidding and restore the natural order, or succumb to its power in this hardcore 2D action RPG? The promise of immortality lies at the heart of Siradon. As Death's right hand, challenge the undying guardians ofA contract binds you to Death who seeks to eradicate immortality. Will you do his bidding and restore the natural order, or succumb to its power in this hardcore 2D action RPG? The promise of immortality lies at the heart of Siradon. As Death's right hand, challenge the undying guardians of the realm and endure the eternal struggle to purge their souls.\r Death's Gambit: Afterlife is the new and expanded edition of the original hardcore 2D RPG action platformer. Master the precise combat, utilizing a wide variety of weapons and abilities to confront the horrors that lurk within Siradon. Explore a mysterious and unforgiving world and uncover the true price of immortality.\r Afterlife offers players a wealth of new content to experience on top of the original game, including 10 new levels, over 30 weapons, 5 new bosses, mechanical overhauls, and more. Your choices will affect the epic finale to Sorun’s tale.… Expand"}, {"name": "Dragon Ball Z: Kakarot + A New Power Awakens Set", "details_link": "https://www.metacritic.com/game/switch/dragon-ball-z-kakarot-+-a-new-power-awakens-set", "publisher": "Bandai Namco Games", "release_date": "Sep 24 2021", "developers": ["CyberConnect2"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 78, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/fec30c5a6512542c27bd54b82e463ec0-98.jpg", "descriptions": "Relive the story of Goku and other Z Fighters in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku, Gohan, Vegeta and others. Explore the new areas and adventures as you advance through the story and formRelive the story of Goku and other Z Fighters in DRAGON BALL Z: KAKAROT! Beyond the epic battles, experience life in the DRAGON BALL Z world as you fight, fish, eat, and train with Goku, Gohan, Vegeta and others. Explore the new areas and adventures as you advance through the story and form powerful bonds with other heroes from the DRAGON BALL Z universe.… Expand"}, {"name": "Haven", "details_link": "https://www.metacritic.com/game/switch/haven", "publisher": "The Game Bakers", "release_date": "Feb  4 2021", "developers": ["The Game Bakers"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/e1323b48186fbd6452ddb37762c3e30b-98.jpg", "descriptions": "They escaped to a lost planet to be together. A RPG adventure about love and freedom. To play solo or co-op with a special someone. Yu and Kay have escaped to a forgotten planet. Play the two lovers settling in an unknown world. Survive together, glide over the plains, camp, restore theThey escaped to a lost planet to be together. A RPG adventure about love and freedom. To play solo or co-op with a special someone. Yu and Kay have escaped to a forgotten planet. Play the two lovers settling in an unknown world. Survive together, glide over the plains, camp, restore the planet, fight if you have to. All that matters is to stay together.\r… Expand"}, {"name": "Wingspan", "details_link": "https://www.metacritic.com/game/switch/wingspan", "publisher": "Monster Couch", "release_date": "Dec 29 2020", "developers": ["Monster Couch"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Switch"], "num_players": "Up to 5 ", "genres": ["Strategy", "General", "Miscellaneous", "Board / Card Game"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/6688bb4497bee8a1f28c5f6652a3ccb7-98.jpg", "descriptions": "Relaxing Strategy Game About Birds for 1 to 5 players\r The officially licensed digital adaptation of Wingspan, the winner of the prestigious 2019 Kennerspiel des Jahres board game award.\r\n\r\nYou are bird enthusiasts—researchers, bird watchers, ornithologists, and collectors—seeking toRelaxing Strategy Game About Birds for 1 to 5 players\r The officially licensed digital adaptation of Wingspan, the winner of the prestigious 2019 Kennerspiel des Jahres board game award.\r You are bird enthusiasts—researchers, bird watchers, ornithologists, and collectors—seeking to discover and attract the best birds to your network of wildlife preserves. Each bird extends a chain of powerful combinations in one of your habitats. Each habitat focuses on a key aspect of the growth of your preserves.\r In Wingspan up to 5 players compete to build up their nature preserves in a limited number of turns. Each beautiful bird that you add to your preserve makes you better at laying eggs, drawing cards, or gathering food. Many of the 170 unique birds have powers that echo real life: your hawks will hunt, your pelicans will fish, and your geese will form a flock.\r Features\r* Relaxing strategy card game where your goal is to discover and attract the best birds.\r* Single player and multiplayer modes for up to five players.\r* Based on the award winning, competitive, medium-weight, card-driven, engine-building board game.\r* Hundreds of unique, animated birds with their real life sound recordings.\r* Multiple ways to accumulate points with birds, bonus cards and end-of-round goals.\r… Expand"}, {"name": "PHOGS!", "details_link": "https://www.metacritic.com/game/switch/phogs!", "publisher": "Coatsink Software", "release_date": "Dec  3 2020", "developers": ["Bit Loom Games"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/ab3004ea21e0e199c5a8495fcc9e17ba-98.jpg", "descriptions": "Two heads are better than one. In PHOGS! you play as a duo of dogs on a captivating, puzzle-filled adventure. Linked by a stretchy belly, you’ll need to bark, bite and bounce your way through obstacles set across the themed worlds of Food, Sleep and Play, in co-op or single-player.\r ForageTwo heads are better than one. In PHOGS! you play as a duo of dogs on a captivating, puzzle-filled adventure. Linked by a stretchy belly, you’ll need to bark, bite and bounce your way through obstacles set across the themed worlds of Food, Sleep and Play, in co-op or single-player.\r Forage through Food World, teeming with tasty treats. From hot buttered toast to chopped celery... even a river of chocolate!\r Stroll through Sleep World, complete with teddy bears, cushions and quilts, all nestled in the glow of the soothing night-light. \r\rPounce through the crazy toybox of Play World, exploring a beach amusement park, a retro arcade, and everything in between. Woof!\r Supporting single-player and shared-controller gameplay, plus local and online co-op, Red and Blue are always ready to play!\r… Expand"}, {"name": "Piofiore: Fated Memories", "details_link": "https://www.metacritic.com/game/switch/piofiore-fated-memories", "publisher": "Aksys Games", "release_date": "Oct  8 2020", "developers": ["Idea Factory", "Design Factory"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "Sports", "General", "Other", "Individual", "Adventure", "Visual Novel"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/0708b75163c14bbcdf321ff5f7fe9473-98.jpg", "descriptions": "Liliana Adornato was born and raised in the church in the center of the Italian city of Burlone. Three criminal organizations control parts of the city, and Lili discovers that she is literally in the center of their turf wars. Her encounters with the leaders of the Falzone, Visconti, andLiliana Adornato was born and raised in the church in the center of the Italian city of Burlone. Three criminal organizations control parts of the city, and Lili discovers that she is literally in the center of their turf wars. Her encounters with the leaders of the Falzone, Visconti, and Lao-Shu families lead to danger and distraction. Once Lili is drawn into the shadowy world of organized crime, she realizes there is no going back.\r • Experience gorgeous music and artwork depicting the sun drenched (and sin-filled) world of early 20th century Italy. (circa 1920's)\r• Navigate organizations filled with intrigue and betrayal as three crime families fight for honor and control.\r• Unlock additional story options, new perspectives, and deeper, deadlier secrets as you complete the game multiple times.\rShare Share on Facebook Tweet Tweet on Twitter Pin it… Expand"}, {"name": "Inmost", "details_link": "https://www.metacritic.com/game/switch/inmost", "publisher": "Chucklefish", "release_date": "Aug 21 2020", "developers": ["Hidden Layer Games"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "3D"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/639a9b778c05c3c2643189510d6cfe0e-98.jpg", "descriptions": "Inmost is an atmospheric, story-driven puzzle platformer, following three playable characters within one dark, interconnecting story. In an old abandoned castle, you’ll need to explore every nook and cranny, avoid detection, slice your way through enemies and spring deadly traps in order toInmost is an atmospheric, story-driven puzzle platformer, following three playable characters within one dark, interconnecting story. In an old abandoned castle, you’ll need to explore every nook and cranny, avoid detection, slice your way through enemies and spring deadly traps in order to escape the evil that lurks within…\r… Expand"}, {"name": "Atomicrops", "details_link": "https://www.metacritic.com/game/pc/atomicrops", "publisher": "Raw Fury", "release_date": "May 28 2020", "developers": ["Daniel Wynne", "Bird Bath Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/f1671d77ba5fc839022e2dd489aaee62-98.jpg", "descriptions": "Modern city life got you down? Well you’ve just inherited your late uncle’s farm, time to pack your bags and start fresh in the peaceful countryside. What could possibly go wrong? A nuclear apocalypse, that’s what. Now you’re in a hellscape wasteland defending the last surviving source ofModern city life got you down? Well you’ve just inherited your late uncle’s farm, time to pack your bags and start fresh in the peaceful countryside. What could possibly go wrong? A nuclear apocalypse, that’s what. Now you’re in a hellscape wasteland defending the last surviving source of sustenance – your crops. And every mutant wants a piece.… Expand"}, {"name": "Depixtion", "details_link": "https://www.metacritic.com/game/switch/depixtion", "publisher": "DevHour Games, LLC", "release_date": "Feb 28 2020", "developers": ["DevHour Games", "LLC"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Logic"], "meta_score": 78, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/3b22878246286367dc8796729dd050e5-98.jpg", "descriptions": "Based on the popular Picross series, Depixtion blends color mixing mechanics with the rules of nonograms to create a uniquely colorful experience."}, {"name": "Age of Wonders: Planetfall", "details_link": "https://www.metacritic.com/game/playstation-4/age-of-wonders-planetfall", "publisher": "Paradox Interactive", "release_date": "Aug  6 2019", "developers": ["Triumph Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Strategy", "Turn-Based", "General", "4X"], "meta_score": 78, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/d19b3a10bb7963672d3919192cf7cc9d-98.jpg", "descriptions": "Age of Wonders: Planetfall is the new strategy game from Triumph Studios, creators of the critically acclaimed Age of Wonders series, bringing all the exciting tactical turn-based combat and in-depth empire building of its predecessors to space in an all-new, sci-fi setting."}, {"name": "Legendary Gary", "details_link": "https://www.metacritic.com/game/pc/legendary-gary", "publisher": "Evan Rogers", "release_date": "Feb 20 2018", "developers": ["Evan Rogers"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/86819ef18551fc9d2e6e31d568cd2794-98.jpg", "descriptions": "Help Gary become a better person in his real life and a legend in his virtual life."}, {"name": "Everybody's Golf", "details_link": "https://www.metacritic.com/game/playstation-4/everybodys-golf", "publisher": "SCEA", "release_date": "Aug 29 2017", "developers": ["SCEI", "Clap Hanz"], "platforms": "PlayStation 4", "num_players": "Up to 20 ", "genres": ["Traditional", "Sports", "Individual", "Golf", "Arcade"], "meta_score": 78, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/5dc7a4d4d161964952aad4a8480a94ce-98.jpg", "descriptions": "Step on to the fairway for a unique blend of deep golf mechanics and quirky visual style that the beloved franchise is known for. Entering the clubhouse is a variety of new features, including the chance to create and customise your own golfer, with an assortment of tasks to play and levelStep on to the fairway for a unique blend of deep golf mechanics and quirky visual style that the beloved franchise is known for. Entering the clubhouse is a variety of new features, including the chance to create and customise your own golfer, with an assortment of tasks to play and level up their skills with. Fancy a stroll around the green? Hop into a golf kart and explore the free-roaming courses, interacting with other online players, jumping into mini-games and unlocking new tasks, tournaments and rewards.… Expand"}, {"name": "Shadows of Adam", "details_link": "https://www.metacritic.com/game/pc/shadows-of-adam", "publisher": "Something Classic Games LLC", "release_date": "Feb 23 2017", "developers": ["Something Classic Games LLC"], "platforms": ["PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/81f6912be5c49c4241719a897afb30a4-98.jpg", "descriptions": "A legendary hero, Orazio has disappeared, leaving behind a son and adopted daughter. With darkness looming, Kellan and Asrael set off on an epic journey to save their homeland and uncover the truth behind their father’s abrupt disappearance."}, {"name": "Flywrench", "details_link": "https://www.metacritic.com/game/playstation-4/flywrench", "publisher": "Messhof", "release_date": "Feb 14 2017", "developers": ["Messhof"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 78, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/1/c463cc385c920a19f2358a5fbfe5dec3-98.jpg", "descriptions": "Flywrench is a frenetic action game from the makers of Nidhogg about piloting an aerobatic ship through the depths of space."}, {"name": "Style Savvy: Fashion Forward", "details_link": "https://www.metacritic.com/game/3ds/style-savvy-fashion-forward", "publisher": "Nintendo", "release_date": "Aug 19 2016", "developers": ["syn Sophia"], "platforms": "3DS", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 78, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/bbdea0cc6a45dadac3defed69a0f6bc3-98.jpg", "descriptions": "Manage your very own boutique and become the star of the entire fashion business!\r Dive into the world of fashion!\r\n\r\nRun your very own business and help your customers to become truly stylish!\r\n\r\nThe fashion is business in the palm of your hand - choose from your path and show yourManage your very own boutique and become the star of the entire fashion business!\r Dive into the world of fashion!\r Run your very own business and help your customers to become truly stylish!\r The fashion is business in the palm of your hand - choose from your path and show your talent!\r - Share your best looks and challenge your friends\r- Participate in contests and take pics with your pals!\r- Decorate to your heart's content\r- Create the perfect showroom!\r- Choose from 19,000 items!\r- Manager your fashion store\r- Delight your customers… Expand"}, {"name": "Dungelot: Shattered Lands", "details_link": "https://www.metacritic.com/game/pc/dungelot-shattered-lands", "publisher": "tinyBuild", "release_date": "Feb 18 2016", "developers": ["Red Winter Software Limited", "Red Winter Software"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/5f7009458c0a5a9abb0275089e61bc15-98.jpg", "descriptions": "Dungelot: Shattered Lands takes you on an epic roguelike dungeon-crawler adventure to defeat zombie cows, splat giant evil mushrooms, and generally get back home in one piece. Deceptively simple, ever so addictive."}, {"name": "Dying Light: The Following", "details_link": "https://www.metacritic.com/game/playstation-4/dying-light-the-following", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Feb  9 2016", "developers": ["Techland"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/17ad81bace642a862e673c2653c78247-98.jpg", "descriptions": "Dying Light: The Following is a significant expansion to Dying Light and the untold chapter of Kyle Crane’s story. Take to a vast new area that will transform your Dying Light experience through new game mechanics, environments and challenges on top of the established core of the game."}, {"name": "Teslagrad", "details_link": "https://www.metacritic.com/game/playstation-4/teslagrad", "publisher": "Rain Games", "release_date": "Apr 14 2015", "developers": ["Rain Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/0ebb4b5941d5ffdefbbe812849b18f91-98.jpg", "descriptions": "Teslagrad is a 2D puzzle-platformer in which you play as a young lad who suddenly finds himself embroiled in an ancient conflict that will shake the foundations of his entire existence, and bring a gruesome truth to light. The game revolves around the use of electricity and magnetism, andTeslagrad is a 2D puzzle-platformer in which you play as a young lad who suddenly finds himself embroiled in an ancient conflict that will shake the foundations of his entire existence, and bring a gruesome truth to light. The game revolves around the use of electricity and magnetism, and your ingenuity will be put to the test as you employ the amazing technology of the Teslamancers to traverse the abandoned Tesla Tower. The game is completely devoid of both text and dialogue, and prefers to tell the story purely through visual means.… Expand"}, {"name": "The Walking Dead: Season Two Episode 4 - Amid the Ruins", "details_link": "https://www.metacritic.com/game/playstation-3/the-walking-dead-season-two-episode-4---amid-the-ruins", "publisher": "Telltale Games", "release_date": "Jul 22 2014", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "genres": ["General", "Action", "Adventure", "General", "Point-and-Click"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/7b20ce49c555d79b180719e015ec488b-98.jpg", "descriptions": "Free from their brutal captor, the group continues their journey north. However, hunger, violence and death have taken their toll. Smoldering conflicts and inevitable changes within the group remind Clementine that danger can come from within, as well as from the outside; she must choose herFree from their brutal captor, the group continues their journey north. However, hunger, violence and death have taken their toll. Smoldering conflicts and inevitable changes within the group remind Clementine that danger can come from within, as well as from the outside; she must choose her allies wisely in this second-to-last episode of The Walking Dead: Season Two.… Expand"}, {"name": "Battlefield 3: End Game", "details_link": "https://www.metacritic.com/game/pc/battlefield-3-end-game", "publisher": "Electronic Arts", "release_date": "Mar 26 2013", "developers": ["EA DICE"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Tactical", "Modern", "Arcade"], "meta_score": 78, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/528e7b101ea3abe18dfe94dbd494cab2-98.jpg", "descriptions": "Battlefield 3: End Game is a digital expansion pack for Battlefield 3 that brings four distinct maps, a new dirt bike, new lightweight AA vehicles, and two classic Battlefield game modes - Capture the Flag and Air Superiority."}, {"name": "Marvel vs. Capcom Origins", "details_link": "https://www.metacritic.com/game/xbox-360/marvel-vs-capcom-origins", "publisher": "Capcom", "release_date": "Sep 26 2012", "developers": ["Iron Galaxy Studios"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Miscellaneous", "Fighting", "Compilation", "2D"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/0d540d8fdcde37d75db7a58eed1bd305-98.jpg", "descriptions": "MARVEL VS. CAPCOM ORIGINS offers both the one-on-one gameplay of Marvel Super Heroes with its unique Infinity Gem system and the two-on-two carnage of the original Marvel vs. Capcom: Clash of Super Heroes, featuring a tag system, assists, and the wild Duo Team Attack. Bringing forth a hostMARVEL VS. CAPCOM ORIGINS offers both the one-on-one gameplay of Marvel Super Heroes with its unique Infinity Gem system and the two-on-two carnage of the original Marvel vs. Capcom: Clash of Super Heroes, featuring a tag system, assists, and the wild Duo Team Attack. Bringing forth a host of features never before seen in these games, MARVEL VS. CAPCOM ORIGINS features GGPO-enhanced online play with 8-player lobbies and spectator mode, HD graphical upgrades, dynamic challenges and replay saving.… Expand"}, {"name": "Call of Duty: Black Ops - Annihilation", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-black-ops---annihilation", "publisher": "Activision", "release_date": "Jun 28 2011", "developers": ["Treyarch"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Historic", "Arcade", "Historic"], "meta_score": 78, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/ce5fffb4b5e26e0fd5a7d32643504c36-98.jpg", "descriptions": "Annihilation is a DLC pack for Call of Duty: Black Ops."}, {"name": "Ace Attorney Investigations: Miles Edgeworth", "details_link": "https://www.metacritic.com/game/ds/ace-attorney-investigations-miles-edgeworth", "publisher": "Capcom", "release_date": "Feb 16 2010", "developers": ["Capcom"], "platforms": ["iPhone/iPad", "DS"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "Visual Novel"], "meta_score": 78, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/1/c38807b7abc070e1d044a8170326d5b3-98.jpg", "descriptions": "Miles Edgeworth is the famed rival prosecutor of court-house-dynamo Phoenix Wright. Since becoming the youngest prosecutor in the country at the tender age of 20, Miles Edgeworth built quite the reputation for himself by putting away bad guys in short order. However, after severalMiles Edgeworth is the famed rival prosecutor of court-house-dynamo Phoenix Wright. Since becoming the youngest prosecutor in the country at the tender age of 20, Miles Edgeworth built quite the reputation for himself by putting away bad guys in short order. However, after several confrontations against Wright, he has changed his approach to seeking the truth. Unfortunately, Wright was only the beginning of his troubles. The flashy prosecutor in the wine red suit is plagued by a series of deaths that seem to follow him wherever he goes. To obtain the truth, Miles Edgeworth will take center stage in an exciting suspense-filled drama that requires him to dive into the mysterious world of crime scene investigation. [Capcom]… Expand"}, {"name": "Top Spin 3", "details_link": "https://www.metacritic.com/game/xbox-360/top-spin-3", "publisher": "Pam Development", "release_date": "Jun 23 2008", "developers": ["Pam Development"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 78, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/629ffbe0d7987c0aa44d81c4f1db75b4-98.jpg", "descriptions": "Top Spin 3 immerses players in a visually and physically realistic tennis experience. Using next generation technology, gameplay and graphics, Top Spin 3 is a tennis experience with dynamic weather changes, evolutionary player visuals and comprehensive online offerings. In Top Spin 3,Top Spin 3 immerses players in a visually and physically realistic tennis experience. Using next generation technology, gameplay and graphics, Top Spin 3 is a tennis experience with dynamic weather changes, evolutionary player visuals and comprehensive online offerings. In Top Spin 3, players compete online and offline to rise in the ranks against current top ranked professional players. Adding a unique user-generated component, players can also use new player creator features that include free-form body sculpting, makeup and tattoos. [2K Sports]… Expand"}, {"name": "Fire Pro Wrestling Returns", "details_link": "https://www.metacritic.com/game/playstation-2/fire-pro-wrestling-returns", "publisher": "Agetec Inc.", "release_date": "Nov 13 2007", "developers": ["S-Neo"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 78, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/82ede1a4ea2fd37cd58e4abd7a61ba06-98.jpg", "descriptions": "The popular Fire Pro Wrestling series is famous for its unparalleled gameplay depth and unmatched customization options, and Fire Pro Wrestling Returns is the biggest and best title yet. Having been widely imported for years by hardcore wrestling fans, this will be the first time that theThe popular Fire Pro Wrestling series is famous for its unparalleled gameplay depth and unmatched customization options, and Fire Pro Wrestling Returns is the biggest and best title yet. Having been widely imported for years by hardcore wrestling fans, this will be the first time that the North American audience will get to experience this amazing series in their native language. A huge variety of match types, everything from Singles to Battle Royal to Electrified Barbed Wire Ropes Exploding Deathmatch! A complete arsenal of wrestling moves and holds. No other wrestling game has such a complete list of moves available. The deepest custom wrestler creator anywhere allows players to create and save hundreds of wrestlers, each with their own unique look, moves and AI! The ability to create your own referee, ring, logo, and even belt allows players to recreate any dream match they can think of! Match Maker mode lets players set up their own wrestling show, earn money, and attempt to lure bigger talent to their matches. [Agetec]… Expand"}, {"name": "NCAA March Madness 2005", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-march-madness-2005", "publisher": "EA Sports", "release_date": "Nov 17 2004", "developers": ["EA Canada"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/804b17978469fa192ea994edec6efd5a-98.jpg", "descriptions": "Lead one of 320 NCAA Division 1 Schools to the Big Dance with the most strategic basketball game ever developed. Use scouting reports and locker room videos from many of the nation?s top college coaches to create the ultimate game plan that takes you to the top. College Classics ? RecreateLead one of 320 NCAA Division 1 Schools to the Big Dance with the most strategic basketball game ever developed. Use scouting reports and locker room videos from many of the nation?s top college coaches to create the ultimate game plan that takes you to the top. College Classics ? Recreate many of college basketball's most memorable games with the greatest teams of all-time. Build a Dynasty ? With all new revamped EA Sports Dynasty Mode, build a powerhouse and run your program for up to 30 years. EA Sports Ask The Coach ? Several top Division I college basketball coaches join NCAA March Madness 2005 to provide scouting reports, strategies, and other unique advice. School Spirit ? New authentic fight songs, student-section crowd chants, mascots, and cheerleaders, deliver the sights and sounds that give college basketball its unique flavor. Ball against the Nation ? EA Sports Online allows users to play online against opponents from anywhere in the country. [Electronic Arts]… Expand"}, {"name": "Pac-Man vs.", "details_link": "https://www.metacritic.com/game/gamecube/pac-man-vs", "publisher": "Namco", "release_date": "Dec  2 2003", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Miscellaneous", "Puzzle", "General"], "meta_score": 78, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/e28736a2f0f7ddb8be8dd816370bfa66-98.jpg", "descriptions": "In Pac-Man vs., Pac-Man must navigate mazes, eating pac-dots, fruit, and power pellets as he dodges hungry ghosts, just like the original--but this time, human players control the ghosts. The lead player, viewing the entire maze on the Game Boy Advance, must avoid the other three playersIn Pac-Man vs., Pac-Man must navigate mazes, eating pac-dots, fruit, and power pellets as he dodges hungry ghosts, just like the original--but this time, human players control the ghosts. The lead player, viewing the entire maze on the Game Boy Advance, must avoid the other three players controlling the ghosts on the television screen. To raise the tension factor, the three ghost players can only see part of the maze around their characters. Pac-Man must clear all the pac-dots in each maze to progress to the next level. … Expand"}, {"name": "World Tour Soccer 2003", "details_link": "https://www.metacritic.com/game/playstation-2/world-tour-soccer-2003", "publisher": "SCEA", "release_date": "Feb 10 2003", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/6e2b7ceedaa9a4fc66016b9fa31117bd-98.jpg", "descriptions": "[Also known as \"This is Football 2002\"]  Features more than 300 teams from throughout the world including national teams from USA, England, Brazil, France and Japan."}, {"name": "Crash Bandicoot: The Huge Adventure", "details_link": "https://www.metacritic.com/game/game-boy-advance/crash-bandicoot-the-huge-adventure", "publisher": "Universal Interactive", "release_date": "Feb 25 2002", "developers": ["Vicarious Visions"], "platforms": "Game Boy Advance", "genres": ["Action", "Platformer", "2D"], "meta_score": 78, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/6bbbbd1031dcac5661ebe5713c749058-98.jpg", "descriptions": "Tired of endlessly doing battle with meddling bandicoots, the nefarious Dr. Neo Cortex shrinks the entire Earth, and Crash and Coco along with it, to the size of a wumpa fruit.  Luckily, Coco invents a machine to reverse the effects, but she needs crystals from around the world to power it.Tired of endlessly doing battle with meddling bandicoots, the nefarious Dr. Neo Cortex shrinks the entire Earth, and Crash and Coco along with it, to the size of a wumpa fruit.  Luckily, Coco invents a machine to reverse the effects, but she needs crystals from around the world to power it.  Crash must retrieve the crystals to help return the entire planet to its natural state.  Experience Crash's biggest adventure yet, with gameplay modes ranging from side-scrolling to 3D chase levels to aerial dogfight combat sequences.  Battle your way through over 20 huge levels and six unique locations to defeat Cortex and save the world.  … Expand"}, {"name": "Amped: Freestyle Snowboarding", "details_link": "https://www.metacritic.com/game/xbox/amped-freestyle-snowboarding", "publisher": "Microsoft Game Studios", "release_date": "Nov 19 2001", "developers": ["Indie Built"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 78, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/ae67d4ff3d33b8b0109b23102dcebc64-98.jpg", "descriptions": "Rip the ultimate line on wide-open, real mountains packed with challenges.  Whether you hit the cliffs, grind fallen trees, jib the rainbow tree rail, or take the hidden paths, you decide where and how you go down.  While you pull off insane tricks on rails, kickers, and half pipes, rememberRip the ultimate line on wide-open, real mountains packed with challenges.  Whether you hit the cliffs, grind fallen trees, jib the rainbow tree rail, or take the hidden paths, you decide where and how you go down.  While you pull off insane tricks on rails, kickers, and half pipes, remember to pose for roaming photographers and camera crews.  With enough exposure, you'll find your face on magazine covers and videos and even become an international media superstar.  … Expand"}, {"name": "Dave Mirra Freestyle BMX 2", "details_link": "https://www.metacritic.com/game/gamecube/dave-mirra-freestyle-bmx-2", "publisher": "Acclaim", "release_date": "Nov 17 2001", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 78, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/2/eda3f185982596c8f29a3f004063db6c-98.jpg", "descriptions": "If you're looking for some BMX action, you could certainly do worse, but Acclaim and Z-Axis could certainly do better."}, {"name": "Tony Hawk's Pro Skater 2x", "details_link": "https://www.metacritic.com/game/xbox/tony-hawks-pro-skater-2x", "publisher": "Activision", "release_date": "Nov 14 2001", "developers": ["Treyarch"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 78, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/49f8274606f36b573589253eab2429b8-98.jpg", "descriptions": "Tony Hawk's Pro Skater 2x was designed to take full advantage of the technical capabilities of Xbox. The game features the franchise's signature gameplay, intuitive controls, all of the levels from both Tony Hawk's Pro Skater 2 and the original Tony Hawk's Pro Skater, in addition to moreTony Hawk's Pro Skater 2x was designed to take full advantage of the technical capabilities of Xbox. The game features the franchise's signature gameplay, intuitive controls, all of the levels from both Tony Hawk's Pro Skater 2 and the original Tony Hawk's Pro Skater, in addition to more populated environments, brand new levels, realistic special effects and smoother lifelike animations. The inclusion of system link gameplay brings the skateboarding experience to life.… Expand"}, {"name": "NHL FaceOff 2001", "details_link": "https://www.metacritic.com/game/playstation/nhl-faceoff-2001", "publisher": "SCEA", "release_date": "Sep  5 2000", "developers": ["SolWorks"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Ice Hockey", "Sim"], "meta_score": 78, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/facd9f3c53601dac18a1e5f56e673db2-98.jpg", "descriptions": "If you own either of the past two renditions of NHL FaceOff, you really have no reason to pick up 2001."}, {"name": "Castlevania", "details_link": "https://www.metacritic.com/game/nintendo-64/castlevania", "publisher": "Konami", "release_date": "Dec 31 1998", "developers": ["KCEK"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 78, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/ce0883255f84b20344ec47633283ddb6-98.jpg", "descriptions": "Take control of Reinhardt Schneider, a whip-toting Vampire Killer who has waited his whole life to meet his destiny, or Carrie Fernandez, a young girl with a strong magical presence who is mysteriously drawn to Dracula's evil Castlevania. It is their duty to seek out Castlevania and put anTake control of Reinhardt Schneider, a whip-toting Vampire Killer who has waited his whole life to meet his destiny, or Carrie Fernandez, a young girl with a strong magical presence who is mysteriously drawn to Dracula's evil Castlevania. It is their duty to seek out Castlevania and put an end to its residents' plans. What is your destiny?… Expand"}, {"name": "Titan Quest", "details_link": "https://www.metacritic.com/game/pc/titan-quest", "publisher": "THQ", "release_date": "Jun 26 2006", "developers": ["Iron Lore Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/1a861946c880292ffbbb01dbd3e040b2-98.jpg", "descriptions": "From the co-creator of Age of Empires, Brian Sullivan, comes an all-new action role-playing game set in the mythical worlds of ancient Greece and Egypt. The Titans, gods before the gods, have escaped from their eternal prison to wreak havoc on the world. In this titanic struggle between oldFrom the co-creator of Age of Empires, Brian Sullivan, comes an all-new action role-playing game set in the mythical worlds of ancient Greece and Egypt. The Titans, gods before the gods, have escaped from their eternal prison to wreak havoc on the world. In this titanic struggle between old and new gods it is the heroes of humankind who will ultimately determine the fate of all existence. The player quests throughout the ancient world in a race to uncover the secrets needed to once again imprison these ancient gods. Journeying to fabled locations such as the Parthenon, the maze at Knossos, the Great Pyramids, and the Hanging Gardens of Babylon, the player will have to overcome terrifying monsters and mythical beasts. A flexible class system allows almost limitless ways for the player to develop their character. Skills can be customized in many ways, and never become obsolete. [THQ]… Expand"}, {"name": "Call of Duty 2: Big Red One", "details_link": "https://www.metacritic.com/game/playstation-2/call-of-duty-2-big-red-one", "publisher": "Activision", "release_date": "Nov  1 2005", "developers": ["Treyarch"], "platforms": "PlayStation 2", "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/f6928c37713dd61cd0fc78abf7522f78-98.jpg", "descriptions": "Experience a wide variety of missions on land, sea, and in the air, with the aid of over three dozen authentic American, Italian, French, and German weapons. Charge into battle together as Allied and Axis planes duel overhead, artillery explosions shake the ground and choke the air, andExperience a wide variety of missions on land, sea, and in the air, with the aid of over three dozen authentic American, Italian, French, and German weapons. Charge into battle together as Allied and Axis planes duel overhead, artillery explosions shake the ground and choke the air, and bullets and shrapnel streak past you and your squadmates. Experience war-torn Europe and Africa, from the blistering desert expanses of Tunisia and Libya to the beautiful yet deadly countrysides of Italy, France, Belgium, and Germany. You are thrust into the role and story of a member of The Big Red One, America’s most heroic and decorated infantry division. Experience the camaraderie of a single tight-knit army squad, bound together through the chaos of battle over the course of the entire game. Yes, you will suffer casualties; you must not suffer defeat. Through all-new AI and animation, your allies (and your enemies) just got a lot smarter. Your squad will now make better use of environmental cover and tactical Maneuvers, such as flanking, envelopment, and fire-and-maneuver behaviors. Hear your allies reacting to the events on the battlefield with contextually accurate battle chatter. [Activision]… Expand"}, {"name": "Tom Clancy's Ghost Recon: Shadow Wars", "details_link": "https://www.metacritic.com/game/3ds/tom-clancys-ghost-recon-shadow-wars", "publisher": "Ubisoft", "release_date": "Mar 22 2011", "developers": ["Ubisoft"], "platforms": "3DS", "genres": ["Action", "Strategy", "Shooter", "Turn-Based", "First-Person", "Modern", "General", "Modern", "Tactical", "Modern"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/12cc2d3436b3ceb3c94b965476af558a-98.jpg", "descriptions": "Lead the Ghosts, the most elite special forces unit in the US Army, across multiple tactical missions to prevent a war from breaking out."}, {"name": "Plants vs. Zombies: Battle for Neighborville", "details_link": "https://www.metacritic.com/game/playstation-4/plants-vs-zombies-battle-for-neighborville", "publisher": "Electronic Arts", "release_date": "Oct 18 2019", "developers": ["PopCap"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 77, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/bfc71b1c31a75f88e4d1516c9841d3c8-98.jpg", "descriptions": "Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet:Welcome to Neighborville, where all is well. Except that a crazy new coniferous conflict between brain-less and botanicals is brewing! What are you gonna do – call the crops? Soil your plants? It’s time to kick some grass in the wackiest shooter experience between plants and zombies yet: Plants vs. Zombies: Battle for Neighborville™.… Expand"}, {"name": "Deathtrap", "details_link": "https://www.metacritic.com/game/pc/deathtrap", "publisher": "NeocoreGames", "release_date": "Feb  4 2015", "developers": ["NeocoreGames"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Strategy", "General"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/61dc9ed3952f9643610c61ec2b97e1c1-98.jpg", "descriptions": "Deathrap is a unique mixture of action-RPGs and Tower Defense games, a game of vicious tricks, killing machines, rotating blades and splattering blood."}]