[{"name": "Spartan: Total Warrior", "details_link": "https://www.metacritic.com/game/xbox/spartan-total-warrior", "publisher": "Sega", "release_date": "Oct 25 2005", "developers": ["Creative Assembly"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 73, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/cf16d53cd39212ebc65aaffcb3757dd4-98.jpg", "descriptions": "You can battle hundreds of ancient warriors, both historical and mythical, in Spartan: Total Warrior. As \"The Spartan\" you can upgrade your weapons and armor and gain the favor of the gods as you fight through epic battles against units ranging from Roman soldiers to skeletonYou can battle hundreds of ancient warriors, both historical and mythical, in Spartan: Total Warrior. As \"The Spartan\" you can upgrade your weapons and armor and gain the favor of the gods as you fight through epic battles against units ranging from Roman soldiers to skeleton warriors. Levels feature a variety of objectives, such as escorting, capturing, destruction, discovery, and survival. … Expand"}, {"name": "Yu-Gi-Oh! Nightmare Troubadour", "details_link": "https://www.metacritic.com/game/ds/yu-gi-oh!-nightmare-troubadour", "publisher": "Konami", "release_date": "Aug 30 2005", "developers": ["Konami"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/a50f9a611d5df1c8e645a9b662f10e55-98.jpg", "descriptions": "Yu-Gi-Oh! Nightmare Troubadour brings a new round of dueling action to the Nintendo DS. Utilizing the unique features of the Nintendo DS, players experience the world of Yu-Gi-Oh! on two screens with touch pad controls. Watch monsters rise up from their cards and battle it out on the topYu-Gi-Oh! Nightmare Troubadour brings a new round of dueling action to the Nintendo DS. Utilizing the unique features of the Nintendo DS, players experience the world of Yu-Gi-Oh! on two screens with touch pad controls. Watch monsters rise up from their cards and battle it out on the top screen with amazing 3D graphics. Use the bottom screen strategically as it presents the card playing field in 2D and supports full touch screen control. Wireless duels and card trading. Uses the touch pad and two screens for exceptional control. 3D graphics bring the monsters to life as they arise from the cards. Over 1000 of the latest and greatest cards. [Konami]… Expand"}, {"name": "Beyond Divinity", "details_link": "https://www.metacritic.com/game/pc/beyond-divinity", "publisher": "Hip Games", "release_date": "Apr 28 2004", "developers": ["Larian Studios Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/045e13dbfee2eb39d6dc0a0d9434bcd8-98.jpg", "descriptions": "You are a servant of the Divine - scourge of necromancers and sorcerers alike. Your purpose in life is to fight all that is evil using any means possible. Your dilemma? during an intense battle with one of the great necromancers, a demon drags you into its universe. There you are soul-forgedYou are a servant of the Divine - scourge of necromancers and sorcerers alike. Your purpose in life is to fight all that is evil using any means possible. Your dilemma? during an intense battle with one of the great necromancers, a demon drags you into its universe. There you are soul-forged with a Death-knight. You are cursed and destined to spend the rest of eternity bonded to this creature of evil. Or maybe not... The Death-knight dislikes the soul forging as much as you do and together you embark on a great adventure. You both have a common goal - to undo the soul forging. You and your unlikely companion quickly figure out that the only way to rid this curse is if you unlock the secret of riftrunning ? an ancient art that allowed the prison universe?s indigenous population to travel between universes. Your quest is set: To become a Riftrunner! [Hip Games]… Expand"}, {"name": "Primal", "details_link": "https://www.metacritic.com/game/playstation-2/primal", "publisher": "SCEA", "release_date": "Mar 25 2003", "developers": ["SCEE"], "platforms": ["PlayStation 4", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/578e18a62058d410ccde013a8efe4879-98.jpg", "descriptions": "Switch between two playable characters at will. A unique pairing of characters: play as the modern-day heroine Jen as she acquires powerful demon form and abilities, or the watchful gargoyle Scree, who can possess statues and cling to walls. Work individually or as a team, applying eachSwitch between two playable characters at will. A unique pairing of characters: play as the modern-day heroine Jen as she acquires powerful demon form and abilities, or the watchful gargoyle Scree, who can possess statues and cling to walls. Work individually or as a team, applying each character's unique abilities to solve puzzles or overcome obstacles. Experienice worlds of exceptional size, beauty, and detail... with no load times thanks to fully dynamic streaming technology. [Sony]… Expand"}, {"name": "Godzilla: Destroy All Monsters Melee", "details_link": "https://www.metacritic.com/game/gamecube/godzilla-destroy-all-monsters-melee", "publisher": "Atari", "release_date": "Oct  8 2002", "developers": ["Pipeworks Software", "Inc."], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/b8a44e97dcb4c88188d3c23bde2cc527-98.jpg", "descriptions": "Legendary monsters battle among Earth's cities to determine the planet's fate. In Godzilla: Destroy All Monsters Melee, you can play as Godzilla or any of his longtime rivals as they fight hand-to-hand, at close range, and with special moves. Each massive beast has different physicalLegendary monsters battle among Earth's cities to determine the planet's fate. In Godzilla: Destroy All Monsters Melee, you can play as Godzilla or any of his longtime rivals as they fight hand-to-hand, at close range, and with special moves. Each massive beast has different physical attributes and special projectile weapons. You'll fight in cities such as Tokyo and San Francisco--all featuring real building destruction and physics. For multiplayer fighting mayhem, you can bring three of your friends into the battle.… Expand"}, {"name": "Star Wars: Racer Revenge", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-racer-revenge", "publisher": "LucasArts", "release_date": "Feb 11 2002", "developers": ["Rainbow Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Futuristic"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/d194b4d87cbbdd3253f192fbc1691c1f-98.jpg", "descriptions": "It has been eight years since the first spectacular Podracing showdown between Sebulba and the young Anakin Skywalker. Seeking payback for his humiliating loss, Sebulba has a new beefed-up Podracer and lust for revenge. But it's not going to be easy: Anakin has grown into a boldly skilledIt has been eight years since the first spectacular Podracing showdown between Sebulba and the young Anakin Skywalker. Seeking payback for his humiliating loss, Sebulba has a new beefed-up Podracer and lust for revenge. But it's not going to be easy: Anakin has grown into a boldly skilled Podracer pilot. Thus the stage is set for Star Wars® Racer Revenge, bringing newer, faster, and even more dangerous Podracing to the galaxy-taking you on a one-way ride to ultimate victory. Jockey for position with a tangle of Podracing opponents or leave the pack behind at intense, nerve-jangling, planet-scorching simulated speeds of up to 600 mph. Crash and bash competitors into oblivion as you take them out of the race for good. [LucasArts]… Expand"}, {"name": "Mat Hoffman's Pro BMX", "details_link": "https://www.metacritic.com/game/pc/mat-hoffmans-pro-bmx", "publisher": "Activision", "release_date": "Oct 23 2001", "developers": ["Gray Matter"], "platforms": "PC", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Individual", "Biking", "Biking"], "meta_score": 73, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/4ef327b723ff5f6dd1c75ea932e81d09-98.jpg", "descriptions": "Tony Hawk on a bike? Using an enhanced \"Tony Hawk's Pro Skater\" engine, Activision and Mat Hoffman give Dave Mirra a ride for his money for the best BMX title on the market."}, {"name": "The Sting!", "details_link": "https://www.metacritic.com/game/pc/the-sting!", "publisher": "JoWooD Entertainment AG", "release_date": "Jul  1 2001", "developers": ["neo Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "General", "General"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/3414bd5f94d8e16a36fecb86f5d8bbdd-98.jpg", "descriptions": "In this underworld, you will need to make your way up (or down) the criminal ladder to become the most respected burglar on the streets. To gain the honor you crave from the most notorious criminals in the underworld, you will need to pull off the crime of the century -- The Sting!  [JoWoodIn this underworld, you will need to make your way up (or down) the criminal ladder to become the most respected burglar on the streets. To gain the honor you crave from the most notorious criminals in the underworld, you will need to pull off the crime of the century -- The Sting!  [JoWood Productions]… Expand"}, {"name": "Disney's Donald Duck: Goin' Quackers", "details_link": "https://www.metacritic.com/game/playstation-2/disneys-donald-duck-goin-quackers", "publisher": "Ubisoft", "release_date": "Dec 13 2000", "developers": ["Disney Interactive"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/411b12a1e12eafede96a6dfb70423b67-98.jpg", "descriptions": "Donald runs amuck, gets hyper and goes berserk across 22 levels in this hilarious quest to rescue Daisy."}, {"name": "Supercross", "details_link": "https://www.metacritic.com/game/playstation/supercross", "publisher": "EA Sports", "release_date": "Nov 21 2000", "developers": ["Page 44 Studios"], "platforms": "PlayStation", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/b9fe8e1a6f64662ee6f3bc9efc68200a-98.jpg", "descriptions": "A mere $40 investment stands between you and one of the best arcade-style motorcycle racing games the PlayStation has to offer."}, {"name": "Motocross Mania", "details_link": "https://www.metacritic.com/game/pc/motocross-mania", "publisher": "On Deck Interactive", "release_date": "Nov 14 2000", "developers": ["Deibus Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross", "Motocross"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/e7f90570244691fe0c941c4f984dea2a-98.jpg", "descriptions": "If you're a fan of motocross, then Motocross Mania would make a great addition to your collection."}, {"name": "Ms. Pac-Man Maze Madness", "details_link": "https://www.metacritic.com/game/dreamcast/ms-pac-man-maze-madness", "publisher": "Namco", "release_date": "Nov 13 2000", "developers": ["Namco"], "platforms": "Dreamcast", "genres": ["Action", "General"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/6053573c66f6552aef6ba248893eb201-98.jpg", "descriptions": "Chomp your way through mystical worlds to rescue Professor Pac. Free the lost worlds of Pac-Land from the horrid witch Mesmeralda. Videogame's most famous and favorite heroine is back to save the day!"}, {"name": "NASCAR 2001", "details_link": "https://www.metacritic.com/game/playstation/nascar-2001", "publisher": "EA Sports", "release_date": "Sep 19 2000", "developers": ["Black Box"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Driving", "Racing", "Stock Car"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/ada4c1f0c35eeffecf688a66ef948655-98.jpg", "descriptions": "Despite the haphazard audio, NASCAR 2001 is definitely a game that's worth owning."}, {"name": "Ninja Gaiden: Master Collection", "details_link": "https://www.metacritic.com/game/playstation-4/ninja-gaiden-master-collection", "publisher": "Koei Tecmo Games", "release_date": "Jun 10 2021", "developers": ["Team Ninja"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/d7d5585201ef0e49fd1c61c242039a45-98.jpg", "descriptions": "Three extremely high speed and intense ninja action games are now available in one package. Enjoy 3 games from the NINJA GAIDEN series in this single collection.  The nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battles withThree extremely high speed and intense ninja action games are now available in one package. Enjoy 3 games from the NINJA GAIDEN series in this single collection.  The nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battles with fearsome opponents. In addition to Ryu Hayabusa, the 4 female characters Ayane, Rachel, Momiji, and Kasumi are also playable. Pair up favorite characters, and switch between characters during battles. The heroines included in this title are the same as the original versions. In addition, the characters that are playable and scenes (modes) vary for each title.\r Most of the previously released game modes and DLC costumes for each title are included in this thrilling collection. In addition to Ryu Hayabusa, each of the other characters also have many different costumes to choose from, allowing for action packed battles in outfits of your choice.\r Included Titles:\r * NINJA GAIDEN Sigma (NINJA GAIDEN )\r* NINJA GAIDEN Sigma 2 (NINJA GAIDEN 2)\r* NINJA GAIDEN 3: Razor's Edge\rClassic Costumes Included\r DLC costumes included… Expand"}, {"name": "Dokapon Kingdom", "details_link": "https://www.metacritic.com/game/wii/dokapon-kingdom", "publisher": "Atlus", "release_date": "Oct 14 2008", "developers": ["Sting"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 73, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/9/1e6e8f988e4f03b9344d4ff34da13166-98.jpg", "descriptions": "The King of Dokapon has offered you his throne; all he asks for in return is that you dispose of an invading horde of thieving monsters. Trouble is - you're not the only one he asked. Contend with up to three friends as you navigate playfields littered with challenges, monsters to defeat,The King of Dokapon has offered you his throne; all he asks for in return is that you dispose of an invading horde of thieving monsters. Trouble is - you're not the only one he asked. Contend with up to three friends as you navigate playfields littered with challenges, monsters to defeat, and rare secrets to unlock. Warning: Relationship counseling not included. Tired of shallow gameplay in party games? The genre gets retooled in this exuberant mix of role playing and board games! Encounter zany characters, collect rare items, and explore a fascinating kingdom on your quest to vanquish monsters, gather treasure, and level up! Turn the heat up on your rivalries! Take on up to three other soon-to-be-ex-friends in the race for Princess Penny and the crown. Battle, steal, deface – playing dirty is the name of the game – through a variety of locales and challenges. After your friendships are broken, the game is just as much fun to play alone. Tons of battles, magic spells, mini-games, and multiple play modes add up to endless replayability. Easy, intuitive, and effective combat system – This is no boring game of hack-and-slash. Players covertly choose their actions in an intuitive battle interface that guarantees every fight will surprise. [Atlus USA]… Expand"}, {"name": "SingStar Pop", "details_link": "https://www.metacritic.com/game/playstation-2/singstar-pop", "publisher": "SCEA", "release_date": "Apr  3 2007", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/5380607589469991d9e3b627b4cbbcbb-98.jpg", "descriptions": "(Currently available in the UK/EU only)  A brand new collection of songs awaits eager chart fans, with international megastars like Britney Spears, Scissor Sisters and Jlo contributing classic pop hits. Features hits from artists such as Rihanna (SOS), Fall out Boy (Dance, Dance) and Nelly(Currently available in the UK/EU only)  A brand new collection of songs awaits eager chart fans, with international megastars like Britney Spears, Scissor Sisters and Jlo contributing classic pop hits. Features hits from artists such as Rihanna (SOS), Fall out Boy (Dance, Dance) and Nelly Furtado (Promiscuous). [SCEE]… Expand"}, {"name": "Yono and the Celestial Elephants", "details_link": "https://www.metacritic.com/game/switch/yono-and-the-celestial-elephants", "publisher": "Plug In Digital", "release_date": "Oct 12 2017", "developers": ["Neckbolt"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/2eae6174681e3605af59fa2a7ab9c00a-98.jpg", "descriptions": "Elephants are a mighty protectors of the world, born from the stars once per millennium. This is the age of Elephant Yono. But Yono is still so very young and in a kingdom inhabited by feudal Humans, undead Bonewights and robotic Mekani, it's not easy to keep one's trunk out of trouble. YonoElephants are a mighty protectors of the world, born from the stars once per millennium. This is the age of Elephant Yono. But Yono is still so very young and in a kingdom inhabited by feudal Humans, undead Bonewights and robotic Mekani, it's not easy to keep one's trunk out of trouble. Yono and the Celestial Elephant is a grand adventure, featuring carefully designed puzzles, treasure hunts, a sprinkling combat and a world full of people. Play as a young elephant tasked to save a world he's never seen before, and explore the rich history of a kingdom where humans, zombies and robots live side by side. [Nintendo]… Expand"}, {"name": "Beautiful Katamari", "details_link": "https://www.metacritic.com/game/xbox-360/beautiful-katamari", "publisher": "Namco Bandai Games America", "release_date": "Oct 16 2007", "developers": ["Now Production"], "platforms": "Xbox 360", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/7b36741fdc29fa68ed3d97b456e48cc9-98.jpg", "descriptions": "Experience the new high-definition, next generation sights and sounds of Beautiful Katamari as the Prince takes on a new high-rolling adventure, with his famous cousins in tow, to save the Katamari universe once again after the King of All Cosmos has a very un-royal and unfortunate accident.Experience the new high-definition, next generation sights and sounds of Beautiful Katamari as the Prince takes on a new high-rolling adventure, with his famous cousins in tow, to save the Katamari universe once again after the King of All Cosmos has a very un-royal and unfortunate accident. As usual, the King of All Cosmos demands the service of his son, the Prince, to roll anything and everything up into massive clumps and set things right, bringing harmony once again to the Katamari Cosmos. To keep his son inspired, the King of All Cosmos will provide another fresh and memorable soundtrack that will have players moving and grooving to the beat as they roll through the absurd, yet wonderful world of Beautiful Katamari. One is a lonely number, but thankfully the Prince can humbly ask the aid of over 50 of his cousins to get the ball rolling through his quest. The cousins have discovered new games to play since last time out, and love to compete with friends in multiplayer Katamari rolling games either together or online over Xbox Live and the Playstation Network.  The Prince and his cousins' online adventure don't end there as a variety of downloadable content is available, continuing to expand on the amazing world of Beautiful Katamari, long after the game's launch. [Namco Bandai Games]… Expand"}, {"name": "Garden Story", "details_link": "https://www.metacritic.com/game/switch/garden-story", "publisher": "Rose City Games", "release_date": "Aug 11 2021", "developers": ["Picogram"], "platforms": ["PC", "Xbox One", "Switch"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/94da2078ee4cebd1d155f6c66e487a2c-98.jpg", "descriptions": "Unify a broken community as the newly-appointed Guardian of The Grove. Traverse a vibrant island to combat invasive Rot, inspire its inhabitants, and rebuild your home. You won't have to do this alone: fruity friends await, ready to lend a hand!\r Concord, the youngest grape in The Grove,Unify a broken community as the newly-appointed Guardian of The Grove. Traverse a vibrant island to combat invasive Rot, inspire its inhabitants, and rebuild your home. You won't have to do this alone: fruity friends await, ready to lend a hand!\r Concord, the youngest grape in The Grove, is now a Guardian, and it’s their job to help restore the island. That’s a lot to shoulder for a grape barely off the vine… and more than a few inhabitants are skeptical they have what it takes. Fortunately, Concord has friends like Elderberry, Rana, and Fuji on their side! With their help, you can take on the dangerous Rot and find ways to encourage other residents to assist in the efforts.\r The Grove is your home, and your work will affect change for the better! Protect your friends, gather precious materials, and repair social ties and structures by bringing the fruits, fungi, and frogs of each village together as they work to fend off the Rot that threatens to destroy your home for good. Guide Concord’s restoration efforts and earn the trust of the community: help others with their problems, and they’ll offer you help in turn!\r There’s plenty of work to be done, but don’t forget to take time and appreciate this lush world and the fruits of your labor. Listen to the sweet and catchy music of the island, relax in The Grove’s cozy and inviting atmosphere, cultivate gardens and libraries, and enjoy the delightful personalities you’ll meet along the way. … Expand"}, {"name": "No Straight Roads", "details_link": "https://www.metacritic.com/game/pc/no-straight-roads", "publisher": "Sold Out", "release_date": "Aug 25 2020", "developers": ["Metronomik"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music", "Action Adventure", "Open-World"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/b3ccf0f9ea31bc9f12ec90fb74909140-98.jpg", "descriptions": "Start a rock band & end the EDM empire in NO STRAIGHT ROADS, a rockin' action-adventure that mashes together rhythm-infused third-person combat with a kick-ass soundtrack."}, {"name": "NBA Live 08", "details_link": "https://www.metacritic.com/game/psp/nba-live-08", "publisher": "EA Sports", "release_date": "Oct  1 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/0a52023378293c75a4b0d2bc7ef260a0-98.jpg", "descriptions": "Taking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that let you dominate on the perimeter. Pass the ballTaking a page out of NBA Street Homecourt's book, NBA Live 08 introduces Quickstrike Ballhandling. This intuitive gameplay gives you the direct responsiveness you need to perform a full repertoire of ankle-breaking ball-handling moves that let you dominate on the perimeter. Pass the ball inside and win the battle in the post with all-new 'own the paint' post play for the big men down low. Use the new shot-countershot control to string together combos of fakes and shots to fool your defender into committing and create space for the game-defining bucket. NBA Live 08 introduces hot spots, where real NBA shot data is used to illuminate the locations on the floor where your players are most effective. Couple this with all-new signature go-to moves that capture the essence of the NBA's best, and you can now play the game on a console like you see it from the stands. [Electronic Arts]… Expand"}, {"name": "Broken Age: Act 2", "details_link": "https://www.metacritic.com/game/pc/broken-age-act-2", "publisher": "Double Fine Productions", "release_date": "Apr 28 2015", "developers": ["Double Fine Productions"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person", "Fantasy"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/66810914ec27ee782c9f5b506b70876c-98.jpg", "descriptions": "Broken Age is a point-and-click adventure telling the stories of a young boy and girl leading parallel lives. The girl has been chosen by her village to be sacrificed to a terrible monster--but she decides to fight back. Meanwhile, a boy on a spaceship is living a solitary life under theBroken Age is a point-and-click adventure telling the stories of a young boy and girl leading parallel lives. The girl has been chosen by her village to be sacrificed to a terrible monster--but she decides to fight back. Meanwhile, a boy on a spaceship is living a solitary life under the care of a motherly computer, but he wants to break free to lead adventures and do good in the world. Adventures ensue.… Expand"}, {"name": "Sunday Gold", "details_link": "https://www.metacritic.com/game/pc/sunday-gold", "publisher": "Team17", "release_date": "Oct 13 2022", "developers": ["Bkom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/27030cafa34e3c7e9651c055a4c98eef-98.jpg", "descriptions": "Once bustling and full of life, the city of London is in a dark and dismal state. Unemployment and homelessness are at an all-time high. Ethical boundaries are being stretched to their limit and corrupt billionaire, Kenny Hogan, is up to no good. It's up to ragtag band of criminals Frank,Once bustling and full of life, the city of London is in a dark and dismal state. Unemployment and homelessness are at an all-time high. Ethical boundaries are being stretched to their limit and corrupt billionaire, Kenny Hogan, is up to no good. It's up to ragtag band of criminals Frank, Sally, and Gavin, to put a wrench in Kenny Hogan's plans and bring him to his knees. But this is no simple job and there'll be a smattering of obstacles they'll have to face along the way...\r Sunday Gold is a point-and-click, turn-based adventure game set in grim, dystopian future. Play as a ragtag trio of criminals to hunt down and expose the dark secrets of an evil mega-corporation and the malevolent billionaire behind it.… Expand"}, {"name": "Call of Duty: WWII", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-wwii", "publisher": "Activision", "release_date": "Nov  2 2017", "developers": ["Sledgehammer Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 18 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/f2aa7e7e4814c662744227734a576c8f-98.jpg", "descriptions": "Call of Duty returns to its roots with Call of Duty: WWII - a breathtaking experience that redefines World War II for a new gaming generation. Land in Normandy on D-Day and battle across Europe through iconic locations in historys most monumental war. Experience classic Call of Duty combat,Call of Duty returns to its roots with Call of Duty: WWII - a breathtaking experience that redefines World War II for a new gaming generation. Land in Normandy on D-Day and battle across Europe through iconic locations in historys most monumental war. Experience classic Call of Duty combat, the bonds of camaraderie, and the unforgiving nature of war against a global power throwing the world into tyranny.… Expand"}, {"name": "Star Wars Battlefront", "details_link": "https://www.metacritic.com/game/playstation-4/star-wars-battlefront", "publisher": "Electronic Arts", "release_date": "Nov 17 2015", "developers": ["EA DICE"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 40 ", "genres": ["General", "General", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/7ecd426ab6b4c03beafaebc2331758c2-98.jpg", "descriptions": "Star Wars Battlefront lets players live out a broad array of heroic moments and intense battle fantasies of their own – firing blasters, riding speeder bikes and snow speeders, commanding AT-ATs and piloting TIE fighters and the Millennium Falcon. These battles will take place on the iconicStar Wars Battlefront lets players live out a broad array of heroic moments and intense battle fantasies of their own – firing blasters, riding speeder bikes and snow speeders, commanding AT-ATs and piloting TIE fighters and the Millennium Falcon. These battles will take place on the iconic planets of the Star Wars universe, including Endor, Hoth, Tatooine and the previously unexplored planet, Sullust. Gamers can play as the memorable characters from the original trilogy such as Darth Vader and Boba Fett. Star Wars Battlefront features a wide range of modes tailored for different types of battles, from larger 40-person competitive multiplayer to crafted missions that are played solo, with a partner via split-screen offline or co-operatively online. [EA/Lucasfilm] … Expand"}, {"name": "Mario Strikers: Battle League", "details_link": "https://www.metacritic.com/game/switch/mario-strikers-battle-league", "publisher": "Nintendo", "release_date": "Jun 10 2022", "developers": ["Next Level Games", "Nintendo"], "platforms": "Switch", "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Soccer", "Arcade"], "meta_score": 73, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/dd251587e24fa440469b9001941b7e84-98.jpg", "descriptions": "[Also known as \"Mario Strikers: Battle League Football\"] Tackle, pass, and score in battle soccer with the Mushroom Kingdom gang. Introducing Strike, a 5-on-5, soccer-like sport with no rules—do whatever it takes to win! Get gritty and try to score the most goals by tackling enemies, using[Also known as \"Mario Strikers: Battle League Football\"] Tackle, pass, and score in battle soccer with the Mushroom Kingdom gang. Introducing Strike, a 5-on-5, soccer-like sport with no rules—do whatever it takes to win! Get gritty and try to score the most goals by tackling enemies, using items, and pulling off score-boosting special shots. Super Mario series mainstays like Peach, Toad, and Yoshi put their cleats (and stats) to the pitch and will stop at nothing to score. Customize your characters with gear that can augment their stats and appearance. Take the carnage online* or pass the ball to players locally**—just look out for the electric fence.\r Join an online club to push and shove your way up the ranks\r Band together with up to 20 strikers online* and compete against other clubs for points. Find the right club for you, team up with friends, and bring your own striker style to the table. Strive to become the world’s top club each season!\r Pummel the pitch with up to 8 players\r 8 players can go for the goal on one Nintendo Switch system, with local wireless**, or online*. Bring along a secondary striker on the same system in online battles, too. Locally, 4 players on each team can go cleat-to-cleat in individual matches.\r… Expand"}, {"name": "Sludge Life", "details_link": "https://www.metacritic.com/game/switch/sludge-life", "publisher": "Devolver Digital", "release_date": "Jun  2 2021", "developers": ["Terri Vellmann & Doseone"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/ebd6d74e1fe506a9492f1c25ba1ed75f-98.jpg", "descriptions": "SLUDGE LIFE is a first-person / open-world / vandalism-centric stroll through a polluted island full of cranky idiots and a vibe so thick you can taste it.Roam a tiny island stuck on a sludge covered planet as an upcoming tagger GHOST set on staking their claim amongst the graffiti elite.SLUDGE LIFE is a first-person / open-world / vandalism-centric stroll through a polluted island full of cranky idiots and a vibe so thick you can taste it.Roam a tiny island stuck on a sludge covered planet as an upcoming tagger GHOST set on staking their claim amongst the graffiti elite. Traverse the corporately branded landscape, chat up other taggers, and discover secrets and idiots along the way.Will you become the king of the island and tag every open inch, infiltrate sludge-pumping corporation GLUG to find a way out, or just take it all down in flames with you?… Expand"}, {"name": "Marvel's Avengers", "details_link": "https://www.metacritic.com/game/playstation-5/marvels-avengers", "publisher": "Square Enix", "release_date": "Mar 18 2021", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action", "General"], "meta_score": 73, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/a78b65cc14d5a7395a4f860a8a7e6f67-98.jpg", "descriptions": "Marvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend theMarvel’s Avengers is an epic, third-person, action-adventure game that combines an original, cinematic story with single-player and co-operative gameplay. Assemble into a team of up to four players online, master extraordinary abilities, customize a growing roster of Heroes, and defend the Earth from escalating threats.… Expand"}, {"name": "Sludge Life", "details_link": "https://www.metacritic.com/game/pc/sludge-life", "publisher": "Devolver Digital", "release_date": "Apr  8 2020", "developers": ["Terri Vellimann", "Terri Vellmann & Doseone"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/30a7d6a5154318090997a123cbae8025-98.jpg", "descriptions": "SLUDGE LIFE is a first-person / open-world / vandalism-centric stroll through a polluted island full of cranky idiots and a vibe so thick you can taste it. Roam a tiny island stuck on a sludge covered planet as an upcoming tagger GHOST set on staking their claim amongst the graffiti elite.SLUDGE LIFE is a first-person / open-world / vandalism-centric stroll through a polluted island full of cranky idiots and a vibe so thick you can taste it. Roam a tiny island stuck on a sludge covered planet as an upcoming tagger GHOST set on staking their claim amongst the graffiti elite. Traverse the corporately branded landscape, chat up other taggers, and discover secrets and idiots along the way. Will you become the king of the island and tag every open inch, infiltrate sludge-pumping corporation GLUG to find a way out, or just take it all down in flames with you?… Expand"}, {"name": "World War Z", "details_link": "https://www.metacritic.com/game/xbox-one/world-war-z", "publisher": "Saber Interactive", "release_date": "Apr 16 2019", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "First-Person", "Third-Person", "Tactical"], "meta_score": 73, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/02cfeb89004625c11ba20d1215cce05e-98.jpg", "descriptions": "A co-op third-person shooter for up to 4 players featuring massive swarms of hundreds of zombies, focused on fast-paced, gruesomely spectacular action. Preorder to receive the infamous Lobo melee weapon with a trio of golden weapon skins to take down the zombie hordes in style."}, {"name": "Wizard of Legend", "details_link": "https://www.metacritic.com/game/playstation-4/wizard-of-legend", "publisher": "Contingent99", "release_date": "May 15 2018", "developers": ["Contingent99"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/63d251d0bd3d970896eafd995d72c323-98.jpg", "descriptions": "Wizard of Legend is a fast paced 2D dungeon crawler where you assume the role of a powerful wizard on his quest for fame and glory! Combine powerful spells and quick reflexes to become a Wizard of Legend!"}, {"name": "Dragon Ball Z: Attack of the Saiyans", "details_link": "https://www.metacritic.com/game/ds/dragon-ball-z-attack-of-the-saiyans", "publisher": "Namco Bandai Games", "release_date": "Nov 10 2009", "developers": ["Monolith Soft"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/e257d88f110625963026baf1704d3948-98.jpg", "descriptions": "The game follows the Saiyan Saga of the original DBZ story starting from the World Tournament and Goku's triumphant defeat of Piccolo. Players take the role of Goku and travel the DBZ universe from jungle to Snow Mountain on their quest to victory. Dragon Ball Z: Attack of the SaiyansThe game follows the Saiyan Saga of the original DBZ story starting from the World Tournament and Goku's triumphant defeat of Piccolo. Players take the role of Goku and travel the DBZ universe from jungle to Snow Mountain on their quest to victory. Dragon Ball Z: Attack of the Saiyans features a host of original features which will be sure to thrill fans, such as brand new gameplay, unique game modes, fun side quests and content never before seen in either the anime or manga series. [Namco Bandai Games]… Expand"}, {"name": "College Hoops 2K7", "details_link": "https://www.metacritic.com/game/xbox/college-hoops-2k7", "publisher": "2K Sports", "release_date": "Nov 20 2006", "developers": ["2K Sports"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/7/f80acad396b472d0eca3aaad078946d2-98.jpg", "descriptions": "With over 325 NCAA Division I schools, College Hoops 2K7 defines the college basketball experience. True College Atmosphere - The most immersive college game yet, College Hoops 2K7 puts the fans in the game and makes them a part of the team."}, {"name": "Need for Speed Carbon: Own the City", "details_link": "https://www.metacritic.com/game/psp/need-for-speed-carbon-own-the-city", "publisher": "EA Games", "release_date": "Oct 31 2006", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Simulation", "Arcade", "GT / Street", "GT / Street", "Automobile"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/aea36d5ddd3a5aa17772117cb732d336-98.jpg", "descriptions": "Need for Speed Carbon Own the City features all-new crew-based gameplay and an exclusive east coast open-world city to explore. The unique to handheld story thrusts you into an ongoing turf war. You are challenged to build an unstoppable crew, win races against fierce rivals, and outwit theNeed for Speed Carbon Own the City features all-new crew-based gameplay and an exclusive east coast open-world city to explore. The unique to handheld story thrusts you into an ongoing turf war. You are challenged to build an unstoppable crew, win races against fierce rivals, and outwit the cops. How you choose and manage your crew will be the difference between victory and defeat. Crew members improve with race experience and you’ll have to choose either to develop each crew member over the course of the game or swap them out when hot new recruits come available. Take control of the city and dominate the race scene in Need for Speed Carbon Own the City. [Electronic Arts]… Expand"}, {"name": "Armored Core: Nexus", "details_link": "https://www.metacritic.com/game/playstation-2/armored-core-nexus", "publisher": "Agetec Inc.", "release_date": "Sep 28 2004", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "4  Online", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/0/f0de067829bb9a26e446953ce67c4d00-98.jpg", "descriptions": "Time has long since passed since humans came out of the underground shelters. The Organization of Controlling Corporations (OCC), which was founded in order to begin reconstructing society, quickly loses its power as stability returns to the land. But the intention of the OCC is anything butTime has long since passed since humans came out of the underground shelters. The Organization of Controlling Corporations (OCC), which was founded in order to begin reconstructing society, quickly loses its power as stability returns to the land. But the intention of the OCC is anything but benign. Realizing the power that could be had in controlling the planetary resources, the OCC quickly launches into action a plan that will erupt in civil war and completely destabilize society for their own evil gain. AC unit customization, a core element of all the games in the series, has been addressed. Players now have access to over 400 different parts that can be used to construct literally millions of different AC designs. Weapons and parts have been completely redesigned from the previous titles and new part types have been added, thereby allowing longtime users to build completely new AC designs. Quite possibly the series? most popular feature, head-to-head multi-play is included with the title and enables up to four players to compete against one another using either i.LINK or for the first time ever LAN. [Agetec]… Expand"}, {"name": "Fe", "details_link": "https://www.metacritic.com/game/pc/fe", "publisher": "Electronic Arts", "release_date": "Feb 16 2018", "developers": ["Zoink!"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 73, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/0/3fabd50feb1f0341a7bc86f42727ca97-98.jpg", "descriptions": "In Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the SilentIn Fe, players are enchanted by the natural surroundings as they uncover secrets, complete side quests, and meet the mystical creatures of the forest. Players climb, glide and dig as they voyage through the open experience meeting, interacting and rescuing plants and animals from the Silent Ones, the machine antagonists that are threatening the forest. Through unparalleled freedom of exploration in a world full of discoveries to uncover, players become Fe and never want to leave. [Electronic Arts]… Expand"}, {"name": "Mega Man X Collection", "details_link": "https://www.metacritic.com/game/playstation-2/mega-man-x-collection", "publisher": "Capcom", "release_date": "Jan 10 2006", "developers": ["Capcom"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/0/2aaf11ecd8a5843237279fdec036a81f-98.jpg", "descriptions": "Join Mega Man X and Zero as they relive all six of their first Mega Man X adventures. Available for the first time in one incredible compilation, this collection also features the first US release of the Blue Bomber’s action-packed racing game: \"Mega Man Battle & Chase.\" Now, enjoy a totalJoin Mega Man X and Zero as they relive all six of their first Mega Man X adventures. Available for the first time in one incredible compilation, this collection also features the first US release of the Blue Bomber’s action-packed racing game: \"Mega Man Battle & Chase.\" Now, enjoy a total of seven Mega Man games with remixed soundtracks, original and sketch art, plus, so many other cool features. [Capcom]… Expand"}, {"name": "Drawn to Life", "details_link": "https://www.metacritic.com/game/ds/drawn-to-life", "publisher": "THQ", "release_date": "Sep 10 2007", "developers": ["5TH Cell"], "platforms": ["iPhone/iPad", "DS"], "num_players": "1 Player", "genres": ["Action Adventure", "Adventure", "General", "General", "Sandbox"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/fbf5dfb5ac855af3a3cfebe7b415b3f9-98.jpg", "descriptions": "Drawn to Life takes players to the next level of interaction and creativity on the Nintendo DS. Your exact drawings populate the game, and no tedious animating or image manipulation is necessary. In other words, your drawing comes to life. Rebuild a small village with your stylus, drawingDrawn to Life takes players to the next level of interaction and creativity on the Nintendo DS. Your exact drawings populate the game, and no tedious animating or image manipulation is necessary. In other words, your drawing comes to life. Rebuild a small village with your stylus, drawing the planets, animals, sun, moon, stars and much more. Watch as your creations interact in the streets with the town population. Jump, crawl, charge and battle your way through dark forests, windy meadows, busy cities and tropical islands. Drawn to Life provides a powerful, yet easy-to-use paint set, including a 25 color swatch palette, eraser, three brush sizes and flood fill. Not an artist? Tracing templates are available to guide users to create works of art. [5th Cell]… Expand"}, {"name": "Big Brain Academy: Brain vs. Brain", "details_link": "https://www.metacritic.com/game/switch/big-brain-academy-brain-vs-brain", "publisher": "Nintendo", "release_date": "Dec  3 2021", "developers": ["Nintendo"], "platforms": "Switch", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/782fb2638c69709a4a31a07e3538a283-98.jpg", "descriptions": "Battle to see who has the brawniest brain. Take on a series of brain-bending activities that test your mental mettle in Big Brain Academy™: Brain vs. Brain for the Nintendo Switch™ system! Play a wide variety of activities, like memorizing a series of numbers, identifying an animal as itBattle to see who has the brawniest brain. Take on a series of brain-bending activities that test your mental mettle in Big Brain Academy™: Brain vs. Brain for the Nintendo Switch™ system! Play a wide variety of activities, like memorizing a series of numbers, identifying an animal as it slowly comes into focus, or helping guide a train to its goal in fun, fast activities. Go brain-to-brain with friends and family in 4-player* matches to see who gets the highest score. Everyone can play together at varying difficulties, so a kid can hold their own against an adult in this battle of the brains!\r Treat your brain to some quick mental fun\r Get your own Big Brain Brawn score with a fun test. Boost your skill and speed by practicing certain activities. Of course, you can also prep for your next multiplayer brain battle or compare scores with friends and family. Unlock dozens of outfit options for your in-game avatar—from a cat outfit to a corn costume!\r Go brain vs. brain against mind-masters near and far\r Want to see how you match up to brainiacs around the world? Hop into Ghost Clash mode to compete against other users’ data**. Choose from mental marvels worldwide, folks on your friends list, or family members who have profiles on the same system. Outside of Ghost Clash mode, check your rankings to see how your Big Brain Brawn matches up against others.… Expand"}, {"name": "Stellaris: Apocalypse", "details_link": "https://www.metacritic.com/game/pc/stellaris-apocalypse", "publisher": "Paradox Interactive", "release_date": "Feb 22 2018", "developers": ["Paradox Development Studio"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "genres": ["Strategy", "Real-Time", "General"], "meta_score": 73, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/0c6819c1909750f38b826d3e53868346-98.jpg", "descriptions": "Stellaris: Apocalypse is a full expansion which redefines stellar warfare for all players with a host of new offensive and defensive options. Destroy entire worlds with terrifying new planet-killer weapons, fight against (or alongside) ruthless space pirates, and maybe discover a fewStellaris: Apocalypse is a full expansion which redefines stellar warfare for all players with a host of new offensive and defensive options. Destroy entire worlds with terrifying new planet-killer weapons, fight against (or alongside) ruthless space pirates, and maybe discover a few non-violent game features as well.… Expand"}, {"name": "Agents of Mayhem", "details_link": "https://www.metacritic.com/game/xbox-one/agents-of-mayhem", "publisher": "Deep Silver", "release_date": "Aug 15 2017", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/3201b3ac40681d09fe98751947672e76-98.jpg", "descriptions": "In the wake of a global assault, the world has fallen under the rule of LEGION, a supervillainous cabal of criminal masterminds and costumed megalomaniacs. The only people who are capable of turning the tide are the Agents of MAYHEM. Led by Persephone Brimstone, these uniquely skilled agentsIn the wake of a global assault, the world has fallen under the rule of LEGION, a supervillainous cabal of criminal masterminds and costumed megalomaniacs. The only people who are capable of turning the tide are the Agents of MAYHEM. Led by Persephone Brimstone, these uniquely skilled agents are going to take down this New World Disorder by any means necessary. Take the fight to LEGION in Seoul: The City of Tomorrow, an open world chock full of world-shaking missions, city-spanning doomsday devices, and evil underground lairs. Take your team of three Agents into the field and swap between them on the fly for maximum mayhem. Upgrade and customize your Agents to create your personal dream team of gadget-wielding anti-heroes. Upgrade the ARK–MAYHEM HQ–to unlock even more mayhem-making means. [Deep Silver]\r… Expand"}, {"name": "Scribblenauts Unlimited", "details_link": "https://www.metacritic.com/game/3ds/scribblenauts-unlimited", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 13 2012", "developers": ["5TH Cell"], "platforms": ["iPhone/iPad", "PC", "Wii U", "3DS"], "num_players": "1 Player", "genres": ["Puzzle", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/9fcb976429e13f5162847685fffef489-98.jpg", "descriptions": "Created and developed by 5TH Cell, Scribblenauts Unlimited features a huge side-scrolling open world with new, high-definition hand-drawn scenery and objects where players can help the game's hero, Maxwell, solve robust puzzles and challenges by summoning any object they can imagine. PlayersCreated and developed by 5TH Cell, Scribblenauts Unlimited features a huge side-scrolling open world with new, high-definition hand-drawn scenery and objects where players can help the game's hero, Maxwell, solve robust puzzles and challenges by summoning any object they can imagine. Players can leverage the Nintendo 3DS' Street Pass functionality to see all of the creative puzzle solutions by other players in the area. And for the first time, learn the backstory about Maxwell's parents, his twin sister Lily, and how he got his magical notepad.… Expand"}, {"name": "Real World Golf", "details_link": "https://www.metacritic.com/game/playstation-2/real-world-golf", "publisher": "Mad Catz", "release_date": "Apr 11 2006", "developers": ["Aqua Pacific", "In2Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 73, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/c5cb02deea80efc7458a352b0715347a-98.jpg", "descriptions": "Real World Golf is the first and only game on the PlayStation®2 computer entertainment system and Xbox that lets you actually swing a club to hit a golf ball. Immerse yourself in the world of virtual reality where all the realism and subtlety of real golf fully comes to life in your livingReal World Golf is the first and only game on the PlayStation®2 computer entertainment system and Xbox that lets you actually swing a club to hit a golf ball. Immerse yourself in the world of virtual reality where all the realism and subtlety of real golf fully comes to life in your living room. Adjust your swing to pitch, fade, draw, slice or spin the ball as Gametrak closely tracks your movement in real time and lets you play in the game! Improve your grip, stance and swing, and play across 10 stunning 18-hole golf courses and driving ranges. The game includes career mode, championship play, 4-player tournament challenges and more. [In2Games]… Expand"}, {"name": "Warp", "details_link": "https://www.metacritic.com/game/xbox-360/warp", "publisher": "Electronic Arts", "release_date": "Feb 15 2012", "developers": ["Trapdoor"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "General", "General"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/9/027b4d311ee07d2bf3b48e132dbde5f7-98.jpg", "descriptions": "Warp is a puzzle based stealth action game where gamers play as Zero, a lovable-yet-lethal, little orange alien with a big score to settle. Abducted by a villainous General from his home world and taken to an underwater research facility, Zero must plan his ultimate escape by relying on hisWarp is a puzzle based stealth action game where gamers play as Zero, a lovable-yet-lethal, little orange alien with a big score to settle. Abducted by a villainous General from his home world and taken to an underwater research facility, Zero must plan his ultimate escape by relying on his arsenal of special abilities. [Microsoft]… Expand"}, {"name": "Batman: The Telltale Series - Episode 2: Children of Arkham", "details_link": "https://www.metacritic.com/game/pc/batman-the-telltale-series---episode-2-children-of-arkham", "publisher": "Telltale Games", "release_date": "Sep 20 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/6b3f709bceb024dfc9f2b72c49b1a20c-98.jpg", "descriptions": "With Gotham City's first family mired in corruption, and an old friend now a dangerous adversary, the life of the Dark Knight is turned upside down. What was Thomas Wayne entangled in, and why was he killed? Determined to learn the truth about his father, Bruce sets out to question thoseWith Gotham City's first family mired in corruption, and an old friend now a dangerous adversary, the life of the Dark Knight is turned upside down. What was Thomas Wayne entangled in, and why was he killed? Determined to learn the truth about his father, Bruce sets out to question those involved in Gotham's criminal past. But which mask will he wear - The billionaire, or the bat? Huge decisions will forever change the Batman and the lives of those around him, as he meets the Children of Arkham.… Expand"}, {"name": "Call of Duty: Black Ops III", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-black-ops-iii", "publisher": "Activision", "release_date": "Nov  5 2015", "developers": ["Treyarch"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 73, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/3/dd8030789d3ea519996ffc952a729ae9-98.jpg", "descriptions": "In Black Ops 3, Treyarch introduces a new momentum-based chained-movement system which enables players to fluidly move through the environment with finesse, using controlled thrust jumps, slides, wall runs and mantling abilities in a myriad of combinations, all while continuously keepingIn Black Ops 3, Treyarch introduces a new momentum-based chained-movement system which enables players to fluidly move through the environment with finesse, using controlled thrust jumps, slides, wall runs and mantling abilities in a myriad of combinations, all while continuously keeping full control over their weapon. Maps are designed from the ground-up for the new movement system, enabling players to be successful with traditional movement, as well as with advanced tactics and maneuvers.… Expand"}, {"name": "Zone of the Enders HD Collection", "details_link": "https://www.metacritic.com/game/playstation-3/zone-of-the-enders-hd-collection", "publisher": "Konami", "release_date": "Oct 30 2012", "developers": ["High Voltage Software"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/e6dc87727ef01a757e17007b8326a519-98.jpg", "descriptions": "Zone of the Enders HD Collection bundles together both of the Zone of the Enders games and updates them with HD visuals."}, {"name": "The Sims 3", "details_link": "https://www.metacritic.com/game/ds/the-sims-3", "publisher": "Electronic Arts", "release_date": "Oct 26 2010", "developers": ["Exient Entertainment"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 73, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/0/c1a5b36eebb8a6b73fb195442963f74a-98.jpg", "descriptions": "With The Sims 3 for consoles and handheld, create Sims with unique personalities, fulfill their desires...or not, and control their lives within a living neighborhood. Customize your Sims’ appearance and choose up to five traits to create individual personalities. From the “Romantic” traitWith The Sims 3 for consoles and handheld, create Sims with unique personalities, fulfill their desires...or not, and control their lives within a living neighborhood. Customize your Sims’ appearance and choose up to five traits to create individual personalities. From the “Romantic” trait or “kleptomaniac” trait to “evil” trait, create millions of unique Sims. All-new features make it easier than ever to mess with life as you unlock the ultimate “Karma Powers” for instant control and unleash them on your Sims. New goal-oriented game play enables you to choose which short or long-term objectives you want your Sims to pursue and even determine your Sims’ destinies in life.  Get inspired by the endless creative possibilities and unexpected moments of surprise and mischief in The Sims 3. [Electronic Arts]… Expand"}, {"name": "Sniper Ghost Warrior Contracts 2", "details_link": "https://www.metacritic.com/game/pc/sniper-ghost-warrior-contracts-2", "publisher": "CI Games", "release_date": "Jun  4 2021", "developers": ["CI Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/9d7bda703725a4103007df6a6a6a78e9-98.jpg", "descriptions": "Sniper Ghost Warrior players have never taken down targets from such extreme distances before. Sniper Ghost Warrior Contracts 2 introduces fans to a dramatic single-player campaign where the stakes are at their highest, deep inside enemy territory. Players take on the role of Reaper,Sniper Ghost Warrior players have never taken down targets from such extreme distances before. Sniper Ghost Warrior Contracts 2 introduces fans to a dramatic single-player campaign where the stakes are at their highest, deep inside enemy territory. Players take on the role of Reaper, contract sniper assassin, operating in the heart of a lawless region of the Middle East along the Lebanese and Syrian borders. Tasked with a seemingly impossible mission - to topple an insidious criminal syndicate and bring them to justice. For the first time, Sniper Ghost Warrior Contracts 2 delivers precision long-range shooting campaign with targets over 1,000 meters away. Developed by the same studio behind the highly celebrated original Contracts, Sniper Ghost Warrior Contracts 2 pushes boundaries with the most realistic and challenging experience that the studio has ever created.\r… Expand"}, {"name": "War of the Roses", "details_link": "https://www.metacritic.com/game/pc/war-of-the-roses", "publisher": "Paradox Interactive", "release_date": "Oct  2 2012", "developers": ["Fatshark AB", "Fatshark"], "platforms": "PC", "genres": ["Action", "General", "General"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/924f1be1b595daad27790a27c1a56538-98.jpg", "descriptions": "War of the Roses is a new IP that transports players back in time to the battle-ravaged, dynastic civil war era of 15th century England where ownership of the throne of England was brutally fought over between supporters of two rival branches of the Royal House of Plantagenet - the house ofWar of the Roses is a new IP that transports players back in time to the battle-ravaged, dynastic civil war era of 15th century England where ownership of the throne of England was brutally fought over between supporters of two rival branches of the Royal House of Plantagenet - the house of Lancaster (the reds) and the house of York (the whites). A team-based multiplayer melee combat experience, War of The Roses sees players and their band of knights going toe-to-toe with their opponents using authentic and visceral weapons of the time period including broad swords, long bows and battle-axes. Built on a stunning graphics engine which vividly portrays the fighting from an up-close-and-personal third-person perspective, War of the Roses features both online multiplayer and a single-player campaign. Players will get the chance to lead their warrior through a rich progression system, gaining upgrades and unlocking new content on their path from filthy peasant to unstoppable armored killing machine.… Expand"}, {"name": "Disciples: Liberation", "details_link": "https://www.metacritic.com/game/pc/disciples-liberation", "publisher": "Kalypso", "release_date": "Oct 21 2021", "developers": ["Frima Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 73, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/7/47d7dfb7d594792ecfff44cbc8f58768-98.jpg", "descriptions": "Disciples: Liberation is a mature, dark fantasy strategy RPG with turn-based combat. Liberate the land of Nevendaar and uncover the endless stories hidden within this richly detailed world where every decision has a consequence, and every wrong move could be deadly."}, {"name": "Gravity Crash", "details_link": "https://www.metacritic.com/game/playstation-3/gravity-crash", "publisher": "SCEA", "release_date": "Nov 24 2009", "developers": ["Just Add Water"], "platforms": "PlayStation 3", "genres": ["Action", "General", "Shooter", "Scrolling", "Shoot-'Em-Up", "Top-Down"], "meta_score": 73, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/a997d8acc5780ff81f0b3dbf0db15635-98.jpg", "descriptions": "[Playstation Network]  Gravity Crash combines vintage arcade shoot 'em up gameplay with next generation visuals, to turn the heads of both core and new players alike. Your mission is to navigate space, twisting tunnels, underwater caverns and other hazardous environments to fulfil a range of[Playstation Network]  Gravity Crash combines vintage arcade shoot 'em up gameplay with next generation visuals, to turn the heads of both core and new players alike. Your mission is to navigate space, twisting tunnels, underwater caverns and other hazardous environments to fulfil a range of objectives. From destroying gun emplacements to saving crewmen, Gravity Crash brings back twitch-based gameplay where a steady hand is just as important as a keen aim. With 30 planets to explore, each with varying challenges and goals, and glossed with psychedelic wireframe visuals using advanced special effects such as heat haze, refraction, blurs and more, Gravity Crash aims to fire it home that there's no school like the old school... with a brand new look. [SCEA]… Expand"}, {"name": "PAIN: Amusement Park", "details_link": "https://www.metacritic.com/game/playstation-3/pain-amusement-park", "publisher": "SCEA", "release_date": "Sep 11 2008", "developers": ["Idol Minds"], "platforms": "PlayStation 3", "num_players": "1-4 ", "genres": ["Action", "General", "General"], "meta_score": 73, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/edc417cbd5bc47de9c49ce8fbad0beb3-98.jpg", "descriptions": "[Playstation Network]  Whereas Sony's original PlayStation 3 downloadable game Pain let players launch unfortunate people from a giant slingshot through a bustling (and breakable) downtown metropolis, the new $5.99 Amusement Park add-on offers a change of scenery, new game modes, and plenty[Playstation Network]  Whereas Sony's original PlayStation 3 downloadable game Pain let players launch unfortunate people from a giant slingshot through a bustling (and breakable) downtown metropolis, the new $5.99 Amusement Park add-on offers a change of scenery, new game modes, and plenty more interactive objects to make the head-on collisions that much more entertaining. There are also three new downloadable characters to place in the slingshot, each one available for $0.99.… Expand"}, {"name": "Dragon Ball Z: Budokai Tenkaichi 2", "details_link": "https://www.metacritic.com/game/playstation-2/dragon-ball-z-budokai-tenkaichi-2", "publisher": "Atari", "release_date": "Nov  7 2006", "developers": ["Spike"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/d26c21b57bc1813771a0cad959e1b875-98.jpg", "descriptions": "Combining action, fighting and light role-playing game elements, Dragon Ball Z: Budokai Tenkaichi 2 sends players into a rich story mode that spans the entire Dragon Ball, DBZ, and Dragon Ball GT series. The game takes the acrobatic and intense 3D flying and fighting dynamic made popular inCombining action, fighting and light role-playing game elements, Dragon Ball Z: Budokai Tenkaichi 2 sends players into a rich story mode that spans the entire Dragon Ball, DBZ, and Dragon Ball GT series. The game takes the acrobatic and intense 3D flying and fighting dynamic made popular in the first game and takes it to a new level with over 100 playable characters, 15 vast and vibrant 3D destructible environments, and nine different game modes, including intense single and multiplayer battles. Team up with Z-Warriors to complete exciting missions, ripped right from the TV show (the player can play with two warriors while in battle, and can switch warriors during the battle). Over 100 DBZ warriors, including many that have never been seen in previous DBZ games. Improved camera system, explosive environmental damage, and in-game transformations. The complete DBZ mythology, from Dragon Ball To Dragon Ball GT. Post customizable character codes to the Internet. [Atari]… Expand"}, {"name": "Anarchy Reigns", "details_link": "https://www.metacritic.com/game/xbox-360/anarchy-reigns", "publisher": "Sega", "release_date": "Jan  8 2013", "developers": ["PlatinumGames"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/8f7bc5a23e1e51add6ad69197f92fd69-98.jpg", "descriptions": "Anarchy Reigns promises over-the-top close combat, set in a massively open world in a stark, mutant-riddled future. Observe iconic characters from the PlatinumGames stable fighting it out in a series of colorful arenas. Up to sixteen players can engage in multiplayer matches over a varietyAnarchy Reigns promises over-the-top close combat, set in a massively open world in a stark, mutant-riddled future. Observe iconic characters from the PlatinumGames stable fighting it out in a series of colorful arenas. Up to sixteen players can engage in multiplayer matches over a variety of game modes; engage in all-out Battle Royale destruction, co-operate with your friends and vanquish hordes of monsters in Survival mode or test your sportsmanship over a few rounds of Deathball.… Expand"}, {"name": "Red Faction: Guerrilla Re-Mars-tered", "details_link": "https://www.metacritic.com/game/xbox-one/red-faction-guerrilla-re-mars-tered", "publisher": "THQ Nordic", "release_date": "Jul  3 2018", "developers": ["Volition Inc."], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/9/abaec91f63dd35401226b4dfc65c1093-98.jpg", "descriptions": "Set 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: GuerrillaSet 50 years after the climactic events of the original Red Faction, Red Faction: Guerrilla allows players to take the role of an insurgent fighter with the newly re-established Red Faction movement as they battle for liberation from the oppressive Earth Defense Force. Red Faction: Guerrilla still defines the limits of destruction-based game-play with a huge open-world, fast-paced guerrilla-style combat, and true physics-based destruction.Features:* Open World Guerrilla Warfare - You decide who, when, where and how to battle. Utilize guerrilla tactics, improvised weaponry, and modified vehicles to lead insurgent attacks on EDF targets. Launch attacks based on your own gameplay style, take on missions in any order you choose, or engage in destructive activities to weaken the EDF's grip on Mars.* Strategic Destruction - Use destruction to your tactical advantage, setting ambushes or chain reaction explosions to attack enemy strongholds and permanently modify the game environment. Leverage fully-dynamic physics-based destruction to improvise on the fly: blow holes in a wall or floor to set an ambush or escape, take out a staircase to stop your pursuers, or drive vehicles through blown out walls.* Evolving & Emergent Gameplay - Carve your path through an ever-changing landscape as you improvise your combat tactics - mixing gameplay styles, vehicles, weapons and explosives to defeat the EDF.* Epic Sci-Fi Setting - Explore the huge, unforgiving Martian landscape, from the desolate mining outpost of Parker to the gleaming EDF capital city of Eos; then tear through the fully destructible open-world environments swarming with EDF forces, Red Faction resistance fighters, and the downtrodden settlers caught in the cross-fire.* Multiplayer Combat - There is no place to hide when you put your guerrilla warfare skills to the test in a variety of highly destructive multiplayer combat modes.Re-Mars-tered Features:> Fully reworked graphics Heavily reworked textures and graphic features adding for example specular maps.> Improved shadow rendering> Improved Lighting> Shader & Postprocessing rework> Native 4k support for the finest up to date mars destruction experience ever… Expand"}, {"name": "Warlords Battlecry III", "details_link": "https://www.metacritic.com/game/pc/warlords-battlecry-iii", "publisher": "Enlight Software", "release_date": "May 19 2004", "developers": ["Infinite Interactive"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 73, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/0f630eff838a1ab8a915e25ba4e04d95-98.jpg", "descriptions": "It was only a matter of time before the Selentine Merchants ventured too far from their trade routes, over the South Seas, searching for rich lands that might lay beyond. But they were unprepared for the terrors they would awaken, and the devastation they would unleash upon the world ofIt was only a matter of time before the Selentine Merchants ventured too far from their trade routes, over the South Seas, searching for rich lands that might lay beyond. But they were unprepared for the terrors they would awaken, and the devastation they would unleash upon the world of Etheria. At first, the southern continent seemed a peaceful, idyllic place - warm and tropical. But that would soon change. Although rich in gold and silver, the Selentines soon met the inhabitants of this new land - snake-like creatures who called themselves Ssrathi and their land¡K Keshan. They were names that would come to be feared in later years. The Selentines slew these first Ssrathi and took their gold, thinking them simple and primitive. But Nature too is simple and primitive, and it wields the most destructive powers and so it was with the Ssrathi. Their empire was large, their knowledge of magic extensive, and their Shaman-King, Iriki, was a creature whom even the Gods rightly feared. The war that followed would change the face of Etheria forever. Join with the many races of Etheria as you fight your way through the ruins, jungles and deserts of the southern continent of Keshan, searching for new lands to conquer, and the treasure with which you might build an Empire. Or take the role of the Ssrathi the snakemen of Keshan as they repel the invaders and then unleash the full might of their empire upon the northern realms! [Enlight Software]… Expand"}, {"name": "Tribes Aerial Assault", "details_link": "https://www.metacritic.com/game/playstation-2/tribes-aerial-assault", "publisher": "Sierra Entertainment", "release_date": "Sep 23 2002", "developers": ["Midway Studios - Austin"], "platforms": "PlayStation 2", "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 73, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/3/30ad198c2c30d50bf1d0b5374648f2a4-98.jpg", "descriptions": "Run, jump, and fly across massive, boundless battlefields in jetpack-equipped armors as you compete with, and against, up to 16 players from around the world. A true team game, you choose between different roles and different game types, including 11-mission single-player campaign and theRun, jump, and fly across massive, boundless battlefields in jetpack-equipped armors as you compete with, and against, up to 16 players from around the world. A true team game, you choose between different roles and different game types, including 11-mission single-player campaign and the all-time-favorite, online Capture the Flag via the network adaptor. [Sierra]… Expand"}, {"name": "Mini Ninjas", "details_link": "https://www.metacritic.com/game/xbox-360/mini-ninjas", "publisher": "Eidos Interactive", "release_date": "Sep  8 2009", "developers": ["Io Interactive"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/5f32257ef943ebf90affe4fa6fd89a4f-98.jpg", "descriptions": "Prepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magicalPrepare yourself for a Ninja adventure like you have never seen before! Join Hiro, the smallest hero on the biggest adventure, as he embarks on an epic and electrifying quest to restore harmony to a world on the brink of chaos. Use your skills and mighty Ninja training to battle a magical army of evil Samurai. Harness the power of your Kuji magic and utilise the special skills of your Mini Ninja friends as you travel through a perilous world to reach the final confrontation with the Evil Samurai Warlord in his Fortress of Doom.… Expand"}, {"name": "DreamWorks Madagascar", "details_link": "https://www.metacritic.com/game/pc/dreamworks-madagascar", "publisher": "Activision", "release_date": "May 24 2005", "developers": ["Beenox"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 73, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/0f073d1366df188798fd7b72fcc0f415-98.jpg", "descriptions": "Based on the animated feature film from DreamWorks, Madagascar is the only game that lets players enter the world of four hilarious Central Park Zoo animals - a personality-packed crew made up of a lion, zebra, giraffe and hippo. Players must master each animal's natural skills whileBased on the animated feature film from DreamWorks, Madagascar is the only game that lets players enter the world of four hilarious Central Park Zoo animals - a personality-packed crew made up of a lion, zebra, giraffe and hippo. Players must master each animal's natural skills while adventuring through the exciting city of New York and the dangerous island of Madagascar, interacting with other animals and tackling obstacles and enemies in scenarios from the movie and beyond. [Activision]… Expand"}, {"name": "Sakura Wars", "details_link": "https://www.metacritic.com/game/playstation-4/sakura-wars", "publisher": "Sega", "release_date": "Apr 28 2020", "developers": ["Sega"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics", "Action", "Beat-'Em-Up", "3D"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/03664ab94965d3c38a497ccc13ced59e-98.jpg", "descriptions": "Improve the Revue Flower Division team's fortune to avoid being shut down in Sakura Wars for PlayStation 4. Set in a 1940s steampunk Tokyo, this single-player game features a dynamic LIPS dialogue system so you can build relationships through what you say and the way you say it. Lead yourImprove the Revue Flower Division team's fortune to avoid being shut down in Sakura Wars for PlayStation 4. Set in a 1940s steampunk Tokyo, this single-player game features a dynamic LIPS dialogue system so you can build relationships through what you say and the way you say it. Lead your motivated team members to victory on the battlefield for a thrilling Sakura Wars experience.… Expand"}, {"name": "Dandara", "details_link": "https://www.metacritic.com/game/switch/dandara", "publisher": "Raw Fury", "release_date": "Feb  6 2018", "developers": ["Raw Fury", "Long Hat House"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "2D", ""], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/992bf28b0d7c318714c5fb80db233ac6-98.jpg", "descriptions": "In a bizarre universe in which the oppressed are on the verge of oblivion, Dandara has awoken to reshape the world. The world of Salt hangs on the brink of collapse. The citizens, once free spirits, now stand oppressed and isolated. But not all is lost, for out of this aether of fear arisesIn a bizarre universe in which the oppressed are on the verge of oblivion, Dandara has awoken to reshape the world. The world of Salt hangs on the brink of collapse. The citizens, once free spirits, now stand oppressed and isolated. But not all is lost, for out of this aether of fear arises a heroine, a ray of hope. Her name is Dandara.… Expand"}, {"name": "X3: Terran Conflict", "details_link": "https://www.metacritic.com/game/pc/x3-terran-conflict", "publisher": "Atari", "release_date": "Oct 16 2008", "developers": ["Egosoft"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 73, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/30bed0827db8a188a4d8e65f7a6f69ad-98.jpg", "descriptions": "It is the culmination of the X trilogy, with a grand finale that takes us all the way back to Earth's own solar system. Gamers can take on the roles of different characters in the X universe, or of a Terran military pilot, and experience a multitude of stories in the largest X universe everIt is the culmination of the X trilogy, with a grand finale that takes us all the way back to Earth's own solar system. Gamers can take on the roles of different characters in the X universe, or of a Terran military pilot, and experience a multitude of stories in the largest X universe ever featured – for X3: Terran Conflict will offer more missions than any other X game before. Meanwhile, X3: Terran Conflict will pose questions such as: How has Earth changed in all these years? And how will relations between Earth and its counterparts in the X universe develop? [Deep Silver]… Expand"}, {"name": "Contact", "details_link": "https://www.metacritic.com/game/ds/contact", "publisher": "Atlus", "release_date": "Oct 19 2006", "developers": ["Grasshopper Manufacture"], "platforms": "DS", "num_players": "8  Online", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/a544045ef82c1e835b6090151ba2b23b-98.jpg", "descriptions": "The klaxon alarm is shrieking! Something is wrong! The Professor wrestles his damaged spaceship to a crash landing on a mysterious planet. In the aftermath of the crash, The Professor discovers that the power sources of his ship, known as Cells, have been scattered across the surface of thisThe klaxon alarm is shrieking! Something is wrong! The Professor wrestles his damaged spaceship to a crash landing on a mysterious planet. In the aftermath of the crash, The Professor discovers that the power sources of his ship, known as Cells, have been scattered across the surface of this strange world. To retrieve them all, The Professor enlists the aid of a brave young man named Terry — and a brave video game player known as you! The Professor and Terry will ask for your help during the course of the adventure, using the Nintendo DS to \"contact\" you along the way. Will The Professor gather the Cells and return to outer space? Will you learn the goal of the mysterious organization that seeks to gather the Cells for itself? The future of an entire world has been placed in your hands. [Atlus]… Expand"}, {"name": "Evil West", "details_link": "https://www.metacritic.com/game/playstation-5/evil-west", "publisher": "Focus Home Interactive", "release_date": "Nov 22 2022", "developers": ["Flying Wild Hog"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "2 ", "genres": ["General", "Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/1200f4eb1b865c3cfb32448c25cc2cab-98.jpg", "descriptions": "A dark menace consumes the Old West. In solo or coop, fight with style in visceral, explosive combat against bloodthirsty monstrosities. Eradicate the vampiric hordes with your lightning-fueled gauntlet and become a Wild West Superhero."}, {"name": "Digimon Story Cyber Sleuth: Hacker's Memory", "details_link": "https://www.metacritic.com/game/playstation-4/digimon-story-cyber-sleuth-hackers-memory", "publisher": "Bandai Namco Games", "release_date": "Jan 19 2018", "developers": ["Media.Vision"], "platforms": ["PlayStation Vita", "PlayStation 4"], "num_players": "2 ", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/6cbd21a56891ac7dd10aff1528a35946-98.jpg", "descriptions": "Hack your way to the truth! After being accused of a crime he didn't commit, Keisuke Amazawa has no choice but to dive into the digital world and investigate to prove his innocence. Even if that means joining a group of hackers and help them to solve the troubles threatening this mysteriousHack your way to the truth! After being accused of a crime he didn't commit, Keisuke Amazawa has no choice but to dive into the digital world and investigate to prove his innocence. Even if that means joining a group of hackers and help them to solve the troubles threatening this mysterious universe. Between real and digital, here lies the truth!FEATURES:* Cyber Punk Atmosphere: Dive into a deeper and darker adventure, at crossroads between real and digital.* Deep and Addictive Gameplay: Experience the perfect mix between adventure, raining and battle with over 320 Digimon to discover. Enjoy a wider range of battle strategies in a classic turn based gameplay enhanced by Digimon's skills, compatibilities and combos.* The Untold Story: Discover the mysterious backstory to the events that happened in 'Digimon Story: Cyber Sleuth'.… Expand"}, {"name": "Tony Hawk's Proving Ground", "details_link": "https://www.metacritic.com/game/playstation-3/tony-hawks-proving-ground", "publisher": "Activision", "release_date": "Oct 15 2007", "developers": ["Neversoft Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/5a55f4997bd0ce53e3114f122592e76a-98.jpg", "descriptions": "For the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground featuresFor the first time, players will have the freedom to define their character, story and style based on the choices they make, the paths they choose and the style of skating they use on the proving grounds from Philadelphia and Baltimore to Washington, D.C. Tony Hawk's Proving Ground features deeper customization than ever before, including a Video Editor with full-featured editing tools and visual effects for creating \"epic skate videos,\" and a fully customizable online Skate Lounge where players can skate with friends in the ultimate pad. In addition, players have the freedom to skate from single player to online seamlessly, as well as utilize new gameplay mechanics such as skateable terrain altering and building, and Bowl Carving. Tony Hawk’s Proving Ground also features even more Nail the Trick moves such as Nail the Grab and Nail the Manual intensifying the thrill of pulling off big tricks. [Activision]… Expand"}, {"name": "Tom Clancy's Rainbow Six Siege", "details_link": "https://www.metacritic.com/game/playstation-4/tom-clancys-rainbow-six-siege", "publisher": "Ubisoft", "release_date": "Dec  1 2015", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/a554c8f807edc1c2099aefbf4014c11f-98.jpg", "descriptions": "Tom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators andTom Clancy’s Rainbow Six Siege is inspired by real world counter-terrorist organizations, and inserts players in the middle of lethal close-quarters engagements. For the first time in a Tom Clancy’s Rainbow Six game, players can choose from a variety of unique Counter Terrorist Operators and engage in tangible sieges, a new style of assault in which enemies have the means to transform their environments into modern strongholds while Rainbow Six teams lead the assault to breach the enemy’s position.… Expand"}, {"name": "Clash: Artifacts of Chaos", "details_link": "https://www.metacritic.com/game/pc/clash-artifacts-of-chaos", "publisher": "Nacon", "release_date": "Mar  9 2023", "developers": ["ACE Team"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/3/7bd9323427fddb30de2418dae3884b9b-98.jpg", "descriptions": "You play as Pseudo, a master of martial arts who lives as a recluse in the strange land of Zenozoik. When you cross paths with the Boy, a small creature whose mysterious powers have attracted the attention of Gemini, the Mistress of the Artifacts, you decide to protect him, unaware that muchYou play as Pseudo, a master of martial arts who lives as a recluse in the strange land of Zenozoik. When you cross paths with the Boy, a small creature whose mysterious powers have attracted the attention of Gemini, the Mistress of the Artifacts, you decide to protect him, unaware that much greater forces are involved.… Expand"}, {"name": "Ten Dates", "details_link": "https://www.metacritic.com/game/pc/ten-dates", "publisher": "Wales Interactive", "release_date": "Feb 14 2023", "developers": ["Wales Interactive"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Visual Novel"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/68a240065dddf1f36036186b9a2a63d3-98.jpg", "descriptions": "Ten Dates is the sequel to the interactive rom-com, Five Dates, taking place in the post-pandemic world. Misha, a millennial from London in search of that elusive in-person connection, tricks her best friend Ryan into going to a speed dating event with her. Each with their own fiveTen Dates is the sequel to the interactive rom-com, Five Dates, taking place in the post-pandemic world. Misha, a millennial from London in search of that elusive in-person connection, tricks her best friend Ryan into going to a speed dating event with her. Each with their own five potential matches, Misha and Ryan must pluck up the courage and turn on the charm to date wildly different personalities.Throughout the game, your choices and interactions will either strengthen or weaken your relationship with your date. Amidst a branching, multi-directional chain of conversation topics and deep-dive questions, Misha and Ryan are faced with ice-breaker games, awkward scenarios and unexpected truths. Will either find love?… Expand"}, {"name": "GigaBash", "details_link": "https://www.metacritic.com/game/playstation-5/gigabash", "publisher": "Passion Republic", "release_date": "Aug  5 2022", "developers": ["Passion Republic"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "Up to 4 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 73, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/3d7bc10d1f898e54110edc621dfc40cb-98.jpg", "descriptions": "After centuries spent slumbering in the bowels of the earth, the primordial beasts known as Titans have awoken. Now they must battle humanity - and one another - for total world dominance.GigaBash combines the chaos and creativity of titles like Power Stone, Super Smash Bros Ultimate andAfter centuries spent slumbering in the bowels of the earth, the primordial beasts known as Titans have awoken. Now they must battle humanity - and one another - for total world dominance.GigaBash combines the chaos and creativity of titles like Power Stone, Super Smash Bros Ultimate and War of Monsters with the jaw-dropping scale of the classic kaiju movies. Play as either a rampaging Titan or a Titan-hunting mecha; summon lightning from the heavens, use a radio tower as a baton, or roll a whole district (and your enemies) into a single massive snowball. Wreak enough havoc and you'll evolve into your final form, the terrifyingly titanic S-Class.… Expand"}, {"name": "Headland", "details_link": "https://www.metacritic.com/game/switch/headland", "publisher": "Northplay ApS", "release_date": "Jan 13 2022", "developers": ["Northplay ApS"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/b65c347ea5fa55755a5ef30d7db1bb21-98.jpg", "descriptions": "A powerful force shatters the imagination core from Nor's Headland. With his robot friends he has to find the fragments and fight to regain his limitless creativity.Headland is a fast paced action adventure game from the award winning studio Northplay. Experience a completely new take onA powerful force shatters the imagination core from Nor's Headland. With his robot friends he has to find the fragments and fight to regain his limitless creativity.Headland is a fast paced action adventure game from the award winning studio Northplay. Experience a completely new take on the action adventure genre built entirely around mobile.Fight a host of monsters in our unique swipe-and-tap-based combat system. Unlock new weapons in arenas and upgrade them using resources gathered on your journey. Tap through a story full of vivid characters and explore a big beautiful imaginary world.… Expand"}, {"name": "Farming Simulator 22", "details_link": "https://www.metacritic.com/game/xbox-series-x/farming-simulator-22", "publisher": "Giants Software", "release_date": "Nov 22 2021", "developers": ["Giants Software"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Stadia", "Xbox One", "Xbox Series X"], "num_players": "Up to 6 ", "genres": ["Simulation", "General", "Virtual", "Career"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/f5c0d785eb6cb36face501fa4bec5c00-98.jpg", "descriptions": "Cultivated to be bigger and better the ultimate and multimillion selling farming simulation returns this November! Farming Simulator 22 offers more depth and the highest extent of player freedom in the history of the series. With more than 400 machines and tools from over 100 authenticCultivated to be bigger and better the ultimate and multimillion selling farming simulation returns this November! Farming Simulator 22 offers more depth and the highest extent of player freedom in the history of the series. With more than 400 machines and tools from over 100 authentic agricultural brands, players can look forward to an improved and realistic as ever simulation. Suited for all ages, players dive into even more diverse agriculture, animal husbandry and forestry. Two new maps inspired by US and EU regions plus an updated alpine Erlengrat map emphasize different kinds of farming operations, including three new crops. The addition of seasonal cycles adds new challenges throughout the year, and enhances the atmosphere many times over. Players can now start various production chains to further extend their income whether they produce bread, oil, juice or more. To allow more individualization of farms and characters, the vastly improved customization tools add plentiful new possibilities. Based on the GIANTS Engine 9, Farming Simulator 22 also features many technical improvements such as more realistic AI behavior, richer worlds and a significant performance boost on all systems.… Expand"}, {"name": "The Dark Pictures Anthology: House of Ashes", "details_link": "https://www.metacritic.com/game/pc/the-dark-pictures-anthology-house-of-ashes", "publisher": "Bandai Namco Games", "release_date": "Oct 22 2021", "developers": ["Supermassive Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/e8f185beb6c99238c265eda2ec0d091e-98.jpg", "descriptions": "From the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the story\n\nMultiple ways to play including 2 player online coop mode\n\nHugely branching storyline that changes based on the decisions you make\n\nEach game in TheFrom the creators of Until DawnSwitch between the perspective of 5 playable characters - All can live or die in your version of the storyMultiple ways to play including 2 player online coop modeHugely branching storyline that changes based on the decisions you makeEach game in The Dark Pictures Anthology is a complete and original story in its own rightTHREE WAYS TO PLAYIntroducing multiplayer to The Dark Pictures Anthology! 1. SOLO STORYThe complete terrifying story as a single player experience 2. MOVIE NIGHT MODEYou and up to 4 friends will play the story together on the couch, each controlling a different characterAnd:3. SHARED STORY2 player online co-operative mode. Play the whole story online with a friend, making choices that affect you both.… Expand"}, {"name": "Xuan-Yuan Sword 7", "details_link": "https://www.metacritic.com/game/xbox-one/xuan-yuan-sword-7", "publisher": "EastAsiaSoft", "release_date": "Sep 30 2021", "developers": ["SOFTSTAR Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/91a071bdf068508417c6e4a9ae400ae9-98.jpg", "descriptions": "Xuan-Yuan Sword VII is an ARPG rooted in Chinese history and mythology. Players take on the role of Taishi Zhao, a calm and reliable swordsman who was accidentally involved in a tragic fate. To protect his beloved family, he starts a journey in this chaotic realm to find the truth."}, {"name": "Behind the Frame: The Finest Scenery", "details_link": "https://www.metacritic.com/game/pc/behind-the-frame-the-finest-scenery", "publisher": "Akupara Games", "release_date": "Aug 25 2021", "developers": ["Silver Lining Studio"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/9cd4efe1b2716cdad10502a1d8930df8-98.jpg", "descriptions": "Guide brush strokes and solve a variety of puzzles to help an aspiring artist complete her masterpiece amid her brusque neighbor's gaze and his pesky cat. As her painting starts to take shape, uncover an emotional tale of chance and artistry revealed behind unrelated yet familiar moments.Guide brush strokes and solve a variety of puzzles to help an aspiring artist complete her masterpiece amid her brusque neighbor's gaze and his pesky cat. As her painting starts to take shape, uncover an emotional tale of chance and artistry revealed behind unrelated yet familiar moments. Behind the Frame is a vivid, interactive fiction about an aspiring artist on the cusp of finishing the final piece of her gallery submission.A relaxing, eloquent experience that can be played at any pace. Become immersed in a panoramic world filled with resplendent colors, beautiful hand-animated visuals, and a smooth, easy-listening soundtrack.As a passionate artist, seek the missing colors that will bring your paintings to life - all while remembering to take the occasional coffee and breakfast breaks that keep you going. There is more than what meets the eye, for every painting has a story to tell.… Expand"}, {"name": "Narita Boy", "details_link": "https://www.metacritic.com/game/xbox-one/narita-boy", "publisher": "Team17", "release_date": "Mar 30 2021", "developers": ["Studio Koba"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 73, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/fc13a5d2e8a61f38bb8f15f278ed5b59-98.jpg", "descriptions": "Become symphonic in Narita Boy! A radical action-adventure as a legendary pixel hero trapped as a mere echo within the Digital Kingdom. Discover the mysteries behind the Techno-sword, lock swords with the corrupt and tainted Stallions. Save the world!"}, {"name": "Habroxia 2", "details_link": "https://www.metacritic.com/game/switch/habroxia-2", "publisher": "EastAsiaSoft", "release_date": "Feb  3 2021", "developers": ["EastAsiaSoft", "Lillymo Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/40aaa8f38822af58efed65c13bdf6ead-98.jpg", "descriptions": "Blast off for a sequel that pushes every facet of 2D shoot'em ups to escape velocity. In the aftermath of a brutal attack on Free Space, humanity sends scout ships to the star system that was at the source of the assault. But when one of the pilots doesn’t return home, it’s up to hisBlast off for a sequel that pushes every facet of 2D shoot'em ups to escape velocity. In the aftermath of a brutal attack on Free Space, humanity sends scout ships to the star system that was at the source of the assault. But when one of the pilots doesn’t return home, it’s up to his daughter -- the talented starpilot Sabrina -- to find him. Habroxia 2 is a non-linear, old-school space shooter with upgrades, boss fights, and even New Game+, all wrapped in a retro package combining pixel graphics, chiptunes, and stellar gameplay.… Expand"}, {"name": "Ghostrunner", "details_link": "https://www.metacritic.com/game/switch/ghostrunner", "publisher": "505 Games", "release_date": "Nov 10 2020", "developers": ["ONE MORE LEVEL"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "3D"], "meta_score": 73, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/d8769fc33ca8eb8c4001f7d67f3fb533-98.jpg", "descriptions": "Ghostrunner offers a unique single-player experience: fast-paced, violent combat, and an original setting that blends science fiction with post-apocalyptic themes. It tells the story of a world that has already ended and its inhabitants who fight to survive."}, {"name": "Worm Jazz", "details_link": "https://www.metacritic.com/game/switch/worm-jazz", "publisher": "Inconspicuous Creations", "release_date": "Sep 21 2020", "developers": ["Inconspicuous Creations"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/84d29fa16ddc54cc894aad6164574cdc-98.jpg", "descriptions": "Worm Jazz is a unique, wriggly puzzle game that combines the elongating body mechanic of Snake with the explosion-heavy demolition of Bomberman. You take control of Mr. Mark, an earthworm with a taste of smooth jazz and dapper headwear. Writhe your way through the many intricate,Worm Jazz is a unique, wriggly puzzle game that combines the elongating body mechanic of Snake with the explosion-heavy demolition of Bomberman. You take control of Mr. Mark, an earthworm with a taste of smooth jazz and dapper headwear. Writhe your way through the many intricate, mind-bending mazes filled with mines, wormholes, and powerups! Shrink when you blow yourself up and expand when you scarf down some chow. Are you able to gobble up all the food on each stage to reach the highly coveted golden apple?… Expand"}, {"name": "The Elder Scrolls Online: Greymoor", "details_link": "https://www.metacritic.com/game/playstation-4/the-elder-scrolls-online-greymoor", "publisher": "Bethesda Softworks", "release_date": "Jun  9 2020", "developers": ["ZeniMax Media"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 73, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/5/f311f6a1123832d16e4bdf547a388789-98.jpg", "descriptions": "A YEAR-LONG GOTHIC ADVENTUREStop a powerful Vampire Lord from enslaving Tamriel in the Dark Heart of Skyrim, a gothic tale of sinister secrets and deadly betrayals. The Elder Scrolls Online: Greymoor is the next stage in the epic story that begins with the Harrowstorm DLC and continuesA YEAR-LONG GOTHIC ADVENTUREStop a powerful Vampire Lord from enslaving Tamriel in the Dark Heart of Skyrim, a gothic tale of sinister secrets and deadly betrayals. The Elder Scrolls Online: Greymoor is the next stage in the epic story that begins with the Harrowstorm DLC and continues throughout the entire year. EXPLORE WESTERN SKYRIMVenture through an iconic land, almost 1000 years before the events of The Elder Scrolls V: Skyrim. Traverse the frozen tundra and snowy mountains of the Nord homeland and delve into the perilous depths of long-forgotten Blackreach.AN ANCIENT EVILTerrible monsters, led by a Vampire Lord, rise from the depths of Blackreach, intent on devouring souls to fuel their fiendish plans. As darkness consumes the land, Skyrim needs heroes to restore the light.DISCOVER TAMRIEL'S HISTORYTravel across Tamriel to recover lost artifacts with the new Antiquities System. Scry the location of ancient relics and excavate them to uncover Tamriel's hidden history and become a world-renown Archaeologist! ALL-NEW ADVENTURESExplore the land of the Nords and encounter a people as unique and stalwart as Skyrim itself! This all-new zone features a macabre main story, exciting side quests, terrifying world bosses, dangerous delves, and more. A NEW TRIAL: KYNE'S AEGIS Defend the island bastion of Kyne's Aegis in a massive 12-player trial and protect the besieged villagers from invading Sea Giants. Battle hordes of monstrous raiders and three challenging bosses in this new PvE group challenge. NEW WORLD EVENTS: HARROWSTORMS Supernatural Harrowstorms plague Western Skyrim, draining the life energy of anyone caught within and transforming them into ravenous monsters or mindless zombies. Band together and shut down these world events before the very soul of Skyrim is lost. NEW REWARDS: SKYRIM'S BOUNTY Earn, unlock, and loot a massive selection of new and unique rewards found within the snow-swept region of Western Skyrim, including six armor sets, tons of collectables, Achievements, items, and more!… Expand"}, {"name": "Jay and Silent Bob: Mall Brawl", "details_link": "https://www.metacritic.com/game/switch/jay-and-silent-bob-mall-brawl", "publisher": "The Media Indie Exchange", "release_date": "May  7 2020", "developers": ["Interabang Entertainment"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/60e9a7810011303dda056af1f9446061-98.jpg", "descriptions": "Jay and Silent Bob Mall Brawl, an all new side-scrolling brawler set in the world famous and beloved View Askewniverse, is now available as a fully functional cartridge compatible with the original NES. This cartridge is a full game playable by either one or two players!There are threeJay and Silent Bob Mall Brawl, an all new side-scrolling brawler set in the world famous and beloved View Askewniverse, is now available as a fully functional cartridge compatible with the original NES. This cartridge is a full game playable by either one or two players!There are three color variants available - Silent Bob Green, Jay Yellow, and NES Grey.Each copy of Jay and Silent Bob Mall Brawl comes in a retro box that has been painstakingly crafted to be as authentic as possible. The box is printed on the same material as original retro boxes and matches the same flap design at the top. The metallic gold ink on the \"Limited Run\" seal has also been matched to the original seal's ink.Included in the box is a retro manual, dust sleeve, and of course, a styrofoam block to hold the cartridge up inside the box. Each copy of the game will arrive shrinkwrapped.The game itself was programmed by Tomas Guinan from Spoony Bard Productions.This game is region free!… Expand"}, {"name": "Heroland", "details_link": "https://www.metacritic.com/game/playstation-4/heroland", "publisher": "XSEED Games", "release_date": "Dec  3 2019", "developers": ["FuRyu"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/13e48269f2bbb7f3ea0751e7b4fef04b-98.jpg", "descriptions": "You’re invited to a magical theme park where anyone can be a hero — except for you. You just work there! Conjured from your 16-bit dreams by the legends of Japanese RPGs, this whimsical tale of princes and part-timers guarantees excitement that cannot be forgotten."}, {"name": "Planescape: Torment: Enhanced Edition / Icewind Dale: Enhanced Edition", "details_link": "https://www.metacritic.com/game/switch/planescape-torment-enhanced-edition-icewind-dale-enhanced-edition", "publisher": "Skybound Games", "release_date": "Oct 15 2019", "developers": ["Beamdog"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/de6e4269355a268695f6b80c754ac0cb-98.jpg", "descriptions": "Planescape: Torment Enhanced Edition\"What can change the nature of a man?\" \n\nYou are the Nameless One, a hulking figure covered in scars and tattoos collected over the course of countless livesnone of which you can remember, but are now coming back to haunt you. You are prodded awake byPlanescape: Torment Enhanced Edition\"What can change the nature of a man?\" You are the Nameless One, a hulking figure covered in scars and tattoos collected over the course of countless livesnone of which you can remember, but are now coming back to haunt you. You are prodded awake by Morte, a floating skull and keeper of secrets, to embark on an adventure from the dirty streets of Sigil through the mysterious Outer Planes and even into the depths of Hell itself. Soon, you will discover that some destinies cannot be escaped and some memories are greater burdens than an even an immortal can bear. Contains: * Original Planescape: Torment campaign * Restored quest content, cut from the original game The Planes Await Explore the furthest and most bizarre reaches of the Dungeons & Dragons multiverse, filled with strange magics, talking weapons, philosophic undead, and more.Strange Bedfellows A chaste succubus who can kill with a kiss. A confused crossbow-wielding cube. A suit of armor animated by a spirit demanding justice. Join these companions and more on your journey through the planes.Optimized for ConsoleExperience Planescape: Torment in HD with a reworked interface designed for ConsoleIcewind Dale Enhanced Edition Evil stirs beneath the Spine of the World. Journey deep into Icewind Dale, a harsh and unforgiving territory settled only by the hardiest folk. Battle the cunning, ferocious beasts that survive among the snow-shrouded peaks, and confront an evil that schemes to wreak destruction upon the world. Originally released in 2000, Icewind Dale is a Dungeons & Dragons tactical isometric roleplaying game set in the legendary Forgotten Realms. Contains: * Original Icewind Dale campaign * Heart of Winter expansion * Trials of the Luremaster expansion * Adventurers of Neverwinter voice and portrait pack* Restored quest content, cut from the original game New Character Options Select from over 30 new kits and classes to create the perfect adventuring party; customize your heroes with expanded options for hair, skin, and clothing colors, as well as new portraits and voice sets.Gather Your Party Tackle the dangers of Icewind Dale alone or with friends in co-op multiplayer.Optimized for ConsoleExperience Icewind Dale in HD with a reworked interface design!… Expand"}, {"name": "Ghostbusters: The Video Game Remastered", "details_link": "https://www.metacritic.com/game/switch/ghostbusters-the-video-game-remastered", "publisher": "MAD DOG GAMES LLC", "release_date": "Oct  4 2019", "developers": ["Saber Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 73, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/3d7385690a9d56cf859807e85d7ab325-98.jpg", "descriptions": "Strap on your proton pack once again and join the Ghostbusters on the adventure with the voice and likeness of the original crew as you battle to save New York. Authentic Ghostbusters Experience - The game features the voices and in-game likenesses of Bill Murray, Dan Aykroyd, Harold Ramis,Strap on your proton pack once again and join the Ghostbusters on the adventure with the voice and likeness of the original crew as you battle to save New York. Authentic Ghostbusters Experience - The game features the voices and in-game likenesses of Bill Murray, Dan Aykroyd, Harold Ramis, and Ernie Hudson in an original story penned by the writers of the original films - Dan Aykroyd and Harold Ramis. Unique Gameplay - Experience unique ghost hunting, wrangling and trapping with upgradeable weapons in widely destructible environments. Test the team's mettle with large scale boss fights.   Storyline Campaign - Play through a unique storyline as the player battles and captures ghosts - both well-loved and brand new - throughout New York.… Expand"}, {"name": "Hue", "details_link": "https://www.metacritic.com/game/switch/hue", "publisher": "Digital Bards", "release_date": "Jun  6 2019", "developers": ["Fiddlesticks Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/0b3f6c2c4215c10a9e22b068dbfc2779-98.jpg", "descriptions": "Hue is a vibrant, award-winning puzzle-adventure, where you alter the world by changing its background colour. You explore a dangerous grey land, unearthing coloured fragments on a journey to find your missing mother. As obstacles match the background, they disappear, creating new andHue is a vibrant, award-winning puzzle-adventure, where you alter the world by changing its background colour. You explore a dangerous grey land, unearthing coloured fragments on a journey to find your missing mother. As obstacles match the background, they disappear, creating new and exciting puzzles - full of peril, mystery and colours unseen.… Expand"}, {"name": "Yomawari: The Long Night Collection", "details_link": "https://www.metacritic.com/game/switch/yomawari-the-long-night-collection", "publisher": "NIS America", "release_date": "Oct 30 2018", "developers": ["Nippon Ichi Software"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/96544a5242274988c6942ce883400b05-98.jpg", "descriptions": "Twice the fright. Traverse the haunting world of Yomawari: Night Alone as a young girl searches for her sister, then share in the terror facing schoolgirls Yui and Haru in Yomawari: Midnight Shadows. Uncover the mysteries plaguing a rural Japanese town, hide from the things lurking in theTwice the fright. Traverse the haunting world of Yomawari: Night Alone as a young girl searches for her sister, then share in the terror facing schoolgirls Yui and Haru in Yomawari: Midnight Shadows. Uncover the mysteries plaguing a rural Japanese town, hide from the things lurking in the night, and maybe get home alive.… Expand"}, {"name": "A Pixel Story", "details_link": "https://www.metacritic.com/game/xbox-one/a-pixel-story", "publisher": "Rising Star Games", "release_date": "Feb 24 2017", "developers": ["Lamplight Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/999da1f732ed9c137e2b18ee6dffbcdc-98.jpg", "descriptions": "In a world hidden deep inside your computer, an unlikely hero is about to appear. A tale of platforms and perils; of magical teleporting hats and sarcastic software; of thieving seagulls and maniacal operators. It’s no fairy tale… it’s a pixel story. [Xbox.com]"}, {"name": "Rise of the Tomb Raider: Baba Yaga - The Temple of the Witch", "details_link": "https://www.metacritic.com/game/xbox-one/rise-of-the-tomb-raider-baba-yaga---the-temple-of-the-witch", "publisher": "Square Enix", "release_date": "Jan 26 2016", "developers": ["Crystal Dynamics", "Nixxes Software"], "platforms": ["PC", "Xbox 360", "Xbox One"], "genres": ["Action Adventure", "General", "Linear"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/c3ed39df6247d60caac798ee60987ee7-98.jpg", "descriptions": "Deep in the wilds of Siberia, there is a forbidden forest that no man will enter, where a Soviet expedition vanished without a trace. Lara enters the Wicked Vale in search of a missing man, but what she finds is a nightmare that she cannot explain. Is the witch, Baba Yaga, truly haunting theDeep in the wilds of Siberia, there is a forbidden forest that no man will enter, where a Soviet expedition vanished without a trace. Lara enters the Wicked Vale in search of a missing man, but what she finds is a nightmare that she cannot explain. Is the witch, Baba Yaga, truly haunting the forbidden forest? Or is there more to the legend?\r Featuring hours of gameplay and a new outfit and bow, Baba Yaga: The Temple of the Witch expands the story of the main campaign with Lara facing deadly new adversaries, exploring a new puzzle-filled tomb, and solving a decades old mystery, all culminating in a showdown with an ancient and mythic evil.… Expand"}, {"name": "LBX: Little Battlers eXperience", "details_link": "https://www.metacritic.com/game/3ds/lbx-little-battlers-experience", "publisher": "Nintendo", "release_date": "Aug 21 2015", "developers": ["Level 5"], "platforms": "3DS", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/a1c63942dbe6c58cff89e27845464ca6-98.jpg", "descriptions": "Assume the role of Van Yamano, a boy who accosts a unique LBX – a complex, customizable, palm-sized robot. Use it – and team up with familiar characters from the hit TV series – to take down the evil corporation known as the New Dawn Raisers."}, {"name": "Lemma", "details_link": "https://www.metacritic.com/game/pc/lemma", "publisher": "Evan Todd", "release_date": "May 12 2015", "developers": ["Evan Todd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 73, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/f22f63c7e228eb1252ad749126ed33df-98.jpg", "descriptions": "A first-person parkour in a surreal, physics-driven voxel world. Every move can modify the environment. Surfaces pop in and out of existence at will."}, {"name": "Nihilumbra", "details_link": "https://www.metacritic.com/game/playstation-vita/nihilumbra", "publisher": "BEAUTIFUN GAMES SL", "release_date": "Jan 27 2015", "developers": ["BEAUTIFUN GAMES SL", "BeautiFun Games"], "platforms": ["iPhone/iPad", "PC", "Switch", "Wii U", "PlayStation Vita"], "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/cdcbf37900d3fb30813899172905f12f-98.jpg", "descriptions": "Nihilumbra is a dark, atmospheric 2D puzzle platform game boasting hand painted dark environments, nightmarish monsters, and a hauntingly beautiful soundtrack. It tells a story that really panders to the existential dread lurking within us all."}, {"name": "God of War Collection", "details_link": "https://www.metacritic.com/game/playstation-vita/god-of-war-collection", "publisher": "SCEA", "release_date": "May  6 2014", "developers": ["Sanzaru Games", "Sanzaru Games", "Inc."], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Compilation", "Miscellaneous", "Compilation"], "meta_score": 73, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/c1d30a2265c766d5fd55ebdb854345af-98.jpg", "descriptions": "Two Epic Adventures of Conquest, Destiny, and Vengeance, God of War and God of War II, return for the first time on BluRay Disc. In God of War: Colleciton, you will experience the dark world of Ancient Greece through Kratos, a brutal warrior determined to murder the God of War and alter whatTwo Epic Adventures of Conquest, Destiny, and Vengeance, God of War and God of War II, return for the first time on BluRay Disc. In God of War: Colleciton, you will experience the dark world of Ancient Greece through Kratos, a brutal warrior determined to murder the God of War and alter what no mortal has ever changed... fate itself. … Expand"}, {"name": "Gigantic Army", "details_link": "https://www.metacritic.com/game/pc/gigantic-army", "publisher": "Nyu Media", "release_date": "Feb  5 2014", "developers": ["Astro Port"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "General"], "meta_score": 73, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/0fd7694c44af1027e53a136bdc7247b2-98.jpg", "descriptions": "It is the 21st century and Earth is at war with the Ramulons – an alien race determined to stop humanity’s advance into space. Mankind’s war against the Ramulons has reached the planet Ramulon itself and it is now down to YOU to pilot the ‘GMR-34 SALADIN’ - a Manned Combat Robot - and takeIt is the 21st century and Earth is at war with the Ramulons – an alien race determined to stop humanity’s advance into space. Mankind’s war against the Ramulons has reached the planet Ramulon itself and it is now down to YOU to pilot the ‘GMR-34 SALADIN’ - a Manned Combat Robot - and take on the Ramulon army. Customize your arsenal of explosive, projectile and plasma weapons, and combine them with melee attacks, thrusters and shield to take the fight to the enemy and end the conflict.… Expand"}, {"name": "Dustforce", "details_link": "https://www.metacritic.com/game/playstation-vita/dustforce", "publisher": "Capcom", "release_date": "Feb  4 2014", "developers": ["Hitbox ", "QLOC"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation Vita"], "num_players": "Up to 4 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 73, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/33567739b464d49f1a09ec9a6f7f8a6d-98.jpg", "descriptions": "In Dustforce, players stylishly flow through precarious environments, sweeping up dust, leaves, trash and slime. The cleaners face off against the fourSprites who are determined to make a mess of the whole world"}, {"name": "Twisted Metal: Head-On - Extra Twisted Edition", "details_link": "https://www.metacritic.com/game/playstation-2/twisted-metal-head-on---extra-twisted-edition", "publisher": "SCEA", "release_date": "Feb  5 2008", "developers": ["Eat Sleep Play"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 73, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/79a2e12f0f70b098849a06126b29d89e-98.jpg", "descriptions": "Twisted Metal: Head-On explodes to the PS2 with an Extra Twisted Edition featuring added gameplay and bonus content for true fans of the franchise. In addition to technical advancements and an exclusive bonus level for the original Twisted Metal: Head-On, the PS2 version includes \"The BlackTwisted Metal: Head-On explodes to the PS2 with an Extra Twisted Edition featuring added gameplay and bonus content for true fans of the franchise. In addition to technical advancements and an exclusive bonus level for the original Twisted Metal: Head-On, the PS2 version includes \"The Black Levels\", 4 never before played levels from the Twisted Metal: Black universe. Finally, explore a new twist in bonus content – control the most popular Twisted Metal character, SWEET TOOTH, in an special interactive level filled with behind the scenes content and historic factoids direct from the development team. Experience the chaotic thrill of car-combat and get behind the wheel and outlast your opponents in an all-out melee of vehicular destruction. Jump into a variety of vehicles armed with heavy machine guns, turbo boost and each with a unique devastating specialty attack to unleash mayhem in wide-open arenas based on locations across the globe. Collect an arsenal of weaponry like homing missiles, fire rockets and napalm to deliver explosive attacks on your opponents' vehicle. Utilize advanced combo moves such as rear fire, freeze missiles & FLAK to confuse & disable the competition. [SCEA]… Expand"}, {"name": "The Lord of the Rings: The Third Age", "details_link": "https://www.metacritic.com/game/playstation-2/the-lord-of-the-rings-the-third-age", "publisher": "EA Games", "release_date": "Nov  2 2004", "developers": ["EA Games"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 73, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/81410c58eb859722aad59b54eba86d3b-98.jpg", "descriptions": "The Lord of the Rings: The Third Age roleplaying game is an epic quest in which players take on the roles of new characters choosing their own path through Middle-earth while interacting with the heroes and villains of the trilogy. Based on New Line Cinema and Peter Jackson's acclaimed filmThe Lord of the Rings: The Third Age roleplaying game is an epic quest in which players take on the roles of new characters choosing their own path through Middle-earth while interacting with the heroes and villains of the trilogy. Based on New Line Cinema and Peter Jackson's acclaimed film adaptations of J.R.R. Tolkien's classic The Lord of the Rings trilogy, The Lord of the Rings, The Third Age videogame allows players to adventure through Middle-earth, building a party of heroes as they journey. Players battle on the side of the Fellowship, but can unlock additional encounters where they fight on the side of Sauron as they progress. In the game, players interact with the characters of the Fellowship in a unique structure, taking on individual quests while intersecting the major events of the film trilogy that drive the story forward. Parties traverse through both familiar and seldom-glimpsed locations, using an innovative turn-based battle system as they fight, encountering the demonic Balrog in the Mines of Moria, defending the fallen city of Osgiliath, or trying to destroy Helm's Deep. [Electronic Arts]… Expand"}, {"name": "Classic NES Series: Zelda II: The Adventure of Link", "details_link": "https://www.metacritic.com/game/game-boy-advance/classic-nes-series-zelda-ii-the-adventure-of-link", "publisher": "Nintendo", "release_date": "Oct 25 2004", "developers": ["Nintendo"], "platforms": "Game Boy Advance", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 73, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/7fbe1ade2eee08e5d711755d85b41d3f-98.jpg", "descriptions": "The sequel to The Legend of Zelda combines side-scrolling action with role-playing game elements. In Zelda II: The Adventure of Link, you'll embark on a quest to find the Triforce of Courage, awaken Princess Zelda from an evil wizard's spell, and save Hyrule from ruin. As Link, you can learnThe sequel to The Legend of Zelda combines side-scrolling action with role-playing game elements. In Zelda II: The Adventure of Link, you'll embark on a quest to find the Triforce of Courage, awaken Princess Zelda from an evil wizard's spell, and save Hyrule from ruin. As Link, you can learn magic spells and collect items to increase your power. Zelda II features magic that lets you fly, throw fireballs, jump higher, and more.… Expand"}, {"name": "Max Payne 2: The Fall of Max Payne", "details_link": "https://www.metacritic.com/game/playstation-2/max-payne-2-the-fall-of-max-payne", "publisher": "Rockstar Games", "release_date": "Dec  2 2003", "developers": ["Rockstar Vienna"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 73, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/2f73afe907622da3fc4f5166d21b1ebf-98.jpg", "descriptions": "Max Payne 2: The Fall of Max Payne is a violent, film-noir love story for mature audiences. Dark, tragic and intense, the in-depth story is a thrill-ride of shocking twists and revelations. Love hurts. The fans of Max Payne won?t be disappointed. The fierce, yet stylish action sequences andMax Payne 2: The Fall of Max Payne is a violent, film-noir love story for mature audiences. Dark, tragic and intense, the in-depth story is a thrill-ride of shocking twists and revelations. Love hurts. The fans of Max Payne won?t be disappointed. The fierce, yet stylish action sequences and slow-motion gunplay that has become synonymous with Max Payne is back and better than ever. New and enhanced moves and options provide breathtaking cinematic game play. Max Payne 2: The Fall of Max Payne is set to raise the bar on action games all over again. [Rockstar]… Expand"}, {"name": "Warlords IV: Heroes of Etheria", "details_link": "https://www.metacritic.com/game/pc/warlords-iv-heroes-of-etheria", "publisher": "Ubisoft", "release_date": "Oct 21 2003", "developers": ["Infinite Interactive"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General"], "meta_score": 73, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/39f20fac60fef03263c993f5a85df755-98.jpg", "descriptions": "Warlords IV is a unique blend of roleplaying and turn-based strategy gaming. The game centers around your Hero, who plays a pivotal role in the success or failure of your military and economic efforts. Warlords IV is set in the troubled land of Etheria. Old foes such as Dwarves, Elves, andWarlords IV is a unique blend of roleplaying and turn-based strategy gaming. The game centers around your Hero, who plays a pivotal role in the success or failure of your military and economic efforts. Warlords IV is set in the troubled land of Etheria. Old foes such as Dwarves, Elves, and Orcs have resumed their ancient hostilities, and the Undead legions of Lord Bane have returned. The Knights continue their quest for dominance, and the unquiet whispers speak of the Empire, a race even more evil than the Undead. The Heroes of Warlords IV show their mastery of sword and sorcery in the tactical combat system. Casting spells, smiting foes, or boosting morale of shaken troops, Heroes can turn the tide of battle. Players may grow and develop heroes from battle to battle, gaining in abilities and skills, and accumulating magic items and treasures. [Ubi Soft]… Expand"}]