[{"name": "Echo Generation", "details_link": "https://www.metacritic.com/game/xbox-series-x/echo-generation", "publisher": "Cococucumber", "release_date": "Oct 21 2021", "developers": ["Cococucumber"], "platforms": ["Xbox One", "Xbox Series X"], "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/395ae832780a477f98d692e543dc4be8-98.jpg", "descriptions": "Echo Generation follows a gang of kids through otherworldly adventures as they investigate mysterious and supernatural events in their hometown that will change the course of their lives forever."}, {"name": "Shakedown Hawaii", "details_link": "https://www.metacritic.com/game/switch/shakedown-hawaii", "publisher": "Vblank Entertainment Inc.", "release_date": "May  7 2019", "developers": ["Vblank Entertainment Inc."], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "PlayStation 5", "PlayStation Vita", "Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/cc3abb6a9e8b90d4f0f3609fc43f2716-98.jpg", "descriptions": "Vblank's open world action heads to the tropics, in Shakedown: Hawaii. From the boardroom to the streets, Shakedown parodies big business and the white collar crimes that go alongside. Build your empire, monopolize the markets, and collaterally re-zone the island's destructible sandbox."}, {"name": "Chroma Squad", "details_link": "https://www.metacritic.com/game/pc/chroma-squad", "publisher": "Behold Studios", "release_date": "Apr 30 2015", "developers": ["Behold Studios"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/271150584be1053aa350b56d7c186d18-98.jpg", "descriptions": "Chroma Squad is a tactical RPG about five stunt actors who decide to quit their jobs and start their own Power Rangers-inspired TV show. Cast actors, purchase equipment and upgrades for your studio, craft weapons and giant Mechas out of cardboard and duct tape."}, {"name": "Beatbuddy: Tale of the Guardians", "details_link": "https://www.metacritic.com/game/pc/beatbuddy-tale-of-the-guardians", "publisher": "Reverb", "release_date": "Aug  6 2013", "developers": ["Threaks"], "platforms": ["iPhone/iPad", "Wii U", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/f7bfb3f56b3ae02cb2bd214a10a9f6d6-98.jpg", "descriptions": "Awakened from his sleep, Beatbuddy journeys through lush hand-painted environments on a trip to save his friends and his own immortality. Beatbuddy interacts with the living breathing environment that pulses to the beat of an original soundtrack, aiding him as he unlocks new paths and solvesAwakened from his sleep, Beatbuddy journeys through lush hand-painted environments on a trip to save his friends and his own immortality. Beatbuddy interacts with the living breathing environment that pulses to the beat of an original soundtrack, aiding him as he unlocks new paths and solves puzzles. … Expand"}, {"name": "Disney DuckTales: Remastered", "details_link": "https://www.metacritic.com/game/playstation-3/disney-ducktales-remastered", "publisher": "Capcom", "release_date": "Aug 13 2013", "developers": ["WayForward"], "platforms": ["iPhone/iPad", "PC", "Wii U", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/8f306d5d6ea3dfa13ef62f3320439862-98.jpg", "descriptions": "DuckTales Remastered has seen the development team take the levels and layout from the original 1989 release as a foundation before expanding upon them to significantly enhance the gameplay experience but where this update truly impresses is its graphics and sound. All of the visuals fromDuckTales Remastered has seen the development team take the levels and layout from the original 1989 release as a foundation before expanding upon them to significantly enhance the gameplay experience but where this update truly impresses is its graphics and sound. All of the visuals from the 8-bit game have been beautifully re-created as hand-drawn and animated sprites, across a backdrop of luscious, re-envisioned level backgrounds. Furthermore, original Disney Character Voices talent, including some from the cartoon TV series, bring in-game characters to life with charm and wit, while the classic melodies of the original soundtrack are given a modern twist.… Expand"}, {"name": "South of the Circle", "details_link": "https://www.metacritic.com/game/pc/south-of-the-circle", "publisher": "11 bit studios", "release_date": "Aug  3 2022", "developers": ["State of Play Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/8a54f97aa1f52ff6f1c40ebe6e345856-98.jpg", "descriptions": "Antarctica, 1964.\r A crashed aircraft, tail to the sky.\r\n\r\nCambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present begin to blur.\r\n\r\nA love story betweenAntarctica, 1964.\r A crashed aircraft, tail to the sky.\r Cambridge academic Peter stumbles from the wreckage in search of help, fighting the cold. As his attempts to escape the ice grow more desperate, the lines between his past and present begin to blur.\r A love story between colleagues Peter and Clara, set against the backdrop of the Cold War, South of the Circle is a narrative adventure game about memory, survival, and the consequences of not dealing with the past.… Expand"}, {"name": "Marvel's Spider-Man: Silver Lining", "details_link": "https://www.metacritic.com/game/playstation-4/marvels-spider-man-silver-lining", "publisher": "Sony Interactive Entertainment", "release_date": "Dec 21 2018", "developers": ["Insomniac Games"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/cfd8e2a242b6f3850097439f5006d803-98.jpg", "descriptions": "The conclusion of the three-part DLC series."}, {"name": "Bit.Trip Fate", "details_link": "https://www.metacritic.com/game/wii/bittrip-fate", "publisher": "Aksys Games", "release_date": "Oct 25 2010", "developers": ["Gaijin Games"], "platforms": ["PC", "Switch", "Wii"], "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/7a3b778918830f2eca8f7e8fb7596dc3-98.jpg", "descriptions": "Bit.Trip Fate is a side-scrolling shoot-'em-up game."}, {"name": "Shenmue I & II", "details_link": "https://www.metacritic.com/game/playstation-4/shenmue-i-ii", "publisher": "Sega", "release_date": "Aug 21 2018", "developers": ["Sega", "d3t Ltd"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/6137f89c3c6e5b5b9f525bbfee1d2fe4-98.jpg", "descriptions": "A tale of revenge.\r In 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father's death and sets out tracing LanA tale of revenge.\r In 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father's death and sets out tracing Lan Di's path.\r The first game in the series, Shenmue begins the tale as Ryo travels around Yokosuka, Japan, gathering clues about his father's murder and dealing with nefarious gangsters along the way.\r The sequel Shenmue II continues Ryo's quest, this time crossing the sea to Hong Kong, China. Ryo ventures deeper into the criminal underworld, meeting martial arts masters who aid him on his journey and offer insight into his father's death, and unravels the mysteries of the Dragon Mirror that his father kept hidden.\r Gameplay:\r * Take the role of Ryo Hazuki.\r * Explore a 3D open world searching for clues, examining objects, and talking to NPCs.\r* Battle enemies and bosses making full use of the moves of Hazuki-style jujitsu.\r* Beat quick-time events (QTEs) and mini-games.\r Key features:\r The best Shenmue experience\r Pioneering Dreamcast classics available for the first time on PC\rUpdated user interface\rChoice of modern or classic controls\rJapanese audio available for the first time for a global audience\rFully scalable screen resolutions\r An epic legend\rA tale of revenge on a grand scale\rSolve the mystery of your father's murder\rAn experience never to be forgotten\r The world feels alive\rTalk to anyone, scour the world for clues\rNPCs live independent lives on their own schedule\rFaithful recreations of 1980s Japan and Hong Kong, China\rDistract yourself with arcade games, collectibles, duck racing, and more… Expand"}, {"name": "Just Cause", "details_link": "https://www.metacritic.com/game/pc/just-cause", "publisher": "Eidos Interactive", "release_date": "Sep 27 2006", "developers": ["Avalanche Studios"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/c862f758fc03c711652ff0472e517609-98.jpg", "descriptions": "Assume the role of the flamboyant Rico Rodriguez – an undercover CIA operative specializing in regime change - as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it’s your job to negate the threat to worldAssume the role of the flamboyant Rico Rodriguez – an undercover CIA operative specializing in regime change - as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it’s your job to negate the threat to world peace. It could be to your advantage that this tropical paradise is about to implode as various factions vie for power – it just needs a gentle nudge in the right direction. Just Cause offers the freedom to tackle your assignment however you want: play the island’s factions off against one another; incite a rebellion among the masses; or build alliances with rebel forces and drug cartels. The game world consists of 1,225 sq. miles of mountains, jungles, beaches, cities and villages which can be explored by land, sea and air. And you will have at your disposal a varied and exciting array of vehicles, planes and watercraft. [Eidos Interactive]… Expand"}, {"name": "Double Dragon Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/double-dragon-advance", "publisher": "Atlus Co.", "release_date": "Nov 14 2003", "developers": ["Million"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/56f89ec6a1a27ef78c03ba2b79b7b012-98.jpg", "descriptions": "After a global nuclear war leaves the world in ruins, gangs emerge as the new elite by seizing control of the city. Twin brothers Jimmy and Billy Lee survive the cataclysmic event with their martial arts abilities intact, but Billy's girlfriend is soon kidnapped by mysterious thugs. Now it'sAfter a global nuclear war leaves the world in ruins, gangs emerge as the new elite by seizing control of the city. Twin brothers Jimmy and Billy Lee survive the cataclysmic event with their martial arts abilities intact, but Billy's girlfriend is soon kidnapped by mysterious thugs. Now it's up to you to guide both brothers through different stages filled with enemies and boss characters. Whether you play solo or cooperatively with a friend, you must master new techniques and weapons to find the girl and defeat the bad guys.… Expand"}, {"name": "Borderlands 3: Moxxi's Heist of the Handsome Jackpot", "details_link": "https://www.metacritic.com/game/pc/borderlands-3-moxxis-heist-of-the-handsome-jackpot", "publisher": "Gearbox Publishing", "release_date": "Dec 19 2019", "developers": ["Gearbox Software"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/f25bf9f6d6ead91ae109648244c22ac3-98.jpg", "descriptions": "Moxxi's assembling a crew to plunder a derelict space station casino and you've proven yourself worthy of joining her ragtag team of \"experts.\" Successfully battle your way through Hyperion security forces and crazed casino-goers to reach a safe loaded with Eridium, cash, and all-new Legendary loot."}, {"name": "Pocket Rumble", "details_link": "https://www.metacritic.com/game/switch/pocket-rumble", "publisher": "Chucklefish", "release_date": "Jul  5 2018", "developers": ["Chucklefish", "Cardboard Robot Games"], "platforms": ["PC", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Fighting", "2D"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/5375da967a43ebaa87a40b139aa926ec-98.jpg", "descriptions": "Pocket Rumble retains all the gameplay elements that make traditional Street Fighter-style fighters great, but reduces the level of execution and memorization necessary to the bare minimum. That way experienced players can learn the game fast and be able to focus on deeper elements ofPocket Rumble retains all the gameplay elements that make traditional Street Fighter-style fighters great, but reduces the level of execution and memorization necessary to the bare minimum. That way experienced players can learn the game fast and be able to focus on deeper elements of strategy and mindgames, new players can learn the ins and outs of fighting games without being overwhelmed, and everyone can get their skills to a competitive level without too much grinding alone in training mode.Features:Simple, 2-button controls and universal, easy special move inputs with no complex joystick motions.Short combos with easy timing and a straightforward cancel system.On-screen frame data bar and visual indicators for properties like invulnerability help players understand fighting game mechanics and how individual moves work.Simple, unambiguous health and damage system: All characters have 12 HP and all hits do 1 damage.Diverse cast of characters each with their own unique meter and mechanics.Quickly swap characters after a lost round to counterpick, just like between matches in a tournament, without slowing down the pace of the match.Near-flawless online multiplayer with GGPO netcode.Play with any combination of Joy-Con and Nintendo Switch Pro Controller for multiplayer wherever you go.Offline Modes:Arcade: Face off against the rest of the game's cast back to back! Can you survive all 8 matches?Versus: Play local matches with friends or the CPU, and get competitive with hidden cursors for double-blind character select at the touch of a button.Career: Take part in fictional fighting game tournaments around the globe, playing against AIs based on some of Pocket Rumble's top players and eventually facing off against AIs from some familiar faces in the FGC.Lessons: Robust tutorials that teach you the very basics of how fighting games workTraining: A fully-featured training mode with a variety of hotkeys and options including viewable hitboxes, save states, dummy recording and more.Online Modes:Ranked: Get matched up with players of your skill level online, earn points and rank up with Elo ratings, leaderboards including character-specific rankings, and a rematch button to challenge someone to an unranked set when you need that runback.Unranked: Invite your friends to play unranked matches just for fun!… Expand"}, {"name": "Resident Evil: Revelations 2 - Episode 4: Metamorphosis", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-revelations-2---episode-4-metamorphosis", "publisher": "Capcom", "release_date": "Mar 17 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/2/346632da308bfb323ac739adafd4a2e3-98.jpg", "descriptions": "Resident Evil Revelations 2 - Episode 1 required; sold separately. Xbox Live free membership required. Xbox Live Gold membership required for multiplayer features. Episode Four: Metamorphosis Claire and Moira make for the tower's top floor and a final confrontation with the Overseer. WillResident Evil Revelations 2 - Episode 1 required; sold separately. Xbox Live free membership required. Xbox Live Gold membership required for multiplayer features. Episode Four: Metamorphosis Claire and Moira make for the tower's top floor and a final confrontation with the Overseer. Will they survive and escape the island? Meanwhile, having learned of his daughter's fate, Barry prepares for the final confrontation, to keep Natalia from harm and have his revenge. Two timelines collide in this nail-biting final chapter.\r*Additional Raid Mode characters and stages included.\r*Episode One required to play.… Expand"}, {"name": "Unmechanical: Extended Edition", "details_link": "https://www.metacritic.com/game/playstation-4/unmechanical-extended-edition", "publisher": "Grip Games", "release_date": "Feb 10 2015", "developers": ["Grip Games"], "platforms": ["PlayStation 3", "Xbox One", "PlayStation 4"], "genres": ["Action", "Puzzle", "General", "Platformer", "2D"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/daa0ffb1089a7465736a75ab187ac9d1-98.jpg", "descriptions": "Explore the non-linear levels at your own pace, many of which will require some out-of-the-box thinking and the process of trying to find the solution is just as important as progressing the story."}, {"name": "Observation", "details_link": "https://www.metacritic.com/game/playstation-4/observation", "publisher": "Devolver Digital", "release_date": "May 21 2019", "developers": ["No Code"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/ac51f8a471ff399a4141fa72be8f279e-98.jpg", "descriptions": "Observation is a sci-fi thriller uncovering what happened to Dr. Emma Fisher, and the crew of her mission, through the lens of the station’s artificial intelligence S.A.M. Players assume the role of S.A.M. by operating the station’s control systems, cameras, and tools to assist Emma inObservation is a sci-fi thriller uncovering what happened to Dr. Emma Fisher, and the crew of her mission, through the lens of the station’s artificial intelligence S.A.M. Players assume the role of S.A.M. by operating the station’s control systems, cameras, and tools to assist Emma in discovering what is happening to the station, the vanished crew, and S.A.M. himself.… Expand"}, {"name": "Doraemon: Story of Seasons", "details_link": "https://www.metacritic.com/game/switch/doraemon-story-of-seasons", "publisher": "Bandai Namco Games", "release_date": "Oct 11 2019", "developers": ["Brownies"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "General", "Management", "Business / Tycoon"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/9779c3844665acd050169e1170d0b8ca-98.jpg", "descriptions": "Doraemon, the endearing cat-type robot that captured the hearts of millions worldwide, arrives for another adventure in ‘Doraemon Story of Seasons’! Dive into a new world that combines relaxing gameplay with a story of farming, friendship and helping others. Grab a shovel and join the fun."}, {"name": "Mass Effect 3: Leviathan", "details_link": "https://www.metacritic.com/game/pc/mass-effect-3-leviathan", "publisher": "Electronic Arts", "release_date": "Aug 28 2012", "developers": ["BioWare"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/6c63b44cf22902eae042ad611090e89b-98.jpg", "descriptions": "Mass Effect 3: Leviathan is a story-driven single player DLC where players are thrust into the darkest corner of space to hunt a mysterious being rumored to be powerful enough to destroy a Reaper."}, {"name": "Symphony", "details_link": "https://www.metacritic.com/game/pc/symphony", "publisher": "Empty Clip Studios", "release_date": "Aug  6 2012", "developers": ["Empty Clip Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/129b31fb69d55e5ccfbf33fc2cedf4ff-98.jpg", "descriptions": "Your music is under attack, you must liberate it! \r\rA mysterious entity is absorbing and corrupting your music before your very eyes. You must battle through your own song collection, discover items, customize your ship and fight boss enemies to liberate the Symphony of Souls and reclaimYour music is under attack, you must liberate it! \r\rA mysterious entity is absorbing and corrupting your music before your very eyes. You must battle through your own song collection, discover items, customize your ship and fight boss enemies to liberate the Symphony of Souls and reclaim your music!...… Expand"}, {"name": "Iron Harvest", "details_link": "https://www.metacritic.com/game/pc/iron-harvest", "publisher": "Deep Silver", "release_date": "Sep  1 2020", "developers": ["KING Art"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Command"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/0d34a589605a38a73b359b3057634f30-98.jpg", "descriptions": "Iron Harvest is a real-time strategy game (RTS) set in the alternate reality of 1920+, just after the end of the Great War. The Game lets you control giant dieselpunk mechs, combining epic singleplayer and coop campaigns as well as skirmishes with intense action on the battlefield forIron Harvest is a real-time strategy game (RTS) set in the alternate reality of 1920+, just after the end of the Great War. The Game lets you control giant dieselpunk mechs, combining epic singleplayer and coop campaigns as well as skirmishes with intense action on the battlefield for multiplayer fans, Iron Harvest is the classic real-time strategy games fans have been waiting for.\r Tradition clashes with scientific and technological progress, while Europe is still recovering from the brutal battles of the World War. Cities are being rebuilt and in the countryside, the era of the Iron Harvest has begun. Farmers are uncovering the remains of the majestic walking machines that had fought on the battlefields of the Great War.\r In the midst of this chaos, a new threat appears that will put Europe's very existence at risk. Secret forces are putting everything they can towards destabilization of entire countries, determined to set the world on fire once again and finally seize control.… Expand"}, {"name": "Black Future '88", "details_link": "https://www.metacritic.com/game/switch/black-future-88", "publisher": "Good Shepherd Entertainment", "release_date": "Nov 21 2019", "developers": ["SuperScarySnakes"], "platforms": ["PC", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/edf27fa00a11f01efb3284bd24f04beb-98.jpg", "descriptions": "Black Future ’88 is a Synth-Punk roguelike 2D action Shooter. Vertically climb an always evolving procedural tower to reach the top and kill its insane owner…before your heart explodes. Shoot, slash, dash and upgrade yourself to survive the endless waves of deadly traps, homicidal AI andBlack Future ’88 is a Synth-Punk roguelike 2D action Shooter. Vertically climb an always evolving procedural tower to reach the top and kill its insane owner…before your heart explodes. Shoot, slash, dash and upgrade yourself to survive the endless waves of deadly traps, homicidal AI and colossal Wardens standing in your way in a stylish alternative version of 1988.… Expand"}, {"name": "Beyond A Steel Sky", "details_link": "https://www.metacritic.com/game/playstation-5/beyond-a-steel-sky", "publisher": "Microids", "release_date": "Dec 14 2021", "developers": ["Revolution Software"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action Adventure", "Adventure", "3D", "Open-World", "Third-Person"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/56cc5dc373d7e28670c14e05020dacf1-98.jpg", "descriptions": "You are Robert Foster. A child has been abducted in a brutal attack. You have vowed to bring him home. The trail has led you to Union City, one of the last remaining mega-cities in a world ravaged by shattering wars, and political meltdown.Union City is a utopia, its people loving lifeYou are Robert Foster. A child has been abducted in a brutal attack. You have vowed to bring him home. The trail has led you to Union City, one of the last remaining mega-cities in a world ravaged by shattering wars, and political meltdown.Union City is a utopia, its people loving life under the control of an altruistic AI: ever-attentive androids, designer living, piazzas and bars. What's not to love? But this City has a dark underbelly...From multi-award winning Revolution comes 'Beyond a Steel Sky', a groundbreaking 3D adventure thriller, set in an AI-driven future. Subvert the world, hack the systems and solve dark conspiracies to uncover the devastating truth.… Expand"}, {"name": "Bleed", "details_link": "https://www.metacritic.com/game/switch/bleed", "publisher": "Digerati Distribution", "release_date": "Dec 14 2017", "developers": ["BootdiskRevolution"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/4926636360d436651e20b966b4967d0e-98.jpg", "descriptions": "Wryn is a girl with a big arsenal and big dreams -- she wants to be the ultimate videogame hero! Help her take down the Greatest Heroes of All Time in an action-packed bid to claim the title for herself and show the world what a true hero looks like!\r Bleed is an action-platformer focusedWryn is a girl with a big arsenal and big dreams -- she wants to be the ultimate videogame hero! Help her take down the Greatest Heroes of All Time in an action-packed bid to claim the title for herself and show the world what a true hero looks like!\r Bleed is an action-platformer focused on stylish, acrobatic dodging and fluid, challenging gameplay. There's no filler -- just you and your skills against seven levels of enemies, obstacles, breakneck set-pieces and inventive bosses!… Expand"}, {"name": "Ironcast", "details_link": "https://www.metacritic.com/game/pc/ironcast", "publisher": "Ripstone", "release_date": "Mar 26 2015", "developers": ["Dreadbit"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Matching"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/4fec885078d3294f5fd5293fe5640080-98.jpg", "descriptions": "Puzzlequest meets FTL in this Steampunk Victorian era roguelite."}, {"name": "Samurai Jack: Battle Through Time", "details_link": "https://www.metacritic.com/game/xbox-one/samurai-jack-battle-through-time", "publisher": "Adult Swim", "release_date": "Aug 21 2020", "developers": ["Soleil", "Soleil Ltd."], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/13975b7215099526f4f5df81197b74d8-98.jpg", "descriptions": "Become Samurai Jack, the greatest warrior of the past, present and future. Journey through time to finally stop Aku’s evil reign in this new adventure told by the creators of Samurai Jack. Encounter your favorite characters from the show including The Scotsman, Scaramouche, Sir Rothchild and more."}, {"name": "Pac-Man Museum+", "details_link": "https://www.metacritic.com/game/switch/pac-man-museum+", "publisher": "Bandai Namco Games", "release_date": "May 27 2022", "developers": ["Now Production", "Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/6665331e3767c389d7dfc31047cc14f6-98.jpg", "descriptions": "PAC-MAN MUSEUM+ presents a unique curated collection of classic and modern PAC-MAN games from the over 40-year history of the storied iconic videogame character’s library. Fans and enthusiasts will be able to enjoy the iconic original arcade classic alongside more modern frenetic titles,PAC-MAN MUSEUM+ presents a unique curated collection of classic and modern PAC-MAN games from the over 40-year history of the storied iconic videogame character’s library. Fans and enthusiasts will be able to enjoy the iconic original arcade classic alongside more modern frenetic titles, including PAC-MAN BATTLE ROYALE, PAC-MAN 256, and more!\r *Featured Games in PAC-MAN MUSEUM+, include:\r PAC-MAN\rSUPER PAC-MAN\rPAC & PAL\rPAC-LAND\rPAC-MANIA\rPAC-ATTACK\rPAC-IN-TIME\rPAC-MAN ARRANGEMENT Arcade ver.\rPAC-MAN ARRANGEMENT CS ver.\rPAC-MAN CHAMPIONSHIP EDITION\rPAC Motos\rPAC’N ROLL REMIX\rPAC-MAN BATTLE ROYALE\rPAC-MAN 256… Expand"}, {"name": "Demon Turf", "details_link": "https://www.metacritic.com/game/playstation-5/demon-turf", "publisher": "Playtonic Friends", "release_date": "Nov  4 2021", "developers": ["Fabraz"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "genres": ["Action", "Platformer", "3D"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/28ec64831f1f591d4f8ce6487e4ecb75-98.jpg", "descriptions": "The Demon World is inhabited by all kinds of nasties... Most of them lumped into gangs battling for dominion, each led by its own head honcho. Yet even these bad dudes are no match for the Demon King himself! Instead, the task falls to Beebz, a young demon barely a thousand years old, whoThe Demon World is inhabited by all kinds of nasties... Most of them lumped into gangs battling for dominion, each led by its own head honcho. Yet even these bad dudes are no match for the Demon King himself! Instead, the task falls to Beebz, a young demon barely a thousand years old, who decides it’s time for her to kick every turf leader’s butt and become the Demon Queen herself.… Expand"}, {"name": "Black Book", "details_link": "https://www.metacritic.com/game/pc/black-book", "publisher": "HypeTrain Digital", "release_date": "Aug 10 2021", "developers": ["Morteshka"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/124e9f8529d30ba0d3b51ec5dca773db-98.jpg", "descriptions": "A fusion of card-based RPGs and Adventure games, \"Black Book\" is a haunting tale of a young sorceress, who gave her life to serve the dark forces. Dive into the cold, yet alluring world of Russian folktales - and uncover the secrets that hide in the darkness.A young girl named Vasilisa,A fusion of card-based RPGs and Adventure games, \"Black Book\" is a haunting tale of a young sorceress, who gave her life to serve the dark forces. Dive into the cold, yet alluring world of Russian folktales - and uncover the secrets that hide in the darkness.A young girl named Vasilisa, destined to become a witch, decides to throw her fate away and marry her beloved - but that dream is shattered when her betrothed dies under mysterious circumstances. Aching for her lost love, Vasilisa seeks out Black Book - a demonic artifact, said to be powerful enough to grant any wish to the one who uncovers all 7 of its seals. Join Vasilisa in her adventures across Russian countryside, as she solves the woes of common folk by confronting demons and performing exorcisms.… Expand"}, {"name": "Disney Classic Games: Aladdin and the Lion King", "details_link": "https://www.metacritic.com/game/switch/disney-classic-games-aladdin-and-the-lion-king", "publisher": "Nighthawk Interactive", "release_date": "Oct 29 2019", "developers": ["Digital Eclipse"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/0e45e3cc614089596ceddb5dde9ada78-98.jpg", "descriptions": "2 of the most beloved Disney games of all time make their long-awaited return to modern consoles in Disney Classic Games: Aladdinand The Lion King. This package of Disney classics is filled with plenty of new features, enhancements, game modes, and display options, plus multiple versions of2 of the most beloved Disney games of all time make their long-awaited return to modern consoles in Disney Classic Games: Aladdinand The Lion King. This package of Disney classics is filled with plenty of new features, enhancements, game modes, and display options, plus multiple versions of the games.… Expand"}, {"name": "The Flame in the Flood", "details_link": "https://www.metacritic.com/game/switch/the-flame-in-the-flood", "publisher": "Curve Digital", "release_date": "Oct 12 2017", "developers": ["The Molasses Flood"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/dad9f5bbcf10f7cec62d8a974d45f2d5-98.jpg", "descriptions": "A rogue-lite river journey through the backwaters of a forgotten post-societal America. Forage, craft, evade predators!\r From the Art Director of BioShock and a team of veterans of the BioShock, Halo, Guitar Hero and Rock Band series comes The Flame in the Flood. Travel by foot and by raftA rogue-lite river journey through the backwaters of a forgotten post-societal America. Forage, craft, evade predators!\r From the Art Director of BioShock and a team of veterans of the BioShock, Halo, Guitar Hero and Rock Band series comes The Flame in the Flood. Travel by foot and by raft down a procedurally-generated river as you scrounge for resources, craft tools, remedy afflictions, evade the vicious wildlife, and most importantly, stay ahead of  the coming rains.\r Featuring an original full length soundtrack by acclaimed Alt-Country rocker Chuck Ragan featuring The Camaraderie, The Fearless Kin and other special guests.… Expand"}, {"name": "Attack on Titan 2: Final Battle", "details_link": "https://www.metacritic.com/game/playstation-4/attack-on-titan-2-final-battle", "publisher": "Koei Tecmo Games", "release_date": "Jul  5 2019", "developers": ["Omega Force"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Action Adventure", "General"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/b6f93c3f321558864ac28ee2729b9967-98.jpg", "descriptions": "Battle through the gripping narrative of Season 1 and 2 of the anime from a new perspective! Players can also enjoy original stories supervised by series creator Hajime Isayama."}, {"name": "Gremlins, Inc.", "details_link": "https://www.metacritic.com/game/pc/gremlins-inc", "publisher": "Yukitama Creative Industries", "release_date": "Mar 11 2016", "developers": ["Yukitama Creative Industries"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 75, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/9b72d3793603e2e5e52cabf672a8c691-98.jpg", "descriptions": "Gremlins, Inc. is an intense strategy board game in a steampunk world of corrupt capitalist gremlins who compete for money, political power and prestige. Steal resources, extort bribes, manipulate elections, arrest other players and send them telegrams of misfortune… Unleash your inner gremlin!"}, {"name": "Assault Heroes 2", "details_link": "https://www.metacritic.com/game/xbox-360/assault-heroes-2", "publisher": "Sierra Online", "release_date": "May 14 2008", "developers": ["Wanako Studios"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 75, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/7/72e259255a81362101b98538354f7800-98.jpg", "descriptions": "[Xbox Live Arcade]  The sequel to the award-winning Xbox Live action extravaganza, Assault Heroes 2 continues to ramp up the excitement. Your original enemy was just a pawn of a more sinister alien force, and now you must fight on both land and in space to overcome this new threat. Fight[Xbox Live Arcade]  The sequel to the award-winning Xbox Live action extravaganza, Assault Heroes 2 continues to ramp up the excitement. Your original enemy was just a pawn of a more sinister alien force, and now you must fight on both land and in space to overcome this new threat. Fight alone or work with a friend in the enhanced two-player cooperative mode. Employ bigger and stronger weapons and enjoy a more intense on-foot combat experience. Battle through the extensive and intense levels in your trusty 4x4, or hijack enemy vehicles for even greater firepower. Take on even more relentless enemies and face-off with the most outrageous bosses you have ever seen on your way to the climactic battles in outer space. [Microsoft]… Expand"}, {"name": "Super Mario Bros. 35", "details_link": "https://www.metacritic.com/game/switch/super-mario-bros-35", "publisher": "Nintendo", "release_date": "Oct  1 2020", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "Up to 36 ", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/4d8d70c3a3dfd3f1dd86ce1b023e4ff2-98.jpg", "descriptions": "Super Mario Bros. with a 35-player twist. Race against time, defeat enemies, and sabotage your opponents in an online battle to be the last Mario standing.  Classic Super Mario Bros. gameplay gets an adrenaline boost. Each player is given the same timed stage, but you must defeat enemies toSuper Mario Bros. with a 35-player twist. Race against time, defeat enemies, and sabotage your opponents in an online battle to be the last Mario standing.  Classic Super Mario Bros. gameplay gets an adrenaline boost. Each player is given the same timed stage, but you must defeat enemies to earn extra time and attack your opponents. Don’t forget to pick up some coins on your way—they can be used to get in-game items like power-ups. With speed, skill, and strategy, you could be the last Mario standing.\r … Expand"}, {"name": "Phantom: Covert Ops", "details_link": "https://www.metacritic.com/game/pc/phantom-covert-ops", "publisher": "nDreams", "release_date": "Jun 23 2020", "developers": ["nDreams"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/78f2f00d80a55079afce42e245248f94-98.jpg", "descriptions": "[Requires Oculus Quest] WARFARE HAS EVOLVED. You are a Phantom: an elite covert operative with one night to prevent all-out war. Dispatched into hostile wetlands in your military kayak, utilise weapons and equipment to neutralise the enemy threat. Engage targets lethally or infiltrate[Requires Oculus Quest] WARFARE HAS EVOLVED. You are a Phantom: an elite covert operative with one night to prevent all-out war. Dispatched into hostile wetlands in your military kayak, utilise weapons and equipment to neutralise the enemy threat. Engage targets lethally or infiltrate unnoticed from the shadows. This is stealth action redefined. DEADLIER ON WATER. Discover innovative VR traversal using your military kayak to freely and stealthily move across the water. BECOME A PHANTOM. Experience the tension and thrill of becoming a lethal military asset – everything is 1:1, delivering a new level of VR immersion.… Expand"}, {"name": "Hydro Thunder Hurricane", "details_link": "https://www.metacritic.com/game/xbox-360/hydro-thunder-hurricane", "publisher": "Microsoft Game Studios", "release_date": "Jul 28 2010", "developers": ["Vector Unit Inc.", "Vector Unit"], "platforms": ["PC", "Xbox 360"], "genres": ["Driving", "Racing", "Arcade", "Snow / Water", "Other", "Snow / Water"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/3426d3b19b07a19692b00f1df5db28c0-98.jpg", "descriptions": "[Xbox Live Arcade]  Hydro Thunder Hurricane is the all new, full-featured sequel to the arcade racer. Features rocket-powered speedboats blasting across amazing dynamic water, gorgeous visuals, and interactive environments packed with shortcuts and surprises. Pit your rocket powered[Xbox Live Arcade]  Hydro Thunder Hurricane is the all new, full-featured sequel to the arcade racer. Features rocket-powered speedboats blasting across amazing dynamic water, gorgeous visuals, and interactive environments packed with shortcuts and surprises. Pit your rocket powered speedboat against 15 opponents in single-player races and championships. Hone your speedboat skills in the new Ring Master and Gauntlet modes. Dive into intense multiplayer races with up to eight players over Xbox LIVE, up to four players locally, or even mix local and online games. [Microsoft]… Expand"}, {"name": "The Stretchers", "details_link": "https://www.metacritic.com/game/switch/the-stretchers", "publisher": "Nintendo", "release_date": "Nov  8 2019", "developers": ["Tarsier Studios"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/6f5a0e26c12b74012bae76a4e459ae07-98.jpg", "descriptions": null}, {"name": "Broken Sword 5 - The Serpent's Curse", "details_link": "https://www.metacritic.com/game/switch/broken-sword-5---the-serpent39s-curse", "publisher": "Revolution Software", "release_date": "Sep 21 2018", "developers": ["Revolution Software", "Ravenscourt"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/c476bbcfe2335b76e4d60e3043813402-98.jpg", "descriptions": "Paris in the spring. Shots ring out from a gallery.\r A robbery... a murder... and the beginning of another epic Broken Sword adventure.\r\n\r\nFrom multi-award winning Revolution comes the latest mystery in this much loved adventure-puzzle series.\r\n\r\nPlaying as intrepid American GeorgeParis in the spring. Shots ring out from a gallery.\r A robbery... a murder... and the beginning of another epic Broken Sword adventure.\r From multi-award winning Revolution comes the latest mystery in this much loved adventure-puzzle series.\r Playing as intrepid American George Stobbart and sassy French journalist Nico Collard, you find yourself on the trail of a stolen painting - and a murderous conspiracy. A conspiracy whose roots lie in mysteries older than the written word...… Expand"}, {"name": "Sorcerer King", "details_link": "https://www.metacritic.com/game/pc/sorcerer-king", "publisher": "Stardock", "release_date": "Jul 16 2015", "developers": ["Stardock"], "platforms": "PC", "genres": ["Strategy", "General"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/3876895ce3c785df48f0a125d98b3894-98.jpg", "descriptions": "Your Kingdom is the final hope against the malevolent Sorcerer King's quest to become a god and destroy the world in this asymmetrical 4X fantasy strategy title."}, {"name": "Swords & Soldiers II", "details_link": "https://www.metacritic.com/game/wii-u/swords-soldiers-ii", "publisher": "Ronimo Games", "release_date": "May 21 2015", "developers": ["Ronimo Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U"], "genres": ["Strategy", "General"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/8765fa5574a23a2f7bb0781cc35f3db2-98.jpg", "descriptions": "Command your troops against fiendish foes in colourful 2D strategy romp, Swords & Soldiers II, on Wii U. While ever-hungry Viking chieftain, Redbeard, is locked in combat with his old nemesis, Blackbeard, two fiendish factions arrive to create a fresh twist to the proceedings. Enter theCommand your troops against fiendish foes in colourful 2D strategy romp, Swords & Soldiers II, on Wii U. While ever-hungry Viking chieftain, Redbeard, is locked in combat with his old nemesis, Blackbeard, two fiendish factions arrive to create a fresh twist to the proceedings. Enter the Demons and the Persians. Use real-time tactics to command your troops on a 2D battleground, and save the world from these marauders.… Expand"}, {"name": "The Eye of Judgment", "details_link": "https://www.metacritic.com/game/playstation-3/the-eye-of-judgment", "publisher": "SCEA", "release_date": "Oct 24 2007", "developers": ["SCEJ"], "platforms": "PlayStation 3", "num_players": "2  Online", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/7b7c792e31a04457efd26d6d91a7af06-98.jpg", "descriptions": "The Eye of Judgment presents a new style of gameplay where the player brings characters/monsters of fantasy trading cards to life for battle in 3D. Through use of a 3' x 3' board and trading cards - each encrypted with \"cybercode\", players conquer the field by selecting a card and placingThe Eye of Judgment presents a new style of gameplay where the player brings characters/monsters of fantasy trading cards to life for battle in 3D. Through use of a 3' x 3' board and trading cards - each encrypted with \"cybercode\", players conquer the field by selecting a card and placing the \"cybercode\" in front of the next generation camera for their respective character to come to life and battle. Each character has various skillsets, which will determine the outcome of the battle. Players take turns to place cards as they jostle for control of the board; the winner is the first player to capture five of the nine squares. The Eye of Judgment presents the player with more than 30 cards, as well as unique online and offline gameplay. [SCEJ]… Expand"}, {"name": "Madden NFL 06", "details_link": "https://www.metacritic.com/game/psp/madden-nfl-06", "publisher": "EA Sports", "release_date": "Sep 20 2005", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PSP"], "num_players": "4  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/ab4f37915cdee16540c80e78baafba3f-98.jpg", "descriptions": "For 16 years, Madden NFL football has been the definitive gridiron video game experience. Here's the next one for your portable buddy."}, {"name": "Drakensang: The Dark Eye", "details_link": "https://www.metacritic.com/game/pc/drakensang-the-dark-eye", "publisher": "THQ", "release_date": "Feb 23 2009", "developers": ["Radon Labs"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/4/6ec640ed128629700d650785e66a031c-98.jpg", "descriptions": "In the legendary continent of heroes, adventure and mysteries, something is on the move. And it’s an event which role players have been eagerly awaiting ever since the Nordland Trilogy.With \"Aventuria: Drakensang\", dtp and Radon Labs are once again bringing Aventuria to the monitors of theIn the legendary continent of heroes, adventure and mysteries, something is on the move. And it’s an event which role players have been eagerly awaiting ever since the Nordland Trilogy.With \"Aventuria: Drakensang\", dtp and Radon Labs are once again bringing Aventuria to the monitors of the role-playing community.Welcome to Aventuria, welcome to a new adventure! The story centres around Ferdok, an important trading city on the Great River.\rThe feared female lancers of Ferdok and Ferdok’s famous beer have given the city a reputation throughout the continent and the humans here live in harmony with the dwarves.But despite the cheerful and peaceful atmosphere, the peace is now being shaken by a mysterious series of murders.\rSinister figures are pursuing their dark schemes, while the fear among the population grows with every new murder.And while the adventures are still pondering whether the crimes are connected to the proclamation made by the Church of Hesinde on the tenth anniversary of the Dragonquest, they themselves are dragged into the mysterious events by a very particular murder. [Radon Labs]… Expand"}, {"name": "LEGO Star Wars III: The Clone Wars", "details_link": "https://www.metacritic.com/game/xbox-360/lego-star-wars-iii-the-clone-wars", "publisher": "LucasArts", "release_date": "Mar 22 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/30ab350974b7c573a0593b16bf3ac975-98.jpg", "descriptions": "LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes,LEGO Star Wars III: The Clone Wars will include all the characters from both seasons of the hugely popular animated television series, Star Wars: The Clone Wars, as well as some fan-favorite characters from the beloved theatrical Star Wars Saga. The game will feature brand new battle modes, giving players unique, head-to-head combat and an upgraded level builder, allowing the creation of customized bases and in-game battlefields. Play either as a Jedi or Separatist with all-new character abilities, such as Squad command, Lightsaber slicing, Lightsaber jumps, long distance Jedi attacks and Grapple Tie-Ups, all within a new, easy-to-navigate hub.… Expand"}, {"name": "Gun", "details_link": "https://www.metacritic.com/game/xbox-360/gun", "publisher": "Activision", "release_date": "Nov 16 2005", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "General", "Historic", "Open-World"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/14baf3ce6a0f6e551e723412dcf43c2f-98.jpg", "descriptions": "Set in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown againstSet in the untamed West of the late-1800s, GUN is a free-roaming action-adventure game that takes players to a world without laws where greed, lust and murder are rampant. As Colton White, a vengeful gunslinger, players must straddle the line between good and evil as they showdown against corrupt lawmen, a murderous preacher, renegade army psychopaths, merciless outlaws and unforgiving Native Americans, while waging war on horseback, collecting bounties, and commandeering trains. Players travel through an action-packed landscape of high mountain wilderness, deserts and bustling territorial towns in an epic story of betrayal, greed, and revenge. Multiple gameplay styles include: strategic gunplay and precision shooting, stealth tactics, and use of explosives. Embark on numerous side missions to master gun slinging and horse riding. Players can unlock secret weapons and upgrade skills and abilities to improve their weapon and equipment performance. [Activision]… Expand"}, {"name": "X-Men Origins: Wolverine", "details_link": "https://www.metacritic.com/game/xbox-360/x-men-origins-wolverine", "publisher": "Activision", "release_date": "May  1 2009", "developers": ["Raven Software"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/e2f336a9cf20bcdd618c66b580d0bcfa-98.jpg", "descriptions": "Unleash the razor sharp adamantium claws, feral instincts, and mutant regeneration powers of the world's fiercest Super Hero - Wolverine - and uncage the story of how the ultimate weapon was created. The team at Raven Software has dedicated Wolverine's development to unstoppable,Unleash the razor sharp adamantium claws, feral instincts, and mutant regeneration powers of the world's fiercest Super Hero - Wolverine - and uncage the story of how the ultimate weapon was created. The team at Raven Software has dedicated Wolverine's development to unstoppable, true-to-character authenticity. Take on impossible odds and exact revenge. [Activision]… Expand"}, {"name": "Evil West", "details_link": "https://www.metacritic.com/game/xbox-series-x/evil-west", "publisher": "Focus Home Interactive", "release_date": "Nov 22 2022", "developers": ["Flying Wild Hog"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "2 ", "genres": ["Action", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/3edec074208f9b979c0200c52d36deab-98.jpg", "descriptions": "A dark menace consumes the Old West. In solo or coop, fight with style in visceral, explosive combat against bloodthirsty monstrosities. Eradicate the vampiric hordes with your lightning-fueled gauntlet and become a Wild West Superhero."}, {"name": "Mundaun", "details_link": "https://www.metacritic.com/game/playstation-4/mundaun", "publisher": "MWM Interactive", "release_date": "Mar 16 2021", "developers": ["Hidden Fields"], "platforms": ["PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/80f7c8ae5542b232703eb9fb2204a826-98.jpg", "descriptions": "After learning of his grandfathers mysterious death in a fire, the protagonist travels to Mundaun for the first time since childhood. He will soon discover that something old and diabolical is haunting the remaining inhabitants. The quest to find out the meaning behind these sinister eventsAfter learning of his grandfathers mysterious death in a fire, the protagonist travels to Mundaun for the first time since childhood. He will soon discover that something old and diabolical is haunting the remaining inhabitants. The quest to find out the meaning behind these sinister events takes the player on an odyssey up Mundaun mountain: From steep meadows across stony fields and to the snow-covered peak. Mundaun is a lovingly hand-pencilled horror tale set in a dark, secluded valley of the alps. Explore various areas full of secrets to discover, survive hostile encounters, drive vehicles, fill your inventory and solve a variety of hand-crafted puzzles.… Expand"}, {"name": "Carrion", "details_link": "https://www.metacritic.com/game/pc/carrion", "publisher": "Devolver Digital", "release_date": "Jul 23 2020", "developers": ["Phobia Game Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/44081863ec417faf083f9928ac9adc40-98.jpg", "descriptions": "In Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities onIn Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities on the path to retribution that include a web-like ranged attack, the ability to bend light to become temporarily invisible, and even possess humans for maximum terror.… Expand"}, {"name": "Ion Fury", "details_link": "https://www.metacritic.com/game/playstation-4/ion-fury", "publisher": "1C Entertainment", "release_date": "May 14 2020", "developers": ["3D Realms", "Voidpoint", "LLC"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/ae7e528ecfc9f96d58138e89f4f51cc3-98.jpg", "descriptions": "Tear through cyborg infantry, giant robots and even wendigos with eight retro-inspired weapons. Dual-wield Penetrator SMGs with incendiary ammunition to scorch foes, wreak havoc with the Disperser with either shotgun shells or swap in grenade rounds, or chuck a Clusterpuck into a room andTear through cyborg infantry, giant robots and even wendigos with eight retro-inspired weapons. Dual-wield Penetrator SMGs with incendiary ammunition to scorch foes, wreak havoc with the Disperser with either shotgun shells or swap in grenade rounds, or chuck a Clusterpuck into a room and delete everyone. Utilizing the same Build engine behind the original Duke Nukem 3D, Ion Fury offers the beloved feel of ‘90s shooters. Seamlessly integrated modern features include headshots, environmental interaction, improved physics, auto-saves, and widescreen functionality. Ion Fury’s marriage of both styles provides both a genuine introduction to classic FPS games and a worthy addition to the genre as a whole, as evidenced by winning IndieDB’s game of the year award.… Expand"}, {"name": "VirtuaVerse", "details_link": "https://www.metacritic.com/game/pc/virtuaverse", "publisher": "Blood Music", "release_date": "May 12 2020", "developers": ["Theta Division"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/ba0a58fdc24f657addd3a17642e1f979-98.jpg", "descriptions": "In a future not too far away, one Artificial Intelligence has prevailed over all other AIs and their governments. Nathan, an outsider still refusing to comply with the new system, makes a living off the grid as a smuggler of modded hardware and cracked software. Geared with his customIn a future not too far away, one Artificial Intelligence has prevailed over all other AIs and their governments. Nathan, an outsider still refusing to comply with the new system, makes a living off the grid as a smuggler of modded hardware and cracked software. Geared with his custom headset, he is among the few that can still switch AVR off and see reality for what truly is.He shares an apartment in the city with his girlfriend Jay, a talented AVR graffiti writer whose drones have been bit-spraying techno-color all over the augmented space in the city.Waking up one morning, Nathan discovers that Jay disappeared overnight, but not before leaving a cryptic message on their bathroom mirror. Having accidentally broken his custom headset, Nathan is now disconnected and determined to find out what happened to Jay, but he soon finds himself tangled up in an unexpected journey involving Jay's hacker group and a guild of AVR technomancers. VirtuaVerse is a challenging old school cyberpunk point & click adventure set in a future not so far away narrating tales of technomancers, AVR graffiti writers, hacker groups, tribes of cryptoshamans, digital archeology, epic cyberwars and virtual reality debauchery.… Expand"}, {"name": "Overland", "details_link": "https://www.metacritic.com/game/switch/overland", "publisher": "Finji", "release_date": "Sep 19 2019", "developers": ["Finji"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/9de9ea0be3c94f1cc97da2fb59ebd4ba-98.jpg", "descriptions": "Lead a group of desperate survivors across a desolate wasteland and discover new stories in this tactical, squad-based roguelike."}, {"name": "The Gardens Between", "details_link": "https://www.metacritic.com/game/playstation-4/the-gardens-between", "publisher": "The Voxel Agents", "release_date": "Sep 20 2018", "developers": ["The Voxel Agents"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/888f369101f898b434484818b2e24438-98.jpg", "descriptions": "The Gardens Between is a surreal puzzle adventure that follows best friends, Arina and Frendt, as they fall into a mysterious world of beautiful garden islands. Manipulate time to solve puzzles and discover the secrets of each island."}, {"name": "Total War: Arena", "details_link": "https://www.metacritic.com/game/pc/total-war-arena", "publisher": "SegaSoft", "release_date": "Feb 22 2018", "developers": ["Creative Assembly"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Military", "Strategy", "Real-Time", "General"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/2b0ab6f228167770db3bea328e5cab77-98.jpg", "descriptions": "Total War: ARENA is a free-to-play, team-based strategy game where players step into the boots of legendary heroes from the past to forge their legacy through combat. Built on years of Creative Assembly’s experience with the critically acclaimed Total War series, it takes the pillars ofTotal War: ARENA is a free-to-play, team-based strategy game where players step into the boots of legendary heroes from the past to forge their legacy through combat. Built on years of Creative Assembly’s experience with the critically acclaimed Total War series, it takes the pillars of strategy, intense, tactical combat, and dedication to history the series is famous for and distills it into epic, online combat for new and old fans alike.… Expand"}, {"name": "Life is Strange: Before the Storm - Episode 3: Hell is Empty", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-before-the-storm---episode-3-hell-is-empty", "publisher": "Square Enix", "release_date": "Dec 20 2017", "developers": ["Deck Nine Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/f43b8fbaec56cee2ef1836fcfa4ebe01-98.jpg", "descriptions": null}, {"name": "Reus", "details_link": "https://www.metacritic.com/game/playstation-4/reus", "publisher": "Soedesco", "release_date": "Oct 11 2016", "developers": ["BlitWorks", "Soedesco"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 75, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/6/dd9b485767c4994671da93d40c355e73-98.jpg", "descriptions": "In Reus, you control powerful giants that help you shape the planet to your will. You can create mountains and oceans, forests and more. Enrich your planet with plants, minerals and animal life. There is only one thing on the planet that you do not control: mankind, with all their virtuesIn Reus, you control powerful giants that help you shape the planet to your will. You can create mountains and oceans, forests and more. Enrich your planet with plants, minerals and animal life. There is only one thing on the planet that you do not control: mankind, with all their virtues and and all their vices. You can shape their world, but not their will. Provide for them and they may thrive. Give them too much, and their greed may gain the upper hand.… Expand"}, {"name": "Event[0]", "details_link": "https://www.metacritic.com/game/pc/event0", "publisher": "Ocelot Society", "release_date": "Sep 14 2016", "developers": ["Ocelot Society"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/f0c021c034e6e55a691720ec77e3fac3-98.jpg", "descriptions": "Event[0] is a sci-fi narrative exploration game where you build a relationship with a lonely spaceship computer to get home to Earth."}, {"name": "Tropico 5 Penultimate Edition", "details_link": "https://www.metacritic.com/game/xbox-one/tropico-5-penultimate-edition", "publisher": "Kalypso", "release_date": "May 24 2016", "developers": ["Kalypso"], "platforms": "Xbox One", "genres": ["Strategy", "Management", "Government"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/1ba343d6bf9f6dfc6fcd2f2ee2ef2d02-98.jpg", "descriptions": "You, as El President, will first take control of the infamous island of Tropico during early colonial times and then guide it through the centuries as the world changes and moves ever forward. You must tackle the changing needs of your people, as well as opposing governments and factions,You, as El President, will first take control of the infamous island of Tropico during early colonial times and then guide it through the centuries as the world changes and moves ever forward. You must tackle the changing needs of your people, as well as opposing governments and factions, and thus lay the foundations for your own dynasty.… Expand"}, {"name": "Resident Evil: Revelations 2", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-revelations-2", "publisher": "Capcom", "release_date": "Mar 17 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Switch", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Horror", "Action Adventure", "Survival"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/8be1df2eb85cc642bebe5b8f56ea61ad-98.jpg", "descriptions": "In Revelations 2, Raid Mode begins with choosing a character, and there are several characters to match all tastes. After that, you'll customize your weapons and skills to prepare for deployment. Raid Mode has been about collecting loot such as weapons, custom parts, and currency; inIn Revelations 2, Raid Mode begins with choosing a character, and there are several characters to match all tastes. After that, you'll customize your weapons and skills to prepare for deployment. Raid Mode has been about collecting loot such as weapons, custom parts, and currency; in Revelations 2, you'll also find treasure chests thrown into the mix. Remember, however, your ultimate goal is to find and break the goal emblem at the end of each stage. Raid Mode allows for cooperative play -- including local two-player split-screen. Grab a friend and get ready to shoot your way through this additional mode. … Expand"}, {"name": "Guardians of Middle-Earth", "details_link": "https://www.metacritic.com/game/playstation-3/guardians-of-middle-earth", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Dec  4 2012", "developers": ["Monolith Productions"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Strategy", "General", "Real-Time", "MOBA", "MOBA"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/e668734bdedef34416bac7b03517732a-98.jpg", "descriptions": "Guardians of Middle-earth brings up to 10 players together in five versus five competitive multiplayer battle arenas in the epic setting of Middle-earth. The game offers more than 20 iconic guardians, including Gandalf, Sauron, Gollum, Thrain and many more, for players to control in playerGuardians of Middle-earth brings up to 10 players together in five versus five competitive multiplayer battle arenas in the epic setting of Middle-earth. The game offers more than 20 iconic guardians, including Gandalf, Sauron, Gollum, Thrain and many more, for players to control in player versus player (PVP) matches. Gamers will have the ability to connect with other players via an in-game voice communication system, as well as access to a comprehensive online stat and leader board system where they can track friends' victories and defeats, and more.… Expand"}, {"name": "NBA Jam", "details_link": "https://www.metacritic.com/game/xbox-360/nba-jam", "publisher": "EA Sports", "release_date": "Nov 15 2010", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Arcade", "Arcade"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/bbd4f06b0224694df661e128a1f1bfa7-98.jpg", "descriptions": "Featuring gameplay that is true to the original, NBA Jam will have players spinning with ankle breaking moves to the basket and on the way to high-flying, backboard-smashing dunks. In addition to the classic experience, EA Sports NBA Jam will also introduce new game modes, characters andFeaturing gameplay that is true to the original, NBA Jam will have players spinning with ankle breaking moves to the basket and on the way to high-flying, backboard-smashing dunks. In addition to the classic experience, EA Sports NBA Jam will also introduce new game modes, characters and gameplay depth.… Expand"}, {"name": "Spider-Man: Shattered Dimensions", "details_link": "https://www.metacritic.com/game/wii/spider-man-shattered-dimensions", "publisher": "Activision", "release_date": "Sep  7 2010", "developers": ["Beenox"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Adventure", "General", "Beat-'Em-Up", "Linear", "Fantasy", "Third-Person", "Fantasy", "3D"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/6923e312fee2bef29c9e077a9330ba6a-98.jpg", "descriptions": "Swing your way into action to help restore reality with your friendly neighborhood Spiderman."}, {"name": "Sol Survivor", "details_link": "https://www.metacritic.com/game/pc/sol-survivor", "publisher": "Cadenza", "release_date": "Mar 15 2010", "developers": ["Cadenza"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/c2453a188e2798320fadefb45692ef86-98.jpg", "descriptions": "Jump in to intense turret defense action with Sol Survivor! Build turrets to defend your colony and the innocent colonists within. Smash enemies with volleys of actively-controlled orbital support. Play with friends in co-operative and competitive multiplayer matches or test your mettleJump in to intense turret defense action with Sol Survivor! Build turrets to defend your colony and the innocent colonists within. Smash enemies with volleys of actively-controlled orbital support. Play with friends in co-operative and competitive multiplayer matches or test your mettle against our new Survival mode. [Cadenza]… Expand"}, {"name": "Ultimate Spider-Man", "details_link": "https://www.metacritic.com/game/pc/ultimate-spider-man", "publisher": "Activision", "release_date": "Sep 22 2005", "developers": ["Beenox"], "platforms": ["PlayStation 2", "PC"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "General", "Beat-'Em-Up", "Open-World"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/e7e9a922446eb0e3182f9b0f067053ab-98.jpg", "descriptions": "Play both sides as Ultimate Spider-Man allows players to take on the role of super hero Spider-Man AND super villain Venom. Penned and illustrated by famed comic book creators Brian Michael Bendis and Mark Bagley, the game picks up right where the story left off. Dive into an immersivePlay both sides as Ultimate Spider-Man allows players to take on the role of super hero Spider-Man AND super villain Venom. Penned and illustrated by famed comic book creators Brian Michael Bendis and Mark Bagley, the game picks up right where the story left off. Dive into an immersive adventure as you experience a living comic book illustrated with 3D Comic Inking Technology that literally brings the comic to life in every action-packed frame. The game's expanded, free-roaming environments deliver a deep adventure with a variety of challenging missions, diverse game play and an improved combat system that allows players to face off against the largest number of characters from the Spider-Man universe ever assembled in one video game. [Activision]… Expand"}, {"name": "Missing: Since January", "details_link": "https://www.metacritic.com/game/pc/missing-since-january", "publisher": "The Adventure Company", "release_date": "Jun 25 2004", "developers": ["Lexis Numerique"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/69fce32701d2c03b55089c25e1d9a706-98.jpg", "descriptions": "Journalist, Jack Lorski, and his companion disappear while investigating a string of gruesome murders. Soon after their disappearance, Jack's agency receives a disturbing CD-ROM containing footage he captured during his investigation. More than just a CD, this disc is in-fact the beginningJournalist, Jack Lorski, and his companion disappear while investigating a string of gruesome murders. Soon after their disappearance, Jack's agency receives a disturbing CD-ROM containing footage he captured during his investigation. More than just a CD, this disc is in-fact the beginning of a terrifying game with a maniacal killer known only as \"The Phoenix.\" Enter the mind of a serial killer and see if you can unravel the mystery behind the disappearance of a journalist and his companion and the recent ghastly murders. Missing offers an innovative blend of Windows® gameplay and the internet to immerse players in this elaborate game of cat-and-mouse. Receive actual e-mail from virtual characters and The Phoenix himself offering important clues. Visit a wealth of real websites and fictitious sites created solely for the game to obtain valuable information vital to solving the case. [Adventure Company]… Expand"}, {"name": "Prince of Persia: The Sands of Time", "details_link": "https://www.metacritic.com/game/game-boy-advance/prince-of-persia-the-sands-of-time", "publisher": "Ubisoft", "release_date": "Oct 30 2003", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/358ef10a4a143bb8d5bc19f7c39b57d0-98.jpg", "descriptions": "Embark on a journey of scorched sands and ancient legends.  A young prince, drawn to the dark powers of a magic dagger, unleashes a deadly evil upon a beautiful kingdom.  Guide the Prince on his quest to reverse the curse by using the Sands of Time, a power which allows you to erase theEmbark on a journey of scorched sands and ancient legends.  A young prince, drawn to the dark powers of a magic dagger, unleashes a deadly evil upon a beautiful kingdom.  Guide the Prince on his quest to reverse the curse by using the Sands of Time, a power which allows you to erase the past, see into the future and slow down the present.  Perform gravity-defying acrobatics and swashbuckling attacks in a staggering array of landscapes and kingdoms.  Restore peace to the land and fulfill your destiny.… Expand"}, {"name": "Magic: The Gathering Online", "details_link": "https://www.metacritic.com/game/pc/magic-the-gathering-online", "publisher": "Wizards of the Coast", "release_date": "Jun 14 2002", "developers": ["Leaping Lizard Software Inc."], "platforms": "PC", "num_players": "1-6 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 75, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/2/c2500cc93a7bac546b78491c14434ea8-98.jpg", "descriptions": "In the Magic Online game, you will be able to purchase digital cards and trade them with other players, build and customize your decks and organize your card collection right on the PC. A wide range of game rooms will allow players of different levels to find just the right environment forIn the Magic Online game, you will be able to purchase digital cards and trade them with other players, build and customize your decks and organize your card collection right on the PC. A wide range of game rooms will allow players of different levels to find just the right environment for them, from casual pick-up games to highly competitive tournaments. Players new to the Magic game will be able to observe games in the Casual Play room. Built-in tutorials and practice rooms will help get game-play under way quickly.… Expand"}, {"name": "Worms World Party", "details_link": "https://www.metacritic.com/game/pc/worms-world-party", "publisher": "Titus Software", "release_date": "Jun 16 2001", "developers": ["Team17"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "1-6 ", "genres": ["Strategy", "Turn-Based", "General", "Wargame", "General", "Fantasy", "Artillery"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/732600e26173b8a1f832e4e15ef90031-98.jpg", "descriptions": "\"Worms Armageddon\" freaks will find much of the same with this turn-based 2D strategy game sequel (or upgrade--you decide) in which you lead your team of cute little worms and annihilate the other teams with bazookas, uzis, cluster-bombs and other subtle weoponry."}, {"name": "Dead or Alive 5 Last Round", "details_link": "https://www.metacritic.com/game/playstation-4/dead-or-alive-5-last-round", "publisher": "Koei Tecmo Games", "release_date": "Feb 17 2015", "developers": ["Team Ninja"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/920cc53639ba8cee0e027caa84352625-98.jpg", "descriptions": "2 new playable characters join the fray to make 34 fighters - the largest roster in franchise history. Master the signature DOA fighting system through the textured story and tutorial modes, unlock more costumes than ever before in each of the offline training modes, and compete with the2 new playable characters join the fray to make 34 fighters - the largest roster in franchise history. Master the signature DOA fighting system through the textured story and tutorial modes, unlock more costumes than ever before in each of the offline training modes, and compete with the best fighters in the world in the online training modes. Fight as ninjas, assassins, roughnecks & wrestlers as you knock your opponents off an exotic waterfall, into an exploding oil rig and more.… Expand"}, {"name": "Evolve", "details_link": "https://www.metacritic.com/game/xbox-one/evolve", "publisher": "2K Games", "release_date": "Feb 10 2015", "developers": ["Turtle Rock Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 5 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 74, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/5/0fdcb5816d11d24a1e5c4b0cce470327-98.jpg", "descriptions": "In a savage world of man vs nature, are you the hunter or the hunted? The creators of Left 4 Dead, Turtle Rock Studios, bring you EVOLVE, the next-generation of multiplayer shooters where four hunters face-off against a single, player-controlled monster. Stalk your prey, execute your attackIn a savage world of man vs nature, are you the hunter or the hunted? The creators of Left 4 Dead, Turtle Rock Studios, bring you EVOLVE, the next-generation of multiplayer shooters where four hunters face-off against a single, player-controlled monster. Stalk your prey, execute your attack and prove you are the apex predator in adrenaline-pumping 4V1 matches.… Expand"}, {"name": "Sonic the Hedgehog 4: Episode I", "details_link": "https://www.metacritic.com/game/playstation-3/sonic-the-hedgehog-4-episode-i", "publisher": "Sega", "release_date": "Oct 12 2010", "developers": ["Dimps Corporation"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "General", "Platformer", "2D"], "meta_score": 74, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/461071a9cab6fe79b903047061209ee3-98.jpg", "descriptions": "Sonic is back for his fourth installment in the classic 2D series, revamped from the ground up."}, {"name": "Evoland 2: A Slight Case of Spacetime Continuum Disorder", "details_link": "https://www.metacritic.com/game/pc/evoland-2-a-slight-case-of-spacetime-continuum-disorder", "publisher": "Shiro Games", "release_date": "Aug 25 2015", "developers": ["Shiro Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/bd7afd4ce0be40edd8c5352c295d3ac4-98.jpg", "descriptions": "Evoland 2 is a very unique RPG, with its graphic style and gameplay changing as you progress through a deep storyline based on time travel."}, {"name": "Tokyo Xanadu", "details_link": "https://www.metacritic.com/game/playstation-vita/tokyo-xanadu", "publisher": "Aksys Games", "release_date": "Jun 30 2017", "developers": ["Falcom"], "platforms": "PlayStation Vita", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/a57b8985fc0ea1ca02f92becd9e1b03a-98.jpg", "descriptions": "Tokyo Xanadu a massive action RPG. When high school student Kou Tokisaka encounters the nightmare realm known as the Eclipse, his world is forever changed. Reality distorts as monsters threaten the safety of Morimiya City. Kou must transform his soul into a powerful weapon to defeat the vileTokyo Xanadu a massive action RPG. When high school student Kou Tokisaka encounters the nightmare realm known as the Eclipse, his world is forever changed. Reality distorts as monsters threaten the safety of Morimiya City. Kou must transform his soul into a powerful weapon to defeat the vile Eclipse once and for all. [Playstation.com]… Expand"}, {"name": "Batman: The Brave and the Bold - The Videogame", "details_link": "https://www.metacritic.com/game/ds/batman-the-brave-and-the-bold---the-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep  7 2010", "developers": ["WayForward"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Beat-'Em-Up", "2D"], "meta_score": 74, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/90729f205d0bb8e2d501e81c9696e18f-98.jpg", "descriptions": "Batman: The Brave and the Bold the Videogame fully immerses fans into the vivid animated world of the successful TV series where kids can play as Batman or together with family and friends in two-player co-op mode. Players can choose from iconic characters Robin, Green Lantern, Blue Beetle,Batman: The Brave and the Bold the Videogame fully immerses fans into the vivid animated world of the successful TV series where kids can play as Batman or together with family and friends in two-player co-op mode. Players can choose from iconic characters Robin, Green Lantern, Blue Beetle, along with drop-in heroes such as Aquaman to help solve puzzles and fight foes.… Expand"}, {"name": "Pato Box", "details_link": "https://www.metacritic.com/game/switch/pato-box", "publisher": "Bromio", "release_date": "Jul  9 2018", "developers": ["Bromio"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/51d77ddd89234da5bbbaabd0fb821076-98.jpg", "descriptions": "Pato Box is an adventure/fighting game inspired by the \"Punch-Out!!\" series. Is a surreal boxing quest with a luck! Test your reflexes as you fight your way through an evil corporation in search for retribution. Uncover their deepest secrets by exploring thrilling 3D environments with aPato Box is an adventure/fighting game inspired by the \"Punch-Out!!\" series. Is a surreal boxing quest with a luck! Test your reflexes as you fight your way through an evil corporation in search for retribution. Uncover their deepest secrets by exploring thrilling 3D environments with a graphic novel/comic book art style. Find the henchmen who took your dream away in an action-packed and fast-paced fights that will test you to the limit as a true boxing champion! Will you chicken out or learn how to DUCK?… Expand"}, {"name": "Anomaly 2", "details_link": "https://www.metacritic.com/game/playstation-4/anomaly-2", "publisher": "11 bit studios", "release_date": "Sep 16 2014", "developers": ["11 bit studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "General"], "meta_score": 74, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/e297d5d4f4a9a5fa8e123dacdfc7d1af-98.jpg", "descriptions": "In the years following the invasion of Earth in 2018, the planet is overrun by alien machines. Humankind is on the verge of extinction. Banded together in huge convoys, they search the frozen tundra for food and supplies. Since the war, the roles have been reversed: now our species seems toIn the years following the invasion of Earth in 2018, the planet is overrun by alien machines. Humankind is on the verge of extinction. Banded together in huge convoys, they search the frozen tundra for food and supplies. Since the war, the roles have been reversed: now our species seems to be the Anomaly on a machine-controlled planet. Your convoy, Commander, is called Yukon.… Expand"}, {"name": "Sundered", "details_link": "https://www.metacritic.com/game/pc/sundered", "publisher": "Thunder Lotus Games", "release_date": "Jul 28 2017", "developers": ["Thunder Lotus Games"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", ""], "meta_score": 74, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/0f5378145c9d0a1997cc33c50706d9dc-98.jpg", "descriptions": "Sundered is a horrifying fight for survival and sanity, a hand­-drawn epic from the ?creators of ?Jotun. You play Eshe, a wanderer in a ruined world, trapped in ever­?-?changing caverns teeming with eldritch horrors. Harness the power of corrupted relics to defeat gigantic bosses, at theSundered is a horrifying fight for survival and sanity, a hand­-drawn epic from the ?creators of ?Jotun. You play Eshe, a wanderer in a ruined world, trapped in ever­?-?changing caverns teeming with eldritch horrors. Harness the power of corrupted relics to defeat gigantic bosses, at the cost of your humanity. Resist or embrace.… Expand"}, {"name": "Zombie Rollerz: Pinball Heroes", "details_link": "https://www.metacritic.com/game/switch/zombie-rollerz-pinball-heroes", "publisher": "Daedalic Entertainment", "release_date": "Mar  2 2022", "developers": ["Firefly Games Inc."], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Pinball"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/cefa4ecd1bbbe51532257d66d448a9c9-98.jpg", "descriptions": "Slam giant, super powered pinballs into waves of adorkable zombies - it's a new hot-take on Classic Pinball fused with Tower Defense! Grab your copy today to see for yourself the hot new game that is making a name for itself on Apple Arcade!Choose your Hero, hop aboard a Pinball BallistaSlam giant, super powered pinballs into waves of adorkable zombies - it's a new hot-take on Classic Pinball fused with Tower Defense! Grab your copy today to see for yourself the hot new game that is making a name for itself on Apple Arcade!Choose your Hero, hop aboard a Pinball Ballista and explore a constantly changing world in this epic new game. You'll have to stay one step ahead of the Zombie Plague, fight through hordes of zombies, and face each unique Zombie Boss in order to carry the day. The game changes each run through, so you can play again and again to collect all of the heroes, defeat each zombie boss, and become a Pinball Hero!… Expand"}, {"name": "Railway Empire", "details_link": "https://www.metacritic.com/game/pc/railway-empire", "publisher": "Kalypso", "release_date": "Jan 26 2018", "developers": ["Gaming Minds Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Management", "Vehicle", "Train", "Business / Tycoon"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/fd562492ea4d23b20e16f854cde09461-98.jpg", "descriptions": "In Railway Empire, you will create an elaborate and wide-ranging rail network, purchase over 40 different trains modelled in extraordinary detail, and buy or build railway stations, maintenance buildings, factories and tourist attractions to keep your travel network ahead of the competition.In Railway Empire, you will create an elaborate and wide-ranging rail network, purchase over 40 different trains modelled in extraordinary detail, and buy or build railway stations, maintenance buildings, factories and tourist attractions to keep your travel network ahead of the competition. You'll also need to hire and manage your workforce if you want to ensure an efficient train service, whilst also develop over 300 technologies ranging from mechanical improvements to the trains themselves to workplace infrastructures and advanced amenities as you progress through five eras of technological innovations.\r … Expand"}, {"name": "Every Extend Extra", "details_link": "https://www.metacritic.com/game/psp/every-extend-extra", "publisher": "Buena Vista Games", "release_date": "Nov  7 2006", "developers": ["Q Entertainment"], "platforms": "PSP", "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "Static", "Static", "Shoot-'Em-Up", "Top-Down"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/322c91ccd8048a50c3dd9baea4b00e15-98.jpg", "descriptions": "Every Extend Extra is a unique \"puzzle shooter,\" brought to the PSP system by the creators of the critically acclaimed hit Lumines.  Every Extend Extra delivers an addictive gameplay experience through a fusion of arcade-style shooting action, cutting-edge music and visuals. Players evadeEvery Extend Extra is a unique \"puzzle shooter,\" brought to the PSP system by the creators of the critically acclaimed hit Lumines.  Every Extend Extra delivers an addictive gameplay experience through a fusion of arcade-style shooting action, cutting-edge music and visuals. Players evade enemy attacks and then use perfect timing to blast their foes in a colorful display of explosive chain reactions.  The bigger the chain reaction results in the higher the score and the larger the rewards. [BVG]… Expand"}, {"name": "Ivy the Kiwi?", "details_link": "https://www.metacritic.com/game/wii/ivy-the-kiwi", "publisher": "XSEED Games", "release_date": "Aug 24 2010", "developers": ["Prope"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "Platformer", "2D", "2D"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/85cfb9afb778de27f9bdc81ee499a369-98.jpg", "descriptions": "Ivy the Kiwi? follows the storybook adventures of a lonely baby bird as she traverses beautiful 2-D landscapes and challenging obstacles in search of her mother. Players guide Ivy through her daunting journey utilising a unique control scheme: vines created and controlled by the player whoIvy the Kiwi? follows the storybook adventures of a lonely baby bird as she traverses beautiful 2-D landscapes and challenging obstacles in search of her mother. Players guide Ivy through her daunting journey utilising a unique control scheme: vines created and controlled by the player who aims to collect feathers to boost his score.… Expand"}, {"name": "Hasbro Family Game Night: Sorry! Sliders", "details_link": "https://www.metacritic.com/game/xbox-360/hasbro-family-game-night-sorry!-sliders", "publisher": "Electronic Arts", "release_date": "Mar 18 2009", "developers": ["Electronic Arts"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Miscellaneous", "Board Games", "Board / Card Game"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/7139ba0435108f6f06f6ec8a2ea502fc-98.jpg", "descriptions": "[Xbox Live Arcade]  Unlock the full version of Sorry! Sliders and you'll be able to play the original Hasbro board game or new versions – Advanced, Battle Boxes and custom modes! You'll have access to party games, unlockable items, leaderboards and achievements. [Microsoft]"}, {"name": "Real World Golf", "details_link": "https://www.metacritic.com/game/xbox/real-world-golf", "publisher": "Mad Catz", "release_date": "Apr 11 2006", "developers": ["Aqua Pacific", "In2Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/637039399e993c2159d3a59269605dbc-98.jpg", "descriptions": "Real World Golf is the first and only game on the PlayStation2 computer entertainment system and Xbox that lets you actually swing a club to hit a golf ball. Immerse yourself in the world of virtual reality where all the realism and subtlety of real golf fully comes to life in your livingReal World Golf is the first and only game on the PlayStation2 computer entertainment system and Xbox that lets you actually swing a club to hit a golf ball. Immerse yourself in the world of virtual reality where all the realism and subtlety of real golf fully comes to life in your living room. Adjust your swing to pitch, fade, draw, slice or spin the ball as Gametrak closely tracks your movement in real time and lets you play in the game! Improve your grip, stance and swing, and play across 10 stunning 18-hole golf courses and driving ranges. The game includes career mode, championship play, 4-player tournament challenges and more.… Expand"}, {"name": "Ghosts 'n Goblins Resurrection", "details_link": "https://www.metacritic.com/game/switch/ghosts-n-goblins-resurrection", "publisher": "Capcom", "release_date": "Feb 25 2021", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/9/34f331ec7291d7163ad51010a17df675-98.jpg", "descriptions": "Ghosts ‘n Goblins Resurrection is a reboot that brings the beloved Capcom franchise back to life and into the 21st century. Paying homage to Ghosts ‘n Goblins and Ghouls ‘n Ghosts, the latest entry combines the franchise’s action platforming gameplay with storybook-like graphics andGhosts ‘n Goblins Resurrection is a reboot that brings the beloved Capcom franchise back to life and into the 21st century. Paying homage to Ghosts ‘n Goblins and Ghouls ‘n Ghosts, the latest entry combines the franchise’s action platforming gameplay with storybook-like graphics and challenging new obstacles. The game follows the valiant knight Arthur as he runs, jumps and battles his way through eerie stages set in the Demon Realm, a demonic fantasy world. Brave knights will need to proceed with extreme caution as terrifying dangers await, including familiar enemies like Zombie, Skeleton Murderer, Pigman and Red Arremer. Ghosts ‘n Goblins Resurrection is a nostalgic, yet fresh adventure that welcomes back its faithful fans, while introduces a new generation of heroes to challenge one of gaming's classic series.\r… Expand"}, {"name": "Lara Croft and the Temple of Osiris", "details_link": "https://www.metacritic.com/game/playstation-4/lara-croft-and-the-temple-of-osiris", "publisher": "Square Enix", "release_date": "Dec  9 2014", "developers": ["Nixxes Software"], "platforms": ["PC", "Stadia", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "2D"], "meta_score": 74, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/960f1d74694004b5cf26ca1602c6a459-98.jpg", "descriptions": "Lara Croft and the Temple of Osiris is the sequel to Lara Croft and the Guardian of Light. In her new adventure, Lara Croft travels to Egypt and realized she must join forces with rival treasure hunter Carter Bell and imprisoned gods Horus and Isis to defeat the evil god Set. Featuring aLara Croft and the Temple of Osiris is the sequel to Lara Croft and the Guardian of Light. In her new adventure, Lara Croft travels to Egypt and realized she must join forces with rival treasure hunter Carter Bell and imprisoned gods Horus and Isis to defeat the evil god Set. Featuring a 4-player co-op story, players must work together to explore the temple, defeat hordes of enemies from the Egyptian underworld, solve devious puzzles, and avoid deadly traps. At the same time, players compete for treasure, powerful artifacts, and ultimate bragging rights. … Expand"}, {"name": "Just Cause", "details_link": "https://www.metacritic.com/game/xbox/just-cause", "publisher": "Eidos Interactive", "release_date": "Sep 27 2006", "developers": ["Avalanche Studios"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 74, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/1389aa795576b7553d34e6bec98d048a-98.jpg", "descriptions": "In Just Cause, take on the role of the flamboyant Rico Rodriguez--an undercover CIA operative specializing in regime change--as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it's your job to negate theIn Just Cause, take on the role of the flamboyant Rico Rodriguez--an undercover CIA operative specializing in regime change--as he tries to overthrow the corrupt government of San Esperito. This rogue South American island is suspected of stockpiling WMDs and it's your job to negate the threat to world peace. It could be to your advantage that this tropical paradise is about to implode as various factions vie for power--it just needs a gentle nudge in the right direction.… Expand"}, {"name": "Epistory - Typing Chronicles", "details_link": "https://www.metacritic.com/game/pc/epistory---typing-chronicles", "publisher": "Plug In Digital", "release_date": "Mar 30 2016", "developers": ["Fishing Cactus"], "platforms": ["Stadia", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/2e0474520b0c90da29515d5597de3e63-98.jpg", "descriptions": "Epistory delves you in an atmospheric action/adventure game where you play a girl riding a giant fox who clears out an insectile corruption from an origami world. As you progress and explore this world, the story literally unfolds and the mysteries of the magic power of the words are revealed."}, {"name": "9 Years of Shadows", "details_link": "https://www.metacritic.com/game/pc/9-years-of-shadows", "publisher": "None, yet.", "release_date": "Mar 27 2023", "developers": ["Halberd Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Platformer", "Metroidvania"], "meta_score": 74, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/e40f5dd206873fc9e7a6b6995c242ace-98.jpg", "descriptions": "For 9 long years, the world has been submerged in the deepest of shadows, robbing every object and living creature of their color. Once a thriving civilization, the people have forgotten the warmth of the sun, the joy of laughter and the promise of a prosperous future.Many brave souls haveFor 9 long years, the world has been submerged in the deepest of shadows, robbing every object and living creature of their color. Once a thriving civilization, the people have forgotten the warmth of the sun, the joy of laughter and the promise of a prosperous future.Many brave souls have tried to venture inside the corrupting depths of Talos Castle, a long-abandoned orphanage from which the curse stemmed, but with each futile attempt, resignation became the daily fare for the people, all hope lost. Except for one person.Armed with little other than her halberd and sheer nerve, Europa's daunting quest is clear: enter the castle, find the source of darkness, and return color to the lands before it is too lat… Expand"}, {"name": "Kayak VR: Mirage", "details_link": "https://www.metacritic.com/game/playstation-5/kayak-vr-mirage", "publisher": "Better Than Life", "release_date": "Feb 22 2023", "developers": ["Better Than Life"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Other"], "meta_score": 74, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/75ed1ac5030edf55fba323bbc083a7fc-98.jpg", "descriptions": "Kayak VR: Mirage is a jaw-dropping and exhilarating journey through beautiful and unique locations, tailor-made for Virtual Reality. Maneuver our fully physically accurate kayak around checkpoints and crown yourself the fastest, or take it easy and use the free roam mode for a leisurely tripKayak VR: Mirage is a jaw-dropping and exhilarating journey through beautiful and unique locations, tailor-made for Virtual Reality. Maneuver our fully physically accurate kayak around checkpoints and crown yourself the fastest, or take it easy and use the free roam mode for a leisurely trip and enjoy the scenery.… Expand"}, {"name": "Raiden IV x Mikado Remix", "details_link": "https://www.metacritic.com/game/playstation-5/raiden-iv-x-mikado-remix", "publisher": "NIS America", "release_date": "Jan 31 2023", "developers": ["Moss"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Vertical"], "meta_score": 74, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/76a42c1820a759a93ef2511f54f9fabe-98.jpg", "descriptions": "THE ROAR OF THUNDER IS BACK!Raiden IV, the popular shoot 'em up arcade and console game, debuts on Nintendo Switch with remixed background music by a superb lineup of artists produced by GAME CENTER MIKADO.\n\nInstill fear in your enemies with devastating attacks and earn the acclaimed titleTHE ROAR OF THUNDER IS BACK!Raiden IV, the popular shoot 'em up arcade and console game, debuts on Nintendo Switch with remixed background music by a superb lineup of artists produced by GAME CENTER MIKADO.Instill fear in your enemies with devastating attacks and earn the acclaimed title of master Ace!… Expand"}, {"name": "Tricky Towers", "details_link": "https://www.metacritic.com/game/switch/tricky-towers", "publisher": "WeirdBeard", "release_date": "Oct 11 2018", "developers": ["WeirdBeard"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Stacking"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/a6757b971b1bb3c5f9620b83926522b5-98.jpg", "descriptions": "With your brilliant robe and magic powers, it's time to build some Tricky Towers!\r Tricky Towers is a multiplayer physics-based tower building game. In a game of Tricky Towers you stack your bricks to create a stable tower and try to topple those of your opponents. To spice it up you canWith your brilliant robe and magic powers, it's time to build some Tricky Towers!\r Tricky Towers is a multiplayer physics-based tower building game. In a game of Tricky Towers you stack your bricks to create a stable tower and try to topple those of your opponents. To spice it up you can cast magic to support your structure and fend off the dark spells of your rivals in this frantic physics party game.\r Tricky Towers offers local and online multiplayer with up to 4 players in Race, Survival and Puzzle mode. It also features 50 single player trials for players to test their skills or practice for online play.\r With spells flying everywhere and bricks tumbling down, Tricky Towers makes for a chaotically good time!… Expand"}, {"name": "Minit", "details_link": "https://www.metacritic.com/game/xbox-one/minit", "publisher": "Devolver Digital", "release_date": "Apr  3 2018", "developers": ["JW", "Kitty", "Jukio", "and Dom"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/7f6240ff59c74055e393ce72c35e8ba7-98.jpg", "descriptions": "Minit is a peculiar little adventure played sixty seconds at a time. Journey outside the comfort of your home to help unusual folk, uncover countless secrets, and overcome dangerous foes, all in hopes of lifting a rather unfortunate curse that ends each day after just one minute. Minit is a Minit is a peculiar little adventure played sixty seconds at a time. Journey outside the comfort of your home to help unusual folk, uncover countless secrets, and overcome dangerous foes, all in hopes of lifting a rather unfortunate curse that ends each day after just one minute. Minit is a collaboration between Kitty Calis, Jan Willem Nijman, Jukio Kallio & Dominik Johann. … Expand"}, {"name": "Aegis Defenders", "details_link": "https://www.metacritic.com/game/switch/aegis-defenders", "publisher": "Humble Bundle", "release_date": "Feb  8 2018", "developers": ["Humble Bundle", "GUTS Department"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 74, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/3b985902dd0451f36ab1ed9bb458f276-98.jpg", "descriptions": "Take on wild beasts, ruthless soldiers, and ancient gods in this 2D Action-Platformer inspired by Tower-Defense combat."}, {"name": "Furi", "details_link": "https://www.metacritic.com/game/switch/furi", "publisher": "The Game Bakers", "release_date": "Jan 11 2018", "developers": ["The Game Bakers"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Fighting", "3D"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/8024a1e7dbe0d710798c8974d573d5ec-98.jpg", "descriptions": "Fight your way free in our frenzied all-boss fighter, and discover what’s waiting behind the last gate. Furi is all about the tension of one-on-one fights against deadly adversaries. It’s an intense, ultra-responsive game with a unique mix of fast-paced sword fighting and dual-stickFight your way free in our frenzied all-boss fighter, and discover what’s waiting behind the last gate. Furi is all about the tension of one-on-one fights against deadly adversaries. It’s an intense, ultra-responsive game with a unique mix of fast-paced sword fighting and dual-stick shooting. Each of the formidable guardians - designed by Afro Samurai creator Takashi Okazaki - has a unique and surprising combat style that requires focus and skill to defeat. The high-energy action gets a boost from an explosive soundtrack composed by electro musicians including Carpenter Brut.… Expand"}, {"name": "Batman: Arkham Origins", "details_link": "https://www.metacritic.com/game/pc/batman-arkham-origins", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 24 2013", "developers": ["Iron Galaxy Studios"], "platforms": ["PlayStation 3", "Wii U", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "Fantasy", "Open-World"], "meta_score": 74, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/93a149ff2ff02c621c59b248e11422bd-98.jpg", "descriptions": "Batman: Arkham Origins features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two games in the franchise. Taking place before the rise of Gotham City’s most notoriousBatman: Arkham Origins features an expanded Gotham City and introduces an original prequel storyline set several years before the events of Batman: Arkham Asylum and Batman: Arkham City, the first two games in the franchise. Taking place before the rise of Gotham City’s most notorious criminals, the game showcases a young, unrefined Batman as he faces the defining moment of his early career and sets his path to becoming the Dark Knight. … Expand"}, {"name": "Droplitz", "details_link": "https://www.metacritic.com/game/xbox-360/droplitz", "publisher": "Atlus", "release_date": "Jun 24 2009", "developers": ["Blitz Arcade"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 74, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/5e110b40147f63d79ef3a4f08e21c729-98.jpg", "descriptions": "[Xbox Live Arcade]  Immerse yourself in an addictive puzzler that's all about strategically twisting and connecting mismatched dials to save precious Droplitz™. Just making a single junction is child's play. Can you master the art of the combo, or will you let your pipes runneth over? Be[Xbox Live Arcade]  Immerse yourself in an addictive puzzler that's all about strategically twisting and connecting mismatched dials to save precious Droplitz™. Just making a single junction is child's play. Can you master the art of the combo, or will you let your pipes runneth over? Be warned! Losing too many droplitz can be hazardous to your ability to win. With four unique play modes, a variety of board sizes, and infinite replayability, Droplitz promises to drain all your time away. Infinitely accessible, instantly addictive: Turn dials, open paths, and don't let the droplitz go to waste! Brilliantly intuitive, casual and hardcore gamers alike will be mesmerized as they rotate and connect puzzle pieces to let the droplitz flow and earn high scores. Four unique game modes: Distinct layers of complexity keep the challenge fresh with Classic, Zendurance, Power Up, and Infection modes. Learn how to deal with sluggish, infected dials, strategically use bombs to clear sections of the game board, speed up the action, or just aim for the highest score in a limited amount of time. Endless replayability: The timeless satisfaction of making combos, clearing boards, and earning top scores will keep you coming back for more. Ever-increasing speeds and larger boards ensure there's always a challenge ahead! High scores: Online leaderboards and twelve achievements mean that when you're the best, everyone will know it. Score-based gameplay makes every game a competition to get to the top of the charts. [Blitz Games Studio]… Expand"}, {"name": "Neo Cab", "details_link": "https://www.metacritic.com/game/switch/neo-cab", "publisher": "Chance Agency", "release_date": "Oct  3 2019", "developers": ["Chance Agency"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 74, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/416f063606e3fec74b958f20c5477f98-98.jpg", "descriptions": "Stay human in a world overcome by automation. Play as Lina, one of the last human driver-for-hire on the streets of Los Ojos. Your friend and only lifeline has gone missing; with no money and nowhere to stay, the only thing you can do is keep driving. Choose what passengers to pick up andStay human in a world overcome by automation. Play as Lina, one of the last human driver-for-hire on the streets of Los Ojos. Your friend and only lifeline has gone missing; with no money and nowhere to stay, the only thing you can do is keep driving. Choose what passengers to pick up and how you engage with them to learn their stories. Balance your own emotional wellbeing with the needs of your pax as you strive to keep your perfect rating, and your job. Maybe someone in this city can help you with your own story? … Expand"}, {"name": "Batman: Arkham VR", "details_link": "https://www.metacritic.com/game/playstation-4/batman-arkham-vr", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 11 2016", "developers": ["Rocksteady Studios"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General"], "meta_score": 74, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/8b300eb9f1fcd8212ed77e28e7d4a0af-98.jpg", "descriptions": "Batman: Arkham VR is a new Batman story set in the Arkham universe and exclusive to PlayStation VR. For the first time in a Rocksteady Arkham story, Batman: Arkham VR offers players the chance to feel that unique sense of presence in these legendary locations through virtual reality. [Rocksteady]"}, {"name": "Back to the Future: The Game - Episode I: It's About Time", "details_link": "https://www.metacritic.com/game/pc/back-to-the-future-the-game---episode-i-its-about-time", "publisher": "Telltale Games", "release_date": "Dec 22 2010", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PC"], "num_players": "1 Player", "genres": ["Action Adventure", "Adventure", "Sci-Fi", "Sci-Fi", "3D", "Third-Person"], "meta_score": 74, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/bdaa3f1a13fe390f5ffe4b9871a66943-98.jpg", "descriptions": "Telltale Games, the studio behind Tales of Monkey Island and the Sam & Max episodes, turns cult time travel flick Back to the Future into an episodic adventure."}, {"name": "Chili Con Carnage", "details_link": "https://www.metacritic.com/game/psp/chili-con-carnage", "publisher": "Eidos Interactive", "release_date": "Feb 27 2007", "developers": ["Deadline Games"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 74, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/56bd88adfb3fda4e5d407266aecab84d-98.jpg", "descriptions": "Out to avenge the assassination of his father, Chili Con Carnage hurls Ramiro Cruz deep into the seedy underworld of Los Toros, Mexico, where he must single handedly create maximum carnage throughout the inner circles of local kingpin, Cesar Morales’ drug cartel. Featuring non-stop,Out to avenge the assassination of his father, Chili Con Carnage hurls Ramiro Cruz deep into the seedy underworld of Los Toros, Mexico, where he must single handedly create maximum carnage throughout the inner circles of local kingpin, Cesar Morales’ drug cartel. Featuring non-stop, over-the-top action, Ramiro comes equipped with a vast arsenal of weaponry along with signature super-spicy, gravity-defying special moves. Engage in gun frenzies against comical fiends such as mustached mercenaries, mutated super-Mamas and even killer exploding chickens. The action frenzy remains intense across seven unique 3D exotic locations from the trenches of a drug city to the heart of a dense jungle – an extensive varied landscape for a portable title. Three difficulty settings make the game appeal to casual shoot-em-up gamers as well as the most hardcore battle strategists, and the wireless multiplayer features of the PSP ensure that the game is enjoyable as a single player experience as well as a fun party game. [Eidos Interactive]… Expand"}]