[{"name": "Earth Defense Force: World Brothers", "details_link": "https://www.metacritic.com/game/playstation-4/earth-defense-force-world-brothers", "publisher": "D3Publisher", "release_date": "May 27 2021", "developers": ["Yuke's", "Sandlot"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/81b6d3100ef425e3a4d9776e42e5f4db-98.jpg", "descriptions": "A new battlefield appears in the \"EDF\" series. This time, the world becomes the square Earth. The name of this game is \"EARTH DEFENSE FORCE: WORLD BROTHERS\". \r\rThis game takes place in the 3D voxel world, which everything is made up of square pieces. In this world, the Earth is not roundA new battlefield appears in the \"EDF\" series. This time, the world becomes the square Earth. The name of this game is \"EARTH DEFENSE FORCE: WORLD BROTHERS\". \r\rThis game takes place in the 3D voxel world, which everything is made up of square pieces. In this world, the Earth is not round but square. And now, this voxel Earth is fallen apart into square pieces, breaking its blocky peace. But whether round or square, the Earth must be the Earth. So now, the player and the \"EARTH DEFENSE FORCE\" must rise to the occasion and save the day to restore a shattered Voxel Earth to one peace.… Expand"}, {"name": "The Dark Pictures Anthology: Man of Medan", "details_link": "https://www.metacritic.com/game/pc/the-dark-pictures-anthology-man-of-medan", "publisher": "Bandai Namco Games", "release_date": "Aug 29 2019", "developers": ["Supermassive Games"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "General", "Survival"], "meta_score": 75, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/7/26e1e7451d51302ddfd2f445e3c97e67-98.jpg", "descriptions": "DON'T PLAY ALONE - From the developers of Until Dawn...Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable charactersDON'T PLAY ALONE - From the developers of Until Dawn...Enter the world of The Dark Pictures - A series of standalone cinematic horror games. Players will be challenged to explore and uncover each story with the knowledge that all their choices have consequences and all playable characters can live, any and all can die... Man of Medan is the first game in The Dark Pictures anthology, bringing supernatural horror to the South Pacific. Five friends set sail on a holiday diving trip with a rumored WWII wreck to find. As the day unfolds and a storm rolls in, their trip soon changes into something much more sinister. Who will live? Who will die? It's down to you. Can you save them all?\r Features:\r A NEW TERRIFYING EXPERIENCE\rSupermassive Games delivers a new, horrific narrative journey where you will have to confront your deepest fears.\r CAN YOU SAVE THEM ALL?\rAll payable characters can live and all can die. The choices you make will decide their fate. Death could be just around the corner...\r WHAT WILL YOU DO TO SURVIVE?\rEach choice you make has a consequence which can mean life or death for your character. Will you keep your head whilst struggling to survive? What decisions will you make?… Expand"}, {"name": "Observer", "details_link": "https://www.metacritic.com/game/switch/observer", "publisher": "Bloober Team", "release_date": "Feb  7 2019", "developers": ["Bloober Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/cd74eba38ea0510fff3c262a5f795a1b-98.jpg", "descriptions": ">observer_ is a cyberpunk, detective thriller set in the year 2084 in Krakow, Poland. The world lies in ruins with corporations seizing power after the fall of governments. You do their bidding. No lie will remain hidden from you, as you hack into the minds of those you interrogate. When>observer_ is a cyberpunk, detective thriller set in the year 2084 in Krakow, Poland. The world lies in ruins with corporations seizing power after the fall of governments. You do their bidding. No lie will remain hidden from you, as you hack into the minds of those you interrogate. When your past catches-up, you must act on your own and unravel the mystery of your son’s disappearance. Your name is Daniel Lazarski, you’re an Observer. … Expand"}, {"name": "Need for Speed: Rivals", "details_link": "https://www.metacritic.com/game/xbox-one/need-for-speed-rivals", "publisher": "Electronic Arts", "release_date": "Nov 22 2013", "developers": ["Ghost Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 75, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/5dc5c102dbe57d48451cee568c822373-98.jpg", "descriptions": "Need for Speed Rivals inserts gamers behind the wheel of both sides of the thin blue line, daring them to cross that line as either a cop or racer in order to gain any advantage in the street’s ultimate rivalry. Players decide between two distinct career experiences, each with its own set ofNeed for Speed Rivals inserts gamers behind the wheel of both sides of the thin blue line, daring them to cross that line as either a cop or racer in order to gain any advantage in the street’s ultimate rivalry. Players decide between two distinct career experiences, each with its own set of high-stakes challenges, rewards, pursuit tech and cars. The intensity of the action is enhanced as a result of AllDrive, a feature that destroys the line between single player, co-op and multiplayer. Through AllDrive, friends are connected to one racing world where their races and chases can collide at any time.… Expand"}, {"name": "Bit.Trip Saga", "details_link": "https://www.metacritic.com/game/3ds/bittrip-saga", "publisher": "Aksys Games", "release_date": "Sep 13 2011", "developers": ["Gaijin Games"], "platforms": ["PlayStation 4", "PlayStation Vita", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/cc102718cfecd7b49495ba95bb953d1d-98.jpg", "descriptions": "All six BIT.TRIP games are transformed into 3D, morphing into a single entity called /BIT.TRIP SAGA/. Experience the crushing difficulty of the rhythmic galaxies and ride along the long journey with CommanderVideo as he completes his mission and returns...home."}, {"name": "Satellite Reign", "details_link": "https://www.metacritic.com/game/pc/satellite-reign", "publisher": "5 Lives Studios", "release_date": "Aug 28 2015", "developers": ["5 Lives Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Strategy", "Real-Time", "General"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/6fdfc772c4f2e8459e9a4238867fe4c8-98.jpg", "descriptions": "A real-time, class-based strategy game through which you control a team of four agents, each with distinct and unique abilities, collectively battling for control of a simulated, living cyberpunk city."}, {"name": "NBA Live 09", "details_link": "https://www.metacritic.com/game/playstation-3/nba-live-09", "publisher": "EA Sports", "release_date": "Oct  7 2008", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/e9b1330e23df9ea18066e517c9083ae6-98.jpg", "descriptions": "NBA Live 09 is back with new features like Pick and Roll Control, Defensive Lockdown Control, Signature Playcalling and Quickstrike Ankle-Breakers. For those in need of some extra coaching, NBA Live 09 takes you to training camp with the NBA Academy that gives you a chance to hone yourNBA Live 09 is back with new features like Pick and Roll Control, Defensive Lockdown Control, Signature Playcalling and Quickstrike Ankle-Breakers. For those in need of some extra coaching, NBA Live 09 takes you to training camp with the NBA Academy that gives you a chance to hone your skills. Now featuring 24 authentic FIBA teams with realistic team play styles and rosters, NBA Live 09 features a FIBA World Championship Mode using FIBA tournament structure, rules and court dimensions. Take your game online with 5 vs.5 team play, where 10 people can play together on 10 different consoles around the world. [Electronic Arts]… Expand"}, {"name": "The Legendary Starfy", "details_link": "https://www.metacritic.com/game/ds/the-legendary-starfy", "publisher": "Nintendo", "release_date": "Jun  7 2009", "developers": ["TOSE"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/3/352b0a39e2b6350aaa3b8421328df386-98.jpg", "descriptions": "In The Legendary Starfy players dive into a undersea adventure with Starfy, the hero of Pufftop. Players swoop into enemies like a shooting star, glide over bottomless chasms and transform into powerful creatures to help a mysterious, bunny-eared visitor find his lost memory."}, {"name": "Disney Infinity", "details_link": "https://www.metacritic.com/game/playstation-3/disney-infinity", "publisher": "Disney Interactive Studios", "release_date": "Aug 18 2013", "developers": ["Avalanche Software"], "platforms": ["3DS", "PC", "Wii U", "Xbox 360", "PlayStation 3"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/86779ba7b12e4258be23e2bbd633513e-98.jpg", "descriptions": "In Disney's most ambitious video game initiative ever, Disney Infinity introduces an all-new game universe where a spark of imagination unlocks a fantastical world where players have unprecedented freedom and endless opportunity to create stories and play experiences starring the belovedIn Disney's most ambitious video game initiative ever, Disney Infinity introduces an all-new game universe where a spark of imagination unlocks a fantastical world where players have unprecedented freedom and endless opportunity to create stories and play experiences starring the beloved characters from Walt Disney and Pixar Animation Studios' most popular franchises.… Expand"}, {"name": "The Walking Dead: The Telltale Series - The Final Season Episode 1: Done Running", "details_link": "https://www.metacritic.com/game/playstation-4/the-walking-dead-the-telltale-series---the-final-season-episode-1-done-running", "publisher": "Telltale Games", "release_date": "Aug 14 2018", "developers": ["Telltale Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/18d0199a2c0b471a98156e7cb93df9e5-98.jpg", "descriptions": "After years on the road facing threats both living and dead, a secluded school might finally be Clementine's chance for a home. But protecting it will mean sacrifice. Clem must build a life and become a leader while still watching over AJ, an orphaned boy and the closest thing to family sheAfter years on the road facing threats both living and dead, a secluded school might finally be Clementine's chance for a home. But protecting it will mean sacrifice. Clem must build a life and become a leader while still watching over AJ, an orphaned boy and the closest thing to family she has left. In this gripping, emotional final season, you will define your relationships, fight the undead, and determine how Clementine's story ends.… Expand"}, {"name": "Infested Planet", "details_link": "https://www.metacritic.com/game/pc/infested-planet", "publisher": "Rocket Bear Games", "release_date": "Mar  6 2014", "developers": ["Rocket Bear Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/a5e4091b5be31d94c5eb35837916a3dc-98.jpg", "descriptions": "Infested Planet is a tactical RTS, giving players the command of 5 soldiers and pitting them against a swarm of 100,000 aliens. To defeat this numerous enemy, players will have to employ their entire arsenal of weapons, buildings and technologies. Constructing everything from artilleryInfested Planet is a tactical RTS, giving players the command of 5 soldiers and pitting them against a swarm of 100,000 aliens. To defeat this numerous enemy, players will have to employ their entire arsenal of weapons, buildings and technologies. Constructing everything from artillery cannons to heavily armoured minigun specialists, the marine team must push back the encroaching alien menace. The aliens have a few tricks at their disposal as well. They can mutate to gain new abilities, challenging the player with new problems. Potential commanders will need to adapt quickly or risk being overrun.… Expand"}, {"name": "NCAA Basketball 10", "details_link": "https://www.metacritic.com/game/xbox-360/ncaa-basketball-10", "publisher": "EA Sports", "release_date": "Nov 16 2009", "developers": ["EA Canada"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/c09796d5f571e64aa76496da34982f20-98.jpg", "descriptions": "NCAA Basketball 10 brings the emotion, intensity, and spirit of college basketball by capturing every detail in the stadium, from cheerleaders and mascots to wild crowds and real NCAA Basketball announcers. NCAA Basketball 10 builds on a new game engine introduced last year, refining andNCAA Basketball 10 brings the emotion, intensity, and spirit of college basketball by capturing every detail in the stadium, from cheerleaders and mascots to wild crowds and real NCAA Basketball announcers. NCAA Basketball 10 builds on a new game engine introduced last year, refining and improving core gameplay functions, and adding more depth to the popular 'styles of play' and 'set your tempo' features, making NCAA Basketball 10 a strategic and entirely unique basketball gameplay experience. [Electronic Arts]… Expand"}, {"name": "Mortal Kombat: Armageddon", "details_link": "https://www.metacritic.com/game/playstation-2/mortal-kombat-armageddon", "publisher": "Midway", "release_date": "Oct  9 2006", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Action", "Fighting", "3D"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/46ef033c216d7f5f1afbb001ad975838-98.jpg", "descriptions": "Mortal Kombat: Armageddon is the latest chapter in the award-winning, best-selling video game fighting franchise. With the most complete Mortal Kombat roster ever, including every character from the Mortal Kombat fighting universe, revolutionary Create-A-Fighter and Create-A-Fatality modes,Mortal Kombat: Armageddon is the latest chapter in the award-winning, best-selling video game fighting franchise. With the most complete Mortal Kombat roster ever, including every character from the Mortal Kombat fighting universe, revolutionary Create-A-Fighter and Create-A-Fatality modes, plus a brand new Konquest mode, Mortal Kombat: Armageddon strives to be the most complete, intensely lethal, fighting experience ever. [Midway]… Expand"}, {"name": "Hohokum", "details_link": "https://www.metacritic.com/game/playstation-4/hohokum", "publisher": "SCEA", "release_date": "Aug 12 2014", "developers": ["Honeyslug Ltd"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "PlayStation 4"], "genres": ["General", "Adventure", "General"], "meta_score": 75, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/5261f3d225447fbd30b1d504a1754361-98.jpg", "descriptions": "A whimsical, colorful game with an emphasis on playful exploration and creativity."}, {"name": "Void Bastards", "details_link": "https://www.metacritic.com/game/xbox-one/void-bastards", "publisher": "Humble Bundle", "release_date": "May 29 2019", "developers": ["Blue Manchu"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/b8165fe3845f33338d9e99a5f4b5a049-98.jpg", "descriptions": "Inspired by BioShock and System Shock 2, Void Bastards is a new strategy-shooter that will test your wits as well as exercise your aim. Can you lead the misfit prisoners of the Void Ark through the derelict spaceships and myriad dangers of the Sargasso Nebula?"}, {"name": "Vaporum", "details_link": "https://www.metacritic.com/game/pc/vaporum", "publisher": "Fatbot Games", "release_date": "Sep 28 2017", "developers": ["Fatbot Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/cfd2bc270f8e627837ed6eeaf8a29d5c-98.jpg", "descriptions": "Vaporum is a grid-based dungeon crawler RPG in an original steampunk setting, inspired by old-school classics of the genre. Stranded in the middle of an ocean, in front of a gigantic tower, the hero has to find out what the place is, what happened there, and most importantly, who he is."}, {"name": "Middle-earth: Shadow of War", "details_link": "https://www.metacritic.com/game/pc/middle-earth-shadow-of-war", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct  9 2017", "developers": ["Monolith Productions"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 75, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/81745157af55b34929f58cd652e99a50-98.jpg", "descriptions": "Experience an epic open world brought to life by the Nemesis System. Forge a new Ring of Power, conquer Fortresses in massive battles and dominate Mordor with your personal orc army in Middle-earth: Shadow of War. Go behind enemy lines to forge your army, conquer Fortresses and dominateExperience an epic open world brought to life by the Nemesis System. Forge a new Ring of Power, conquer Fortresses in massive battles and dominate Mordor with your personal orc army in Middle-earth: Shadow of War. Go behind enemy lines to forge your army, conquer Fortresses and dominate Mordor from within. Experience how the award-winning Nemesis System creates unique personal stories with every enemy and follower, and confront the full power of the Dark Lord Sauron and his Ringwraiths in this epic new story of Middle-earth. In Middle-earth: Shadow of War, nothing will be forgotten.… Expand"}, {"name": "Resident Evil: Revelations", "details_link": "https://www.metacritic.com/game/xbox-360/resident-evil-revelations", "publisher": "Capcom", "release_date": "May 21 2013", "developers": ["Capcom"], "platforms": ["3DS", "PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox One", "Xbox 360"], "num_players": "2 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/04b7e502c6caf14bcffd026049d74f6c-98.jpg", "descriptions": "The story's action is set at a time before the Kijuju and Lanshiang bioterror incidents when the BSAA was only a young organization. Join Jill Valentine aboard a ghost ship in the Mediterranean Sea searching for her old partner Chris Redfield. Discover the hidden truth behind the destructionThe story's action is set at a time before the Kijuju and Lanshiang bioterror incidents when the BSAA was only a young organization. Join Jill Valentine aboard a ghost ship in the Mediterranean Sea searching for her old partner Chris Redfield. Discover the hidden truth behind the destruction of a floating city. Or play in Raid Mode for a co-op killing-spree with friends over the Internet.… Expand"}, {"name": "Need for Speed Carbon", "details_link": "https://www.metacritic.com/game/playstation-3/need-for-speed-carbon", "publisher": "EA Games", "release_date": "Nov 16 2006", "developers": ["EA Canada"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Simulation", "Arcade", "GT / Street", "GT / Street", "Automobile"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/2/6ccca58dc622acefdf93e243efb35b4e-98.jpg", "descriptions": "What starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods oneWhat starts in the city is settled in the canyons as Need for Speed Carbon immerses you into the world's most dangerous and adrenaline-filled form of street racing. You and your crew must race in an all-out war for the city, risking everything to take over your rivals' neighborhoods one block at a time. As the police turn up the heat, the battle ultimately shifts to Carbon Canyon, where territories and reputations can be lost on every perilous curve. Need for Speed Carbon delivers the next generation of customization giving you the power to design and tweak your crew's cars in every way using the ground-breaking new Autosculpt technology. Represent your car class, your crew, and your turf in Need for Speed Carbon, the next revolution in racing games. [Electronic Arts]… Expand"}, {"name": "Heavy Rain Chronicles Episode 1: The Taxidermist", "details_link": "https://www.metacritic.com/game/playstation-3/heavy-rain-chronicles-episode-1-the-taxidermist", "publisher": "SCEA", "release_date": "Apr  4 2010", "developers": ["Quantic Dream"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/b294ac526ceb3152231e437353072a32-98.jpg", "descriptions": "Heavy Rain: Chronicle One – The Taxidermist features investigative journalist Madison Paige in one of her first cases tracking down a serial killer."}, {"name": "Sega Genesis Classics", "details_link": "https://www.metacritic.com/game/playstation-4/sega-genesis-classics", "publisher": "Sega", "release_date": "May 29 2018", "developers": ["Various", "D3T Limited"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/41780a589b8d7c34f6dad650cfeb182c-98.jpg", "descriptions": "[Also known as SEGA Mega Drive Classics] SEGA's collection of Mega Drive & Genesis classics comes to a new generation of consoles - and players. Over 50 titles across all genres from all-time classics like Sonic and Streets of Rage 2 to deep RPGs like the Phantasy Star series; arcade action,[Also known as SEGA Mega Drive Classics] SEGA's collection of Mega Drive & Genesis classics comes to a new generation of consoles - and players. Over 50 titles across all genres from all-time classics like Sonic and Streets of Rage 2 to deep RPGs like the Phantasy Star series; arcade action, shooters, beat 'em ups, puzzlers, old favourites and hidden gems. New features bring modern convenience to the classics. Save your game at any time, rewind those slip-ups, or customise your controls. Earn bragging rights with online multiplayer and achievements. The largest collection of retro classics on console in one package.… Expand"}, {"name": "Seasons After Fall", "details_link": "https://www.metacritic.com/game/pc/seasons-after-fall", "publisher": "Focus Home Interactive", "release_date": "Sep  2 2016", "developers": ["Swing Swing Submarine"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Platformer", "2D", "Action", "Action Adventure", "Platformer", "Open-World", "2D", "Metroidvania"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/db16565027fd30e02a6ba9d043231359-98.jpg", "descriptions": "Seasons After Fall is a 2D puzzle-adventure game that will let you dive into a captivating universe and explore a land governed by magic and nature."}, {"name": "River City Girls 2", "details_link": "https://www.metacritic.com/game/playstation-5/river-city-girls-2", "publisher": "Arc System Works", "release_date": "Dec 15 2022", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 75, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/6/de09583998d26c473fc86aa35bfec106-98.jpg", "descriptions": "The River City Girls are ready for round 2! When an old foe resurfaces, Misako, Kyoko, Kunio, and Riki - joined by newcomers Marian and Provie - hit the streets for an all-new beat-'em-up adventure packed with new abilities, enemies, environments, and more! Team up for local or onlineThe River City Girls are ready for round 2! When an old foe resurfaces, Misako, Kyoko, Kunio, and Riki - joined by newcomers Marian and Provie - hit the streets for an all-new beat-'em-up adventure packed with new abilities, enemies, environments, and more! Team up for local or online co-op, then pound punks into the dirt with brand-new guard-crush attacks, lift-off combos, double-team maneuvers, and other knuckle-busting techniques! Level-up to earn new moves, buy items and accessories in more than 30 shops, and recruit defeated foes and hired heavies to help you on your way!River City is bigger than ever, with more locations to explore, more objects to destroy, and a day-night cycle! With nonlinear gameplay, a dynamic story system, and another epic soundtrack by Megan McDuffee, River City Girls 2 will keep you brawling until all your enemies yell \"BARF!\"… Expand"}, {"name": "Descenders", "details_link": "https://www.metacritic.com/game/playstation-4/descenders", "publisher": "Sold Out", "release_date": "Aug 25 2020", "developers": ["RageSquid"], "platforms": ["iPhone/iPad", "iPhone/iPad", "PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 75, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/b5468cf1a9c7f5ac28c95ae0f9892bea-98.jpg", "descriptions": "Descenders is extreme downhill freeriding for the modern era, with procedurally generated worlds, and where mistakes have real consequences. Will you lead your team to glory and become the next legendary Descender? In Descenders, your team is your life. When you pick a side - Enemy, ArborealDescenders is extreme downhill freeriding for the modern era, with procedurally generated worlds, and where mistakes have real consequences. Will you lead your team to glory and become the next legendary Descender? In Descenders, your team is your life. When you pick a side - Enemy, Arboreal or Kinetic - you'll be bound together with other players who choose the same side as you.Grab your bike, pick your team, and attempt to live up to the legend of your Descender. Will you join the die-hard, trick-frenzy ranks of Team Enemy, the proficient, off-road stylings of Team Arboreal, or the high-octane, speed-is-everything Team Kinetic?… Expand"}, {"name": "Defector", "details_link": "https://www.metacritic.com/game/pc/defector", "publisher": "Oculus Studios", "release_date": "Jul 11 2019", "developers": ["Twisted Pixel Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 75, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/1/15277ebae7b998dc5a1cdbfcb9b5522a-98.jpg", "descriptions": "Overcome impossible odds and survive certain death scenarios in the undercover spy thriller that VR has been waiting for. You'll need every advanced weapon, cutting-edge technology, and deceptive tactic in your arsenal. Good luck agent. [Oculus]"}, {"name": "The Mummy Demastered", "details_link": "https://www.metacritic.com/game/switch/the-mummy-demastered", "publisher": "WayForward", "release_date": "Oct 24 2017", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/d92d34d5f4e7df4e9ef6a768499e3965-98.jpg", "descriptions": "A powerful ancient evil has arisen, and the war to save humanity has begun. The Mummy Demastered throws you into a 16-bit-inspired battle against the undead in a 2D, nonlinear, action-packed adventure."}, {"name": "Sly Cooper: Thieves in Time", "details_link": "https://www.metacritic.com/game/playstation-vita/sly-cooper-thieves-in-time", "publisher": "SCEA", "release_date": "Feb  5 2013", "developers": ["Sanzaru Games"], "platforms": ["PlayStation 3", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/e2891c970c2047fe2d091fe035212660-98.jpg", "descriptions": "Sly Cooper Thieves in Time continues to chronicle the adventures of the Sly Cooper gang from where Sly 3: Honor Among Thieves concluded. After completing their latest heist, Sly carries on with a case of alleged amnesia and dances off with gal pal Carmelita, leaving Bentley as the keeper ofSly Cooper Thieves in Time continues to chronicle the adventures of the Sly Cooper gang from where Sly 3: Honor Among Thieves concluded. After completing their latest heist, Sly carries on with a case of alleged amnesia and dances off with gal pal Carmelita, leaving Bentley as the keeper of the treasured Thievius Raccoonus, The Cooper family’s ancient book of master thievery. When Bentley discovers that pages of the book have begun to disappear in front of his eyes, he must round up the gang and save the Cooper Clan legacy from being destroyed forever.… Expand"}, {"name": "Knights in the Nightmare", "details_link": "https://www.metacritic.com/game/psp/knights-in-the-nightmare", "publisher": "Atlus", "release_date": "Nov  5 2010", "developers": ["Sting"], "platforms": "PSP", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 75, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/2db029b72582129d0bb6b82cf7a08ac6-98.jpg", "descriptions": "Enhanced to take full advantage of the power of PSP system, this new version of the game features remastered visuals and sounds, optimized controls, and a new opening movie from visionary director Yukio Takatsu (Persona 3, Persona 4, Yggdra Union).  Originally, players could choose from twoEnhanced to take full advantage of the power of PSP system, this new version of the game features remastered visuals and sounds, optimized controls, and a new opening movie from visionary director Yukio Takatsu (Persona 3, Persona 4, Yggdra Union).  Originally, players could choose from two different characters with two unique perspectives on events.  This new release adds a third character, Princess Yggdra, offering even more replay value and shedding more light on the game's enchanting narrative.  Moreover, this release further expands on what was already one of the deepest, most substantial tutorials of all-time, giving players introductory missions filled with instructions and tips, making the game's learning curve easier than ever.  Dripping with style and originality, Knights in the Nightmare delivers an unforgettable experience.… Expand"}, {"name": "NCAA Basketball 10", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-basketball-10", "publisher": "EA Sports", "release_date": "Nov 16 2009", "developers": ["EA Canada"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/4a89cd2087a191f0dc1780a82da7ae8f-98.jpg", "descriptions": "NCAA Basketball 10 brings the emotion, intensity, and spirit of college basketball by capturing every detail in the stadium, from cheerleaders and mascots to wild crowds and real NCAA Basketball announcers. NCAA Basketball 10 builds on a new game engine introduced last year, refining andNCAA Basketball 10 brings the emotion, intensity, and spirit of college basketball by capturing every detail in the stadium, from cheerleaders and mascots to wild crowds and real NCAA Basketball announcers. NCAA Basketball 10 builds on a new game engine introduced last year, refining and improving core gameplay functions, and adding more depth to the popular 'styles of play' and 'set your tempo' features, making NCAA Basketball 10 a strategic and entirely unique basketball gameplay experience. [Electronic Arts]… Expand"}, {"name": "Gyromancer", "details_link": "https://www.metacritic.com/game/xbox-360/gyromancer", "publisher": "Square Enix", "release_date": "Nov 18 2009", "developers": ["Square Enix", "PopCap"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/6fd357a642fd81baf79e94cc526bf5be-98.jpg", "descriptions": "[Xbox Live Arcade]  Gyromanceris a puzzle-roleplaying game (RPG) featuring a unique battle system based on Bejeweled Twist combined with elements of Square Enix role-playing games.  Battle system: Gyromancer has a new battle system based on Bejeweled Twist. Command unique beasts to battle[Xbox Live Arcade]  Gyromanceris a puzzle-roleplaying game (RPG) featuring a unique battle system based on Bejeweled Twist combined with elements of Square Enix role-playing games.  Battle system: Gyromancer has a new battle system based on Bejeweled Twist. Command unique beasts to battle your foes. Hidden treasures: Search the map for items, coins, and new beasts to fight at your side. Gain levels in battle and acquire powerful new beasts. Deadly mage: Assume the role of Rivel, a deadly mage, as he rids Aldemona Wood of a brooding darkness. [Square Enix]… Expand"}, {"name": "Killing Floor 2", "details_link": "https://www.metacritic.com/game/playstation-4/killing-floor-2", "publisher": "Deep Silver", "release_date": "Nov 16 2016", "developers": ["Tripwire Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/002680636dbcefb618ff517d8409beed-98.jpg", "descriptions": "In KILLING FLOOR 2 players descend into continental Europe where the outbreak caused by Horzine Biotech’s failed experiment has quickly spread and gained unstoppable momentum, essentially paralyzing the European Union— Just one month after the events in the original KILLING FLOOR, theIn KILLING FLOOR 2 players descend into continental Europe where the outbreak caused by Horzine Biotech’s failed experiment has quickly spread and gained unstoppable momentum, essentially paralyzing the European Union— Just one month after the events in the original KILLING FLOOR, the specimen clones are everywhere and civilization is in disarray; communications have failed, governments have collapsed, and military forces have been systematically eradicated. The people of Europe know survival and self-preservation too well and lucky survivors have gone into hiding.… Expand"}, {"name": "Baten Kaitos Origins", "details_link": "https://www.metacritic.com/game/gamecube/baten-kaitos-origins", "publisher": "Nintendo", "release_date": "Sep 25 2006", "developers": ["Monolith Soft", "Namco Bandai Games"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/77c95abb356071bb8bdf256f2dc96d4d-98.jpg", "descriptions": "Baten Kaitos Origins takes place 20 years before the first Baten Kaitos game. It explains how the diabolical Emperor Geldoblame rose to power, and it also fills in many details about the heroes from the first title. In addition, players will learn about the origins of the world itself andBaten Kaitos Origins takes place 20 years before the first Baten Kaitos game. It explains how the diabolical Emperor Geldoblame rose to power, and it also fills in many details about the heroes from the first title. In addition, players will learn about the origins of the world itself and why the Lost Ocean is returning. The hero, a blue-haired young man named Sagi, was sent to assassinate the Emperor but found the job had been done for him. Blamed for the death, he's now on the run with two friends - a robot named Guillo and a young woman named Milly. In the initial stages, the player's party will progress in a linear fashion, moving from one area to the next along a set path. After playing the game for a few hours, players will acquire a ship that lets them visit areas in the order of their choosing, allowing them to either pursue optional side quests or blast through the main mission as they see fit. Unlike traditional RPGs, where characters gain levels in categories such as strength and agility, the majority of leveling-up occurs by procuring better Magnus cards. There are more than 600 different Magnus cards in Baten Kaitos Origins, some of which have truly fantastical properties. Players can acquire cards in many different ways, including trading, buying, winning as spoils of war or by creating them themselves.… Expand"}, {"name": "The Persistence", "details_link": "https://www.metacritic.com/game/xbox-one/the-persistence", "publisher": "Firesprite", "release_date": "May 21 2020", "developers": ["Firesprite"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/3/6f5772b85723dca60bcb160672d307af-98.jpg", "descriptions": "The Persistence challenges you to survive aboard a doomed starship, overrun with horrific and murderous abberations.  Explore, evade and fight your way through the depths to bring the craft home."}, {"name": "Deus Ex: Mankind Divided - System Rift", "details_link": "https://www.metacritic.com/game/playstation-4/deus-ex-mankind-divided---system-rift", "publisher": "Square Enix", "release_date": "Sep 27 2016", "developers": ["Eidos Montreal"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/d29367ab2dc6112224189cc37246e231-98.jpg", "descriptions": "In Deus Ex: Mankind Divided – System Rift, you will re-unite with Frank Pritchard, Adam’s friend and former colleague at Sarif Industries, and assist him in hunting down information on the mysterious Santeau Group. Desperate to get more information, Pritchard targets one of the most secureIn Deus Ex: Mankind Divided – System Rift, you will re-unite with Frank Pritchard, Adam’s friend and former colleague at Sarif Industries, and assist him in hunting down information on the mysterious Santeau Group. Desperate to get more information, Pritchard targets one of the most secure data banks ever created – the Palisade Blade. In agreeing to help, Adam may also be able to uncover hints as to who the illuminati really are.… Expand"}, {"name": "Hitman - Intro Pack", "details_link": "https://www.metacritic.com/game/xbox-one/hitman---intro-pack", "publisher": "Square Enix", "release_date": "Mar 11 2016", "developers": ["Io Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/5/9e0de01c43ef633f798377e9cafd6910-98.jpg", "descriptions": "With the Intro Pack, you'll get an introduction to the world of HITMAN, with the Prologue and Paris episode. You'll get full access to Contracts Mode, Escalation Mode, elusive targets and all other live content."}, {"name": "Back to the Future: The Game - Episode V: OUTATIME", "details_link": "https://www.metacritic.com/game/pc/back-to-the-future-the-game---episode-v-outatime", "publisher": "Telltale Games", "release_date": "Jun 23 2011", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PC"], "genres": ["Action Adventure", "Adventure", "Sci-Fi", "Sci-Fi", "3D", "Third-Person"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/d39cbaec90b2cc437bb2f8c5f888ac6a-98.jpg", "descriptions": "OUTATIME is the fifth and final episode in the Back to the Future: The Game series."}, {"name": "Stuntman: Ignition", "details_link": "https://www.metacritic.com/game/xbox-360/stuntman-ignition", "publisher": "THQ", "release_date": "Aug 28 2007", "developers": ["Paradigm Entertainment"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/1a234fb49c2fce102ca4c86804763f73-98.jpg", "descriptions": "Stuntman: Ignition is the next installment in the Stuntman franchise. The game plunges gamers into the adrenaline-fueled role of a Hollywood stunt driver, challenging them to pull off the most breathtaking, death-defying stunts ever filmed. Players showcase their skills in a wide variety ofStuntman: Ignition is the next installment in the Stuntman franchise. The game plunges gamers into the adrenaline-fueled role of a Hollywood stunt driver, challenging them to pull off the most breathtaking, death-defying stunts ever filmed. Players showcase their skills in a wide variety of big-budget action films, commercial shoots and tournaments while commanding more than 25 unique vehicles, including exotic sports cars, motorcycles and hovercraft. Online multiplayer allows rival stuntmen to battle it out on the film sets and custom built back-lot arenas, or players can devise their own insane stunt runs and challenge other stuntmen at their own game. [THQ]… Expand"}, {"name": "Tomb Raider: Underworld", "details_link": "https://www.metacritic.com/game/playstation-3/tomb-raider-underworld", "publisher": "Eidos Interactive", "release_date": "Nov 18 2008", "developers": ["Nixxes Software"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/adf805024d621eaaab924056063c0209-98.jpg", "descriptions": "Master your surroundings: Reach new heights with the broadest range of acrobatic abilities and utilize objects within the environment to uncover new paths to explore. Explore epic and unknown worlds: Discover ancient mysteries of the underworld hidden within the coast of Thailand, frozenMaster your surroundings: Reach new heights with the broadest range of acrobatic abilities and utilize objects within the environment to uncover new paths to explore. Explore epic and unknown worlds: Discover ancient mysteries of the underworld hidden within the coast of Thailand, frozen islands of the Arctic Sea, the jungles of Mexico, and more. Each level is an elaborate multi-stage puzzle masked within an interactive environmental playground offering more flexibility over how the area is solved. New range of combat options: Choose to pacify or kill, target multiple enemies at once with the new dual-target system, and shoot with one hand while suspended with the other. New state-of-the-art gear: Utilize the latest technology in Lara's upgraded inventory to navigate the world including: Active Sonar map: A revolutionary new tool that emits an active sonar ping to create a 3D image of Lara's surroundings, perfect for uncovering hidden items and locations; Multi-purpose grapple: A claw-like device with a high-tension cable designed for climbing, rappelling, performing wall runs and manipulating objects within the environment; All-terrain hybrid motorbike: A unique vehicle design built to drive on everything from mud to snow and ice. [Eidos Interactive]… Expand"}, {"name": "Honey, I Joined a Cult", "details_link": "https://www.metacritic.com/game/pc/honey-i-joined-a-cult", "publisher": "Team17", "release_date": "Nov  2 2022", "developers": ["Sole Survivor Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/dd0f2919ca981efd7c869f8460e40ece-98.jpg", "descriptions": "It's time to start working towards that ultimate goal of enlightenment, faith and money... lots and lots of money. Create, customise, expand and manage your own cult whilst listening to funky music in Honey, I Joined a Cult!"}, {"name": "Hakuoki: Edo Blossoms", "details_link": "https://www.metacritic.com/game/playstation-vita/hakuoki-edo-blossoms", "publisher": "Idea Factory", "release_date": "Mar 13 2018", "developers": ["Otomate"], "platforms": ["PC", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/b7a6ea6e38b81a3cdc19f17ab514c456-98.jpg", "descriptions": "This is a story about a girl who allies with the warriors of the Shinsengumi, who are struggling to uphold their faith in an era of rapid social change in Japan, and the fate of those who sought to resist that change."}, {"name": "Speed Racer", "details_link": "https://www.metacritic.com/game/ds/speed-racer", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "May  6 2008", "developers": ["Virtuos"], "platforms": ["PlayStation 2", "DS"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Drag", "Futuristic", "Drag"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/e4adea8eed36d9fbc946cfea4053e2fb-98.jpg", "descriptions": "Players take on the role of the characters from the Speed Racer film, getting behind the wheels of each character’s signature vehicles to experience first hand the film’s high adrenaline, combative racing style.  The car-fu style of action within the game closely represent the action stylePlayers take on the role of the characters from the Speed Racer film, getting behind the wheels of each character’s signature vehicles to experience first hand the film’s high adrenaline, combative racing style.  The car-fu style of action within the game closely represent the action style designed by the Wachowski brothers for the film itself as they lend direction and assets to the development team directly from their Berlin set. Written and directed by the Wachowski brothers and produced by Joel Silver, Speed Racer is based on the classic series created by anime pioneer Tatsuo Yoshida. Speed Racer follows the young race car driver Speed in his quest for glory on and off the track in his thundering Mach 5. The film features other characters that fans of the show remember, including Speed's family and his mysterious arch-rival, Racer X. [Warner Bros.]… Expand"}, {"name": "The Suffering: Ties That Bind", "details_link": "https://www.metacritic.com/game/playstation-2/the-suffering-ties-that-bind", "publisher": "Midway", "release_date": "Sep 26 2005", "developers": ["Surreal Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/6492a9cd72fa36d4a3c2b61bbcb22b08-98.jpg", "descriptions": "The Suffering: Ties That Bind is a revolutionary action-horror game that emphasizes the disturbing terror of its predecessor, with new twisted creatures and a few familiar faces. Set in the unforgiving streets and prisons of Baltimore, the player once again controls Torque as he seeksThe Suffering: Ties That Bind is a revolutionary action-horror game that emphasizes the disturbing terror of its predecessor, with new twisted creatures and a few familiar faces. Set in the unforgiving streets and prisons of Baltimore, the player once again controls Torque as he seeks revenge against the mysterious grand manipulator Blackmore, a man somehow tied to the death of Torque's family. Players explore the tough inner-city, with poverty and urban injustices trapping people just as effectively as a physical prison. The unique morality system returns, as players delve into the perverse world of Torque's sanity to discover his past and struggle to control his future. [Midway]… Expand"}, {"name": "Awesomenauts", "details_link": "https://www.metacritic.com/game/playstation-3/awesomenauts", "publisher": "DTP Entertainment", "release_date": "May  1 2012", "developers": ["DTP Entertainment", "Ronimo Games"], "platforms": ["PC", "PlayStation 4", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "6  Online", "genres": ["Action", "Strategy", "Real-Time", "Fighting", "2D", "MOBA", "MOBA"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/ca129fde04c6a535bdda7052931d8ac6-98.jpg", "descriptions": "The game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modernThe game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modern online multiplayer functionality, the action-packed gameplay offers everything the 16-bit generation and modern gamers love.… Expand"}, {"name": "NCAA Football 07", "details_link": "https://www.metacritic.com/game/psp/ncaa-football-07", "publisher": "EA Sports", "release_date": "Jul 18 2006", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "Xbox 360", "PSP"], "num_players": "1 Player", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/7680d23fac9b2e86be866e0ee98bf5b2-98.jpg", "descriptions": "Momentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintainMomentum changes everything - now college football's most celebrated videogame turns the tide with NCAA Football 07. Whether battling your biggest rival or playing for the first-ever BCS National Championship Game in Dynasty Mode, success on the field depends on your ability to maintain momentum. Featuring unprecedented graphics that capture every moment in complete detail—from the authenticity of the stadiums, mascots, and marching bands, to the true-to-life look and feel of the players on the field. [Electronic Arts]… Expand"}, {"name": "The Golf Club 2019 featuring PGA Tour", "details_link": "https://www.metacritic.com/game/playstation-4/the-golf-club-2019-featuring-pga-tour", "publisher": "2K Games", "release_date": "Aug 28 2018", "developers": ["HB Studios Multimedia"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Sports", "Individual", "Golf", "Sim"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/8/048d5c4d38cbebafeb8a41c5220f9e2f-98.jpg", "descriptions": "Do you have what it takes to win the FedExCup on the PGA Tour? Compete in the all-new officially licensed PGA Tour Career mode. Play on famous courses like TPC Boston, TPC Sawgrass and more."}, {"name": "Tesla vs Lovecraft", "details_link": "https://www.metacritic.com/game/xbox-one/tesla-vs-lovecraft", "publisher": "10tons", "release_date": "Mar 16 2018", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/39be810e1cde2f8f6cd01824bf8be460-98.jpg", "descriptions": "Tesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal basedTesla vs Lovecraft is an intense top-down twin stick arena shooter. Play as the enigmatic inventor Nikola Tesla harnessing the static energy to power up Tesla-Mech and give the lovecraftian nightmares a lesson in horror!\r Tesla vs Lovecraft is a top-down twin stick shooter with goal based levels. The games highlight features are Quantum Teleportation, which allows the player to warp short distances even through solid objects, and the Tesla-Mech, which provides the player an immense boost to firepower for a limited time.\r Genre hallmarks such as a large arsenal of weapons, a multitude of player empowering perks, monster crushing powerups, and secondary weapon abilities are also included.… Expand"}, {"name": "Actual Sunlight", "details_link": "https://www.metacritic.com/game/playstation-vita/actual-sunlight", "publisher": "Will O'Neill", "release_date": "Aug 11 2015", "developers": ["Will O'Neill", "WZO Games"], "platforms": ["PC", "Switch", "PlayStation Vita"], "genres": ["Action", "Adventure", "General"], "meta_score": 75, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/5b4eaf8542f9cb40d6f45c13b91450e7-98.jpg", "descriptions": "Actual Sunlight is a short interactive story about love, depression and the corporation. The game puts you in the role of Evan Winter, a young professional in Toronto, as he moves through three distinct periods of his life. The story is linear, unavoidable and (hopefully) thought-provoking.Actual Sunlight is a short interactive story about love, depression and the corporation. The game puts you in the role of Evan Winter, a young professional in Toronto, as he moves through three distinct periods of his life. The story is linear, unavoidable and (hopefully) thought-provoking. You experience his perceptions, fall under the consequences of his decisions, and meet everyone who didn't change him.… Expand"}, {"name": "ETHER One", "details_link": "https://www.metacritic.com/game/playstation-4/ether-one", "publisher": "White Paper Games", "release_date": "May  5 2015", "developers": ["White Paper Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["General", "Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/8/242b9e606d947fe0971c3a6722296a3e-98.jpg", "descriptions": "What if someone had the power to keep your loved ones memories alive? Fix memories, restore life. The fragility of the human mind is the subject of Ether One, a moving first-person adventure that subtly experiments with your feelings. Choose one of two paths through the world. One lets youWhat if someone had the power to keep your loved ones memories alive? Fix memories, restore life. The fragility of the human mind is the subject of Ether One, a moving first-person adventure that subtly experiments with your feelings. Choose one of two paths through the world. One lets you play through the game at your own pace, unfolding a story free from puzzles or challenges. The other is a deeper, more involving route, on which you'll encounter complex problems that must be solved to help rebuild a clients memory.… Expand"}, {"name": "Hustle Kings", "details_link": "https://www.metacritic.com/game/playstation-vita/hustle-kings", "publisher": "SCEA", "release_date": "Feb 21 2012", "developers": ["VooFoo Studios"], "platforms": ["PlayStation 3", "PlayStation 4", "PlayStation Vita"], "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/fb8f7c1df4110d7994279348ec7106f8-98.jpg", "descriptions": "Hustle Kings is a pool game for the Next Generation Portable that utilizes the touch screen and rear touch pad."}, {"name": "Resident Evil: The Darkside Chronicles", "details_link": "https://www.metacritic.com/game/wii/resident-evil-the-darkside-chronicles", "publisher": "Capcom", "release_date": "Nov 17 2009", "developers": ["Cavia Inc."], "platforms": ["PlayStation 3", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Rail", "Light Gun", "Rail"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/ed3a6bfb60433e1e9d6b0ad77c18c695-98.jpg", "descriptions": "Resident Evil: The Darkside Chronicles's story is based on \"Resident Evil 2\" and includes the popular characters, Leon S Kenney and Claire Redfield. Its on-rails style gameplay and active camera creates a more immersive Chronicles survival experience. As in the last installment, this is aResident Evil: The Darkside Chronicles's story is based on \"Resident Evil 2\" and includes the popular characters, Leon S Kenney and Claire Redfield. Its on-rails style gameplay and active camera creates a more immersive Chronicles survival experience. As in the last installment, this is a first-person game with extreme shooting gameplay and interactive pathways. Filling in many of the missing pieces of storyline that were not covered in the original Umbrella Chronicles, Resident Evil: The Darkside Chronicles gives hardcore fans the chance to re-live some of the most classic moments of the Resident Evil franchise, while allowing new players to take advantage of the intense action-horror experience only possible on the Wii. Gamers can choose to take on their enemies with the help of an A.I.-controlled character or enlist the help of a friend to fight via two-player co-op. Adding new dimension and strategy to the arcade-style gameplay in the Chronicles experience, the new Evade system will utilize the Wii Remote for a more intense experience when fighting enemies. [Capcom]… Expand"}, {"name": "Command & Conquer: Red Alert 3", "details_link": "https://www.metacritic.com/game/playstation-3/command-conquer-red-alert-3", "publisher": "Electronic Arts", "release_date": "Mar 23 2009", "developers": ["EA LA"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/d7b30a2d1ae7d80fbe876c15ad407c3d-98.jpg", "descriptions": "Command & Conquer Red Alert 3 blends the over-the-top humor and fast, fluid and fun gameplay the series is known for with exciting new innovations for the RTS genre, including fully co-operative, story driven-campaigns and an unprecedented emphasis on naval gameplay. PS3 gamers use theCommand & Conquer Red Alert 3 blends the over-the-top humor and fast, fluid and fun gameplay the series is known for with exciting new innovations for the RTS genre, including fully co-operative, story driven-campaigns and an unprecedented emphasis on naval gameplay. PS3 gamers use the intuitive Command Stick 2.0 interface, the series' signature control system that allows gamers of all skill levels to easily and efficiently command their units on the battlefield. Command & Conquer Red Alert 3: Ultimate Edition also packs in a tremendous amount of bonus content, including: Five exciting new multiplayer maps; Behind the scenes videos and trailers, including Raising the Iron Curtain Documentary, From Pens to Pixels, the Girls of Red Alert 3, Bloopers & Outtakes, the Red Alert 3 Remix and many more! PS3 exclusive Command & Conquer TV programming, including PS3-dedicated BattleCast PrimeTime and a special episode of Command School focused on tips, tricks and strategies from the development team. In-depth profiles on all the Red Alert 3 Units. The official Red Alert 3 soundtrack. [Electronic Arts]… Expand"}, {"name": "Naruto: Ultimate Ninja", "details_link": "https://www.metacritic.com/game/playstation-2/naruto-ultimate-ninja", "publisher": "Namco Bandai Games America", "release_date": "Jun 26 2006", "developers": ["CyberConnect2"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/00303c5bef90de4f8cb0f04109f8e595-98.jpg", "descriptions": "Join Naruto and his friends on their Ninja Academy quests as they battle the best in the land. Perfect your ninja skills to earn money and unlock tons of bonus content. Do you have what it takes to become the ultimate ninja? Be your favorite ninja: Fight as one of over 12 playable charactersJoin Naruto and his friends on their Ninja Academy quests as they battle the best in the land. Perfect your ninja skills to earn money and unlock tons of bonus content. Do you have what it takes to become the ultimate ninja? Be your favorite ninja: Fight as one of over 12 playable characters including Naruto, Sasuke, Sakura, Kakashi, Rock Lee and many more. Switch between 12 interactive stages mid-combat to gain a tactical advantage while performing powerful ninjutsu moves as seen in the hit television series. Lethal super attacks: Increase your chakra and unleash multi-level super attacks to ascend the ranks and become a full-fledged ninja. [Namco Bandai]… Expand"}, {"name": "Rayman 3: Hoodlum Havoc", "details_link": "https://www.metacritic.com/game/xbox/rayman-3-hoodlum-havoc", "publisher": "Ubisoft", "release_date": "Mar 18 2003", "developers": ["Ubisoft"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 75, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/3/8b9c1974de39655c46808d58946b8e5d-98.jpg", "descriptions": "Rayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge theRayman's universe has fallen into a chaotic world of wicked powers, bizarre characters, and merciless combat. When Globox accidentally swallows the Lord of the Dark Lums, a fanatic army of trigger-happy Hoodlums wreaks total havoc to get their Lord back. Rayman's only chance is to purge the Dark Lum Lord from the manic Globox, scour the lands for new powers, and battle with hordes of Hoodlum soldiers. Even without arms or legs, Rayman can still unleash an arsenal of special powers and fighting moves.… Expand"}, {"name": "Activision Anthology", "details_link": "https://www.metacritic.com/game/playstation-2/activision-anthology", "publisher": "Activision", "release_date": "Nov 19 2002", "developers": ["Contraband Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/2e74564ce6ea9ce832d6f4a9b01f4687-98.jpg", "descriptions": "A classic gaming compilation that delivers over 40 Activision games for the Atari 2600 from Barnstorming to River Raid, plus never-before-released titles! For the total retro gaming experience, you can choose from \"Classic\" mode or \"3D Enhanced\" options which offer a challenging twist toA classic gaming compilation that delivers over 40 Activision games for the Atari 2600 from Barnstorming to River Raid, plus never-before-released titles! For the total retro gaming experience, you can choose from \"Classic\" mode or \"3D Enhanced\" options which offer a challenging twist to these timeless classics. You are also able to go online and download new games and demos, as well as historical info about Activision, the games and their creators. An 80's hit soundtrack featuring favorite artists from the decade brings the nostalgia full circle.… Expand"}, {"name": "Chicken Run", "details_link": "https://www.metacritic.com/game/playstation/chicken-run", "publisher": "Eidos Interactive", "release_date": "Nov 13 2000", "developers": ["Blitz Games"], "platforms": ["PC", "PlayStation"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/c4682aba1f2c8c593d9660e8abdebc18-98.jpg", "descriptions": "Behind the barbed wire fence of Tweedy Farm, Ginger is a chicken with a mission. Fearing for the lives of her friends, she is determined to escape to freedom before it is too late. To do this she enlists the help of Rocky, the smooth talking, flying Rooster...or is he?\r Guide a rescueBehind the barbed wire fence of Tweedy Farm, Ginger is a chicken with a mission. Fearing for the lives of her friends, she is determined to escape to freedom before it is too late. To do this she enlists the help of Rocky, the smooth talking, flying Rooster...or is he?\r Guide a rescue attempt to get all of the chickens to safety before they end up as pies. To do this you will have to sneak around the farm collecting objects necessary for the escape. Be careful not to disturb the dogs and avoid being caught by Mr. and Mrs. Tweedy at all costs in this humorous, 3D action game. … Expand"}, {"name": "Call of the Sea", "details_link": "https://www.metacritic.com/game/xbox-series-x/call-of-the-sea", "publisher": "Raw Fury", "release_date": "Dec  8 2020", "developers": ["Out of the Blue", "Inc.", "Out of the Blue Games S.L."], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/176ff8743bfe9c8c0ddfb0e7d6dad8b8-98.jpg", "descriptions": "A weird tale of otherworldly mystery. Call of the Sea is a first-person adventure puzzle game set in the 1930s that tells the story of Norah, a woman on the trail of her missing husband's expedition. The search takes place on a strange but beautiful island in the South Pacific, filled withA weird tale of otherworldly mystery. Call of the Sea is a first-person adventure puzzle game set in the 1930s that tells the story of Norah, a woman on the trail of her missing husband's expedition. The search takes place on a strange but beautiful island in the South Pacific, filled with secrets waiting to be unearthed. It is an otherworldly tale of mystery, adventure, and self-discovery.… Expand"}, {"name": "A Rose in the Twilight", "details_link": "https://www.metacritic.com/game/playstation-vita/a-rose-in-the-twilight", "publisher": "NIS America", "release_date": "Apr 11 2017", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "PlayStation Vita"], "genres": ["Action", "Platformer", "2D"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/33ef0dc8f5ef9dfad425f4b38f9b6b8f-98.jpg", "descriptions": "A girl awakens in a castle void of color and time, affixed with the Curse of Thorns upon her back. After meeting a sleeping giant, the two work together to escape. Help them unravel the mystery of the thorns and the history behind the somber castle."}, {"name": "Absolver", "details_link": "https://www.metacritic.com/game/pc/absolver", "publisher": "Devolver Digital", "release_date": "Aug 29 2017", "developers": ["Sloclap"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/979f02d245b1948e13b7d3a27e55ceef-98.jpg", "descriptions": "Absolver is an online multiplayer combat game where players are placed behind the mask of a Prospect under control of the Guides, the new rulers of the fallen Adal Empire, who will determine your worth in joining their elite corps of Absolvers."}, {"name": "Dreamfall: The Longest Journey", "details_link": "https://www.metacritic.com/game/pc/dreamfall-the-longest-journey", "publisher": "Aspyr", "release_date": "Apr 17 2006", "developers": ["Funcom"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 75, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/559a93d182fe52ca768883faa66dc0cc-98.jpg", "descriptions": "Dreamfall continues the story of \"The Longest Journey,\" one of the most critically acclaimed adventure games ever made, and brings adventure gaming into a new era. Focusing on story and characters, Dreamfall features unparalleled 3D visuals, advanced character animations, stunning audio, andDreamfall continues the story of \"The Longest Journey,\" one of the most critically acclaimed adventure games ever made, and brings adventure gaming into a new era. Focusing on story and characters, Dreamfall features unparalleled 3D visuals, advanced character animations, stunning audio, and innovative gameplay - wrapped in a unique and magical ambience. Dreamfall is set in the 23rd Century, where a young woman accidentally uncovers a conspiracy related to dreams; a conspiracy that may herald the destruction of the twin worlds of science and magic. Confronted by mysteries that she cannot resolve on her own, she must seek assistance from the one person who might have the answers: April Ryan, the heroine of \"The Longest Journey.\" [Funcom]… Expand"}, {"name": "Tormented Souls", "details_link": "https://www.metacritic.com/game/pc/tormented-souls", "publisher": "PQube", "release_date": "Aug 27 2021", "developers": ["Dual Effect"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/039604d8f020bef9a490e3fd46ab3e75-98.jpg", "descriptions": "While investigating the disappearance of twin girls at Winterlake - something terrible happens to Caroline Walker. Waking in the dead of night, naked in a bathtub - and hooked up to some decrepit medical equipment, Caroline must fight for her life as she explores the halls of an abandonedWhile investigating the disappearance of twin girls at Winterlake - something terrible happens to Caroline Walker. Waking in the dead of night, naked in a bathtub - and hooked up to some decrepit medical equipment, Caroline must fight for her life as she explores the halls of an abandoned Mansion turned hospital.Tormented Souls deliberately sets out to draw inspiration from classic survival horror. From Resident Evil and Silent Hill, to Alone in the Dark - Tormented Souls is a modern take on the fixed-perspective adventure, offering a modernised control scheme and a more dynamic camera, while retaining everything that made those games so beloved by fans.… Expand"}, {"name": "Remothered: Tormented Fathers", "details_link": "https://www.metacritic.com/game/playstation-4/remothered-tormented-fathers", "publisher": "Stormind Games", "release_date": "Jul 25 2018", "developers": ["Stormind Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/6bd9faa26da4fbec8320cc0dc2856cfc-98.jpg", "descriptions": "Remothered: Tormented Fathers is pure and realistic survival horror. The story revolves around Rosemary Reed, a fascinating 35-year-old woman, who reaches Richard Felton’s house, in order to investigate the disappearance of a girl called Celeste."}, {"name": "TrackMania DS", "details_link": "https://www.metacritic.com/game/ds/trackmania-ds", "publisher": "Focus Home Interactive", "release_date": "Mar 17 2009", "developers": ["Firebrand Games"], "platforms": "DS", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/e815b8d9a35c38b989dfa74c95b1bfe0-98.jpg", "descriptions": "TrackMania, the series of racing games focusing on fun and frantic racing, now makes its debut on the Nintendo DS. Far from hardcore driving simulations, TrackMania is based on the fun and the spectacular aspect of racing. With TrackMania DS, you drive at mind-blowing speeds on incredibleTrackMania, the series of racing games focusing on fun and frantic racing, now makes its debut on the Nintendo DS. Far from hardcore driving simulations, TrackMania is based on the fun and the spectacular aspect of racing. With TrackMania DS, you drive at mind-blowing speeds on incredible tracks made of jumps, loops, turbo boost pads and many other crazy design elements. Just like the renowned PC version, TrackMania DS offers a track editor that lets you create your own unique and exciting tracks from hundreds of different design blocks, giving the game near-infinite replay value. [Focus Home Interactive]… Expand"}, {"name": "Metal Gear Solid V: Ground Zeroes", "details_link": "https://www.metacritic.com/game/playstation-4/metal-gear-solid-v-ground-zeroes", "publisher": "Konami", "release_date": "Mar 18 2014", "developers": ["Kojima Productions"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 75, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/0f015d7c8d40433380725ddadff2223d-98.jpg", "descriptions": "Ground Zeroes showcases Kojima Productions' FOX Engine, a true next-generation game engine which promises to revolutionize the Metal Gear Solid experience. The first Metal Gear Solid title to offer open world gameplay. Ground Zeroes offers total freedom of play: how missions are undertakenGround Zeroes showcases Kojima Productions' FOX Engine, a true next-generation game engine which promises to revolutionize the Metal Gear Solid experience. The first Metal Gear Solid title to offer open world gameplay. Ground Zeroes offers total freedom of play: how missions are undertaken is entirely down to the user. Unrestricted stealth: Imagine classic Metal Gear gameplay but with no restrictions or boundaries. Players use intelligence and cerebral strategy to sneak their way through entire missions, or go in all guns blazing. Each will have different effects on game consequences and advancement. Multiple missions and tasks - Ground Zeroes boasts a central story mode and Side-Ops missions ranging from tactical action, aerial assaults and \"covert\" missions that will be sure to surprise. Ground Zeroes users will benefit from a clean in-game HUD that shows the minimal amount of on-screen data to give a more intense gaming experience. [Konami]… Expand"}, {"name": "Deemo Reborn", "details_link": "https://www.metacritic.com/game/playstation-4/deemo-reborn", "publisher": "Sony Music Entertainment", "release_date": "Nov 21 2019", "developers": ["Rayark Inc."], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/2e64e7492e973020cc72b414619fda0e-98.jpg", "descriptions": "Rayark’s classic game Deemo is reborn on the PS4 console with a brand-new look. Having both TV/VR mode, this title allows you to immerse in the fantastical music performances and adventurous world explorations."}, {"name": "Ace Combat X: Skies of Deception", "details_link": "https://www.metacritic.com/game/psp/ace-combat-x-skies-of-deception", "publisher": "Namco Bandai Games America", "release_date": "Oct 23 2006", "developers": ["Project Aces"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Simulation", "Flight", "Modern Jet", "Modern Jet", "Combat"], "meta_score": 75, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/fae1a059e1885d66e4ac7ee99520eb6c-98.jpg", "descriptions": "With licensed aircraft such as the F-14D and Tornado F3, and a strategic AI system where the course of the player’s actions directly affect their mission objectives, Ace Combat X: Skies of Deception allows the player to take on the role of an ace pilot trying to liberate his home country ofWith licensed aircraft such as the F-14D and Tornado F3, and a strategic AI system where the course of the player’s actions directly affect their mission objectives, Ace Combat X: Skies of Deception allows the player to take on the role of an ace pilot trying to liberate his home country of Aurelia from its neighbor, Leasath. A country filled with secretive motives veiled behind long-internal conflicts, Leasath, has invaded and taken over Aurelia. Defending the invaded country, the player's mission is to take them to the battle-filled skies in order to take down the enemy and restore freedom and peace to his homeland. Rounding out the list of features, Ace Combat X: Skies of Deception allows players to tune their original aircrafts with parts unlocked in Campaign Mode to further enhance their flying experience. [Namco Bandai]… Expand"}, {"name": "F.E.A.R. 3", "details_link": "https://www.metacritic.com/game/xbox-360/fear-3", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Jun 21 2011", "developers": ["Day 1 Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Modern", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/e4e3b3734d9c7c2b1ba15880460d6399-98.jpg", "descriptions": "Alma returns in F.E.A.R. 3 but this time her sons Point Man and Paxton Fettel introduce divergent co-op, giving players distinctly different abilities affecting their own play as well as the experience of their co-op partner. Gamers participate in single player or co-op modes as Point Man, aAlma returns in F.E.A.R. 3 but this time her sons Point Man and Paxton Fettel introduce divergent co-op, giving players distinctly different abilities affecting their own play as well as the experience of their co-op partner. Gamers participate in single player or co-op modes as Point Man, a genetically enhanced super soldier originally introduced in F.E.A.R., or they can play cooperatively as his conniving brother Paxton Fettel, whose incredible telekinetic power has given him life beyond the grave.… Expand"}, {"name": "Battle of Britain II: Wings of Victory", "details_link": "https://www.metacritic.com/game/pc/battle-of-britain-ii-wings-of-victory", "publisher": "GMX Media", "release_date": "Sep 12 2005", "developers": ["Shockwave Productions"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 75, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/14f8cead9cf403bbebfc83162229be8a-98.jpg", "descriptions": "Battle of Britain 2 Wings of Victory recreates the fierce and famous air battles southern England in 1940. The game delivers explosive fun for veteran and casual gamers alike, and occurs over a vast and living world below which will be forever known as one the world’s most decisive momentsBattle of Britain 2 Wings of Victory recreates the fierce and famous air battles southern England in 1940. The game delivers explosive fun for veteran and casual gamers alike, and occurs over a vast and living world below which will be forever known as one the world’s most decisive moments in history. The simulation allows the player to either act as the supreme commander of either side, or simply click “fly” and let your generals manage the war below. As commander, you can control the war down to a single aircraft or building in a world where thousands upon thousands battle for supremacy. Thousands of targets including every plane, factory, airfield, and radar station have a specific role and impact on the progress of the war below. As the enormous campaign plays out below, you will observe both allied and enemy flights carrying out their daily missions. You can take your commanders hat off and jump in the cockpit of the British Hurricane, Spitfire, German Messerschmitt, Stuka dive bomber, or man the gunstations of the Dornier Do17, Heinkel He111, and Ju-88 level bombers. As a pilot, all you need to do is destroy the enemy when you can and get you and your comrades home alive. [GMX Media]… Expand"}, {"name": "Tony Hawk's American Wasteland", "details_link": "https://www.metacritic.com/game/xbox-360/tony-hawks-american-wasteland", "publisher": "Activision", "release_date": "Nov 16 2005", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Individual", "Skateboarding", "Skateboarding", "Skate / Skateboard"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/571d5eeab9a893c35d04b1f22966bf3c-98.jpg", "descriptions": "No levels. No load times. Just never-ending action that doesn't stop until you leave the game. Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedom to skate, or bike, throughout a rich, expansive open environment. Once you arrive in Los Angeles, theNo levels. No load times. Just never-ending action that doesn't stop until you leave the game. Tony Hawk's American Wasteland gives you - for the first time ever in a Hawk game - the freedom to skate, or bike, throughout a rich, expansive open environment. Once you arrive in Los Angeles, the vast city that gave birth to skate culture, the sky's the limit as you progress through the Wasteland story and choose missions that will have you immersed in the action without ever skating the same line twice. New on the board tricks include the Bert slides, Natas spins handstands, and one-footed grinds and manuals. New off the board tricks include wall runs, wall flips, and charged jumps. Choose Board Or Bike: For the first time, you can choose to ride BMX bikes throughout the entire game, with all-new physics, a BMX specific control system and several BMX-specific goals. Customize Like Crazy: Enter and explore dozens of shops in game to customize your gear and your look! Check out skate shops, barbershops, tattoo parlors, and clothing stores as you accomplish goals and earn cash. [Activision]… Expand"}, {"name": "MVP 06 NCAA Baseball", "details_link": "https://www.metacritic.com/game/xbox/mvp-06-ncaa-baseball", "publisher": "EA Sports", "release_date": "Jan 18 2006", "developers": ["EA Canada"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/1bbd1edda5ce83771039df3bd347a9ae-98.jpg", "descriptions": "NCAA Baseball makes its video game debut with MVP 06 NCAA Baseball. You can control all the aspects of your throws and swings with the right analog stick. The game includes licensed teams, equipment, and ballparks from around the country. You can also customize many aspects of gameplay byNCAA Baseball makes its video game debut with MVP 06 NCAA Baseball. You can control all the aspects of your throws and swings with the right analog stick. The game includes licensed teams, equipment, and ballparks from around the country. You can also customize many aspects of gameplay by creating ballparks, players, and universities, and by taking part in recruiting and in-depth stat tracking. In addition to the Road to Omaha career mode, the game features various multiplayer games.… Expand"}, {"name": "Manifold Garden", "details_link": "https://www.metacritic.com/game/switch/manifold-garden", "publisher": "William Chyr Studio LLC", "release_date": "Aug 18 2020", "developers": ["William Chyr Studio LLC"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/b3d6c2df66ce46547b5d42afb3927cf1-98.jpg", "descriptions": "Manifold Garden is a first-person exploration game. Rediscover gravity and explore an Escher-esque world of impossible architecture. Witness infinity in first person, and master its rules to solve physics-defying puzzles. Cultivate a garden to open new paths forward, where an eternal expanse awaits."}, {"name": "Bomber Crew", "details_link": "https://www.metacritic.com/game/switch/bomber-crew", "publisher": "Curve Digital", "release_date": "Jul 10 2018", "developers": ["Runner Duck"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Flight", "Real-Time", "General", "Combat"], "meta_score": 75, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/484a17c25fc1be95a86256ad9fe70e58-98.jpg", "descriptions": "Bomber Crew is a World-war 2 strategic bombing sim, where completing the objective is just as important as keeping your crew alive, as death is permanent. Take to the skies in this immersive flight simulation where each mission is a high-risk expedition. Manage everything from fuel, ammo,Bomber Crew is a World-war 2 strategic bombing sim, where completing the objective is just as important as keeping your crew alive, as death is permanent. Take to the skies in this immersive flight simulation where each mission is a high-risk expedition. Manage everything from fuel, ammo, hydraulics and more in your very own physics based Bomber, which can be customized with an array of liveries and paint jobs. Danger comes from every angle when the wheels are up; Enemy fighters, flak guns, poor weather and an array of other perilous dangers await, so ensure your Crew are prepared for each mission correctly, and come back victorious. … Expand"}, {"name": "Hitman - Episode 3: Marrakesh", "details_link": "https://www.metacritic.com/game/playstation-4/hitman---episode-3-marrakesh", "publisher": "Square Enix", "release_date": "May 31 2016", "developers": ["Io Interactive"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/24ca141d30abf7e9ee0d4081d56e9eda-98.jpg", "descriptions": "Hitman Episode 3: Marrakesh presents players with a range of new in-game Challenges and Opportunities that keep them busy along with an entirely new setting for Escalation Contracts and Elusive Targets."}, {"name": "Battlezone 98 Redux", "details_link": "https://www.metacritic.com/game/pc/battlezone-98-redux", "publisher": "Rebellion", "release_date": "Apr 18 2016", "developers": ["Big Boat Interactive"], "platforms": "PC", "genres": ["Simulation", "Vehicle", "Combat"], "meta_score": 75, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/2/8229b5f58feb82ab4144710a7c2d349e-98.jpg", "descriptions": "Revolutionary, revitalised and remastered, Battlezone 98 Redux’s blend of thrilling first person action and tense RTS gameplay is as essential now as it ever was."}, {"name": "Dementium II", "details_link": "https://www.metacritic.com/game/ds/dementium-ii", "publisher": "SouthPeak Games", "release_date": "May  4 2010", "developers": ["Renegade Kid"], "platforms": ["PC", "DS"], "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 75, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/d8ee4c342e4dfb4cdfa63ba0c048fc3a-98.jpg", "descriptions": "A sequel to Renegade Kid's Dementium: The Ward, the next chapter in this horrific story promises to take players even closer to the precipice of madness than its predecessor. Continuing the storyline from the original, Dementium II promises to deliver better visuals, more haunting audio, andA sequel to Renegade Kid's Dementium: The Ward, the next chapter in this horrific story promises to take players even closer to the precipice of madness than its predecessor. Continuing the storyline from the original, Dementium II promises to deliver better visuals, more haunting audio, and sharper scares than its predecessor. [SouthPeak Games]… Expand"}, {"name": "Lego Star Wars", "details_link": "https://www.metacritic.com/game/game-boy-advance/lego-star-wars", "publisher": "Eidos Interactive", "release_date": "Mar 29 2005", "developers": ["Griptonite Games"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/a8b26eb892174fa297ba2241dea51b73-98.jpg", "descriptions": "Lego Star Wars blends Lego toys with the characters, stories, and vehicles from the prequel eras of the Star Wars universe. Now you can experience scenes from The Phantom Menace, Attack of the Clones, and Revenge of the Sith while controlling characters such as Obi-Wan Kenobi, Yoda, andLego Star Wars blends Lego toys with the characters, stories, and vehicles from the prequel eras of the Star Wars universe. Now you can experience scenes from The Phantom Menace, Attack of the Clones, and Revenge of the Sith while controlling characters such as Obi-Wan Kenobi, Yoda, and Anakin Skywalker. Use the Jedi \"force\" to solve puzzles and manipulate environments. During your journey, you'll do everything from pod racing on Mos Espa to repelling the droid onslaught in the Genosian arena. Your friend can even join the action to help you at any time during your game.… Expand"}, {"name": "Shin Megami Tensei: Persona 2 - Innocent Sin", "details_link": "https://www.metacritic.com/game/psp/shin-megami-tensei-persona-2---innocent-sin", "publisher": "Atlus", "release_date": "Sep 20 2011", "developers": ["ITL"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 75, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/74a5d360b3be72f51f51d7f46f13b3f7-98.jpg", "descriptions": "Over 12 years in the making, the official localization of Innocent Sin provides patient fans with the other side of the Persona 2 arc, a dark adventure about high school students who find their reality being twisted by rumors, and who must draw on their inner strengths, their Personas, toOver 12 years in the making, the official localization of Innocent Sin provides patient fans with the other side of the Persona 2 arc, a dark adventure about high school students who find their reality being twisted by rumors, and who must draw on their inner strengths, their Personas, to bring back order.  Taking advantage of PSP system's 16:9 aspect ratio, higher resolution display, superior audio, and increased horsepower, this remastered version of one of the pinnacles of ATLUS' flagship Shin Megami Tensei franchise delivers the game in style with a sleek new interface, new sidequests in the Climax Theater, and the player's choice of the fully remixed or original soundtrack.… Expand"}, {"name": "Blitzkrieg 2", "details_link": "https://www.metacritic.com/game/pc/blitzkrieg-2", "publisher": "cdv Software", "release_date": "Oct  2 2005", "developers": ["Nival Interactive"], "platforms": "PC", "num_players": "16  Online", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Tactics"], "meta_score": 75, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/d0a4c1d63cccc726254e4adb4c482617-98.jpg", "descriptions": "An epic WWII RTS game where you strategically plan and command battles in multiple WWII theatres, choose reinforcements and use a wide range of new combat units through 3 global campaigns on the side of the Soviet Armed Forces, US Army or German Wehrmacht. Blitzkrieg II builds upon theAn epic WWII RTS game where you strategically plan and command battles in multiple WWII theatres, choose reinforcements and use a wide range of new combat units through 3 global campaigns on the side of the Soviet Armed Forces, US Army or German Wehrmacht. Blitzkrieg II builds upon the success of the best selling Blitzkrieg and comes with tremendous focus on dynamic gameplay, new strategic opportunities and gritty realism of WWII battles. The new 3D graphic engine is a significant step above the original game and will get you in control of the most dramatic and bloody conflict of the past century. [CDV Software]… Expand"}, {"name": "Resident Evil: Revelations 2 - Episode 2: Contemplation", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-revelations-2---episode-2-contemplation", "publisher": "Capcom", "release_date": "Mar  3 2015", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/a5e85001a412f21f58639e28a536b12c-98.jpg", "descriptions": "Episode 2 picks off on the island where the events of \"Penal Colony\" left off."}, {"name": "Tropico 5", "details_link": "https://www.metacritic.com/game/pc/tropico-5", "publisher": "Kalypso", "release_date": "May 23 2014", "developers": ["Haemimont", "Haemimont Games"], "platforms": ["PlayStation 4", "Xbox 360", "PC"], "genres": ["Tycoon", "Strategy", "Management", "Tycoon", "Government", "Business / Tycoon"], "meta_score": 75, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/797efcdf15f7060f252eb2820a03ffd3-98.jpg", "descriptions": "Packed with a host of new gameplay features and new artwork designed from scratch, Tropico 5 takes the series into a new direction - dynasties!. You, as El Presidente, will first take control of the infamous island of Tropico during early colonial times and then guide it through thePacked with a host of new gameplay features and new artwork designed from scratch, Tropico 5 takes the series into a new direction - dynasties!. You, as El Presidente, will first take control of the infamous island of Tropico during early colonial times and then guide it through the centuries as the world changes and moves ever forward. You must tackle the changing needs of your people, as well as opposing governments and factions, and thus lay the foundations for your own dynasty. As you move through your years in office you can promote members of your extended family on the island to positions of power: such as ambassador, commanding general or even Supreme Ruler, to ensure your legacy thrives through the eras. As your influence and wealth grows, so do the threats to your burgeoning island superpower. Can you survive both World Wars, prosper through the Great Depression, rule as an iron-fisted dictator through the Cold War and advance your country to modern times and beyond? From the 19th to the 21st century, each era carries its own challenges and opportunities. As well as a wealth of other new features, including advanced trading mechanics, technology, scientific research trees and island exploration, Tropico 5 adds cooperative and competitive multiplayer for up to four players for the first time in the series' history.… Expand"}, {"name": "LEGO Batman: The Videogame", "details_link": "https://www.metacritic.com/game/playstation-3/lego-batman-the-videogame", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 23 2008", "developers": ["Traveller's Tales"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 75, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/0/737ab65ad232c6c0d6c9a3c472d4f4f3-98.jpg", "descriptions": "A stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as severalA stampede of notorious criminals have busted out of Arkham Asylum, where Gotham City houses only the shadiest of characters. It's up to the famed Caped Crusader to sweep Gotham clean of criminal activity using everything at his disposal, including crime-fighting vehicles as well as several baddie-bashing bat gadgets. [Warner Bros.]… Expand"}, {"name": "Blacklight: Retribution", "details_link": "https://www.metacritic.com/game/pc/blacklight-retribution", "publisher": "Perfect World Entertainment", "release_date": "Apr  3 2012", "developers": ["Zombie Studios"], "platforms": ["PlayStation 4", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/463d8f33a7299b91d11c01241eb3979b-98.jpg", "descriptions": "Blacklight: Retribution is a fast paced, adrenaline pumping first person shooter based in a futuristic urban warzone. Building upon Zombie Studiosï¿½ predecessor, Tango Down, Blacklight: Retribution provides FPS enthusiasts with a massive arsenal of weaponry and gearBlacklight: Retribution is a fast paced, adrenaline pumping first person shooter based in a futuristic urban warzone. Building upon Zombie Studiosï¿½ predecessor, Tango Down, Blacklight: Retribution provides FPS enthusiasts with a massive arsenal of weaponry and gear ranging from bleeding edge side arms to massive mechanized Hardsuits. Customize your weapons and gear for the perfect load out, earn credits in game to change the tide of battle by deploying flame throwers, automatic grenade launchers and even airstrikes.… Expand"}, {"name": "Zombieland: Headshot Fever Reloaded", "details_link": "https://www.metacritic.com/game/playstation-5/zombieland-headshot-fever-reloaded", "publisher": "XR Games", "release_date": "Feb 22 2023", "developers": ["XR Games"], "platforms": "PlayStation 5", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Light Gun"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/125800aef11e274c9ff798ca47f0b9ec-98.jpg", "descriptions": "Zombieland: Headshot Fever is a modern take on the classic arcade light gun shooter, built from the ground up for VR, and rebuilt for PlayStation®VR2. Join the Zombieland crew as you take on zombie hordes against the clock. Headshot combos slow down time, meaning the most precise shooter isZombieland: Headshot Fever is a modern take on the classic arcade light gun shooter, built from the ground up for VR, and rebuilt for PlayStation®VR2. Join the Zombieland crew as you take on zombie hordes against the clock. Headshot combos slow down time, meaning the most precise shooter is the fastest. Challenge the leaderboards with skill, speed, and accuracy.\r - Zombieland: Headshot Fever Reloaded is the ultimate version of the hit VR game, rebuilt to take advantage of PlayStation®5 and PlayStation®VR2.\r- Experience Zombieland: Headshot Fever as never before, with 4K 90fps gameplay, headset rumble, and controller haptics, making you feel every oncoming zombie and every bullet fired.\r- Zombieland: Headshot Fever Reloaded on PlayStation®VR2 benefits from a brand new cel-shaded art style, new character models, new animations, new lighting, ragdoll physics, new music, completely re-designed progression system, a new game hub and so much more.\r- Zombieland: Headshot Fever Reloaded on PlayStation®VR2 also includes a whole host of brand new gameplay content, including a new story level, three new remix levels, new Gun Range challenges, new guns, new perks, new gun skins and more.\r- Zombieland: Headshot Fever Reloaded also includes Arcade Mode: a roguelite game mode that asks players to compete for the best run across five levels. Spend earned currency in between levels to purchase special upgrades, perks and guns, or will you exchange one of your three lives for extra time?… Expand"}, {"name": "Coromon", "details_link": "https://www.metacritic.com/game/switch/coromon", "publisher": "Freedom Games", "release_date": "Jul 21 2022", "developers": ["TRAGsoft"], "platforms": ["PC", "Switch"], "num_players": "2 ", "genres": ["Role-Playing", "Trainer"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/a05b460c6c52b350b3bcb356fe946ddb-98.jpg", "descriptions": "Coromon is a modern monster taming game with retro pixelart. Coromon brings an immersive storyline, strategic turn-based combat and challenging puzzles to a classic genre.Use powerful moves to take down your opponent's Squad. Use your skills to poison, stun or damage your opponent with anCoromon is a modern monster taming game with retro pixelart. Coromon brings an immersive storyline, strategic turn-based combat and challenging puzzles to a classic genre.Use powerful moves to take down your opponent's Squad. Use your skills to poison, stun or damage your opponent with an arsenal of available skills.In the region of Velua where Humans and Coromon live in harmony, a shady organization is on the verge of releasing a dark power upon the world. Will they succeed in their evil plans, or can they still be stopped?Step into the role of a young hero joining the technologically advanced organisation of Lux Solis. Gather your favorite Coromon to create a powerful squad. Together with your Coromon, you'll have to train, fight and puzzle your way through an adventure-filled world!… Expand"}, {"name": "One Piece: Pirate Warriors 4", "details_link": "https://www.metacritic.com/game/playstation-4/one-piece-pirate-warriors-4", "publisher": "Bandai Namco Games", "release_date": "Mar 27 2020", "developers": ["Omega Force"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 75, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/ea1f2f4776b0ea21abf41d87b92a2349-98.jpg", "descriptions": "The Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of ﬁnding theThe Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of ﬁnding the illustrious treasure - the One Piece. Play through some of the most extraordinary islands and environments in the ONE PIECE story and take on memorable foes. Choose from some of your favorite characters and take on a vast number of enemies through iconic moments from the One Piece anime. Developed by the masters of the action musou genre, KOEI TECMO GAMES, ONE PIECE Pirate Warriors 4 brings together the excitement from slashing hordes of enemies with the fun and energetic personalities from the One Piece series. Embark on a new pirate warriors adventure.\r… Expand"}, {"name": "Cattails", "details_link": "https://www.metacritic.com/game/switch/cattails", "publisher": "Falcon Development", "release_date": "Nov 29 2018", "developers": ["Falcon Development"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/cf1551f01ea94aa170ae3b0710569edc-98.jpg", "descriptions": "Become a cat! Cattails is a unique animal simulation RPG. Hunt, fight, explore, and socialize in an expansive open world. Get married, have a litter of kittens, and befriend your neighbors. Play as a feral cat that roams an expansive wilderness. Hunt for food, fight cats from other colonies,Become a cat! Cattails is a unique animal simulation RPG. Hunt, fight, explore, and socialize in an expansive open world. Get married, have a litter of kittens, and befriend your neighbors. Play as a feral cat that roams an expansive wilderness. Hunt for food, fight cats from other colonies, and become friends (or enemies!) with your neighbors. Romance one of twelve eligible cats, raise a family of cute kittens, and train them by taking them with you on your adventures.… Expand"}, {"name": "Atomic Heart", "details_link": "https://www.metacritic.com/game/pc/atomic-heart", "publisher": "Mundfish", "release_date": "Feb 21 2023", "developers": ["Mundfish"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/5c4b245e50d770385fdfcdf901584d89-98.jpg", "descriptions": "In the Soviet Union of the future, in 1955, science reigns supreme. The world is on the verge of the greatest event.  You are Agent Major P-3 and you will have to find out what is really lying behind the utopian dream."}, {"name": "Sonic & Sega All-Stars Racing with Banjo-Kazooie", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-sega-all-stars-racing-with-banjo-kazooie", "publisher": "Sega", "release_date": "Feb 23 2010", "developers": ["Sumo Digital"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Kart", "Automobile"], "meta_score": 75, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/e432d08cebcdaa6f3344ad3e11f8d842-98.jpg", "descriptions": "In a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many moreIn a frantic battle to the checkered flag, Sonic and friends speed around tracks set in medieval castle ramparts, lush rainforests and bustling cities, all taken from the visually rich and varied universes of Sonic and SEGA. Fan favorites such as Dr. Eggman, Tails, AiAi, Amigo and many more will join Sonic in their custom built vehicles, revving their engines and jostling to stay ahead of the pack. Each character will speed around the track in cars, planes, motorbikes, and in Aiai’s case – a banana mobile! Secret short cuts, swift handling and avoiding strategically placed obstacles are certainly the best way to get to the top of the podium. But winning is only part of the fun in Sonic & SEGA All-Stars Racing! Each character has a specific All Star move – such as Super Sonic, Banana Blitz and Tails Tornado – that allows a quick way for competitors to get back into the race! Power ups and weapons can also be collected around the tracks and used against the opposition to ensure they don’t become a threat to that number one position. [Sega]… Expand"}, {"name": "Angry Video Game Nerd I & II Deluxe", "details_link": "https://www.metacritic.com/game/switch/angry-video-game-nerd-i-ii-deluxe", "publisher": "FreakZone", "release_date": "Oct 30 2020", "developers": ["FreakZone"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/4de5a1e17de2abdcfec86363e01da41f-98.jpg", "descriptions": "The Angry Video Game Nerd has been sucked into Game Land! It's up to you to guide him through three terrible and treacherous retro game worlds! Angry Video Game Nerd Adventures: Remassturd and Angry Video Game Nerd II: Reassimilated come together for the ultimate nerd experience! This is theThe Angry Video Game Nerd has been sucked into Game Land! It's up to you to guide him through three terrible and treacherous retro game worlds! Angry Video Game Nerd Adventures: Remassturd and Angry Video Game Nerd II: Reassimilated come together for the ultimate nerd experience! This is the definitive way to play the series... and more!\r This deluxe collection brings you every stage from both of famously tough action platform games, remixed & re-balanced plus an all-new, never-before-seen final chapter to bring the experience together for the ultimate experience in nerd rage… Expand"}, {"name": "God's Trigger", "details_link": "https://www.metacritic.com/game/pc/gods-trigger", "publisher": "Techland", "release_date": "Apr 18 2019", "developers": ["ONE MORE LEVEL"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Action Adventure", "Shooter", "Linear", "Shoot-'Em-Up", "Top-Down"], "meta_score": 75, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/ecceb2816e71d355daba33cd69b8e9c6-98.jpg", "descriptions": "Slay enemies with speed and precision in an over-the-top show of blood and explosions. Play solo or with others, make split-second decisions, dodge bullets, and use weapons and abilities to inflict violence in the most graphic way possible. When an Angel and a Demon team up to kill their waySlay enemies with speed and precision in an over-the-top show of blood and explosions. Play solo or with others, make split-second decisions, dodge bullets, and use weapons and abilities to inflict violence in the most graphic way possible. When an Angel and a Demon team up to kill their way into Heaven and stop the apocalypse, bullets will fly and blood will be shed. … Expand"}, {"name": "MTX Mototrax", "details_link": "https://www.metacritic.com/game/pc/mtx-mototrax", "publisher": "Aspyr", "release_date": "Nov 15 2004", "developers": ["Aspyr"], "platforms": ["PlayStation 2", "PC"], "num_players": "8  Online", "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Other", "Motocross", "Motocross"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/f21cf8b6d24862b2c03c5b376d2a87cd-98.jpg", "descriptions": "Accept the MTX: Mototrax challenge: beat the pros and become the ultimate MX athlete in the fastest, most complete motocross game offering a thrilling career mode to boost your fame, fortune and adrenaline! Earn more cold hard cash from contest wins and sponsorships. Use the money to modifyAccept the MTX: Mototrax challenge: beat the pros and become the ultimate MX athlete in the fastest, most complete motocross game offering a thrilling career mode to boost your fame, fortune and adrenaline! Earn more cold hard cash from contest wins and sponsorships. Use the money to modify your rider's attributes, purchase equipment upgrades or buy access to freeride environments complete with new goals and objectives. Make your way to the X Games and push your bike to the limit. Intense online racing action for up to 8 players. Customize your experience with Custom Rider, Track Builder & upgradable bikes. Set your career path through supercross, motocross, freestyle & off-road challenges. Offers the fastest motocross gaming experience that will have you accelerating around corners and flying through the air at an incredible 60 frames per second. Immerse yourself in a new, deep non-linear career mode that tests your skills and savvy as you progress through all the motocross disciplines-motocross, supercross and freestyle - to become the ultimate MX athlete. [Aspyr Media]… Expand"}, {"name": "Dante's Inferno", "details_link": "https://www.metacritic.com/game/playstation-3/dantes-inferno", "publisher": "Electronic Arts", "release_date": "Feb  9 2010", "developers": ["Visceral Games"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Linear", "2D", "3D"], "meta_score": 75, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/5f653f6125b043cc9ac159fd77cfd01f-98.jpg", "descriptions": "Dante's Inferno tells an adapted story that focuses on delivering a blockbuster 3rd person action game experience while bringing Alighieri's depiction of Hell to the medium. Players assume the role of Dante, who descends into Hell after returning home to find his beloved Beatrice murdered,Dante's Inferno tells an adapted story that focuses on delivering a blockbuster 3rd person action game experience while bringing Alighieri's depiction of Hell to the medium. Players assume the role of Dante, who descends into Hell after returning home to find his beloved Beatrice murdered, with Lucifer seducing her soul into the underworld. Dante sets out on a rescue mission to save Beatrice, but he soon realizes he is also in Hell to face his own demons and ultimately to redeem himself. Players take Dante through nine unique circles of Hell as mapped out and described by Alighieri: limbo, lust, gluttony, greed, anger, heresy, violence, fraud and treachery. Each circle showcases its own distinct look, with demons, monsters, damned and geography that are crafted straight from the poem's vivid descriptions. To take down the demons of Hell, Dante is outfitted with two primary weapons: the Scythe he takes from Death and the Holy Cross given to him by Beatrice, which has spiritual powers that will help Dante collect souls and spells from the creatures he defeats on his journey. The game also features a deep upgrade system so gamers can customize their abilities to their specific gameplay style, something they'll need as Dante comes face to face with Hell's fiercest beasts and bosses. If successful, Dante will be able to tame certain beasts, exacting their will and turning Hell’s punishments back on itself. [Electronic Arts]… Expand"}, {"name": "Silence: The Whispered World 2", "details_link": "https://www.metacritic.com/game/pc/silence-the-whispered-world-2", "publisher": "Daedalic Entertainment", "release_date": "Nov 15 2016", "developers": ["Daedalic Entertainment"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 75, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/9/a6a795c2d873d7b91600dba70dea2837-98.jpg", "descriptions": "Silence: The Whispered World 2 will take you back to Silence, a world made of dreams. We accompany Noah, a teenager who lost his little sister, Renie, in the hazardous real world and now hopes to find her again in Silence. His quest leads him to another visually impressive and emotionalSilence: The Whispered World 2 will take you back to Silence, a world made of dreams. We accompany Noah, a teenager who lost his little sister, Renie, in the hazardous real world and now hopes to find her again in Silence. His quest leads him to another visually impressive and emotional adventure, where you get to solve plenty of mysteries surrounding Noah, his sister, and the dreamscapes of Silence.… Expand"}, {"name": "Life is Strange 2: Episode 3 - Wastelands", "details_link": "https://www.metacritic.com/game/playstation-4/life-is-strange-2-episode-3---wastelands", "publisher": "Square Enix", "release_date": "May  9 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 75, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/316c0120ae2a8e1ece4c478f8cff0e6c-98.jpg", "descriptions": "Sean and Daniel Diaz’s journey to Mexico continues in Episode 3, a few months after the events in Episode 2 and the boys’ escape from Beaver Creek. The brothers experience life on the fringes of society, as they befriend a close-knit community of drifters and runaways, and become embroiledSean and Daniel Diaz’s journey to Mexico continues in Episode 3, a few months after the events in Episode 2 and the boys’ escape from Beaver Creek. The brothers experience life on the fringes of society, as they befriend a close-knit community of drifters and runaways, and become embroiled in the illegal cannabis trade among the towering redwood forests of California. Sean and Daniel’s resolve is put to the test once again, as new relationships create friction between them and they both learn much about who they are as individuals. Uncertain about their once united purpose, can they stay together, or will their journey together end here?… Expand"}, {"name": "Ys: Memories of Celceta", "details_link": "https://www.metacritic.com/game/playstation-4/ys-memories-of-celceta", "publisher": "XSEED Games", "release_date": "Jun  9 2020", "developers": ["Falcom"], "platforms": ["PC", "PlayStation Vita", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/008622d6d1acff7cd75dc220d218f838-98.jpg", "descriptions": "In Ys: Memories of Celceta, developer Falcom revisits the land and characters of Japanese cult favorite Ys IV for its first ever North American debut. This re-envisioning of the fourth installment in the Ys series takes a brand new approach, changing and framing the story of Ys IV within anIn Ys: Memories of Celceta, developer Falcom revisits the land and characters of Japanese cult favorite Ys IV for its first ever North American debut. This re-envisioning of the fourth installment in the Ys series takes a brand new approach, changing and framing the story of Ys IV within an all-new tale of conspiracy, deception and mystery. Featuring an updated version of the party-based battle system from Ys Seven, as well as the largest and most varied overworld in series history, Ys: Memories of Celceta brings a greater sense of adventure to the Ys universe than has ever been seen before.… Expand"}, {"name": "Maskmaker", "details_link": "https://www.metacritic.com/game/pc/maskmaker", "publisher": "MWM Interactive", "release_date": "Apr 20 2021", "developers": ["Innerspace VR", "InnerspaceVR"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/be3af0b07fde288948d531de3805615d-98.jpg", "descriptions": "In an all new mysterious universe built by the developers of the award-winning A Fisherman's Tale, you play as a Maskmaker's apprentice and learn the magic of crafting masks to immerse yourself in the intriguing enigmatic beings within the game."}, {"name": "Mortal Shell", "details_link": "https://www.metacritic.com/game/xbox-one/mortal-shell", "publisher": "Playstack", "release_date": "Aug 18 2020", "developers": ["Cold Symmetry"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox Series X", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/5c6d0462e7728a7e2c3308f8785f10b2-98.jpg", "descriptions": "Mortal Shell is a deep action-RPG that tests your sanity and resilience in a shattered world. Your adversaries spare no mercy, with survival demanding superior awareness, precision, and instincts. Possess lost warriors, track down hidden sanctums of the devout, and face formidable foes."}, {"name": "Infinite Space", "details_link": "https://www.metacritic.com/game/ds/infinite-space", "publisher": "Sega", "release_date": "Mar 16 2010", "developers": ["PlatinumGames", "NUDE MAKER,Y.K."], "platforms": "DS", "genres": ["Role-Playing", "Simulation", "Sci-Fi", "General", "General", "Large Spaceship"], "meta_score": 75, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/720c9fa302a62b15277ebd2dfc461ce6-98.jpg", "descriptions": "Infinite Space is a role-playing game in which players assemble a spaceship armada and embark on a cosmic adventure that allows them to delve deep into the vast outer reaches of space, exploring a universe filled with planets and interstellar organizations each with their own culture.Infinite Space is a role-playing game in which players assemble a spaceship armada and embark on a cosmic adventure that allows them to delve deep into the vast outer reaches of space, exploring a universe filled with planets and interstellar organizations each with their own culture. Infinite Space follows the story of Yuri, a young crewman that journeys the galactic frontier and slowly moves up the ranks to become captain of his own spaceship fleet. Using over 150 blueprints, players build and customize a huge array of space ships and have over 200 crewmen to recruit. Players battle their way through space to become the strongest fleet in the galaxy while exploring new planets and solar systems. Infinite Space delivers replay value with an epic storyline containing multiple branching story arcs that weave together seamlessly to create one epic tale set amongst the stars. The game also features multiplayer combat through local wireless connection for up to two players. [Sega]… Expand"}, {"name": "Atelier Ryza: Ever Darkness & the Secret Hideout", "details_link": "https://www.metacritic.com/game/playstation-4/atelier-ryza-ever-darkness-the-secret-hideout", "publisher": "Koei Tecmo Games", "release_date": "Oct 29 2019", "developers": ["Gust"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "Japanese-Style"], "meta_score": 75, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/de3349a38b5388965f32b1c905da959d-98.jpg", "descriptions": "The beautiful role-playing game follows the exploits of teenage tomboy Ryza, who dreams of escaping her mundane village lifestyle, alongside her band of mischievous friends. One day, as they explore a forbidden island in search of adventure, they meet an elderly magician who will changeThe beautiful role-playing game follows the exploits of teenage tomboy Ryza, who dreams of escaping her mundane village lifestyle, alongside her band of mischievous friends. One day, as they explore a forbidden island in search of adventure, they meet an elderly magician who will change their lives forever. … Expand"}, {"name": "Donut County", "details_link": "https://www.metacritic.com/game/playstation-4/donut-county", "publisher": "Annapurna Interactive", "release_date": "Aug 28 2018", "developers": ["Ben Esposito"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 75, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/54a507ce55472dc027d30a0d6b40ad2e-98.jpg", "descriptions": "Donut County is a physics adventure game where you control a hole in the ground. Every time you swallow something, the hole grows a little bit bigger. You play as a raccoon named BK, a new hire at a startup that uses remote-controlled holes to steal people's trash - along with everythingDonut County is a physics adventure game where you control a hole in the ground. Every time you swallow something, the hole grows a little bit bigger. You play as a raccoon named BK, a new hire at a startup that uses remote-controlled holes to steal people's trash - along with everything else. When BK falls into a hole himself, he must answer to his best friend Mira and the residents of Donut County who are now stuck 999 feet below their homes.\r… Expand"}, {"name": "Fashion Police Squad", "details_link": "https://www.metacritic.com/game/xbox-series-x/fashion-police-squad", "publisher": "No More Robots", "release_date": "Feb  2 2023", "developers": ["Mopeful Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 75, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/13e5521aa38999d593a6e9e667b1a33d-98.jpg", "descriptions": "Calling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight againstCalling all officers! I've got a Fashion Crime in Progress and I'm mobilizing all Fashion Police Squad members. Grab your Belt of Justice and your Tailormade Sewing Machine, we've got some Fashion Justice to dispense!Fashion Police Squad is a humorous Retro FPS where you fight against fashion crime using attire enhancing weaponry. Clean the streets of socks in sandals as Sergeant Des, and experience a single-player story full of fabulous characters, dazzling encounters, and fierce runway shows!… Expand"}]