[{"name": "New Super Luigi U", "details_link": "https://www.metacritic.com/game/wii-u/new-super-luigi-u", "publisher": "Nintendo", "release_date": "Jun 20 2013", "developers": ["Nintendo"], "platforms": "Wii U", "num_players": "1-5 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/08a82461af3eb3bf1c0c2bc935faca20-98.jpg", "descriptions": "To continue the fun of New Super Mario Bros. U for Wii U, Nintendo is letting Luigi take over in new downloadable content that is coming in the Year of Luigi that provides alternate versions of the game's more than 80 stages. Players can freely change between the New Super Luigi U and NewTo continue the fun of New Super Mario Bros. U for Wii U, Nintendo is letting Luigi take over in new downloadable content that is coming in the Year of Luigi that provides alternate versions of the game's more than 80 stages. Players can freely change between the New Super Luigi U and New Super Mario Bros. U stages. These Luigi-focused stages provide a whole new level of game-play challenge and will be available for purchase as a single download.… Expand"}, {"name": "Game Builder Garage", "details_link": "https://www.metacritic.com/game/switch/game-builder-garage", "publisher": "Nintendo", "release_date": "Jun 11 2021", "developers": ["Nintendo"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Application"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/7bbc3306e8aa6b5159edd18f0993dc36-98.jpg", "descriptions": "Have you ever dreamed of building your own video games? The Game Builder Garage™ software is a great place to start! Anyone can learn the basics of game design and visual programming with step-by-step lessons created by the minds at Nintendo."}, {"name": "Life is Strange: Before the Storm", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-before-the-storm", "publisher": "Square Enix", "release_date": "Aug 31 2017", "developers": ["Deck Nine Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/6917d39d71c7244d710a08368ed53990-98.jpg", "descriptions": "Life is Strange: Before the Storm is a new three part standalone story adventure set three years before the events of the first game. This time play as Chloe Price, a rebel who forms an unlikely friendship with Rachel Amber in dramatic new story in the BAFTA award winning franchise."}, {"name": "FIFA Street", "details_link": "https://www.metacritic.com/game/xbox-360/fifa-street", "publisher": "EA Sports", "release_date": "Mar 13 2012", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Arcade"], "meta_score": 77, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/1/a5c4017885065414630eef1a6720ebf9-98.jpg", "descriptions": "Powered by the revolutionary FIFA Soccer gameplay engine, and introducing Street Ball Control, FIFA Street will deliver an arsenal of groundbreaking street dribbling styles and trick moves that ignite the one-on-one battles within matches. Whether performing one panna after another withoutPowered by the revolutionary FIFA Soccer gameplay engine, and introducing Street Ball Control, FIFA Street will deliver an arsenal of groundbreaking street dribbling styles and trick moves that ignite the one-on-one battles within matches. Whether performing one panna after another without breaking a sweat the way street soccer is played in Amsterdam, or a physical, fight-for-possession style the way players compete in London, fans will enjoy a superior fidelity of ball control and responsiveness than anything ever experienced in a soccer videogame. Plus, for the first time ever, utilize aerial skills to maneuver past opponents, an all-new sophisticated one-touch passing system for quick, precision passes, and over 50 never-before-experienced skill moves.… Expand"}, {"name": "Awesomenauts", "details_link": "https://www.metacritic.com/game/xbox-360/awesomenauts", "publisher": "DTP Entertainment", "release_date": "May  2 2012", "developers": ["DTP Entertainment", "Ronimo Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "6  Online", "genres": ["Action", "Strategy", "Real-Time", "Fighting", "2D", "MOBA", "MOBA"], "meta_score": 77, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/1e3cf20fe8697dd7e0ca17706e279714-98.jpg", "descriptions": "The game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modernThe game features the most awesome mercenaries in the galaxy in their fight for territorial supremacy. Awesomenauts brings Russian monkeys with jetpacks, giant robots, and lots of other mighty aliens to the two-dimensional console battlefield. Combining classic platforming-action with modern online multiplayer functionality, the action-packed gameplay offers everything the 16-bit generation and modern gamers love.… Expand"}, {"name": "Arx Fatalis", "details_link": "https://www.metacritic.com/game/pc/arx-fatalis", "publisher": "JoWooD Entertainment AG", "release_date": "Nov 11 2002", "developers": ["Arkane Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 77, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/92bdb6fcb536807353266e9ee39cd0cc-98.jpg", "descriptions": "The goal of the game is to destroy the secret cult of Akbaa, the god of devastation and chaos, thereby preventing his return to the physical world. Should the player fail, the demon is bound to impose his reign of terror upon Arx. The player assumes the role of the potential hero, fightsThe goal of the game is to destroy the secret cult of Akbaa, the god of devastation and chaos, thereby preventing his return to the physical world. Should the player fail, the demon is bound to impose his reign of terror upon Arx. The player assumes the role of the potential hero, fights inside an underground fortress using wooden clubs, swords and magical items to defend himself against creatures including goblins, trolls, rat-men and other vicious opponents. However, brute force is not always the best way to succeed: The player has at his disposal the innovative new \"onscreen gesture based magic system\" to assist him in his progress through the game. Using the mouse, burning runes can be drawn in mid-air. A series of these gestures combine to create powerful magic spells that will protect the player or empower him to defeat his enemies and pursue his quest. [JoWood]… Expand"}, {"name": "Final Fantasy Crystal Chronicles: Ring of Fates", "details_link": "https://www.metacritic.com/game/ds/final-fantasy-crystal-chronicles-ring-of-fates", "publisher": "Square Enix", "release_date": "Mar 11 2008", "developers": ["Square Enix"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/5f73f67f6b4b2a65002d46ea0c2dc33d-98.jpg", "descriptions": "The Great Crystal protects the land from the malefic glow of the blood red moon. Twins are born to this land, endowed with a shared, mystical power. Their peaceful life is suddenly changed with the rise of the blood red moon. All fates are etched into the crystal. [Square Enix]"}, {"name": "3D Dot Game Heroes", "details_link": "https://www.metacritic.com/game/playstation-3/3d-dot-game-heroes", "publisher": "Atlus", "release_date": "May 11 2010", "developers": ["Silicon Studio"], "platforms": "PlayStation 3", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/b7d963ccbad952998187f6e10859dd5b-98.jpg", "descriptions": "A long, long time ago, the Dark King Onyx brought an age of darkness upon Dotnia Kingdom.  Only by the bravery of a hero with a legendary sword was Onyx sealed in an orb, restoring peace to the world.  But Fuelle, a powerful Dark Bishop, has stolen the orb, and with it, peace.  DotniaA long, long time ago, the Dark King Onyx brought an age of darkness upon Dotnia Kingdom.  Only by the bravery of a hero with a legendary sword was Onyx sealed in an orb, restoring peace to the world.  But Fuelle, a powerful Dark Bishop, has stolen the orb, and with it, peace.  Dotnia requires a hero once more!  Can you live up to the legend? Ultimate retro love letter -- Seamlessly fusing new and old, the golden era of gaming is felt in every detail of this lovingly-crafted adventure. Eye-popping visuals capture the nostalgic charm of pixel graphics in cutting edge 3D. Simple, but deep action-adventure gameplay is a throwback to the 8-bit era. Veterans will find references and jokes that pay homage to the great games of yore. Awe and adventure live again -- Embark on the next generation of classic exploration and discovery in a grand story-based quest. A hero sets out to gain the power of the six sages and the six orbs that protected the kingdom of Dotnia, which now stands on the verge of destruction. Customize your hero -- When pixels are your building blocks, the possibilities are unlimited. Freely edit the look of your character, or design one completely from scratch, and then trade designs with friends via a compatible USB storage device. Your hero's blade is also upgradeable, letting you add length and width to create a sword that fills the whole screen. [Atlus USA]… Expand"}, {"name": "Tails: The Backbone Preludes", "details_link": "https://www.metacritic.com/game/pc/tails-the-backbone-preludes", "publisher": "Raw Fury", "release_date": "Feb  2 2023", "developers": ["EggNut"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/42b60c891471408e3da59ea5b4b68470-98.jpg", "descriptions": "Tails: The Backbone Preludes is a post-noir narrative adventure with branching choices. It is an intertwined series of vignettes about change, circumstance, and consequence. Guide four characters through formative moments in their lives in a dystopian Vancouver inhabited by anthropomorphic Tails: The Backbone Preludes is a post-noir narrative adventure with branching choices. It is an intertwined series of vignettes about change, circumstance, and consequence. Guide four characters through formative moments in their lives in a dystopian Vancouver inhabited by anthropomorphic animals. … Expand"}, {"name": "Souldiers", "details_link": "https://www.metacritic.com/game/pc/souldiers", "publisher": "Dear Villagers", "release_date": "Jun  2 2022", "developers": ["Retro Forge"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "Metroidvania"], "meta_score": 77, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/4/c56493151b4c09ec9b209f432c3ef76a-98.jpg", "descriptions": "Fight for your freedom in a sprawling fantasy world caught between the living and the fallen. Hone your skills in a retro epic featuring puzzle platforming, metroidvania exploration and crunchy soulslike combat."}, {"name": "Final Fantasy II Pixel Remaster", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-ii-pixel-remaster", "publisher": "Square Enix", "release_date": "Jul 28 2021", "developers": ["Square Enix", "TOSE"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 77, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/3/541ab264537305a7e348d09c7eaa8c0c-98.jpg", "descriptions": "The second game in the series introduces a new world, new characters and something that would become a trademark of the series: innovation.The story focuses on the conflict between the hostile Empire of Palamecia and the rebel resistance. A small group of heroes is all that stands betweenThe second game in the series introduces a new world, new characters and something that would become a trademark of the series: innovation.The story focuses on the conflict between the hostile Empire of Palamecia and the rebel resistance. A small group of heroes is all that stands between the world and ruin.FINAL FANTASY II demonstrates the developers' willingness to push their boundaries and try new things. For example, rather than sticking to the predictable, the game features a proficiency system in which characters skill with weapons and abilities increase the more they used them.Fun fact: this is the FINAL FANTASY game that introduced the world to chocobos! Now that's a legacy.… Expand"}, {"name": "Do Not Feed the Monkeys", "details_link": "https://www.metacritic.com/game/switch/do-not-feed-the-monkeys", "publisher": "Alawar Premium", "release_date": "Jun  1 2020", "developers": ["Alawar Premium"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/c507fe8313280e88d697eb0455b63215-98.jpg", "descriptions": "You are invited to join “The Primate Observation Club”, where you will observe the lives of caged monkeys and carefully analyze the information obtained.\r GLOSSARY OF TERMS:\r\n\r\nTHE PRIMATE OBSERVATION CLUB: a shadowy group that observes other people through surveillance cameras andYou are invited to join “The Primate Observation Club”, where you will observe the lives of caged monkeys and carefully analyze the information obtained.\r GLOSSARY OF TERMS:\r THE PRIMATE OBSERVATION CLUB: a shadowy group that observes other people through surveillance cameras and compromised webcams.\rYOU: the newest member of the CLUB, tired of your run-down apartment, dull existence, and boring job.\rMONKEYS: dozens of strangers who have fallen prey to your surveillance.\rPRIVACY: Something that the monkeys think they have.\rPC (PERSONAL COMPUTER): Yep, we put a PC in your game that’s on your Nintendo Switch™ so that you can work on a PC while you’re playing the game that’s on your Nintendo Switch™ console!\rFEEDING THE MONKEYS: Interacting or interfering with the subjects in any way. Feeding the monkeys is strictly prohibited.\r Oddly enough, club members keep feeding the monkeys as though they just can’t abide by this very simple rule! How about you? Will you help those you’re spying on, extort them, expose them and sabotage their dreams, or will you follow your instructions and sit twiddling your thumbs while the world burns?… Expand"}, {"name": "Control: The Foundation", "details_link": "https://www.metacritic.com/game/pc/control-the-foundation", "publisher": "505 Games", "release_date": "Mar 26 2020", "developers": ["Remedy Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 77, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/4825290ad0ee27eb7c9b715be7fa5652-98.jpg", "descriptions": "The Foundation Expansion includes new story content and side missions as well as new weapons and mods inspired by the Oldest House's mysterious origins. The Astral Plane is colliding with our reality. Jesse Faden, the Director of the Federal Bureau of Control, must travel through the cavernsThe Foundation Expansion includes new story content and side missions as well as new weapons and mods inspired by the Oldest House's mysterious origins. The Astral Plane is colliding with our reality. Jesse Faden, the Director of the Federal Bureau of Control, must travel through the caverns of the Foundation to prevent the Astral Plane from consuming the Oldest House. The missing Head of Operations, Helen Marshall, may hold some answers to the mysteries surrounding this threat...… Expand"}, {"name": "The Shapeshifting Detective", "details_link": "https://www.metacritic.com/game/xbox-one/the-shapeshifting-detective", "publisher": "Wales Interactive", "release_date": "Nov  6 2018", "developers": ["D'Avekki Studios Limited"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 77, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/3f89039edf72edc8fbb40cc6983b91ef-98.jpg", "descriptions": "The Shapeshifting Detective is a supernatural-noir murder mystery FMV game. Assume the role of a detective and investigate the murder by shapeshifting into any character… even the next victim."}, {"name": "The Darkside Detective", "details_link": "https://www.metacritic.com/game/pc/the-darkside-detective", "publisher": "Spooky Doorway", "release_date": "Jul 27 2017", "developers": ["Spooky Doorway"], "platforms": ["PlayStation 4", "PlayStation 5", "Stadia", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/9/8b133143ccb5e944e425681c737421f2-98.jpg", "descriptions": "Join The Darkside Detective, Francis McQueen, as he investigates the bizarre, the supernatural and those missing cat cases that keep getting dropped on his desk."}, {"name": "Embers of Mirrim", "details_link": "https://www.metacritic.com/game/xbox-one/embers-of-mirrim", "publisher": "Creative Bytes", "release_date": "May 24 2017", "developers": ["Creative Bytes"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Action Adventure", "General"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/830f9bc1ec7ff34a6a9ca3ead3a9ca7c-98.jpg", "descriptions": "An ancient power forges together two distinctly different creatures into one versatile hero charged with restoring peace and balance to the world. This newly minted savior has the grace and power of its respective races, as well as the ability to split itself into light and dark ember. EachAn ancient power forges together two distinctly different creatures into one versatile hero charged with restoring peace and balance to the world. This newly minted savior has the grace and power of its respective races, as well as the ability to split itself into light and dark ember. Each ember is controlled independently using right and left analog sticks, creating an intuitive and satisfying way to platform through stunning fantastical landscapes.  … Expand"}, {"name": "Aaero", "details_link": "https://www.metacritic.com/game/playstation-4/aaero", "publisher": "Mad Fellows Ltd", "release_date": "Apr 11 2017", "developers": ["Mad Fellows Ltd"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Rail"], "meta_score": 77, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/0/77156bccb6d2a6d336503ba3149a1414-98.jpg", "descriptions": "Independent two-man studio Mad Fellows brings you Aaero, a game that synthesizes high-speed sci-fi shooting action with immersive music elements to deliver an amazing audio-visual experience."}, {"name": "Game of Thrones: Episode Four - Sons of Winter", "details_link": "https://www.metacritic.com/game/pc/game-of-thrones-episode-four---sons-of-winter", "publisher": "Telltale Games", "release_date": "May 26 2015", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "Point-and-Click"], "meta_score": 77, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/39ed806cd11b057e247f7feada6a83ef-98.jpg", "descriptions": "In this fourth episode, the fate of the scattered Forresters hangs in the balance, and no one allied with the family is considered to be safe. An unexpected meeting offers Rodrik a new opportunity to free Ironrath from its Whitehill stranglehold, but with young Ryon Forrester stillIn this fourth episode, the fate of the scattered Forresters hangs in the balance, and no one allied with the family is considered to be safe. An unexpected meeting offers Rodrik a new opportunity to free Ironrath from its Whitehill stranglehold, but with young Ryon Forrester still imprisoned, his next moves are critical. Gared must abandon Castle Black and venture beyond the Wall in search of the mysterious North Grove, risking encounters with Wildlings and worse. In King's Landing, the population is reeling from a recent royal death, and Mira must step carefully in an increasingly complex game of politics where secrets are traded as currency. Far away in Essos, Asher infiltrates the slave city of Meereen at the behest of Daenerys Targaryen, but will the friendship he holds dear break under the strain of a mission that raises memories best forgotten? [Telltale Games]… Expand"}, {"name": "Tetrobot and Co.", "details_link": "https://www.metacritic.com/game/wii-u/tetrobot-and-co", "publisher": "Neko Entertainment", "release_date": "Oct 30 2014", "developers": ["Swing Swing Submarine"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Wii U"], "genres": ["Puzzle", "Action"], "meta_score": 77, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/0835d4a5c605ee728f2024ed325db923-98.jpg", "descriptions": "Tetrobot is the world's most popular and reliable robot, but he's not perfect. That's why Maya has built him a microscopic little brother, Psychobot.\r Help Maya guide Psy through Tetrobot's cogs and circuits: by swallowing blocks of matter and spitting them out, they can repair anything.Tetrobot is the world's most popular and reliable robot, but he's not perfect. That's why Maya has built him a microscopic little brother, Psychobot.\r Help Maya guide Psy through Tetrobot's cogs and circuits: by swallowing blocks of matter and spitting them out, they can repair anything. Learn how pipes, lasers, fans and other electronic devices work, learn how to alter the chemical properties of slime, and collect all the memory blocks that you find on the way.\r The owners of damaged Tetrobots all around the world rely on Maya and Psy: they're the only people who can repair their precious robots.… Expand"}, {"name": "DG2: Defense Grid 2", "details_link": "https://www.metacritic.com/game/playstation-4/dg2-defense-grid-2", "publisher": "505 Games", "release_date": "Sep 23 2014", "developers": ["Hidden Path Entertainment"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Strategy", "Real-Time", "General", "Defense"], "meta_score": 77, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/299540a738cab229310f9b3557dc069d-98.jpg", "descriptions": "Defense Grid 2, DG2, is the highly-anticipated sequel to Hidden Path Entertainments 2008 Defense Grid: The Awakening. Setting the bar as the definitive tower defense game, Defense Grid 2 introduces new worlds and threats to test your tower placement strategies. With a bold new look, aDefense Grid 2, DG2, is the highly-anticipated sequel to Hidden Path Entertainments 2008 Defense Grid: The Awakening. Setting the bar as the definitive tower defense game, Defense Grid 2 introduces new worlds and threats to test your tower placement strategies. With a bold new look, a compelling single-player campaign, and the addition of new game modes, online player-versus-player and multiplayer co-op, every play-through brings fun new opportunities and challenges. DG2 comes with a story campaign featuring 21 stunning maps, dynamic level movement, an expanded story and cast of characters, hundreds of challenge mode experiences, new multiplayer modes, a procedurally driven audio score and the ability for players to build their own levels. DG2 also introduces players to DG Architect, a level creation tool set connected to Steam Workshop where players can create their own unique levels to share and possibly even sell if selected. DG2 for the PC was funded in part by Dracogen, a private investor after a 2012 Kickstarter campaign funded the original game's DLC, Defense Grid: Containment. DG2 is developed by Hidden Path Entertainment and published by 505 Games.… Expand"}, {"name": "NCAA Football 14", "details_link": "https://www.metacritic.com/game/playstation-3/ncaa-football-14", "publisher": "EA Sports", "release_date": "Jul  9 2013", "developers": ["EA Tiburon"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 77, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/9e059ddaa8bf2e366be2348b2b7377ee-98.jpg", "descriptions": "NCAA 14 gives players enhanced control over their fate on the turf and as a head coach. The introduction of Infinity Engine 2 lets you play true to your team with gameplay tuned with the unique college game in mind, while new Coach Skills and Power Recruiting create an engrossing DynastyNCAA 14 gives players enhanced control over their fate on the turf and as a head coach. The introduction of Infinity Engine 2 lets you play true to your team with gameplay tuned with the unique college game in mind, while new Coach Skills and Power Recruiting create an engrossing Dynasty experience. Also included is the Ultimate Team mode which includes a number of former NCAA stars.… Expand"}, {"name": "Tiger Woods PGA Tour 13", "details_link": "https://www.metacritic.com/game/xbox-360/tiger-woods-pga-tour-13", "publisher": "Electronic Arts", "release_date": "Mar 27 2012", "developers": ["Electronic Arts"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Golf", "Sim", "Sim"], "meta_score": 77, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/8/51cdcf1c04136ec409b1bd49bb4775bc-98.jpg", "descriptions": "Swing Tempo - For the 1st time in Tiger Woods PGA TOUR history, the tempo and speed of your swing is going to directly influence the power of your shot. Fast tempo will add more distance to shots. Slow tempo will result in less distance. Shot Setup – Create all possible shot types from oneSwing Tempo - For the 1st time in Tiger Woods PGA TOUR history, the tempo and speed of your swing is going to directly influence the power of your shot. Fast tempo will add more distance to shots. Slow tempo will result in less distance. Shot Setup – Create all possible shot types from one shot setup. Drag your aiming marker forward and back to blend between full , ¾ , pitch, and chip shots. Create draw and fade shots by opening and closing your golfer’s stance. Affect the launch trajectory by moving the ball forward or backward in your stance to create flop and punch shots. The possibilities are endless, allowing any real shot to be created in the game. Strike Meter – Using the all-new Strike Meter, place the sweet spot of the club precisely where you wish to hit the ball. While a center strike is the most common, you can use low and high strikes to alter power, spin and trajectory. Swing Arc – The visualization of the golfer’s swing is shown in the form of an arc. Use this arc as a guide to execute your swing with the proper power, trajectory and shot shape. All-New Animations – Utilizing the latest version of EA’s sophisticated ANT animation system, you’ll be able to see in real-time whether your golf swing is on or off plane through your golfer’s on-screen animations. [Electronic Arts]\r… Expand"}, {"name": "Pool Paradise", "details_link": "https://www.metacritic.com/game/playstation-2/pool-paradise", "publisher": "Ignition Entertainment", "release_date": "Jul 13 2004", "developers": ["Awesome Developments"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Parlor", "Billiards"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/64265f6f32a26d471791b8263d79dd47-98.jpg", "descriptions": "You arrive penniless on an idyllic South Pacific Desert Island, as it just so happens scattered around the beach an in varous huts (and some hidden locations) there are a variety of Pool tables and sub games to pass the time. On the beach sheltered under the palm trees there is a practiceYou arrive penniless on an idyllic South Pacific Desert Island, as it just so happens scattered around the beach an in varous huts (and some hidden locations) there are a variety of Pool tables and sub games to pass the time. On the beach sheltered under the palm trees there is a practice table where you can enhance your skills and what the waves rolling in. When you feel you ar good enough you can enter the Competition Hut and start climbing the Championship ladder. There are 11 sets of pool rules and no less than 30 different computer opponents for you to challenge. All represented by highly detailed charismatic animated hands that gesture their feelings as the games progress. [Ignition Entertainment]… Expand"}, {"name": "Need for Speed Underground", "details_link": "https://www.metacritic.com/game/game-boy-advance/need-for-speed-underground", "publisher": "Electronic Arts", "release_date": "Dec 18 2003", "developers": ["Pocketeers"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 77, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/405e50b6b534ebd5c6f11e63131ef82f-98.jpg", "descriptions": "Enter the world of urban street racing with the latest title in the hit Need for Speed series: Need for Speed Underground.  Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, earning cash for car mods.  Test your skills against the computer orEnter the world of urban street racing with the latest title in the hit Need for Speed series: Need for Speed Underground.  Take on today's most popular tuner cars from Mitsubishi Motors, Subaru, Toyota and many more, earning cash for car mods.  Test your skills against the computer or online against up to 4 players.  But creating a custom street racing machine will not get you to the top; it takes a certain amount of attitude and razor sharp driving skills to compete in the tough world of urban racing.  … Expand"}, {"name": "The Lord of the Rings: The Return of the King", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-lord-of-the-rings-the-return-of-the-king", "publisher": "EA Games", "release_date": "Nov  5 2003", "developers": ["Griptonite Games"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 77, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/dafd7e3e45e9db32d7d973fed4ac3d4c-98.jpg", "descriptions": "Return to Middle-earth in a game based on the epic final chapter of the The Lord of the Rings movie trilogy.  Developed using the same digital assets as the films, The Return of the King recreates in stunning detail the final events of the War of the Ring.  Become the heroes who determineReturn to Middle-earth in a game based on the epic final chapter of the The Lord of the Rings movie trilogy.  Developed using the same digital assets as the films, The Return of the King recreates in stunning detail the final events of the War of the Ring.  Become the heroes who determine the fate of Middle-earth as you traverse the haunted Paths of the Dead, defend Minas Tirith, and even play co-op multiplayer with a friend as you march against the impenetrable Black Gates of Mordor.  The fate of Middle-earth is in your hands.… Expand"}, {"name": "Sonic Pinball Party", "details_link": "https://www.metacritic.com/game/game-boy-advance/sonic-pinball-party", "publisher": "Sega", "release_date": "Jun  1 2003", "developers": ["Sonic Team"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Miscellaneous", "Parlor", "Pinball"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/7b0866817fbdb10a7eb07da3dc7addf2-98.jpg", "descriptions": "Shoot, tilt, and flip your way through 3 vibrant pinball boards full of SonicTeam™ characters, including Sonic & friends, Amigo and NiGHTS!"}, {"name": "MLB Slugfest 20-03", "details_link": "https://www.metacritic.com/game/playstation-2/mlb-slugfest-20-03", "publisher": "Midway", "release_date": "Jun 23 2002", "developers": ["Midway"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 77, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/fcea4ffc072f41212c8188b31372441c-98.jpg", "descriptions": "Featuring real Major League Baseball players, teams and stadiums, MLB SlugFest 20-03 delivers over-the-top, adrenaline-style gameplay action. It will change the way you think about America's pastime with the most exciting, shot-of-adrenaline baseball videogame you've ever played! TakeFeaturing real Major League Baseball players, teams and stadiums, MLB SlugFest 20-03 delivers over-the-top, adrenaline-style gameplay action. It will change the way you think about America's pastime with the most exciting, shot-of-adrenaline baseball videogame you've ever played! Take control of all of your favorite Major League Baseball teams and players armed with all of their real stats, attributes, abilities and attitude. Midway Sports takes this all-star lineup over-the-top. [Midway]… Expand"}, {"name": "Super Bust-A-Move", "details_link": "https://www.metacritic.com/game/game-boy-advance/super-bust-a-move", "publisher": "Ubisoft", "release_date": "Nov 27 2001", "developers": ["Taito Corporation"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Puzzle", "Matching"], "meta_score": 77, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/01a01a74f775d96b0ad2c480dcb59bab-98.jpg", "descriptions": "This is the first handheld version of Bust-A-Move that's both playable and visually appealing."}, {"name": "ESPN MLS ExtraTime", "details_link": "https://www.metacritic.com/game/playstation-2/espn-mls-extratime", "publisher": "Konami", "release_date": "Apr 16 2001", "developers": ["Konami"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Soccer", "Sim"], "meta_score": 77, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/5badad80892638d97902acac4e830a7b-98.jpg", "descriptions": "Developed and retrofitted with the ESPN-MLS license, commentary, and music from Japan's award-winning \"Winning Eleven 5,\" Konami brings its International Superstar Soccer franchise to America do battle with EA's finest."}, {"name": "Insanely Twisted Shadow Planet", "details_link": "https://www.metacritic.com/game/xbox-360/insanely-twisted-shadow-planet", "publisher": "Fuelcell Games", "release_date": "Aug  3 2011", "developers": ["Shadow Planet Productions"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Action Adventure", "Shooter", "Platformer", "Shooter", "Open-World", "Scrolling", "Scrolling", "", "Shoot-'Em-Up", "Horizontal"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/fa507d8e33d295fe5cfdad7682281d3c-98.jpg", "descriptions": "Insanely Twisted Shadow Planet is an independent game being produced by Fuelcell Games and artist Michel Gagné."}, {"name": "SEASON: A letter to the future", "details_link": "https://www.metacritic.com/game/playstation-5/season-a-letter-to-the-future", "publisher": "Covalent Media", "release_date": "Jan 31 2023", "developers": ["Scavengers Studio"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/1/87fa649a35a400622f53d2fec5d893fd-98.jpg", "descriptions": "Immerse yourself in the world of Season, a third-person atmospheric adventure bicycle road trip game. Leave home for the first time to collect memories before a mysterious cataclysm washes everything away. Explore, record, meet people, and unravel the strange world around you."}, {"name": "The Disney Afternoon Collection", "details_link": "https://www.metacritic.com/game/playstation-4/the-disney-afternoon-collection", "publisher": "Capcom", "release_date": "Apr 18 2017", "developers": ["Capcom", "Digital Eclipse"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Miscellaneous", "Compilation"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/4932b26472bba11daebb21f5bfe9a174-98.jpg", "descriptions": "Starring a cast of Disney characters, The Disney Afternoon Collection takes you back to a golden era of gaming and afternoons filled with adventure. All six classic games feature new and improved visuals and include filtering options that replicate a retro look and feel."}, {"name": "MotoGP 22", "details_link": "https://www.metacritic.com/game/playstation-5/motogp-22", "publisher": "Milestone S.r.l", "release_date": "Apr 21 2022", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 12 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 76, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/882f2854f9a9f3196c71b9f1c9d0f70d-98.jpg", "descriptions": "All the heroes of the 2022 season and more than 70 historical riders to enjoy the most complete racing experience!"}, {"name": "Madden NFL 07", "details_link": "https://www.metacritic.com/game/playstation-3/madden-nfl-07", "publisher": "EA Sports", "release_date": "Nov 14 2006", "developers": ["EA Tiburon"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 76, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/1/69caf9cfa58671172f35a9b5a40f6dd6-98.jpg", "descriptions": "With the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback andWith the exclusive video game license of the NFL and its players, and currently in its 17th installment, Madden NFL 07 puts you in control the running game like never before. For the first time ever, step up as the lead blocker to create a hole, and then take control of the tailback and smash through, overpower, or slash away from would-be tacklers as you fight for every yard. Innovative rushing controls give you a game-breaking ground attack featuring all-new jukes, cutbacks, and the distinct running styles of your favorite backs. [Electronic Arts]… Expand"}, {"name": "Tropico 5", "details_link": "https://www.metacritic.com/game/playstation-4/tropico-5", "publisher": "Kalypso", "release_date": "Apr 28 2015", "developers": ["Haemimont", "Haemimont Games"], "platforms": ["PC", "Xbox 360", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Tycoon", "Business / Tycoon", "Strategy", "Management", "Government"], "meta_score": 76, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/6b27cd36041185a3da73a021e2d4db43-98.jpg", "descriptions": "Chock full of a host of new gameplay features and new artwork designed from scratch, Tropico 5 takes the series into a new direction - dynasties. You, as El Presidente, will first take control of the infamous island of Tropico during early colonial times and then guide it through theChock full of a host of new gameplay features and new artwork designed from scratch, Tropico 5 takes the series into a new direction - dynasties. You, as El Presidente, will first take control of the infamous island of Tropico during early colonial times and then guide it through the centuries as the world changes and moves ever forward. … Expand"}, {"name": "Bravely Default II", "details_link": "https://www.metacritic.com/game/switch/bravely-default-ii", "publisher": "Square Enix", "release_date": "Feb 26 2021", "developers": ["Claytech Works"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/81beed49bbf4aefe9ec4b2ae3e06891a-98.jpg", "descriptions": "Step into a brand-new world with four brand-new heroes. A new world, a new story, and all-new Heroes of Light await in an original RPG experience arriving on the Nintendo Switch system in 2020! This successor to the original Bravely Default game comes from the team that brought you theStep into a brand-new world with four brand-new heroes. A new world, a new story, and all-new Heroes of Light await in an original RPG experience arriving on the Nintendo Switch system in 2020! This successor to the original Bravely Default game comes from the team that brought you the Bravely series and Octopath Traveler, and features music from Revo (Sound Horizon/Linked Horizon), acclaimed composer of the Bravely Default soundtrack.\r * Brand-new entry in Square Enix's Bravely Series\r* Travel the world in search of the four Crystals with the latest incarnation of the brave band known as the Heroes of Light\r* Latest creation from Team Asano, creators of the Bravely series and Octopath Traveler\r* New world filled with new characters, but with the atmosphere and excitement the Bravely series is known for… Expand"}, {"name": "Worms 2: Armageddon", "details_link": "https://www.metacritic.com/game/playstation-3/worms-2-armageddon", "publisher": "Team17", "release_date": "Sep 14 2010", "developers": ["Team17"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Strategy", "Turn-Based", "Wargame", "Turn-Based", "Fantasy", "Artillery"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/6dd4cccd674fc34b6e357c48d084b701-98.jpg", "descriptions": "Featuring an in-depth single-player Campaign Mode, Tutorials and Firing Ranges along with multi-player online and offline game modes, it is now even easier to jump in and get involved with the world of Worms. Playable in full 1080p, this is Team17' best looking Worms title yet and with fullFeaturing an in-depth single-player Campaign Mode, Tutorials and Firing Ranges along with multi-player online and offline game modes, it is now even easier to jump in and get involved with the world of Worms. Playable in full 1080p, this is Team17' best looking Worms title yet and with full trophy support and customization options this is a Worms title that is guaranteed to last the test of time, in both a gameplay and a visual sense.… Expand"}, {"name": "Crysis 3", "details_link": "https://www.metacritic.com/game/xbox-360/crysis-3", "publisher": "EA Games", "release_date": "Feb 19 2013", "developers": ["Crytek"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/0/61bb5b097bae6471f551038230a9ec78-98.jpg", "descriptions": "Players assume the role of Prophet as he returns to New York, only to realize that the city has been encased in a Nanodome constructed by the corrupt Cell Corporation. The New York City Liberty Dome is a veritable urban rainforest teeming with overgrown trees, dense swamplands and teemingPlayers assume the role of Prophet as he returns to New York, only to realize that the city has been encased in a Nanodome constructed by the corrupt Cell Corporation. The New York City Liberty Dome is a veritable urban rainforest teeming with overgrown trees, dense swamplands and teeming rivers. Within the Liberty Dome, 7 distinct and treacherous environments become known as the Seven Wonders. This dangerous new world requires the use of advanced weapons and tactics. Prophet will don a lethal composite bow, an enhanced Nanosuit and devastating alien tech to become the deadliest hunter on the planet.… Expand"}, {"name": "New Super Lucky's Tale", "details_link": "https://www.metacritic.com/game/switch/new-super-luckys-tale", "publisher": "Playful Corp.", "release_date": "Nov  8 2019", "developers": ["Playful Corp."], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/05f3c4cd7f7d572732f829fb32377d85-98.jpg", "descriptions": "The adventure of a young fox who embarks on a journey through the unknown and becomes a hero."}, {"name": "Blasters of the Universe", "details_link": "https://www.metacritic.com/game/playstation-4/blasters-of-the-universe", "publisher": "Secret Location", "release_date": "Feb 27 2018", "developers": ["Secret Location"], "platforms": ["PC", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/d03246bd4fe7240c679fa77652073121-98.jpg", "descriptions": "Features first-person bullet-hell gameplay that requires you to duck, dodge, and maneuver through myriad enemies and hundreds of bullets."}, {"name": "Toki Tori 2 +", "details_link": "https://www.metacritic.com/game/pc/toki-tori-2-+", "publisher": "Two Tribes", "release_date": "Jul 11 2013", "developers": ["Two Tribes"], "platforms": ["PlayStation 4", "Switch", "Wii U", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "General", "General", "Puzzle", "Puzzle", "Action"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/70c81fe420aaa7d25206857ce87b8da8-98.jpg", "descriptions": "Experience Toki Tori’s Epic Puzzle Adventure. Explore a forest island, learn magical songs and interact with the local wildlife to solve environmental puzzles. Toki Tori 2+’s game design requires just two moves: whistle and stomp. It's super accessible, yet it builds up to incredibleExperience Toki Tori’s Epic Puzzle Adventure. Explore a forest island, learn magical songs and interact with the local wildlife to solve environmental puzzles. Toki Tori 2+’s game design requires just two moves: whistle and stomp. It's super accessible, yet it builds up to incredible complexity later on. There’s a ton to do, too. After puzzle-solving your way to five Ancient Frogs and saving the island from a strange pollution, you can still find 100s of golden wings, snap dozens of creature pictures and go Achievement hunting.\r - A unique take on the Metroidvania formula\r  - Follow the path, or stray off-road and tackle the expert puzzles\r  - Whistle magical songs to rewind, fast-travel and more\r  - Snap dozens of Tokidex creature pictures… Expand"}, {"name": "Left 4 Dead: Crash Course", "details_link": "https://www.metacritic.com/game/xbox-360/left-4-dead-crash-course", "publisher": "Valve Software", "release_date": "Sep 29 2009", "developers": ["Valve Software"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/b7edd9a6a0a9a74ac4ccfcb1e9a58585-98.jpg", "descriptions": "(Downloadable Content)  Left 4 Dead's latest DLC delivers an all-new single-player, multiplayer and co-operative gameplay experience, expanding the game universe with new locations, new dialogue from the original cast, and an explosive finale. At the finale of No Mercy, our four Survivors(Downloadable Content)  Left 4 Dead's latest DLC delivers an all-new single-player, multiplayer and co-operative gameplay experience, expanding the game universe with new locations, new dialogue from the original cast, and an explosive finale. At the finale of No Mercy, our four Survivors fought their way to the rooftop of Mercy Hospital, where they were flown away to safety in a helicopter. Crash Course continues the story moments later, taking our heroes from a fiery helicopter crash in the outskirts of Riverside to the escape vehicle that will lead them to the events in Death Toll. While containing both Survival maps and a Co-operative Campaign, one of the primary goal of Crash Course is Versus mode. Crash delivers a complete, streamlined Versus mode experience in just 30 minutes. A recharge timer for infected teammates has also been added, so you can better coordinate your attacks. Item spawn behavior has changed for more balanced gameplay. [Valve]… Expand"}, {"name": "Blitz: The League", "details_link": "https://www.metacritic.com/game/playstation-2/blitz-the-league", "publisher": "Midway", "release_date": "Oct 17 2005", "developers": ["Midway"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/8758527c07912318404faee147482d52-98.jpg", "descriptions": "Blitz The League, a new, unlicensed videogame exposing the harsh realism and troubling, behind-the-scenes stories of a fictional professional football league. Blitz The League has been developed at Midway's Chicago studio in collaboration with a writer from ESPN's controversial \"Playmakers\"Blitz The League, a new, unlicensed videogame exposing the harsh realism and troubling, behind-the-scenes stories of a fictional professional football league. Blitz The League has been developed at Midway's Chicago studio in collaboration with a writer from ESPN's controversial \"Playmakers\" TV series. Blitz The League goes behind the glitz and glamour of the game through a revolutionary campaign mode that explores the on-field violence, off-field fallout and front-office politics of professional football. Blitz The League features a powerful story mode that, for the first time ever in a football videogame, explores the realism, lifestyle and drama found in professional football. Players take the helm of a downtrodden football franchise and retool the players and coaching staff in a quest to guide them to the league championship. Additional features include intense multiplayer action with head-to head online play and complete customization of players, teams, stadiums and more. [Midway]… Expand"}, {"name": "Worms W.M.D", "details_link": "https://www.metacritic.com/game/pc/worms-wmd", "publisher": "Team17", "release_date": "Aug 23 2016", "developers": ["Team17"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "genres": ["Strategy", "Turn-Based", "Artillery"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/8782083aca1b5deab814fb24d8b6a878-98.jpg", "descriptions": "With a hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some classic weapons and gameplay, Worms W.M.D is back."}, {"name": "From Dust", "details_link": "https://www.metacritic.com/game/pc/from-dust", "publisher": "Ubisoft", "release_date": "Aug 17 2011", "developers": ["Ubisoft Montpellier"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Adventure", "General", "General", "General"], "meta_score": 76, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/4181fe4f53526d886bb34cd6d3c2236a-98.jpg", "descriptions": "From Dust is a Modern God Game where Nature is the Star."}, {"name": "Rugby 06", "details_link": "https://www.metacritic.com/game/xbox/rugby-06", "publisher": "Electronic Arts", "release_date": "Feb 14 2006", "platforms": ["PlayStation 2", "Xbox"], "num_players": "6  Online", "genres": ["Sports", "Alternative", "Rugby"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/c4f408ef9be07978ff31cb46b6908bba-98.jpg", "descriptions": "Rugby 06 is the latest addition to EA's Rugby series. The game features new world-class rugby stars, improved stadium visuals, more licensed teams and tournaments, and play-by-play commentary from Grant Fox and Ian Robertson. In addition, the game will feature World League mode in which youRugby 06 is the latest addition to EA's Rugby series. The game features new world-class rugby stars, improved stadium visuals, more licensed teams and tournaments, and play-by-play commentary from Grant Fox and Ian Robertson. In addition, the game will feature World League mode in which you build and manage your rugby team through a deeper transfer market. … Expand"}, {"name": "King Arthur: Knight's Tale", "details_link": "https://www.metacritic.com/game/pc/king-arthur-knights-tale", "publisher": "NeocoreGames", "release_date": "Apr 26 2022", "developers": ["NeocoreGames"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/1/e8f154afc05ccef1f2386fcf156b9548-98.jpg", "descriptions": "A unique hybrid between turn-based tactical games and traditional, character-centric RPGs. Knight's Tale is a modern retelling of a classic Arthurian mythology story filtered through the dark fantasy tropes, a twist on the traditional tales of chivalry."}, {"name": "Akka Arrh", "details_link": "https://www.metacritic.com/game/pc/akka-arrh", "publisher": "Atari", "release_date": "Feb 21 2023", "developers": ["Llamasoft", "Jeff Minter"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Arcade"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/09d02b378dca24a2461d6ea7c7fdcc4b-98.jpg", "descriptions": "A cascade of words, color, shapes and sound flows around your turret as you desperately fight off swarms of inbound attackers. If enemies penetrate your perimeter you need to zoom into close range combat and beat them back, adjusting to a completely different perspective in the blink of anA cascade of words, color, shapes and sound flows around your turret as you desperately fight off swarms of inbound attackers. If enemies penetrate your perimeter you need to zoom into close range combat and beat them back, adjusting to a completely different perspective in the blink of an eye. Welcome to Jeff Minter's Akka Arrh.This modern take from the fine developers at Llamasoft combines the intrigue of an incredibly rare Atari arcade prototype with a unique creative vision that delivers a wave shooter that is insanely addictive. Akka Arrh drips with Minter's sense of humor, love of psychedelic color, and ability to create games that are a joy to play.… Expand"}, {"name": "The Banner Saga", "details_link": "https://www.metacritic.com/game/xbox-one/the-banner-saga", "publisher": "Versus Evil", "release_date": "Jan 12 2016", "developers": ["Stoic"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Role-Playing", "General", "Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/dbe8e7e8a660699964ae352896643fec-98.jpg", "descriptions": "The Banner Saga is a single player driven Viking saga in which a player’s choice in travel, conversation and combat determines the outcome of her own personal story as well as the survival of an entire civilization."}, {"name": "D4: Dark Dreams Don't Die", "details_link": "https://www.metacritic.com/game/xbox-one/d4-dark-dreams-dont-die", "publisher": "Microsoft Game Studios", "release_date": "Sep 19 2014", "developers": ["Access Games"], "platforms": ["PC", "Xbox One"], "genres": ["Action", "Adventure", "General", "3D", "Point-and-Click", "Modern", "Third-Person", "Modern"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/c7f2ee0299eed80b88ec00cd7abce4c0-98.jpg", "descriptions": "D4 is an episodic murder mystery for the Xbox One where you must use your ability to go back in time to solve the mystery of your wife's murder."}, {"name": "Sniper Elite", "details_link": "https://www.metacritic.com/game/playstation-2/sniper-elite", "publisher": "Namco", "release_date": "Oct 18 2005", "developers": ["Rebellion"], "platforms": ["PC", "PlayStation 2"], "num_players": "8  Online", "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Historic"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/d671f0bce1604494ab1de6849246d01b-98.jpg", "descriptions": "In Sniper Elite, players assume the role of an American sniper, disguised as a German soldier and dropped into war torn 1945 Berlin by the American OSS to gather intelligence on the top-secret German Atomic research. If his mission fails, control of the world's Atomic technology will fallIn Sniper Elite, players assume the role of an American sniper, disguised as a German soldier and dropped into war torn 1945 Berlin by the American OSS to gather intelligence on the top-secret German Atomic research. If his mission fails, control of the world's Atomic technology will fall into the hands of Stalin and the Soviet Army, throwing the world's political climate into chaos. In the undercover mission, players utilize their sniper training to gain access to key positions by taking out machine guns, armored vehicles, guard posts and sentries through stealth and pinpoint accuracy. Like a true sniper, players must follow their wits and instincts and utilize both first and third-person perspectives to negotiate through 28 open-ended levels in war-torn Berlin. In taking aim at enemy soldiers, players need to consider gravity, wind speed, heart rate, breathing and posture to successfully hit their target in one of the most authentic sniping mechanics ever devised. Players can even take up the fight or go head-to-head with a friend in the cooperative or competitive offline play modes, or even engage in a game of worldwide cat-and-mouse with up to eight players online. [Namco]… Expand"}, {"name": "Batman: The Enemy Within - Episode 1: The Enigma", "details_link": "https://www.metacritic.com/game/pc/batman-the-enemy-within---episode-1-the-enigma", "publisher": "Telltale Games", "release_date": "Aug  8 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 76, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/ca3a2174cd136ebad225ac89c4d9a929-98.jpg", "descriptions": "Both Bruce Wayne and Batman are forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigateBoth Bruce Wayne and Batman are forced into precarious new roles. The Riddler has returned to terrorize Gotham City, but his gruesome puzzles merely foreshadow an even greater crisis. With the arrival of a ruthless federal agent and the return of a still nascent Joker, Batman must navigate uneasy alliances while Bruce Wayne undertakes a perilous series of deceptions.… Expand"}, {"name": "Q.U.B.E. 2", "details_link": "https://www.metacritic.com/game/pc/qube-2", "publisher": "Toxic Games", "release_date": "Mar 13 2018", "developers": ["Toxic Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/18ba1a4cc16a58e54e5ec0c705aeecf5-98.jpg", "descriptions": "Assume the role of Amelia Cross, a stranded archaeologist who has mysteriously awaken among the sand swept ruins of an ancient alien landscape. Together with the distant help of another survivor, Commander Emma Sutcliffe, you must traverse and manipulate the structure of this forgotten worldAssume the role of Amelia Cross, a stranded archaeologist who has mysteriously awaken among the sand swept ruins of an ancient alien landscape. Together with the distant help of another survivor, Commander Emma Sutcliffe, you must traverse and manipulate the structure of this forgotten world to find a way back home.… Expand"}, {"name": "Kingdom Hearts HD 2.8 Final Chapter Prologue", "details_link": "https://www.metacritic.com/game/playstation-4/kingdom-hearts-hd-28-final-chapter-prologue", "publisher": "Square Enix", "release_date": "Jan 24 2017", "developers": ["Square Enix"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation", "Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/f6b54424486cb64823b819e5e554f0e5-98.jpg", "descriptions": "KINGDOM HEARTS HD 2.8 Final Chapter Prologue is a compilation of 3 magical KINGDOM HEARTS experiences: Originally released in 2012, KINGDOM HEARTS Dream Drop Distance HD is a full-HD remastered version of KINGDOM HEARTS 3D Dream Drop Distance, brought to console for the first time. SeriesKINGDOM HEARTS HD 2.8 Final Chapter Prologue is a compilation of 3 magical KINGDOM HEARTS experiences: Originally released in 2012, KINGDOM HEARTS Dream Drop Distance HD is a full-HD remastered version of KINGDOM HEARTS 3D Dream Drop Distance, brought to console for the first time. Series protagonists Sora and Riku take on the Mark of Mastery exam in preparation for coming threats. The signature action of the KINGDOM HEARTS series has evolved, allowing players to experience faster-paced battles and exploration at a blistering pace. KINGDOM HEARTS χ Back Cover (movie) A new HD movie that tells the mysterious story of the Foretellers, connecting the earliest parts of the series’ history, showcased in the mobile title KINGDOM HEARTS Unchained χ. KINGDOM HEARTS 0.2 Birth by Sleep – A Fragmentary Passage – A completely new playable episode that links to the story of KINGDOM HEARTS III, taking place after the storyline of KINGDOM HEARTS Birth by Sleep played from the perspective of Aqua. [Square-Enix]… Expand"}, {"name": "Ys VI: The Ark of Napishtim", "details_link": "https://www.metacritic.com/game/pc/ys-vi-the-ark-of-napishtim", "publisher": "Konami", "release_date": "Apr 28 2015", "developers": ["Falcom"], "platforms": ["iPhone/iPad", "PlayStation 2", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/4434dc18cc584872af75ab1d6cd81da3-98.jpg", "descriptions": "In the latest game in the series that originated in 1987,  players assume the role of Adol Christian and embark on a rich adventure set on a deserted island."}, {"name": "War Thunder", "details_link": "https://www.metacritic.com/game/playstation-4/war-thunder", "publisher": "Gaijin Entertainment", "release_date": "Jun  3 2014", "developers": ["Gaijin Entertainment"], "platforms": ["PC", "PlayStation 5", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 32 ", "genres": ["Action", "Simulation", "General", "Flight", "Vehicle", "Combat"], "meta_score": 76, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/2812e9447ba4852db22fa0d17049729f-98.jpg", "descriptions": "War Thunder is a next generation MMO combat game dedicated to World War II military aviation, armored vehicles, and fleets. You will take part in all of the major combat battles, fighting with real players all over the world."}, {"name": "Destiny", "details_link": "https://www.metacritic.com/game/playstation-4/destiny", "publisher": "Activision", "release_date": "Sep  9 2014", "developers": ["Bungie Software", "Bungie"], "platforms": ["PlayStation 3", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Shooter", "Sci-Fi", "Action", "Shooter", "First-Person", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/483ad10ec1e6fa213a2900ac27e269e2-98.jpg", "descriptions": "In Destiny (from the creators of Halo) you are a Guardian of the last city on Earth. You are able to wield incredible power. Explore the ancient ruins of our solar system, from the vast dunes of Mars to the lush jungles of Venus. Defeat Earth’s enemies. Reclaim all that we have lost. BecomeIn Destiny (from the creators of Halo) you are a Guardian of the last city on Earth. You are able to wield incredible power. Explore the ancient ruins of our solar system, from the vast dunes of Mars to the lush jungles of Venus. Defeat Earth’s enemies. Reclaim all that we have lost. Become legend. Embark on an epic action adventure with rich cinematic storytelling where you unravel the mysteries of our universe and reclaim what we lost at the fall of our Golden Age. The next evolution of the first-person action genre that promises to provide an unprecedented combination of storytelling, cooperative, competitive, and public gameplay, and personal activities that are all woven into an expansive, persistent online world. Venture out alone or join up with friends. The choice is yours. Personalize and upgrade every aspect of how you look and fight with a nearly limitless combination of armor, weapons, and visual customizations. Take your upgraded character into every mode, including campaign, cooperative, social, public, and competitive multiplayer.… Expand"}, {"name": "Knytt Underground", "details_link": "https://www.metacritic.com/game/wii-u/knytt-underground", "publisher": "Ripstone", "release_date": "Dec 19 2013", "developers": ["nifflas", "Nifflas Games"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/8228c1f138aaf725f7f15e0d327a7097-98.jpg", "descriptions": "Knytt Underground, the sequel to the massively popular Knytt and Knytt Stories, is the next stage in the well-liked series, with the original boasting over 1 million downloads globally. The exciting platform game offers gamers exploration in an infinitely breathtaking atmosphere and will beKnytt Underground, the sequel to the massively popular Knytt and Knytt Stories, is the next stage in the well-liked series, with the original boasting over 1 million downloads globally. The exciting platform game offers gamers exploration in an infinitely breathtaking atmosphere and will be available on PlayStation 3 and PlayStation Vita later this year.… Expand"}, {"name": "Pro Evolution Soccer 2008", "details_link": "https://www.metacritic.com/game/xbox-360/pro-evolution-soccer-2008", "publisher": "Konami", "release_date": "Mar 11 2008", "developers": ["Konami"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/84810c3a4fbe5f35205c44b8929896c8-98.jpg", "descriptions": "PES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by thePES 2008 features a brand new intelligence system, called Teamvision, that adapts and reacts to players own gameplay styles to ensure that the computer controlled opponents are always challenging and forcing the player to think and chance their style of play to avoid being out-thought by the game. It learns counter attacks that target your weaknesses and look to exploit any repetitive tactics players use. Defenders react better to danger, closing down the ball and charging at shots and the goalkeepers hold shots that are closer to them as well. Teammates make more intelligent runs into space and the close control has been sharpened to ensure quick and fluid passing and speedy attacks can be built. The next gen versions also feature extensive edit modes so players can completely customise their PES 2008 experience. [Konami]… Expand"}, {"name": "WWE 2K19", "details_link": "https://www.metacritic.com/game/playstation-4/wwe-2k19", "publisher": "2K Games", "release_date": "Oct  5 2018", "developers": ["Yuke's", "Visual Concepts"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/1c7d908e0fdf36daa451adfb3f56c3e8-98.jpg", "descriptions": "WWE 2K19 arrives as the latest entry to the flagship WWE video game franchise and features cover Superstar AJ Styles. WWE 2K19 will showcase a massive roster of popular WWE Superstars, Legends and Hall of Famers, as well as NXT favorites. Experience authentic WWE gameplay, extensive creationWWE 2K19 arrives as the latest entry to the flagship WWE video game franchise and features cover Superstar AJ Styles. WWE 2K19 will showcase a massive roster of popular WWE Superstars, Legends and Hall of Famers, as well as NXT favorites. Experience authentic WWE gameplay, extensive creation options, engaging match types, fan-favorite modes and much more!… Expand"}, {"name": "Bonkies", "details_link": "https://www.metacritic.com/game/playstation-4/bonkies", "publisher": "Crunching Koalas", "release_date": "Jan 29 2021", "developers": ["Gauntlet Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "General", "Party / Minigame"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/08633d609591009814bbcfdd2a3dd775-98.jpg", "descriptions": "Bonkies is a jolly, couch co-op party game with a pinch of construction building! Gather your prime mates, equip your banana-fuelled jetpack and robo-arm, and raise wacky buildings all over the cosmos for the glory of apekind! Become the CHIMPion of space construction."}, {"name": "Unto The End", "details_link": "https://www.metacritic.com/game/playstation-4/unto-the-end", "publisher": "Big Sugar Films", "release_date": "Dec  9 2020", "developers": ["2 Ton Studios"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 76, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/0/7c7b01cb790c9f75bea93624f474d9ad-98.jpg", "descriptions": "Unto The End is a challenging combat adventure game in the style of a cinematic platformer. The story is simple: get home to your family. Master read-react combat in intense sword fights. Spot opportunities to trade and use items. An adventure told through your actions, how will you make it home?"}, {"name": "DOOM 64", "details_link": "https://www.metacritic.com/game/switch/doom-64", "publisher": "Bethesda Softworks", "release_date": "Mar 20 2020", "developers": ["id Software", "Night Dive Studios"], "platforms": ["PC", "PlayStation 4", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/cc93b499fff6f8947ac1599f8bf8f3fe-98.jpg", "descriptions": "You killed the Demons once, they were all dead. Or so you thought... A single Demon Entity escaped detection. Systematically it altered decaying, dead carnage back into grotesque living tissue. The Demons have returned - stronger and more vicious than ever before. You mission is clear, thereYou killed the Demons once, they were all dead. Or so you thought... A single Demon Entity escaped detection. Systematically it altered decaying, dead carnage back into grotesque living tissue. The Demons have returned - stronger and more vicious than ever before. You mission is clear, there are no options: kill or be killed!… Expand"}, {"name": "Disgaea 1 Complete", "details_link": "https://www.metacritic.com/game/switch/disgaea-1-complete", "publisher": "NIS America", "release_date": "Oct  9 2018", "developers": ["Nippon Ichi Software"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/171e5073dc700748a5093e06ca10d952-98.jpg", "descriptions": "The Overlord is dead. The Netherworld is in turmoil. Time to kick some ass! Netherworld Prince Laharl awakens to fight for his throne and it’s up to him and some unlikely allies to defend what is rightfully his. Together with his devious vassal Etna, the angel trainee Flonne, and a wholeThe Overlord is dead. The Netherworld is in turmoil. Time to kick some ass! Netherworld Prince Laharl awakens to fight for his throne and it’s up to him and some unlikely allies to defend what is rightfully his. Together with his devious vassal Etna, the angel trainee Flonne, and a whole cavalcade of explosive characters, Laharl will slash, shoot, and punch his way to the top. Build your squad to level 9999 and unleash crazy special skills, team attacks, and spells to deal millions of points of damage in this zany high-definition remake of an RPG classic.… Expand"}, {"name": "Batman: The Telltale Series - Episode 5: City of Light", "details_link": "https://www.metacritic.com/game/xbox-one/batman-the-telltale-series---episode-5-city-of-light", "publisher": "Telltale Games", "release_date": "Dec 13 2016", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/20d976c2a07a97f5649067c08af422a4-98.jpg", "descriptions": "Enter the fractured psyche of Bruce Wayne and discover the powerful and far-reaching consequences of your choices as the Dark Knight. The fate of Bruce Wayne, his dark persona, Batman, and Gotham hang in the balance."}, {"name": "Skullgirls: 2nd Encore", "details_link": "https://www.metacritic.com/game/playstation-vita/skullgirls-2nd-encore", "publisher": "Autumn Games", "release_date": "Apr  5 2016", "developers": ["Lab Zero Games"], "platforms": ["PC", "PlayStation 4", "Switch", "PlayStation Vita"], "num_players": "2 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/fb9cd4d13105095171629df1425f2e43-98.jpg", "descriptions": "Skullgirls 2nd Encore is a beautiful, fast-paced 2D fighting game that puts players in control of fierce warriors in an extraordinary Dark Deco world. Each of the 14 wildly original characters features unique gameplay mechanics and plenty of personality.\r Skullgirls 2nd Encore is theSkullgirls 2nd Encore is a beautiful, fast-paced 2D fighting game that puts players in control of fierce warriors in an extraordinary Dark Deco world. Each of the 14 wildly original characters features unique gameplay mechanics and plenty of personality.\r Skullgirls 2nd Encore is the perfect fighting game for casual and competitive fighting game fans alike. Casual players will enjoy the fully voiced story mode, gorgeous animation and soundtrack by Michiru Yamane, while hardcore players will appreciate its balance, cross-platform multiplayer, and support for PlayStation3 system fight sticks.\r Use of PSN and SEN account are subject to the Terms of Service and User Agreement and applicable privacy policy (see terms at sonyentertainmentnetwork.com/terms-of-service & sonyentertainmentnetwork.com/privacy-policy). *Online multiplayer also requires a PlayStationPlus subscription.… Expand"}, {"name": "Mechanic Master", "details_link": "https://www.metacritic.com/game/ds/mechanic-master", "publisher": "Midway", "release_date": "Oct 21 2008", "developers": ["Most Wanted Entertainment"], "platforms": "DS", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/d37556afa39e0784773bf1bf157af180-98.jpg", "descriptions": "Mechanic Master for the Nintendo DS is a fun problem-solving game for creative minds. Mechanic Master uses the stylus as a weapon to rid the Earth of alien invaders that have scattered across the planet. Become the ultimate Master of Mechanics by creating crazy contraptions to free humans,Mechanic Master for the Nintendo DS is a fun problem-solving game for creative minds. Mechanic Master uses the stylus as a weapon to rid the Earth of alien invaders that have scattered across the planet. Become the ultimate Master of Mechanics by creating crazy contraptions to free humans, keep the mechanics in motion and defeat those pesky foes. Test your skills with more than 100 levels! Creative-thinking is key to clearing each level. [Midway]… Expand"}, {"name": "Yu-Gi-Oh! World Championship 2007", "details_link": "https://www.metacritic.com/game/ds/yu-gi-oh!-world-championship-2007", "publisher": "Konami", "release_date": "Mar 20 2007", "developers": ["Konami"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/5/d4e824d4689d9face0a956bdd94366ba-98.jpg", "descriptions": "For the first time, the Yu-Gi-Oh! World Championship Tournament series makes its debut on the Nintendo DS™. The official software of the 2007 Yu-Gi-Oh! World Tournament makes worldwide wireless dueling possible utilizing the Nintendo Wi-Fi connection. The game includes 1,600 of the latestFor the first time, the Yu-Gi-Oh! World Championship Tournament series makes its debut on the Nintendo DS™. The official software of the 2007 Yu-Gi-Oh! World Tournament makes worldwide wireless dueling possible utilizing the Nintendo Wi-Fi connection. The game includes 1,600 of the latest cards and more cards will be available for download. Voice chat is available before you start dueling. Create and edit the look of your character. Each game includes three exclusive trading cards: Spell Striker, Exploder Dragon, Destiny Hero - Disk Commander. [Konami]… Expand"}, {"name": "Transformers: War for Cybertron", "details_link": "https://www.metacritic.com/game/xbox-360/transformers-war-for-cybertron", "publisher": "Activision", "release_date": "Jun 22 2010", "developers": ["High Moon Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 76, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/b9e990e37b97bafeb7bce2fe60698e26-98.jpg", "descriptions": "Transformers: War for Cybertron challenges players to become the ultimate weapon as a TRANSFORMERS character in the final, epic war that will determine the survival of their entire race. Armed with a diverse arsenal of lethal, high-tech weaponry and the ability to instantly convert fromTransformers: War for Cybertron challenges players to become the ultimate weapon as a TRANSFORMERS character in the final, epic war that will determine the survival of their entire race. Armed with a diverse arsenal of lethal, high-tech weaponry and the ability to instantly convert from robot to vehicle at any time, players will engage in heart-pounding battles on land and in the air in this gripping, 3rd person action shooter set in the TRANSFORMERS’ war-ravaged homeland. Complete with several multiplayer modes, Transformers: War for Cybertron allows gamers to play through story missions with their friends in drop in/drop out online co-op, and also create their own TRANSFORMERS character for competitive head-to-head multiplayer modes, choosing among four distinct character classes, personalizing its look and selecting from a huge variety of weapons, skills and abilities. [Activision]… Expand"}, {"name": "LawBreakers", "details_link": "https://www.metacritic.com/game/pc/lawbreakers", "publisher": "Nexon", "release_date": "Aug  4 2017", "developers": ["Boss Key", "Boss Key Productions"], "platforms": ["PlayStation 4", "PC"], "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Third-Person", "Arcade", "Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/7/aab780b18e375e60c736c3b867c7c6e0-98.jpg", "descriptions": "Prepare to deliver death from every angle, as you master your skills and compete in unprecedented gravity-defying combat in LawBreakers."}, {"name": "Operation Flashpoint: Dragon Rising", "details_link": "https://www.metacritic.com/game/playstation-3/operation-flashpoint-dragon-rising", "publisher": "Codemasters", "release_date": "Oct  6 2009", "developers": ["Codemasters"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 76, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/3e7b2f2b2d2646f490636aa5160412a3-98.jpg", "descriptions": "Taking gamers as close to war as they'll ever want to get, Operation Flashpoint: Dragon Rising is the much anticipated return of the genre-defining military conflict simulator. Set to deliver the total combat experience, Flashpoint: Dragon Rising challenges players to survive the chaos andTaking gamers as close to war as they'll ever want to get, Operation Flashpoint: Dragon Rising is the much anticipated return of the genre-defining military conflict simulator. Set to deliver the total combat experience, Flashpoint: Dragon Rising challenges players to survive the chaos and rapidly evolving situations of modern warfare in a new contemporary theatre. Players experience the intensity, diversity and claustrophobia of a modern conflict from the unique perspectives of an infantry marine, a helicopter pilot, a Special Forces officer or a tank commander, each engaged against the full force of the Chinese PLA on a scale never previously experienced in a military action title. Gameplay simulates an immense conflict between advanced forces and provides unparalleled scope with different military disciplines, vehicles and equipment for players to utilize. [Codemasters]… Expand"}, {"name": "LEGO Harry Potter: Years 5-7", "details_link": "https://www.metacritic.com/game/playstation-3/lego-harry-potter-years-5-7", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Nov 11 2011", "developers": ["Traveller's Tales"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation Vita", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/d9f91d697ce3dbdc14221f82c8998334-98.jpg", "descriptions": "Based on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations includingBased on the last three Harry Potter books and final four films, LEGO Harry Potter: Years 5-7 takes players through Harry Potter’s heroic adventures in the Muggle and wizarding worlds. From Privet Drive in Little Whinging to Diagon Alley, Hogsmeade and Hogwarts – plus new locations including Grimmauld Place, the Ministry of Magic, and Godric’s Hollow – players will encounter new faces, new challenges and new magic, preparing them for the ultimate face-off against Lord Voldemort.… Expand"}, {"name": "Grapple Dog", "details_link": "https://www.metacritic.com/game/switch/grapple-dog", "publisher": "Super Rare Games", "release_date": "Feb 10 2022", "developers": ["Joseph Gribbin"], "platforms": ["PC", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 76, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/7/b09de9b905bb0ef1d7a5a951273dff38-98.jpg", "descriptions": "Jump, Swing and Zip your way through colourful worlds and exciting challenges in this unique 2D action-platformer! Master the power of the Grapple on your adventure to save the world."}, {"name": "One Piece: Pirate Warriors 4", "details_link": "https://www.metacritic.com/game/xbox-one/one-piece-pirate-warriors-4", "publisher": "Bandai Namco Games", "release_date": "Mar 27 2020", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/242de860b3355a9fcdae1a4ab9306007-98.jpg", "descriptions": "The Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of finding theThe Pirate Warriors are back and bring with them a more explosive story, more environments and even crazier attacks in ONE PIECE: PIRATE WARRIORS 4. Follow Luffy and the Straw Hats from the beginning as they make their journey through different islands and onwards in the hopes of finding the illustrious treasure - the One Piece. Play through some of the most extraordinary areas in the ONE PIECE story and take on memorable foes.\r Choose from some of your favorite characters and take on a vast number of enemies through iconic moments from the OnePiece anime. Developed by the masters of the action musou genre, KOEI TECMO GAMES, ONE PIECE Pirate Warriors 4 brings together the excitement from slashing hordes of enemies with the fun and energetic personalities from the One Piece series. Setsail on a new pirate warriors adventure.… Expand"}, {"name": "BlazBlue: Cross Tag Battle", "details_link": "https://www.metacritic.com/game/playstation-4/blazblue-cross-tag-battle", "publisher": "Arc System Works", "release_date": "Jun  5 2018", "developers": ["Arc System Works"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 76, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/044d79cbd8a693f34b0315202b9a66a7-98.jpg", "descriptions": "THE COLLISION IS INEVITABLE! THE IMPACT WILL BE UNAVOIDABLE!An unrivaled clash of explosive proportions! The beloved BlazBlue franchise Crosses universes, Tags in fan favorites, and Battles it out in BlazBlue: Cross Tag Battle! Created through an all-star collaboration between BlazBlue,THE COLLISION IS INEVITABLE! THE IMPACT WILL BE UNAVOIDABLE!An unrivaled clash of explosive proportions! The beloved BlazBlue franchise Crosses universes, Tags in fan favorites, and Battles it out in BlazBlue: Cross Tag Battle! Created through an all-star collaboration between BlazBlue, Atlus' Persona, French Bread's Under Night In-Birth, and Rooster Teeth's hugely popular RWBY web series, Cross Tag Battle celebrates the fighting genre for pros and newcomers alike! Choose your team in fast paced 2v2 team battles filled with the craziness you've come to love from BlazBlue, with all the tight mechanics, smooth gameplay, and gorgeous 2D graphics you expect from Arc System Works.BlazBlue, celebrating 10 years of fighting game excellence in 2018, is a series long beloved by the fighting game community for its deep and engrossing story, its vast cast of balanced characters, and its quick and kinetic gameplay style.Atlus' Persona series, a worldwide RPG phenomenon and no stranger to the fighting game genre itself. Persona characters have appeared in Arc System Works games before, notable Persona 4 Arena and Persona 4 Arena Ultimax.Under Night In-Birth is veteran fighting game developer French Bread's first foray into an original title, coming hot off the heels of their success with the cult classic series Melty Blood.Rooster Teeth's animated mega hit, RWBY, has been a popular franchise for years, crossing both gender and age barriers to become a mainstream hit. Characters from the RWBY series have never appeared in a fighting game before. Until now.… Expand"}, {"name": "Renegade Ops", "details_link": "https://www.metacritic.com/game/pc/renegade-ops", "publisher": "Sega", "release_date": "Oct 26 2011", "developers": ["Avalanche Studios"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "General", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/ee2737e3800597954610d93ec99dbb51-98.jpg", "descriptions": "Renegade Ops puts players in a mobile commando unit sent behind enemy lines to defeat Inferno, a madman intent on global domination. Defeat enemies across a range of stunning environments using a wide variety of vehicles, from dispersing electromagnetic shock waves to the deployment of aRenegade Ops puts players in a mobile commando unit sent behind enemy lines to defeat Inferno, a madman intent on global domination. Defeat enemies across a range of stunning environments using a wide variety of vehicles, from dispersing electromagnetic shock waves to the deployment of a huge Gatling gun armed to the teeth. Players have the choice to fight alone in single player mode, team up offline with two-player split screen or join the dynamic 4-player online co-op experience. Blast your way through enemy lines by working together, or compete for achievements as you and your friends aim to top the online leader boards.… Expand"}, {"name": "Green Day: Rock Band", "details_link": "https://www.metacritic.com/game/wii/green-day-rock-band", "publisher": "MTV Games", "release_date": "Jun  8 2010", "developers": ["Harmonix Music Systems"], "platforms": ["PlayStation 3", "Xbox 360", "Wii"], "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 76, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/0/2b0a57f72fa86197894c96be8d9aee25-98.jpg", "descriptions": "Green Day: Rock Band allows players to step onto the stage and into the shoes of Green Day, the multi-platinum, Grammy Award-winning band that jump-started the punk-pop revival and has continued to pave the way for American rock music into the 21st century. Taking on the likenesses of GreenGreen Day: Rock Band allows players to step onto the stage and into the shoes of Green Day, the multi-platinum, Grammy Award-winning band that jump-started the punk-pop revival and has continued to pave the way for American rock music into the 21st century. Taking on the likenesses of Green Day members Billie Joe Armstrong, Mike Dirnt and Tré Cool, players progress through the story and history of Green Day, gaining access into the band’s media vault, where they can unlock more than 100 collectible images, and more than 40 minutes of rare and unreleased video from interviews, outtakes and performances. [MTV Games]… Expand"}, {"name": "MotoGP 19", "details_link": "https://www.metacritic.com/game/playstation-4/motogp-19", "publisher": "Milestone S.r.l", "release_date": "Jun  6 2019", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/0/800335d15246f7945a5fd51c297f8d4b-98.jpg", "descriptions": "Remember when you were the king of the race? Old times: thanks to the Neural AI and to the Machine Learning, you’ll now face smarter, faster opponents who will exploit your mistakes. The challenge is about to get real."}, {"name": "Pode", "details_link": "https://www.metacritic.com/game/playstation-4/pode", "publisher": "Henchman & Goon", "release_date": "Feb 19 2019", "developers": ["Henchman & Goon"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 76, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/3/a085c680bd0f653ce0a4ab531fd17366-98.jpg", "descriptions": "Pode is a co-op puzzle exploration game about a rock and a fallen star working together to solve ancient puzzles in an environment inspired by Norwegian art & culture."}, {"name": "Kerbal Space Program: Making History", "details_link": "https://www.metacritic.com/game/pc/kerbal-space-program-making-history", "publisher": "Squad", "release_date": "Mar 13 2018", "developers": ["Squad"], "platforms": "PC", "genres": ["Simulation", "Space", "Combat", "Civilian"], "meta_score": 76, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/b41cd8871b3bfd6bc253cd428f8be689-98.jpg", "descriptions": "Mission Builder is an exciting new feature that puts the process of creating and editing missions in your hands. We want to give you the tools to get the sense of being part of a space program’s Mission Design Division by tailoring your own missions and narratives in a friendly and intuitiveMission Builder is an exciting new feature that puts the process of creating and editing missions in your hands. We want to give you the tools to get the sense of being part of a space program’s Mission Design Division by tailoring your own missions and narratives in a friendly and intuitive interface. Once created, you will be able to easily share your missions with the wider community. History Pack are pre-made missions for you to play immediately. You will have the opportunity to re-live historical missions from humankind’s own space history, all with that unique Kerbal Space Program twist! The pack will include a new set of parts and a new astronaut suit for your brave heroes.… Expand"}, {"name": "Dragon Quest Heroes II", "details_link": "https://www.metacritic.com/game/playstation-4/dragon-quest-heroes-ii", "publisher": "Square Enix", "release_date": "Apr 25 2017", "developers": ["Omega Force"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 76, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/11b68316daa6cfbf597d0c441a6a88ab-98.jpg", "descriptions": "After a 1000 years of peace, the Seven Realms suddenly fall into conflict as if guided by a mysterious and malicious force. Now, you must lead a band of powerful heroes in a quest to defeat evil and save the war-torn world."}, {"name": "LEGO Indiana Jones: The Original Adventures", "details_link": "https://www.metacritic.com/game/psp/lego-indiana-jones-the-original-adventures", "publisher": "LucasArts", "release_date": "Jun  3 2008", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "General"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/a944e501a9ffc4798728ee80bd3406c8-98.jpg", "descriptions": "LEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones andLEGO Indiana Jones: The Original Adventures takes the fun and creative construction of LEGO and combines it with the wits, daring and non-stop action from the original cinematic adventures that enthralled audiences everywhere (Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom and Indiana Jones and the Last Crusade). With a unique tongue-in-cheek take on the original adventures, LEGO Indiana Jones follows Dr. Jones escapades through the jungles of South America to the mountaintops of India. Fans can build, battle and brawl their way through their favorite cinematic moments, from Indy's entanglements with snakes to his dashing boulder run. Pop culture's most iconic archeologist whips through all the classic moments with the help of a host of supporting characters including Marion Ravenwood and Short Round. Players can also mix and match the body parts of more than 60 playable characters to create new heroes just as they could in the LEGO Star Wars games. [LucasArts]… Expand"}, {"name": "Trainz Railroad Simulator 2004", "details_link": "https://www.metacritic.com/game/pc/trainz-railroad-simulator-2004", "publisher": "Oteeva", "release_date": "Nov  2 2003", "developers": ["Auran"], "platforms": "PC", "num_players": "1 Player", "genres": ["Simulation", "Train"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/abe55fd587e2ebd0f8bd798aa8363ceb-98.jpg", "descriptions": "Trainz Railroad Simulator 2004 is about a lot more than driving trains -- it lets players operate their choice of Union Pacific and other locos, from the early days of steam through to modern high-speed electrics, under a variety of challenging conditions in real world scenarios. [Oteeva]"}, {"name": "Trevor Chan's Restaurant Empire", "details_link": "https://www.metacritic.com/game/pc/trevor-chans-restaurant-empire", "publisher": "Enlight Software", "release_date": "Mar 26 2003", "developers": ["Enlight Software"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Tycoon", "Management", "Business / Tycoon"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/5a107ffcc2f9f6b166ef11f8084f1eb2-98.jpg", "descriptions": "Starting with nothing except some cash and a passion for food, build a restaurant from the bottom up - hire waiters, decorate, even cook the meals! Buy, build, outsell and underprice your competition. Will you use your culinary wizardry to out-cook chefs? What tactics and strategies will youStarting with nothing except some cash and a passion for food, build a restaurant from the bottom up - hire waiters, decorate, even cook the meals! Buy, build, outsell and underprice your competition. Will you use your culinary wizardry to out-cook chefs? What tactics and strategies will you employ to buy out the competition? You decide. With a combination of business strategy and role-playing game styles plus a free-form sandbox game mode, three huge cities, and over 30 playable chefs and a host of locations to travel to, Restaurant Empire is an epicurean delight of gastronomic proportions! [Enlight]… Expand"}, {"name": "MLB Slugfest 20-04", "details_link": "https://www.metacritic.com/game/gamecube/mlb-slugfest-20-04", "publisher": "Midway", "release_date": "Mar 16 2003", "developers": ["Midway"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Baseball", "Arcade"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/5e454788b8994b1b113affa3200b9a34-98.jpg", "descriptions": "MLB SlugFest is back with more aggressive-style baseball than ever.  MLB Slugfest 20-04 delivers a blend of hardcore, lightning-fast gameplay combined with key baseball features that will please even the most diehard sports fan.  Turbo running, fielding, batting, and throwing are essentialMLB SlugFest is back with more aggressive-style baseball than ever.  MLB Slugfest 20-04 delivers a blend of hardcore, lightning-fast gameplay combined with key baseball features that will please even the most diehard sports fan.  Turbo running, fielding, batting, and throwing are essential skills in this game, which makes every play a highlight.  Among your favorite MLB players from around the league, you can create your own team of superstars, and then work your way up to a World Series championship.  With new moves, rosters, and the addition of the new Home Run Derby mode, this year's SlugFest hits home with awesome power.… Expand"}, {"name": "Tom Clancy's Rainbow Six: Rogue Spear", "details_link": "https://www.metacritic.com/game/game-boy-advance/tom-clancys-rainbow-six-rogue-spear", "publisher": "Ubisoft", "release_date": "Mar 18 2002", "developers": ["Ubisoft Milan"], "platforms": ["PC", "Game Boy Advance"], "genres": ["Action", "Shooter", "Third-Person", "Tactical", "Modern"], "meta_score": 76, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/ddeecc613415781f08a12e3011d9e74f-98.jpg", "descriptions": "The action is still there, and, even more surprisingly, so are many of the frills that make the experience feel genuine."}, {"name": "NBA Inside Drive 2002", "details_link": "https://www.metacritic.com/game/xbox/nba-inside-drive-2002", "publisher": "Microsoft Game Studios", "release_date": "Jan 21 2002", "developers": ["High Voltage Software"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/7/627e50b195b0df92fccef71ee37dff32-98.jpg", "descriptions": "NBA Inside Drive combines NBA end-to-end action with the high-flying acrobatic dunks of Vince Carter and all of the NBA's stars. Stunning graphics put you on all of the NBA arena floors and pits you along side all of your favorite NBA players. Inside Drive is one-touch passing and shooting,NBA Inside Drive combines NBA end-to-end action with the high-flying acrobatic dunks of Vince Carter and all of the NBA's stars. Stunning graphics put you on all of the NBA arena floors and pits you along side all of your favorite NBA players. Inside Drive is one-touch passing and shooting, combined with the pace and action of real NBA basketball challenges you to bring your best game -- both offensively and defensively. NBA Inside Drive 2002 takes basketball gaming to a new level!… Expand"}, {"name": "TransWorld Surf", "details_link": "https://www.metacritic.com/game/xbox/transworld-surf", "publisher": "Atari", "release_date": "Nov 14 2001", "developers": ["Rockstar San Diego"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Surfing"], "meta_score": 76, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/c7af05dece8b89147b18102aa6dac600-98.jpg", "descriptions": "TransWorld Surf lets you pull off all the massive airs and blazing tailslides of professional surfers, including Taj Burrow, Andy Irons, and Shane Dorian. This is your chance to drop into more than 20 of the world's most challenging breaks in locations such as Todos Santos, Hossegor, andTransWorld Surf lets you pull off all the massive airs and blazing tailslides of professional surfers, including Taj Burrow, Andy Irons, and Shane Dorian. This is your chance to drop into more than 20 of the world's most challenging breaks in locations such as Todos Santos, Hossegor, and Tavarua. Conquer the waves with a friend, hitch a ride with the Reef Girls, watch out for the hungry sharks, and remember to save your best moves for photographers who just may put you on the in-game cover of TransWorld Surf.… Expand"}, {"name": "Patrician II: Quest for Power", "details_link": "https://www.metacritic.com/game/pc/patrician-ii-quest-for-power", "publisher": "Strategy First", "release_date": "Oct  8 2001", "developers": ["Ascaron Entertainment GmbH", "Ascaron Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General"], "meta_score": 76, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/344ee7c1b1ebbe0295f8f2b2821aba40-98.jpg", "descriptions": "A real-time trading simulation featuring elements of construction and the historical background of maritime trade in the North European area between London and Novgorod during the 1300's. As a citizen of a medieval town, the aim of the game is to rise from the status of a simple trader toA real-time trading simulation featuring elements of construction and the historical background of maritime trade in the North European area between London and Novgorod during the 1300's. As a citizen of a medieval town, the aim of the game is to rise from the status of a simple trader to that of a big businessman and perhaps to the head of the Hanseatic League. [Strategy First]… Expand"}, {"name": "MX 2002 Featuring Ricky Carmichael", "details_link": "https://www.metacritic.com/game/playstation-2/mx-2002-featuring-ricky-carmichael", "publisher": "THQ", "release_date": "Jul  3 2001", "developers": ["Pacific Coast Power & Light"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 76, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/b5c94dc5cc5ec5c4d7dfc121f83b4684-98.jpg", "descriptions": "Pacific Coast Power and Light has developed a brand new 3D engine for this game which features a floaty physics model allowing for bigger jumps and tricks; exhibition, career, and challenge modes; and music from Sum 41, American Hi-Fi, Relative Ash, and Injected."}, {"name": "Tony Hawk's American Wasteland", "details_link": "https://www.metacritic.com/game/gamecube/tony-hawks-american-wasteland", "publisher": "Activision", "release_date": "Oct 18 2005", "developers": ["Neversoft Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "GameCube"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Skateboarding"], "meta_score": 76, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/ab806e7fe5efd648b8161d988e3e734e-98.jpg", "descriptions": "Now you can cruise through LA without loading levels or stopping gameplay in Tony Hawk's American Wasteland. You can skate or BMX through a new story mode that takes you through all-new skate areas using tricks that have never appeared in previous Tony Hawk games. The cash that you earn canNow you can cruise through LA without loading levels or stopping gameplay in Tony Hawk's American Wasteland. You can skate or BMX through a new story mode that takes you through all-new skate areas using tricks that have never appeared in previous Tony Hawk games. The cash that you earn can be used to customize your equipment and your skater by going to tattoo parlors and skate shops. Tony Hawk's American Wasteland also includes a classic mode that features classic Tony Hawk Pro Skater maps and objectives.… Expand"}, {"name": "Puyo Pop Fever", "details_link": "https://www.metacritic.com/game/ds/puyo-pop-fever", "publisher": "Atlus", "release_date": "May  3 2005", "developers": ["Sonic Team"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Matching", "Matching"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/22368a4a94845d5d1f23a4605dc3c8ba-98.jpg", "descriptions": "Everything that you loved about Puyo POP is here as you puzzle your way through the ultimate combo creator: Fever Mode! This is where you'll throw as many chains together as possible in order to crush your opponents with unbreakable Nuisance Puyos. When the Giant Puyo appears, change itsEverything that you loved about Puyo POP is here as you puzzle your way through the ultimate combo creator: Fever Mode! This is where you'll throw as many chains together as possible in order to crush your opponents with unbreakable Nuisance Puyos. When the Giant Puyo appears, change its color and watch those triple and quadruple Puyo combos pop. You can go it alone and go for top score in Endless Mode and the brand new Story Mode, or play with up to 8 players with single-card download play! Do you have the fever!? Play as any one of 14 crazy characters. New puzzle pieces feature triple and quadruple sets. Jump right into the action or learn advanced techniques in the training course. [Atlus]… Expand"}, {"name": "Tacoma", "details_link": "https://www.metacritic.com/game/pc/tacoma", "publisher": "The Fullbright Company", "release_date": "Aug  1 2017", "developers": ["The Fullbright Company", "Fullbright"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 76, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/a150687d59dbf4ae6b92c3aef6087f63-98.jpg", "descriptions": "Tacoma is a narrative-driven adventure set aboard a high-tech space station in the year 2088. Explore every detail of how the station’s crew lived and worked, finding clues that add up to a gripping story of trust, fear, and resolve in the face of disaster."}, {"name": "Call of Duty: Black Ops Cold War", "details_link": "https://www.metacritic.com/game/xbox-series-x/call-of-duty-black-ops-cold-war", "publisher": "Activision", "release_date": "Nov 13 2020", "developers": ["Raven Software", "Treyarch"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X"], "num_players": "Up to 40 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 76, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/4/c758f35ea9ac8be5cf69a0da716f3ab9-98.jpg", "descriptions": "Black Ops Cold War will drop fans into the depths of the Cold War's volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globeBlack Ops Cold War will drop fans into the depths of the Cold War's volatile geopolitical battle of the early 1980s. Nothing is ever as it seems in a gripping single-player Campaign, where players will come face-to-face with historical figures and hard truths, as they battle around the globe through iconic locales like East Berlin, Vietnam, Turkey, Soviet KGB headquarters, and more.\r MULTIPLAYER\rEngage in deniable operations and signature combat in the next generation of Multiplayer.\r ZOMBIES\rPlayers will bring a Cold War arsenal of weapons and equipment into the next evolution of Treyarch's signature Zombies co-operative experience. \r\rWARZONE\rBlack Ops Cold War will also support and build on the hit, free-to-play experience Call of Duty: Warzone. \r\rCross Play, Cross-Progression and Cross-Generation Enabled. \r\rNEXT-GEN\rUnlock the power of next-gen Call of Duty experiences with higher framerate, hardware-based ray-tracing, shorter load times and more.… Expand"}, {"name": "Rayman Raving Rabbids", "details_link": "https://www.metacritic.com/game/wii/rayman-raving-rabbids", "publisher": "Ubisoft", "release_date": "Nov 14 2006", "developers": ["Ubisoft Montpellier"], "platforms": ["PC", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Party", "Platformer", "Party / Minigame", "3D"], "meta_score": 76, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/91f49e286be47a6d4631fe136461ccf8-98.jpg", "descriptions": "Rayman Raving Rabbids marks the return of the iconic video-game hero, Rayman, in his funniest and zaniest adventure ever. When the world of Rayman is threatened by a devastating invasion of crazed, out-of-control bunnies Rayman must rise up against his furry foes to foil their wicked plans.Rayman Raving Rabbids marks the return of the iconic video-game hero, Rayman, in his funniest and zaniest adventure ever. When the world of Rayman is threatened by a devastating invasion of crazed, out-of-control bunnies Rayman must rise up against his furry foes to foil their wicked plans. Utilizing an array of amazing new abilities, and with the help of magical creatures, Rayman must break out all the moves to save his world from these delirious bunnies and their hare-raising antics. Combat the Ultra-Crazed Evil Rabbits – Take control of Rayman and his knack for attack to help save his world from the raving rabbids. They are mischievous, insane and completely out of control. There are several types of rabbids each with its own mischievous characteristics. Tame and control various creatures such as sharks, eagles, rhinos, spiders and angelfish. Rayman can master each animal's unique capabilities to help in his battle against the devious rabbits. Customize and disguise Rayman. Go punk, pop, rock or hip hop to infiltrate the bunnies and foil their devious plans. Explore amazing free-roaming environments and beautiful epic landscapes that mix real and fantastical styles to create a visually stunning experience. [Ubisoft]… Expand"}, {"name": "Carrion", "details_link": "https://www.metacritic.com/game/switch/carrion", "publisher": "Devolver Digital", "release_date": "Jul 23 2020", "developers": ["Phobia Game Studio"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D", "", "Metroidvania"], "meta_score": 76, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/18e34eece1b79b8032abc52d1d24c6e4-98.jpg", "descriptions": "In Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities onIn Carrion you’ll assume the role of an amorphous creature of unknown origin. Players will stalk and consume those that have imprisoned it to spread fear and panic throughout the facility. It will grow and evolve as you tear down the facility and acquire additional devastating abilities on the path to retribution that include a web-like ranged attack, the ability to bend light to become temporarily invisible, and even possess humans for maximum terror.… Expand"}, {"name": "Gatling Gears", "details_link": "https://www.metacritic.com/game/playstation-3/gatling-gears", "publisher": "Electronic Arts", "release_date": "Jun 28 2011", "developers": ["Vanguard Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Strategy", "Shooter", "General", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 76, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/0/5348b02165752463ea53a353d306b812-98.jpg", "descriptions": "From the team that created the award-winning Greed Corp, comes Gatling Gears. Set within the same Mistbound universe featuring signature elements like collapsing land, walker units and warring factions, but now with twin-stick shooter controls and a new hero, Max Brawley. In this eclecticFrom the team that created the award-winning Greed Corp, comes Gatling Gears. Set within the same Mistbound universe featuring signature elements like collapsing land, walker units and warring factions, but now with twin-stick shooter controls and a new hero, Max Brawley. In this eclectic steampunk setting, players fill the air with lead as they try to defeat a monopolistic corporation that is depleting the world of its natural resources.… Expand"}, {"name": "Guwange", "details_link": "https://www.metacritic.com/game/xbox-360/guwange", "publisher": "Cave", "release_date": "Nov 10 2010", "developers": ["Cave"], "platforms": "Xbox 360", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 76, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/1/105c3bc5396cfd911e2ea856d48593b8-98.jpg", "descriptions": "The shooter classic \"Guwange\" is reborn for a new generation!"}, {"name": "Singularity", "details_link": "https://www.metacritic.com/game/pc/singularity", "publisher": "Activision", "release_date": "Jun 29 2010", "developers": ["Raven Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 76, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/4dc56274dc5255acb75991b32b8becf7-98.jpg", "descriptions": "On a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battleOn a clandestine mission deep into Russian territory, an American black ops team crash lands on an island research base that was mysteriously abandoned in the 1950’s. Cut off from the outside and under attack by an army of nightmarish creatures, Captain Nathaniel Renko is forced to battle his way through the hostile territory armed with the TMD (Time Manipulation Device) – a time altering weapon created over 50 years ago. Who created the TMD and why is just one of the many Cold War secrets Renko must uncover as he is thrown back and forth across time, making choices that will alter the course of world history. [Raven Software]… Expand"}, {"name": "MotoGP 20", "details_link": "https://www.metacritic.com/game/playstation-4/motogp-20", "publisher": "Deep Silver", "release_date": "Apr 23 2020", "developers": ["Milestone S.r.l", "Dorna Sports S.L."], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "Simulation", "Arcade", "Automobile"], "meta_score": 76, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/3edc992ae75f8c01500a6c5f43e7177d-98.jpg", "descriptions": "Take control of your own career, switch from real teams to new teams created with sponsors from the world of MotoGP™, decide the development of the bike and manage your technical unit to win. Improved physics, with even more realistic and complex braking management. The tire has been dividedTake control of your own career, switch from real teams to new teams created with sponsors from the world of MotoGP™, decide the development of the bike and manage your technical unit to win. Improved physics, with even more realistic and complex braking management. The tire has been divided into independent sectors for wear and temperature, and the fuel consumption can be managed with driving style and power maps. If you were looking for a challenge, this is definitely the one for you. Being a successful driver is much more than just keeping the throttle wide open. You also need to win with style! Unleash your creativity with 6 different graphic editors, including the new Suit and Livery editor for your bike. [Milestone]… Expand"}]