[{"name": "187 Ride or Die", "details_link": "https://www.metacritic.com/game/xbox/187-ride-or-die", "publisher": "Ubisoft", "release_date": "Aug 24 2005", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "2  Online", "genres": ["Driving", "Car Combat"], "meta_score": 51, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/7/63a0fb26fcd34e345d237915f8c0223d-98.jpg", "descriptions": "Fully strapped with firepower, you'll make a mad dash for power by racing against ruthless street crews, murdering your opponents, and building an empire of cash money. In Notorious: Die to Drive, you can choose from more than 30 different vehicles, ranging from vintage roadsters to modernFully strapped with firepower, you'll make a mad dash for power by racing against ruthless street crews, murdering your opponents, and building an empire of cash money. In Notorious: Die to Drive, you can choose from more than 30 different vehicles, ranging from vintage roadsters to modern models. Then equip yourself with more than 20 weapons, including pistols, machine guns, shotguns, and Molotov Cocktails. High-priced women, jewelry, and houses are just some of the rewards for the few who can survive this dangerous game.… Expand"}, {"name": "Backyard Wrestling: Don't Try This at Home", "details_link": "https://www.metacritic.com/game/playstation-2/backyard-wrestling-dont-try-this-at-home", "publisher": "Eidos Interactive", "release_date": "Oct  7 2003", "developers": ["Paradox Development"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 51, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/239a65ef85565f83db712131df81cb2b-98.jpg", "descriptions": "Backyard Wrestling allows you to step out of the the staleness of the wrestling genre, and into a groundbreaking new world of open ended gameplay. Punish your opponent in highly interactive sprawling environments implementing instruments of pain like thumbtacks, barbed wire, light bulbs,Backyard Wrestling allows you to step out of the the staleness of the wrestling genre, and into a groundbreaking new world of open ended gameplay. Punish your opponent in highly interactive sprawling environments implementing instruments of pain like thumbtacks, barbed wire, light bulbs, stop signs, baseball bats, tables, fire? as well as the environment itself. Prepare yourself to endure inhuman amounts of pain, and take incredible risks, as you leap from breathtaking heights to beat your opponent, and be crowned \"The King Of Hardcore\". [Eidos Interactive]… Expand"}, {"name": "And 1 Streetball", "details_link": "https://www.metacritic.com/game/playstation-2/and-1-streetball", "publisher": "Ubisoft", "release_date": "Jun  6 2006", "developers": ["Black Ops Entertainment"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Arcade"], "meta_score": 51, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/d0b36a20e200a85d68691254d36b5580-98.jpg", "descriptions": "AND 1 Streetball features the entire roster of sensational AND 1 Mix Tape Tour players such as AO, The Professor, Spyda and Pharmacist -- each with their signature moves and look. AND 1 Streetball also gives you the power to create your own player and your own moves -- so YOU can become theAND 1 Streetball features the entire roster of sensational AND 1 Mix Tape Tour players such as AO, The Professor, Spyda and Pharmacist -- each with their signature moves and look. AND 1 Streetball also gives you the power to create your own player and your own moves -- so YOU can become the next streetball phenomenon. Step into the shoes of the AND 1 players to execute mesmerizing moves like Hot Sauce's killer crossover, Helicopter's rim-bending dunks, and The Professor's no-look passes. Build your own character and create your own signature moves using AND 1's revolutionary Create-a-Move editor, loaded with custom showboating, scoring, and celebration moves. School the competition with I-Ball controls, an intuitive control system that gives you fluid and precise command over every offensive and defensive move. Not only will you do it, you will also feel it. Story mode allows you to experience the trials and exhilarations of getting signed to the AND 1 Mix Tape Team, as seen on ESPN. Dominate the open run, survive the hazing, and bring it home in the final game, as seen on ESPN. Play the game you want to play. Scale your teams anywhere between one-on-one to five-on-five. Run a full-court game, or do a half-court battle. [Ubisoft]… Expand"}, {"name": "Top Spin 2", "details_link": "https://www.metacritic.com/game/ds/top-spin-2", "publisher": "2K Sports", "release_date": "Mar 29 2006", "developers": ["Indie Built"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/4c8c72a92c03e34c68efdbacf0480111-98.jpg", "descriptions": "Design your own digital identity - ceate realistic player models and customize them with the highest level of detail. Create your own style of tennis play with a range of shots - Slices, drops, chops, lobs and drives. Train with a coach to master shots and playing surfaces - then work yourDesign your own digital identity - ceate realistic player models and customize them with the highest level of detail. Create your own style of tennis play with a range of shots - Slices, drops, chops, lobs and drives. Train with a coach to master shots and playing surfaces - then work your way up the rankings. Play singles or doubles matches with 16 top pros, from Anna Kournikova to Lleyton Hewitt. Go online for live matches against other tennis fans.… Expand"}, {"name": "Beat Down", "details_link": "https://www.metacritic.com/game/xbox/beat-down", "publisher": "Capcom", "release_date": "Aug 23 2005", "developers": ["Cavia Inc."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/c597813b7af12f6fc79b8af873596cf2-98.jpg", "descriptions": "Framed for murder by Las Sombras' powerful Zanetti family, five underworld enforcers must confront rival gangs, a corrupt police force, and the Zanetti family themselves in order to exact their brutal revenge. Now play as one of the five outcasts, each with their own unique abilities. FightFramed for murder by Las Sombras' powerful Zanetti family, five underworld enforcers must confront rival gangs, a corrupt police force, and the Zanetti family themselves in order to exact their brutal revenge. Now play as one of the five outcasts, each with their own unique abilities. Fight with intensity to level up and gain new skills.… Expand"}, {"name": "Immortal: Unchained", "details_link": "https://www.metacritic.com/game/xbox-one/immortal-unchained", "publisher": "Sold Out", "release_date": "Sep  7 2018", "developers": ["Toadman Interactive"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 51, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/e27c8899662e8fe05dcbc7587252ab94-98.jpg", "descriptions": "You are a living weapon. Unwillingly unchained by the Warden, the player's skills are put to the test, given only the instruction that they must stop the end of the world. With a story the player must piece together themselves, the central character sets off with no memory of their past.You are a living weapon. Unwillingly unchained by the Warden, the player's skills are put to the test, given only the instruction that they must stop the end of the world. With a story the player must piece together themselves, the central character sets off with no memory of their past.Other characters in the game may shed light on the situation, but the reality is not always clear, as characters are always operating on their own agendas. Use your diverse arsenal of ranged and melee weapons to clear your path as you explore dark sci-fi interconnected worlds in your quest for truth and salvation.… Expand"}, {"name": "Where the Wild Things Are", "details_link": "https://www.metacritic.com/game/xbox-360/where-the-wild-things-are", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 13 2009", "developers": ["Griptonite Games"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 51, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/8444faa2fe6a108b1d40b99d96e9f3ea-98.jpg", "descriptions": "Playing as the mischievous Max, players explore the Wild Things' mysterious island, journeying over dangerous terrain, battling fierce creatures and interacting with the fearsome but loveable Wild Things. Through your adventure, you'll befriend and team up with the Wild Things - each withPlaying as the mischievous Max, players explore the Wild Things' mysterious island, journeying over dangerous terrain, battling fierce creatures and interacting with the fearsome but loveable Wild Things. Through your adventure, you'll befriend and team up with the Wild Things - each with their own unique skills or special talents - learning valuable new abilities, working together to solve action puzzles, overcoming obstacles and have a rumpus of a good time! Following a unique storyline inspired by Where the Wild Things Are, the game take players on a journey beyond the movie to explore the mysterious island of the Wild Things on an adventurey that you'll never forget. Run, jump, climb and swing your way across the island's dangerous terrain while battling fierce creatures with your trusty scepter. Collect a variety of special items and \"power-ups\" to gain new abilities and overcome obstacles. On your journey you'll team up with the fearsome but loveable Wild Things discovering their unique personalities and abilities. At any time return to the Wild Things Village to play through a variety of mini games, start dirt-clog fights and have a rumpus good time. Journey across the hostile of the Wild Things filled with fierce creatures and hazardous obstacles around every corner. Go beyond the movie to explore a unique storyline inspired by the book and movie. [Warner Bros.]… Expand"}, {"name": "G.I. Joe: Operation Blackout", "details_link": "https://www.metacritic.com/game/playstation-4/gi-joe-operation-blackout", "publisher": "GameMill Entertainment", "release_date": "Oct 13 2020", "developers": ["GameMill Entertainment", "IguanaBee"], "platforms": ["PC", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 51, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/8/bbcedba85a8cc2e407ed995491b7c489-98.jpg", "descriptions": "YO JOE! G.I. JOE AND COBRA ARE BACK!\rG.I. Joe: Operation Blackout is a team-based third-person shooter where you play as your favorite characters from Team G.I. Joe and Team Cobra. Experience the action from both sides as you help G.I. Joe restore order and lead Cobra to world domination.YO JOE! G.I. JOE AND COBRA ARE BACK!\rG.I. Joe: Operation Blackout is a team-based third-person shooter where you play as your favorite characters from Team G.I. Joe and Team Cobra. Experience the action from both sides as you help G.I. Joe restore order and lead Cobra to world domination.\r G.I. JOE VS COBRA\rPlay with 12 of your favorite characters from both sides across 17 epic campaign story missions.\r CO-OP & PVP MULTIPLAYER\rPlay the campaign with a friend in local co-op, or compete in 4-player PvP local matches in 4 Multiplayer Modes: Capture the Flag, Assault, King of The Hill, and Deathmatch Arena.\r COMBAT TOOLS\r18 awesome weapons, 36 weapon skins, 12 alternate character skins and a series of uniquely devastating ultimate abilities.\r A LEGENDARY FRANCHISE\rPlay with 12 of your favorite characters from both sides across 17 epic campaign story missions.… Expand"}, {"name": "ACORN Tactics", "details_link": "https://www.metacritic.com/game/switch/acorn-tactics", "publisher": "TACS Games", "release_date": "Dec  7 2017", "developers": ["TACS Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/6792ade9876ff50a265d6498ba666b07-98.jpg", "descriptions": null}, {"name": "History Legends of War: Patton", "details_link": "https://www.metacritic.com/game/xbox-360/history-legends-of-war-patton", "publisher": "Maximum Games", "release_date": "Nov  6 2012", "developers": ["Enigma Software Productions"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 51, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/0e8df355decd4f2d66994e884b6cef3a-98.jpg", "descriptions": "In this turn-based strategy game you follow the paths of General George Patton (of San Marino, CA) during WWII, leading your troops to battle while traversing Western Europe’s devastated land. Gain prestige points and use them to enhance your army, acquiring advanced weapons and gear. PlayIn this turn-based strategy game you follow the paths of General George Patton (of San Marino, CA) during WWII, leading your troops to battle while traversing Western Europe’s devastated land. Gain prestige points and use them to enhance your army, acquiring advanced weapons and gear. Play through 4 different types of missions: Attack, Defense, Infiltration, and Sabotage. From the French beaches to Belgium, you have to prove your worth as a member of Patton’s Third Army, and fight for victory.… Expand"}, {"name": "Breed", "details_link": "https://www.metacritic.com/game/pc/breed", "publisher": "cdv Software", "release_date": "Apr  2 2004", "developers": ["Brat Designs"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 51, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/0562df8f8684e55ae6459c74792949a4-98.jpg", "descriptions": "\"Aliens - get lost!\"  This is your one and only thought upon your return to Earth in the year 2610. Commanding humankind's lone surviving battleship, you are forced to realize that the devastating war the Breed waged in the distant Besalius system was nothing other than a diversion! While\"Aliens - get lost!\"  This is your one and only thought upon your return to Earth in the year 2610. Commanding humankind's lone surviving battleship, you are forced to realize that the devastating war the Breed waged in the distant Besalius system was nothing other than a diversion! While the battle was raging far away, the aggressive aliens took over Earth. Now is the time to come to the aid of your home planet! Some humans have surely survived the Breed invasion: search for them and use your wits and cunning to organize resistance. Discover your oppressors' weaknesses and strike at them without mercy. Your suicide squad has only one goal: to annihilate the Breed!  [CDV Software]… Expand"}, {"name": "Delta Force: Task Force Dagger", "details_link": "https://www.metacritic.com/game/pc/delta-force-task-force-dagger", "publisher": "NovaLogic", "release_date": "Jun 27 2002", "developers": ["Zombie Studios"], "platforms": "PC", "num_players": "1-16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 51, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/0753b771e07c8e3f36a587deb9726cfb-98.jpg", "descriptions": "Take over the Kandahar Airport, raid rebel headquarters in Mazar-e-Sharif, ambush a convoy near the Pakistani border and demolish bunkers in the foothills of Kabul. Play as one of 10 different Special Forces units with a huge arsenal of machine guns, assault rifles, sniper rifles, pistolsTake over the Kandahar Airport, raid rebel headquarters in Mazar-e-Sharif, ambush a convoy near the Pakistani border and demolish bunkers in the foothills of Kabul. Play as one of 10 different Special Forces units with a huge arsenal of machine guns, assault rifles, sniper rifles, pistols and rocket launchers new to the Delta Force series. [NovaLogic]… Expand"}, {"name": "Twisted Metal Small Brawl", "details_link": "https://www.metacritic.com/game/playstation/twisted-metal-small-brawl", "publisher": "SCEA", "release_date": "Nov 26 2001", "developers": ["Incognito Inc."], "platforms": "PlayStation", "num_players": "1-2 ", "genres": ["Driving", "Car Combat"], "meta_score": 51, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/0cd76b894945de25a42fb86b9fe68d1d-98.jpg", "descriptions": "It seems almost as if this game is SCEA's form of an apology to the fans, while at the same time an attempt to win over some of the younger crowd."}, {"name": "Stormrise", "details_link": "https://www.metacritic.com/game/playstation-3/stormrise", "publisher": "Sega", "release_date": "Mar 24 2009", "developers": ["Creative Assembly"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 51, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/1/9d0888067a90ce56c280cbaad3410525-98.jpg", "descriptions": "Stormrise offers fans of the classic RTS genre an immersive and dramatic twist while challenging the conscience of the gamer. Experience the heat of the battlefield by leading your troops from the front line, instead of the traditional way of controlling the units from a detached view point.Stormrise offers fans of the classic RTS genre an immersive and dramatic twist while challenging the conscience of the gamer. Experience the heat of the battlefield by leading your troops from the front line, instead of the traditional way of controlling the units from a detached view point. Stormrise also allows units to be commanded in the air, across rooftops, on the earth's surface and even underground, this unique idea of \"verticality\" introduces multiple layers of gameplay that must be mastered for strategic advantage. The experience is heightened by a simple yet effective control system tailored specifically for consoles, which allows easy unit selection, rapid navigation and precise deployment. Set on a bleak and barren earth, devastated by a catastrophic event centuries ago, Stormrise sees the Echelon and the Sai battling to survive in a hostile and uninhabitable wasteland. Remnants of a superior technological people the Echelon survived the event through self-educed hibernation, while the Sai, a more tribal faction, still exist having learned to adapt to their surroundings and the new environment. Having evolved in vastly different ways, the differences between the two factions have spurred much animosity and hatred between the two races and the future of the planet is now hanging by a thread. [Sega]… Expand"}, {"name": "DreamWorks How to Train Your Dragon", "details_link": "https://www.metacritic.com/game/playstation-3/dreamworks-how-to-train-your-dragon", "publisher": "Activision", "release_date": "Mar 23 2010", "developers": ["Etranges Libellules"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 51, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/5/d92ef069d9c614ee628b7583b716c6a3-98.jpg", "descriptions": "How to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expandedHow to Train Your Dragon video game launches gamers into a third-person action-adventure as a Viking hero where they must embark upon an epic quest to become the ultimate dragon trainer. Gamers can play as characters “Hiccup” or Astrid” on the vast Island of Berk, which features expanded locales from the film including Vikings’ Village, Wild Zone, Training Zone and Fight Arena. In this truly larger-than-life adventure, players will train dragons, explore environments and battle in prestigious dragon tournaments as they battle for Viking victory. Plus, gamers can become the Dragon hero of their living room as they square-off with friends and family in endless head-to-head multi-player combat. [Activision]… Expand"}, {"name": "Rengoku II: The Stairway to H.E.A.V.E.N.", "details_link": "https://www.metacritic.com/game/psp/rengoku-ii-the-stairway-to-heaven", "publisher": "Konami", "release_date": "Sep 12 2006", "developers": ["Hudson Soft", "Neverland"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 51, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/1d616294ee4510b7dd2ff1850ecc30b5-98.jpg", "descriptions": "Rengoku 2 lets players assume the role of A.D.A.M., a battle android trapped in a mysterious tower filled with fearsome enemies. Players must now enter a new tower and purge it of the mechanical scourge hosted inside. Players can customize their battle android with more than 300 rare andRengoku 2 lets players assume the role of A.D.A.M., a battle android trapped in a mysterious tower filled with fearsome enemies. Players must now enter a new tower and purge it of the mechanical scourge hosted inside. Players can customize their battle android with more than 300 rare and unique items. [Konami]… Expand"}, {"name": "CSI: Crime Scene Investigation: Deadly Intent", "details_link": "https://www.metacritic.com/game/xbox-360/csi-crime-scene-investigation-deadly-intent", "publisher": "Ubisoft", "release_date": "Oct 27 2009", "developers": ["Telltale Games"], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 51, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/7/64d425ed3aea06999542d28e3d18055b-98.jpg", "descriptions": "In Sin City there are no secrets, only hidden answers. Join the new Vegas CSI team and let the evidence guide you to the truth. Explore five brand-new, shocking cases written with CSI writers and bring the guilty to justice. Explore crime scenes, dissect a victim’s body, or follow the twistsIn Sin City there are no secrets, only hidden answers. Join the new Vegas CSI team and let the evidence guide you to the truth. Explore five brand-new, shocking cases written with CSI writers and bring the guilty to justice. Explore crime scenes, dissect a victim’s body, or follow the twists and turns of the story. CSI: Deadly Intent is an all-new immersive experience thanks to intriguing cases written with CSI show writers, a new rendering engine allowing for more realistic graphics, improved lighting effects, and enhanced character acting and lip sync with the voices of the actors from the show. Partner with the cast of the new CSI Season 9 with characters such as Ray Langston (Laurence Fishburne) and Riley Adams (Lauren Lee Smith). Work together on the crime scene or help each other during tough suspect interrogations. Play one of the most skilled forensic experts ever to join the Vegas CSI team. Help other detectives in their investigations and gain their respect through your actions and teamwork. PERFORM THE TASKS OF A CSI DETECTIVE: Collect evidence at the crime scene: Dust for fingerprints, Search for items that might be related to the case; Unveil hidden evidence through observation; Interview a variety of witnesses and suspects: Utilize an improved interrogation system for more realistic character interactions; Ask the right questions and use evidence collected at the crime scene to get the truth. Analyze the evidence with the latest technology: DNA analysis, Microscopic analysis. [Ubisoft]… Expand"}, {"name": "PDC World Championship Darts 2008", "details_link": "https://www.metacritic.com/game/wii/pdc-world-championship-darts-2008", "publisher": "O-Games", "release_date": "Jun 16 2009", "developers": ["Oxygen Interactive"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1-8 ", "genres": ["Sports", "Alternative", "Individual", "Other", "Other"], "meta_score": 51, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/48f1e74e5bab524fd903d535aedebda2-98.jpg", "descriptions": "(Currently available in the UK/EU only)  Go head-to-head with the greatest PDC Champions and be part of the year’s most fierce console Championship with PDC World Championship Darts 2008. Starring even more Champions, the full line up of electrifying tournaments, exceptional graphic(Currently available in the UK/EU only)  Go head-to-head with the greatest PDC Champions and be part of the year’s most fierce console Championship with PDC World Championship Darts 2008. Starring even more Champions, the full line up of electrifying tournaments, exceptional graphic enhancements, even more play modes and additional formats - PDC World Championship Darts is back for 2008. The first ten to be announced include Phil ‘The Power’ Taylor, the greatest player ever to throw a dart, winning his 13th World Championship title in 2006. Raymond ‘The Man’ van Barneveld, the current World Champion who defeated Taylor in the greatest ever final in January 2007. Also starring in the game are Colin ‘Jaws’ Lloyd, the number one player in the world in 2004 and 2005, winning two major titles along the way, Peter ‘One Dart’ Manley, double World Champion John ‘Darth Maple’ Part from Canada and the ever-popular Wayne “Hawaii 501” Mardle. [Oxygen Games]… Expand"}, {"name": "River King: A Wonderful Journey", "details_link": "https://www.metacritic.com/game/playstation-2/river-king-a-wonderful-journey", "publisher": "Natsume", "release_date": "Mar 28 2006", "developers": ["Marvelous"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/637bb3bf301afeb4f35c69eb83807a40-98.jpg", "descriptions": "Hook, line and sinker, you're part of a long line of fishing folk. From father to son and mother to daughter, knowing where and what to fish was always part of your family mangrove tree. Only one thing is missing from the long list of accomplishments, a fish that shook hooks for generations:Hook, line and sinker, you're part of a long line of fishing folk. From father to son and mother to daughter, knowing where and what to fish was always part of your family mangrove tree. Only one thing is missing from the long list of accomplishments, a fish that shook hooks for generations: The River King. Perhaps today, perhaps this cast, you'll feel the strum of a tight line as the legendary giant pulls you into angling immortality. Play as one of four family members. Assist villagers and other shoreline folk. Win it all in fishing and cooking contests. Take on crafty critters in tricky trivia challenges. [Natsume]… Expand"}, {"name": "Spy Hunter: Nowhere to Run", "details_link": "https://www.metacritic.com/game/xbox/spy-hunter-nowhere-to-run", "publisher": "Midway", "release_date": "Sep  5 2006", "developers": ["Terminal Reality"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 51, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "SpyHunter: Nowhere to Run takes the Spy Hunter franchise where it's never gone before: on foot. Featuring action superstar Dwayne 'The Rock' Johnson as government super-spy extraordinaire Alex Decker, players for the first time ever can step out of the Interceptor and straight intoSpyHunter: Nowhere to Run takes the Spy Hunter franchise where it's never gone before: on foot. Featuring action superstar Dwayne 'The Rock' Johnson as government super-spy extraordinaire Alex Decker, players for the first time ever can step out of the Interceptor and straight into third-person action, utilizing The Rock's physical prowess by taking down enemies with intense melee combat moves. In Nowhere to Run, the evil NOSTRA corporation returns, this time with a plan to steal the latest government technology including the world's most sophisticated spy vehicle, the Interceptor, and it's up to Alex to stop them.… Expand"}, {"name": "Disney*Pixar WALL-E", "details_link": "https://www.metacritic.com/game/playstation-3/disneypixar-wall-e", "publisher": "THQ", "release_date": "Jun 24 2008", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 51, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/4/ed6a66f9efa8409779805ddc9a8ba293-98.jpg", "descriptions": "What if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets aWhat if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets a sleek search robot named EVE. EVE comes to realize that WALL-E has inadvertently stumbled upon the key to the planet’s future, and races back to space to report her findings to the humans (who have been eagerly awaiting word that it is safe to return home). Meanwhile, WALL-E chases EVE across the galaxy and sets into motion one of the most exciting and imaginative comedy adventures ever brought to the big screen. Joining WALL-E on his fantastic journey across a universe of never-before-imagined visions of the future, is a hilarious cast of characters including a pet cockroach, and a heroic team of malfunctioning misfit robots. Players of the game take control of WALL-E and EVE through a fast-paced adventure based on the Disney/Pixar film. The game allows fans to relive some of the movie’s most thrilling moments as they explore 10 worlds filled with non-stop action and adventure, along with head-to-head multiplayer challenges. Players will recognize the storyline, characters and key locations from the WALL-E film as they carry out intense missions, dodge dangerous enemies and navigate their way through a futuristic world. In addition, the game contains new storylines and environments that movie-goers will not see in theaters. [THQ]… Expand"}, {"name": "Cubic Ninja", "details_link": "https://www.metacritic.com/game/3ds/cubic-ninja", "publisher": "Ubisoft", "release_date": "Jun 14 2011", "developers": ["AQ Interactive"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Puzzle", "Action"], "meta_score": 51, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/5/4f12e575144fccf98f8a3453e489f6e2-98.jpg", "descriptions": "Introducing Cubic Ninja, the Nintendo 3DS title that lets you play without ever touching a button. Simply tilt and turn your Nintendo 3DS to solve challenging puzzles, outwit devious enemies, and escape intricate traps.\r Cubic Ninja places you in the role of CC, a brave little ninja with aIntroducing Cubic Ninja, the Nintendo 3DS title that lets you play without ever touching a button. Simply tilt and turn your Nintendo 3DS to solve challenging puzzles, outwit devious enemies, and escape intricate traps.\r Cubic Ninja places you in the role of CC, a brave little ninja with a distinctly cubic shape. The princess of your beloved kingdom  plus a few of your ninja friends -- has been abducted. And its up to you to save them. To do so, you must tilt and turn your way through over 100 eye-opening levels, defeating adversaries such as Woofbot, Scorchbot, and more. From gravity distortions to raging infernos to elemental forces of wind and water, your enemies will do whatever it takes to stop you.\r But you wont be stopped. If you have to tumble till youre dizzy, or survive raging waters just to rescue the princess, then you will. Because youre Cubic Ninja. And thats how you roll.… Expand"}, {"name": "Table Manners", "details_link": "https://www.metacritic.com/game/pc/table-manners", "publisher": "Curve Digital", "release_date": "Feb 14 2020", "developers": ["Echo Chamber Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 51, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/ec2ca56794377ffbb6e08d6bd95ed4c8-98.jpg", "descriptions": "Swipe right for the brand new NON-VR crazy physics-based dating simulator, Table Manners! Tonight's the night, you've secured a date and you're off to the most glamorous restaurant you know, there's only one problem - you're a disembodied hand with a knack for catastrophe!"}, {"name": "Chivalry: Medieval Warfare", "details_link": "https://www.metacritic.com/game/xbox-one/chivalry-medieval-warfare", "publisher": "Activision", "release_date": "Dec  2 2015", "developers": ["Torn Banner Studios", "Hardsuit Labs"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 24 ", "genres": ["Action", "General", "Beat-'Em-Up", "3D"], "meta_score": 51, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/8/3f7a71ca58d32236638eef618e22662d-98.jpg", "descriptions": "CHIVALRY: Medieval Warfare is a first-person medieval combat game that seeks to deliver the intensity of epic hollywood medieval block busters to the hands of a gamer. CHIVALRY hurls the player into a fictional yet realistic medieval world where the Agathian Knights are battling against theCHIVALRY: Medieval Warfare is a first-person medieval combat game that seeks to deliver the intensity of epic hollywood medieval block busters to the hands of a gamer. CHIVALRY hurls the player into a fictional yet realistic medieval world where the Agathian Knights are battling against the newly formed Mason Order for control of the lands of Agatha.… Expand"}, {"name": "Sacred 3", "details_link": "https://www.metacritic.com/game/xbox-360/sacred-3", "publisher": "Deep Silver", "release_date": "Aug  5 2014", "developers": ["Deep Silver", "Keen Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 51, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/3/0f05ec46dbba5bed488fb52404511bad-98.jpg", "descriptions": "Sacred 3 is an action role-playing game experience with accessible yet sophisticated gameplay."}, {"name": "Marvel Super Hero Squad", "details_link": "https://www.metacritic.com/game/psp/marvel-super-hero-squad", "publisher": "THQ", "release_date": "Oct 20 2009", "developers": ["THQ"], "platforms": ["PlayStation 2", "PSP"], "genres": ["Action", "Adventure", "General", "General", "Beat-'Em-Up", "3D"], "meta_score": 51, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/ab5b972d5db5d807e6d32acb8493a57b-98.jpg", "descriptions": "Set in the ever popular Marvel Universe, the Super Hero Squad is on a dire mission against Dr. Doom's Lethal Legion of villains to recover the hidden Infinity Fractals; fragments of the all-powerful Infinity Sword. Each Infinity Fractal holds incredible power and can have significant effectsSet in the ever popular Marvel Universe, the Super Hero Squad is on a dire mission against Dr. Doom's Lethal Legion of villains to recover the hidden Infinity Fractals; fragments of the all-powerful Infinity Sword. Each Infinity Fractal holds incredible power and can have significant effects on its possessor, giving each character special abilities that could alter the game’s rules and playing field. With more than 20 Marvel characters to mix and match, players can choose to take on the role of their favorite Super Heroes and Super Villains, such as Captain America, Dr. Doom, Falcon, Hulk, Iron Man, Juggernaut, Ms. Marvel, Silver Surfer, Thing, Thor and Wolverine, to name a few. Using character-specific super powers and customized combo attacks, players will blast, punch, and bash in fast-moving combat with their nemesis. Players can either jump into a battle arena against up to three opponents in Battle Mode, or choose to relive six campaigns as depicted from the animated series in Adventure Mode. Marvel Super Hero Squad is an immersive, single and multiplayer game filled with dramatic, interactive environments where players are given extraordinary powers to fight for good or evil, depending on which Super Hero Squad character they chose to play as. [THQ]… Expand"}, {"name": "Darkest of Days", "details_link": "https://www.metacritic.com/game/pc/darkest-of-days", "publisher": "Phantom EFX, Inc.", "release_date": "Sep  7 2009", "developers": ["8Monkey Labs"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 51, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/2/6f4ed3e3e46b048b9ea913df28aa7d08-98.jpg", "descriptions": "In Darkest of Days, you'll get to experience some of the most varied gameplay ever released in one title. Thigns will never get stale as you travel to distant times and fight alongside people from that time period. Fighting in Antietam (the bloodiest day of the American Civil War) feels muchIn Darkest of Days, you'll get to experience some of the most varied gameplay ever released in one title. Thigns will never get stale as you travel to distant times and fight alongside people from that time period. Fighting in Antietam (the bloodiest day of the American Civil War) feels much different than fighting on the side of the Russians at Tannenberg (where the Russians withstood 140,000 casualties in WWI). [Phantom EFX]… Expand"}, {"name": "G.I. Joe: The Rise of Cobra", "details_link": "https://www.metacritic.com/game/wii/gi-joe-the-rise-of-cobra", "publisher": "Electronic Arts", "release_date": "Aug  4 2009", "developers": ["Double Helix Games"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-2 ", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/69f490dfc5cdc5e45ef7e8fbd46a30e4-98.jpg", "descriptions": "As COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The RiseAs COBRA unleashes its deadliest plot yet, the G.I. JOE Team is counting on you and your hand-picked team of heroes to lead the counterattack. Every mission is critical and so is every G.I. JOE character. Picking up where the Paramount Pictures live action film leaves off, G.I. JOE The Rise of Cobra is an accessible third person action-arcade shooter that allows players to recreate and relive the greatest moments from the film, cartoon series and action toy line. Exclusive all-new storyline that picks up where the film ends and is inspired by 45 years of rich G.I.JOE history. Two player co-op lets players choose an elite team and call in support from other G.I. JOE characters. Choose from 16 playable characters (four of which are unlockable COBRA characters) - each with a unique set of abilities and weapons. G.I. JOE characters include Snake Eyes, Duke, Heavy Duty, Ripcord, Scarlett, Shipwreck and Gung Ho. Storm Shadow has been revealed as an unlockable playable COBRA character. Characters are classified into one of three units: Commandos who do well at close range, Heavys who possess extraordinary shooting skills but do it best from a distance and Combat Soldiers who are a balance between the two. Gear up with the latest in high-tech gadgets like the film-inspired Accelerator Suit which makes you invincible and gives you short bursts of additional fire power. Drivable G.I. JOE and COBRA vehicles designed for two-player co-op. Three difficulty levels - appealing to players of all ages and skill levels (Casual, Advanced and Hardcore). 20 levels - each with 3-5 areas to explore - across four environments. 75 file cards and various intelligence items hidden throughout the game which can be used to unlock additional playable characters, special missions, 4 PSAs and other bonus content. [Electronic Arts]… Expand"}, {"name": "The Hardy Boys: The Hidden Theft", "details_link": "https://www.metacritic.com/game/pc/the-hardy-boys-the-hidden-theft", "publisher": "DreamCatcher Interactive", "release_date": "Sep 30 2008", "developers": ["Xpec", "XPEC Entertainment Inc."], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Point-and-Click", "Modern", "Third-Person", "Modern"], "meta_score": 51, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/9/5116b0351a6e4ae3e640424366b4ea43-98.jpg", "descriptions": "The vault at the Spencer Mansion is robbed, and the Bayport Police call on the Hardy Boys to help tie up some loose ends – but they soon find themselves in the middle of a major criminal investigation that takes them on an adventure all over Bayport, and even into New York City. But theThe vault at the Spencer Mansion is robbed, and the Bayport Police call on the Hardy Boys to help tie up some loose ends – but they soon find themselves in the middle of a major criminal investigation that takes them on an adventure all over Bayport, and even into New York City. But the pieces don’t add up, and Frank and Joe find themselves embroiled in a drama of sinister proportions. Is the recent theft linked to something from the past? Can Frank and Joe find and decipher the clues in time to prevent another crime from happening? [Dreamcatcher Interactive]… Expand"}, {"name": "Dead Reefs", "details_link": "https://www.metacritic.com/game/pc/dead-reefs", "publisher": "DreamCatcher Interactive", "release_date": "Jul  3 2007", "developers": ["Streko-Graphics Inc."], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 51, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/f25c37fe955215522ec76851efe9efce-98.jpg", "descriptions": "Dead Reefs is a beautiful mystery adventure which takes place on an island off of England's coast, set in the tumultuous 18th century. In the course of a murder investigation, Dead Reefs will take gamers through a world of intrigue and suspense! Features atmospheric sound, music, and visualDead Reefs is a beautiful mystery adventure which takes place on an island off of England's coast, set in the tumultuous 18th century. In the course of a murder investigation, Dead Reefs will take gamers through a world of intrigue and suspense! Features atmospheric sound, music, and visual set in the 18th century will immerse gamers into story. Over 40 minutes of high-quality cut-scenes Dynamically evolving events keep the player entertained. Player choices affect the advancement and outcome of the game. Unique devices and contraptions are used for traveling within the game. Characters have real-life personalities and unique mannerisms. More than 16 characters with which to interact, 1st-person 3D adventure with a murder mystery storyline. [Adventure Company]… Expand"}, {"name": "The Ant Bully", "details_link": "https://www.metacritic.com/game/gamecube/the-ant-bully", "publisher": "Midway", "release_date": "Jul 24 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 51, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/4/324622548ff72f8556383900a794261e-98.jpg", "descriptions": "Based on Warner Bros. Pictures' upcoming digitally animated family adventure, The Ant Bully allows players to experience and explore the marvels of the insect world."}, {"name": "Legion: The Legend of Excalibur", "details_link": "https://www.metacritic.com/game/playstation-2/legion-the-legend-of-excalibur", "publisher": "Midway", "release_date": "Jun 18 2002", "developers": ["7 Studios"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Historic"], "meta_score": 51, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/31b8d56deda33b1aac9febed69c5ba0c-98.jpg", "descriptions": "Legion: The Legend of Excalibur allows players to live the epic legend of King Arthur and the mystical sword Excalibur in this large-scale fantasy adventure. Players take direct control of King Arthur and the Knights of the Round Table and lead legions of knights in dynamic battlefieldLegion: The Legend of Excalibur allows players to live the epic legend of King Arthur and the mystical sword Excalibur in this large-scale fantasy adventure. Players take direct control of King Arthur and the Knights of the Round Table and lead legions of knights in dynamic battlefield environments against the evil forces of Morgan le Fay. With up to eight characters to control and 13 in-depth missions to accomplish, Legion combines intense individual action with the depth of combat familiar to real-time strategy fans. [Midway]… Expand"}, {"name": "Evil Dead: Hail to the King", "details_link": "https://www.metacritic.com/game/playstation/evil-dead-hail-to-the-king", "publisher": "THQ", "release_date": "Dec  4 2000", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 51, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/621524f53abbe6502daa34001136baab-98.jpg", "descriptions": "Had the battle sequences not been so maddeningly frustrating and frequent, Evil Dead: Hail to the King would at least weigh in as a decent Resident Evil clone, but they work to make the game almost unplayable."}, {"name": "Superman Returns", "details_link": "https://www.metacritic.com/game/xbox-360/superman-returns", "publisher": "EA Games", "release_date": "Nov 20 2006", "developers": ["EA Tiburon"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Beat-'Em-Up", "Beat-'Em-Up", "Open-World", "2D"], "meta_score": 51, "users_score": 1.6, "image": "https://static.metacritic.com/images/products/games/8/4932d4942ff74bde443d2b687567ba89-98.jpg", "descriptions": "True to the fiction in every respect, this is the game based on the Superman universe that fans have been anticipating for decades. From excited citizens to the traffic on the streets, every detail of this vibrant city has a mind of its own. These 80 square miles are brought to life for theTrue to the fiction in every respect, this is the game based on the Superman universe that fans have been anticipating for decades. From excited citizens to the traffic on the streets, every detail of this vibrant city has a mind of its own. These 80 square miles are brought to life for the first time in a videogame. Go anywhere and do anything in Metropolis as Superman. Non-linear gameplay allows you to explore and play the game exactly how you want to at your own pace. Where and how you fly – to the top of skyscrapers, dodging elevated trains – is completely up to you, since gameplay is designed as a true open world experience. With notorious villains like Metallo and colossal challenges only Superman can overcome, you must navigate the Man of Steel to monitor and protect Metropolis from destruction. Three distinct types of gameplay — Flying, Rescue, and Combat — will keep the action constant and the challenges relentless. Play both film-inspired missions as well as original content created exclusively for the videogame. Graphics, sound, and gameplay have been taken to the next level to create a Metropolis like you've never seen it, with three dimensional sound, a complete orchestra soundtrack, and Oscar-wining sound designer. [Electronic Arts]… Expand"}, {"name": "Risen 3: Titan Lords - Enhanced Edition", "details_link": "https://www.metacritic.com/game/playstation-4/risen-3-titan-lords---enhanced-edition", "publisher": "Deep Silver", "release_date": "Aug 21 2015", "developers": ["Piranha Bytes"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Action RPG"], "meta_score": 51, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/1/3d825cb6364b047ff78e2660b64b9683-98.jpg", "descriptions": "The Enhanced Edition offers a graphical quality level comparable with the \"Ultra\" settings on the original PC release of Risen 3: Titan Lords and surpasses the originals visuals in a number of areas."}, {"name": "Code Lyoko: Fall of X.A.N.A.", "details_link": "https://www.metacritic.com/game/ds/code-lyoko-fall-of-xana", "publisher": "The Game Factory", "release_date": "Jun 20 2008", "developers": ["The Game Factory"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Adventure", "General", "General"], "meta_score": 51, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/6e11b15301cade9037468394efdcfb88-98.jpg", "descriptions": "A brand-new tale, based on the fourth season of the show, unfolds as William is being held captive somewhere on Lyoko by the evil virus X.A.N.A. Gamers follow our heroes on a quest to destroy X.A.N.A. Their final challenge is to defeat the mysterious and dangerous Volcano Replika containingA brand-new tale, based on the fourth season of the show, unfolds as William is being held captive somewhere on Lyoko by the evil virus X.A.N.A. Gamers follow our heroes on a quest to destroy X.A.N.A. Their final challenge is to defeat the mysterious and dangerous Volcano Replika containing the very core of X.A.N.A.: a crater containing a number of towers one of which holds William...Control with your stylus fully-customizable characters with upgradeable attacks, Powers, Functions and virtual Items (Firewalls, Viruses, Bugs, programs...) Fight your way through the Digital Sea and battle more enemies using subterranean vehicles ( Navskids). Battle against your friends in 4 different multiplayer modes : normal, handicap, bet & challenge. Play with the four Lyoko warriors and experience a Unique Real Time turn base Interactive battle system. Defeat X.A.N.A's  minions in 100 different Battle Arenas. Enjoy Newly-designed heroes in Super-Deformed style. [The Game Factory]… Expand"}, {"name": "Koi", "details_link": "https://www.metacritic.com/game/playstation-4/koi", "publisher": "Oasis Games", "release_date": "Apr 19 2016", "developers": ["Oasis Games"], "platforms": ["PlayStation Vita", "Switch", "Wii U", "PlayStation 4"], "genres": ["Action Adventure", "Puzzle", "Action", "General"], "meta_score": 51, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/9/15097a2afe7be3f3275d66c820ee2f19-98.jpg", "descriptions": "KOI reflects a tranquil and mesmerizing experience as you embark on an introspective journey through the lens of a lone koi fish separated from its owner and is the last hope for purifying waters polluted by mankind. It’s up to you to turn the tide and guide the koi through eight artfullyKOI reflects a tranquil and mesmerizing experience as you embark on an introspective journey through the lens of a lone koi fish separated from its owner and is the last hope for purifying waters polluted by mankind. It’s up to you to turn the tide and guide the koi through eight artfully rendered stages that will take you into the murky as well as enchanting waters, deep below the surface.… Expand"}, {"name": "Retro Atari Classics", "details_link": "https://www.metacritic.com/game/ds/retro-atari-classics", "publisher": "Atari", "release_date": "Mar 16 2005", "developers": ["Taniko"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 51, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/3/6c661d5e51c42573e3b7a69dadf8a532-98.jpg", "descriptions": "Retro Atari Classics features 10 original Atari games, including Pong, Missile Command, Asteroids, Breakout, Centipede, Tempest, Warlords, Gravitar, Lunar Lander and Sprint. Each title is playable in its original form as well as in the all new \"Tagged\" mode, featuring brand new looks fromRetro Atari Classics features 10 original Atari games, including Pong, Missile Command, Asteroids, Breakout, Centipede, Tempest, Warlords, Gravitar, Lunar Lander and Sprint. Each title is playable in its original form as well as in the all new \"Tagged\" mode, featuring brand new looks from some of today's most popular graffiti artists, including REAS, Delta and Obey Giant. The game takes advantage of all the technical innovations the Nintendo DS brings to gaming including touch screen functionality for tighter game controls, up-to-four player wireless multiplayer, dual screen gameplay for larger game environments and the ability to play head-to-head against another player on the same Nintendo DS in classic arcade fashion. [Atari]… Expand"}, {"name": "Eragon", "details_link": "https://www.metacritic.com/game/pc/eragon", "publisher": "Sierra Entertainment", "release_date": "Nov 14 2006", "developers": ["Stormfront Studios"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "1-2 ", "genres": ["Action", "Role-Playing", "Action Adventure", "Fantasy", "General", "Fantasy", "Beat-'Em-Up", "Japanese-Style", "3D"], "meta_score": 51, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/4/a4eeb33bf00ab0243e57e4c2b9bb6072-98.jpg", "descriptions": "Play as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features aPlay as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features a variety of blistering attacks and defences, including a unique degradable block system. Extensive Dragon Combat – Ride Saphira and blast your enemies with bursts of fire, and call in devastating dragon attacks during melee battles. Eragon features multiplayer co-op with team attack bonuses and dragon fight/flight combo gameplay. Full cooperation from the film production team provides faithful implementation of the movie's look-and-feel. As Eragon discovers the powers hidden within him he learns to unleash magical attacks to decimate his foes. [Vivendi Games]… Expand"}, {"name": "Dead to Rights II", "details_link": "https://www.metacritic.com/game/playstation-2/dead-to-rights-ii", "publisher": "Namco", "release_date": "Apr 12 2005", "developers": ["WideScreen Games"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Modern"], "meta_score": 51, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/e65ad96324396e1c9b8e3e7d7d6033f5-98.jpg", "descriptions": "Jack Slate and his K9 partner Shadow are thrown head first into the crossfire between criminal organizations battling for control over Grant City's underworld. The story-driven action in Dead to Rights II: Hell to Pay features intense new game play mechanics including a lightning-pacedJack Slate and his K9 partner Shadow are thrown head first into the crossfire between criminal organizations battling for control over Grant City's underworld. The story-driven action in Dead to Rights II: Hell to Pay features intense new game play mechanics including a lightning-paced 360-degree brawling system, vicious melee weapon battles and an innovative new spherical slow motion diving system. [Namco]… Expand"}, {"name": "Conflict: Denied Ops", "details_link": "https://www.metacritic.com/game/playstation-3/conflict-denied-ops", "publisher": "Eidos Interactive", "release_date": "Feb 12 2008", "developers": ["Pivotal Games"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 51, "users_score": 3.3, "image": "https://static.metacritic.com/images/products/games/1/af768e8ff45fb257ed9acd87e7bf6cd0-98.jpg", "descriptions": "When the US government needs to act, but can not afford to be associated with the operation, deniable operatives are dispatched. Members of the unit must bear no identity; no objects, papers or clothing that could associate them with the government. Their task is to do anything necessary, noWhen the US government needs to act, but can not afford to be associated with the operation, deniable operatives are dispatched. Members of the unit must bear no identity; no objects, papers or clothing that could associate them with the government. Their task is to do anything necessary, no matter how ruthless, to dissolve the threat. Conflict: Denied Ops puts players in control of two of these merciless operatives, each of them highly specialized in both weapons and military tactics. With gameplay focused on accessible two-man tactics, utilize simple commands and switch seamlessly between team mates to lay down covering fire, explore diverging paths, create distractions and pin the enemy under fire. Making full use of Pivotal's Puncture Technology, Conflict: Denied Ops features a highly destructible environment, allowing players to utilize tactics such as shooting through walls to create sniping holes or blasting open new paths to take the enemy by surprise. Fighting for a good cause, does not mean they have to play by the rules. Brutalize the opposition, blast down buildings, and destroy everything in true Hollywood fashion – all throughout politically sensitive areas across South America, Africa and Russia. [Eidos Interactive]… Expand"}, {"name": "Air Conflicts: Secret Wars", "details_link": "https://www.metacritic.com/game/playstation-3/air-conflicts-secret-wars", "publisher": "Kalypso", "release_date": "Nov 15 2011", "developers": ["Games Farm"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Simulation", "Flight", "WWII", "WWII", "Combat"], "meta_score": 51, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/7c8529c60830fabfec49655ae4ce2c50-98.jpg", "descriptions": "In Air Conflicts: Secret Wars players can relive the most famous battles of the First and Second World War right up close. The game provides plenty of variety, as players can fly 16 meticulously detailed and accurate aircraft in nearly 50 exciting missions in the seven campaigns. The missionIn Air Conflicts: Secret Wars players can relive the most famous battles of the First and Second World War right up close. The game provides plenty of variety, as players can fly 16 meticulously detailed and accurate aircraft in nearly 50 exciting missions in the seven campaigns. The mission tasks are diverse and range from air space clearance operations to the bombardment of targets on the ground, attacks on enemy convoys and reconnaissance, escort and patrol flights. After each successful mission players can upgrade their skills to enable them to control their aircraft more expertly, make their aircraft more robust and select better co-pilots. There are two control modes for the combat aircraft: the controls are simplified in arcade mode and simulation mode offers a realistic control system that is true to the original. Besides the solo campaigns, Air Conflicts: Secret Wars can also offer several multiplayer modes for up to eight players that can be played on a local network and over the Internet.… Expand"}, {"name": "Happy Tree Friends: False Alarm", "details_link": "https://www.metacritic.com/game/xbox-360/happy-tree-friends-false-alarm", "publisher": "Sega", "release_date": "Jun 25 2008", "developers": ["Stainless Games"], "platforms": ["PC", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "General", "General"], "meta_score": 51, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/2/d7b0c2f4ea968bc9a9f60f35a5b4143d-98.jpg", "descriptions": "[Xbox Live Arcade]  Disaster has struck the Happy Tree Friends! Earthquakes, fires, and other catastrophes have trapped the beloved friends who now must be rescued. In a unique twist to the action genre, guide the rescue squad of Flippy, Handy, and Lumpy into dangerous situations using[Xbox Live Arcade]  Disaster has struck the Happy Tree Friends! Earthquakes, fires, and other catastrophes have trapped the beloved friends who now must be rescued. In a unique twist to the action genre, guide the rescue squad of Flippy, Handy, and Lumpy into dangerous situations using unique abilities in a dynamic reactive environment to save as many trapped Happy Tree Friends as possible. Cute, cuddly, and horribly wrong, Happy Tree Friends False Alarm is filled with unexpected situations and outrageous outcomes. For the first time in 3D, play as the rescue squad of Flippy, Handy, and Lumpy to save other Happy Tree Friends such as Cuddles, Toothy and Flaky from life-threatening disasters. Using physics-based reactive environments and problem-solving elements control a rescue squad with unique abilities such as hurling concrete, spraying water, or throwing nitroglycerin to augment the dynamic 3D environments creating a variety of unpredictable outcomes. SEGA and the creative minds behind Happy Tree Friends have teamed up to create 10 original and engaging disaster scenarios such as the Mine Shaft, Candy Factory, and Museum. Xbox Live Arcade features leaderboards to compete with friends, earn achievement medals, and track your progress as you advance through Career mode. [Sega]… Expand"}, {"name": "Headspun", "details_link": "https://www.metacritic.com/game/pc/headspun", "publisher": "Superstring", "release_date": "Aug 28 2019", "developers": ["Superstring"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/61a456b75400b471ea949d1632136acf-98.jpg", "descriptions": "After waking from a five week coma, Theo finds his life in disrepair. With no memory of the accident, it’s up to Ted and Teddy – the conscious and subconscious voices in his head – to work out what happened, and put his life back on track.Headspun is a game about recovery, discovery, and theAfter waking from a five week coma, Theo finds his life in disrepair. With no memory of the accident, it’s up to Ted and Teddy – the conscious and subconscious voices in his head – to work out what happened, and put his life back on track.Headspun is a game about recovery, discovery, and the ongoing battle between logic and emotion.… Expand"}, {"name": "Dead Rising 3: The Last Agent", "details_link": "https://www.metacritic.com/game/xbox-one/dead-rising-3-the-last-agent", "publisher": "Microsoft Game Studios", "release_date": "Mar 18 2014", "developers": ["Capcom Vancouver"], "platforms": "Xbox One", "genres": ["Action", "Action Adventure", "General", "Open-World"], "meta_score": 51, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/7/cd99d07ac9b75157cf4c6731b77c2160-98.jpg", "descriptions": "The Last Agent, the last installment in The Untold Stories of Los Perdidos, centers around on Brad Park, an agent for the Federal Bureau of Zombie Defense and Control."}, {"name": "Babel Rising", "details_link": "https://www.metacritic.com/game/xbox-360/babel-rising", "publisher": "Ubisoft", "release_date": "Jun 13 2012", "developers": ["Mondo Productions"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "genres": ["Strategy", "General", "General"], "meta_score": 51, "users_score": 3.4, "image": "https://static.metacritic.com/images/products/games/0/b1ca8af3e431fbbd6e7d5812adbd461c-98.jpg", "descriptions": "Ubisoft’s Babel Rising is the next-generation version of the popular iPhone game of the same name. In Babel Rising, gamers play as God, preventing humans from building the tower of Babel. Gamers can use their divine powers by hurling bolts of lightning, summoning massive earthquakes orUbisoft’s Babel Rising is the next-generation version of the popular iPhone game of the same name. In Babel Rising, gamers play as God, preventing humans from building the tower of Babel. Gamers can use their divine powers by hurling bolts of lightning, summoning massive earthquakes or unleashing gigantic floods upon the Babylonians. Developer Mando Productions has breathed new life into the game with 3D graphics and competitive and cooperative multiplayer modes.… Expand"}, {"name": "7 Wonders of the Ancient World", "details_link": "https://www.metacritic.com/game/psp/7-wonders-of-the-ancient-world", "publisher": "MumboJumbo", "release_date": "Apr 23 2007", "developers": ["MumboJumbo", "Hot Lava Games"], "platforms": ["iPhone/iPad", "PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "Matching", "General"], "meta_score": 51, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/b7519332b9c1b52370ba6287c56dc48f-98.jpg", "descriptions": "This action-adventure puzzler from developer Hot Lava lets gamers re-create history as they match magical runes to help workers build legendary landmarks of the ancient world such as the Great Pyramid of Giza and the Hanging Gardens of Babylon. 7 Wonders of the Ancient World lets gamersThis action-adventure puzzler from developer Hot Lava lets gamers re-create history as they match magical runes to help workers build legendary landmarks of the ancient world such as the Great Pyramid of Giza and the Hanging Gardens of Babylon. 7 Wonders of the Ancient World lets gamers explore ancient lands through three modes of play - Story, Free Play, and Rune Quest - that cover more than 140 levels and three modes of difficulty. Collect eye-popping powerups like the Lightning Bolt or Fire Bomb to help you in your race against the clock, and learn about history while having fun. [MumboJumbo]… Expand"}, {"name": "Warriors Orochi", "details_link": "https://www.metacritic.com/game/pc/warriors-orochi", "publisher": "Koei", "release_date": "Mar 25 2008", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "Xbox 360", "PC"], "num_players": "2  Online", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 51, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/3a770cdc27a319e402dfe91e2199e9a9-98.jpg", "descriptions": "Without warning, the venomous Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan in a scheme to test his might against the heroes ofWithout warning, the venomous Serpent King Orochi descended from the heavens. Using his unworldly powers to shatter time and space, Orochi kidnapped the strongest, wisest and most courageous warriors from Ancient China and Feudal Japan in a scheme to test his might against the heroes of these ages. In Warriors Orochi the characters from both the Dynasty Warriors and Samurai Warriors franchises must team-up to wage war against this new, yet powerful force. The game boasts an amazing roster of 79 playable characters, while four action-packed \"crossover\" storylines feature amazing team-ups and some long-awaited confrontations between characters from both series. Warriors Orochi for Windows-based PC features enhanced graphics (for PCs meeting the recommended system requirements) Players can adjust the anti-aliasing, textures, dynamic shadows and lighting, and even set the character count. More enemies means more KOs! [Koei]… Expand"}, {"name": "Yie Ar Kung-Fu", "details_link": "https://www.metacritic.com/game/xbox-360/yie-ar-kung-fu", "publisher": "Konami", "release_date": "Jul 18 2007", "developers": ["Digital Eclipse"], "platforms": ["PlayStation 4", "Switch", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/6bd524557f0384228ce3ff6497161035-98.jpg", "descriptions": "[Xbox Live Arcade]  Oolong has spent his entire life training for the Martial Arts Championship. The Championship has attracted masters of different disciplines, all fighting to be named champion. In Yie Ar Kung-Fu, Oolong must use his own fighting moves and face masters of the throwing[Xbox Live Arcade]  Oolong has spent his entire life training for the Martial Arts Championship. The Championship has attracted masters of different disciplines, all fighting to be named champion. In Yie Ar Kung-Fu, Oolong must use his own fighting moves and face masters of the throwing shuriken, nunchaku, bo, chain, and more to fulfill his destiny. With enhanced graphics, hand-painted backgrounds, and new achievements, this classic fighting game is sure to test your skills. Will you fight like a tiger or run away in shame? Classic gameplay: Authentic original gameplay of the arcade classic. Enhanced game elements: Play with the original arcade graphics or go enhanced with stunning hand-painted models and backgrounds. All the music and sound effects have been digitally enhanced to provide a richer, deeper gaming experience. All-time and weekly high score leaderboards. Twelve achievements provide up to 200 gamer points for your Gamerscore. [Microsoft]… Expand"}, {"name": "Ape Escape Academy", "details_link": "https://www.metacritic.com/game/psp/ape-escape-academy", "publisher": "SCEA", "release_date": "Jan 17 2006", "developers": ["Shift"], "platforms": "PSP", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 51, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/5/2b348c3d8af9119406eba444b2c2f245-98.jpg", "descriptions": "Compete in more than 40 mini-games including hockey, golf, dodge ball, karate and more, with a wide variety of game styles, each brimming with frantic fun and wacky-humor. Featuring Wi-Fi wireless LAN (Ad Hoc) connectivity, up to four players with a PSP and the game can challenge each other."}, {"name": "Duke Nukem Forever", "details_link": "https://www.metacritic.com/game/playstation-3/duke-nukem-forever", "publisher": "2K Games", "release_date": "Jun 10 2011", "developers": ["Gearbox Software", "3D Realms"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 51, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/4/a098998edc3d76c78bf84b7b1cdb63a5-98.jpg", "descriptions": "The king is back, baby! Duke Nukem Forever will meld 3D Realms' memorable hero with the latest 3D graphics technology."}, {"name": "Bullet Witch", "details_link": "https://www.metacritic.com/game/pc/bullet-witch", "publisher": "XSEED Games", "release_date": "Apr 25 2018", "developers": ["Cavia Inc."], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 51, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/0/cf80ea2b2e282c56ded298b3d25227db-98.jpg", "descriptions": "This action adventure takes place in the exceedingly bleak near future of 2013. Civilization is on the brink of extinction after demons begin appearing on the earth, and the player wades into the fray as a witch named Alicia."}, {"name": "Trivial Pursuit Unhinged", "details_link": "https://www.metacritic.com/game/playstation-2/trivial-pursuit-unhinged", "publisher": "Atari", "release_date": "Mar 24 2004", "developers": ["Artech Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-6 ", "genres": ["Miscellaneous", "Trivia / Game Show"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/c64eccd1a0be43b7ac0733eb2ee2b867-98.jpg", "descriptions": "The world's most popular trivia game is about to become a wild free-for-all! With incredible new game features, this all-new version of the Trivial Pursuit game rewards the clever, the speedy and the sneaky-- while still highlighting everybody's trivia talents. Trivia fans can bet againstThe world's most popular trivia game is about to become a wild free-for-all! With incredible new game features, this all-new version of the Trivial Pursuit game rewards the clever, the speedy and the sneaky-- while still highlighting everybody's trivia talents. Trivia fans can bet against others, steal wedges and even crush rivals' game pieces (along with their hopes of winning). Add in some impressive Hollywood types hosting each category, and loads of multimedia clips, and you've got a Trivial Pursuit party where everybody is in on the action. For those who crave free-for-all play, the traditional game, or even a quick trivia fix, there are plenty of modes: the Unhinged version, the original classic, and a fast new \"mini\" game. It's an outrageous twist on a favorite game with movies, stars, sports, and news that you know you know. Y'know? [Atari]… Expand"}, {"name": "I Am Bread", "details_link": "https://www.metacritic.com/game/playstation-4/i-am-bread", "publisher": "Bossa Studios", "release_date": "Aug 25 2015", "developers": ["Just Add Water", "Bossa Studios"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "genres": ["Action", "Miscellaneous", "General", "Platformer", "3D"], "meta_score": 51, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/9/3741c5a81c89badbbbb23b6ed9b3b975-98.jpg", "descriptions": "The story of a solitary slice of bread's epic and emotional journey as it embarks upon a quest to become toasted."}, {"name": "Fairytale Fights", "details_link": "https://www.metacritic.com/game/xbox-360/fairytale-fights", "publisher": "Playlogic", "release_date": "Oct 27 2009", "developers": ["Playlogic", "The Game Factory"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action", "General", "General", "Platformer", "3D"], "meta_score": 51, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/9dc5c19ece6a6023ae3ac6ef57cc8455-98.jpg", "descriptions": "Play your favorite fairytale character, regain your lost fame and save the fairytale world from certain doom! Luckily, a vast variety of deadly weapons lie around, which you can use to shoot and carve up evil villains, bloodthirsty rabbits and many more terribly cutesy characters roaming thePlay your favorite fairytale character, regain your lost fame and save the fairytale world from certain doom! Luckily, a vast variety of deadly weapons lie around, which you can use to shoot and carve up evil villains, bloodthirsty rabbits and many more terribly cutesy characters roaming the lands - and this is where the fun begins! Fight your opponents to the death and fulfill challenging quests while leaving behind a big trail of blood! With Playlogic's unique \"Dynamic Slicing\" technology, players have the ability to slice up an enemy in any way they like, using intuitive controls. In addition, the game uses the tested powers of the Unreal 3 engine. [Playlogic]… Expand"}, {"name": "Bionicle", "details_link": "https://www.metacritic.com/game/playstation-2/bionicle", "publisher": "EA Games", "release_date": "Oct 20 2003", "developers": ["Argonaut Games"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 51, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/1/343992f291b93ae6d141e168e274e9a2-98.jpg", "descriptions": "Playing as the Toa, Toa Nuva and finally the 7th Toa, you must explore the six elementally-themed regions of Mata Nui - a tropical paradise of high mountains, great lakes and mighty volcanoes - rescue the scattered Matoran and break the spell of darkness sent by the evil Makuta. In doing soPlaying as the Toa, Toa Nuva and finally the 7th Toa, you must explore the six elementally-themed regions of Mata Nui - a tropical paradise of high mountains, great lakes and mighty volcanoes - rescue the scattered Matoran and break the spell of darkness sent by the evil Makuta. In doing so you will face danger in equal measure from the islands many environmental hazards (including falling rocks, rainforest winds, icicles and lava falls) and the foul minions of Makuta. So whether youre a skilled player or a young gamer, the time has come to emerge from behind your mask. The fate of Mata Nui is now in your hands... Toa, you must explore the six elementally-themed. Choose any one of the six Toa characters to begin your adventure. Use the unique elemental powers of the Toa and summon 'blasts' of elemental energy to defeat your enemies. [LEGO/EA]… Expand"}, {"name": "Larry Ragland 4x4 Challenge", "details_link": "https://www.metacritic.com/game/pc/larry-ragland-4x4-challenge", "publisher": "Xicat Interactive", "release_date": "Nov 30 2001", "developers": ["Xpiral"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Automobile"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/057d3ce655dceee328bc5bde31bc9220-98.jpg", "descriptions": "Mix one part dirt and mud, 2 parts gasoline burnin’ speed, and 3 parts bare knuckle adrenaline and you get the most exhilarating indoor racer. [Xicat Interactive]"}, {"name": "NFL GameDay 2001", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-gameday-2001", "publisher": "SCEA", "release_date": "Nov 13 2000", "developers": ["SCEA"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/216e1926576503431d655666ceeba9b1-98.jpg", "descriptions": "When the original PlayStation launched without a Madden title, SCEA seized the opportunity to successfully launch the GameDay series. Madden returned fire the next year, and the healthy competition between the two football series has made both better. Now 989 Sports brings its popularWhen the original PlayStation launched without a Madden title, SCEA seized the opportunity to successfully launch the GameDay series. Madden returned fire the next year, and the healthy competition between the two football series has made both better. Now 989 Sports brings its popular football franchise to PlayStation 2 with NFL GameDay 2001. Obviously, the biggest change from past games in the series lies in the graphics, which have been greatly improved. The game features 1,100 position-specific tackles, jukes, spins, and stiff arms motion-captured from 13 pro NFL players. Grass and mud stains grace the players' jerseys, and photorealistic stadiums help to make for a more lifelike atmosphere.… Expand"}, {"name": "Action Bass", "details_link": "https://www.metacritic.com/game/playstation/action-bass", "publisher": "Take-Two Interactive", "release_date": "Jul 14 2000", "developers": ["Vingt-et-un Systems"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Sports", "Nature", "Fishing"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/37c13c83a4090389c08b8bdb1c502c97-98.jpg", "descriptions": "Do you have what it takes to get the biggest bass in the pond on your hook? Do you know the right lures to use in ever changing water conditions? Can you battle the bass and lure im in? Or will he break the line and be the one that got away???? If you think your up to the callenge,\rTHEN GETDo you have what it takes to get the biggest bass in the pond on your hook? Do you know the right lures to use in ever changing water conditions? Can you battle the bass and lure im in? Or will he break the line and be the one that got away???? If you think your up to the callenge,\rTHEN GET READY FOR ACTION BASS!… Expand"}, {"name": "Qix++", "details_link": "https://www.metacritic.com/game/xbox-360/qix++", "publisher": "Taito Corporation", "release_date": "Dec  9 2009", "developers": ["Taito Corporation"], "platforms": "Xbox 360", "num_players": "1-4 ", "genres": ["Puzzle", "Action", "General", "General"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/7f03937391511430d353e40379133216-98.jpg", "descriptions": "[Xbox Live Arcade]  Inheriting the style of the renowned arcade title, QIX++ allows you to take up the fight again in a variety of different ways. With customized weapon improvements, a technique-based scoring system, and events triggered by opening Item Containers, the evolution of the[Xbox Live Arcade]  Inheriting the style of the renowned arcade title, QIX++ allows you to take up the fight again in a variety of different ways. With customized weapon improvements, a technique-based scoring system, and events triggered by opening Item Containers, the evolution of the series has truly come a long way. The object of the game is to defeat the QIX using the marker. When the total area cut off by the marker reaches a percentage equal to the Threshold, your final attack begins and you have cleared the stage. [Taito]… Expand"}, {"name": "Confrontation", "details_link": "https://www.metacritic.com/game/pc/confrontation", "publisher": "Focus Home Interactive", "release_date": "Apr  4 2012", "developers": ["Cyanide"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Fantasy", "General"], "meta_score": 51, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/8/285b5ca9fa46f53b3cd9f525cef952c0-98.jpg", "descriptions": "The game is set in the fantastic and original universe of Confrontation, Aarklash. As the Age of Rag'narok is approaching, four factions are fighting for their own cause and struggling for domination over the land: the brutal Orcs of the Tree-Spirit, the ferocious Wolfen packs, the fearsomeThe game is set in the fantastic and original universe of Confrontation, Aarklash. As the Age of Rag'narok is approaching, four factions are fighting for their own cause and struggling for domination over the land: the brutal Orcs of the Tree-Spirit, the ferocious Wolfen packs, the fearsome Griffon warriors or the terrifying creatures of the Scorpion.… Expand"}, {"name": "Star Trek: Encounters", "details_link": "https://www.metacritic.com/game/playstation-2/star-trek-encounters", "publisher": "Bethesda Softworks", "release_date": "Oct  4 2006", "developers": ["4J Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Small Spaceship"], "meta_score": 51, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/0fa85b6f182392f4cd4c67596355e883-98.jpg", "descriptions": "Star Trek: Encounters is a shoot-'em-up arcade style space combat game featuring ships, characters, and weapons from 40 years of Star Trek. Take command of your starship and blast through the universe, defending your vessel and demolishing your opponents' in fast action battles. FiveStar Trek: Encounters is a shoot-'em-up arcade style space combat game featuring ships, characters, and weapons from 40 years of Star Trek. Take command of your starship and blast through the universe, defending your vessel and demolishing your opponents' in fast action battles. Five Generations at Your Control: Ships and characters from The Original Series, The Next Generation, Deep Space Nine, Voyager, and Enterprise. Experience the Trek you know with missions based on classic moments from the television series and films. Destroy your opponents with a wide array of weapons including Phasers, Pulse Cannons, Torpedoes, and more. Choose from Skirmish Mode, Episode Mode, or go head-to-head against a friend in Multiplayer Mode. [Bethesda Softworks]… Expand"}, {"name": "Super Monkey Ball Adventure", "details_link": "https://www.metacritic.com/game/gamecube/super-monkey-ball-adventure", "publisher": "Sega", "release_date": "Aug  1 2006", "developers": ["TT Games"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Platformer", "3D"], "meta_score": 51, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/f7a7aaa09d47305f79b7dba5421d92f2-98.jpg", "descriptions": "Adventurers discover that in Super Monkey Ball Adventure their monkey balls now have a whole host of new abilities, including sticking to walls, hovering and the ability to become invisible. Super Monkey Ball Adventure also contains 50 new puzzle levels and six new party games to challengeAdventurers discover that in Super Monkey Ball Adventure their monkey balls now have a whole host of new abilities, including sticking to walls, hovering and the ability to become invisible. Super Monkey Ball Adventure also contains 50 new puzzle levels and six new party games to challenge gamers of all ages. Players can select Aiai, Meemee, Gongon, or Baby to adventure their way through five different Monkey Ball Kingdoms to complete quests by solving puzzles and ultimately uniting the feuding Monkey Kingdoms. The original Monkey Ball characters of Aiai, Meemee, Gongon & Baby are back. They are joined by a host of new characters, including a Prince and Princess, who are being kept apart by a feud between their kingdoms. The couple run away to Jungle Island where they enlist the help of the Super Monkey Ball gang, to unite the feuding Monkey Kingdoms and defeat the Naysayers who have sucked all the joy from the Monkey Ball world.… Expand"}, {"name": "Racquet Sports", "details_link": "https://www.metacritic.com/game/wii/racquet-sports", "publisher": "Ubisoft", "release_date": "Mar  9 2010", "developers": ["Asobo Studio"], "platforms": ["PlayStation 3", "Wii"], "genres": ["Sports", "Traditional", "General", "Individual", "Tennis", "Other", "Tennis"], "meta_score": 51, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/7/b52b87fd770b45f12cf7be015f650ea8-98.jpg", "descriptions": "For the first time, Racquet Sports serves up 5 of your favorite racquet games all in one product for the Wii. You are immersed in stunning worldwide locations as you serve, rally, and smash your way to the finals. Every family member can get into the action with easy-to-use controls thatFor the first time, Racquet Sports serves up 5 of your favorite racquet games all in one product for the Wii. You are immersed in stunning worldwide locations as you serve, rally, and smash your way to the finals. Every family member can get into the action with easy-to-use controls that precisely simulate each player's movements. From Party Mode to Championship Mode, Racquet Sports is fun for everyone. [Ubisoft]… Expand"}, {"name": "Alpha Black Zero: Intrepid Protocol", "details_link": "https://www.metacritic.com/game/pc/alpha-black-zero-intrepid-protocol", "publisher": "Playlogic", "release_date": "Sep  2 2004", "developers": ["Khaeon"], "platforms": "PC", "num_players": "1-5 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 51, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/35a15e529701b2d600343bcb28644d66-98.jpg", "descriptions": "The year is 2366, and the Solgov federation faces turmoil. Lieutenant Kyle Hardlaw, leader of specialized commando unit 'Alpha Black Zero', stands accused of multiple illegal assassinations against his own government. In the courtroom on Qahira, the politically influential planet formerlyThe year is 2366, and the Solgov federation faces turmoil. Lieutenant Kyle Hardlaw, leader of specialized commando unit 'Alpha Black Zero', stands accused of multiple illegal assassinations against his own government. In the courtroom on Qahira, the politically influential planet formerly known as Mars, a military tribunal asserts Hardlaw killed numerous Solgov officials during a secret mission on a rebellious world. Many local populations are hostile to Solgov, having been indoctrinated for years by ultra-right separatist groups. Olympus City, the Qahiran capital brims with intrigue and suspicion. Hardlaw's work is always dangerous, but what actions have resulted in his trial? Behind the courtroom drama, a series of missions are played out that reveal a sinister story of counter espionage and treason in an explosive climate. Hardlaw must fight through a military and political minefield to clear his name. Unravel the conspiracy, and he wins his freedom. Fail, and his team will be silenced forever. Alpha Black Zero is a fast-paced mission based 3rd person tactical shooter with a gripping storyline to test both your fighting abilities and your intelligence. Dozens of different enemies, all possessing strong artificial intelligence will punish your mistakes across huge and challenging levels. [GMX Media]… Expand"}, {"name": "V-Rally 4", "details_link": "https://www.metacritic.com/game/switch/v-rally-4", "publisher": "Bigben Interactive", "release_date": "Feb  5 2019", "developers": ["Kylotonn"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 51, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/fecbf57cb1b311dca9fdf5b245067c91-98.jpg", "descriptions": "Dominate dangerous roads, hostile conditions, and environments, constantly striving for more speed. Let adrenaline boost your reflexes at the wheel of the most legendary off-road vehicles in each category, and take on the most difficult routes in fabulous surroundings."}, {"name": "Beowulf: The Game", "details_link": "https://www.metacritic.com/game/xbox-360/beowulf-the-game", "publisher": "Ubisoft", "release_date": "Nov 13 2007", "developers": ["Ubisoft Shanghai"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 51, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/5/e02182dbbcb1183a77a8addcb014c229-98.jpg", "descriptions": "Gamers live the life of Beowulf, the legendary Norse warrior with the strength of 30 men who is torn between the nobility and brutality within him. Arrogant, self-serving and lustful for gold and glory, Beowulf journeys to Denmark to destroy a bloodthirsty beast wreaking havoc on a frigidGamers live the life of Beowulf, the legendary Norse warrior with the strength of 30 men who is torn between the nobility and brutality within him. Arrogant, self-serving and lustful for gold and glory, Beowulf journeys to Denmark to destroy a bloodthirsty beast wreaking havoc on a frigid land. But evil persists, and Beowulf succumbs to its lure of even greater fame, quietly maneuvering to claim the Danish throne. As King, Beowulf must face the consequences of ambition, even as war descends on the realm. As Beowulf, players lead their men, called thanes, into battle, slay the Titans of a dying age and crush the enemies that threaten to annihilate both their kingdom and people. Only then, when Beowulf looks Destiny in the eye, will he know what kind of hero he has truly become. Army of up to 12 thanes to unlock as players increase their heroic experience (by saving thanes, killing giant monsters, etc.). Players use the thane army to their advantage by giving orders, assigning positions, tailoring weapons to the situation or enemy and by triggering in-game mechanisms. The thane army evolves with upgradeable weapons (swords, mace and spears), skills and abilities. Use legacy experience points to gain thanes, replace weapons and upgrade Carnal abilities. Carnal Power allows the use of stronger attacks and special weapons. Carnal upgrades include less daze after use and prolonged use of Carnal Fury. But if used too much, there will be grave consequences. Dynamic combat system including combos, parries and increasing skills as the player progresses. Grab ability allows Beowulf to hold on to walls or climb, as well as fight up close with visceral hand-to-hand combat against enemies and giant monsters. [Ubisoft]… Expand"}, {"name": "Superman Returns", "details_link": "https://www.metacritic.com/game/xbox/superman-returns", "publisher": "EA Games", "release_date": "Nov 20 2006", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 51, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "True to the fiction in every respect, this is the game based on the Superman universe that fans have been anticipating for decades. From excited citizens to the traffic on the streets, every detail of this vibrant city has a mind of its own. These 80 square miles are brought to life for theTrue to the fiction in every respect, this is the game based on the Superman universe that fans have been anticipating for decades. From excited citizens to the traffic on the streets, every detail of this vibrant city has a mind of its own. These 80 square miles are brought to life for the first time in a videogame. Go anywhere and do anything in Metropolis as Superman. Non-linear gameplay allows you to explore and play the game exactly how you want to at your own pace. Where and how you fly - to the top of skyscrapers, dodging elevated trains - is completely up to you, since gameplay is designed as a true open world experience. With notorious villains like Metallo and colossal challenges only Superman can overcome, you must navigate the Man of Steel to monitor and protect Metropolis from destruction. Three distinct types of gameplay -- Flying, Rescue, and Combat -- will keep the action constant and the challenges relentless. Play both film-inspired missions as well as original content created exclusively for the videogame. Graphics, sound, and gameplay have been taken to the next level to create a Metropolis like you've never seen it, with three dimensional sound, a complete orchestra soundtrack, and Oscar-wining sound designer.… Expand"}, {"name": "Harry Potter and the Order of the Phoenix", "details_link": "https://www.metacritic.com/game/ds/harry-potter-and-the-order-of-the-phoenix", "publisher": "EA Games", "release_date": "Jun 25 2007", "developers": ["Visual Impact"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 51, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/1/719c5e6acd8a081f09a267e9233dbdd0-98.jpg", "descriptions": "In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster,In Harry Potter and the Order of the Phoenix, Harry returns for his fifth year of study at Hogwarts and discovers that much of the wizarding community has been denied the truth about the teenager’s recent encounter with the evil Lord Voldemort. Fearing that Hogwarts' venerable Headmaster, Albus Dumbledore, is lying about Voldemort's return in order to undermine his power and take his job, the Minister for Magic, Cornelius Fudge, appoints a new Defense Against the Dark Arts teacher to keep watch over Dumbledore and the Hogwarts students. But Professor Dolores Umbridge's Ministry-approved course of defensive magic leaves the young wizards woefully unprepared to defend themselves against the dark forces threatening them and the entire wizarding community, so at the prompting of his friends Hermione and Ron, Harry takes matters into his own hands. Meeting secretly with a small group of students who name themselves \"Dumbledore’s Army,\" Harry teaches them how to defend themselves against the Dark Arts, preparing the courageous young wizards for the extraordinary battle that lies ahead. With the ability to play multiple characters, including Harry Potter, Dumbledore and Sirius Black, the videogame of Harry Potter and the Order of the Phoenix offers fans the opportunity to wield a wand, explore all around Hogwarts, and experience one of the most exciting and dangerous years in the life of the Boy Who Lived. [Electronic Arts / Warner Bros.]… Expand"}, {"name": "Eragon", "details_link": "https://www.metacritic.com/game/playstation-2/eragon", "publisher": "Sierra Entertainment", "release_date": "Nov 14 2006", "developers": ["Stormfront Studios"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 51, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/3/8488defda9e8ae4cd165d7e384354fec-98.jpg", "descriptions": "Play as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features aPlay as Eragon and his dragon as they set out to fulfill their destiny. Endure perilous travels, adventure and heart-pounding combat as you live the epic events of the movie. Disable and dispatch enemies with the unparalleled skills of a true Dragon Ride. Eragon's combat system features a variety of blistering attacks and defences, including a unique degradable block system. Extensive Dragon Combat – Ride Saphira and blast your enemies with bursts of fire, and call in devastating dragon attacks during melee battles. Eragon features multiplayer co-op with team attack bonuses and dragon fight/flight combo gameplay. Full cooperation from the film production team provides faithful implementation of the movie's look-and-feel. As Eragon discovers the powers hidden within him he learns to unleash magical attacks to decimate his foes. [Vivendi Games]… Expand"}, {"name": "DiRT 2", "details_link": "https://www.metacritic.com/game/wii/dirt-2", "publisher": "Codemasters", "release_date": "Sep  8 2009", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 51, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/9/ec81c7d072fe92fe3400298848a1d7c2-98.jpg", "descriptions": "(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking(Also known as \"Colin McRae: DiRT 2\" in the UK/EU)  DiRT 2 takes racing games to a new level with thrilling new race types, striking locations, big event atmosphere, and a peerless line-up of super-charged speed machines, each selected to deliver spectacular, fast-paced racing. Taking players on an exhilarating World Tour, DiRT 2 delivers over 100 stunning events, including aggressive, multi-vehicle races and intense solo challenges, set in the most diverse and demanding real-world environments. From the muddy tracks of the Malaysian rainforest to spectator-packed stadiums in London and Los Angeles, racers compete in contemporary off-road race disciplines covering Rallycross, Trailblazer, Raid, Landrush, and Rally. Embracing the culture and new heroes of modern off-road racing, DiRT 2 features an exciting line-up of the best new rally drivers - including the multi medal-winning Subaru Rally Team USA driver Ken Block alongside Travis Pastrana, Dave Mirra, and Tanner Faust, who help players build their racing career. [Codemasters]… Expand"}, {"name": "Disney*Pixar WALL-E", "details_link": "https://www.metacritic.com/game/wii/disneypixar-wall-e", "publisher": "THQ", "release_date": "Jun 24 2008", "developers": ["Heavy Iron Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 51, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/6/6c923154f9a2a26af224c7ec051100ce-98.jpg", "descriptions": "What if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets aWhat if mankind had to leave Earth, and somebody forgot to turn the last robot off? After hundreds of lonely years of doing what he was built for, WALL-E (short for Waste Allocation Load Lifter Earth-Class) discovers a new purpose in life (besides collecting knick-knacks) when he meets a sleek search robot named EVE. EVE comes to realize that WALL-E has inadvertently stumbled upon the key to the planet’s future, and races back to space to report her findings to the humans (who have been eagerly awaiting word that it is safe to return home). Meanwhile, WALL-E chases EVE across the galaxy and sets into motion one of the most exciting and imaginative comedy adventures ever brought to the big screen. Joining WALL-E on his fantastic journey across a universe of never-before-imagined visions of the future, is a hilarious cast of characters including a pet cockroach, and a heroic team of malfunctioning misfit robots. Players of the game take control of WALL-E and EVE through a fast-paced adventure based on the Disney/Pixar film. The game allows fans to relive some of the movie’s most thrilling moments as they explore 10 worlds filled with non-stop action and adventure, along with head-to-head multiplayer challenges. Players will recognize the storyline, characters and key locations from the WALL-E film as they carry out intense missions, dodge dangerous enemies and navigate their way through a futuristic world. In addition, the game contains new storylines and environments that movie-goers will not see in theaters. [THQ]… Expand"}, {"name": "Generation Zero", "details_link": "https://www.metacritic.com/game/pc/generation-zero", "publisher": "Avalanche Studios", "release_date": "Mar 26 2019", "developers": ["Avalanche Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action Adventure", "Open-World"], "meta_score": 51, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/8a3d06aec3d0bd74508a9009a2213f08-98.jpg", "descriptions": "Welcome to 1980’s Sweden. The local population has disappeared, and hostile machines roam the streets. Explore the open world to unravel the mystery, perfect your fighting strategies, and prepare to strike back. Play alone or together with up to three friends, as you discover ways to defeat Welcome to 1980’s Sweden. The local population has disappeared, and hostile machines roam the streets. Explore the open world to unravel the mystery, perfect your fighting strategies, and prepare to strike back. Play alone or together with up to three friends, as you discover ways to defeat the invaders. … Expand"}, {"name": "Grom: Terror in Tibet", "details_link": "https://www.metacritic.com/game/pc/grom-terror-in-tibet", "publisher": "cdv Software", "release_date": "Mar 12 2003", "developers": ["Rebelmind"], "platforms": "PC", "num_players": "1 Player", "genres": ["Action Adventure", "Historic", "General"], "meta_score": 51, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/a040eb744c04727e1f282bd2dc43489d-98.jpg", "descriptions": "It's hard to believe what is happening in 1942: Far from the chaos of war, Tibet suddenly becomes the hottest spot in the race for world domination. For here, one of the führer's special units is searching feverishly for the Lost City of King Arjuna. According to legend, the king concealedIt's hard to believe what is happening in 1942: Far from the chaos of war, Tibet suddenly becomes the hottest spot in the race for world domination. For here, one of the führer's special units is searching feverishly for the Lost City of King Arjuna. According to legend, the king concealed twelve miracle weapons there. Each one by itself is capable of erasing major cities in the blink of an eye. One shudders to think what might happen if the Nazis got hold of even one of them. Waste no time and take on the identity of Colonel Grom! This shrewd old campaigner packs a ton of action with an extra dose of humour. What are you waiting for? Let those Third Reich henchmen have it! [CDV]… Expand"}, {"name": "NFL GameDay 2002", "details_link": "https://www.metacritic.com/game/playstation-2/nfl-gameday-2002", "publisher": "SCEA", "release_date": "Dec  3 2001", "developers": ["Red Zone Entertainment"], "platforms": "PlayStation 2", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 51, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/9/779318dfcdb9e086b71736ba0ff98d4b-98.jpg", "descriptions": "With its exhibition, season, tournament, training camp, and general manager modes, GameDay 2002 is improved in all areas and allows the player to customize individual AI components."}, {"name": "Saints Row 2: Ultor Exposed", "details_link": "https://www.metacritic.com/game/xbox-360/saints-row-2-ultor-exposed", "publisher": "THQ", "release_date": "Apr 23 2009", "developers": ["Volition Inc."], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "1-8 ", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 51, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/7/141d6f69fa4b499b706230b345cd0e0f-98.jpg", "descriptions": "(Downloadable Content)  In Ultor Exposed, the first downloadable content for Saints Row 2, gamers return to Stilwater to expose the Ultor Corporation's latest plans while trying to bring down the evil company once and for all. Players can battle through three all new co-op enabled missions(Downloadable Content)  In Ultor Exposed, the first downloadable content for Saints Row 2, gamers return to Stilwater to expose the Ultor Corporation's latest plans while trying to bring down the evil company once and for all. Players can battle through three all new co-op enabled missions starring adult film star Tera Patrick, while commandeering new air and ground vehicles such as an attack aircraft and a luxury sports car. Ultor Exposed offers all new customization options, including new hairstyles, clothing and costumes, along with new multiplayer maps for the Strong Arm and Gangsta Brawl multiplayer modes. [THQ]… Expand"}, {"name": "Death by Degrees", "details_link": "https://www.metacritic.com/game/playstation-2/death-by-degrees", "publisher": "Namco", "release_date": "Feb  8 2005", "developers": ["Namco"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 51, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/a66dbfa19a24ff4997156659c1294dac-98.jpg", "descriptions": "Namco extends its popular Tekken franchise by focusing on the voluptuous operative, Nina Williams, as she confronts demons from her dark past in order to carry out a perilous mission. Dispatched to investigate the whereabouts of a stolen high-tech weapon, Nina must infiltrate a shadowyNamco extends its popular Tekken franchise by focusing on the voluptuous operative, Nina Williams, as she confronts demons from her dark past in order to carry out a perilous mission. Dispatched to investigate the whereabouts of a stolen high-tech weapon, Nina must infiltrate a shadowy organization and reveal a conspiracy on a global scale. Death By Degrees blends a unique mixture of combat and adventure. Beautifully rendered environments set the stage for game play, including combat in a weapons research facility, a cryptic prison and a level onboard a luxury cruise ship.  An intriguing storyline with challenging scenarios, recognizable characters and interesting character development will allow players of all skill levels to grasp Death by Degrees game play mechanics and participate in over-the-top, fast-paced action combat. Surrounded?  An intuitive control system offers hundreds of possible attacks in all directions using both analog sticks.  The game offers cutting edge action, featuring fighting techniques at speeds similar to that seen in action films. Use an on-screen \"X-ray scan\" to target the weak points of an enemy's body such as bones and internal organs to inflict massive damage. Sneak up behind enemies, use evasion maneuvers, and put unsuspecting guards out with sleeper holds. Fans will recognize Nina's Tekken moves including Evil Mist, attacks, throws and submission techniques. Master a nearly unlimited combination range of acrobatics, throws, grappling techniques, hand-to-hand weapons (including katanas and tonfa), and firearms. [Namco]… Expand"}, {"name": "Carmageddon: Max Damage", "details_link": "https://www.metacritic.com/game/playstation-4/carmageddon-max-damage", "publisher": "Stainless Games", "release_date": "Jul  5 2016", "developers": ["Stainless Games"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 6 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 51, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/e06ed45fbad671e637678cd28baa1892-98.jpg", "descriptions": "Create carnage in a wide range of large open world environments and smaller battle arenas, with plenty of fun stuff to smash into, smash up, snap off and sling around. Explore city streets and country trails, arid deserts and icy wastelands all packed with juicy meatbags for your killing pleasure."}, {"name": "Taxi Chaos", "details_link": "https://www.metacritic.com/game/switch/taxi-chaos", "publisher": "GS2 Games", "release_date": "Feb 23 2021", "developers": ["Team6 Game Studios", "Orange One"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Racing", "Arcade", "Vehicle", "Automobile", "Civilian"], "meta_score": 51, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/0aad0caaa132a2e096cc909e8126b291-98.jpg", "descriptions": "Taxi Chaos  is a casual arcade racing game where you select one of a wide range of unlockable cabs, each of whom has different attributes: the strong muscle car, the superfast exotic supercar, the corner-drifting Japanese tuner, an American classic from the ‘60s and more: Taxi Mayhem hasTaxi Chaos  is a casual arcade racing game where you select one of a wide range of unlockable cabs, each of whom has different attributes: the strong muscle car, the superfast exotic supercar, the corner-drifting Japanese tuner, an American classic from the ‘60s and more: Taxi Mayhem has them all. Your goal is to try and earn big cab fares, by picking up any customers and dropping them off at their destination spots as fast as possible before you run out of time! However, beware: most customers are a little crazy.… Expand"}, {"name": "Call of Juarez: The Cartel", "details_link": "https://www.metacritic.com/game/pc/call-of-juarez-the-cartel", "publisher": "Ubisoft", "release_date": "Sep 13 2011", "developers": ["Ubisoft"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Modern", "Modern", "Arcade"], "meta_score": 51, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/2/d9229ec5d88b4e9cc0d284f7b48579a1-98.jpg", "descriptions": "Call of Juarez: The Cartel is the third game from the Call of Juarez series."}, {"name": "Hospital Tycoon", "details_link": "https://www.metacritic.com/game/pc/hospital-tycoon", "publisher": "Codemasters", "release_date": "Jun  5 2007", "developers": ["Big Red Software"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Tycoon", "Management", "Tycoon", "Business / Tycoon"], "meta_score": 51, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/0/8ddb2ff15445252d3e7f23693654e2d0-98.jpg", "descriptions": "At the Sapphire Beach Medical Institute, the lives and loves of the hospital's doctors and nurses, as well as the sneezes and diseases of its patients, come alive. Fusing Tycoon-style gameplay with character simulation and a light-hearted narrative, Hospital Tycoon gives players a soap-operaAt the Sapphire Beach Medical Institute, the lives and loves of the hospital's doctors and nurses, as well as the sneezes and diseases of its patients, come alive. Fusing Tycoon-style gameplay with character simulation and a light-hearted narrative, Hospital Tycoon gives players a soap-opera feel as they progress through episodes of hospital drama's Story Mode. Each episode in Hospital Tycoon explores a plot involving certain members of the hospital's staff and some very interesting patients, while at the same time challenging players to find cures for bizarre new illnesses. Diseases range from the everyday Explosive Sneezing - where a simple sneeze can launch the unfortunate patient several feet into the air, to the more rare Monkey Nuts - where patients sprout fur, climb furniture and favor bananas over everyday person food. Hospital Tycoon staff members have rich behaviors that players can nurture and influence throughout the game. Gamers may choose to encourage a friendship or a falling-out of sorts, and can train staff to improve their skill levels. Players are also challenged to manage and maintain each hospital, creating dedicated areas to support additional medical needs, including surgery, diagnosis, physiotherapy and more. As more patients are cured, the more players can expand their medical empire and attract new, and even more interesting patients. However, as the hospital becomes busier, players have to be on the lookout for the spread of infectious conditions or they'll soon have an epidemic running riot throughout the facility. [Codemasters]… Expand"}, {"name": "NARC", "details_link": "https://www.metacritic.com/game/xbox/narc", "publisher": "Midway", "release_date": "Mar 22 2005", "developers": ["Point of View"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 51, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/5/dbb1a29c635d519d745ae1a9db098a6c-98.jpg", "descriptions": "A routine stop for a traffic violation turns into a bloodbath as a drug dealer kills eight police officers. The DEA sends Detectives Jack Forzenski and Marcus Hill to help investigate a new mystery drug and to untangle a web of lies, betrayals, secrets, and temptations. As Jack and Marcus,A routine stop for a traffic violation turns into a bloodbath as a drug dealer kills eight police officers. The DEA sends Detectives Jack Forzenski and Marcus Hill to help investigate a new mystery drug and to untangle a web of lies, betrayals, secrets, and temptations. As Jack and Marcus, your decisions determine whether you're a good cop or a bad cop--turn the drugs into evidence and become the hero, or sell them on the street to earn some cash. No matter what path you choose, NARC gives you the chance to bust criminals, wield an arsenal of hi-tech police weaponry, and engage in rough street fighting.… Expand"}, {"name": "Beowulf: The Game", "details_link": "https://www.metacritic.com/game/playstation-3/beowulf-the-game", "publisher": "Ubisoft", "release_date": "Nov 13 2007", "developers": ["Ubisoft"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 51, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/6/87ddb21a5f0a245780acbf460fcb1f70-98.jpg", "descriptions": "Gamers live the life of Beowulf, the legendary Norse warrior with the strength of 30 men who is torn between the nobility and brutality within him. Arrogant, self-serving and lustful for gold and glory, Beowulf journeys to Denmark to destroy a bloodthirsty beast wreaking havoc on a frigidGamers live the life of Beowulf, the legendary Norse warrior with the strength of 30 men who is torn between the nobility and brutality within him. Arrogant, self-serving and lustful for gold and glory, Beowulf journeys to Denmark to destroy a bloodthirsty beast wreaking havoc on a frigid land. But evil persists, and Beowulf succumbs to its lure of even greater fame, quietly maneuvering to claim the Danish throne. As King, Beowulf must face the consequences of ambition, even as war descends on the realm. As Beowulf, players lead their men, called thanes, into battle, slay the Titans of a dying age and crush the enemies that threaten to annihilate both their kingdom and people. Only then, when Beowulf looks Destiny in the eye, will he know what kind of hero he has truly become. Army of up to 12 thanes to unlock as players increase their heroic experience (by saving thanes, killing giant monsters, etc.). Players use the thane army to their advantage by giving orders, assigning positions, tailoring weapons to the situation or enemy and by triggering in-game mechanisms. The thane army evolves with upgradeable weapons (swords, mace and spears), skills and abilities. Use legacy experience points to gain thanes, replace weapons and upgrade Carnal abilities. Carnal Power allows the use of stronger attacks and special weapons. Carnal upgrades include less daze after use and prolonged use of Carnal Fury. But if used too much, there will be grave consequences. Dynamic combat system including combos, parries and increasing skills as the player progresses. Grab ability allows Beowulf to hold on to walls or climb, as well as fight up close with visceral hand-to-hand combat against enemies and giant monsters. [Ubisoft]… Expand"}, {"name": "Shadwen", "details_link": "https://www.metacritic.com/game/playstation-4/shadwen", "publisher": "Frozenbyte, Inc.", "release_date": "May 17 2016", "developers": ["Frozenbyte", "Inc."], "platforms": ["PC", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 51, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/855175550f92ddd1ffcc856954549629-98.jpg", "descriptions": "Shadwen is a stealth-action game where the only rule is to remain unseen. Stay hidden - or the ruthless guards will kill you on sight."}, {"name": "YUMENIKKI -DREAM DIARY-", "details_link": "https://www.metacritic.com/game/pc/yumenikki--dream-diary-", "publisher": "Active Gaming Media", "release_date": "Feb 23 2018", "developers": ["Kadokawa", "KADOKAWA CORPORATION"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "3D", "Linear", "First-Person"], "meta_score": 51, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/3/69cb9be66ab7a1539841a8a600c83dd8-98.jpg", "descriptions": "So long as you have a dream in your heart, there's nowhere to run. But if you go through the doors and explore what's beyond, you just might have a chance...Play as a young girl as she explores the mysterious and unreal world of her dreams. Start off with no story or guide, as youSo long as you have a dream in your heart, there's nowhere to run. But if you go through the doors and explore what's beyond, you just might have a chance...Play as a young girl as she explores the mysterious and unreal world of her dreams. Start off with no story or guide, as you experience the different worlds of her dreams, each one deeply shrouded in mystery.Run from the monsters that chase you, discover how to use the items you find, and solve the puzzles you come across to find clues to the mysteries scattered around you.There are 7 doors that exist within the dream, from which you can freely go through to different worlds as many times and in whatever order you like. Discovering where the worlds are connected and what happens between them may be the key that brings you closer to your goal.An homage to the original Yume Nikki, created by indie game developer Kikiyama on RPG Maker and released in 2004, this reimagining has been made with the permission, cooperation, and supervision of the original creator. This time created with 3D graphics and a new game system, while still retaining the feel of the original world and characters.… Expand"}, {"name": "Baseball Riot", "details_link": "https://www.metacritic.com/game/switch/baseball-riot", "publisher": "10tons", "release_date": "Jan 19 2018", "developers": ["10tons"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 51, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/2dc33db6bd8d41814619a9de163f0beb-98.jpg", "descriptions": "Start a baseball riot! Help Gabe Carpaccio take vengeance on the unholy alliance of his former team and a corrupt energy drink manufacturer Explodz Inc.!\r Baseball Riot is a sequel to the fan favourite Tennis in the Face.\r\n\r\nBaseball Riot is a fun physics based puzzle game packed withStart a baseball riot! Help Gabe Carpaccio take vengeance on the unholy alliance of his former team and a corrupt energy drink manufacturer Explodz Inc.!\r Baseball Riot is a sequel to the fan favourite Tennis in the Face.\r Baseball Riot is a fun physics based puzzle game packed with slapstick comedy and mayhem! Take control of retired star batter Gabe Carpaccio as he goes on a crusade to free his former team from the grasp of Explodz Inc.\r Smash baseballs at various Explodz fueled goons such as obnoxious fans, biased umpires, leery catchers and more.\r Bounce the ball of walls and platforms to knock out many targets with one hit. Detonate Explodz crates to launch the baddies sky high! See the enemies tumble as hapless ragdolls and try to master each level by collecting three stars. Conquer more than 100 levels and save the day!… Expand"}, {"name": "Party Hard", "details_link": "https://www.metacritic.com/game/xbox-one/party-hard", "publisher": "tiny Build GAMES", "release_date": "Apr 26 2016", "developers": ["Pinokl Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "General"], "meta_score": 51, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/2/28ac281ca655705f3c098c2ca097bf2b-98.jpg", "descriptions": "In Party Hard, you assume the role of someone who is really tired of the neighbors having loud parties. Instead of calling the police, you decide it’s a better idea to kill everyone – using your faithful knife and the environment. The tactical strategy follows a series of killings at partiesIn Party Hard, you assume the role of someone who is really tired of the neighbors having loud parties. Instead of calling the police, you decide it’s a better idea to kill everyone – using your faithful knife and the environment. The tactical strategy follows a series of killings at parties through-ought the USA.… Expand"}, {"name": "Red Johnson's Chronicles - One Against All", "details_link": "https://www.metacritic.com/game/xbox-360/red-johnsons-chronicles---one-against-all", "publisher": "Namco Bandai Games", "release_date": "Sep 12 2012", "developers": ["Lexis Numerique"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "Action"], "meta_score": 51, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/2/308935981dee6f84f20c5793e9c3f621-98.jpg", "descriptions": "Red Johnson's Chronicles is an action adventure/puzzle game that is played out in the style of a television crime show like Professor Layton meets CSI. In the game, players take on the role of Red Johnson, a private investigator on the streets of a city where the crime rate is skyrocketing.Red Johnson's Chronicles is an action adventure/puzzle game that is played out in the style of a television crime show like Professor Layton meets CSI. In the game, players take on the role of Red Johnson, a private investigator on the streets of a city where the crime rate is skyrocketing. Players must use clues, solve puzzles and question witnesses to investigate a murder, all while staying out of harm's way.… Expand"}, {"name": "Crusty Demons", "details_link": "https://www.metacritic.com/game/xbox/crusty-demons", "publisher": "Evolved Games", "release_date": "Jun 27 2006", "developers": ["Climax Group"], "platforms": "Xbox", "num_players": "6  Online", "genres": ["Driving", "Racing", "Motorcycle", "Motocross"], "meta_score": 51, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/2/63b7b389f01dd874302e81cc18bf0a37-98.jpg", "descriptions": "The Crusty Demons are a gang of bikers who tour the world performing outrageous bike stunts and participating in all manner of crazy skits with motorized vehicles. In a pact with the Devil, they are offered immortality - the ability to crash time and time again, yet still live to walk away -The Crusty Demons are a gang of bikers who tour the world performing outrageous bike stunts and participating in all manner of crazy skits with motorized vehicles. In a pact with the Devil, they are offered immortality - the ability to crash time and time again, yet still live to walk away - at the cost of signing over their souls. Only by winning the 'damnation game' and entertaining Lucifer do they have a chance to win back their souls.… Expand"}, {"name": "Silver Chains", "details_link": "https://www.metacritic.com/game/pc/silver-chains", "publisher": "Headup Games", "release_date": "Aug  6 2019", "developers": ["Cracked Heads Games"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 51, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/8/2a05323e8f26ab13a526f94ac0993073-98.jpg", "descriptions": "Silver Chains is a first-person horror game with a strong emphasis on story and exploration. Search for clues within an old abandoned manor to unravel the truth about the terrible events which have happened."}, {"name": "Shiny", "details_link": "https://www.metacritic.com/game/pc/shiny", "publisher": "1C Entertainment", "release_date": "Aug 31 2016", "developers": ["Garage 227"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 51, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/a651daf225c10d40f5101ac3040d059e-98.jpg", "descriptions": "Shiny is set on a planet heading for its doom, where fleeing humans left behind their robot workers. Controlling the steps of Kramer 227, players must make every effort to save all of his robot friends while exploring action-packed levels and testing their platformer skills and reflexes. AShiny is set on a planet heading for its doom, where fleeing humans left behind their robot workers. Controlling the steps of Kramer 227, players must make every effort to save all of his robot friends while exploring action-packed levels and testing their platformer skills and reflexes. A vital part of the gameplay is managing Kramer’s energy and making use of power-ups along the way. Only a properly charged robot can make it to the end and save the remaining mechanical inhabitants of Aurora!… Expand"}, {"name": "Serious Sam Advance", "details_link": "https://www.metacritic.com/game/game-boy-advance/serious-sam-advance", "publisher": "Global Star Software", "release_date": "Apr 12 2004", "developers": ["Climax Group"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 51, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/6/04d07a3de8a5ab4e66acbfb161a90146-98.jpg", "descriptions": "The evil Mental is using time-travel technology to warp Ancient Egypt and Rome into his own wicked vision. Only one man has the guts to travel back in time to correct things one bullet at a time--Serious Sam. Now, all the madness from the Serious Sam series comes to the Game Boy Advance forThe evil Mental is using time-travel technology to warp Ancient Egypt and Rome into his own wicked vision. Only one man has the guts to travel back in time to correct things one bullet at a time--Serious Sam. Now, all the madness from the Serious Sam series comes to the Game Boy Advance for the first time with a new story, new levels, and new enemies. As Sam, you'll have an arsenal of 10 different weapons to help you take out not only Mental's minions, but also your friends in four-player deathmatch action. … Expand"}, {"name": "The Lord of the Rings: The Fellowship of the Ring", "details_link": "https://www.metacritic.com/game/game-boy-advance/the-lord-of-the-rings-the-fellowship-of-the-ring", "publisher": "Sierra Entertainment", "release_date": "Sep 25 2002", "developers": ["Pocket Studios"], "platforms": ["PC", "PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 51, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/a45c6ea3e1bdd239fb4b106929080c66-98.jpg", "descriptions": "J.R.R. Tolkien's Middle-earth is a land of beauty, magic, and darkness. In The Lord of the Rings: The Fellowship of the Ring, you follow Tolkien's narrative from the Shire to the halls of Moria, and finally to the banks of the River Anduin. Gameplay alternates between melee, archery,J.R.R. Tolkien's Middle-earth is a land of beauty, magic, and darkness. In The Lord of the Rings: The Fellowship of the Ring, you follow Tolkien's narrative from the Shire to the halls of Moria, and finally to the banks of the River Anduin. Gameplay alternates between melee, archery, sorcery, and stealth as you control Frodo, Gandalf, and Aragorn. Join this band of heroes in their quest to destroy the One Ring, which contains all the power of the dark lord Sauron.… Expand"}, {"name": "Jaws Unleashed", "details_link": "https://www.metacritic.com/game/xbox/jaws-unleashed", "publisher": "Majesco Games", "release_date": "May 23 2006", "developers": ["Appaloosa Interactive"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 51, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/6/cdf46a90432aa7632195f36c0e60969a-98.jpg", "descriptions": "Based on the successful 1975 film of the same name, Jaws lets you play as a great white shark who must defend his territory from underwater drillers. The game features locations from the movie and destructible underwater environments. Damage the surrounding vehicles, enemies, and structuresBased on the successful 1975 film of the same name, Jaws lets you play as a great white shark who must defend his territory from underwater drillers. The game features locations from the movie and destructible underwater environments. Damage the surrounding vehicles, enemies, and structures with your underwater and surface attacks. With \"shark vision,\" you can see your victims before they know you're coming. In addition to tearing apart your victims, you must solve puzzles, battle bosses, and overcome a variety of challenges. … Expand"}, {"name": "Daylight", "details_link": "https://www.metacritic.com/game/pc/daylight", "publisher": "Atlus", "release_date": "Apr 29 2014", "developers": ["Zombie Studios"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Horror", "Action Adventure", "Horror", "Survival"], "meta_score": 51, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/2/7af3a36fc6546d12259b6f6ccfbc2190-98.jpg", "descriptions": "Daylight introduces gamers to a procedurally generated world that replicates the horrifying nature of Daylight over and over again, but creates a different environment for each new game. Each time the player begins a new game, they experience a new world with new content and encounters; fromDaylight introduces gamers to a procedurally generated world that replicates the horrifying nature of Daylight over and over again, but creates a different environment for each new game. Each time the player begins a new game, they experience a new world with new content and encounters; from the layout of the building and the things they seek to the events they encounter, it is never the same experience twice.… Expand"}, {"name": "Spy Hunter: Nowhere to Run", "details_link": "https://www.metacritic.com/game/playstation-2/spy-hunter-nowhere-to-run", "publisher": "Midway", "release_date": "Sep  5 2006", "developers": ["Terminal Reality"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 51, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/7/f0c7c38e8b187b0a20bb858dcd775a1d-98.jpg", "descriptions": "SpyHunter: Nowhere to Run takes the Spy Hunter franchise where it's never gone before: on foot. Featuring action superstar Dwayne 'The Rock' Johnson as government super-spy extraordinaire Alex Decker, players for the first time ever can step out of the Interceptor and straight intoSpyHunter: Nowhere to Run takes the Spy Hunter franchise where it's never gone before: on foot. Featuring action superstar Dwayne 'The Rock' Johnson as government super-spy extraordinaire Alex Decker, players for the first time ever can step out of the Interceptor and straight into third-person action, utilizing The Rock's physical prowess by taking down enemies with intense melee combat moves. In Nowhere to Run, the evil NOSTRA corporation returns, this time with a plan to steal the latest government technology including the world's most sophisticated spy vehicle, the Interceptor, and it's up to Alex to stop them. [Midway]… Expand"}, {"name": "Restricted Area (2005)", "details_link": "https://www.metacritic.com/game/pc/restricted-area-2005", "publisher": "Whiptail Interactive", "release_date": "May 31 2005", "developers": ["Master Creating"], "platforms": "PC", "num_players": "2  Online", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 51, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/d9d05e518a6522bea47eaa1515f52f98-98.jpg", "descriptions": "Restricted Area catapults players into the year 2083 where, as a result of environmental pollution, most of the earth is covered by mutant inhabited wastelands and contaminated deserts. The global government is weak and mega-corporations have become a law unto themselves. Players begin theRestricted Area catapults players into the year 2083 where, as a result of environmental pollution, most of the earth is covered by mutant inhabited wastelands and contaminated deserts. The global government is weak and mega-corporations have become a law unto themselves. Players begin the game by choosing one of four totally unique characters. Their choice determines how the story will play out. Though an RPG at its core, Restricted Area places an emphasis on action thus translating into faster gameplay for the player. In addition to a challenging, story-driven single-player campaign that has been likened to a futuristic Diablo II, Restricted Area also boasts a robust cooperative multiplayer feature that enables players to team up and engage enemies together. [Whiptail Interactive]… Expand"}, {"name": "NanoBreaker", "details_link": "https://www.metacritic.com/game/playstation-2/nanobreaker", "publisher": "Konami", "release_date": "Feb 15 2005", "developers": ["KCET"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 51, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/43bd4a2e43662b8b0f71bf4c15620756-98.jpg", "descriptions": "Nanobreaker is a fast-paced 3D action game in which the main character wields a powerful, shape-shifting Plasma Blade to defend mankind from deadly nanomachines. Players will be able to slash through hordes of enemy units and grab them for offensive attacks. In Nanobreaker's futuristicNanobreaker is a fast-paced 3D action game in which the main character wields a powerful, shape-shifting Plasma Blade to defend mankind from deadly nanomachines. Players will be able to slash through hordes of enemy units and grab them for offensive attacks. In Nanobreaker's futuristic world, Nano technology was originally developed to enrich humankind, but the nanomachines suddenly went awry. The machines began to harvest the blood of humans and the iron of buildings in an effort to construct an army of monster machines. It's up to the player to combat this threat and save the world from apocalypse. [Action]… Expand"}, {"name": "Redout: Space Assault", "details_link": "https://www.metacritic.com/game/playstation-4/redout-space-assault", "publisher": "34BigThings", "release_date": "Jan 22 2021", "developers": ["34BigThings"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Space", "Combat"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/48a3109ab80edff933990038e9a0b1c8-98.jpg", "descriptions": "Redout: Space Assault is arcade space battle, coupling the trademark Redout adrenaline with the thrill of combat. Outsmart, outmanoeuvre, overpower, outclass your opponents in lightning-fast, adrenaline-inducing single-player space combat."}, {"name": "Extinction", "details_link": "https://www.metacritic.com/game/pc/extinction", "publisher": "Modus Games", "release_date": "Apr  9 2018", "developers": ["Iron Galaxy Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 51, "users_score": 2.2, "image": "https://static.metacritic.com/images/products/games/0/6300ba217477b84fe0052b2b051d807b-98.jpg", "descriptions": "You are one of the world’s last Sentinels, a soldier named Avil equipped with the skills to battle the endless wave of Ravenii. Fight massive brutes and their minions across a sprawling countryside, defending cities and rescuing refugees torn from their homes."}]