[{"name": "Crazy Taxi 2", "details_link": "https://www.metacritic.com/game/dreamcast/crazy-taxi-2", "publisher": "Sega", "release_date": "May 28 2001", "developers": ["Hitmaker"], "platforms": "Dreamcast", "genres": ["Driving", "Racing", "Arcade"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/3f90b6780d82af087fb888d116a5b67b-98.jpg", "descriptions": "The Crazy Taxi Cab Co. has set up shop in New York City, and the streets of the Big Apple will never be the same. Hop into your ride and scour the city for fares. Race against the clock for a big payoff!"}, {"name": "Fallout Tactics: Brotherhood of Steel", "details_link": "https://www.metacritic.com/game/pc/fallout-tactics-brotherhood-of-steel", "publisher": "Interplay", "release_date": "Mar 14 2001", "developers": ["14 Degrees East"], "platforms": "PC", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/ecca4da4743363d718bdb8070e1f412c-98.jpg", "descriptions": "This latest entry in the post-nuclear \"Fallout\" series is not the third chronological installment, but rather a spin-off that takes place between the first two episodes and which shifts the focus of the series from its original RPG, story-based roots in favor of strategic, tactical,This latest entry in the post-nuclear \"Fallout\" series is not the third chronological installment, but rather a spin-off that takes place between the first two episodes and which shifts the focus of the series from its original RPG, story-based roots in favor of strategic, tactical, squad-based combat.… Expand"}, {"name": "Ogre Battle 64", "details_link": "https://www.metacritic.com/game/nintendo-64/ogre-battle-64", "publisher": "Atlus Co.", "release_date": "Oct  7 2000", "developers": ["Quest"], "platforms": "Nintendo 64", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy"], "meta_score": 82, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "The Holy Lodis Empire is planning the domination of the entire continent of Zeteginia! It is up to you to raise the flag of revolution and rid the land of the Lodis threat. Make decisions in real-time and take control of numerous characters to prove victorious on the battlefield and regainThe Holy Lodis Empire is planning the domination of the entire continent of Zeteginia! It is up to you to raise the flag of revolution and rid the land of the Lodis threat. Make decisions in real-time and take control of numerous characters to prove victorious on the battlefield and regain freedom for all people!… Expand"}, {"name": "Sonic Rush", "details_link": "https://www.metacritic.com/game/ds/sonic-rush", "publisher": "Sega", "release_date": "Nov 15 2005", "developers": ["Dimps Corporation", "Sonic Team"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/0c93b8f88d2b7cde4e3df7870933298d-98.jpg", "descriptions": "Everyone's favorite blue dude with 'tude, Sonic the Hedgehog, blasts his way onto the Nintendo DS and takes high-speed action gaming to a new level...literally! Sonic pairs up with royalty - Queen, Blaze the Cat - from another dimension to save the universe from utter destruction. Sonic RushEveryone's favorite blue dude with 'tude, Sonic the Hedgehog, blasts his way onto the Nintendo DS and takes high-speed action gaming to a new level...literally! Sonic pairs up with royalty - Queen, Blaze the Cat - from another dimension to save the universe from utter destruction. Sonic Rush takes full advantage of the dual screens on the Nintendo DS system to deliver a frenetic adventure with dizzying dives, near vertical curves, extreme jumps, brain-twisting loops and more. [Sega]… Expand"}, {"name": "Spyro Reignited Trilogy", "details_link": "https://www.metacritic.com/game/playstation-4/spyro-reignited-trilogy", "publisher": "Activision", "release_date": "Nov 13 2018", "developers": ["Activision", "Toys for Bob"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/53ad306b6a254f5d4374b079f9795f3b-98.jpg", "descriptions": "The original roast master is back. Same sick burns, same smoldering attitude, now all scaled up in stunning HD. Spyro is bringing the heat like never before in the Spyro Reignited Trilogy game collection. Rekindle the fire with the original three games, Spyro the Dragon, Spyro 2: Ripto'sThe original roast master is back. Same sick burns, same smoldering attitude, now all scaled up in stunning HD. Spyro is bringing the heat like never before in the Spyro Reignited Trilogy game collection. Rekindle the fire with the original three games, Spyro the Dragon, Spyro 2: Ripto's Rage! and Spyro: Year of the Dragon. Explore the expansive realms, re-encounter the fiery personalities and relive the adventure in fully remastered glory. Because when there's a realm that needs saving, there's only one dragon to call.… Expand"}, {"name": "Need for Speed: Underground 2", "details_link": "https://www.metacritic.com/game/pc/need-for-speed-underground-2", "publisher": "Electronic Arts", "release_date": "Nov  9 2004", "developers": ["EA Canada"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/d5bdaf60986ab63ef747a562a5e3ec76-98.jpg", "descriptions": "Need for Speed Underground 2 challenges gamers to immerse themselves in the tuner culture, exploring an expansive, free-roaming city divided into five distinct neighborhoods. Gamers encounter rival racers who initiate events, tip players off to the hottest racing spots, and show them whereNeed for Speed Underground 2 challenges gamers to immerse themselves in the tuner culture, exploring an expansive, free-roaming city divided into five distinct neighborhoods. Gamers encounter rival racers who initiate events, tip players off to the hottest racing spots, and show them where to buy the most sought-after licensed aftermarket upgrades. The game features new game modes, deep new performance customization and tuning, and more than 30 licensed cars. The game also delivers twice the visual customization upgrades as the original game, providing a staggering 70 billion possible car combinations for total automotive self-expression. [Electronic Arts]… Expand"}, {"name": "Thief: Deadly Shadows", "details_link": "https://www.metacritic.com/game/xbox/thief-deadly-shadows", "publisher": "Eidos Interactive", "release_date": "May 25 2004", "developers": ["Ion Storm"], "platforms": ["PC", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/af1f12de678dd677d08ce3191ba8394f-98.jpg", "descriptions": "You are Garret, the master thief who's rarely seen and never caught. In the effort to stop the Dark Age from coming, you must steal the City's oldest treasures. The path to these treasures requires you to sneak past guards, pick locks, and break into secured residences. It's best to avoidYou are Garret, the master thief who's rarely seen and never caught. In the effort to stop the Dark Age from coming, you must steal the City's oldest treasures. The path to these treasures requires you to sneak past guards, pick locks, and break into secured residences. It's best to avoid the armed guards, hired muscle, angry thugs, and hideous monsters that populate the streets. You'll have many thief tools to help you skulk around the shadows; in case that doesn't work, you'll have plenty of weapons to defend yourself.… Expand"}, {"name": "Horace", "details_link": "https://www.metacritic.com/game/switch/horace", "publisher": "505 Games", "release_date": "Oct 21 2020", "developers": ["Paul Helman"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/e056f6747ab90128668d437d30e136f5-98.jpg", "descriptions": "An tale of a small robot on a big adventure. This title from Paul Helman and Sean Scapelhorn is a classic platformer that tells an emotional and surprisingly rich tale of self-discovery peppered with nostalgic popular culture references that will bring a smile to any gamer who enjoys the 8An tale of a small robot on a big adventure. This title from Paul Helman and Sean Scapelhorn is a classic platformer that tells an emotional and surprisingly rich tale of self-discovery peppered with nostalgic popular culture references that will bring a smile to any gamer who enjoys the 8 and 16 bit era. Made by just two people, Horace offers over 15 hours of exciting platforming and pushes the boundaries of the genre with profound storytelling and quirky and nostalgic pop culture references! A game made by videogame lovers for videogame lovers!\r • “Horace really could be one of the most charming games of the year.” Eurogamer\r• “A real contender for Indie Game of the Year.” The Sixth Axis\r• “A frankly gorgeous-looking pixel art platform adventure game” Kotaku UK\r• 9/10 \"\"Might very well be the best platformer of 2019\"\" Cub3d\r• “Horace’s heartwarming narrative pushes you through the hardcore gameplay, and the high quality aesthetic and music burns themselves into your brain” Escapist Magazine\r• 9/10 “Definitely one of the best Indie titles I have played this year” Demon Gaming\r• 9.5/10 “This is one of the best games of 2019 and one of the best independent games I have ever played” Way too many games\r• 8.5/10 \"\"Manages to offer his own personal reading of the platform genre, surprisingly walking the streets of narration\"\" Multiplayer.it\r Adventure through hours and hours of varied gameplay, dubbed by many as Indie GOTY 2019! Overcome 2D platforming challenges with a unique twist, unlock new metroidvania inspired robot abilities, enjoy plenty of retro-inspired mini games and reunite Horace with his family.\r… Expand"}, {"name": "Pinball Hall of Fame: The Williams Collection", "details_link": "https://www.metacritic.com/game/wii/pinball-hall-of-fame-the-williams-collection", "publisher": "Crave", "release_date": "Feb 26 2008", "developers": ["Farsight Studios"], "platforms": ["3DS", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/f32aa6d05b5847c26db2819cc28ebc5d-98.jpg", "descriptions": "Pinball Hall of Fame: The Williams Collection faithfully recreates eight of the most memorable tables from the golden age of pinball in photorealistic 3D. Working closely with Williams to ensure authenticity of each of the games, the collection is highlighted by some of the most popular andPinball Hall of Fame: The Williams Collection faithfully recreates eight of the most memorable tables from the golden age of pinball in photorealistic 3D. Working closely with Williams to ensure authenticity of each of the games, the collection is highlighted by some of the most popular and innovative Williams pinball tables, including Gorgar, the first-ever talking pinball machine, Black Knight, which introduced \"Magna-Save\" and Bonus Ball, and Space Shuttle, which took the pinball industry by storm in 1984. Every table has been meticulously recreated to bring players the visuals, sound effects and gameplay that made these games legendary successes. Pinball Hall of Fame: The Williams Collection harkens back to the arcades of the 1980s. Players begin Pinball Hall of Fame: The Williams Collection with access to four pinball tables, and the remaining four tables are unlocked as the game progresses. Players can spend as little as two minutes on a quick pinball challenge, or delve deeper into the game, gaining rewards in a token-based system as they unlock each of the pinball tables. Single-player Arcade and Challenge modes provide hours of solo entertainment, and a Multiplayer mode lets players face each other head-on. [Crave Entertainment]… Expand"}, {"name": "Art of Balance Touch!", "details_link": "https://www.metacritic.com/game/3ds/art-of-balance-touch!", "publisher": "Shin'en", "release_date": "Jun  7 2012", "developers": ["Shin'en"], "platforms": ["PlayStation 4", "Switch", "Wii U", "3DS"], "genres": ["Miscellaneous", "Puzzle", "General", "Puzzle", "General"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/9c750edebfb9c00de1fcedec4a60363c-98.jpg", "descriptions": "Grab your stylus and build a balanced stack in this physics-based puzzler!\r Puzzle games must be addictive. This was our top priority during the development of the game. That's why we designed 200 levels that not only challenge your skills but also your imagination. With its perfect touchGrab your stylus and build a balanced stack in this physics-based puzzler!\r Puzzle games must be addictive. This was our top priority during the development of the game. That's why we designed 200 levels that not only challenge your skills but also your imagination. With its perfect touch controls Art of Balance TOUCH! is easy to pick up and hard to put away.\r Seeking a real challenge? Then try out the new endurance mode and drive your score ever higher.\r Art of Balance TOUCH! brings the ultimate just one more puzzle experience to your Nintendo 3DS.\r Master 200 levels\rDiscover 8 unique worlds\rPlay with your Stylus or with the SlidePad… Expand"}, {"name": "NHL Eastside Hockey Manager 2005", "details_link": "https://www.metacritic.com/game/pc/nhl-eastside-hockey-manager-2005", "publisher": "Sega", "release_date": "Oct  5 2005", "developers": ["Sports Interactive"], "platforms": "PC", "num_players": "1 Player", "genres": ["Sports", "Traditional", "Team", "Ice Hockey", "Management", "Sim"], "meta_score": 82, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/5/665ebf95e1358d7d64f51002fba1f39c-98.jpg", "descriptions": "Enter the world of professional Ice Hockey... Sports Interactive style. Selecting your team from more than 20 leagues around the globe, including the vaunted NHL, you'll strive to become the greatest hockey manager of all time. Build a dynasty for the future as you scout, draft and sign upEnter the world of professional Ice Hockey... Sports Interactive style. Selecting your team from more than 20 leagues around the globe, including the vaunted NHL, you'll strive to become the greatest hockey manager of all time. Build a dynasty for the future as you scout, draft and sign up new talent. You'll also need to enter negotiations to trade players and strengthen your squad. Once you've assembled a winning combination it's time to select tactics and lead your team to victory.  wealth of choice, with more than 20 playable leagues from all over the world. A comprehensive database of over 3,000 real teams offering incredible depth. In excess of 32,000 players and members of staff. Updated rules and competition regulations. [Sega Europe]… Expand"}, {"name": "Legend of Grimrock", "details_link": "https://www.metacritic.com/game/pc/legend-of-grimrock", "publisher": "Almost Human", "release_date": "Apr 11 2012", "developers": ["Almost Human"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/a3b98af5de9f49a4a205beeb07521507-98.jpg", "descriptions": "Legend of Grimrock is a dungeon crawling game inspired by oldschool classics of the genre while still bringing its own twists to the game. The game features survival, combat, magic, puzzles and role-playing elements. The player is a prisoner sentenced to death and exiled to the secludedLegend of Grimrock is a dungeon crawling game inspired by oldschool classics of the genre while still bringing its own twists to the game. The game features survival, combat, magic, puzzles and role-playing elements. The player is a prisoner sentenced to death and exiled to the secluded Mount Grimrock for vile crimes he may or may not have committed. Unbeknownst to his captivators, the mountain is riddled with ancient tunnels and dungeons. The player's mission is to form a team and escape by descending through the mountain, level by level. During the journey the player encounters mysterious puzzles, deadly traps, ancient tombs and horrible monsters left behind by crumbled civilizations long perished now. Find out more at http://www.grimrock.net… Expand"}, {"name": "DiRT Rally 2.0", "details_link": "https://www.metacritic.com/game/xbox-one/dirt-rally-20", "publisher": "Codemasters", "release_date": "Feb 26 2019", "developers": ["Codemasters"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/2fd0baff76e4e40d7419735dbe1a59e8-98.jpg", "descriptions": "DiRT Rally 2.0 dares you to carve your way through a selection of iconic rally locations from across the globe, in the most powerful off-road vehicles ever made, knowing that the smallest mistake could end your stage. You will need to rely on your instincts with the most immersive and trulyDiRT Rally 2.0 dares you to carve your way through a selection of iconic rally locations from across the globe, in the most powerful off-road vehicles ever made, knowing that the smallest mistake could end your stage. You will need to rely on your instincts with the most immersive and truly focused off-road experience yet, including a new authentic handling model, tyre choice and surface deformation.Power your rally car through real-life off-road environments in New Zealand, Argentina, Spain, Poland, Australia and the USA, with only your co-driver and instincts to guide you. Race on eight official circuits from the FIA World Rallycross championship, complete with licensed Supercars and support series. Develop your team and cars around race strategies, and progress through a varied selection of Events and Championships in both a single player Career Campaign and a competitive online environment.… Expand"}, {"name": "World of Warcraft: Dragonflight", "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-dragonflight", "publisher": "Activision", "release_date": "Nov 28 2022", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 82, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/7/fa0fb4b8dcf11ba1a47eb73dd2c2496e-98.jpg", "descriptions": "The dragonflights of Azeroth have returned, called upon to defend their ancestral home, the Dragon Isles. Surging with elemental magic and the life energies of Azeroth, the Isles are awakening once more, and it's up to you to explore their primordial wonder and discover long-forgotten secrets."}, {"name": "Capcom Fighting Collection", "details_link": "https://www.metacritic.com/game/xbox-one/capcom-fighting-collection", "publisher": "Capcom", "release_date": "Jun 24 2022", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Up to 9 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 4.1, "image": "https://static.metacritic.com/images/products/games/3/3bb28a8f669fcfb7a0d87e8ae3361cfb-98.jpg", "descriptions": "Features 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, andFeatures 10 classic titles, including two Darkstalkers games never before released in North America! Take on all challengers in online play with rollback netcode for all ten games, and enjoy additional features including a gallery of official art, a music player with hundreds of tracks, and more:\r Darkstalkers: The Night Warriors\r  Night Warriors: Darkstalkers’ Revenge\r  Vampire Savior: The Lord of Vampire\r  Vampire Hunter 2: Darkstalkers’ Revenge (Japanese version, first official release in North America)\r  Vampire Savior 2: The Lord of Vampire (Japanese version, first official release in North America)\r  Red Earth (First release outside of arcades)\r  Cyberbots: Fullmetal Madness\r  Super Gem Fighter Mini Mix\r  Super Puzzle Fighter II Turbo\r  Hyper Street Fighter II… Expand"}, {"name": "Archvale", "details_link": "https://www.metacritic.com/game/pc/archvale", "publisher": "Humble Games", "release_date": "Dec  2 2021", "developers": ["idoz & phops"], "platforms": ["Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/8/edaeccb919d0552c28bca32feef86bce-98.jpg", "descriptions": "Take up your weapon in this RPG bullet-hell world and embark on a journey to right wrongs from long ago. Only you can defeat the evil forces of the Undying guardians and reunite the world with the fabled Archvale."}, {"name": "Animal Crossing: New Horizons - Happy Home Paradise", "details_link": "https://www.metacritic.com/game/switch/animal-crossing-new-horizons---happy-home-paradise", "publisher": "Nintendo", "release_date": "Nov  5 2021", "developers": ["Nintendo"], "platforms": "Switch", "genres": ["Simulation", "Virtual", "Virtual Life"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/61eeba74c83718d9ef8f5cc774078976-98.jpg", "descriptions": "Expand your horizons with DLC and help create vacation homes for clients on resort islands. Clients with different dream vacation requests will visit a new resort area located in an archipelago, made up of several different islands, where the Paradise Planning team is located. You can talkExpand your horizons with DLC and help create vacation homes for clients on resort islands. Clients with different dream vacation requests will visit a new resort area located in an archipelago, made up of several different islands, where the Paradise Planning team is located. You can talk to a client and find out the details of their requests for a vacation home, and then make their dreams happen.… Expand"}, {"name": "Knockout City", "details_link": "https://www.metacritic.com/game/xbox-series-x/knockout-city", "publisher": "Electronic Arts", "release_date": "May 21 2021", "developers": ["Electronic Arts"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Other"], "meta_score": 82, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/6f3afc0c006469c17087ebb3494ece37-98.jpg", "descriptions": "CALLING ALL BRAWLERS.Team up and duke it out with rival Crews in Knockout City, where EPIC DODGEBALL BATTLES settle the score in team-based multiplayer matches. Throw, catch, pass, dodge, and tackle your way to dodgeball dominance!"}, {"name": "Borderlands Legendary Collection", "details_link": "https://www.metacritic.com/game/switch/borderlands-legendary-collection", "publisher": "2K Games", "release_date": "May 29 2020", "developers": ["Gearbox Publishing", "Turn Me Up Games"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/9f61bad844829d8315230966f94df1a2-98.jpg", "descriptions": "Get three times the mayhem, three times the loot, and three times the action with the Borderlands Legendary Collection! Kill bandits and beasts, collect powerful weaponry, and maybe even save the universe in Borderlands: Game of the Year Edition, Borderlands 2, and Borderlands: TheGet three times the mayhem, three times the loot, and three times the action with the Borderlands Legendary Collection! Kill bandits and beasts, collect powerful weaponry, and maybe even save the universe in Borderlands: Game of the Year Edition, Borderlands 2, and Borderlands: The Pre-Sequel, along with piles of bonus add-on content for each game, adding 100+ hours of gameplay at an incredible value.\r * Enjoy all three games solo or cooperatively with local two-player split-screen or four-player online play\r * Borderlands: Game of the Year Edition - Discover the co-op shooter-looter that started it all, crammed with content and enhancements! Equip bazillions of guns as one of four trigger-happy mercenaries, each with unique RPG skills. Take on the lawless desolate planet Pandora in pursuit of powerful alien technology rumored to be inside an ancient Vault.\r * Borderlands 2 - Play as one of six vault hunters attempting to liberate Pandora from evil mastermind and corporate CEO Handsome Jack. Make new friends, arm them with a bazillion weapons and fight alongside them in a relentless quest for revenge and redemption.\r * Borderlands: The Pre-Sequel - Discover the story behind Borderlands 2 villain, Handsome Jack, and his rise to power. Set between the events of Borderlands and Borderlands 2, The Pre-Sequel gives you a whole lotta new gameplay and features the genre-blending fusion of shooter and RPG mechanics that players have come to love. \r\rThe Borderlands Legendary Collection versions of Borderlands: Game of the Year Edition, Borderlands 2, and Borderlands: The Pre-Sequel come complete with loads of extra content, including the following major add-ons:\r Borderlands: Game of the Year Edition\r- The Zombie Island of Dr. Ned\r- Mad Moxxi's Underdome Riot\r- The Secret Armory of General Knoxx\r- Claptrap's New Robot Revolution\r Borderlands 2\r- Captain Scarlett and Her Pirate's Booty\r- Mr. Torgue's Campaign of Carnage\r- Sir Hammerlock's Big Game Hunt\r- Tiny Tina's Assault on Dragon Keep\r- Mechromancer Pack (play as Gaige)\r- Psycho Pack (play as Krieg)\r Borderlands: The Pre-Sequel\r- Claptastic Voyage\r- The Holodome Onslaught\r- Baroness Pack (play as Aurelia)\r- Handsome Jack Doppelganger Pack (play as \"Jack\")… Expand"}, {"name": "Devil May Cry 3: Special Edition", "details_link": "https://www.metacritic.com/game/switch/devil-may-cry-3-special-edition", "publisher": "Capcom", "release_date": "Feb 20 2020", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 2", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/9a29f6103cca84b92fedaf3f3557cf65-98.jpg", "descriptions": "Set before the original Devil May Cry, Devil May Cry 3: Special Edition follows Dante's journey as he battles his evil twin brother in a final confrontation. Along the way, you'll encounter both formidable foes and unusual characters. When attacking, you can choose to use short-range,Set before the original Devil May Cry, Devil May Cry 3: Special Edition follows Dante's journey as he battles his evil twin brother in a final confrontation. Along the way, you'll encounter both formidable foes and unusual characters. When attacking, you can choose to use short-range, long-range, defensive, or evasive play styles. Each system has its own set of gameplay features, and you can choose to power up your favorite style for increased special attack abilities. The Special Edition adds the ability to play as Dante's nemesis Virgil and a survival game mode.… Expand"}, {"name": "Super Hydorah", "details_link": "https://www.metacritic.com/game/pc/super-hydorah", "publisher": "Abylight", "release_date": "Sep 20 2017", "developers": ["Locomalito"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PC"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/4/c2616d44425cc1b8c19ee81c1005e7bb-98.jpg", "descriptions": "Super Hydorah is a nonlinear horizontal shoot em up designed to offer a challenging and memorable experience, sublimating the wisdom and richness of traditional shmup classics. The game has direct action, nostalgic art and a wide variety of unique spatial content and situations. It is hoursSuper Hydorah is a nonlinear horizontal shoot em up designed to offer a challenging and memorable experience, sublimating the wisdom and richness of traditional shmup classics. The game has direct action, nostalgic art and a wide variety of unique spatial content and situations. It is hours of intense fun, alone or with your friends, to face the menace of the Meroptians aboard the Delta Lance.… Expand"}, {"name": "Little Nightmares II", "details_link": "https://www.metacritic.com/game/playstation-4/little-nightmares-ii", "publisher": "Bandai Namco Games", "release_date": "Feb 11 2021", "developers": ["Tarsier Studios"], "platforms": ["PC", "PlayStation 5", "Stadia", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Linear"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/3/26ee07ee97a4e636fafa5a16153f1543-98.jpg", "descriptions": "Little Nightmares II is a suspense-adventure game in which you play as Mono, a young boy trapped in a world that has been distorted by a mysterious transmission from a distant signal tower. With Six, the girl in a yellow raincoat, Mono sets out to discover the dark secrets of The SignalLittle Nightmares II is a suspense-adventure game in which you play as Mono, a young boy trapped in a world that has been distorted by a mysterious transmission from a distant signal tower. With Six, the girl in a yellow raincoat, Mono sets out to discover the dark secrets of The Signal Tower and save Six from her terrible fate; but their journey will not be easy as Mono and Six will face an array of new threats from the terrible residents of this world. Will you dare face this collection of new, little nightmares? PLAY A DARK, THRILLING, SUSPENSE ADVENTURE: A host of brand-new residents lie in wait to haunt your steps and disturb your sleep. Outsmart the sadistic teacher, survive the bloodthirsty hunter and flee from many more terrifying characters, as Mono and Six journey through this world together. DISCOVER A FANTASTICAL WORLD CORRUPTED BY THE SIGNAL TOWER: Escape a world that’s rotten from the inside. Your journey will take you from creepy woodlands to sinister schools on your way to the dreadful Signal Tower. Find the source of the evil that spreads through the TV screens of the world. AWAKEN YOUR INNER CHILD TO SAVE SIX FROM THE DARKNESS: Six is fading from this world, and her only hope is to journey with Mono to find what has afflicted her from the Signal Tower. In this world of unknown terrors, you are her only beacon of hope. Can you gather up the courage to fend off your tormenters, and work with Six to make sense of The Signal Tower? … Expand"}, {"name": "Control", "details_link": "https://www.metacritic.com/game/playstation-4/control", "publisher": "505 Games", "release_date": "Aug 27 2019", "developers": ["Remedy Entertainment"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/9/d3f90acdb2a39546c5ea8e16038f75a6-98.jpg", "descriptions": "After a secretive agency in New York is invaded by an otherworldly threat, you become the new Director struggling to regain Control in this supernatural 3rd person action-adventure from Remedy Entertainment and 505 Games"}, {"name": "College Hoops 2K6", "details_link": "https://www.metacritic.com/game/xbox/college-hoops-2k6", "publisher": "2K Sports", "release_date": "Nov 21 2005", "developers": ["2K Sports"], "platforms": ["PlayStation 2", "Xbox 360", "Xbox"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/1a83aaf1971dc897f68abf4d1e69fa8a-98.jpg", "descriptions": "College Hoops 2K6 is the latest entry in the 2K series of NCAA basketball simulations. New to the game this year is the Coach's Clipboard feature, which lets you instantly change your tactics during the game. Recruiting has also been changed with the addition of recruiting camps. Coaching isCollege Hoops 2K6 is the latest entry in the 2K series of NCAA basketball simulations. New to the game this year is the Coach's Clipboard feature, which lets you instantly change your tactics during the game. Recruiting has also been changed with the addition of recruiting camps. Coaching is the main focus of the changes, with real coaches having been added in. Also, teamwork and focus have been made more vital to team success. All other game modes from past iterations of the series have been included.… Expand"}, {"name": "LEGO Star Wars: The Skywalker Saga", "details_link": "https://www.metacritic.com/game/xbox-series-x/lego-star-wars-the-skywalker-saga", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Apr  5 2022", "developers": ["Warner Bros. Interactive Entertainment", "TT Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/95f24107f3cac9e195695e84078fe2f3-98.jpg", "descriptions": "LEGO Star Wars: The Skywalker Saga will feature hundreds of playable characters - the most ever for a LEGO Star Wars game - and ships, LEGO's signature sense of humour and fun, and new innovations, options, and gameplay features. Players can start the game at any point in the Star WarsLEGO Star Wars: The Skywalker Saga will feature hundreds of playable characters - the most ever for a LEGO Star Wars game - and ships, LEGO's signature sense of humour and fun, and new innovations, options, and gameplay features. Players can start the game at any point in the Star Wars timeline; fans can jump in with Star Wars: The Phantom Menace, begin the original trilogy with Star Wars: A New Hope, or launch right into Star Wars: The Rise of Skywalker.\r LEGO Star Wars: The Skywalker Saga marks the return to the franchise that kicked off the LEGO video game series. The game will give fans an all-new LEGO Star Wars experience with complete freedom to explore the LEGO Star Wars galaxy. With the Skywalker saga coming to an end, LEGO Star Wars: The Skywalker Saga will bring to life all those Star Wars adventures remembered and undiscovered in an epic culmination of all nine saga films as fans celebrate the closing of this chapter in Star Wars.… Expand"}, {"name": "Final Fantasy V Pixel Remaster", "details_link": "https://www.metacritic.com/game/pc/final-fantasy-v-pixel-remaster", "publisher": "Square Enix", "release_date": "Nov 10 2021", "developers": ["Square Enix", "TOSE"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/0ce30bf36bd2921f70f19d7220e499b0-98.jpg", "descriptions": "The world of FINAL FANTASY V is on the verge of destruction because the elemental crystals that bring life and prosperity to the lands have lost their power.The only hope lies in four heroes: Bartz, Princess Lenna of Castle Tycoon, pirate Faris and the mysterious Galuf. Driven together byThe world of FINAL FANTASY V is on the verge of destruction because the elemental crystals that bring life and prosperity to the lands have lost their power.The only hope lies in four heroes: Bartz, Princess Lenna of Castle Tycoon, pirate Faris and the mysterious Galuf. Driven together by fate, they set off on a quest that to save the planet itself.As well as refining the ATB system, FINAL FANTASY V expands your strategic options massively through a greatly expanded job system, which let you customize your characters with 22 different jobs.… Expand"}, {"name": "Life is Strange 2: Episode 4 - Faith", "details_link": "https://www.metacritic.com/game/pc/life-is-strange-2-episode-4---faith", "publisher": "Square Enix", "release_date": "Aug 22 2019", "developers": ["DONTNOD Entertainment"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "3D", "Third-Person"], "meta_score": 82, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/6c4ad4b8e409af11320a24ea46da2bf8-98.jpg", "descriptions": "The saga picks up in a Humboldt County, California hospital room where Sean, gravely wounded, wakes up to find that Daniel is still missing. Under arrest, and facing tough questions from law enforcement, Sean is running out of options. Only quick thinking and unexpected allies can secure hisThe saga picks up in a Humboldt County, California hospital room where Sean, gravely wounded, wakes up to find that Daniel is still missing. Under arrest, and facing tough questions from law enforcement, Sean is running out of options. Only quick thinking and unexpected allies can secure his freedom. “In Episode 4, we re-join Sean at his lowest point. The disaster that separated him from his brother has scarred him for life, and he is lost, alone and in quite a bit of trouble,” said Michel Koch & Raoul Barbet, Co-Creative Directors of Life is Strange 2. “Sean is already at a breaking point, and now faces some of the toughest situations in his life as he desperately searches for Daniel, whose absence hangs heavy over the whole episode. Considering what happened in that California Redwood forest, even if he can locate his brother – he can’t be sure of who, or what he will find.” Searching for Daniel under the scorching Nevada sun and through freezing desert nights, Sean must make his toughest choices yet. Puerto Lobos and the dream of freedom have never felt so far away. Will Sean’s faith in Daniel be rewarded – or is the younger wolf lost forever?… Expand"}, {"name": "Marvel vs. Capcom 2", "details_link": "https://www.metacritic.com/game/xbox-360/marvel-vs-capcom-2", "publisher": "Capcom", "release_date": "Jul 29 2009", "developers": ["Backbone Entertainment"], "platforms": ["iPhone/iPad", "PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "2  Online", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/c22546885e7d7aa84d19d1a5188a36f6-98.jpg", "descriptions": "[Xbox Live Arcade]  MARVEL VS. CAPCOM 2 brings legendary characters from throughout Marvel and Capcom history to duke it out in an insane tag-team fighting experience. From Ryu to Wolverine, pit your favorite heroes in dream match-ups thanks to an unprecedented 56-character roster. With all[Xbox Live Arcade]  MARVEL VS. CAPCOM 2 brings legendary characters from throughout Marvel and Capcom history to duke it out in an insane tag-team fighting experience. From Ryu to Wolverine, pit your favorite heroes in dream match-ups thanks to an unprecedented 56-character roster. With all new online play, take the fight across the globe and decide who really has the best \"dream team.\" Widescreen support, enhanced HD graphics, and a robust leaderboard makes one of the best fighting games even better! Unique fighting: Try 3-on-3 tag-team matches, and the new online matching mode, including the \"Quarter Match\" mode from Super Street Fighter II Turbo HD Remix. Accessibility: Four button controls introduce new players to the joy of fighting games. New visuals: The new optional visual filter smoothes out the game's graphics. [Capcom]… Expand"}, {"name": "Dominions 3: The Awakening", "details_link": "https://www.metacritic.com/game/pc/dominions-3-the-awakening", "publisher": "Shrapnel Games", "release_date": "Sep 29 2006", "developers": ["Illwinter Design Group"], "platforms": "PC", "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/7063a882da818fb7aa0c0b045788fd42-98.jpg", "descriptions": "Dominions 3: The Awakening, is the follow up to the acclaimed fantasy strategy game, Dominions 2: The Ascension Wars. While that game set the bar for rich, engrossing turn-based fantasy strategy gaming, Dominions 3: The Awakening seeks to raise it once more. Leading one of over fiftyDominions 3: The Awakening, is the follow up to the acclaimed fantasy strategy game, Dominions 2: The Ascension Wars. While that game set the bar for rich, engrossing turn-based fantasy strategy gaming, Dominions 3: The Awakening seeks to raise it once more. Leading one of over fifty possible nations in three different Ages, it is your goal to ascend to true godhood using all the power at your disposal. In a world of magic and steel the options to attain victory are as numerous as the cries of mercy from your vanquished foes. Whether you use military might, eldritch power, or subterfuge (or more likely, a combination of all three) every turn is about options. Recruit troops (more than 1500 units found in the game), assassinate the enemy, scout territory, research magic (600+ spells and 300+ magic items), perform rituals, do a blood hunt, storm a castle, construct, pray, forge - the list goes on. [Shrapnel Games]… Expand"}, {"name": "eFootball PES 2020", "details_link": "https://www.metacritic.com/game/playstation-4/efootball-pes-2020", "publisher": "Konami", "release_date": "Sep 10 2019", "developers": ["Konami"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/4c52476c7ac6f7dc10a370aca3bf5114-98.jpg", "descriptions": "Experience realism and authenticity in this year's definitive football game: PES 2020.  GAMEPLAY: New dynamic dribbling skills, new first touch techniques and finely-tuned ball physics, all developed in close consultation with renowned midfielder Andrés Iniesta. MATCHDAY: Pick a side andExperience realism and authenticity in this year's definitive football game: PES 2020.  GAMEPLAY: New dynamic dribbling skills, new first touch techniques and finely-tuned ball physics, all developed in close consultation with renowned midfielder Andrés Iniesta. MATCHDAY: Pick a side and join forces with newcomers and veterans alike in a grand struggle for dominance in this new online competitive mode. MASTER LEAGUE: A completely revamped ML experience awaits — featuring a new interactive dialogue system, an overhauled menu design and a more realistic transfer market realized through improved data integration.\r … Expand"}, {"name": "NyxQuest: Kindred Spirits", "details_link": "https://www.metacritic.com/game/wii/nyxquest-kindred-spirits", "publisher": "Over the Top Games", "release_date": "Aug 10 2009", "developers": ["Over the Top Games"], "platforms": ["iPhone/iPad", "PC", "Wii"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/28fec4bcc81adc80cc15878733b05d59-98.jpg", "descriptions": "[WiiWare; also known as \"Icarian: Kindred Spirits\"]  Experience the awesome story of Nyx, an enigmatic winged girl who must descend from heaven in search of her missing friend, Icarus. Fly over the ruins of ancient Greece and avoid falling into blazing sands or perishing in the claws of[WiiWare; also known as \"Icarian: Kindred Spirits\"]  Experience the awesome story of Nyx, an enigmatic winged girl who must descend from heaven in search of her missing friend, Icarus. Fly over the ruins of ancient Greece and avoid falling into blazing sands or perishing in the claws of cruel harpies and hydras. You will need the help of Zeus and other benevolent gods from Olympus to summon their powers. They will let you cast rays, modify the scenery and control winds as you wish. By making your own wrist movements and pointing to the game screen, you will be able to achieve these and many other feats. Fly, aim and shoot using your Wii Remote™ controller. Play with a friend and maximize your abilities: While one controls Nyx, the other will control the powers from the gods. [Nintendo]… Expand"}, {"name": "Dishonored: Death of the Outsider", "details_link": "https://www.metacritic.com/game/playstation-4/dishonored-death-of-the-outsider", "publisher": "Bethesda Softworks", "release_date": "Sep 15 2017", "developers": ["Arkane Studios"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/9609df3c8b95527380a2ced28f51d782-98.jpg", "descriptions": "Take on the role of Billie Lurk (aka Megan Foster), once one of Dunwall's most notorious killers-for-hire. Reunited with your old mentor, the legendary assassin Daud, you undertake the greatest assassination ever conceived: killing the Outsider, a god-like figure whom Billie and Daud see asTake on the role of Billie Lurk (aka Megan Foster), once one of Dunwall's most notorious killers-for-hire. Reunited with your old mentor, the legendary assassin Daud, you undertake the greatest assassination ever conceived: killing the Outsider, a god-like figure whom Billie and Daud see as instrumental to some of the Empire's most dishonorable moments. As you venture deep into the grimiest corners of Karnaca to uncover the mystery of the Outsider and his origins, you will face deadly opposition, ancient powers, and difficult decisions that will forever change the world around you.… Expand"}, {"name": "Streets of Rage 4", "details_link": "https://www.metacritic.com/game/playstation-4/streets-of-rage-4", "publisher": "DotEmu", "release_date": "Apr 30 2020", "developers": ["Seaven Studio", "Guard Crush Games", "Lizardcube"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/68f8f182d7ce597375d3c50d182e0e16-98.jpg", "descriptions": "Publisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves andPublisher Dotemu (Wonder Boy, Windjammers 1/2) and developers Lizardcube (Wonder Boy) and Guard Crush Games today revealed Streets of Rage 4, an all-new continuation of SEGA's iconic arcade brawler series known for its radical fights, jammin' '90s beats and dashing sparring gloves and bandanas. \r\rStreets of Rage, known as Bare Knuckle (Bea Nakkuru) in Japan, is a trilogy of beat 'em up games developed and published by SEGA in the 1990s.\r Famously known for its non stop action and electronic dance influenced music - scored by Yuzo Koshiro and Motohiro Kawashima - the series has gained the status of cult classic throughout the years. It is considered one of the best beat 'em up series of all time. After many years, Axel and Blaze are finally picking up the fight where they left.\r Featuring hand-drawn visuals from the team behind 2017's gorgeous Wonder Boy: The Dragon's Trap remake, Streets of Rage 4 builds upon the classic trilogy's gameplay with new mechanics, a fresh story and a gauntlet of dangerous stages with a serious crime problem. Streets of Rage 4 recalls classic gameplay but it stands as an entirely original arcade-style romp thanks to the expertise of Guard Crush Games and Dotemu.\r Whether players gang up with a friend or clean up the city solo, Streets of Rage 4 is a skull-bashing, chicken-chomping delight all set to a thumping soundtrack sure to get your blood pumping. \r\rFeatures:\r * The comeback of the legendary Streets of Rage series.\r* Beautiful graphics fully hand-drawn animated by the studio behind Wonder Boy: The Dragon's Trap.\r* Classic gameplay enhanced with brand new mechanics.\r* Soundtrack by a wide line-up of world-class musicians.\r* Braised chicken served on a pristine plate.… Expand"}, {"name": "Prince of Persia Classic", "details_link": "https://www.metacritic.com/game/xbox-360/prince-of-persia-classic", "publisher": "Ubisoft", "release_date": "Jun 13 2007", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action", "Adventure", "Platformer", "General", "2D"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/f46964b68bef9c85ccfe791f22bb1bb0-98.jpg", "descriptions": "[Xbox Live Arcade]  While the Sultan of Persia is away for a war, the evil Vizier seizes the throne for himself. He has also imprisoned the beautiful Princess and has given her an hour to decide her fate – marry him or die. As the courageous Prince, you have 60 minutes to complete the[Xbox Live Arcade]  While the Sultan of Persia is away for a war, the evil Vizier seizes the throne for himself. He has also imprisoned the beautiful Princess and has given her an hour to decide her fate – marry him or die. As the courageous Prince, you have 60 minutes to complete the mission of saving the Princess from her deadly fate. Developed by Gameloft, Prince of Persia Classic has received a brand-new coat of paint with character designs, animations, visuals and lighting effects giving the game a close to 3D look. To freshen the gameplay experience, new traps, puzzles and enemies have also been added. [Ubisoft]… Expand"}, {"name": "Star Fox Adventures", "details_link": "https://www.metacritic.com/game/gamecube/star-fox-adventures", "publisher": "Nintendo", "release_date": "Sep 22 2002", "developers": ["Rare Ltd."], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/175446afb11be32045be177b17f24daf-98.jpg", "descriptions": "General Scales has unleashed powers that are tearing apart the once-peaceful Dinosaur Planet. With the survival of his home planet at risk, Fox McCloud receives an urgent message to battle Scales and his vast army of SharpClaws. As Fox, you'll gain support from Star Fox Team members Slippy,General Scales has unleashed powers that are tearing apart the once-peaceful Dinosaur Planet. With the survival of his home planet at risk, Fox McCloud receives an urgent message to battle Scales and his vast army of SharpClaws. As Fox, you'll gain support from Star Fox Team members Slippy, Peppy, and Rob. You must rely on the mystical powers of a unique staff as you battle Scales' minions, befriend peaceful plant-eaters, and encounter eerie spirits that hold the key to the planet's survival.… Expand"}, {"name": "Two Point Hospital", "details_link": "https://www.metacritic.com/game/playstation-4/two-point-hospital", "publisher": "Sega", "release_date": "Feb 25 2020", "developers": ["Two Point Studios"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Strategy", "Management", "Virtual", "Career", "Business / Tycoon"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/e26e5772e630c03bef0dae20dcd43311-98.jpg", "descriptions": "Build up a hospital from nothing to a masterpiece as you design the most beautiful - or functional - healthcare operation in the whole of Two Point County. Optimize your hospital design to increase patient (and cash) flow, arranging corridors, rooms and waiting areas to your exact…"}, {"name": "SteamWorld Dig", "details_link": "https://www.metacritic.com/game/3ds/steamworld-dig", "publisher": "Image & Form", "release_date": "Aug  8 2013", "developers": ["Image & Form"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox One", "3DS"], "num_players": "1 Player", "genres": ["Action", "Action Adventure", "Platformer", "General", "Platformer", "2D", "2D", ""], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/671045bd09ca5474123cef1aab4970b1-98.jpg", "descriptions": "The clock has stopped around the turn of the 19th century, and humankind has prematurely blown itself to bits. The remaining scraps are huddling in caves beneath the surface, and steam-powered robots have taken over the Wild West."}, {"name": "Bulletstorm", "details_link": "https://www.metacritic.com/game/pc/bulletstorm", "publisher": "Electronic Arts", "release_date": "Feb 21 2011", "developers": ["Epic Games", "People Can Fly"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["General", "Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/92801f2765354b3431d7e67d37de7d73-98.jpg", "descriptions": "Bulletstorm's array of distinct skillshots produces unprecedented levels of frantic gameplay. The skillshot system rewards players for laying waste to enemies in the most imaginative way possible. The more insane the skillshot, the more points players collect to upgrade and unlock weapons,Bulletstorm's array of distinct skillshots produces unprecedented levels of frantic gameplay. The skillshot system rewards players for laying waste to enemies in the most imaginative way possible. The more insane the skillshot, the more points players collect to upgrade and unlock weapons, which in turn allows them to execute even more inventive moves and exaggerated skillshots. … Expand"}, {"name": "Fallout 3: Broken Steel", "details_link": "https://www.metacritic.com/game/xbox-360/fallout-3-broken-steel", "publisher": "Bethesda Softworks", "release_date": "May  5 2009", "developers": ["Bethesda Game Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "First-Person", "First-Person", "General", "Western-Style"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/9/53c72ba1daa2ddfaa348cf176fedd06a-98.jpg", "descriptions": "(Downloadable Content)  Continue your existing Fallout 3 game and finish the fight against the Enclave remnants alongside Liberty Prime. Broken Steel moves the level cap for your character from 20 to 30, allowing you to experience even more of the game, including new perks and achievements.(Downloadable Content)  Continue your existing Fallout 3 game and finish the fight against the Enclave remnants alongside Liberty Prime. Broken Steel moves the level cap for your character from 20 to 30, allowing you to experience even more of the game, including new perks and achievements. Story: You may have dealt the Enclave a serious blow at Project Purity, but their forces are still out there, and still pose a grave threat to the people and security of the Capital Wasteland.  In Broken Steel, you'll continue your current Fallout 3 character past the events of Project Purity, and work with the Brotherhood of Steel to eradicate the Enclave threat once and for all. Travel to new locations like the Olney Powerworks, wield destructive new weapons like the Tesla Cannon, and fight powerful new creatures like the Super Mutant Overlord. [Bethesda Softworks]… Expand"}, {"name": "Call of Duty 3", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-duty-3", "publisher": "Activision", "release_date": "Nov  7 2006", "developers": ["Treyarch"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 82, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/283a1085cc409d4b8e63faf06b905488-98.jpg", "descriptions": "Call of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout.  Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle andCall of Duty 3 delivers the intensity of being closer than ever to the fury of combat during the battle for the Liberation of Paris, the most harrowing campaign of WWII, known as The Normandy Breakout.  Through a seamless narrative, Call of Duty 3 delivers the rush of unrelenting battle and breathtaking action of the Allied offensive that changed the fate of the world. [Activision]… Expand"}, {"name": "GRID 2", "details_link": "https://www.metacritic.com/game/playstation-3/grid-2", "publisher": "Codemasters", "release_date": "May 28 2013", "developers": ["Codemasters"], "platforms": ["iPhone/iPad", "PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 82, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/62af5a6feec6315c03480dc61e8c1aa5-98.jpg", "descriptions": "The next generation of the EGO Game Technology Platform promises to deliver genre-defining visuals and jaw-dropping damage as you prove yourself across three continents in a new, evolving world of motorsport."}, {"name": "WWE 2K23", "details_link": "https://www.metacritic.com/game/playstation-5/wwe-2k23", "publisher": "2K Games", "release_date": "Mar 14 2023", "developers": ["Visual Concepts"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Sports", "Individual", "Combat", "Wrestling"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/56f02c034ec0983be4b113dfc6261bf3-98.jpg", "descriptions": "Expanded features, gorgeous graphics, and the ultimate WWE experience. Hit the ring with a deep roster of WWE Superstars and Legends including Roman Reigns, \"American Nightmare\" Cody Rhodes, Ronda Rousey, Brock Lesnar, \"Stone Cold\" Steve Austin and more!\r 2K SHOWCASE: INTERACTIVE SPORTSExpanded features, gorgeous graphics, and the ultimate WWE experience. Hit the ring with a deep roster of WWE Superstars and Legends including Roman Reigns, \"American Nightmare\" Cody Rhodes, Ronda Rousey, Brock Lesnar, \"Stone Cold\" Steve Austin and more!\r 2K SHOWCASE: INTERACTIVE SPORTS DOCUMENTARY\rPlay through the key moments and toughest opponents of John Cena’s storied 20-year WWE career. And in a franchise-first, take on the role of each marquee opponent - some of WWE’s greatest of all time - as you aim to take down Mr. Hustle, Loyalty, and Respect.\r IT’S WARGAMES\rThe fan-favorite action-packed WarGames makes its debut in WWE 2K23 and delivers heart-pounding 3v3 and 4v4 multiplayer mayhem inside two side-by-side rings, surrounded by a double-steel cage!\r YOUR SHOW, YOUR CHOICES\rWith MyGM, take the reins of a weekly show and compete against rival general managers for brand supremacy. Now featuring more GMs to choose from, additional show options, multiple seasons, expanded match cards, and more match types for up to 4 players.\r YOU HOLD ALL THE CARDS\rCollect and upgrade cards of WWE Superstars and Legends to build the ultimate faction and compete for global dominance in MyFACTION, now featuring online multiplayer!\r DEFINE YOUR FUTURE IN MyRISE\rWalk through the curtains for your WWE debut and shape your career as a WWE Superstar with the decisions you make along the way through distinct storylines - The Lock and The Legacy.… Expand"}, {"name": "Ys VIII: Lacrimosa of DANA", "details_link": "https://www.metacritic.com/game/playstation-5/ys-viii-lacrimosa-of-dana", "publisher": "NIS America", "release_date": "Nov 15 2022", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "PlayStation 5"], "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/0/6428514021a943bc1d4303a41ae71614-98.jpg", "descriptions": "Ys returns with a brand new adventure for the first time in 8 years! Adol awakens shipwrecked and stranded on a cursed island. There, he and the other shipwrecked passengers he rescues form a village to challenge fearsome beasts and mysterious ruins on the isolated island. Amidst this, AdolYs returns with a brand new adventure for the first time in 8 years! Adol awakens shipwrecked and stranded on a cursed island. There, he and the other shipwrecked passengers he rescues form a village to challenge fearsome beasts and mysterious ruins on the isolated island. Amidst this, Adol begins to dream of a mysterious blue-haired maiden living in an unknown world. Join Adol as he unravels the riddle of the cursed isle and the blue-haired maiden Dana in Ys VIII: Lacrimosa of Dana!\r FEATURES:\r An Epic Tale - Follow Adol on his latest adventure and uncover the mysteries of the cursed island. \r\rParty On! - Change your playable character on-the-fly as you battle ferocious foes in lighting-fast combat.\r Another Side - Unravel the mystery of the blue-haired maiden Dana through her unique gameplay sections.\r It Takes a Village! - Rescue your fellow shipwrecked passengers and bring them to your village where they will provide valuable services.… Expand"}, {"name": "This War of Mine: Final Cut", "details_link": "https://www.metacritic.com/game/playstation-5/this-war-of-mine-final-cut", "publisher": "11 bit studios", "release_date": "May 10 2022", "developers": ["11 bit studios"], "platforms": ["Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Miscellaneous", "Action Adventure", "Survival", "Board / Card Game"], "meta_score": 82, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/f70e0ee5638ae3d9160b3263eb9f8d46-98.jpg", "descriptions": "The Remastered Final Cut version for PS5 is finally here!\rIn This War Of Mine, you do not play as an elite soldier, rather as a group of civilians trying to survive in a besieged city; struggling with a lack of food, medicine and constant danger from snipers and hostile scavengers. DuringThe Remastered Final Cut version for PS5 is finally here!\rIn This War Of Mine, you do not play as an elite soldier, rather as a group of civilians trying to survive in a besieged city; struggling with a lack of food, medicine and constant danger from snipers and hostile scavengers. During the day you need to focus on maintaining your hideout: crafting, trading and taking care of your survivors. At night, take one of your civilians on a mission to scavenge for items that will help you stay alive.\r Make life-and-death decisions driven by your conscience. Try to protect everybody from your shelter or sacrifice some of them for longer-term survival. During war, there are no good or bad decisions; there is only survival. The sooner you realize that, the better.\rThis War of Mine: Final Cut main features:\r- Inspired by real-life events\r- Control your survivors and manage your shelter\r- Craft weapons, alcohol, beds or stoves―anything that helps you survive\r- Make decisions―an often unforgiving and emotionally difficult experience\r- Randomized world and characters every time you start a new game\r- Charcoal-stylized aesthetics to complement the game's theme\r- All updates and free expansions added along the way to create the Final Cut… Expand"}, {"name": "Nightmare Reaper", "details_link": "https://www.metacritic.com/game/pc/nightmare-reaper", "publisher": "Blazing Bit Games", "release_date": "Mar 28 2022", "developers": ["Blazing Bit Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 82, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/ac6c1ee3f93c954bf53bb2241a24ab65-98.jpg", "descriptions": "Explore the cursed depths of a nightmare while finding powerful weapons and improving your abilities in this retro first person shooter that breaches the wall between the classics and modern sensibilities."}, {"name": "Pro Evolution Soccer 2018", "details_link": "https://www.metacritic.com/game/xbox-one/pro-evolution-soccer-2018", "publisher": "Konami", "release_date": "Sep 12 2017", "developers": ["Konami"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 22 ", "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/019b0037277122cd854ae4959ccc5735-98.jpg", "descriptions": "Real Touch+ adds a new dimension to ball control, with full body touch allowing various parts of the body to control the ball based on the unpredictability of the ball movement. Set pieces have been reworked with a new Free Kick and Penalty Kick system, alongside the option to choose the newReal Touch+ adds a new dimension to ball control, with full body touch allowing various parts of the body to control the ball based on the unpredictability of the ball movement. Set pieces have been reworked with a new Free Kick and Penalty Kick system, alongside the option to choose the new one player kick off. A new mode dedicated to 2v2 and 3v3 co-op play, with support for local guests. Play together with friends, take your team to the top or simply have some fun via one-off casual matches. Compete in PES League in new modes including myClub, Random Selection Match and Online co-op. [Konami]… Expand"}, {"name": "Lovers in a Dangerous Spacetime", "details_link": "https://www.metacritic.com/game/playstation-4/lovers-in-a-dangerous-spacetime", "publisher": "Asteroid Base", "release_date": "Feb  9 2016", "developers": ["Asteroid Base"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Horizontal"], "meta_score": 82, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/a0ccd40c90a8c021e2121b89bbdaac7b-98.jpg", "descriptions": "Lovers in a Dangerous Spacetime is a frantic 1- or 2-player couch co-op action space shooter set in a massive neon battleship. Only through teamwork can you triumph over the evil forces of Anti-Love, rescue kidnapped space-bunnies, and avoid a vacuumy demise. Deep space is a dangerous place,Lovers in a Dangerous Spacetime is a frantic 1- or 2-player couch co-op action space shooter set in a massive neon battleship. Only through teamwork can you triumph over the evil forces of Anti-Love, rescue kidnapped space-bunnies, and avoid a vacuumy demise. Deep space is a dangerous place, but you don't have to face it alone.… Expand"}, {"name": "Tekken 6", "details_link": "https://www.metacritic.com/game/psp/tekken-6", "publisher": "Namco Bandai Games America", "release_date": "Nov 24 2009", "developers": ["Namco Bandai Games America", "Namco Bandai Games"], "platforms": ["PlayStation 3", "Xbox 360", "PSP"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/4/4000d87565a069aed8be2396780837d4-98.jpg", "descriptions": "Tekken 6 sees the return of many familiar faces as well as new characters to create the largest line-up the series has ever seen. With a growing roster of fighters, each equipped with their own deadly techniques, martial art moves, and attack combinations, Tekken 6 promises to be the bestTekken 6 sees the return of many familiar faces as well as new characters to create the largest line-up the series has ever seen. With a growing roster of fighters, each equipped with their own deadly techniques, martial art moves, and attack combinations, Tekken 6 promises to be the best \"King of Iron Fist Tournament\" yet.  Adding to the already rich gaming experience, a deeper character customization feature will only enhance the incredible fighting intensity as players go mano-y-mano. Optimized for the PSP system, Tekken 6 not only contains all the explosive action of its home console brethren but also feature additional stages, content, items, and an ad-hoc multiplayer mode. Fighting amongst friends is encouraged as players can battle wirelessly against each other using original or fan favorite characters.  Rounding out its list of impressive features is the return of the Ghost Infrastructure mode, which allows players to upload their \"ghost\" character data and download others' from the Internet onto their PSP system. When players have reached the height of their Tekken fighting skills, they will be able to see how they stack up against others through the game’s network support. [Namco Bandai Games]… Expand"}, {"name": "Strong Bad's Cool Game for Attractive People Episode 2: Strong Badia the Free", "details_link": "https://www.metacritic.com/game/wii/strong-bads-cool-game-for-attractive-people-episode-2-strong-badia-the-free", "publisher": "Telltale Games", "release_date": "Sep 15 2008", "developers": ["Telltale Games"], "platforms": ["PC", "Wii"], "num_players": "1 Player", "genres": ["Miscellaneous", "Adventure", "General", "Compilation"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/31800c21fc32a62678c94f52b5368372-98.jpg", "descriptions": "[WiiWare]  Strong Badia the Free is the second of five monthly episodes starring Strong Bad-the self-proclaimed \"coolest person ever\"-and the rest of the cast from the popular Homestar Runner Web cartoons. When Strong Bad fails to obey the King of Town's totally unfair e-mail tax, he's[WiiWare]  Strong Badia the Free is the second of five monthly episodes starring Strong Bad-the self-proclaimed \"coolest person ever\"-and the rest of the cast from the popular Homestar Runner Web cartoons. When Strong Bad fails to obey the King of Town's totally unfair e-mail tax, he's placed under house arrest. Once freed from his wrongful imprisonment, Strong Bad goes on a mission to unite the local warring factions under the Strong Badian flag. Is Free Country USA ready for such an awesome ruler? Strong Bad Episode 2: Strong Badia the Free also has the Videlectrix arcade classic \"Math Kickers Featuring the Algebros,\" plus all-new achievements, collectibles, costumes and Teen Girl Squad comics. You can even use Strong Bad's Lappy to send e-mails and pictures to your Wii Friends. So what are you waiting for? Fire up Strong Badia the Free and get ready to kick some doughy King of Town butt. [Nintendo]… Expand"}, {"name": "Mario Kart Wii", "details_link": "https://www.metacritic.com/game/wii/mario-kart-wii", "publisher": "Nintendo", "release_date": "Apr 27 2008", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Kart", "Automobile"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/5844c5a8ffe179147b8b0fdb0e61ad3e-98.jpg", "descriptions": "Mario Kart Wii comes with the intuitive Wii Wheel, which makes it easy for novices to compete against veterans, so no one is left in the dust. And with a broadband hookup to Nintendo Wi-Fi Connection, players can compete with up to 11 other drivers from around the world for racing dominance.Mario Kart Wii comes with the intuitive Wii Wheel, which makes it easy for novices to compete against veterans, so no one is left in the dust. And with a broadband hookup to Nintendo Wi-Fi Connection, players can compete with up to 11 other drivers from around the world for racing dominance. The game includes 16 new courses and 16 classic courses from previous Mario Kart games. For the first time ever, players have the option of racing with either karts or motorbikes. Players can also hit the road as their personalized Mii caricatures in addition to the handful of classic Nintendo characters found in the game. True to the series, the game features tons of racing, plenty of power-ups and oodles of objects for players to use to slow down other drivers. And 10 battle arenas keep players busy between trips around the circuit. Mario Kart Wii supports four different control options: Wii Remote with or without the Wii Wheel, Wii Remote and Nunchuk controller combo, Classic Controller and even the Nintendo GameCube controller. So there's bound to be a configuration that fits everyone's style. Mario Kart Wii launches with a new channel added to the Wii Menu to enhance game play: The Mario Kart Wii Channel. This new channel builds on the online community of Wii owners and lets players compete in tournaments, check worldwide rankings, see when their friends are playing and download ghost data. [Nintendo]… Expand"}, {"name": "College Hoops 2K8", "details_link": "https://www.metacritic.com/game/playstation-3/college-hoops-2k8", "publisher": "2K Sports", "release_date": "Nov 19 2007", "developers": ["Visual Concepts"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "10  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 82, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/9c552980d22045a5381d7a5f5b551a11-98.jpg", "descriptions": "In the All-American Training Challenge, players can improve their game skills by competing in passing, shooting, and defensive tests against former college basketball standouts like Mike Conley Jr. of Ohio State, Julian Wright of Kansas, Glen \"Big Baby\" Davis of LSU, Alando Tucker ofIn the All-American Training Challenge, players can improve their game skills by competing in passing, shooting, and defensive tests against former college basketball standouts like Mike Conley Jr. of Ohio State, Julian Wright of Kansas, Glen \"Big Baby\" Davis of LSU, Alando Tucker of Wisconsin, Al Thornton of Florida State, J.J. Redick of Duke, and College Hoops 2K8 cover athlete, Greg Oden of Ohio State. Gamers can progress through the challenge drills against these great players while tracking their best times and highest scores in the game. With multiplayer support for up to four players, gamers can compete against their friends to see who has the best College Hoops skills. College basketball fans can truly feel the benefit of playing in front of a frenzied crowd—be it at home or in a neutral tournament venue—with the 6th Man Advantage where the energy of a team’s fans can motivate a team to play harder and with more confidence. During a game, the 6th Man Meter measures the current energy and excitement level of the crowd. By scoring often, playing good defense, and raising the excitement level of the crowd, the 6th Man Meter will rise. Once the meter is full, the home team gains the advantage of playing with less fatigue for a brief period while the opposing team starts to lose confidence in their playing ability. The 6th Man Advantage delivers a realistic element with how a great crowd can inspire their team to victory. [2K Sports]… Expand"}, {"name": "EA SPORTS UFC 4", "details_link": "https://www.metacritic.com/game/xbox-one/ea-sports-ufc-4", "publisher": "Electronic Arts", "release_date": "Aug 14 2020", "developers": ["Electronic Arts"], "platforms": ["PlayStation 4", "Xbox Series X", "Xbox One"], "num_players": "2 ", "genres": ["Sports", "Individual", "Combat", "Boxing / Martial Arts"], "meta_score": 82, "users_score": 2.0, "image": "https://static.metacritic.com/images/products/games/2/4f3ca63ee258d03f216eae48000e6068-98.jpg", "descriptions": "In EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality. Develop and customize your character through a unified progression system across all modes. Go from unknown amateur to UFC superstar in the new Career Mode, experience theIn EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality. Develop and customize your character through a unified progression system across all modes. Go from unknown amateur to UFC superstar in the new Career Mode, experience the origins of combat sports in two all-new environments; The Kumite and The Backyard, or challenge the world in new Blitz Battles or Online World Championships to become the undisputed champ. In gameplay, fluid clinch-to-strike combinations offer more responsive and authentic stand-up gameplay, while overhauled takedown and ground mechanics deliver more control in those key phases of the fight. No matter how, or where, you play EA SPORTS UFC 4 puts 'you' at the center of every fight.… Expand"}, {"name": "GRIS", "details_link": "https://www.metacritic.com/game/playstation-4/gris", "publisher": "Devolver Digital", "release_date": "Nov 26 2019", "developers": ["Nomada Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/8/e686624fd98e621d6cca8d9fdb558656-98.jpg", "descriptions": "Gris is a hopeful young girl lost in her own world, dealing with a painful experience in her life. Her journey through sorrow is manifested in her dress, which grants new abilities to navigate her faded reality. Gris is a serene and evocative experience, free of danger, frustration, orGris is a hopeful young girl lost in her own world, dealing with a painful experience in her life. Her journey through sorrow is manifested in her dress, which grants new abilities to navigate her faded reality. Gris is a serene and evocative experience, free of danger, frustration, or death. It can be enjoyed by anyone regardless of their spoken language.… Expand"}, {"name": "Borderlands 2: Mr. Torgue's Campaign of Carnage", "details_link": "https://www.metacritic.com/game/pc/borderlands-2-mr-torgues-campaign-of-carnage", "publisher": "2K Games", "release_date": "Nov 20 2012", "developers": ["Gearbox Software"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/7/43177324d243fca5601e368cc606326e-98.jpg", "descriptions": "Delve into Mr. Torgue’s Campaign of Carnage and see if you have what it takes to become champion of this brand new storyline in Borderlands 2. Fight for the Big Loot against some of the baddest baddies in Pandora, including hordes of Biker Bandits. Also, take special quests from Tiny Tina,Delve into Mr. Torgue’s Campaign of Carnage and see if you have what it takes to become champion of this brand new storyline in Borderlands 2. Fight for the Big Loot against some of the baddest baddies in Pandora, including hordes of Biker Bandits. Also, take special quests from Tiny Tina, Moxxi and others for extra rewards.  And don’t forget to bring your friends -- those higher levels get very tough. … Expand"}, {"name": "Split/Second", "details_link": "https://www.metacritic.com/game/xbox-360/splitsecond", "publisher": "Disney Interactive Studios", "release_date": "May 18 2010", "developers": ["Black Rock Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Driving", "Racing", "General", "General", "Arcade", "Automobile"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/6/f8fc5cad2cad59af98bf40cca3ad6ca0-98.jpg", "descriptions": "Split/Second, an intense action racing game set within the world of a hyper-competitive reality television show. Competitors vie to be the first across the finish line in a made-for-TV city built for destruction, with the ultimate goal of becoming the season champion. Competitors inSplit/Second, an intense action racing game set within the world of a hyper-competitive reality television show. Competitors vie to be the first across the finish line in a made-for-TV city built for destruction, with the ultimate goal of becoming the season champion. Competitors in Split/Second don't just collide with other vehicles to knock them from the track -- they can also trigger explosive events that drastically alter the dynamics of the race. Players must use strategy and pinpoint timing to derail opponents, tactically alter the track or create entirely new routes. [Disney]… Expand"}, {"name": "Desktop Dungeons", "details_link": "https://www.metacritic.com/game/pc/desktop-dungeons", "publisher": "QCF Design", "release_date": "Oct 17 2010", "developers": ["QCF Design"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Role-Playing", "General", "Roguelike"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/6d3b34bef66bad40fa59d05983585f29-98.jpg", "descriptions": "Desktop Dungeons is a quick-play roguelike puzzle game that gives you roughly 10 minutes of dungeon-crawling action per serving. It straddles the casual and hardcore boundary in that, while you might die frequently because the game is tricky and unforgiving, it’s so approachable and quick toDesktop Dungeons is a quick-play roguelike puzzle game that gives you roughly 10 minutes of dungeon-crawling action per serving. It straddles the casual and hardcore boundary in that, while you might die frequently because the game is tricky and unforgiving, it’s so approachable and quick to get into that you keep wanting just one more.… Expand"}, {"name": "Enter the Gungeon", "details_link": "https://www.metacritic.com/game/playstation-4/enter-the-gungeon", "publisher": "Devolver Digital", "release_date": "Apr  5 2016", "developers": ["Dodge Roll"], "platforms": ["PC", "Stadia", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/bb7e5844e0c933b9dfcfa2207b7623b4-98.jpg", "descriptions": "Enter the Gungeon is a bullet hell dungeon crawler following a band of misfits seeking to shoot, loot, dodge roll and table-flip their way to personal absolution by reaching the legendary Gungeon’s ultimate treasure: the gun that can kill the past."}, {"name": "Fallout: New Vegas - Old World Blues", "details_link": "https://www.metacritic.com/game/pc/fallout-new-vegas---old-world-blues", "publisher": "Bethesda Softworks", "release_date": "Jul 19 2011", "developers": ["Obsidian Entertainment"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Role-Playing", "First-Person", "First-Person", "Western-Style"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/bc9bbbad1a7b11c88523eac11432c30c-98.jpg", "descriptions": "In Old World Blues, releasing in June, you will discover how some of the Mojave’s mutated monsters came to be when you unwittingly become a lab rat in a science experiment gone awry. You’ll need to scour the Pre-War research centers of the Big Empty in search of technology to turn the tablesIn Old World Blues, releasing in June, you will discover how some of the Mojave’s mutated monsters came to be when you unwittingly become a lab rat in a science experiment gone awry. You’ll need to scour the Pre-War research centers of the Big Empty in search of technology to turn the tables on your kidnappers or join forces with them against an even greater threat.… Expand"}, {"name": "Dragon's Crown", "details_link": "https://www.metacritic.com/game/playstation-3/dragons-crown", "publisher": "Atlus", "release_date": "Aug  6 2013", "developers": ["Vanillaware"], "platforms": ["PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Action RPG", "Action", "Role-Playing", "Beat-'Em-Up", "Action RPG", "Beat-'Em-Up", "2D"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/5aff739604a1c0a34256f37f6b027b43-98.jpg", "descriptions": "Dragon's Crown thrusts you into a fantastical medieval world packed with labyrinthine dungeons to explore, vile monstrosities to smite, and nearly endless online adventure. Your mission is to dive into the dank underworld, uncovering treasure and strengthening your mettle as you unlock theDragon's Crown thrusts you into a fantastical medieval world packed with labyrinthine dungeons to explore, vile monstrosities to smite, and nearly endless online adventure. Your mission is to dive into the dank underworld, uncovering treasure and strengthening your mettle as you unlock the secret behind the ancient dragon threatening the world. Simple, easy-to-learn controls allow anyone to dive into the fray and enjoy the breathtaking sword-and-sorcery action. In addition to gameplay, the game also features a vast array of character customization features - with six wildly different classes to play as, raiding the catacombs for epic loot remains fresh and engaging.… Expand"}, {"name": "Sega Genesis Collection", "details_link": "https://www.metacritic.com/game/playstation-2/sega-genesis-collection", "publisher": "Sega", "release_date": "Nov  7 2006", "developers": ["Digital Eclipse"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Compilation"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/9/200eac18b2c2d73cc79516e642dfac90-98.jpg", "descriptions": "(Known as \"Sega Mega Drive Collection\" in the UK/EU)  SEGA Genesis Collection features over 30 titles including, Altered Beast, Sonic The Hedgehog, Shinobi III, Phantasy Star, and the original SEGA Genesis version of Golden Axe. SEGA Genesis Collection also features numerous unlockable items(Known as \"Sega Mega Drive Collection\" in the UK/EU)  SEGA Genesis Collection features over 30 titles including, Altered Beast, Sonic The Hedgehog, Shinobi III, Phantasy Star, and the original SEGA Genesis version of Golden Axe. SEGA Genesis Collection also features numerous unlockable items that delve into the soul of the Genesis including interviews with the original developers that created the games featured in the collection, a museum area with interesting facts about the games, a hint area to help gamers complete their favorite SEGA Genesis games, and SEGA arcade games from the Genesis era. [Sega]… Expand"}, {"name": "Crusader Kings II", "details_link": "https://www.metacritic.com/game/pc/crusader-kings-ii", "publisher": "Paradox Interactive", "release_date": "Feb 14 2012", "developers": ["Paradox Development Studio"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 82, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/6/6db1307990a954c85b797bb5e725bd17-98.jpg", "descriptions": "In Crusader Kings II, you will get to control one of the great Christian dynasties of the West, attempt to conquer all of Europe, and liberate the Holy Land."}, {"name": "Endling - Extinction is Forever", "details_link": "https://www.metacritic.com/game/switch/endling---extinction-is-forever", "publisher": "HandyGames", "release_date": "Jul 19 2022", "developers": ["Herobeat Studios"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/18e3852854b692d4f9cf2a5360f21887-98.jpg", "descriptions": "Will the last mother fox on Earth be able to save its three little cubs? Experience how life would be in a world ravaged by mankind through the eyes of the last fox on Earth in this eco-conscious adventure. Discover the destructive eect of the human race, which corrupts day after day theWill the last mother fox on Earth be able to save its three little cubs? Experience how life would be in a world ravaged by mankind through the eyes of the last fox on Earth in this eco-conscious adventure. Discover the destructive eect of the human race, which corrupts day after day the most precious and needed resources of the natural environments. Explore Endling's 3D side-scrolling world and defend your cubs, three tiny and defenseless fur balls, feed them, see how they grow up level after level, notice their unique personalities and fears, and most importantly, make them survive. Use the cover of night to sneak with your litter towards a safer place. Spend the day resting in an improvised shelter and plan for your next movement carefully since it could be the last one for you or your cubs.… Expand"}, {"name": "Tainted Grail: Conquest", "details_link": "https://www.metacritic.com/game/pc/tainted-grail-conquest", "publisher": "Awaken Realms Digital", "release_date": "May 27 2021", "developers": ["Awaken Realms Digital", "Awaken Realms"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "Turn-Based", "Action RPG", "Card Battle"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/4/83ed5bfe37cc565038a7c1c8d2a164b5-98.jpg", "descriptions": "Avalon is dying. King Arthur is long gone, and Knights of the Round Table are in disarray. Guardian Menhirs, the only thing that makes it possible for humans to survive in this remote land, are going dark. Your village chose its best and brightest and sent them on an epic quest to reachAvalon is dying. King Arthur is long gone, and Knights of the Round Table are in disarray. Guardian Menhirs, the only thing that makes it possible for humans to survive in this remote land, are going dark. Your village chose its best and brightest and sent them on an epic quest to reach Kamelot, find the Grail, and save the land.You were not among them.They've never returned, and now it's your turn to lead a band of unlikely heroes, the only ones this land can still provide. These ordinary people set off far too late, under-equipped for the task ahead, and with little hope of success.Tainted Grail is a dark fantasy open-world RPG with fresh turn-based exploration and combat. It is based around deep, immersive story from one of the best and most innovative board games (biggest Kickstarter project of 2018!), but introduces a whole new experience crafted directly for PC.… Expand"}, {"name": "WRC 9 FIA World Rally Championship", "details_link": "https://www.metacritic.com/game/playstation-5/wrc-9-fia-world-rally-championship", "publisher": "Nacon", "release_date": "Nov 12 2020", "developers": ["KT Racing"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/3fe4d215fa2301fa160540fe87512ba4-98.jpg", "descriptions": "The WRC license is back and even better this year with WRC 9. Take part in the Calendar's 3 new rallies and challenge the community with the customisable league system. Then dive into the skin of a co-driver with the astonishing co-op mode."}, {"name": "Art Academy: Home Studio", "details_link": "https://www.metacritic.com/game/wii-u/art-academy-home-studio", "publisher": "Nintendo", "release_date": "Jun 25 2015", "developers": ["Headstrong Games"], "platforms": "Wii U", "genres": ["Miscellaneous", "Edutainment"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/9/c0442940a430965c37ff8a1d17502dbb-98.jpg", "descriptions": "Also known as Art Academy: Atelier."}, {"name": "Art of Balance", "details_link": "https://www.metacritic.com/game/wii-u/art-of-balance", "publisher": "Shin'en", "release_date": "Oct  9 2014", "developers": ["Shin'en"], "platforms": ["3DS", "PlayStation 4", "Switch", "Wii U"], "num_players": "Up to 8 ", "genres": ["Puzzle", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/b1f6742f1b3b15f7676c3b7b4e35a131-98.jpg", "descriptions": "Grab your stylus and build a balanced stack in this physics-based puzzler!\r Puzzle games must be addictive. This was our top priority during the development of the game. That's why we designed 200 levels that not only challenge your skills but also your imagination. With its perfect touchGrab your stylus and build a balanced stack in this physics-based puzzler!\r Puzzle games must be addictive. This was our top priority during the development of the game. That's why we designed 200 levels that not only challenge your skills but also your imagination. With its perfect touch controls Art of Balance TOUCH! is easy to pick up and hard to put away.\r Seeking a real challenge? Then try out the new endurance mode and drive your score ever higher.\r Art of Balance TOUCH! brings the ultimate just one more puzzle experience to your Nintendo 3DS.\r Master 200 levels\rDiscover 8 unique worlds\rPlay with your Stylus or with the SlidePad… Expand"}, {"name": "NBA 2K15", "details_link": "https://www.metacritic.com/game/xbox-one/nba-2k15", "publisher": "2K Sports", "release_date": "Oct  7 2014", "developers": ["Visual Concepts"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One"], "num_players": "Up to 10 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim"], "meta_score": 82, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/6e9ac70820d6266fc83002fca83617ef-98.jpg", "descriptions": "NBA 2K15 features approximately 5,000 new animations, new defensive AI, shooting systems, new team-specific play sets, and more control over rebounding, steals, and blocks. New game broadcast presentation hosted by Ernie Johnson and Shaq O'Neal delivers commentary and analysis to the action."}, {"name": "MVP Baseball 2004", "details_link": "https://www.metacritic.com/game/pc/mvp-baseball-2004", "publisher": "EA Sports", "release_date": "Mar  9 2004", "developers": ["EA Sports"], "platforms": ["PlayStation 2", "PC"], "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Team", "Baseball", "Sim", "Sim"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/2fcdc51bffe858babd8557a96465b1c1-98.jpg", "descriptions": "Step up to the plate with MVP Baseball 2004. The fundamentals of hitting, pitching, fielding, and base running have been reproduced like never before to give you complete control over every aspect of the game. From swinging for the fences or protecting the plate when you have a two-strikeStep up to the plate with MVP Baseball 2004. The fundamentals of hitting, pitching, fielding, and base running have been reproduced like never before to give you complete control over every aspect of the game. From swinging for the fences or protecting the plate when you have a two-strike count, the all-new batting model provides unprecedented command of each type of swing in every situation. With great gameplay and many additional features such as Pitching Challenge and Dynasty Mode, MVP Baseball 2004 wins the pennant as the most innovative and realistic baseball experience ever created. Groundbreaking Hitting Control: From hitting to the opposite field to pulling the ball down the line to swinging for the fences, every swing type is included. You Control the Field: Leap over the wall and rob home runs, hook slide to avoid tags, and take out the catcher at home with all-new player control. Pick Your Park: With all-new crowd chants, the addition of classic stadiums, and new lighting to signify various start times for your biggest games, MVP Baseball 2004 puts you in the best seat in the house. Your Dynasty Begins Now: Take full control of your franchise on all the levels -- from the minors to the pros. Play, sim, or manage each game all the way to the World Series. Swing for the Fences Online: Go yard against players across the country in one-on-one or Tournament games, while talking up your game with EA SPORTS? Talk [Electronic Arts]… Expand"}, {"name": "Europa 1400: The Guild", "details_link": "https://www.metacritic.com/game/pc/europa-1400-the-guild", "publisher": "JoWooD Entertainment AG", "release_date": "Nov 18 2002", "developers": ["4Head Studios"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/5/b356c36a8904f2360f71cd19c7ab36e5-98.jpg", "descriptions": "It's the year 1400. Europe sees the dawn of the \"golden age of the new departures and the free spirit\" - the late Middle Ages. Under the rule of the bourgeoisie and businessmen, more and more towns are emerging from the clutches of the aristocracy and are achieving independence, power andIt's the year 1400. Europe sees the dawn of the \"golden age of the new departures and the free spirit\" - the late Middle Ages. Under the rule of the bourgeoisie and businessmen, more and more towns are emerging from the clutches of the aristocracy and are achieving independence, power and wealth. New businesses are flourishing, bringing financial strength and political influence to a growing economy. However, life in the narrow, overpopulated alleyways and streets of the towns also has its downsides: epidemics and diseases are spreading, and thieves and highwaymen lie in wait to get their piece of the wealth. Now you can try your hand in these exciting times of change. Will you head down the path of an honest craftsman or a dubious priest? [JoWood]… Expand"}, {"name": "V-Rally 3", "details_link": "https://www.metacritic.com/game/playstation-2/v-rally-3", "publisher": "Atari", "release_date": "Oct 22 2002", "developers": ["Eden Studios"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/0/3ba8ec765ca9aff699eb9245f47d36f8-98.jpg", "descriptions": "For the first time the player would feel not only that he was driving in a high speed rally vehicle but that he was actually living and breathing the life of a driver, working through intense rally seasons. Drive top spec rally cars including Peugeot 206, Subaru Impreza, Ford Focus and manyFor the first time the player would feel not only that he was driving in a high speed rally vehicle but that he was actually living and breathing the life of a driver, working through intense rally seasons. Drive top spec rally cars including Peugeot 206, Subaru Impreza, Ford Focus and many others. All cars modeled with an incredible level of details. Cars display real physical damage and visible dirt every  time your car takes on hazardous terrain   Hugely realistic car physics and handling. Features stunningly rendered locations with extreme driving conditions (snow, safari, mud, asphalt). [Infogrames]… Expand"}, {"name": "V-Rally 3", "details_link": "https://www.metacritic.com/game/game-boy-advance/v-rally-3", "publisher": "Atari", "release_date": "Sep 30 2002", "developers": ["Velez & Dubail"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "Rally / Offroad"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/cdcf7c2c12763908cb7bf99226012ec0-98.jpg", "descriptions": "V-Rally evolves in its third installment with more detailed cars, customizable rally cars, and scurrying spectators. The world's top rally cars--including Subaru Impreza, Mitsubishi Lancer Evolution 7, Citroen Xsara, and Ford Focus--are included in V-Rally 3. Choose one, and then overcomeV-Rally evolves in its third installment with more detailed cars, customizable rally cars, and scurrying spectators. The world's top rally cars--including Subaru Impreza, Mitsubishi Lancer Evolution 7, Citroen Xsara, and Ford Focus--are included in V-Rally 3. Choose one, and then overcome spectators, deformed car parts, and extreme driving conditions as you race in six real-world locations and various gameplay modes. The life of a professional rally driver is rough--it's up to you to strategize your career and race your way to the top.… Expand"}, {"name": "Battle Realms", "details_link": "https://www.metacritic.com/game/pc/battle-realms", "publisher": "Crave", "release_date": "Nov  7 2001", "developers": ["Liquid Entertainment"], "platforms": "PC", "num_players": "Up to 8 ", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy", "Command"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/668d8782ca508d28ce167c8069f6e6c7-98.jpg", "descriptions": "A fantasy RTS combining a unique Living Resource System with a detailed combat model. After seven years of exile, Kenji returns to his war-torn homeland. Will he rise above his bitterness and liberate the land under the Dragon Clan flag, or will he give in to his darker side and conquer itA fantasy RTS combining a unique Living Resource System with a detailed combat model. After seven years of exile, Kenji returns to his war-torn homeland. Will he rise above his bitterness and liberate the land under the Dragon Clan flag, or will he give in to his darker side and conquer it as his father's Serpent Clan did so many years ago? Regardless of Kenji's choice, his actions will force him into conflict with the sinister Lotus Clan, the noble Wolf Clan and a mysterious foe from the past. [Ubi Soft]… Expand"}, {"name": "Warlords Battlecry", "details_link": "https://www.metacritic.com/game/pc/warlords-battlecry", "publisher": "SSI", "release_date": "Jul  9 2000", "developers": ["Strategic Studies Group"], "platforms": "PC", "num_players": "1-6 ", "genres": ["Strategy", "General", "General"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/9/0611eabd9bbeb91993837790c00a56f8-98.jpg", "descriptions": "Prepare to enter the next generation of RTS. You'll develop a hero to lead your forces into battle. Share your abilities and spells with surrounding members of your army. And develop your hero as you expand your empire. Because what's the fun of winning a battle if you don't know who toPrepare to enter the next generation of RTS. You'll develop a hero to lead your forces into battle. Share your abilities and spells with surrounding members of your army. And develop your hero as you expand your empire. Because what's the fun of winning a battle if you don't know who to carry off on your shoulders?  [Mattel Interactive]… Expand"}, {"name": "Shin Megami Tensei: Digital Devil Saga 2", "details_link": "https://www.metacritic.com/game/playstation-2/shin-megami-tensei-digital-devil-saga-2", "publisher": "Atlus Co.", "release_date": "Oct 11 2005", "developers": ["Atlus Co."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 82, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/6/5479549c3906b83d50423eef94433920-98.jpg", "descriptions": "Serph, leader of the Embryon, wanders aimlessly through the lifeless streets before him. In the Junkyard, his Tribe fought a gruesome war, hoping the light of Heaven would relieve their suffering. In the end, Serph's world vanished, along with the comrades who stood by him. All that awaitedSerph, leader of the Embryon, wanders aimlessly through the lifeless streets before him. In the Junkyard, his Tribe fought a gruesome war, hoping the light of Heaven would relieve their suffering. In the end, Serph's world vanished, along with the comrades who stood by him. All that awaited him in Nirvana were endless streets littered with the silent remains of human statues. The Promised Land was nothing but a new hell. Guards in white appear through clouds of dust, threatening to arrest Serph as an unauthorized Avatar Tuner. He notices the Karma Temple 's insignia on their equipment as they throw it aside and transform into hideous demons. The water crown's power washes over Serph, and he realizes the Atma was not simply a nightmare of the Junkyard?nothing has changed but his surroundings. Devouring others is the only way to survive. What awaits Serph beyond Nirvana?a glorious paradise, or a sea of blood-soaked corpses? [Atlus]… Expand"}, {"name": "Citizen Sleeper", "details_link": "https://www.metacritic.com/game/pc/citizen-sleeper", "publisher": "Fellow Traveller", "release_date": "May  5 2022", "developers": ["Jump Over The Age"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action Adventure", "General", "Western-Style"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/0833914f682228d00e975221252a56c6-98.jpg", "descriptions": "Live the life of an escaped worker, washed-up on a lawless station at the edge of an interstellar society. Inspired by the flexibility and freedom of Tabletop RPGs, explore the station, choose your friends, escape your past and change your future.\rLIFE ON ERLIN'S EYE\rAn abandoned stationLive the life of an escaped worker, washed-up on a lawless station at the edge of an interstellar society. Inspired by the flexibility and freedom of Tabletop RPGs, explore the station, choose your friends, escape your past and change your future.\rLIFE ON ERLIN'S EYE\rAn abandoned station on the edge of a system in crisis. Run down, chaotic, unruly, and alive—it was founded by idealists in the shadow of a corporate collapse. Now it is held together by anarchic alliances, ramshackle factions and a shared desire to be free from the gravity of corporate control.\r DO THE WORK. GET PAID. SURVIVE.\rEvery cycle you get up and choose what to do with your time. Toil in the yards, or take a bar shift. Search the markets for rare components or grab some street food. Make or break alliances, uncover truths and escape those that hunt you. Learn to survive and ultimately thrive, one cycle at a time.\r TURN UP FOR YOUR FRIENDS\rThe station plays host to characters from all walks of life, trying to eke out an existence among the stars. Salvagers, engineers, hackers, bartenders, street-food vendors, each has a history which brought them here. You choose which of them you wish to help, and together you will shape your future.\r ACCESS THEIR SECRETS\rHack into the station’s cloud to access decades of digital data, uncover new areas and unlock secrets. This is your unique power, and with it you can change your future. Corporate secrets, rogue AIs and troves of lost data await those willing to dive into the depths of the station’s networks.\r YOU WERE MADE TO DIE\rEssen-Arp: to them you are just property, one more asset in a portfolio that stretches across the stars. You are the product of an abusive system, in a universe where humanity’s expansion is marked by exploitation and extraction. Escape the makers of your decaying body, and chart your own path in a richly imagined, deeply relevant sci-fi world which explores ideas of precarity, personhood and freedom.… Expand"}, {"name": "Sam & Max Episode 201: Ice Station Santa", "details_link": "https://www.metacritic.com/game/pc/sam-max-episode-201-ice-station-santa", "publisher": "Telltale Games", "release_date": "Nov  8 2007", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "3D", "Point-and-Click", "Third-Person"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/3/12514b167d9439f0e77b3c16bc8ba28c-98.jpg", "descriptions": "He's the most powerful opponent they've ever faced, an ancient being of myth – Santa Claus! With Christmas presents on the attack and carols of gunshots, Sam & Max must storm the North Pole to bring down a less-than-jolly foe. Can our heroes save the world's children from a holiday taintedHe's the most powerful opponent they've ever faced, an ancient being of myth – Santa Claus! With Christmas presents on the attack and carols of gunshots, Sam & Max must storm the North Pole to bring down a less-than-jolly foe. Can our heroes save the world's children from a holiday tainted by tears, turmoil, and Torture-Me-Elmer? Find out in the Season Two premiere, Ice Station Santa! [GameTap]… Expand"}, {"name": "Oddworld: Stranger's Wrath HD", "details_link": "https://www.metacritic.com/game/playstation-3/oddworld-strangers-wrath-hd", "publisher": "Oddworld Inhabitants", "release_date": "Dec 27 2011", "developers": ["Just Add Water"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 3"], "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/4/8dceea10dcadb71831d8d858c1ea5523-98.jpg", "descriptions": "The Fabled Oddworld Series Makes its Return in High Definition in Oddworld: Stranger's Wrath HD."}, {"name": "Halo: Combat Evolved Anniversary", "details_link": "https://www.metacritic.com/game/xbox-360/halo-combat-evolved-anniversary", "publisher": "Microsoft Game Studios", "release_date": "Nov 15 2011", "developers": ["343 Industries"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/530ae22282b0cf3c6b7dff794704dd98-98.jpg", "descriptions": "\"Halo: Combat Evolved Anniversary\" is a spectacularly remastered version of the original \"Halo\" campaign, created in celebration of the 10th anniversary of one of the most beloved franchises in gaming history. With a bounty of new features including cooperative play over\"Halo: Combat Evolved Anniversary\" is a spectacularly remastered version of the original \"Halo\" campaign, created in celebration of the 10th anniversary of one of the most beloved franchises in gaming history. With a bounty of new features including cooperative play over Xbox LIVE, a bundle of some of the most beloved multiplayer maps in \"Halo\" history reimagined for Xbox LIVE, new challenges and a new story to uncover.… Expand"}, {"name": "N+", "details_link": "https://www.metacritic.com/game/ds/n+", "publisher": "Atari", "release_date": "Aug 26 2008", "developers": ["Metanet Software Inc.", "SilverBirch Studios"], "platforms": ["PC", "Xbox 360", "DS"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 82, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/8/7ba7d22ebda38d7dcaab8cc4b4b2d959-98.jpg", "descriptions": "You are a ninja in N+. Your god-like speed, dexterity, jumping power, and reflexes are all the result of an amazingly fast metabolism; sadly, so is your natural lifespan of 1.5 minutes. Like all Ninjas, you have an unquenchable thirst for gold and a natural propensity for exploring roomsYou are a ninja in N+. Your god-like speed, dexterity, jumping power, and reflexes are all the result of an amazingly fast metabolism; sadly, so is your natural lifespan of 1.5 minutes. Like all Ninjas, you have an unquenchable thirst for gold and a natural propensity for exploring rooms infested by increasingly lethal Ninja-killing robots. N emphasizes pacifism, humility, and the need to traverse 5 rooms before the end of your lifetime; a feat known only as ‘beating an episode’. In accordance with the teachings of N, it is your profound hope that one day you will develop your platforming skills, intelligence, and inexplicable ability to reincarnate to achieve total mastery of all 300 levels. [Atari]… Expand"}, {"name": "Resident Evil Village VR", "details_link": "https://www.metacritic.com/game/playstation-5/resident-evil-village-vr", "publisher": "Capcom", "release_date": "Feb 22 2023", "developers": ["Capcom"], "platforms": "PlayStation 5", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 82, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/3651716219004c7c09fd66290d16688f-98.jpg", "descriptions": "The main story of Resident Evil Village is now in VR. Technological advances have allowed us to offer players a more immersive experience by using eye tracking and 3D audio, unique to 4K HDR displays, as well as greater graphical fidelity. Chandeliers and furniture within Castle DimitrescuThe main story of Resident Evil Village is now in VR. Technological advances have allowed us to offer players a more immersive experience by using eye tracking and 3D audio, unique to 4K HDR displays, as well as greater graphical fidelity. Chandeliers and furniture within Castle Dimitrescu will be more beautiful than ever before, and the large presence of the Lady herself can be truly appreciated. Playing with the PlayStation VR2 Sense controller in addition to your headset also makes the player feel like they are really in the game! When the player guards with their arms or mimics shooting a gun, Ethan copies the movements in-game.\r New actions such as dual wielding with a handgun and knife or handgun and shotgun are now possible. It's like the player themselves is the controller!\r Become Ethan Winters and truly immerse yourself in the world as you fight for your life in Resident Evil Village.… Expand"}, {"name": "Child of Light", "details_link": "https://www.metacritic.com/game/playstation-4/child-of-light", "publisher": "Ubisoft", "release_date": "Apr 29 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Stadia", "Switch", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "genres": ["Action", "General", "General", "Role-Playing", "General"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/c8467bb70a97798d9ac711441d744a88-98.jpg", "descriptions": "Child of Light is a digital download, 2D side-scrolling role-playing game inspired by the art style of Studio Ghibli."}, {"name": "Metal Gear Rising: Revengeance", "details_link": "https://www.metacritic.com/game/xbox-360/metal-gear-rising-revengeance", "publisher": "Konami", "release_date": "Feb 19 2013", "developers": ["PlatinumGames"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/d7b26d1b5e768913156347b2d45ce841-98.jpg", "descriptions": "Metal Gear Rising: Revengeance moves the notorious Metal Gear franchise into new territory by delivering a novel action experience. Coupling development teams at Kojima Productions and PlatinumGames, Revengeance was made with the goal of providing players with a fresh synergistic experienceMetal Gear Rising: Revengeance moves the notorious Metal Gear franchise into new territory by delivering a novel action experience. Coupling development teams at Kojima Productions and PlatinumGames, Revengeance was made with the goal of providing players with a fresh synergistic experience that combines the best elements of pure action and epic storytelling, all within the expansive Metal Gear universe. The game introduces Raiden as the main character; a child soldier transformed into a half-man, half-machine cyborg ninja, equipped with a high-frequency katana blade and a soul fueled by revenge.… Expand"}, {"name": "Major League Baseball 2K5", "details_link": "https://www.metacritic.com/game/playstation-2/major-league-baseball-2k5", "publisher": "Take-Two Interactive", "release_date": "Feb 28 2005", "developers": ["Kush Games"], "platforms": "PlayStation 2", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Baseball", "Sim"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/13de0829cd803abc0e7fd528d20db9d6-98.jpg", "descriptions": "Major League Baseball 2K5 debuts On Command Baserunning, that includes active picture-in-picture baserunning, and new gameplay features called Maximum Sliding and Baseburner Mode. Active picture-in-picture baserunning delivers both an exciting presentation style and an intuitive method toMajor League Baseball 2K5 debuts On Command Baserunning, that includes active picture-in-picture baserunning, and new gameplay features called Maximum Sliding and Baseburner Mode. Active picture-in-picture baserunning delivers both an exciting presentation style and an intuitive method to precisely control runners. The new baserunning mechanic utilizes the right analog thumbstick to choose how baserunners slide -- head or feet first -- in conjunction with hook sliding left or right of the base. Players will be able to reach a base quicker, get up more quickly from a slide, or avoid being tagged out with the new freedom found in Maximum Sliding. Baseburner Mode allows the gamer to play any 'at-bat' through the perspective of any baserunner, delivering precision control to gamers. [2K Games]… Expand"}, {"name": "Brothers in Arms: Road to Hill 30", "details_link": "https://www.metacritic.com/game/playstation-2/brothers-in-arms-road-to-hill-30", "publisher": "Ubisoft", "release_date": "Mar 15 2005", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 2"], "num_players": "4  Online", "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 82, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/3/633ae4d70b42460a4aa207b2d29e7cf7-98.jpg", "descriptions": "Created by Texas-based Gearbox Software, Brothers in Arms is the most realistic and authentic WWII shooter ever. While other WWII games have sugarcoated the war experience, Brothers in Arms is based on a true story and will immerse gamers into the gritty, uncensored and emotionally-chargedCreated by Texas-based Gearbox Software, Brothers in Arms is the most realistic and authentic WWII shooter ever. While other WWII games have sugarcoated the war experience, Brothers in Arms is based on a true story and will immerse gamers into the gritty, uncensored and emotionally-charged side of war. The game puts you in the shoes of Sgt. Matt Baker, a D-Day paratrooper squad leader, and asks you to lead the squad as you balance their lives with the success of the mission. The true stories and historical events you experience on your perilous journey take you through real battlefields meticulously recreated from aerial reconnaissance images, US Army Signal Corps photos and eye-witness accounts of war-torn Normandy. Players of allskill levels can battle their way through this intense experience because of Brothers in Arms innovative and accessible command and control system. [Ubisoft]… Expand"}, {"name": "SOCOM: U.S. Navy SEALs Fireteam Bravo", "details_link": "https://www.metacritic.com/game/psp/socom-us-navy-seals-fireteam-bravo", "publisher": "SCEA", "release_date": "Nov  8 2005", "developers": ["Zipper Interactive"], "platforms": "PSP", "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 82, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/c54e7d182fa53ac2404173ddf58b27f8-98.jpg", "descriptions": "SOCOM offers fans of the multi-million selling franchise all-new single-player and wireless multiplayer gaming missions in four different Areas of Operation (AO). Players are tasked with completing 14 unique, realistic international single-player missions, including Chile, which is a uniqueSOCOM offers fans of the multi-million selling franchise all-new single-player and wireless multiplayer gaming missions in four different Areas of Operation (AO). Players are tasked with completing 14 unique, realistic international single-player missions, including Chile, which is a unique AO only available in the PSP release. As the SEAL commander, the player is supported by an AI teammate executing traditional SOCOM team-based tactical, stealth and action gameplay. After successfully completing a level, players can replay the mission in an entirely new way through the \"Instant Action\" option, with different objectives, enemy and object placement. In addition, multiple players are able to form clans and take on their friends for team based high-action gameplay in SOCOM Fireteam Bravo via a Wi-Fi connection. [SCEA]… Expand"}, {"name": "TimeSplitters: Future Perfect", "details_link": "https://www.metacritic.com/game/gamecube/timesplitters-future-perfect", "publisher": "EA Games", "release_date": "Mar 21 2005", "developers": ["Free Radical Design"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 82, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/2/1e209a41c3b4db854a2019c33df418d1-98.jpg", "descriptions": "In TimeSplitters: Future Perfect, humanity is on the brink of destruction by the evil TimeSplitters. With the help of some familiar faces, Cortez--the tough hero from previous installments--must chase a mystery foe across different time periods to trace the origins of the TimeSplitters. AsIn TimeSplitters: Future Perfect, humanity is on the brink of destruction by the evil TimeSplitters. With the help of some familiar faces, Cortez--the tough hero from previous installments--must chase a mystery foe across different time periods to trace the origins of the TimeSplitters. As Cortez, you'll have access to weapons, gadgets, characters, and environments that are unique to each time period. You can also correct the mistakes made in the past or team up with past and future versions of yourself in battles.… Expand"}, {"name": "Roki", "details_link": "https://www.metacritic.com/game/playstation-5/roki", "publisher": "United Label", "release_date": "Oct 28 2021", "developers": ["Polygon Treehouse"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 82, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/d33ed483eb23b27bca4d2d45183cbb89-98.jpg", "descriptions": "Every dark fairytale has its monster.Rediscover magic and chart your adventure through this forgotten northern world of mystery and monsters. Find your courage, discover hidden paths, solve ancient puzzles and travel deeper through the icy land to learn the truth.\n\nJoin Tove on aEvery dark fairytale has its monster.Rediscover magic and chart your adventure through this forgotten northern world of mystery and monsters. Find your courage, discover hidden paths, solve ancient puzzles and travel deeper through the icy land to learn the truth.Join Tove on a fantastical journey to save her family; one that takes her deep into a hidden, long forgotten world of folklore, filled with strange locations and even stranger creatures.Explore the ancient wilderness, solve its mysteries, and save your family in this modern adventure game for all.… Expand"}, {"name": "Art Style: ORBIENT", "details_link": "https://www.metacritic.com/game/wii/art-style-orbient", "publisher": "Nintendo", "release_date": "Sep 29 2008", "developers": ["Nintendo"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 82, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/2/77efca34806821b8d2d7248264f9b562-98.jpg", "descriptions": "[WiiWare]  Explore the universe like never before in Art Style: ORBIENT. Take control of gravity and anti-gravity and carefully maneuver your small star through 50 stages set in multiple galaxies. Collide with other stars to absorb them and make your own star expand in size, or capture the[WiiWare]  Explore the universe like never before in Art Style: ORBIENT. Take control of gravity and anti-gravity and carefully maneuver your small star through 50 stages set in multiple galaxies. Collide with other stars to absorb them and make your own star expand in size, or capture the stars in your orbit and have them become your satellites. Space isn't empty, though, and you'll have to avoid bumping into obstacles or getting pulled into a black hole. If you feel like relaxing while still being challenged, this is the game for you. Its combination of simple controls, atmospheric sound and unique environment make for an experience unlike any other. [Nintendo]… Expand"}, {"name": "Kingdom Hearts: Birth by Sleep", "details_link": "https://www.metacritic.com/game/psp/kingdom-hearts-birth-by-sleep", "publisher": "Square Enix", "release_date": "Sep  7 2010", "developers": ["Square Enix"], "platforms": "PSP", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 82, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/ae3b5d63b7f3c535b6ca544adfd4d98f-98.jpg", "descriptions": "Long before Sora was chosen by his Keyblade, the worlds' safety lay in the hands of the true Keyblade Masters. Three youths - Terra, Ventus and Aqua - have been training long and hard under Master Eraqus to prove that they, too, exhibit the Mark of Mastery. But they will soon find themselvesLong before Sora was chosen by his Keyblade, the worlds' safety lay in the hands of the true Keyblade Masters. Three youths - Terra, Ventus and Aqua - have been training long and hard under Master Eraqus to prove that they, too, exhibit the Mark of Mastery. But they will soon find themselves in the middle of a crisis affecting worlds far beyond their own - just as another Keyblade Master, Xehanort, goes mysteriously missing. Three friends, three destinies. Everything will link back to the beginning.… Expand"}, {"name": "The Last Guardian", "details_link": "https://www.metacritic.com/game/playstation-4/the-last-guardian", "publisher": "SCEA", "release_date": "Dec  6 2016", "developers": ["SCE Japan Studio"], "platforms": "PlayStation 4", "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Fantasy", "Action Adventure", "Linear"], "meta_score": 82, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/7b523e29210fc627237a887c1b0b5758-98.jpg", "descriptions": "It’s an action adventure title. It’s a story about a young boy who has been kidnapped or captured under strange circumstances. It’s about an encounter between that boy and the mysterious beast Trico amidst ancient ruins, and a story about their journey together in the hope of escaping theirIt’s an action adventure title. It’s a story about a young boy who has been kidnapped or captured under strange circumstances. It’s about an encounter between that boy and the mysterious beast Trico amidst ancient ruins, and a story about their journey together in the hope of escaping their mysterious predicament. [Fumito Ueda via Playstation.com]… Expand"}, {"name": "Pro Evolution Soccer 2013", "details_link": "https://www.metacritic.com/game/xbox-360/pro-evolution-soccer-2013", "publisher": "Konami", "release_date": "Sep 25 2012", "developers": ["Konami"], "platforms": ["3DS", "PC", "PlayStation 2", "PlayStation 3", "Xbox 360"], "genres": ["Sports", "Traditional", "Team", "Soccer", "Sim", "Sim"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/0ba87acb661845e585be790798f9ee69-98.jpg", "descriptions": "PES bounds back onto the pitch to showcase new skills. Pro Evolution Soccer 2013 returns to the roots of football with unique levels of control plus major emphasis on the individual style of the world's best players. Thanks to feedback from dedicated fans, PES2013 offers total freedom toPES bounds back onto the pitch to showcase new skills. Pro Evolution Soccer 2013 returns to the roots of football with unique levels of control plus major emphasis on the individual style of the world's best players. Thanks to feedback from dedicated fans, PES2013 offers total freedom to play any kind of ball, which for the first time includes full control over shooting and the first touch. Endorsed by Cristiano Ronaldo, PES promises to push boundaries, reflecting the genius of top level players and capturing the essence of modern teamwork. The result promises to be the most faithful recreation of modern day soccer to date. … Expand"}, {"name": "Sprint Vector", "details_link": "https://www.metacritic.com/game/playstation-4/sprint-vector", "publisher": "Survios", "release_date": "Feb 13 2018", "developers": ["Survios"], "platforms": ["PC", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Other"], "meta_score": 82, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/93f04e6ce93afaf22a7633fdb59e73a4-98.jpg", "descriptions": "Sprint Vector is a ultimate competitive VR game: a multiplayer adrenaline platformer that merges the physical thrill of athletic competition with the unhinged energy of a nuts game show."}, {"name": "Sonic & All-Stars Racing Transformed", "details_link": "https://www.metacritic.com/game/xbox-360/sonic-all-stars-racing-transformed", "publisher": "Sega", "release_date": "Nov 18 2012", "developers": ["Sumo Digital"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 3", "PlayStation Vita", "Wii U", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/82d0d8c97ac86a5ea76bb574527c2c9b-98.jpg", "descriptions": "Sonic and the All-Stars cast battle for supremacy across land, water and air in transforming vehicles that change from cars to boats to planes mid-race."}, {"name": "Technobabylon", "details_link": "https://www.metacritic.com/game/pc/technobabylon", "publisher": "Wadjet Eye Games", "release_date": "May 21 2015", "developers": ["Technocrat"], "platforms": ["iPhone/iPad", "PC"], "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 82, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/0/98a5986bfbc19873107521b6c7c33b44-98.jpg", "descriptions": "Technobabylon takes place in a dystopian cyberpunk future where genetic engineering is the norm, the addictive Trance has replaced almost any need for human interaction, and an omnipresent AI named Central powers the city. Its all-seeing CEL police force keeps tabs on everyone... includingTechnobabylon takes place in a dystopian cyberpunk future where genetic engineering is the norm, the addictive Trance has replaced almost any need for human interaction, and an omnipresent AI named Central powers the city. Its all-seeing CEL police force keeps tabs on everyone... including three people who are about to meet their maker.… Expand"}, {"name": "Madden NFL 09 All-Play", "details_link": "https://www.metacritic.com/game/wii/madden-nfl-09-all-play", "publisher": "Electronic Arts", "release_date": "Aug 12 2008", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 82, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/6472e03dd988f3ded1e0e3aa3d877c75-98.jpg", "descriptions": "Madden NFL 09 All-Play features fun, approachable and innovative gameplay by unleashing the power of the Wii Remote through the all-new EA SPORTS Call Your Shots feature. Call Your Shots allows the player to create his or her own plays on the fly and direct receivers where they should run.Madden NFL 09 All-Play features fun, approachable and innovative gameplay by unleashing the power of the Wii Remote through the all-new EA SPORTS Call Your Shots feature. Call Your Shots allows the player to create his or her own plays on the fly and direct receivers where they should run. Gamers of all skill levels can also enjoy an all-new fast paced 5-on-5 mode which has a reduced field length and big head NFL players.  Experienced Madden players or rookies to the game can utilize the all-new play calling system. No matter the skill level, players can be competitive with three playbooks to choose from, ranging from Easy to Advanced. [Electronic Arts]… Expand"}, {"name": "Shin Megami Tensei: Nocturne", "details_link": "https://www.metacritic.com/game/playstation-2/shin-megami-tensei-nocturne", "publisher": "Atlus Co.", "release_date": "Oct 12 2004", "developers": ["Atlus Co."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 82, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/eb5933f13f534165b45e11986fe99a73-98.jpg", "descriptions": "(Also known as \"Shin Megami Tensei: Lucifer's Call\")  Shin Megami Tensei: Nocturne is actually the third game in the series, which first appeared on the Super Famicom.  Remakes of the first two titles were recently released in Japan for the PlayStation and Game Boy Advance.  While Nocturne(Also known as \"Shin Megami Tensei: Lucifer's Call\")  Shin Megami Tensei: Nocturne is actually the third game in the series, which first appeared on the Super Famicom.  Remakes of the first two titles were recently released in Japan for the PlayStation and Game Boy Advance.  While Nocturne continues the series' tradition of a modern-day post-apocalyptic setting, demonic overtones and mature themes, the PlayStation 2 version brings it into the next-generation of gaming with mind-blowing graphics and refinement of the gameplay system. Set in post-apocalyptic Tokyo, the game begins as nearly the entire population of the world is annihilated by a global catastrophe called the Conception.  Now, the fate of the entire world lies on the shoulders of one boy, who must battle his way through opposing demonic forces and shape the world to come... or destroy it. Yesterday?s foe is today?s ally. Persuade over 100 different demons to join your party. Some demons may evolve into new forms on their own or fuse them to form even more powerful demons. Customize your character with Magatama, living parasites that grant the host demonic powers! Depending on the choices you make, you'll follow one of several ideologies which will ultimately determine the fate of the entire world! Special guest appearance by Dante, from Capcom's Devil May Cry series.  Will he become your most feared enemy or your greatest ally? Over 50 hours of gameplay! [Atlus Software]… Expand"}, {"name": "World of Warcraft: Mists of Pandaria", "details_link": "https://www.metacritic.com/game/pc/world-of-warcraft-mists-of-pandaria", "publisher": "Blizzard Entertainment", "release_date": "Sep 25 2012", "developers": ["Blizzard Entertainment"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Fantasy", "Role-Playing", "Miscellaneous", "Massively Multiplayer Online", "Massively Multiplayer", "Board / Card Game", "Fantasy"], "meta_score": 82, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/c4d63f358637409a91fe9e2a27913ded-98.jpg", "descriptions": "World of Warcraft: Mists of Pandaria is the latest expansion set for WoW, set on the new continent of Pandaria. Unlock The Mysteries of Pandaria.  You've stopped Deathwing's destructive rampage and saved the dragonflights from their extinction. Now you you're tasked with unlocking theWorld of Warcraft: Mists of Pandaria is the latest expansion set for WoW, set on the new continent of Pandaria. Unlock The Mysteries of Pandaria.  You've stopped Deathwing's destructive rampage and saved the dragonflights from their extinction. Now you you're tasked with unlocking the mysteries of the lost continent and discovering the dark secrets of Pandaria's past. Explore ancient kingdoms hidden since before the Sundering, plunder vast treasures from the depths of the forgotten vaults, and prepare to defend Pandaria from the shadow of a long buried evil - before it's too late. … Expand"}, {"name": "NEO: The World Ends With You", "details_link": "https://www.metacritic.com/game/switch/neo-the-world-ends-with-you", "publisher": "Square Enix", "release_date": "Jul 27 2021", "developers": ["Square Enix", "h.a.n.d. Inc."], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 82, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/6c6ce9fb677b0c81fbfdb59b26958775-98.jpg", "descriptions": "\"Only the possibility of you can change our fate\". A long-awaited new story in The World Ends with You series has arrived. Rindo comes to the grim realization that his life is on the line when he is forced to compete in the so-called \"Reapers' Game.\" There's no telling how this tale will\"Only the possibility of you can change our fate\". A long-awaited new story in The World Ends with You series has arrived. Rindo comes to the grim realization that his life is on the line when he is forced to compete in the so-called \"Reapers' Game.\" There's no telling how this tale will unfold—but it's up to you to find out! Put your psychic prowess to the test as you duke it out on the stylishly animated streets of Shibuya. Features:  Delve into a vividly illustrated Shibuya, animated with style, music and monsters. Collect and wield hundreds of Psych abilities to battle surreal threats. Investigate the world around you and beat the \"Reapers' Game\" to survive.… Expand"}, {"name": "Pinball Hall of Fame: The Williams Collection", "details_link": "https://www.metacritic.com/game/playstation-3/pinball-hall-of-fame-the-williams-collection", "publisher": "System 3", "release_date": "Sep 22 2009", "developers": ["Farsight Studios"], "platforms": ["3DS", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Miscellaneous", "Parlor", "Pinball", "Pinball"], "meta_score": 82, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/bcd6af9e64580112d8a06e99222aae95-98.jpg", "descriptions": "Pinball Hall of Fame: The Williams Collection faithfully recreates eight of the most memorable tables from the golden age of pinball in photorealistic 3D. Working closely with Williams to ensure authenticity of each of the games, the collection is highlighted by some of the most popular andPinball Hall of Fame: The Williams Collection faithfully recreates eight of the most memorable tables from the golden age of pinball in photorealistic 3D. Working closely with Williams to ensure authenticity of each of the games, the collection is highlighted by some of the most popular and innovative Williams pinball tables, including Gorgar, the first-ever talking pinball machine, Black Knight, which introduced \"Magna-Save\" and Bonus Ball, and Space Shuttle, which took the pinball industry by storm in 1984. Every table has been meticulously recreated to bring players the visuals, sound effects and gameplay that made these games legendary successes. Pinball Hall of Fame: The Williams Collection harkens back to the arcades of the 1980s. Players begin Pinball Hall of Fame: The Williams Collection with access to four pinball tables, and the remaining four tables are unlocked as the game progresses. Players can spend as little as two minutes on a quick pinball challenge, or delve deeper into the game, gaining rewards in a token-based system as they unlock each of the pinball tables. Single-player Arcade and Challenge modes provide hours of solo entertainment, and a Multiplayer mode lets players face each other head-on. [Crave Entertainment]… Expand"}, {"name": "Splatoon 2: Octo Expansion", "details_link": "https://www.metacritic.com/game/switch/splatoon-2-octo-expansion", "publisher": "Nintendo", "release_date": "Jun 13 2018", "developers": ["Nintendo"], "platforms": "Switch", "genres": ["Action", "Shooter", "Third-Person", "Arcade"], "meta_score": 82, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/f365f921d4d673a83992a40c1854697c-98.jpg", "descriptions": "Play as an Octoling for the very first time in this large-scale downloadable content for the Splatoon 2 game. This full-on single-player adventure spans 80 missions starring Agent 8, a new character who awakens without her memories on a dark subway platform. Navigate this mysteriousPlay as an Octoling for the very first time in this large-scale downloadable content for the Splatoon 2 game. This full-on single-player adventure spans 80 missions starring Agent 8, a new character who awakens without her memories on a dark subway platform. Navigate this mysterious underground test facility in a desperate battle to reach the surface of Inkopolis. Escape from these twisted depths, and you'll finally be able to join multiplayer matches as an Octoling. You may think you know everything about the world of Splatoon, but these waters run deep, and so does the lore. Purchase this content today for immediate access to special octo-themed in-game gear.… Expand"}]