[{"name": "Viviette", "details_link": "https://www.metacritic.com/game/switch/viviette", "publisher": "DYA Games", "release_date": "Dec 20 2018", "developers": ["DYA Games"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/9dce7827bc9f3fb06e14be849c873845-98.jpg", "descriptions": "Uncover the secrets and mysteries of Neuville's Mansion. Test your logic against diverse puzzles, locate and use a variety of items, and don't lose your sense of direction, as navigation itself becomes an obstacle in your path."}, {"name": "SINNER: Sacrifice for Redemption", "details_link": "https://www.metacritic.com/game/switch/sinner-sacrifice-for-redemption", "publisher": "Another Indie", "release_date": "Oct 18 2018", "developers": ["Another Indie"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 58, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/81ba75f702d4f7e1acfadf3c841b826c-98.jpg", "descriptions": "Rise from the depths a crumbling kingdom and to the challenge of defeating increasingly difficult demonic bosses. Choose aspects of yourself to weaken before defeating the avatars of Sin in the action-RPG Sinner: Sacrifice for Redemption. Inspired by classic boss-battlers and modernRise from the depths a crumbling kingdom and to the challenge of defeating increasingly difficult demonic bosses. Choose aspects of yourself to weaken before defeating the avatars of Sin in the action-RPG Sinner: Sacrifice for Redemption. Inspired by classic boss-battlers and modern skill-based action RPGs, with a dash of gothic anime styling and horror storytelling, Sinner promises a thrilling and bone-chilling experience. A lone warrior stands on a strange shore, his mind clouded and his past forgotten, but an unstoppable force drives him on. He is Adam, guilty of a great sin and drawn to this place by powers as secret as they are terrifying. As his home, the Kingdom of Cavanis, languishes in blasphemy, Adam must face a series of trials in a desperate quest for redemption.… Expand"}, {"name": "This is the Police 2", "details_link": "https://www.metacritic.com/game/switch/this-is-the-police-2", "publisher": "Weappy Studio", "release_date": "Sep 25 2018", "developers": ["Weappy Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Virtual", "Career"], "meta_score": 58, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/8/093db10efa9e81b466610dbb83b4023b-98.jpg", "descriptions": "Interpret the law as you see fit. Run the sheriff's department, manage your cops, make tough decisions – and try to keep out of prison yourself – in this story-driven mixture of adventure, strategy, and turn-based tactical combat."}, {"name": "The Long Reach", "details_link": "https://www.metacritic.com/game/switch/the-long-reach", "publisher": "Merge Games", "release_date": "Mar 15 2018", "developers": ["Painted Black Games"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/3/b596d9eed448b0a48fed185c64fa38f8-98.jpg", "descriptions": "The Long Reach is an adventure game filled with colourful characters, puzzles, and a shock of discovery. Wait, weren't we supposed to say, \"joy of discovery?\" That can't be right. The Long Reach takes place in New Hampshire, in the fictional town of Baervox. The game draws its inspirationThe Long Reach is an adventure game filled with colourful characters, puzzles, and a shock of discovery. Wait, weren't we supposed to say, \"joy of discovery?\" That can't be right. The Long Reach takes place in New Hampshire, in the fictional town of Baervox. The game draws its inspiration from Lone Survivor and The Cave and all the classical adventures (except that The Long Reach is set in the present day). You don't play in a post-apocalyptic world or explore a fairy-filled fantasy world. You're in the thick of it, just around the corner from the place where you buy your groceries. [Nintendo]… Expand"}, {"name": "Pixel Heroes: Byte & Magic", "details_link": "https://www.metacritic.com/game/xbox-one/pixel-heroes-byte-magic", "publisher": "Headup Games", "release_date": "Feb  3 2017", "developers": ["Headup Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Role-Playing", "General", "Roguelike"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/73652b429b9def673b29ed02141dc992-98.jpg", "descriptions": "Enter the world of PIXEL HEROES and prepare yourself for a RPG/Roguelike experience."}, {"name": "Duke Nukem Forever: The Doctor Who Cloned Me", "details_link": "https://www.metacritic.com/game/xbox-360/duke-nukem-forever-the-doctor-who-cloned-me", "publisher": "2K Games", "release_date": "Dec 13 2011", "developers": ["Gearbox Software"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 58, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/6cf7af94f1e6d5a2aeb7fe0cf400b08e-98.jpg", "descriptions": "The Doctor Who Cloned Me is bursting with hours of the over-the-top Duke goodness that fans love. Deep in the heart of Area 51, Dr. Proton has been hatching his maniacal plan. Fueled by new ego boosts, Duke is ready to take on evil clones, alien queens and anything else that comes his way inThe Doctor Who Cloned Me is bursting with hours of the over-the-top Duke goodness that fans love. Deep in the heart of Area 51, Dr. Proton has been hatching his maniacal plan. Fueled by new ego boosts, Duke is ready to take on evil clones, alien queens and anything else that comes his way in order to save the world and his babes! This full, new single-player campaign includes brand new weapons, all-new enemy types and bosses, more Achievements/Trophies and many more interactive items within the world.… Expand"}, {"name": "Raving Rabbids: Alive & Kicking", "details_link": "https://www.metacritic.com/game/xbox-360/raving-rabbids-alive-kicking", "publisher": "Ubisoft", "release_date": "Nov  8 2011", "developers": ["Ubisoft"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 58, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/0/2bd6b6edf0d145e102bd70cf3e1c82bb-98.jpg", "descriptions": "Raving Rabbids Alive & Kicking is a game that utilizes the Kinect for the Xbox 360."}, {"name": "Hero of Sparta", "details_link": "https://www.metacritic.com/game/psp/hero-of-sparta", "publisher": "Gameloft", "release_date": "Oct  1 2009", "developers": ["Gameloft"], "platforms": ["iPhone/iPad", "PSP"], "genres": ["Action", "General", "General"], "meta_score": 58, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/1a84881b66b71d07104ff2799fc7c447-98.jpg", "descriptions": "[PSP Minis]   You are King Argos, leader of the courageous Spartan warriors waging war to destroy an evil cult that taints Greece with blood. But destroying their last idol awoke their dark god, and now it's determined to exact revenge! Your fate now lies in its corrupt hands... Battle to[PSP Minis]   You are King Argos, leader of the courageous Spartan warriors waging war to destroy an evil cult that taints Greece with blood. But destroying their last idol awoke their dark god, and now it's determined to exact revenge! Your fate now lies in its corrupt hands... Battle to avoid a tragic death as you journey from the Oracle's Island, through Atlantis and Hades, and finally to the summit of Olympus. You will fight the most phenomenal monsters from mythology, climb the Colossus, defy Cerberus and the Cyclops, and challenge the gods themselves to survive this epic odyssey! [Gameloft]… Expand"}, {"name": "ARKANOID Live!", "details_link": "https://www.metacritic.com/game/xbox-360/arkanoid-live!", "publisher": "Taito Corporation", "release_date": "May  6 2009", "developers": ["Taito Corporation"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "General", "General", "Arcade"], "meta_score": 58, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/4/88a5b8668e0ff62e27efe8a9d967a928-98.jpg", "descriptions": "The classic ARKANOID comes back to life in HD! Destroy every block on screen in ARKANOID Live! by bouncing an Energy Ball against them with your Vaus! It's the all-time classic arcade game now with achievements and multiplayer co-op play over Xbox Live. Arcade classic: ARKANOID was one ofThe classic ARKANOID comes back to life in HD! Destroy every block on screen in ARKANOID Live! by bouncing an Energy Ball against them with your Vaus! It's the all-time classic arcade game now with achievements and multiplayer co-op play over Xbox Live. Arcade classic: ARKANOID was one of the all-time classic arcade games that sparked a huge number of imitators. Now you can play the game in glorious high-def. Tons of gameplay: The full version contains 62 rounds divided into two episodes that can be played under either Lives Rules or Barrier Rules. A boss awaits you in the last round of each episode: DOH, as well as a new boss, SKULL. Multiplayer: Defeat the game with a friend in co-op play or compete online against other players over Xbox LIVE and aim for the top. [Taito]… Expand"}, {"name": "DreamWorks Over the Hedge: Hammy Goes Nuts", "details_link": "https://www.metacritic.com/game/psp/dreamworks-over-the-hedge-hammy-goes-nuts", "publisher": "Activision", "release_date": "Nov 21 2006", "developers": ["Amaze Entertainment"], "platforms": "PSP", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 58, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/da6a4fbc06cecef563d07e1055e64103-98.jpg", "descriptions": "Over the Hedge: Hammy Goes Nuts! is an all-new adventure based on the woodland creatures from DreamWorks Animation's hit film Over the Hedge. Fan favorite Hammy the squirrel leads RJ the raccoon, Verne the turtle and all-new forest friends on another daring trip into the 'burbs. When Hammy’sOver the Hedge: Hammy Goes Nuts! is an all-new adventure based on the woodland creatures from DreamWorks Animation's hit film Over the Hedge. Fan favorite Hammy the squirrel leads RJ the raccoon, Verne the turtle and all-new forest friends on another daring trip into the 'burbs. When Hammy’s beloved cable TV goes out, his buddies have to scramble through the neighborhood to restore the signal - and Hammy’s happiness. [Activision]… Expand"}, {"name": "Defender", "details_link": "https://www.metacritic.com/game/xbox-360/defender", "publisher": "Midway", "release_date": "Nov 15 2006", "developers": ["Digital Eclipse"], "platforms": "Xbox 360", "num_players": "2  Online", "genres": ["Action", "Simulation", "Shooter", "Shooter", "Space", "Third-Person", "Scrolling", "Combat", "Sci-Fi", "Arcade"], "meta_score": 58, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/f9c866f65eff30b729313f8da6664503-98.jpg", "descriptions": "[Xbox Live Arcade]  Protect the humans on the planet surface by destroying the invading alien abductors. In the future, the galaxy is invaded by hostile alien forces. Attacking in countless swarms, the aliens decimate any planet they encounter. Those who survive the initial invasions are[Xbox Live Arcade]  Protect the humans on the planet surface by destroying the invading alien abductors. In the future, the galaxy is invaded by hostile alien forces. Attacking in countless swarms, the aliens decimate any planet they encounter. Those who survive the initial invasions are harvested and forced serve the alien invaders. Mankind's only hope lies in you, the Defender. Classic and enhanced modes: Play this arcade classic the way it was back in the day, or play it with sound and visual enhancements for next-gen. Full Xbox Live support: Access leaderboards for single player, versus, co-op, and weekly stats, and earn 12 achievements for a total of 200 gamerpoints. Multiplayer mania: Test your skills against rivals or team up with your friends. Play on or offline in co-op or versus mode, combining your scores or matching them against each other for the win. [Microsoft]… Expand"}, {"name": "SD Gundam Force: Showdown!", "details_link": "https://www.metacritic.com/game/playstation-2/sd-gundam-force-showdown!", "publisher": "Bandai", "release_date": "Oct 11 2004", "developers": ["Tom Create"], "platforms": "PlayStation 2", "genres": ["Action", "Shooter", "Third-Person", "Sci-Fi"], "meta_score": 58, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/9/3f6193b571378c7b23d3e33cde1fac7e-98.jpg", "descriptions": "Play as your favorite Gundam Force character from the hit TV series and save the peaceful capitol Neotopia from a mysterious evil force. Featuring characters from the hit TV series; play as Captain Gundam, Zero the Winged Knight or Musha Bakunetsumaru - select their weapon, collect items andPlay as your favorite Gundam Force character from the hit TV series and save the peaceful capitol Neotopia from a mysterious evil force. Featuring characters from the hit TV series; play as Captain Gundam, Zero the Winged Knight or Musha Bakunetsumaru - select their weapon, collect items and head into battle. Original storyline and never-seen-before characters: Battle across 3 worlds to defeat the Dimensional Pirates. Rescue Shute from the Dimension Halo and destroy this evil empire from the past. [Bandai]… Expand"}, {"name": "ShellShock: Nam '67", "details_link": "https://www.metacritic.com/game/xbox/shellshock-nam-67", "publisher": "Eidos Interactive", "release_date": "Sep 14 2004", "developers": ["Guerrilla"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Historic"], "meta_score": 58, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/fde3772ff39b0720d6c848cc5e3d09ea-98.jpg", "descriptions": "As a rookie soldier on your first tour of duty, you'll experience all the fear, chaos, and atrocities of the Vietnam War. From the napalm bombardments of civilian villages and the gruesome Viet Cong booby traps to the permanent threat of invisible foes and deadly ambushes, ShellShock: NamAs a rookie soldier on your first tour of duty, you'll experience all the fear, chaos, and atrocities of the Vietnam War. From the napalm bombardments of civilian villages and the gruesome Viet Cong booby traps to the permanent threat of invisible foes and deadly ambushes, ShellShock: Nam '67 puts you in the middle of brutal warfare. Fight your way through a variety of missions ranging from large-scale battlefield encounters with the North Vietnamese Army to stealth-based missions such as assassinating a Viet Cong general. You can use not only a range of U.S. weaponry, but also the enemies' own weapons. … Expand"}, {"name": "Jack the Ripper", "details_link": "https://www.metacritic.com/game/pc/jack-the-ripper", "publisher": "The Adventure Company", "release_date": "Jan 29 2004", "developers": ["Galilea Multimedia"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "3D", "First-Person", "Modern", "Modern"], "meta_score": 58, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/2c40afbb71301608dfa20ea03865fc22-98.jpg", "descriptions": "While writing a series of articles about horrible murders in the Low Side District of New York, the young reporter Jimmy Palmer will soon become involved in a game of cat and mouse with an illusive and deadly character - Jack the Ripper. Along Palmer's dark journey he will foster aWhile writing a series of articles about horrible murders in the Low Side District of New York, the young reporter Jimmy Palmer will soon become involved in a game of cat and mouse with an illusive and deadly character - Jack the Ripper. Along Palmer's dark journey he will foster a friendship with a young singer, Abigail, the \"Irish Nightingale,\" and meet numerous other colorful characters of this poor district. Beginning with the search of witnesses to the crimes, Palmer's snooping will soon lead him to investigate suspects. His daily editorials trigger the interest of the serial killer himself, who begins to correspond with Palmer via the newspaper, leading Palmer to surmise that this killer is the infamous Jack the Ripper! [Adventure Company]… Expand"}, {"name": "X2: Wolverine's Revenge", "details_link": "https://www.metacritic.com/game/xbox/x2-wolverines-revenge", "publisher": "Activision", "release_date": "Apr 15 2003", "developers": ["GenePool"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 58, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/f8e4d9f186965735c53b289322de4b26-98.jpg", "descriptions": "X-Men's most dangerous weapon is out for vengeance.  In X2 Wolverine's Revenge, you play as Wolverine as he rushes to find the antidote to a virus that was implanted into his body.  Unsheathe your razor-sharp claws, unleash lethal combo attacks, and use accelerated healing powers as you tearX-Men's most dangerous weapon is out for vengeance.  In X2 Wolverine's Revenge, you play as Wolverine as he rushes to find the antidote to a virus that was implanted into his body.  Unsheathe your razor-sharp claws, unleash lethal combo attacks, and use accelerated healing powers as you tear into intense action and stealth scenarios.  Face off with Sabretooth, Wendigo, Juggernaut, and Magneto, while Professor X and Beast help you search for a cure. As Wolverine, you can become the ultimate fighting machine.… Expand"}, {"name": "Heroes of Might and Magic IV: Winds of War", "details_link": "https://www.metacritic.com/game/pc/heroes-of-might-and-magic-iv-winds-of-war", "publisher": "3DO", "release_date": "Feb 26 2003", "developers": ["3DO"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Turn-Based", "Fantasy", "General", "Fantasy"], "meta_score": 58, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/7/edd99e5597ef48eca98f7d28e08937ce-98.jpg", "descriptions": "In Heroes of Might and Magic IV: Winds of War, players are transported to the land of Channon, a large and populous kingdom occupying most of Axeoth's northern continent. The shining capital city has become the target of no less than five invading armies who covet its lands and riches.In Heroes of Might and Magic IV: Winds of War, players are transported to the land of Channon, a large and populous kingdom occupying most of Axeoth's northern continent. The shining capital city has become the target of no less than five invading armies who covet its lands and riches. Players assume the roles of five conquerors, each staging his own uniquely driven invasion, before facing a showdown for ultimate control. [3DO]… Expand"}, {"name": "Star Wars: Jedi Power Battles", "details_link": "https://www.metacritic.com/game/game-boy-advance/star-wars-jedi-power-battles", "publisher": "THQ", "release_date": "Nov 21 2002", "developers": ["HotGen"], "platforms": "Game Boy Advance", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 58, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/5/39e0660d1d64a2d3d8bd3b2ee4c20f8d-98.jpg", "descriptions": "THQ is bringing the Episode I-based 3D action game to the Game Boy Advance."}, {"name": "BMX XXX", "details_link": "https://www.metacritic.com/game/xbox/bmx-xxx", "publisher": "Acclaim", "release_date": "Nov 10 2002", "developers": ["Z-Axis", "Ltd."], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 58, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/c6d4caee726c367b04f7e7f0b7f1cd8b-98.jpg", "descriptions": "BMX XXX combines outrageous Hollywood humor and characters, beautiful women from New York's famous Scores club, incredible arcade action, and a dynamic soundtrack from current recording artists into one interactive entertainment experience. Laced with mature content, the game featuresBMX XXX combines outrageous Hollywood humor and characters, beautiful women from New York's famous Scores club, incredible arcade action, and a dynamic soundtrack from current recording artists into one interactive entertainment experience. Laced with mature content, the game features Create-a-Rider mode, over 2,000 different tricks, eight massive levels, and a split-screen multiplayer mode for up to four players. The version for the PlayStation 2 has been edited to eliminate the topless nudity, while versions for the Xbox and the Nintendo GameCube do contain nudity. … Expand"}, {"name": "RLH: Run Like Hell", "details_link": "https://www.metacritic.com/game/playstation-2/rlh-run-like-hell", "publisher": "Interplay", "release_date": "Sep 27 2002", "developers": ["Digital Mayhem"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 58, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/0/ddb341848f4f49b9d4d778f2be095dcf-98.jpg", "descriptions": "Run Like Hell puts you into the most suspenseful sci-fi adventure you can imagine. Try to stay alive and combat the danger that lurks around every dark corner. Intelligent alien foes learn from your actions to become even more dangerous. Some things are worse than death. [Interplay]"}, {"name": "Mobile Suit Gundam: Journey to Jaburo", "details_link": "https://www.metacritic.com/game/playstation-2/mobile-suit-gundam-journey-to-jaburo", "publisher": "Bandai", "release_date": "Aug  6 2001", "developers": ["Bandai"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 58, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/9/6dccf460c461c1dd239c88cff6e63f76-98.jpg", "descriptions": "Gundam fanatics take notice!  PS2's first game based on the popular animae TV series takes players back to the One Year War with an epic storyine and mission-based gameplay."}, {"name": "The King of Fighters XII", "details_link": "https://www.metacritic.com/game/playstation-3/the-king-of-fighters-xii", "publisher": "Ignition Entertainment", "release_date": "Jul 24 2009", "developers": ["SNK Playmore"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 57, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/d194ed45502b6a7443fdc6bd9af5c99a-98.jpg", "descriptions": "The legendary 3-on-3 fighting game series that united rival brawlers from SNK Playmore's classic arcade franchises celebrates its 15th Anniversary in style with the release of The King of Fighters XII. For the first time in its history, this epic martial arts showdown has undergone aThe legendary 3-on-3 fighting game series that united rival brawlers from SNK Playmore's classic arcade franchises celebrates its 15th Anniversary in style with the release of The King of Fighters XII. For the first time in its history, this epic martial arts showdown has undergone a complete graphical overhaul.  The antiquated character sprites used over the past 14 years have been dropped in favor of all-new, high-resolution fighters fluidly animating across painstakingly detailed, 100% hand-drawn backgrounds. [SNK Playmore]… Expand"}, {"name": "Mario Party: Island Tour", "details_link": "https://www.metacritic.com/game/3ds/mario-party-island-tour", "publisher": "Nintendo", "release_date": "Nov 22 2013", "developers": ["Nintendo", "Nd Cube"], "platforms": "3DS", "genres": ["Party", "Miscellaneous", "Party", "Party / Minigame"], "meta_score": 57, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/1/19d72d17e6ac860dc1dff47010651cd4-98.jpg", "descriptions": "The game features seven different game boards, each with its own set of rules. The game offers 81 new mini-games that test speed, concentration and luck. In addition to the board game elements, players are be able to play mini-games exclusively or try their hands at a 30-floor tower climb,The game features seven different game boards, each with its own set of rules. The game offers 81 new mini-games that test speed, concentration and luck. In addition to the board game elements, players are be able to play mini-games exclusively or try their hands at a 30-floor tower climb, AR Card games and StreetPass battles.… Expand"}, {"name": "Transformers: Dark of the Moon", "details_link": "https://www.metacritic.com/game/playstation-3/transformers-dark-of-the-moon", "publisher": "Activision", "release_date": "Jun 14 2011", "developers": ["High Moon Studios"], "platforms": ["3DS", "Xbox 360", "PlayStation 3"], "num_players": "Up to 10 ", "genres": ["Action", "Action Adventure", "General", "General", "Linear"], "meta_score": 57, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/7/72b3bdfe82dea6ce1942e3c054e60e89-98.jpg", "descriptions": "Transformers: Dark of the Moon thrusts players into an original storyline that takes place before the events of the film."}, {"name": "Kirby Battle Royale", "details_link": "https://www.metacritic.com/game/3ds/kirby-battle-royale", "publisher": "Nintendo", "release_date": "Jan 19 2018", "developers": ["Nintendo", "HAL Labs"], "platforms": "3DS", "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party / Minigame"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/55a33ab040ec30de3cc5dc65351e86f8-98.jpg", "descriptions": "Kirby is entering a tournament against his toughest rival yet…himself! 1-4 players can fight in local or online*battles. Pick from 10+ abilities and 10 battle types to compete in countless matchups. Hoard treasure in Ore Express, knock out opponents in Slam Hockey, shoot missiles at RoboKirby is entering a tournament against his toughest rival yet…himself! 1-4 players can fight in local or online*battles. Pick from 10+ abilities and 10 battle types to compete in countless matchups. Hoard treasure in Ore Express, knock out opponents in Slam Hockey, shoot missiles at Robo Bonkers, and more! There's a single-player story mode too. As you uncover King Dedede's nefarious plan, you'll unlock abilities and battle types in the Cake Royale tournament. In this competition, you’ll learn the basics of battle while earning Boost Orbs that power up Kirby, as well as nostalgic headgear to wear in other modes, and even a new playable character. Then dive into battle! 4 players can enjoy battling together via local wireless*, Online Ranked mode, or with Download Play. Compete in 2-on-2 or Free-For-All battles. May the last Kirby standing win. [Nintendo]… Expand"}, {"name": "Typoman", "details_link": "https://www.metacritic.com/game/wii-u/typoman", "publisher": "Headup Games", "release_date": "Nov 19 2015", "developers": ["Brainseed Factory"], "platforms": "Wii U", "genres": ["Action", "Platformer", "2D"], "meta_score": 57, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/6f9310504b250ee12663bd739e869bac-98.jpg", "descriptions": "Typoman is a 2D puzzle platformer distinguished by a unique game world. You slip into the role of the HERO struggling to make your way through a dark, surreal world. Despite your small stature you have a powerful gift: You can use letters to alter your environment."}, {"name": "Datura", "details_link": "https://www.metacritic.com/game/playstation-3/datura", "publisher": "SCEA", "release_date": "May  8 2012", "developers": ["Plastic", "Plastic Studios"], "platforms": "PlayStation 3", "genres": ["Miscellaneous", "General", "General"], "meta_score": 57, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/db386968212ef7656164a7e0ccb65caa-98.jpg", "descriptions": "Finding yourself in a mysterious forest, you will navigate your way through the game by controlling your character's hand using Playstation Move technology. From here, you are immersed into the game's unique experimental narrative and original way of interaction, which enables you toFinding yourself in a mysterious forest, you will navigate your way through the game by controlling your character's hand using Playstation Move technology. From here, you are immersed into the game's unique experimental narrative and original way of interaction, which enables you to experience the world not only visually, but also empirically - an illusion that you can actually touch trees, faces, and other objects.… Expand"}, {"name": "Naruto Shippuden: Kizuna Drive", "details_link": "https://www.metacritic.com/game/psp/naruto-shippuden-kizuna-drive", "publisher": "Namco Bandai Games America", "release_date": "Mar 22 2011", "developers": ["Premium Agency"], "platforms": "PSP", "genres": ["Action", "General", "General"], "meta_score": 57, "users_score": 4.5, "image": "https://static.metacritic.com/images/products/games/9/ca2b09ae6f78cfcd44ce6051548d5c05-98.jpg", "descriptions": "Following an all-new story, NARUTO SHIPPUDEN: Kizuna Drive pits Naruto and friends against an unseen foe responsible for the disappearance of ninja from Hidden Leaf Village. New game-exclusive characters will descend onto the scene and unexpected plot twists are revealed as players discoverFollowing an all-new story, NARUTO SHIPPUDEN: Kizuna Drive pits Naruto and friends against an unseen foe responsible for the disappearance of ninja from Hidden Leaf Village. New game-exclusive characters will descend onto the scene and unexpected plot twists are revealed as players discover who seeks vengeance upon Naruto.… Expand"}, {"name": "Stranded Sails: Explorers of the Cursed Islands", "details_link": "https://www.metacritic.com/game/switch/stranded-sails-explorers-of-the-cursed-islands", "publisher": "Merge Games", "release_date": "Oct 17 2019", "developers": ["Lemonbomb Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/2966e1f95b2f5ef488466645ad8a7840-98.jpg", "descriptions": "Stranded Sails is an open world exploration farming adventure full of discoveries and quests! Along with your crew you are ship-wrecked on a mysterious archipelago. Now it's up to you to secure your survival and solve the mysteries deep in the heart of the islands – and finally escape."}, {"name": "Vancouver 2010 - The Official Video Game of the Olympic Winter Games", "details_link": "https://www.metacritic.com/game/pc/vancouver-2010---the-official-video-game-of-the-olympic-winter-games", "publisher": "Sega", "release_date": "Jan 15 2010", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 57, "users_score": 3.5, "image": "https://static.metacritic.com/images/products/games/3/6d4c6574740707ba03efbafa137de4e5-98.jpg", "descriptions": "Experience the thrill and adrenaline of the Olympic Winter Games of Vancouver 2010. Carve your way down the slopes and across the ice as you aim to reach the pinnacle of your sport and claim a gold medal for your country. Featuring only the fastest, highest and most spectacular events fromExperience the thrill and adrenaline of the Olympic Winter Games of Vancouver 2010. Carve your way down the slopes and across the ice as you aim to reach the pinnacle of your sport and claim a gold medal for your country. Featuring only the fastest, highest and most spectacular events from the Olympic Winter Games, Vancouver 2010 immerses the player, first person, in the adrenaline, danger and glory of the world’s greatest winter multisport event. Feel the speed and adrenaline of the athletes at the Olympic Winter Games at each Olympic venue; hurtle down mountains, ice runs, over jumps and around ice rinks. 14 Premium events in which to earn gold - Including giant slalom, snowboard cross, downhill and bobsleigh, every event focused on speed or danger, and most on both. Fine tune your skills in a range of challenge modes. Such as 'Smashing the Snowmen' and 'Speed Bands' in a first for this kind of mode in an official Olympic title. Take your snow boots online. Set a new world record and see if anybody can knock you off the top of the leaderboard. Defeat your friends online or in the front room. Earn the ultimate bragging rights in up to 4 player split-screen action, or in online head-to-head competition. [Sega]… Expand"}, {"name": "Undercover: Operation Wintersun", "details_link": "https://www.metacritic.com/game/pc/undercover-operation-wintersun", "publisher": "Lighthouse Interactive", "release_date": "Aug 28 2007", "developers": ["Sproing Interactive Media", "Sproing"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "General", "General", "Point-and-Click"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/9dd06ae839d3c260465424dba259e8d0-98.jpg", "descriptions": "In 1943, Hitler’s Germany is performing scientific research on nuclear fission intending to produce nuclear energy as well as nuclear weaponry. In Undercover: Operation Wintersun players slip into the role of British scientist Dr. John Russell. Hired by Britain's Secret Service MI6, you mustIn 1943, Hitler’s Germany is performing scientific research on nuclear fission intending to produce nuclear energy as well as nuclear weaponry. In Undercover: Operation Wintersun players slip into the role of British scientist Dr. John Russell. Hired by Britain's Secret Service MI6, you must serve your country, the Crown, and the world by investigating this dangerous mission to prevent the Nazis from building a devastating bomb. Best described as an enthralling point & click adventure set in WWII, Undercover features a powerful spy-thriller theme with suspenseful situations. Although the story is purely fictitious, historical \"Second World War\" facts remain highly authentic establishing a compelling gameplay experience. [Lighthouse Interactive]… Expand"}, {"name": "Dirge of Cerberus: Final Fantasy VII", "details_link": "https://www.metacritic.com/game/playstation-2/dirge-of-cerberus-final-fantasy-vii", "publisher": "Square Enix", "release_date": "Aug 15 2006", "developers": ["Square Enix"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 57, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/dc834af5c239dc7654067fa98eb8bedb-98.jpg", "descriptions": "The time has come to cleanse this world. Hunt down the unworthy...and show them no mercy. Three years have passed since the events of FINAL FANTASY VII. Buried alive following the Meteor disaster, a mysterious group known as the DG (Deepground) Soldiers emerges and begins raiding the city.The time has come to cleanse this world. Hunt down the unworthy...and show them no mercy. Three years have passed since the events of FINAL FANTASY VII. Buried alive following the Meteor disaster, a mysterious group known as the DG (Deepground) Soldiers emerges and begins raiding the city. The enigmatic Vincent Valentine is somehow connected to these attacks, and he may be the only one who can save this shattered world. When the world is engulfed in darkness, his gun will toll a dreadful dirge... Other characters from FINAL FANTASY VII join Vincent on his journey, and as the story unfolds, you will bear witness to shocking truths never revealed in the original game.… Expand"}, {"name": "Fade to Silence", "details_link": "https://www.metacritic.com/game/pc/fade-to-silence", "publisher": "THQ Nordic", "release_date": "Apr 30 2019", "developers": ["Black Forest Games"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 57, "users_score": 4.7, "image": "https://static.metacritic.com/images/products/games/7/40938781963eb1b6ea41bb2d6685c346-98.jpg", "descriptions": "Fade to Silence is a Survival-RPG set in the cold and deadly world of a post-apocalyptic winter. You assume the role of Ash, a natural but tormented leader, exploring a post-apocalyptic frozen wasteland, gathering the resources necessary to establish a refuge for survival. With dwindlingFade to Silence is a Survival-RPG set in the cold and deadly world of a post-apocalyptic winter. You assume the role of Ash, a natural but tormented leader, exploring a post-apocalyptic frozen wasteland, gathering the resources necessary to establish a refuge for survival. With dwindling supplies, simple tasks like upgrading equipment and collecting materials require an immediate expedition to scavenge the necessary items. In the search for survival materials, players must navigate a vast territory, in which they will encounter Eldritch monsters and an even greater foe; the unrelenting winter. While freezing temperatures constantly take their toll on Ash, the deadliest event is a constant threat – a blizzard. If caught by surprise, it takes every ounce of skill, determination and luck to survive.… Expand"}, {"name": "OK K.O.! Let's Play Heroes", "details_link": "https://www.metacritic.com/game/xbox-one/ok-ko!-lets-play-heroes", "publisher": "Cartoon Network", "release_date": "Jan 23 2018", "developers": ["Capy Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/0/617192aa6ff444a0d67b40d50694e8ab-98.jpg", "descriptions": "Let's Play Heroes is a retro-style beat-'em-up with light RPG elements. Like the television show from which it was spun off, Let's Play Heroes is set in the town of Lakewood Plaza and stars KO, an aspiring superhero who works at a convenience store for other superheroes. As KO, players fightLet's Play Heroes is a retro-style beat-'em-up with light RPG elements. Like the television show from which it was spun off, Let's Play Heroes is set in the town of Lakewood Plaza and stars KO, an aspiring superhero who works at a convenience store for other superheroes. As KO, players fight through side-scrolling stages and acquire POW cards, which allow them to call in other characters from the series for a powerful attack.… Expand"}, {"name": "Kuon", "details_link": "https://www.metacritic.com/game/playstation-2/kuon", "publisher": "Agetec Inc.", "release_date": "Dec  7 2004", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 57, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/92ea556db40e0953b2d0da88fc925644-98.jpg", "descriptions": "The tune of Japanese Taiko Drums and the Dark Hymns of children are heard throughout the night. Residents wander like ghosts, and hungry demons creep in the darkness. The Heian-kyo Period of Ancient Japan where mysticism and magic will require you to reach deep within your soul to uncoverThe tune of Japanese Taiko Drums and the Dark Hymns of children are heard throughout the night. Residents wander like ghosts, and hungry demons creep in the darkness. The Heian-kyo Period of Ancient Japan where mysticism and magic will require you to reach deep within your soul to uncover the mysteries of the undead. A dark 3D adventure that comes to life in stunning detail with atmospheric lighting, shadows, and special effects. Battle Demons in Real-Time combat using magic, summons, and traditional Heian weaponry. Uncut & Uncensored- See the Directors Original Vision of Horror. You are prey to some of the most visually stunning and imaginative monsters ever seen. [Agetec Inc.]… Expand"}, {"name": "Dragon Ball: Raging Blast 2", "details_link": "https://www.metacritic.com/game/xbox-360/dragon-ball-raging-blast-2", "publisher": "Namco Bandai Games", "release_date": "Nov  2 2010", "developers": ["Spike"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "3D", "3D"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/4/f868a455ad2c9fa37a7925e5bde6f6ec-98.jpg", "descriptions": "Dragon Ball Z fans can rest assured that the destructible environment, and character trademark attacks and transformations will be true to the series. These include signature Pursuit Attacks which enable players to initiate attack combo strings, juggling your opponent in a string ofDragon Ball Z fans can rest assured that the destructible environment, and character trademark attacks and transformations will be true to the series. These include signature Pursuit Attacks which enable players to initiate attack combo strings, juggling your opponent in a string of devastating strikes throughout the environment. Additionally, Dragon Ball: Raging Blast 2 will sport the new Raging Soul System which enables characters to reach a special state, increasing their combat abilities to the ultimate level. Sporting more than 90 characters, 20 of which are brand new to the Raging Blast series, new modes, and additional environmental effects, Dragon Ball: Raging Blast 2 is the next evolution in the home console series. … Expand"}, {"name": "Sonic Forces", "details_link": "https://www.metacritic.com/game/playstation-4/sonic-forces", "publisher": "SegaSoft", "release_date": "Nov  7 2017", "developers": ["SegaSoft", "Sonic Team"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "3D"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/7/3da1c1bd2b387aa66a62210481f0e9b6-98.jpg", "descriptions": "In Eggman's greatest victory to date, the evil doctor has conquered much of the world with a mysterious new power. A resistance comprised of Sonic's friends is formed to fight back, and in the midst of the chaos and destruction, an unlikely hero will rise up to help Modern and Classic SonicIn Eggman's greatest victory to date, the evil doctor has conquered much of the world with a mysterious new power. A resistance comprised of Sonic's friends is formed to fight back, and in the midst of the chaos and destruction, an unlikely hero will rise up to help Modern and Classic Sonic take back the world. Even these three heroes may have their work cut out for them, as Dr. Eggman has a new ally of his own...… Expand"}, {"name": "Fantastic 4", "details_link": "https://www.metacritic.com/game/game-boy-advance/fantastic-4", "publisher": "Activision", "release_date": "Jun 27 2005", "developers": ["Torus Games"], "platforms": ["PlayStation 2", "Game Boy Advance"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/6fc02e3db026d42cf9c8b69ba6c28614-98.jpg", "descriptions": "Based on the 2005 movie of the same name, Fantastic Four lets you control the team of superheroes known as the Fantastic 4. Each character possesses a unique set of abilities that you can use and combine in the hunt for Doctor Doom. The game includes single-player, cooperative, andBased on the 2005 movie of the same name, Fantastic Four lets you control the team of superheroes known as the Fantastic 4. Each character possesses a unique set of abilities that you can use and combine in the hunt for Doctor Doom. The game includes single-player, cooperative, and two-player versus modes. … Expand"}, {"name": "Group S Challenge", "details_link": "https://www.metacritic.com/game/xbox/group-s-challenge", "publisher": "Capcom", "release_date": "Nov 11 2003", "developers": ["Capcom"], "platforms": "Xbox", "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/6f7c91c3c2579596643574751fa0eabb-98.jpg", "descriptions": "Group S Challenge delivers high-performance circuit racing with realism and fast action. In one of more than 50 street machines by a variety of car manufacturers, you'll circle the globe in real-world cityscape courses, including Tokyo, Monaco, and Australia. In Circuit mode, you'll raceGroup S Challenge delivers high-performance circuit racing with realism and fast action. In one of more than 50 street machines by a variety of car manufacturers, you'll circle the globe in real-world cityscape courses, including Tokyo, Monaco, and Australia. In Circuit mode, you'll race against challenging competitors for money to upgrade your car. You can even watch your highlights in the Replay Theatre, and then challenge your friend to a split-screen multiplayer race.… Expand"}, {"name": "Teenage Mutant Ninja Turtles", "details_link": "https://www.metacritic.com/game/gamecube/teenage-mutant-ninja-turtles", "publisher": "Konami", "release_date": "Oct 31 2003", "developers": ["Konami"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 57, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/2559e68630f1fc4cb84a08f0a428dab6-98.jpg", "descriptions": "Be your favorite Teenage Mutant Ninja Turtle and master your ninja skills in their action-packed world.  Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of foot ninjas.   Find scrolls to unlock specialBe your favorite Teenage Mutant Ninja Turtle and master your ninja skills in their action-packed world.  Roam NYC streets, scour underground sewers and fight your way across rooftops on a collision course with The Shredder and his vile pack of foot ninjas.   Find scrolls to unlock special attack moves and effects.  Interact with characters from the animated television series, such as Splinter and Casey Jones.  Don't hide in your shell--be a hero.… Expand"}, {"name": "The Cameron Files: Pharaoh's Curse", "details_link": "https://www.metacritic.com/game/pc/the-cameron-files-pharaohs-curse", "publisher": "DreamCatcher Interactive", "release_date": "Oct 29 2002", "developers": ["Galilea Multimedia"], "platforms": "PC", "num_players": "1 Player", "genres": ["Adventure", "3D", "Modern", "Third-Person", "Modern"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/3f778902f0475b27ff52d6a5eb33b95c-98.jpg", "descriptions": "An Ancient Evil Awakes... and the Pharaoh no longer slumbers. Investigate the disappearance of the Pharaoh. An ancient ritual revisited awakens a Pharaoh long dead and entombed. You must piece together the clues to discover the real reason why the mummy is missing. [Dreamcatcher]"}, {"name": "Tactical Ops: Assault on Terror", "details_link": "https://www.metacritic.com/game/pc/tactical-ops-assault-on-terror", "publisher": "Atari", "release_date": "Apr 24 2002", "developers": ["Kamehan Studios"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 57, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/dc921ae45f86cecbf2f93070f674205c-98.jpg", "descriptions": "As a member of the elite Special Forces unit stop terrorists from massacring hostages and escaping. Play as a terrorist and gun down Special Forces units in cold blood and prevent them from rescuing hostages. Teams are awarded with cash based on their performance in the round. Money can buyAs a member of the elite Special Forces unit stop terrorists from massacring hostages and escaping. Play as a terrorist and gun down Special Forces units in cold blood and prevent them from rescuing hostages. Teams are awarded with cash based on their performance in the round. Money can buy new weapons, items and inventory. [Infogrames]… Expand"}, {"name": "Wolfenstein 3D", "details_link": "https://www.metacritic.com/game/game-boy-advance/wolfenstein-3d", "publisher": "Bam Entertainment", "release_date": "Mar 31 2002", "developers": ["Stalker Entertainment"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "Game Boy Advance"], "genres": ["Action", "Shooter", "First-Person", "Historic"], "meta_score": 57, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/4db8c84ffbccc462a383513a199b084e-98.jpg", "descriptions": "A Nazi stronghold awaits, and only you can smash your way into its hidden depths, blowing away enemy scum as you go. Ammo up - this is the game the Computer Gaming World Hall of Fame credits as helping shape the computer gaming industry! Id Software's classic powerhouse is back - and now inA Nazi stronghold awaits, and only you can smash your way into its hidden depths, blowing away enemy scum as you go. Ammo up - this is the game the Computer Gaming World Hall of Fame credits as helping shape the computer gaming industry! Id Software's classic powerhouse is back - and now in the palm of your hand! Let the carnage begin.… Expand"}, {"name": "Supercar Street Challenge", "details_link": "https://www.metacritic.com/game/playstation-2/supercar-street-challenge", "publisher": "Activision", "release_date": "Oct 22 2001", "developers": ["Exakt"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Driving", "Racing", "GT / Street"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/9a05590b4eae1b89eaf9a4b12dd11527-98.jpg", "descriptions": "Design your own exotic supercar in the Styling Studio or choose one of 9 elite vehicles including the Salem S7 and the Lotus Concept Vehicle M220 to race on 23 courses in 7 cities, each with multiple routes and shortcuts.  [Activision]"}, {"name": "Dragon Valor", "details_link": "https://www.metacritic.com/game/playstation/dragon-valor", "publisher": "Namco", "release_date": "Oct 16 2000", "developers": ["Namco"], "platforms": "PlayStation", "num_players": "1 Player", "genres": ["Role-Playing", "Action RPG"], "meta_score": 57, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/6/790ec6f3dcc5bf8c8aa25bec036d3c08-98.jpg", "descriptions": "The branching family tree adds a measure of replay value, but the game is average enough that few will want to play it through more than once."}, {"name": "Curious George", "details_link": "https://www.metacritic.com/game/xbox/curious-george", "publisher": "Namco", "release_date": "Feb  1 2006", "developers": ["Monkey Bar Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/407f47d69f5e3628ff42ed9cb047a03f-98.jpg", "descriptions": "Curious George is a colorful action adventure that is based on the Curious George animated movie. In the game you can help George explore a variety of areas, collect items such as bananas, and unlock minigames. The game features a variety of different objectives set in areas from the movie.Curious George is a colorful action adventure that is based on the Curious George animated movie. In the game you can help George explore a variety of areas, collect items such as bananas, and unlock minigames. The game features a variety of different objectives set in areas from the movie. You can also unlock scenes from the movie, extra costumes, and production art.… Expand"}, {"name": "Landit Bandit", "details_link": "https://www.metacritic.com/game/playstation-3/landit-bandit", "publisher": "The Bearded Ladies Consulting", "release_date": "Jul 13 2010", "developers": ["The Bearded Ladies Consulting"], "platforms": "PlayStation 3", "genres": ["Simulation", "Flight", "Helicopter", "Civilian"], "meta_score": 57, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/329e95a9b416320c31fc14ff157b9d15-98.jpg", "descriptions": "[Playstation Network]  Landit Bandit is a 3D helicopter game for the Playstation 3. It combines modern technology with retro design to provide a unique experience for console gamers. Defy gravity over 20 levels in either singleplayer or co-op splitsscreen campaign mode, or battle your[Playstation Network]  Landit Bandit is a 3D helicopter game for the Playstation 3. It combines modern technology with retro design to provide a unique experience for console gamers. Defy gravity over 20 levels in either singleplayer or co-op splitsscreen campaign mode, or battle your friends in 6 different duels. The game comes with intuitive controls that will have you playing instantly, but make no mistake, this gem rewards both skill and training. Whether you are mastering the art of the ninjarope to shave valuable seconds of that online highscore or attempting that epic coconut throw at your splitscreen opponent, Landit Bandit promises to keep you coming back.… Expand"}, {"name": "Medieval Lords: Build, Defend, Expand", "details_link": "https://www.metacritic.com/game/pc/medieval-lords-build-defend-expand", "publisher": "O3 Entertainment", "release_date": "Nov 24 2005", "developers": ["Monte Cristo Multimedia", "Monte Cristo"], "platforms": "PC", "genres": ["Strategy", "City Building", "Management", "Historic", "Government"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/dff701ebf971953327357d60061fc85e-98.jpg", "descriptions": "Medieval Lords: Build, Defend, Expand challenges aspiring city governors to build and manage thriving cities, protect against invasions from neighbouring kingdoms, and expand into new territories - all in the city building genre's first 3D environment that lets the player zoom right into theMedieval Lords: Build, Defend, Expand challenges aspiring city governors to build and manage thriving cities, protect against invasions from neighbouring kingdoms, and expand into new territories - all in the city building genre's first 3D environment that lets the player zoom right into the action and build anywhere on the map. \r\rMedieval Lords brings city builders inside the walls of richly-detailed cities during the middle ages. Through the course of ten scenarios, players must manage finances, population, and food resources to evolve towns into thriving kingdoms. Build docks for fishing local waters, harvest fields to grow food and raise livestock, keep citizens healthy and entertained, and recruit soldiers and cavalry for a well-defended city. [Monte Cristo]… Expand"}, {"name": "Sacred 3", "details_link": "https://www.metacritic.com/game/pc/sacred-3", "publisher": "Deep Silver", "release_date": "Jul 31 2014", "developers": ["Deep Silver"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "Up to 4 ", "genres": ["Action RPG", "Role-Playing", "Action RPG"], "meta_score": 57, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/8/ae7bb91463cf6b8228eb0fb2402fb926-98.jpg", "descriptions": "After decades of peace a new shadow is cast over the world of Ancaria. Only if the clans from across the lands combine their skills the glimmer of hope left within the resistance will ignite a fierce battle for peace."}, {"name": "Disney's TRON: Evolution", "details_link": "https://www.metacritic.com/game/pc/disneys-tron-evolution", "publisher": "Disney Interactive Studios", "release_date": "Dec  7 2010", "developers": ["Propaganda Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Action Adventure", "General", "Fantasy", "General", "Fantasy"], "meta_score": 57, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/3a6a67edff8b65f785be4b843b9aca2a-98.jpg", "descriptions": "Set during the era between the two TRON films, TRON: Evolution conveys the story of significant events within the TRON mythology. The game features an epic adventure across a massive digital world filled with high-mobility disc-based combat and advanced light cycles. TRON: Evolution is oneSet during the era between the two TRON films, TRON: Evolution conveys the story of significant events within the TRON mythology. The game features an epic adventure across a massive digital world filled with high-mobility disc-based combat and advanced light cycles. TRON: Evolution is one of the keys to unlocking the TRON mythology. The game's story takes place before the film \"TRON: Legacy\" events and provides insight into the film's past. As an integrated entertainment experience, the film references elements of the game's story. As part of the connection between the game and film, actress Olivia Wilde stars as Quorra in TRON: Evolution. Wilde's voice and likeness as Quorra provide players with another direct link to the film as they discover how earlier events within the world of TRON shape her character’s future. [Disney Interactive Studios]… Expand"}, {"name": "Monster Harvest", "details_link": "https://www.metacritic.com/game/switch/monster-harvest", "publisher": "Merge Games", "release_date": "Aug 31 2021", "developers": ["Maple Powered Games"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Strategy", "General", "Trainer"], "meta_score": 57, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/0/c9961736e0ba29a5b043e1978de4c2b8-98.jpg", "descriptions": "Monster Harvest is a monster collecting and farming action RPG with a twist. Grow, collect and mutate your crops then take them into battle! Filled with places to discover and multiple ways to build your farm, get ready to craft, explore and battle across the vibrant world of Planimal Point."}, {"name": "Need for Speed ProStreet", "details_link": "https://www.metacritic.com/game/psp/need-for-speed-prostreet", "publisher": "EA Games", "release_date": "Feb 18 2008", "developers": ["EA Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PSP"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 57, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/e0e116cbd826bf001241fbb3a3493af8-98.jpg", "descriptions": "Need for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting yourNeed for Speed ProStreet accelerates street racing culture by providing the ultimate stage for the pursuit of street racing supremacy. It is a game about building the ultimate performance-tuned battle machine, taking it to multi-disciplinary showdowns all over the world and pitting your skills and reputation against the very best street racers. Need for Speed ProStreet boasts impeccable precision and impressively detailed photo-realistic graphics, effectively transporting you to the center of the action. It pushes the Autosculpt technology to a new level, allowing you to directly impact your car's performance for the first time as well as personalize its appearance. Need for Speed ProStreet is a true taste of raw adrenaline and racing with consequences. Every dent, every scratch and every crumpled body panel is a battle scar, proof of your commitment and competitive mettle. With an aggressive and skilled AI system, you become immersed in an unmatched believable race experience. Add in a revolutionary online mode that will redefine the meaning of competitive social play, and Need for Speed ProStreet is the ultimate formula for an emotionally charged street racing showdown. [Electronic Arts]… Expand"}, {"name": "Lifeless Planet: Premier Edition", "details_link": "https://www.metacritic.com/game/xbox-one/lifeless-planet-premier-edition", "publisher": "Stage 2 Studios", "release_date": "May 13 2015", "developers": ["Stage 2 Studios"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action Adventure", "Sci-Fi", "General"], "meta_score": 57, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/6/9b43f7412b409b4289fc5f3c36e5d36e-98.jpg", "descriptions": "Lifeless Planet is a new 3D PC action adventure, independently developed by David Board and Alaska-based Stage 2 Studios and to be published world-wide by Lace Mamba Global in Q4 2012. The game puts players in the moon-boots of a volunteer astronaut on a one-way mission to a life-bearingLifeless Planet is a new 3D PC action adventure, independently developed by David Board and Alaska-based Stage 2 Studios and to be published world-wide by Lace Mamba Global in Q4 2012. The game puts players in the moon-boots of a volunteer astronaut on a one-way mission to a life-bearing planet far outside our solar system. But after a rough landing, the promise of a new Earth soon fades with the discovery that the planet he was to explore is now barren and inhospitable.… Expand"}, {"name": "Call of Duty: Modern Warfare 3 - Defiance", "details_link": "https://www.metacritic.com/game/ds/call-of-duty-modern-warfare-3---defiance", "publisher": "Activision", "release_date": "Nov  8 2011", "developers": ["n-Space"], "platforms": "DS", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 57, "users_score": 1.2, "image": "https://static.metacritic.com/images/products/games/4/1cf874ec882cda788b7a1d2762ca346b-98.jpg", "descriptions": "A sequel to the $1 billion-grossing shooter Modern Warfare 2 is in development at Infinity Ward."}, {"name": "Driver '76", "details_link": "https://www.metacritic.com/game/psp/driver-76", "publisher": "Ubisoft", "release_date": "May  8 2007", "developers": ["Sumo Digital"], "platforms": "PSP", "num_players": "1-2 ", "genres": ["Driving", "Racing", "Car Combat", "Arcade", "Mission-based", "Automobile"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/67cbc2700bdea18aa7f0acef5f606bb7-98.jpg", "descriptions": "Faithful to the brand spirit, Driver '76 is an action driving game that features Hollywood-style car chases while also letting the player experience the open environment on foot. The game thrusts the player into the heart of the 1970s, through 27 missions divided into six main plots. PlayersFaithful to the brand spirit, Driver '76 is an action driving game that features Hollywood-style car chases while also letting the player experience the open environment on foot. The game thrusts the player into the heart of the 1970s, through 27 missions divided into six main plots. Players can take side jobs, earning cash that can be used to modify their rides. Driver '76 also offers an extensive multiplayer mode and a host of mini-games ranging from street races to all out carnage in Destruction Derby mode.  Prequel Storyline to Driver Parallel Lines – The year is 1976, two years before Driver Parallel Lines. Multiplayer Games and Downloadable Content – Games include Street Racing, Destruction Derby, Pink Slip Racing and Swap Meet.  Also download new paintjobs to use on your collected vehicles in the garage. Experience Open Environments in Authentic 1970's New York – All the architecture, music, cars and clothes of the '70s. Spans New York from Jersey to Coney Island. Vehicle Modification System – Collect your favorite vehicles and complete side job missions to get the cash to modify your ride. High-Speed Hollywood Racing Action – High-speed car races and crashes. Go even faster by customizing your car with special parts. Authentic '70s Soundtrack – Immerse yourself in the '70s with classic songs from the decade. [Ubisoft]… Expand"}, {"name": "Little Dragons Cafe", "details_link": "https://www.metacritic.com/game/playstation-4/little-dragons-cafe", "publisher": "Aksys Games", "release_date": "Aug 24 2018", "developers": ["Aksys Games"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Business / Tycoon"], "meta_score": 57, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/4/8160bb5bf2bea5c583ae4b5a916b9a87-98.jpg", "descriptions": "Little Dragons Cafe is the brand new simulation title from Yasuhiro Wada, father of the Harvest Moon series. Manage your own cafe, work together with the quirky staff members and raise your dragon in order to save your mum from her sudden deep sleep. Features:\n\n* Raise your very ownLittle Dragons Cafe is the brand new simulation title from Yasuhiro Wada, father of the Harvest Moon series. Manage your own cafe, work together with the quirky staff members and raise your dragon in order to save your mum from her sudden deep sleep. Features:* Raise your very own dragon: Embrace your nurturing instincts and raise your own dragon! Through wise decisions, proper nutrition, and empathetic nurturing show the world the true potential of your dragon companion!* Create culinary masterpieces and run a successful cafe: Learn new recipes and master the art of cooking while running your cafe. Explore the world, discover new ingredients, and expand your menu (and your restaurant!) while catering to the whims of your customers.* Farm the land and harvest nature's bounty: The best dishes use the freshest ingredients, and the best way to ensure that is to grow your own produce. Till the land and fish the rivers, and gather the most flavourful fixings for your signature dishes.* Serve the townsfolk, make them happy: Not only cook for the people in your town, but also help them with their problems to increase your popularity and the general happiness of everyone around you.… Expand"}, {"name": "Dynasty Warriors 9", "details_link": "https://www.metacritic.com/game/pc/dynasty-warriors-9", "publisher": "Koei Tecmo Games", "release_date": "Feb 13 2018", "developers": ["Omega Force"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Open-World", "Action", "Beat-'Em-Up", "3D"], "meta_score": 57, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/9/9b55668cfdc391d008e8a0575e320aa8-98.jpg", "descriptions": "In Dynasty Warriors 9, players will explore China as it existed when feudal warlords vied for dominance over the land -- the waning days of the Han dynasty and emergence of the Three Kingdoms era. Setting out to complete various objectives, players will utilise an unprecedented world map toIn Dynasty Warriors 9, players will explore China as it existed when feudal warlords vied for dominance over the land -- the waning days of the Han dynasty and emergence of the Three Kingdoms era. Setting out to complete various objectives, players will utilise an unprecedented world map to navigate and traverse a variety of different landscapes ranging from vast plains to snow-covered peaks presented with dynamic day/night and weather cycles. Exploring these impressive environments is made more engaging through the ability to adapt to surroundings to gain an upper hand in battle, with players able to use equipment to circumvent obstacles or blend in to avoid conflict.… Expand"}, {"name": "Micro Machines World Series", "details_link": "https://www.metacritic.com/game/xbox-one/micro-machines-world-series", "publisher": "Codemasters", "release_date": "Jun 30 2017", "developers": ["Codemasters", "Just Add Water"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 12 ", "genres": ["Racing", "General", "Arcade", "Automobile"], "meta_score": 57, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/4/567878322d5eca7ad2a603d55c923630-98.jpg", "descriptions": "Whether driving the Spy Car destroying a Hovercraft with a NERF Blaster in the Games Room, or the Dump Truck blowing up a Tank with a Dynamite Launcher in the garden, Micro Machines World Series will have players of all ages smiling from ear-to-ear while delivering absolute carnage."}, {"name": "Frontline: Fields of Thunder", "details_link": "https://www.metacritic.com/game/pc/frontline-fields-of-thunder", "publisher": "Paradox Interactive", "release_date": "Apr  9 2007", "developers": ["Nival Interactive", "N-Game Studios"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "Historic"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/99f966eaf7a94ad3989d34a4bac52c7a-98.jpg", "descriptions": "Frontline: Fields of Thunder follows in the footsteps of the original \"Blitzkrieg\" and incorporates the best aspects of the now classic RTS games. The battle at the Kursk Salient was Germany's last attempt to avoid defeat in World War II. This conflict was marked by a ferocity that had beenFrontline: Fields of Thunder follows in the footsteps of the original \"Blitzkrieg\" and incorporates the best aspects of the now classic RTS games. The battle at the Kursk Salient was Germany's last attempt to avoid defeat in World War II. This conflict was marked by a ferocity that had been previously unseen by either side and has been remembered as the largest tank engagement in world history. Highly detailed Battle Map: Lots of data is included in the different chapter maps, including more geographical data and historical dislocation data of the real troops that will change ac­cording to the real historical timeline. Streamlined and intuitive interface. Unit parameters and the battle dynamics based on historically accurate data. Two historically correct campaigns that encompass 20 thrilling missions, most of which will be based on accurate historical episodes. New Units: Three to four new units will be added to the unit pool in an effort to more ac­curately depict the actual, historical events. New Rewards: The game features new awards, medals and promotions to suit the historical period of the game. Multiplayer functionality, including 10 multiplayer missions that can be played both on LAN and over the Nival.Net Internet service. [Paradox Interactive]… Expand"}, {"name": "Sinner: Sacrifice for Redemption", "details_link": "https://www.metacritic.com/game/playstation-4/sinner-sacrifice-for-redemption", "publisher": "Another Indie", "release_date": "Oct 18 2018", "developers": ["DarkStar Games"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 3.9, "image": "https://static.metacritic.com/images/products/games/9/467acc8f8f3ffeed4a79862b3a37739c-98.jpg", "descriptions": "Emerge from the depths a crumbling kingdom and to the challenge of defeating increasingly difficult demonic bosses. Choose aspects of yourself to weaken before defeating the avatars of Sin."}, {"name": "Ghost Mania", "details_link": "https://www.metacritic.com/game/wii/ghost-mania", "publisher": "Legendo Entertainment", "release_date": "Jan  3 2011", "developers": ["Legendo Entertainment"], "platforms": "Wii", "num_players": "1-2 ", "genres": ["Action", "Puzzle", "General", "Stacking"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/5f616eda4e1877bdfaec12515cbe54c0-98.jpg", "descriptions": "Ghost Mania is an original puzzle game for players of all ages, offering a new twist on the falling-block genre. Build and expand colored stacks of ghosts and blocks in any direction and any number. The game features multiple single- and two-player modes, including a relaxed and thoughtfulGhost Mania is an original puzzle game for players of all ages, offering a new twist on the falling-block genre. Build and expand colored stacks of ghosts and blocks in any direction and any number. The game features multiple single- and two-player modes, including a relaxed and thoughtful puzzle mode, an arcade mode and a variety of two-player modes such as Battle and Enduro. The game centers on the misadventures of Becky and Tim, a pair of ghost guardians who've just lost their jobs. Having fallen asleep on active duty, they accidentally let all the ghosts escape from the Spirit World. Help Becky and Tim get their jobs back so they can return to the Spirit World. Catch the runaway ghosts before it's too late.… Expand"}, {"name": "Space Chimps", "details_link": "https://www.metacritic.com/game/xbox-360/space-chimps", "publisher": "Brash Entertainment", "release_date": "Jul 15 2008", "developers": ["Red Tribe"], "platforms": ["PC", "PlayStation 2", "Xbox 360"], "num_players": "1-2 ", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 57, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/2/d053792c6d6f527497d49402269470d5-98.jpg", "descriptions": "Unleash your inner-chimp! Play as both Ham the Third and Luna with your space chimp crew to free the  imprisoned aliens of the Planet Malgor. You must use your brains and acrobatic brawn to survive thick alien jungles, escape dry desolate canyons and well guarded dungeons in order to defeatUnleash your inner-chimp! Play as both Ham the Third and Luna with your space chimp crew to free the  imprisoned aliens of the Planet Malgor. You must use your brains and acrobatic brawn to survive thick alien jungles, escape dry desolate canyons and well guarded dungeons in order to defeat the Evil Zartog and find your way home. [Brash Entertainment]… Expand"}, {"name": "NBA", "details_link": "https://www.metacritic.com/game/psp/nba", "publisher": "SCEA", "release_date": "Mar 16 2005", "developers": ["989 Sports"], "platforms": "PSP", "num_players": "2  Online", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 57, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/0/a26d18447b37c93dae6f08d4f45b7d4c-98.jpg", "descriptions": "The first, real basketball simulation ever created for handheld entertainment systems. NBA for the PSP provides gamers with all the fast-breaks, precision passing, and above the rim action that fans have come to expect from their sport. Supporting multiple players via a Wireless multiplayerThe first, real basketball simulation ever created for handheld entertainment systems. NBA for the PSP provides gamers with all the fast-breaks, precision passing, and above the rim action that fans have come to expect from their sport. Supporting multiple players via a Wireless multiplayer connectivity, NBA for PSP tests the skills of all hoopsters with a variety of gameplay options including an all-new Practice Mode, Play Off Mode and Full Season Mode complete with simulation, trades, free agent lists, injuries and challenging basketball. Additionally, NBA for PSP offers gamers a selection of mini games, including Paint Mode, where gamers compete in a color-the-court challenge, the 989 Sports Skills Challenge Mode, similar to an All-Star type competition, and the 3-point Challenge. During both single and multi-player gameplay, NBA for PSP features the 'Clutch' Shooting Mechanism, where a gamers skill and timing along their ability to pull off spin moves, jukes, pump fakes and other special moves will determine if the shot goes in or clanks off the rim. [SCEA]… Expand"}, {"name": "Dynasty Warriors 7", "details_link": "https://www.metacritic.com/game/playstation-3/dynasty-warriors-7", "publisher": "Koei Tecmo Games", "release_date": "Mar 29 2011", "developers": ["Omega Force"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "3D"], "meta_score": 57, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/f8f451dcbcba29448d98811754891cc0-98.jpg", "descriptions": "In the new Story Mode, follow the ascent and fall of heroes. In Dynasty Warriors 7, experience a new Story Mode and follow the captivating story of our Kingdoms battling for rule of China. Experience the individual tales of the Shu, Wu, Wei and the new Jin kingdomes as they shape China fromIn the new Story Mode, follow the ascent and fall of heroes. In Dynasty Warriors 7, experience a new Story Mode and follow the captivating story of our Kingdoms battling for rule of China. Experience the individual tales of the Shu, Wu, Wei and the new Jin kingdomes as they shape China from the warring chaos at the end of the Later Han period to the division of the Land into Three Kingdoms. Take your faction through this key point in history and tell the story of the Dynasty that rose to seize power and unify the country once again. Immerce yourself in the epic scale of each Kingdom's story, viewing events from the eyes of a different character in each stage. Now is your chance to live through an intense historical drama of greetings and goodbyes, friendships, feuds and rivalries.… Expand"}, {"name": "Akiba's Trip: Undead & Undressed", "details_link": "https://www.metacritic.com/game/playstation-3/akibas-trip-undead-undressed", "publisher": "XSEED Games", "release_date": "Aug 12 2014", "developers": ["Acquire"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Open-World"], "meta_score": 57, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/7e9b4d77d559ce338cc167879bb8d191-98.jpg", "descriptions": "An open-world action RPG which sees players undertaking a myriad of missions in a recreation of Akihabara, Tokyo's notorious \"Electric Town\" district. Your goal is to identify vampires called \"Synthisters\" with the assistance of an in-game smartphone app, then engage them in battle to stripAn open-world action RPG which sees players undertaking a myriad of missions in a recreation of Akihabara, Tokyo's notorious \"Electric Town\" district. Your goal is to identify vampires called \"Synthisters\" with the assistance of an in-game smartphone app, then engage them in battle to strip off their clothes so their bodies are fully exposed to sunlight.… Expand"}, {"name": "Dragon Ball Z: Harukanaru Densetsu", "details_link": "https://www.metacritic.com/game/ds/dragon-ball-z-harukanaru-densetsu", "publisher": "Atari", "release_date": "Jun  5 2007", "developers": ["Bec"], "platforms": "DS", "num_players": "1-4 ", "genres": ["Strategy", "Miscellaneous", "Turn-Based", "Card Battle", "Card Battle"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/9/aa417cc8bde6512d5cfa3eb219172ca3-98.jpg", "descriptions": "Dragon Ball Z Harukanaru Densetsu is an all new DBZ experience for the Nintendo DS. Harukanaru Densetsu combines strategic card based gameplay and role playing to deliver a game that is easy to understand but hard to master. Players' progression is determined through their use of the cardsDragon Ball Z Harukanaru Densetsu is an all new DBZ experience for the Nintendo DS. Harukanaru Densetsu combines strategic card based gameplay and role playing to deliver a game that is easy to understand but hard to master. Players' progression is determined through their use of the cards to evolve characters, strengthen moves and create new moves. [Namco Bandai Games]… Expand"}, {"name": "Star Wars: Lethal Alliance", "details_link": "https://www.metacritic.com/game/ds/star-wars-lethal-alliance", "publisher": "Ubisoft", "release_date": "Dec 14 2006", "developers": ["Ubisoft Casablanca"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sci-Fi", "Sci-Fi", "General"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/01934e3bbd4bbc2bb38cdbb820a499e6-98.jpg", "descriptions": "Combine the elite weaponry and acrobatic skills of Rianna with the multifunctional defensive and slicing support of Zeeo to create a formidable team. Only by working together can you complete perilous missions and ultimately steal the plans for the Death Star. From the chaotic planet ofCombine the elite weaponry and acrobatic skills of Rianna with the multifunctional defensive and slicing support of Zeeo to create a formidable team. Only by working together can you complete perilous missions and ultimately steal the plans for the Death Star. From the chaotic planet of Coruscant to the dusty, dangerous alleys of Mos Eisley, Rianna and Zeeo must use an arsenal of tricks to complete their mission. Set up holographic disguises to fool Imperial guards, commandeer gun turrets, master death-defying flying escapes and battle carnivorous beasts. First original Star Wars game built exclusively for handhelds: Multiplayer modes enhance collaborative gameplay while taking advantage of the unique capabilities of both the PSP system and Nintendo DS. Your mission takes you to classic destinations such as the Death Star and Tatooine, and allows you to discover never-before-seen locations on Despayre, Danuta and Alderaan. Each new environment offers encounters with unforgettable Star Wars characters and species, including Boba Fett, Kyle Katarn, Princess Leia Organa, Darth Vader, Imperial officers, Rodians, Quarren and stormtroopers. [Ubisoft]… Expand"}, {"name": "Armored Core: Nine Breaker", "details_link": "https://www.metacritic.com/game/playstation-2/armored-core-nine-breaker", "publisher": "Agetec Inc.", "release_date": "Sep 13 2005", "developers": ["From Software"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Simulation", "Sci-Fi", "Mech"], "meta_score": 57, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/0/ebf655598b5cffc019d2bafc56477df3-98.jpg", "descriptions": "Nine Breaker is the 9th overall installment of the Armored Core series, and it features two main game modes: Mission and Arena. There are more than 150 kinds of airframe to choose from, and there is a web ranking mode for players to post their results in training and missions. The gameNine Breaker is the 9th overall installment of the Armored Core series, and it features two main game modes: Mission and Arena. There are more than 150 kinds of airframe to choose from, and there is a web ranking mode for players to post their results in training and missions. The game features an automatic generation function, which allows players to fight against mechs with randomly generated parts at any point.… Expand"}, {"name": "Special Forces: Team X", "details_link": "https://www.metacritic.com/game/xbox-360/special-forces-team-x", "publisher": "Atari", "release_date": "Feb  6 2013", "developers": ["Zombie Studios"], "platforms": ["PC", "Xbox 360"], "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/2/140ae77592418da091288f1d10a01fcd-98.jpg", "descriptions": "STX is a team-centered Third-Person cover-based shooter. The game features a map selection system with the ability to shape the battlefield by selecting individual environmental pieces, resulting in over 100 map variations. STX allows for asymmetric game play with two to four teams and 5STX is a team-centered Third-Person cover-based shooter. The game features a map selection system with the ability to shape the battlefield by selecting individual environmental pieces, resulting in over 100 map variations. STX allows for asymmetric game play with two to four teams and 5 frenetic game modes. Cooperative play between team members is rewarded. Customize your skills, weapons and character to tailor your tactics and performance in battle. STX brings you the brutality of war as you take on the role of an elite soldier in a Special Forces squad. … Expand"}, {"name": "Sea Life Safari", "details_link": "https://www.metacritic.com/game/xbox-360/sea-life-safari", "publisher": "Sierra Online", "release_date": "Jun 18 2008", "developers": ["Wanako Studios"], "platforms": "Xbox 360", "num_players": "1 Player", "genres": ["Adventure", "General", "General"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/70489bce707116465369709ad7bfba57-98.jpg", "descriptions": "[Xbox Live Arcade]  Embark on a journey the whole family can enjoy in Sea Life Safari. Make a splash as an underwater photographer tasked with capturing the most incredible pictures of wild sea animals. Entice your subjects into playful poses, provoke photo-worthy reactions, and reel in[Xbox Live Arcade]  Embark on a journey the whole family can enjoy in Sea Life Safari. Make a splash as an underwater photographer tasked with capturing the most incredible pictures of wild sea animals. Entice your subjects into playful poses, provoke photo-worthy reactions, and reel in those picture-perfect scores. 60+ animated creatures: Photograph the sparkling personalities of fascinating underwater sea animals to build memorable albums and your own personal scrapbook. Explore unique destinations from the colorful Coral Reef to the murky Ship Graveyard, filled with countless treasures to discover. Family-friendly tutorial: Experience a fully interactive tutorial teaching simple step-by-step instructions on how to become a great deep-sea photographer. Educational photo evaluations: Learn the names of each of your sea creature subjects and see how your photographs rank as you are scored on four different criteria: size, orientation, centering, and interaction with each fish. Discover secret routes, collect hidden items, and encounter special appearances by unique day and night creatures. [WildTangent]… Expand"}, {"name": "FireStarter", "details_link": "https://www.metacritic.com/game/pc/firestarter", "publisher": "Hip Games", "release_date": "Mar  5 2004", "developers": ["GSC Game World"], "platforms": "PC", "num_players": "1-32 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 57, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/7/3006efe4ac0c603f1c96996dc42b1cce-98.jpg", "descriptions": "The game is set in year 2010 where player's conscience is entrapped by an up-to-date virus-infected virtual reality-playing machine called FireStarter. The virus-caused failure resulted in computer changing the rules of the game - to break out of the trap, the player is to complete the gameThe game is set in year 2010 where player's conscience is entrapped by an up-to-date virus-infected virtual reality-playing machine called FireStarter. The virus-caused failure resulted in computer changing the rules of the game - to break out of the trap, the player is to complete the game within 48 hours. Immerse in an unbelievable world, created by super-modern playing machine, where you are to make it a winner of the adrenaline-brimming action. [GSC Game World]… Expand"}, {"name": "Robin Hood: Defender of the Crown", "details_link": "https://www.metacritic.com/game/xbox/robin-hood-defender-of-the-crown", "publisher": "Capcom", "release_date": "Nov 11 2003", "developers": ["Atomic Planet Entertainment"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Strategy", "Turn-Based", "Historic"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/595120058f1007274adde006b8602393-98.jpg", "descriptions": "Take on the role of Robin Hood on a quest to restore peace in England.  The evil Prince John has taken control of England and you must battle your way through the country in a wide range of action sequences restore the throne to the rightful king.  Your mastery of five types of medievalTake on the role of Robin Hood on a quest to restore peace in England.  The evil Prince John has taken control of England and you must battle your way through the country in a wide range of action sequences restore the throne to the rightful king.  Your mastery of five types of medieval combat, including archery, jousting, sword fighting, siege warfare, and army battles, is vital in defeating your foes.  The game blends action with strategy and RPG elements to immerse the player in the epic tale of Robin Hood.… Expand"}, {"name": "The Princess Guide", "details_link": "https://www.metacritic.com/game/switch/the-princess-guide", "publisher": "NIS America", "release_date": "Mar 26 2019", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 57, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/810acb19c3874ee2fc0648c09362693b-98.jpg", "descriptions": "In a land torn by chaos and war, a new evil rises. Now, four princesses from four different kingdoms must learn how to lead their people to victory. Commence the Princess Knight training regimen! As an experienced knight, you will choose a princess to become your apprentice. Teach her theIn a land torn by chaos and war, a new evil rises. Now, four princesses from four different kingdoms must learn how to lead their people to victory. Commence the Princess Knight training regimen! As an experienced knight, you will choose a princess to become your apprentice. Teach her the art of war, and push back the evil that threatens to take over the land! With your choices directly impacting the way your Princess Knight fights, The Princess Guide gives military training a whole new meaning.… Expand"}, {"name": "Faery: Legends of Avalon", "details_link": "https://www.metacritic.com/game/playstation-3/faery-legends-of-avalon", "publisher": "Focus Home Interactive", "release_date": "Jan 12 2011", "developers": ["Spiders"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Role-Playing", "General", "General"], "meta_score": 57, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/0/1eb4c2e12bc1a156aee42caa74a80848-98.jpg", "descriptions": "Faery: Legends of Avalon is a Role Playing / Adventure game packed with an original and unique atmosphere, and a graphics design close to illustration. The game immerses players in a fantasy world inhabited by many colourful characters and magical creatures."}, {"name": "Sonic Forces", "details_link": "https://www.metacritic.com/game/switch/sonic-forces", "publisher": "SegaSoft", "release_date": "Nov  7 2017", "developers": ["Sonic Team"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General", "Platformer", "3D"], "meta_score": 57, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/ed7ec22c16f0e3ccee09ab5e129b9a6f-98.jpg", "descriptions": "In Eggman's greatest victory to date, the evil doctor has conquered much of the world with a mysterious new power. A resistance comprised of Sonic's friends is formed to fight back, and in the midst of the chaos and destruction, an unlikely hero will rise up to help Modern and Classic SonicIn Eggman's greatest victory to date, the evil doctor has conquered much of the world with a mysterious new power. A resistance comprised of Sonic's friends is formed to fight back, and in the midst of the chaos and destruction, an unlikely hero will rise up to help Modern and Classic Sonic take back the world. Even these three heroes may have their work cut out for them, as Dr. Eggman has a new ally of his own...… Expand"}, {"name": "CrimeCraft", "details_link": "https://www.metacritic.com/game/pc/crimecraft", "publisher": "Vogster", "release_date": "Aug 25 2009", "developers": ["Vogster"], "platforms": "PC", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 57, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/1/644f6b3d9e4876dff5e1e6c7db538389-98.jpg", "descriptions": "CrimeCraft is a Persistent World Next-gen Shooter (PWNS) that blends a gripping, action-packed shooter experience with the best community and role-playing elements found in massively multi-player games. CrimeCraft is set in a gritty fictional city of the near future, following an ecologicalCrimeCraft is a Persistent World Next-gen Shooter (PWNS) that blends a gripping, action-packed shooter experience with the best community and role-playing elements found in massively multi-player games. CrimeCraft is set in a gritty fictional city of the near future, following an ecological disaster of unprecedented scale, where the price of life is far less valuable than one’s reputation. Join thousands of players online as you learn the rules of the street, build your own gang and do whatever it takes to survive amidst the chaos. Earn a reputation. Build a gang. Kill the competition. [Vogster]… Expand"}, {"name": "Naruto: Path of the Ninja", "details_link": "https://www.metacritic.com/game/ds/naruto-path-of-the-ninja", "publisher": "Tomy Corporation", "release_date": "Oct 23 2007", "developers": ["TOSE"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 57, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/7/c7c15101d97e8abf8b365f6865fe8994-98.jpg", "descriptions": "Based on episodes from VIZ Media's hit anime series Shonen Jump Naruto, the new game features a unique time-based combat system in which players must determine each character's strengths and use them accurately to help them defeat the enemy. Choosing from six available characters, playersBased on episodes from VIZ Media's hit anime series Shonen Jump Naruto, the new game features a unique time-based combat system in which players must determine each character's strengths and use them accurately to help them defeat the enemy. Choosing from six available characters, players explore the Village Hidden in the Leaves and the world of Naruto as they roam across forests, fields, rivers and mountains. Along the way players encounter bosses and enemies that they must use their special techniques to defeat. [D3Publisher of America]… Expand"}, {"name": "Destiny 2: Curse of Osiris", "details_link": "https://www.metacritic.com/game/xbox-one/destiny-2-curse-of-osiris", "publisher": "Activision", "release_date": "Dec  5 2017", "developers": ["Bungie"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 57, "users_score": 1.5, "image": "https://static.metacritic.com/images/products/games/2/5ffe1e563049be0bcb3ae31869da5956-98.jpg", "descriptions": "Destiny 2 Expansion I: Curse of Osiris continues your Guardian’s journey with all-new story missions and adventures set in a new destination, Mercury. Journey through time and space to learn the secrets of Osiris, avert a dark future, and rebuild the ties between the legendary Warlock andDestiny 2 Expansion I: Curse of Osiris continues your Guardian’s journey with all-new story missions and adventures set in a new destination, Mercury. Journey through time and space to learn the secrets of Osiris, avert a dark future, and rebuild the ties between the legendary Warlock and his greatest student - Ikora Rey.… Expand"}, {"name": "Shadow Puppeteer", "details_link": "https://www.metacritic.com/game/wii-u/shadow-puppeteer", "publisher": "Snow Cannon Games", "release_date": "Jan 28 2016", "developers": ["Sarepta studio"], "platforms": ["PC", "Wii U"], "genres": ["Action", "Platformer", "3D"], "meta_score": 57, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/0/89fbae050ea3ec99eb0170ffcfee2164-98.jpg", "descriptions": "Play with light and darkness in this co-op puzzle platformer. The game melds platforming with puzzle-solving in a feast of light and shadow. With a Nordic yet original art style, the game tells the story of a boy and his shadow."}, {"name": "Of Orcs and Men", "details_link": "https://www.metacritic.com/game/playstation-3/of-orcs-and-men", "publisher": "Focus Home Interactive", "release_date": "Oct 16 2012", "developers": ["Cyanide", "Spiders"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG", "Western-Style"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/039329ae0d3100e087ca3869a799b429-98.jpg", "descriptions": "Of Orcs and Men first puts you into the role of an elite Orc soldier from the legendary legion of Bloodjaws, a league of warriors deeply involved in the war opposing the Orcs and Goblins on one side to their persecutors, Humankind. As a veteran warrior who has seen the most brutal ofOf Orcs and Men first puts you into the role of an elite Orc soldier from the legendary legion of Bloodjaws, a league of warriors deeply involved in the war opposing the Orcs and Goblins on one side to their persecutors, Humankind. As a veteran warrior who has seen the most brutal of battles, you are appointed by the Orc commander to complete a mission that could change the course of the war: kill the one man responsible for all of this bloodshed, the one who has, for years, exhorted the human masses to loath and fight the green-skinned people: the Emperor himself.… Expand"}, {"name": "Body and Brain Connection", "details_link": "https://www.metacritic.com/game/xbox-360/body-and-brain-connection", "publisher": "Namco Bandai Games", "release_date": "Feb  8 2011", "developers": ["Namco Bandai Games"], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Puzzle", "Logic", "Logic"], "meta_score": 57, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/5/c38121f860ed61c3b50035619d24f2e7-98.jpg", "descriptions": "Brain Age Kinect is a brain training title from Namco Bandai. Dr. Ryuta Kawashima, cocreator of the DS Brain Age series. Also known as \"Dr. Kawashima's Body and Brain Exercises.\""}, {"name": "Hunted: The Demon's Forge", "details_link": "https://www.metacritic.com/game/playstation-3/hunted-the-demons-forge", "publisher": "Bethesda Softworks", "release_date": "May 31 2011", "developers": ["InXile Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "2  Online", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/1/c73f1422b6d760f8afb526a7b72d7c4b-98.jpg", "descriptions": "Set in a dark fantasy world, Hunted: The Demon's Forge is an unforgettable cooperative action game, pitting you and your partner against waves of vicious enemies. Taking control of either E'lara, a ranged weapon expert, or Caddoc, a master swordsman, you must use a variety of weapons,Set in a dark fantasy world, Hunted: The Demon's Forge is an unforgettable cooperative action game, pitting you and your partner against waves of vicious enemies. Taking control of either E'lara, a ranged weapon expert, or Caddoc, a master swordsman, you must use a variety of weapons, powerful spells, and cover tactics to battle your way through menacing dungeons, overgrown ruins, and downtrodden towns. Discover secrets and complete co-op-based puzzles whilst exploring the sinister world to discover answers to the game’s deep, dark mysteries. The dark ages have become corrupted. Heinous creatures have emerged from underground. Townsfolk across the land are disappearing. Upon the promise of their fortune in gold, mercenaries E’lara and Caddoc take on the daunting task of discovering where the innocent villagers have been taken. Their journey will lead them on a dark and twisted path where they will encounter death, slavery, and sacrifice. Travel deep within the world of Kala Moor...and to the secrets of The Demon's Forge.… Expand"}, {"name": "Calico", "details_link": "https://www.metacritic.com/game/switch/calico", "publisher": "Whitethorn Digital", "release_date": "Dec 15 2020", "developers": ["CatBean Games", "Peachy Keen Games"], "platforms": ["iPhone/iPad", "PC", "Stadia", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Adventure", "3D", "Virtual", "Third-Person", "Virtual Life"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/5/9517d2c2ff6d71192d99e8a8364434c3-98.jpg", "descriptions": "Calico is a day-in-the-life community sim game where you are given an important and adorable task: rebuild the town’s cat café and fill it with cute and cuddly creatures! You will journey to a small village filled with magical girls and other fantastical friends, where you are placed inCalico is a day-in-the-life community sim game where you are given an important and adorable task: rebuild the town’s cat café and fill it with cute and cuddly creatures! You will journey to a small village filled with magical girls and other fantastical friends, where you are placed in charge of a run down cat café. Build up your café by filling it with cute furniture, fun decorations, yummy pastries, and get it bustling with animals again!\r Calico is meant to make you feel all warm and fuzzy inside. The gameplay reflects that with a laid back, low stress creative environment to explore and play in.… Expand"}, {"name": "The Getaway: Black Monday", "details_link": "https://www.metacritic.com/game/playstation-2/the-getaway-black-monday", "publisher": "SCEA", "release_date": "Jan 11 2005", "developers": ["SCEE London Studio"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 57, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/7/e1ac5fc330a4768bc3741e6ec315660f-98.jpg", "descriptions": "The Getaway: Black Monday leaves it up to the player to decide how to play and how the story ends, from choosing how to complete missions, to deciding how to get to the next real London location. In The Getaway: Black Monday, the narrative will progress backward and forward in time, both inThe Getaway: Black Monday leaves it up to the player to decide how to play and how the story ends, from choosing how to complete missions, to deciding how to get to the next real London location. In The Getaway: Black Monday, the narrative will progress backward and forward in time, both in gameplay and movie sequences. One story unfolds from three unique perspectives, as the paths of the characters entwine. The story begins with a chain of events that takes place two years after the demise of the most notorious crime boss of London's East End, Charlie Jolson. A simple bank job goes wrong ? a small-time thug gets in way over his head and a cop is out for revenge ? sending two sides of the same tale into a collision course for an explosive showdown. By choosing which path to take, players will make critical decisions that influence the final outcome of the game. [SCEA]… Expand"}, {"name": "Stranger Things 3: The Game", "details_link": "https://www.metacritic.com/game/playstation-4/stranger-things-3-the-game", "publisher": "Netflix", "release_date": "Jul  4 2019", "developers": ["BonusXP"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/85d71d2746ea8f256e07acd1cb689e33-98.jpg", "descriptions": "Developed and published by BonusXP in collaboration with Netflix, Stranger Things 3: The Game is the official companion game to Season 3 of the hit original series. This adventure game blends a distinctively retro 16-bit art style with modern gameplay mechanics to deliver nostalgic fun withDeveloped and published by BonusXP in collaboration with Netflix, Stranger Things 3: The Game is the official companion game to Season 3 of the hit original series. This adventure game blends a distinctively retro 16-bit art style with modern gameplay mechanics to deliver nostalgic fun with a fresh new twist. Fans will be able to experience their favorite show through a mix of exploration, puzzles, and combat.Just like in the show, teamwork is at the heart Stranger Things 3: The Game. Fans can team up in two player local co-op or in single player mode alongside an AI partner, in the role of one of twelve characters from the show, each with unique abilities and attributes. Together, they'll play through familiar events from the series while also uncovering never-before-seen Stranger Things secrets, ensuring a fun experience for those new to the world of Stranger Things and series super fans alike!Key Features:* Experience the show in a new way, exploring the eerie world of Hawkins to uncover new mysteries beyond what's seen in Season 3.* Jump right into the action of this pick-up-and-play adventure: simple gameplay mechanics allow fans of all skill levels to get in on the fun.* Take your game to the next level by trying out different character combinations and collecting all the secrets the expansive world of Hawkins has to offer.* Team up with a friend, leveraging drop-in/drop-out local co-op to take on the mysterious monsters of Hawkins together. While playing solo, use a collection of \"buddy commands\" to control both characters and still experience all the fun.* Choose from 12 playable characters, each with their own unique talents and stats.… Expand"}, {"name": "Rayman Raving Rabbids 2", "details_link": "https://www.metacritic.com/game/ds/rayman-raving-rabbids-2", "publisher": "Ubisoft", "release_date": "Nov 13 2007", "developers": ["Ubisoft Paris"], "platforms": ["PC", "DS"], "num_players": "4  Online", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/089bbf94e46a456ed8103461eb95e13f-98.jpg", "descriptions": "After invading the world of Rayman, the insane Rabbids have a new objective: THE INVASION OF PLANET EARTH! Setting their home base at a shopping mall, the Rabbids try to study human behavior and mimic everything humans do in funny, illogical ways. As part of their training, the Rabbids mustAfter invading the world of Rayman, the insane Rabbids have a new objective: THE INVASION OF PLANET EARTH! Setting their home base at a shopping mall, the Rabbids try to study human behavior and mimic everything humans do in funny, illogical ways. As part of their training, the Rabbids must carry out several missions around the globe to prepare themselves for world domination. Rayman will attempt to infiltrate the Rabbids, disguised as one of them, in a mission to foil their crazy plans and save Earth. [Ubisoft]… Expand"}, {"name": "Micro Machines V4", "details_link": "https://www.metacritic.com/game/pc/micro-machines-v4", "publisher": "Codemasters", "release_date": "Jun 27 2006", "developers": ["Supersonic Software"], "platforms": ["PlayStation 2", "PC"], "num_players": "4  Online", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Automobile"], "meta_score": 57, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/1/c0a884e9774cfd1c70e889d15dadeee0-98.jpg", "descriptions": "Mixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll beMixing miniature mayhem with maximum multiplayer racing, Micro Machines v4 features knockabout, breakneck racing in the fastest scale miniatures, complete with explosive weapon power-ups. Letting you loose with hundreds of vehicles, each with distinctive performance abilities, you'll be racing your inch-long miniature motors on the wildest tracks where everyday household objects appear immense in size and can become lethal hazards. Sport cars, street racers, stock cars, 4x4s, beach buggies, lowriders and muscle cars are just some of the Micro Machines models you'll be taking out on the improvised tracks around the Micro Machines house, garden and - for the first time - beyond. Spin out around the breakfast table littered with cereal spills, tear through the kitchen but avoid literally burning tyre rubber on the blazing hot cooker, turbo boost around the pool table (while avoiding the treacherous pockets), or hit the gas as you drive around the rim of the bath, carefully negotiating the ferocious waters pouring over the edge of the bath (because someone left the tap running). [Codemasters]… Expand"}, {"name": "Rampage: Total Destruction", "details_link": "https://www.metacritic.com/game/gamecube/rampage-total-destruction", "publisher": "Midway", "release_date": "Apr 24 2006", "developers": ["Pipeworks Software", "Inc."], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "General"], "meta_score": 57, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/0/efb9120464cc9d421a93b320fab9d7c8-98.jpg", "descriptions": "Rampage: Total Destruction offers a fresh take on an arcade classic complete with everyone's favorite monsters: George, Lizzie, and Ralph, along with a variety of new monsters to collect and play. Virtually everything in the environment can be damaged, broken, and utterly destroyed withRampage: Total Destruction offers a fresh take on an arcade classic complete with everyone's favorite monsters: George, Lizzie, and Ralph, along with a variety of new monsters to collect and play. Virtually everything in the environment can be damaged, broken, and utterly destroyed with plenty of hilarious results. Aided by power-ups, the Rampage: Total Destruction monsters are capable of acquiring a number of upgrades throughout the course of a single campaign. Players can annihilate cities all over the world in either one or two player mode in this reinvention of the Midway classic.… Expand"}, {"name": "Dark Void", "details_link": "https://www.metacritic.com/game/pc/dark-void", "publisher": "Capcom", "release_date": "Jan 19 2010", "developers": ["Airtight Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "General", "Shooter", "Third-Person", "Arcade"], "meta_score": 57, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/0/6088188f3d1bf4daca9396056f30978c-98.jpg", "descriptions": "Dark Void is a sci-fi action-adventure game that combines an adrenaline-fuelled blend of aerial and on-foot combat set in a parallel universe called \"The Void\". Players assume the role of Will; a pilot dropped into incredible circumstances while on a routine air cargo flight crashes in theDark Void is a sci-fi action-adventure game that combines an adrenaline-fuelled blend of aerial and on-foot combat set in a parallel universe called \"The Void\". Players assume the role of Will; a pilot dropped into incredible circumstances while on a routine air cargo flight crashes in the Bermuda triangle leading him to be trapped in the Void. This unlikely hero soon finds himself swept into a desperate struggle for survival at the head of a group called The Survivors. Trapped in the Void, these resistance fighters are battling to hold off a mysterious alien race that plans to threaten Earth. Dark Void's unique combination of in-air and on-ground combat creates a thrilling new gameplay dynamic to the third-person shooter experience. Taking 3D action to a whole new level, Dark Void's vertical combat system allows players to dangle from thousand foot drops as they take cover and drop enemies from above and below, bringing a whole new sense of vulnerability and thrill to the player. Defying gravity in vertical combat is only half the battle as, over time, Will is upgraded to a powerful rocket pack which allows for fierce in-air combat as gamers are able to fly through the void at unparallel speeds shooting down anything that gets in their path. Blasting away at massive bosses has never been this much fun as Dark Void offers a unique grip system made up of a variety of grip-based mini-games including skyjacking UFOs mid-flight. [Capcom]… Expand"}, {"name": "Empire Earth II: The Art of Supremacy", "details_link": "https://www.metacritic.com/game/pc/empire-earth-ii-the-art-of-supremacy", "publisher": "Sierra Entertainment", "release_date": "Feb 14 2006", "developers": ["Mad Doc Software"], "platforms": "PC", "num_players": "Up to 10 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/2/7448193458b8514f836b075912203ef8-98.jpg", "descriptions": "The creators of the award-winning, best-selling Empire Earth II bring you this expansion pack. With graphical upgrades, new campaigns that span the ages, and more unique units & wonders. New Civilizations, Units & Wonders - Russians, French, plus the Masai & Zulu of the all-new AfricanThe creators of the award-winning, best-selling Empire Earth II bring you this expansion pack. With graphical upgrades, new campaigns that span the ages, and more unique units & wonders. New Civilizations, Units & Wonders - Russians, French, plus the Masai & Zulu of the all-new African region. Three New Campaigns - From the Pharaohs to Napoleon, relive more of mankind's greatest moments. New Hero Units - Common units rise with experience to become powerful heroes. Custom Civilizations - Make custom civilizations to fit your personal play style. Persistent Units – Keep your units and the experience they earn in battle across multiple scenarios. [Vivendi Universal]… Expand"}, {"name": "NASCAR 08", "details_link": "https://www.metacritic.com/game/playstation-3/nascar-08", "publisher": "EA Sports", "release_date": "Jul 23 2007", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "Up to 12 ", "genres": ["Driving", "Racing", "Simulation", "Stock Car", "Stock Car", "Automobile"], "meta_score": 57, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/369fc855e6a123f416ce716f6ecc48ce-98.jpg", "descriptions": "Take the wheel and drive your way to the NASCAR Nextel Cup Series championship. As the new rookie driver on the circuit, develop your racing skills to gain licenses and contracts from hungry owners and unlock legendary top performing cars from NASCAR's biggest stars. Gain new experiencesTake the wheel and drive your way to the NASCAR Nextel Cup Series championship. As the new rookie driver on the circuit, develop your racing skills to gain licenses and contracts from hungry owners and unlock legendary top performing cars from NASCAR's biggest stars. Gain new experiences during every race then modify your car's handling with over 40 tuning options to truly master every track. Share your setups with NASCAR's gaming community, then challenge the field in live races with up to 16 players online. Experience tomorrow's racing today in NASCAR 08. [Electronic Arts]… Expand"}, {"name": "Mobile Suit Gundam: Extreme VS-Force", "details_link": "https://www.metacritic.com/game/playstation-vita/mobile-suit-gundam-extreme-vs-force", "publisher": "Bandai Namco Games", "release_date": "Jul 12 2016", "developers": ["Lancarse", "Bandai Namco Games"], "platforms": "PlayStation Vita", "genres": ["Action", "Fighting", "3D"], "meta_score": 57, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/8/40c2289ffa6bd02974a0b3d2466d3a53-98.jpg", "descriptions": "MExtreme VS Force is an action game developed and published by Bandai Namco Games, which was released in Japan in 2015."}, {"name": "Disney Pirates of the Caribbean: At World's End", "details_link": "https://www.metacritic.com/game/pc/disney-pirates-of-the-caribbean-at-worlds-end", "publisher": "Disney Interactive Studios", "release_date": "May 22 2007", "developers": ["Eurocom Entertainment Software", "Eurocom"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Historic", "Historic", "Linear"], "meta_score": 57, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/8/b0269c42cf2cada024941fe8e1a582d7-98.jpg", "descriptions": "At World's End video games from Disney Interactive Studios invite players to \"live and die by the sword\" as they venture to the worlds of the films and beyond while playing as Captain Jack Sparrow, Will Turner and Elizabeth Swann. [Disney Interactive Studios]"}, {"name": "Necropolis", "details_link": "https://www.metacritic.com/game/playstation-4/necropolis", "publisher": "Bandai Namco Games", "release_date": "Oct  4 2016", "developers": ["Harebrained Schemes LLC"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "General"], "meta_score": 57, "users_score": 3.2, "image": "https://static.metacritic.com/images/products/games/8/af946b66aca2a60e1ea7e12c41aeb196-98.jpg", "descriptions": "A blend of third-person action and procedural dungeon-delving. Oh, and perma-death. Adventure alone or with up to 3 friends in a magical deathtrap that reconstructs itself each time you play. Will you find the exit, or die trying?"}, {"name": "Uno", "details_link": "https://www.metacritic.com/game/xbox-one/uno", "publisher": "Ubisoft", "release_date": "Aug 16 2016", "developers": ["Ubisoft Chengdu"], "platforms": ["PC", "PlayStation 4", "Stadia", "Switch", "Xbox One"], "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/5/0c103bee51ba2b78977e1acc792b35d9-98.jpg", "descriptions": "Uno makes its return to consoles and PC with an assortment of exciting features such as added video chat support and an all new theme system which adds more fun to enjoy your Uno game!Match cards either by matching color or value and play action cards to change things up. Race againstUno makes its return to consoles and PC with an assortment of exciting features such as added video chat support and an all new theme system which adds more fun to enjoy your Uno game!Match cards either by matching color or value and play action cards to change things up. Race against others to empty your hand before everyone else in either Classic Play or customize your experience with a variety of House Rules and match settings to ensure you and your friends never play the same game twice!Also, get ready to shake things up with new branded themes introducing never-before-seen Theme Cards that really change the way you play the game!… Expand"}, {"name": "Goliath", "details_link": "https://www.metacritic.com/game/pc/goliath", "publisher": "Viva Media", "release_date": "May 12 2016", "developers": ["Whalebox Studio"], "platforms": ["Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival", "Sandbox"], "meta_score": 57, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/38168928b84a2b68eea46b72e55df149-98.jpg", "descriptions": "Welcome to a mysterious world filled with perverse creatures, giant monsters and warring factions. You will not last long here on your own. Fortunately, you know how to build giant robots! Find the plans, gather the resources, climb inside your giant robotic creation and start punchingWelcome to a mysterious world filled with perverse creatures, giant monsters and warring factions. You will not last long here on your own. Fortunately, you know how to build giant robots! Find the plans, gather the resources, climb inside your giant robotic creation and start punching monsters in the face.… Expand"}, {"name": "Zotrix", "details_link": "https://www.metacritic.com/game/playstation-4/zotrix", "publisher": "UFO Interactive", "release_date": "Dec  8 2015", "developers": ["ZeroBit Games"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 57, "users_score": 3.7, "image": "https://static.metacritic.com/images/products/games/0/e6ebdc17c9416af769503e9b1d69bb3c-98.jpg", "descriptions": "A twin-stick space shooter that combines the retro look and feel of 80’s and 90’s arcade games with modern gameplay elements, customization, and depth. [UFO Interactive]"}, {"name": "Destiny Connect: Tick-Tock Travelers", "details_link": "https://www.metacritic.com/game/switch/destiny-connect-tick-tock-travelers", "publisher": "NIS America", "release_date": "Oct 22 2019", "developers": ["Nippon Ichi Software"], "platforms": ["PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 57, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/3/bc125a4e4ab097b096a672ca1014a4c8-98.jpg", "descriptions": "The town of Clocknee is celebrating the advent of a new millenium when time suddenly comes to a halt and a horde of hostile animated machines appears. It's up to a young girl named Sherry, her friend Pegreo, and Isaac, the time-traveling robot, to unravel the mystery behind the strangeThe town of Clocknee is celebrating the advent of a new millenium when time suddenly comes to a halt and a horde of hostile animated machines appears. It's up to a young girl named Sherry, her friend Pegreo, and Isaac, the time-traveling robot, to unravel the mystery behind the strange events. Together, they'll revisit the past and peer into the future, learning some very interesting things about their families and their peculiar town.… Expand"}, {"name": "DreamWorks Shrek Forever After", "details_link": "https://www.metacritic.com/game/playstation-3/dreamworks-shrek-forever-after", "publisher": "Activision", "release_date": "May 18 2010", "developers": ["Xpec"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Action Adventure", "General", "General"], "meta_score": 57, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/3/76bb059c8756e6068a5f062bb06dbe40-98.jpg", "descriptions": "Gamers adventure through a variety of locations from the Shrek universe, solve challenging puzzles and battle exciting new enemies as they morph between Shrek’s normal world and his alternate reality…and ultimately conquer that crafty Rumpelstiltskin!  The game offers a fun-filled social andGamers adventure through a variety of locations from the Shrek universe, solve challenging puzzles and battle exciting new enemies as they morph between Shrek’s normal world and his alternate reality…and ultimately conquer that crafty Rumpelstiltskin!  The game offers a fun-filled social and collaborative experience with its co-operative multiplayer mode, allowing up to four players to work together through the single player story.  [Activision]… Expand"}, {"name": "Showdown: Legends of Wrestling", "details_link": "https://www.metacritic.com/game/xbox/showdown-legends-of-wrestling", "publisher": "Acclaim", "release_date": "Jun 22 2004", "developers": ["Acclaim"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 57, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/1050572ecfa8fd82641dee160dacb61d-98.jpg", "descriptions": "Showdown: Legends of Wrestling features more than 70 of the greatest wrestlers throughout history. Send your favorite wrestlers to the squared circle for bone-breaking matches, including Table, First Blood, Ladder, Cage, and Battle Royal. Create dream matches, unlock classic feuds, andShowdown: Legends of Wrestling features more than 70 of the greatest wrestlers throughout history. Send your favorite wrestlers to the squared circle for bone-breaking matches, including Table, First Blood, Ladder, Cage, and Battle Royal. Create dream matches, unlock classic feuds, and customize your own wrestler. You'll travel down the path of pain in the new era-based career mode. If you can master the new Ready-To-Brawl controls, you'll be prepared to take on the icons of professional wrestling.… Expand"}, {"name": "Invincible Tiger: The Legend of Han Tao", "details_link": "https://www.metacritic.com/game/playstation-3/invincible-tiger-the-legend-of-han-tao", "publisher": "Namco Bandai Games America", "release_date": "Aug 27 2009", "developers": ["Blitz Arcade"], "platforms": ["Xbox 360", "PlayStation 3"], "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 57, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/8/a65556817497044cac9d15660b5d2dba-98.jpg", "descriptions": "[Playstation Network]  Han Tao, General of a Thousand Victories, has pledged his life to protect the legendary Star of Destiny, a mysterious artifact recently stolen by the Evil Overlord. Han Tao will face a cavalcade of enemies, ranging from standard grunts to undead horrors in his quest to[Playstation Network]  Han Tao, General of a Thousand Victories, has pledged his life to protect the legendary Star of Destiny, a mysterious artifact recently stolen by the Evil Overlord. Han Tao will face a cavalcade of enemies, ranging from standard grunts to undead horrors in his quest to recover the sacred Star. Luckily Han Tao is well versed in intense combos, slick counter-moves, the art of deadly weapons, and mystical Zen attacks. By filling up Han Tao’s Zen Meter with punishing combos and well timed dodges, players can unlock the full potential of his true power and decimate the opposition. Invincible Tiger: The Legend of Han Tao offers a variety of modes for both online and local play: Team up with a partner and take on the Evil Overload’s diabolical army through Story Mode Co-op. Carefully battle through each stage with increased difficulty and a shared Zen Meter. Combat techniques learned through the single player game will serve players well as all-out brawls will leave stragglers in the dust. Endurance Mode has players battling an endless stream of enemies under a specific time limit. Post your scores online for bragging rights. [Namco Bandai Games]… Expand"}]