[{"name": "Defense Grid: The Awakening", "details_link": "https://www.metacritic.com/game/pc/defense-grid-the-awakening", "publisher": "Aspyr", "release_date": "Dec  8 2008", "developers": ["Hidden Path Entertainment"], "platforms": ["Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/debd674b9d13cec381c06e3eaa133b9d-98.jpg", "descriptions": "Defense Grid: The Awakening is a strategy game where players place defense fortifications (towers) to stop invading aliens from stealing power cores from their bases.  It is up to the player to select the towers, placement, and timing to best protect the base.  This mix of strategy andDefense Grid: The Awakening is a strategy game where players place defense fortifications (towers) to stop invading aliens from stealing power cores from their bases.  It is up to the player to select the towers, placement, and timing to best protect the base.  This mix of strategy and puzzle gameplay promises to be very fun and engaging. [Hidden Path Entertainment]… Expand"}, {"name": "Battle Chef Brigade", "details_link": "https://www.metacritic.com/game/switch/battle-chef-brigade", "publisher": "Adult Swim", "release_date": "Nov 20 2017", "developers": ["Trinket Studios"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/ff8adf8c3d19438019cd74f0750ecafc-98.jpg", "descriptions": "In the fantasy realm of Victusia, the members of the elite Battle Chef Brigade are revered for their ability to skillfully take down monsters and transform their kills into delicious cuisine! But getting in isn't easy; chefs from across Victusia must vie for their spot in a high stakesIn the fantasy realm of Victusia, the members of the elite Battle Chef Brigade are revered for their ability to skillfully take down monsters and transform their kills into delicious cuisine! But getting in isn't easy; chefs from across Victusia must vie for their spot in a high stakes competition. Follow two contestants, Mina and Thrash, as their journeys through the tournament unfold. In order to become a Brigadier you'll need to hunt monsters with combo-based attacks and prepare your freshly caught ingredients in puzzle-based cooking challenges to serve up winning dishes to the judges – all while the round clock ticks down. [Nintendo]… Expand"}, {"name": "Codename: Panzers, Phase One", "details_link": "https://www.metacritic.com/game/pc/codename-panzers-phase-one", "publisher": "cdv Software", "release_date": "Sep 30 2004", "developers": ["Stormregion"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/8/326fdebb496e6b6b484d47802576fdd9-98.jpg", "descriptions": "No, this can't be! Initial outpost reports showed only armored infantry, but some serious hardware is headed this way! How could two 70-ton German Königstiger battle tanks simply be overlooked?! Well, no time to lay blame, just aim the bazooka and bring up the tanks from the rear. Only aNo, this can't be! Initial outpost reports showed only armored infantry, but some serious hardware is headed this way! How could two 70-ton German Königstiger battle tanks simply be overlooked?! Well, no time to lay blame, just aim the bazooka and bring up the tanks from the rear. Only a direct hit can destroy them. ? Codename: Panzers thrusts you into the high-powered battles of World War II. Whether played in towns with bullet-riddled buildings, bleak mountain landscapes, or treacherous swamps, Codename: Panzers offers real-time combat rampages with awesome 3D graphics. Create your combat force from over 100 finely detailed units, from a flame-throwing squad to a Soviet Stalin organ rocket launcher to a German Königstiger battle tank. Be the commander - demolish the enemy with clever tactical maneuvers. Experience the nerve-jangling thrill of strategic gaming - in Codename: Panzers! [CDV]… Expand"}, {"name": "Affordable Space Adventures", "details_link": "https://www.metacritic.com/game/wii-u/affordable-space-adventures", "publisher": "KnapNok Games", "release_date": "Apr  9 2015", "developers": ["KnapNok Games"], "platforms": "Wii U", "num_players": "No Online Multiplayer", "genres": ["Scrolling", "Action", "Shooter", "Shoot-'Em-Up", "Vertical", "Horizontal"], "meta_score": 81, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/6/9d59a23e7281a2cdc6c60d58c6b4061b-98.jpg", "descriptions": "Affordable Space Adventures is a 2.5D side scrolling spaceship simulator. You are using the GamePad as a Heads Down Display - spaceship cockpit, and you have to configure all the systems in order to fly around undetected on an alien planet. You can either pilot the Small Craft TM solo, orAffordable Space Adventures is a 2.5D side scrolling spaceship simulator. You are using the GamePad as a Heads Down Display - spaceship cockpit, and you have to configure all the systems in order to fly around undetected on an alien planet. You can either pilot the Small Craft TM solo, or fly as a crew of 2 to 3 players, requiring a lot of communication between the players.… Expand"}, {"name": "Prince of Persia", "details_link": "https://www.metacritic.com/game/xbox-360/prince-of-persia", "publisher": "Ubisoft", "release_date": "Dec  2 2008", "developers": ["Ubisoft Montreal"], "platforms": ["3DS", "PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy"], "meta_score": 81, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/6/39b2c0d434cf0af7c57df6da3e3e7c4a-98.jpg", "descriptions": "Set in a land rooted in ancient Persian mythology, the Prince finds himself caught in an epic battle between the primal forces of light and darkness: the God of Light, Ormazd versus his brother Ahriman, the destructive God of Darkness. The Prince arrives just in time to witness theSet in a land rooted in ancient Persian mythology, the Prince finds himself caught in an epic battle between the primal forces of light and darkness: the God of Light, Ormazd versus his brother Ahriman, the destructive God of Darkness. The Prince arrives just in time to witness the destruction of the legendary Tree of Life - an act which threatens to plunge the entire world into eternal darkness. Manifested in the form of the Corruption, a dark substance that physically contaminates the land and the skies, the Prince must partner with Elika, a deadly companion, to heal the world from the evil Corruption. [Ubisoft]… Expand"}, {"name": "Dragon Quest VII: Fragments of the Forgotten Past", "details_link": "https://www.metacritic.com/game/3ds/dragon-quest-vii-fragments-of-the-forgotten-past", "publisher": "Square Enix", "release_date": "Sep 16 2016", "developers": ["ArtePiazza"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/6/7e3dfe51863bbaccfb2cdb067752670e-98.jpg", "descriptions": "You plan to become a humble fisherman of peaceful Estard Island, the only land in a world of ocean. But when you discover the artifacts from an ancient land, you tear the fabric of time and unveil the world that once was. Transported to past lands, you must solve their mysteries and breakYou plan to become a humble fisherman of peaceful Estard Island, the only land in a world of ocean. But when you discover the artifacts from an ancient land, you tear the fabric of time and unveil the world that once was. Transported to past lands, you must solve their mysteries and break the spell of annihilation. Prepare for your destiny!… Expand"}, {"name": "Before Your Eyes", "details_link": "https://www.metacritic.com/game/playstation-5/before-your-eyes", "publisher": "Skybound Games", "release_date": "Mar 10 2023", "developers": ["GoodbyeWorld Games"], "platforms": ["PC", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/daa54e5dd46a3a3504cf6bac454a887e-98.jpg", "descriptions": "Before Your Eyes is a first person narrative adventure which tells the story of a soul's journey into the afterlife using a new and innovative form of interactionyour real-life blinks.The story begins after your death, aboard the ship of a mythical Ferryman tasked with shepherding souls toBefore Your Eyes is a first person narrative adventure which tells the story of a soul's journey into the afterlife using a new and innovative form of interactionyour real-life blinks.The story begins after your death, aboard the ship of a mythical Ferryman tasked with shepherding souls to the afterlife. In order to help you pass on, he must first learn the story of your life. The game uses your webcam to immerse you in this story in a way you've never experienced before. You will learn to control the flow of the narrative with your actual eyes blinking through precious memories of family, first love, and the rise of an artistic career. But soon the Ferryman will suspect you aren't showing him everything he needs to see. So he will force you deeper into the dark recesses of your most repressed memories, ultimately revealing a heartbreaking truth.… Expand"}, {"name": "Eyes in the Dark: The Curious Case of One Victoria Bloom", "details_link": "https://www.metacritic.com/game/pc/eyes-in-the-dark-the-curious-case-of-one-victoria-bloom", "publisher": "Gearbox Publishing", "release_date": "Jul 14 2022", "developers": ["Under the Stairs"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/638dd3adf6a407a964c0c14877623254-98.jpg", "descriptions": "Fight with light against the dark in this \"roguelight\" platformer starring Victoria Bloom. Drive back the darkness that's overrun Bloom Manor and conquer swarms of creatures as you discover powerful new items to upgrade your arsenal. Are you ready to enter the ever-changing manor?"}, {"name": "Young Souls", "details_link": "https://www.metacritic.com/game/pc/young-souls", "publisher": "The Arcade Crew", "release_date": "Mar 10 2022", "developers": ["1P2P"], "platforms": ["PlayStation 4", "Stadia", "Switch", "Xbox One", "PC"], "genres": ["Action", "Beat-'Em-Up", "2D"], "meta_score": 81, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/6/a9c8577103451865d126516aa9c31b0d-98.jpg", "descriptions": "As orphans, Jenn and Tristan's life path brought them to a mysterious scientist, who took them in and cared for them as his own children. But one day, he disappeared under very odd circumstances.While searching desperately for him, the duo found a hidden cellar and the Moon Gate portal,As orphans, Jenn and Tristan's life path brought them to a mysterious scientist, who took them in and cared for them as his own children. But one day, he disappeared under very odd circumstances.While searching desperately for him, the duo found a hidden cellar and the Moon Gate portal, transporting them to a dangerous parallel world where goblins thrive.Your adventure begins as you fight to bridge these two very different worlds.Young Souls is a gorgeous 2D brawler meets story-rich action RPG. Fight hordes of belligerent goblins, level up with hundreds of weapons and accessories, explore, and journey between worlds, as rebellious twins battle their way to save their foster father.… Expand"}, {"name": "Unpacking", "details_link": "https://www.metacritic.com/game/xbox-one/unpacking", "publisher": "Humble Games", "release_date": "Nov  2 2021", "developers": ["Witch Beam"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action", "General"], "meta_score": 81, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/9/912c323dc83c3279c643b92a0b5e7969-98.jpg", "descriptions": "Unpacking is a zen puzzle game about the familiar experience of pulling possessions out of boxes and fitting them into a new home. Part block-fitting puzzle, part home decoration, you are invited to create a satisfying living space while learning clues about the life you’re unpacking."}, {"name": "Kena: Bridge of Spirits", "details_link": "https://www.metacritic.com/game/playstation-5/kena-bridge-of-spirits", "publisher": "Emberlab", "release_date": "Sep 21 2021", "developers": ["Emberlab"], "platforms": ["PC", "PlayStation 4", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Open-World", "Action Adventure", "General"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/6/633fca4230906eb8df9ae9151f30a234-98.jpg", "descriptions": "Kena: Bridge of Spirits is a story-driven action adventure set in a charming world rich with exploration and fast-paced combat. Players find and grow a team of tiny spirit companions called the Rot, enhancing their abilities and creating new ways to manipulate the environment."}, {"name": "AVICII Invector Encore Edition", "details_link": "https://www.metacritic.com/game/switch/avicii-invector-encore-edition", "publisher": "Wired Productions", "release_date": "Sep  8 2020", "developers": ["Wired Productions"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Rhythm", "Music"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/b79bcff70bda4a6e9be67d07dfe119ef-98.jpg", "descriptions": "Soar through vocal melodies, sweep each fade and attack every beat in 25 of AVICII’s biggest hits, in this enthralling futuristic rhythm-action experience – AVICII Invector."}, {"name": "Yooka-Laylee and the Impossible Lair", "details_link": "https://www.metacritic.com/game/switch/yooka-laylee-and-the-impossible-lair", "publisher": "Team17", "release_date": "Oct  8 2019", "developers": ["Playtonic Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/b7378167362e9e94ec102e4b3e52f64c-98.jpg", "descriptions": "Yooka & Laylee are back in a brand-new platform hybrid adventure. They must run, jump and roll their way through a series of challenging 2D levels, face a puzzling Overworld and rally the Royal Bee-tallion to take down Capital B and his Impossible Lair. \r* The overworld isn't just a hub toYooka & Laylee are back in a brand-new platform hybrid adventure. They must run, jump and roll their way through a series of challenging 2D levels, face a puzzling Overworld and rally the Royal Bee-tallion to take down Capital B and his Impossible Lair. \r* The overworld isn't just a hub to hop from level to level, it provides a whole separate gaming experience. Explore and unlock more 2D levels by completing objectives and puzzles, rescue Royal Bees and find collectibles.\r* Alternate Level States. Think you've got a level figured out? Try it in its alternate state! Flip switches in the overworld to create new landscapes.\r* Bee-at the Impossible Lair. Players are free to tackle Capital B's Impossible Lair at any time; however, they may find it too much of a challenge without the help of the Royal Bee Guards.… Expand"}, {"name": "Northgard", "details_link": "https://www.metacritic.com/game/pc/northgard", "publisher": "Shiro Games", "release_date": "Mar  7 2018", "developers": ["Shiro Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Up to 6 ", "genres": ["Strategy", "Turn-Based", "Real-Time", "4X", "Command"], "meta_score": 81, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/6/1555e9c8d12b304c791b1c08ed150a86-98.jpg", "descriptions": "Northgard is a strategy game based on Norse mythology in which you control a clan of Vikings vying for the control of a mysterious newfound continent."}, {"name": "Darksiders: Warmastered Edition", "details_link": "https://www.metacritic.com/game/playstation-4/darksiders-warmastered-edition", "publisher": "Nordic Games Publishing", "release_date": "Nov 22 2016", "developers": ["Nordic Games Publishing", "Kaiko"], "platforms": ["PC", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Open-World"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/cafccdbda9a0821a676c06c93c8af1fa-98.jpg", "descriptions": "Deceived by the forces of evil into prematurely hearkening the end of the world, War — the first Horseman of the Apocalypse — stands accused of breaking the sacred law by inciting a war between Heaven and Hell. In the slaughter that ensued, the demonic forces defeated the heavenly hosts andDeceived by the forces of evil into prematurely hearkening the end of the world, War — the first Horseman of the Apocalypse — stands accused of breaking the sacred law by inciting a war between Heaven and Hell. In the slaughter that ensued, the demonic forces defeated the heavenly hosts and laid claim to the Earth. [Playstation.com]… Expand"}, {"name": "FIFA 16", "details_link": "https://www.metacritic.com/game/pc/fifa-16", "publisher": "EA Sports", "release_date": "Sep 22 2015", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Sports", "Team", "Soccer", "Sim"], "meta_score": 81, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/6/eaaeb7e3bdf63041bb16e9e7df8a710a-98.jpg", "descriptions": "Games are won and lost in the midfield - in FIFA 16, the midfield matters. Stay in possession with patient build-up play or ping clinical passes through space to start an attack."}, {"name": "3D After Burner II", "details_link": "https://www.metacritic.com/game/3ds/3d-after-burner-ii", "publisher": "Sega", "release_date": "Jan 15 2015", "developers": ["M2"], "platforms": "3DS", "num_players": "No Online Multiplayer", "genres": ["Action", "Simulation", "Flight", "Shooter", "Scrolling", "Rail", "Shoot-'Em-Up", "Combat", "Vertical"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/912aae07a5fb8b379e1a3568c0441ca6-98.jpg", "descriptions": "3D After Burner II is the 1987 flight game first released on SEGA’s X Board arcade hardware. Delivering a vintage arcade experience, the re-mastered version features stereoscopic 3D visuals and offers a host of options and settings, including the ability to adjust the difficulty settings and3D After Burner II is the 1987 flight game first released on SEGA’s X Board arcade hardware. Delivering a vintage arcade experience, the re-mastered version features stereoscopic 3D visuals and offers a host of options and settings, including the ability to adjust the difficulty settings and other visual enhancements, such as smoke transparency that were not present in the original version. Players are able to choose from a number of real-life arcade cabinets wherein everything from the appearance to the environmental sounds of the specific cabinet are recreated, providing an arcade experience. The highlight of 3D After Burner II is the addition of the ’special mode’ which can be unlocked once the player completes the game. The ’special mode,’ while maintaining the basics of the ’arcade mode,’ provides the player with a completely new gaming experience and allows the players to control time by utilizing  the ‘burst’ which makes avoiding incoming attacks easier and increases the number of lock-on targets. … Expand"}, {"name": "Europa Universalis IV: Conquest of Paradise", "details_link": "https://www.metacritic.com/game/pc/europa-universalis-iv-conquest-of-paradise", "publisher": "Paradox Interactive", "release_date": "Jan 14 2014", "developers": ["Paradox Development Studio"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 81, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/a970eb779940070e2fa78ff07bf00ee0-98.jpg", "descriptions": "Europa Universalis IV: Conquest of Paradise is the first expansion for the critically praised empire building game Europa Universalis IV, focusing on exploration of the new world and the Native American nations."}, {"name": "NFL Street", "details_link": "https://www.metacritic.com/game/xbox/nfl-street", "publisher": "EA Sports", "release_date": "Jan 13 2004", "developers": ["EA Tiburon"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 81, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/9/c310fac2e533e954ab6426e17b0ff45f-98.jpg", "descriptions": "Get ready for a new brand of football meant only for the streets.  NFL Street delivers hard-hitting, fast-paced 7-on-7 arcade football.  Don't be afraid to add extra style to your bone-crushing tackles, passes and runs as you will be rewarded with superpowered Gamebreakers.  Choose from moreGet ready for a new brand of football meant only for the streets.  NFL Street delivers hard-hitting, fast-paced 7-on-7 arcade football.  Don't be afraid to add extra style to your bone-crushing tackles, passes and runs as you will be rewarded with superpowered Gamebreakers.  Choose from more than 300 current NFL stars and legends such as Barry Sanders, and play through a variety of fields including a beach, a park or a corner lot.  Get ready to rule the streets and look good doing it.… Expand"}, {"name": "Ghost Master (2003)", "details_link": "https://www.metacritic.com/game/pc/ghost-master-2003", "publisher": "Empire Interactive", "release_date": "Aug 26 2003", "developers": ["Sick Puppies"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "Fantasy", "General", "Fantasy"], "meta_score": 81, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/a15640fee125dfa6feebe59cfedd2999-98.jpg", "descriptions": "Grim spectres, mischievous gremlins, howling banshees, things that go bump in the night... and that's just your starting team! As an afterlife civil servant sent to Gravenville by the Haunter Committee, frighten lowly mortals from their homes and places of work in a game that puts you inGrim spectres, mischievous gremlins, howling banshees, things that go bump in the night... and that's just your starting team! As an afterlife civil servant sent to Gravenville by the Haunter Committee, frighten lowly mortals from their homes and places of work in a game that puts you in charge of legions of ghosts, ghouls and spirits! Your mission: manage resources to scare and manipulate people, then discover the secrets behind Gravenville...  [Empire Interactive]… Expand"}, {"name": "Tom Clancy's Ghost Recon: Island Thunder", "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-ghost-recon-island-thunder", "publisher": "Ubisoft", "release_date": "Aug  6 2003", "developers": ["Red Storm Entertainment"], "platforms": ["PC", "Xbox"], "num_players": "1-16 ", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 81, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/2/77292b7593ac25690eecc6281bb8f5f5-98.jpg", "descriptions": "Ghost Recon just got an all-new jungle warfare experience.  In Tom Clancy's Ghost Recon: Island Thunder, you lead an elite team of U.S. Army Green Berets in a mission to stop a drug-funded warlord from sabotaging Cuba's free elections.  Island Thunder takes you deep into the heart of CubaGhost Recon just got an all-new jungle warfare experience.  In Tom Clancy's Ghost Recon: Island Thunder, you lead an elite team of U.S. Army Green Berets in a mission to stop a drug-funded warlord from sabotaging Cuba's free elections.  Island Thunder takes you deep into the heart of Cuba with eight missions, plus five desert missions you can download via Xbox Live.  Compete in 12 expansive maps against your friends on split-screen multiplayer, system link, and enhanced Xbox Live play.… Expand"}, {"name": "Def Jam Vendetta", "details_link": "https://www.metacritic.com/game/gamecube/def-jam-vendetta", "publisher": "Electronic Arts", "release_date": "Mar 31 2003", "developers": ["Aki Corp."], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-4 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 81, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/7/b41ebc506ecd2803f3bb2257511e053a-98.jpg", "descriptions": "It's been three years since D-Mob chased you out of the New York fight circuit and you swore you'd never go back. Now your pal Manny is in trouble, and he needs you to bail him out. Your only chance to get the money is to settle a score with the Def Jam crew, including DMX, Ludacris, JoeIt's been three years since D-Mob chased you out of the New York fight circuit and you swore you'd never go back. Now your pal Manny is in trouble, and he needs you to bail him out. Your only chance to get the money is to settle a score with the Def Jam crew, including DMX, Ludacris, Joe Budden, and Method Man. While listening to the tracks and beats from Def Jam artists, you can fight or play as over 40 combatants, each with special moves, combos, and taunts.… Expand"}, {"name": "Divine Divinity", "details_link": "https://www.metacritic.com/game/pc/divine-divinity", "publisher": "cdv Software", "release_date": "Sep 22 2002", "developers": ["Larian Studios Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/0266773088ca6acde4c2aba182a67d05-98.jpg", "descriptions": "Set in a new fantasy universe, Divine Divinity takes the player on a fantastic quest in a land torn apart by corruption and dark magic. Throughout his journeys the player will get the chance to develop his character as one of six character types, and meet a variety of people and fantasticalSet in a new fantasy universe, Divine Divinity takes the player on a fantastic quest in a land torn apart by corruption and dark magic. Throughout his journeys the player will get the chance to develop his character as one of six character types, and meet a variety of people and fantastical beings. By combining the best features of the RPG genre, and introducing a lot of new features, Divine Divinity will appeal to both hard-core and new RPG players. [Larian Studios]… Expand"}, {"name": "F1 2002", "details_link": "https://www.metacritic.com/game/playstation-2/f1-2002", "publisher": "EA Sports", "release_date": "Jun 17 2002", "developers": ["Visual Sciences"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Driving", "Racing", "Formula One"], "meta_score": 81, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/76f4ccff4fcc2bca261ed832ec61a888-98.jpg", "descriptions": "Compete for, unlock and collect Formula One team specific EA SPORTS cards to win unique rewards and access new game modes. Building on the Challenge Mode from F1 2001 you can now set multi car challenges and compete against the star drivers from the Formula One grid. Enter into a head toCompete for, unlock and collect Formula One team specific EA SPORTS cards to win unique rewards and access new game modes. Building on the Challenge Mode from F1 2001 you can now set multi car challenges and compete against the star drivers from the Formula One grid. Enter into a head to head battle and test your driver skills against an opponent in an equally competitive machine. Handling, AI and engine sounds change as you test your skills in a team at the back of the grid or as a World Championship contender. Experience game breaking moments from multiple director cameras and capturing the emotion of a hard fought victory with unique hero shots. [EA Sports]… Expand"}, {"name": "Mega Man Battle Network 2", "details_link": "https://www.metacritic.com/game/game-boy-advance/mega-man-battle-network-2", "publisher": "Capcom", "release_date": "Jun 17 2002", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 81, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/7/b105214fdf56d7bedb305fd3acb28251-98.jpg", "descriptions": "Enter the futuristic universe of Mega Man.EXE in this new adventure in the Battle Network series. Join him in his battle to fight cyber crimes in this mega role playing adventure. Now, there's a new net crime organization in town and its computer hacking has created a virus that's quicklyEnter the futuristic universe of Mega Man.EXE in this new adventure in the Battle Network series. Join him in his battle to fight cyber crimes in this mega role playing adventure. Now, there's a new net crime organization in town and its computer hacking has created a virus that's quickly gaining momentum. It's up to Mega Man.EXE, his pal Lan and friends to join the Net-Battlers and win this new cyber battle. Stop it before it spreads!… Expand"}, {"name": "Breath of Fire II", "details_link": "https://www.metacritic.com/game/game-boy-advance/breath-of-fire-ii", "publisher": "Capcom", "release_date": "Apr 16 2002", "developers": ["Capcom"], "platforms": "Game Boy Advance", "num_players": "1-2 ", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 81, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/7d6034ef37a465090fc65061624e5b18-98.jpg", "descriptions": "One of the most popular RPGs of all time continues in this epic quest. Enter the magical life of a hero Ryu, a dragon morphing warrior, as he embarks on a vast adventure in search of his missing father and little sister. Eight mysterious characters will join you along the way to help youOne of the most popular RPGs of all time continues in this epic quest. Enter the magical life of a hero Ryu, a dragon morphing warrior, as he embarks on a vast adventure in search of his missing father and little sister. Eight mysterious characters will join you along the way to help you find and master the hidden secrets of the amazing lands you will explore. Discover the right combinations of magical spells, strength, wisdom, guts, and luck to determine your fate as you master the world of dragons, demons, and mystery.… Expand"}, {"name": "Dave Mirra Freestyle BMX 2", "details_link": "https://www.metacritic.com/game/playstation-2/dave-mirra-freestyle-bmx-2", "publisher": "Acclaim", "release_date": "Aug 27 2001", "developers": ["Z-Axis", "Ltd."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Alternative", "Biking"], "meta_score": 81, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/7/f081a267fe5f18c9e4551dd3da70db2f-98.jpg", "descriptions": "Rearing its head for the first time on the PS2, the latest incarnation of DMFB features eight levels (\"4x bigger than before\") in vert, dirt, street, and park riding, with ten multiplayer games and a roster of pros including the usual suspects:  Ryan, Rick, and Dave himself."}, {"name": "Knockout Kings 2001", "details_link": "https://www.metacritic.com/game/playstation-2/knockout-kings-2001", "publisher": "EA Sports", "release_date": "Feb  5 2001", "developers": ["Black Ops Entertainment"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Sports", "Traditional", "Boxing"], "meta_score": 81, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/11a0244c24435f5c5ad0970d3b7dcb5e-98.jpg", "descriptions": "All the egomaniacal, violent splendor of heavyweight boxing comes to the PlayStation 2 in Knockout Kings 2001 by EA Sports. This title employs EA's new CyberScan technology, which allows the boxers faces to be accurately reproduced in full polygonal glory. In addition to the graphicalAll the egomaniacal, violent splendor of heavyweight boxing comes to the PlayStation 2 in Knockout Kings 2001 by EA Sports. This title employs EA's new CyberScan technology, which allows the boxers faces to be accurately reproduced in full polygonal glory. In addition to the graphical overhaul, the game features new modes of play and simplified control. Choose your champion from a stable of boxing's greatest, including Muhammad Ali, Joe Louis, Rocky Marciano, and Lennox Lewis. A new career mode allows you to play through several weight classes and to box at famous arenas all around the world.… Expand"}, {"name": "The Book of Unwritten Tales 2", "details_link": "https://www.metacritic.com/game/pc/the-book-of-unwritten-tales-2", "publisher": "Nordic Games Publishing", "release_date": "Feb 20 2015", "developers": ["KING Art"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/5375d9ef65312cfe6493cca7482c1474-98.jpg", "descriptions": "Legends foretold it. Prophecies predicted it. Chosen ones chose to believe in it. Now the adventure saga continues. A sequel is coming. Join Wilbur, Ivo, Nate and Critter in another classic point-and-click adventure in the wicked world of Aventásia. Help them fulfill their destiny. A destinyLegends foretold it. Prophecies predicted it. Chosen ones chose to believe in it. Now the adventure saga continues. A sequel is coming. Join Wilbur, Ivo, Nate and Critter in another classic point-and-click adventure in the wicked world of Aventásia. Help them fulfill their destiny. A destiny as yet unwritten.… Expand"}, {"name": "Sid Meier's Civilization Revolution", "details_link": "https://www.metacritic.com/game/ds/sid-meiers-civilization-revolution", "publisher": "2K Games", "release_date": "Jul  8 2008", "developers": ["Firaxis Games"], "platforms": ["iPhone/iPad", "PlayStation 3", "Xbox 360", "DS"], "genres": ["Strategy", "Turn-Based", "Historic", "General", "Historic"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/3273c54245755d06aa22d923228a7abe-98.jpg", "descriptions": "Civilization Revolution offers players a chance to experience the epic empire-building world of Civilization in an all new accessible, visually immersive, and action-packed world specifically designed for the console and handheld gamer. Delivering Civilization's renowned epic single-playerCivilization Revolution offers players a chance to experience the epic empire-building world of Civilization in an all new accessible, visually immersive, and action-packed world specifically designed for the console and handheld gamer. Delivering Civilization's renowned epic single-player campaigns featuring vast re-playability and unmatched addictive gameplay as well as revolutionary features like real-time interaction with leaders and advisors, extensive multiplayer capabilities and integrated video and voice chat, it transports the Civilization series to a level of gameplay that fans have never seen before. Some of the key features that resonate with fans of strategy games and the Civilization franchise include 16 civilizations to master and lead to victory, an array of famous historical leaders to play as or compete against, and accessible maps and streamlined time scale for quicker games, intense combat, and constant action. In online multiplayer mode, players compete for world conquest and glory among their peers as they battle in teams, head-to-head or epic free-for-all matches. In addition, auto-matching, ranked games, leaderboards, achievements, downloadable extra content and integrated video and voice chat make the online play more versatile and fun than any previous version of Civilization and will allow players to see where they stand against the competition. Finally, the position of ruler of the world can be settled online. [2K Games]… Expand"}, {"name": "Donkey Kong Jungle Beat", "details_link": "https://www.metacritic.com/game/gamecube/donkey-kong-jungle-beat", "publisher": "Nintendo", "release_date": "Mar 14 2005", "developers": ["Nintendo"], "platforms": "GameCube", "num_players": "1 Player", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/3/2648ae655d814f710bc7e4cdf2b2684e-98.jpg", "descriptions": "Feel the beat of an all-new Donkey Kong adventure as you drum your way through wild jungle kingdoms. In Donkey Kong Jungle Beat, you must use the DK Bongo Controller to guide the ape through dangerous environments rife with enemies and obstacles. Donkey Kong's actions, which include walking,Feel the beat of an all-new Donkey Kong adventure as you drum your way through wild jungle kingdoms. In Donkey Kong Jungle Beat, you must use the DK Bongo Controller to guide the ape through dangerous environments rife with enemies and obstacles. Donkey Kong's actions, which include walking, jumping, and attacking, depend on where you hit both bongo drums. Use your hands to battle beasts, collect bananas, put together combo strings, box with rivals, and even ride animals.… Expand"}, {"name": "Catherine: Full Body", "details_link": "https://www.metacritic.com/game/switch/catherine-full-body", "publisher": "Atlus", "release_date": "Jul  7 2020", "developers": ["Atlus", "Studio Zero"], "platforms": ["PlayStation 4", "Switch"], "num_players": "2 ", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/2/25ca7c76da123ec3886096da1cceb764-98.jpg", "descriptions": "Dark. Intense. Intoxicating. Our indecisive protagonist, Vincent, has been with his long-time girlfriend, Katherine, for five years. But instead of taking the next step into marriage, Vincent finds himself in an affair with the provocative blonde bombshell, Catherine! Thrown into discord byDark. Intense. Intoxicating. Our indecisive protagonist, Vincent, has been with his long-time girlfriend, Katherine, for five years. But instead of taking the next step into marriage, Vincent finds himself in an affair with the provocative blonde bombshell, Catherine! Thrown into discord by his own infidelity, he finds solace in the innocent Rin – further complicating matters. Adding to Vincent’s dilemma, he begins having nightmares that force him to climb for his life... Will he survive the trials and tribulations of love, or fall to temptations? … Expand"}, {"name": "Call of Duty: Modern Warfare", "details_link": "https://www.metacritic.com/game/xbox-one/call-of-duty-modern-warfare", "publisher": "Activision", "release_date": "Oct 25 2019", "developers": ["Infinity Ward"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 20 ", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/2/435d6a0a57c446588873338ba189d17d-98.jpg", "descriptions": "Prepare to go dark, Modern Warfare® is back! The stakes have never been higher as players take on the role of lethal Tier One operators in a heart-racing saga that will affect the global balance of power. Call of Duty®: Modern Warfare® engulfs fans in an incredibly raw, gritty, provocativePrepare to go dark, Modern Warfare® is back! The stakes have never been higher as players take on the role of lethal Tier One operators in a heart-racing saga that will affect the global balance of power. Call of Duty®: Modern Warfare® engulfs fans in an incredibly raw, gritty, provocative narrative that brings unrivaled intensity and shines a light on the changing nature of modern war. Developed by the studio that started it all, Infinity Ward delivers an epic reimagining of the iconic Modern Warfare® series from the ground up. In the visceral and dramatic single-player story campaign, Call of Duty®: Modern Warfare® pushes boundaries and breaks rules the way only Modern Warfare® can. Players will engage in breathtaking covert operations alongside a diverse cast of international special forces throughout iconic European cities and volatile expanses of the Middle East. And the story doesn't end there. In Call of Duty®: Modern Warfare®, players will be thrust into an immersive narrative spanning the entire game. Experience the ultimate online playground with classic multiplayer, or squad-up and play cooperatively in a collection of elite operations accessible to all skill levels.… Expand"}, {"name": "Dungeon Defenders", "details_link": "https://www.metacritic.com/game/playstation-3/dungeon-defenders", "publisher": "Trendy Entertainment", "release_date": "Oct 18 2011", "developers": ["Trendy Entertainment"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/9/84f7d6d91d72903197141f112d4bf114-98.jpg", "descriptions": "In Dungeon Defenders, fight for team and territory in a mash-up of action, RPG, and tower defense."}, {"name": "Ultimate Marvel vs. Capcom 3", "details_link": "https://www.metacritic.com/game/playstation-3/ultimate-marvel-vs-capcom-3", "publisher": "Capcom", "release_date": "Nov 15 2011", "developers": ["Capcom"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Xbox 360", "Xbox One", "PlayStation 3"], "num_players": "Up to 8 ", "genres": ["Action", "Fighting", "Fighting", "2D", "2D"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/6/e2794526fbb73f38d143761ca10b2bdc-98.jpg", "descriptions": "Ultimate Marvel vs. Capcom 3 adds 12 new characters to the roster as well as adding a Spectator mode for fans to watch players fight."}, {"name": "MLB The Show 23", "details_link": "https://www.metacritic.com/game/playstation-5/mlb-the-show-23", "publisher": "Sony Interactive Entertainment", "release_date": "Mar 24 2023", "developers": ["Sony Interactive Entertainment San Diego Studio"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Baseball", "Sim"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/8/b94bbc25e9f7e09ca48742197a7c5709-98.jpg", "descriptions": "MLB® The Show™ 23 gets you closer than ever to living your Baseball dreams on the diamond. Shock The Game and Own The Show™ with your favorite players, your favorite rivalries, and all your favorite MLB® moments."}, {"name": "Mario Power Tennis", "details_link": "https://www.metacritic.com/game/gamecube/mario-power-tennis", "publisher": "Nintendo", "release_date": "Nov  8 2004", "developers": ["Camelot Software Planning"], "platforms": "GameCube", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Tennis"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/a7e98c17b14a78c6382871f577027255-98.jpg", "descriptions": "The popular N64 tennis game returns with even more powerful shots, new power-ups, and wild environments. Now you can join all your favorite characters from the Mushroom Kingdom--including Mario, Donkey Kong, Bowser, and Peach--on various courts inspired by Nintendo games. Each character hasThe popular N64 tennis game returns with even more powerful shots, new power-ups, and wild environments. Now you can join all your favorite characters from the Mushroom Kingdom--including Mario, Donkey Kong, Bowser, and Peach--on various courts inspired by Nintendo games. Each character has a special strength that you can use for both offense and defense. Build up your skill points in single-player challenges or practice your skills in four-player matches.… Expand"}, {"name": "Final Fantasy VIII Remastered", "details_link": "https://www.metacritic.com/game/playstation-4/final-fantasy-viii-remastered", "publisher": "Square Enix", "release_date": "Sep  3 2019", "developers": ["Square Enix"], "platforms": ["iPhone/iPad", "PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/4e0f50f49e9f4d3a5f04e3fc9637f14e-98.jpg", "descriptions": "In a world where an ancient energy known as the Sorceress Power is passed down through generations, the peace of the realm is threatened when the evil Sorceress Edea takes power as ruler of the Galbadia Republic. Squall, a member of Balamb Garden Military Academy's elite mercenary forceIn a world where an ancient energy known as the Sorceress Power is passed down through generations, the peace of the realm is threatened when the evil Sorceress Edea takes power as ruler of the Galbadia Republic. Squall, a member of Balamb Garden Military Academy's elite mercenary force SeeD, other allies from the Garden, and Rinoa, a member of the resistance, join together on a journey to fight against Sorceress Edea, who shows hostility toward the Garden. [Square Enix]… Expand"}, {"name": "Gears Tactics", "details_link": "https://www.metacritic.com/game/pc/gears-tactics", "publisher": "Microsoft Game Studios", "release_date": "Apr 28 2020", "developers": ["Splash Damage", "The Coalition"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/7/b792fbce5a2ebb159ed69f442cd96102-98.jpg", "descriptions": "Gears Tactics is the fast-paced, turn-based strategy game from one of the most-acclaimed video game franchises – Gears of War. Outnumbered and fighting for survival, recruit and command your squad to hunt down an evil mastermind who makes monsters."}, {"name": "The Legend of Heroes: Trails of Cold Steel II", "details_link": "https://www.metacritic.com/game/playstation-vita/the-legend-of-heroes-trails-of-cold-steel-ii", "publisher": "XSEED Games", "release_date": "Sep  6 2016", "developers": ["Falcom"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/5/cb66e34c0cc5ed91e55d250c5d20ed82-98.jpg", "descriptions": "Peace a memory. Despite the best efforts of military student Rean Schwarzer and his comrades, forces much greater than they have swept the land of Erebonia into a full-blown civil war. After a terrible struggle, Rean awakens in the mountains near his hometown, uncertain what fate befell hisPeace a memory. Despite the best efforts of military student Rean Schwarzer and his comrades, forces much greater than they have swept the land of Erebonia into a full-blown civil war. After a terrible struggle, Rean awakens in the mountains near his hometown, uncertain what fate befell his classmates and comrades. Though the road will not be an easy one, Rean decides to take up his sword once again.… Expand"}, {"name": "Fire Emblem Warriors: Three Hopes", "details_link": "https://www.metacritic.com/game/switch/fire-emblem-warriors-three-hopes", "publisher": "Nintendo", "release_date": "Jun 24 2022", "developers": ["Nintendo", "Koei Tecmo Games"], "platforms": "Switch", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General", "Action", "Beat-'Em-Up", "3D"], "meta_score": 80, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/4/97a1230dddf878c1f04289b24d0ec1be-98.jpg", "descriptions": "Join Fire Emblem: Three Houses characters as you engage in massive battles across Fódlan Edelgard, Dimitri, Claude, and other Fire Emblem: Three Houses characters return to put their combat expertise on display as you revisit a war-torn Fódlan. Unleash devastating combos and striking specialJoin Fire Emblem: Three Houses characters as you engage in massive battles across Fódlan Edelgard, Dimitri, Claude, and other Fire Emblem: Three Houses characters return to put their combat expertise on display as you revisit a war-torn Fódlan. Unleash devastating combos and striking special moves in action-packed, real-time combat. Cut through hordes of enemies as characters from the Fire Emblem: Three Houses game. Take down dozens of foes with Edelgard’s axe or Dimitri’s lance, or blast enemies from a distance with Claude’s bow. Slash, swing, and spear your way to a brighter future for Fódlan.… Expand"}, {"name": "MLB The Show 22", "details_link": "https://www.metacritic.com/game/xbox-series-x/mlb-the-show-22", "publisher": "Sony Interactive Entertainment", "release_date": "Apr  1 2022", "developers": ["Sony Interactive Entertainment San Diego Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Sports", "Team", "Baseball", "Sim"], "meta_score": 80, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/6d72027b74d8188c1d536be57163ebd0-98.jpg", "descriptions": "Diamond Dynasty is back. Play, collect, and build on your fantasy card collection and bring to life on the diamond*. Try the new Mini Seasons mode, where each season brings new challenges as you face off against a new set of competition. Create and use multiple Ballplayers, beyond your RoadDiamond Dynasty is back. Play, collect, and build on your fantasy card collection and bring to life on the diamond*. Try the new Mini Seasons mode, where each season brings new challenges as you face off against a new set of competition. Create and use multiple Ballplayers, beyond your Road to the Show personalized Baseball RPG experience, and customize your Ballplayers exactly how you want to aid in your progression. Face your friends with cross-platform play**. With cross progression, continue your progress and earn and use content on other console platforms. Stepping up to the plate for the first time? Tailor your experience with gameplay styles and two new difficulty settings to help you get the hang of the basics. Play March to October in your style, with updated mode tools to utilize custom uniforms, logos, and created stadiums. Live out your dream Baseball matchups with new Legends joining the diamond.\r… Expand"}, {"name": "Buzz! Quiz World", "details_link": "https://www.metacritic.com/game/playstation-3/buzz!-quiz-world", "publisher": "SCEA", "release_date": "Nov 11 2009", "developers": ["Relentless Software"], "platforms": "PlayStation 3", "num_players": "1-8 ", "genres": ["Miscellaneous", "Trivia / Game Show", "Trivia / Game Show"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/2/3ebaecf381dbb72b808995c4c4726e75-98.jpg", "descriptions": "Buzz! Quiz World is back with another iteration of the ultra-realistic quiz show experience on the PS3."}, {"name": "Plants vs Zombies: Garden Warfare 2", "details_link": "https://www.metacritic.com/game/xbox-one/plants-vs-zombies-garden-warfare-2", "publisher": "Electronic Arts", "release_date": "Feb 23 2016", "developers": ["PopCap"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "Up to 24 ", "genres": ["Action", "Shooter", "Third-Person", "Tactical"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/2/f46f9cdfae7754e0e6a1d68a461b49c5-98.jpg", "descriptions": "In Plants vs. Zombies Garden Warfare 2, the zombies have conquered, and the plants are on the attack for the first time in this  shooter. In your Backyard Battleground you can edit your character’s abilities and customizations, choose quests, jump into co-op or multiplayer action modes, orIn Plants vs. Zombies Garden Warfare 2, the zombies have conquered, and the plants are on the attack for the first time in this  shooter. In your Backyard Battleground you can edit your character’s abilities and customizations, choose quests, jump into co-op or multiplayer action modes, or invite up to three friends in to your backyard to start a party and take on AI – defeat a wave, and a more powerful wave will show up. You can also switch teams to challenge your friends. Backyard Battleground is your own frontline base to plan your attack before you enter the battle for Zomburbia. [EA]… Expand"}, {"name": "Call of Duty: Warzone 2.0", "details_link": "https://www.metacritic.com/game/pc/call-of-duty-warzone-20", "publisher": "Activision", "release_date": "Nov 16 2022", "developers": ["Infinity Ward"], "platforms": ["PlayStation 4", "PlayStation 5", "Xbox One", "Xbox Series X", "PC"], "num_players": "Up to more than 64 ", "genres": ["Action", "Shooter", "First-Person", "Tactical"], "meta_score": 80, "users_score": 2.4, "image": "https://static.metacritic.com/images/products/games/3/2d3128a12b176dfeb540d563534e4865-98.jpg", "descriptions": "As shown at Call of Duty: Next, Call of Duty: Warzone 2.0, the sequel to the seminal Battle Royale experience over 125 million players dropped in to play, is set to arrive this November 16, as part of Modern Warfare II's Season One.This massive, free-to-play offering leverages newAs shown at Call of Duty: Next, Call of Duty: Warzone 2.0, the sequel to the seminal Battle Royale experience over 125 million players dropped in to play, is set to arrive this November 16, as part of Modern Warfare II's Season One.This massive, free-to-play offering leverages new technology shared with Modern Warfare II, introduces a host of new innovations, and continues the new era of Call of Duty coming this Fall, starting with Modern Warfare II's launch on October 28.… Expand"}, {"name": "Old World", "details_link": "https://www.metacritic.com/game/pc/old-world", "publisher": "Mohawk Games", "release_date": "Jul  1 2021", "developers": ["Mohawk Games"], "platforms": "PC", "num_players": "Up to 10 ", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/c934b149140fba4c97e5cb9ca3ba8f2d-98.jpg", "descriptions": "Conquer the Old World in this historical, epic strategy game from Soren Johnson, Lead Designer of Civilization IV and Offworld Trading Company. Every year is a turn, and each leader is a mere mortal, so your lasting legacy will be the dynasty you leave behind."}, {"name": "Dark Deity", "details_link": "https://www.metacritic.com/game/pc/dark-deity", "publisher": "Freedom LLC", "release_date": "Jun 15 2021", "developers": ["Sword & Axe LLC"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "Japanese-Style"], "meta_score": 80, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/2/fe0ba09335135c8bd3ea937a483d4d5f-98.jpg", "descriptions": "Command legendary heroes to reshape a land fractured by broken oaths, reckless wars, and secret arcane powers. The technological and cultural achievements of a once-great civilization now lie locked inside the ruins of ancient temples throughout the world of Terrazael. Long after society'sCommand legendary heroes to reshape a land fractured by broken oaths, reckless wars, and secret arcane powers. The technological and cultural achievements of a once-great civilization now lie locked inside the ruins of ancient temples throughout the world of Terrazael. Long after society's mighty history is snuffed out by a powerful and mysterious \"Calamity\", the people of Etlan teeter on the brink of total war.In a desperate attempt to bolster his recruit ranks, King Varic of the Kingdom of Delia expedites the graduation of all students at the Brookstead Military Academy, severing a pact that has stood for a thousand years. With the course of their future undemocratically derailed, these four \"graduates\" of the Brookstead Academy set out to leave their mark on this world.This is their story.… Expand"}, {"name": "Phoenix Wright: Ace Attorney Trilogy", "details_link": "https://www.metacritic.com/game/pc/phoenix-wright-ace-attorney-trilogy", "publisher": "Capcom", "release_date": "Apr  9 2019", "developers": ["Capcom"], "platforms": ["3DS", "iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/6/d56aace4adb9f5814da814ddd7313f0c-98.jpg", "descriptions": "Defend the innocent and save the day! Courtroom hero Phoenix Wright lays down the law this Winter in the digital release of Phoenix Wright: Ace Attorney Trilogy. Experience the original trilogy like never before in clear, high-resolution re-drawn graphics and immersive 3D visuals optimizedDefend the innocent and save the day! Courtroom hero Phoenix Wright lays down the law this Winter in the digital release of Phoenix Wright: Ace Attorney Trilogy. Experience the original trilogy like never before in clear, high-resolution re-drawn graphics and immersive 3D visuals optimized for the Nintendo 3DS system. Join rookie lawyer Phoenix Wright through the early years of his career in his quest to find the truth behind all of the classic cases! Prepare for intense courtroom showdowns by investigating crime scenes, collecting evidence, and questioning witnesses. Use evidence and the testimonies of witnesses to your advantage as you battle for the innocence of your client. Nothing less of a full acquittal will do in this court of law. Find the contradictions in witnesses' testimonies to expose the truth!\r As a new feature, the Japanese version of the game, \"Gyakuten Saiban 123 Naruhodo Selection,\" will be included, giving players the option to switch between the Japanese and English versions in-game. Phoenix Wright: Ace Attorney Trilogy includes Phoenix Wright: Ace Attorney, Phoenix Wright: Ace Attorney - Justice For All, and Phoenix Wright: Ace Attorney - Trials and Tribulations and will be available to purchase as a digital download title exclusively on the Nintendo eShop for Nintendo 3DS.\r -Three beloved games in one: For the first time ever on Nintendo 3DS, experience all of the classic courtroom drama from the original Phoenix Wright trilogy in one epic collection.\r-Familiar faces return: Join Phoenix Wright in his early years, as he gets introduced to his colorful cast of friends and foes, including Pearl Fey and rival prosecutor Miles Edgeworth.\r-Two classic gameplay segments:\r--Investigation phase - survey crime scenes, interview witnesses and gather evidence that will be used in court.\r--Court phase - present findings from the investigation to support your case, listen to testimonies and examine witnesses.\r-Play two versions: the Japanese version of the game, \"Gyakuten Saiban 123 Naruhodo Selection,\" will be included, giving players the option to switch between the Japanese and English versions in-game.… Expand"}, {"name": "Shantae: Half-Genie Hero", "details_link": "https://www.metacritic.com/game/wii-u/shantae-half-genie-hero", "publisher": "XSEED Games", "release_date": "Dec 20 2016", "developers": ["WayForward"], "platforms": ["PC", "PlayStation 4", "PlayStation Vita", "Stadia", "Switch", "Xbox One", "Wii U"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/6/23f0460e0e05e978ed13b593d4d2519e-98.jpg", "descriptions": "Shantae: Half-Genie Hero is a belly dancing, hair-whipping HD adventure from WayForward, makers of Ducktales Remastered, Adventure Time, and Contra 4."}, {"name": "Madden NFL 25", "details_link": "https://www.metacritic.com/game/xbox-360/madden-nfl-25", "publisher": "Electronic Arts", "release_date": "Aug 27 2013", "developers": ["EA Sports"], "platforms": ["iPhone/iPad", "PlayStation 3", "PlayStation 4", "Xbox One", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Team", "Football", "Arcade", "Arcade", "Sim"], "meta_score": 80, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/5/d4b645ee8b3bc75b734cf1d1e7e7f44a-98.jpg", "descriptions": "Madden NFL 25 unleashes the power, precision, and creativity of the NFL running-back. Whether you’re a slashing tailback, dual-threat QB, or ball-hawking safety, unleash thirty new moves and string together devastating combos with the all-new precision modifier in Madden NFL 25."}, {"name": "Cursed to Golf", "details_link": "https://www.metacritic.com/game/pc/cursed-to-golf", "publisher": "Thunderful", "release_date": "Aug 18 2022", "developers": ["Chuhai Labs"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Golf", "Arcade"], "meta_score": 80, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/95b4f06a46ff37225a9b8dfcc355f1b9-98.jpg", "descriptions": "Cursed to Golf is a golf-like adventure where every shot counts. Players are tasked with making it out of Golf Purgatory to become a Golfing Legend.\r With insane hazards, otherworldly power-ups and tons of replayability, will you make it back alive or will you forever be... Cursed to Golf!?"}, {"name": "TOEM", "details_link": "https://www.metacritic.com/game/playstation-5/toem", "publisher": "Something We Made", "release_date": "Sep 17 2021", "developers": ["Something We Made"], "platforms": ["PC", "Switch", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/9/db03f3f5a62d3f1cd6b0c1b60af2270a-98.jpg", "descriptions": "A photo adventure. Set off on a delightful expedition and use your photographic eye to uncover the mysteries of the magical TOEM in this hand-drawn adventure game. Chat with quirky characters, solve their problems by snapping neat photos, and make your way through a relaxing landscape!A photo adventure. Set off on a delightful expedition and use your photographic eye to uncover the mysteries of the magical TOEM in this hand-drawn adventure game. Chat with quirky characters, solve their problems by snapping neat photos, and make your way through a relaxing landscape!\r Key Features\r- Take photos with your camera to solve puzzles and help people!\r- Listen to chill beats and take in your surroundings!\r- Meet quirky characters and help them with their problems!… Expand"}, {"name": "The Last Campfire", "details_link": "https://www.metacritic.com/game/pc/the-last-campfire", "publisher": "Hello Games", "release_date": "Aug 27 2020", "developers": ["Hello Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Puzzle", "Action", "General"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/8/f16165ea60d5762d91a52d90509f5beb-98.jpg", "descriptions": "DISCOVER A PURPOSEThe Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.\n\nON A JOURNEY\nTravel deeper into the lands beyond the dark forest and overcome the adversities before you.\n\nUNCOVER A WORLD\nDiscover beautifulDISCOVER A PURPOSEThe Last Campfire is an adventure, a story of a lost ember trapped in a puzzling place, searching for meaning and a way home.ON A JOURNEYTravel deeper into the lands beyond the dark forest and overcome the adversities before you.UNCOVER A WORLDDiscover beautiful wilderness filled with lost folk, strange creatures and mysterious ruins.LIGHT THE LAST CAMPFIREFind hope and carry it with you on your Journey to light The Last Campfire.FROM A SMALL STUDIOA unique tale from Hello Games and the creative minds behind LostWinds.… Expand"}, {"name": "The Red Strings Club", "details_link": "https://www.metacritic.com/game/switch/the-red-strings-club", "publisher": "Devolver Digital", "release_date": "Mar 14 2019", "developers": ["Deconstructeam"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Visual Novel"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/22a64d93e2e56cf7216bb1a5dab4cf73-98.jpg", "descriptions": "The Red Strings Club is a cyberpunk narrative experience about fate and happiness featuring the extensive use of pottery, bartending and impersonating people on the phone to take down a corporate conspiracy.The professed altruistic corporation Supercontinent Ltd is on the verge ofThe Red Strings Club is a cyberpunk narrative experience about fate and happiness featuring the extensive use of pottery, bartending and impersonating people on the phone to take down a corporate conspiracy.The professed altruistic corporation Supercontinent Ltd is on the verge of releasing Social Psyche Welfare: a system that will eliminate depression, anger and fear from society. However, the bartender of a clandestine club and a freelance hacker don't regard this evolution as an improvement but as brainwashing. Alongside unwitting company employees and a rogue empathy android, the duo will pull all the strings they can to bring down this scheme.… Expand"}, {"name": "Tales of Vesperia: Definitive Edition", "details_link": "https://www.metacritic.com/game/xbox-one/tales-of-vesperia-definitive-edition", "publisher": "Bandai Namco Games", "release_date": "Jan 11 2019", "developers": ["Bandai Namco Games", "QLOC"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Role-Playing", "Action RPG"], "meta_score": 80, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/2/7861e7d6f8f8f02fc4797a6aec258f3a-98.jpg", "descriptions": "Tales of Vesperia: Definitive Edition celebrates the 10th anniversary of this RPG with new fully playable characters, events and other additional content never released outside of Japan. Follow Yuri Lowell, a former Imperial Knight, as he befriends a colorful cast of characters throughoutTales of Vesperia: Definitive Edition celebrates the 10th anniversary of this RPG with new fully playable characters, events and other additional content never released outside of Japan. Follow Yuri Lowell, a former Imperial Knight, as he befriends a colorful cast of characters throughout the world of Terca Lumireis and finds himself in the middle of a nefarious plot that threatens the destruction of the entire planet.… Expand"}, {"name": "Pac-Man 256", "details_link": "https://www.metacritic.com/game/xbox-one/pac-man-256", "publisher": "Bandai Namco Games", "release_date": "Jun 21 2016", "developers": ["HIPSTER WHALE"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Arcade"], "meta_score": 80, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/7c164128cff5e3f14242446dbabda790-98.jpg", "descriptions": "Control Pac-Man as you devour pellets and ghosts in an endless maze, and you must continue moving forward as a wave of glitches follow and destroy you if they get too close. The game ends when you die, so getting as many points as possible is key."}, {"name": "Disgaea 5: Alliance of Vengeance", "details_link": "https://www.metacritic.com/game/playstation-4/disgaea-5-alliance-of-vengeance", "publisher": "NIS America", "release_date": "Oct  6 2015", "developers": ["Nippon Ichi Software"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Fantasy", "Strategy", "Turn-Based", "Tactics"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/4/4dfe580b2b19986ff5f24ff40b5517fd-98.jpg", "descriptions": "The sixth home console entry to the Disgaea series tells a tale of revenge, and of rebellion. As a new and terrible Overlord named Void Dark seeks to enslave the countless Netherworlds, one young demon has stood to end his reign—Killia. In Disgaea 5, lead Killia and his tenacious army ofThe sixth home console entry to the Disgaea series tells a tale of revenge, and of rebellion. As a new and terrible Overlord named Void Dark seeks to enslave the countless Netherworlds, one young demon has stood to end his reign—Killia. In Disgaea 5, lead Killia and his tenacious army of rebels on their dark and dangerous path to vengeance.… Expand"}, {"name": "Lovers in a Dangerous Spacetime", "details_link": "https://www.metacritic.com/game/pc/lovers-in-a-dangerous-spacetime", "publisher": "Asteroid Base", "release_date": "Sep  9 2015", "developers": ["Asteroid Base"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "Shooter", "2D", "2D", "Shoot-'Em-Up", "Horizontal"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/4/23806782633d93a29513ccf6976ceb95-98.jpg", "descriptions": "Lovers in a Dangerous Spacetime is a 2-player co-op micro-platformer set inside a neon spaceship locked in battle with hordes of space baddies. Players work together running back and forth between ship control rooms, manning turrets, lasers, shields and thrusters to rack up points and staveLovers in a Dangerous Spacetime is a 2-player co-op micro-platformer set inside a neon spaceship locked in battle with hordes of space baddies. Players work together running back and forth between ship control rooms, manning turrets, lasers, shields and thrusters to rack up points and stave off a vacuumy demise. In mish-mash terms you could describe it as Jumpman meets Asteroids meets Han saying \"Don't get cocky.\"… Expand"}, {"name": "Age of Conan: Hyborian Adventures", "details_link": "https://www.metacritic.com/game/pc/age-of-conan-hyborian-adventures", "publisher": "Eidos Interactive", "release_date": "May 20 2008", "developers": ["Funcom"], "platforms": "PC", "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy", "Fantasy"], "meta_score": 80, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/3/85377da8dea1fbec6421f7b990a4a833-98.jpg", "descriptions": "In 'Conan' the players encounter a dark, lush, violent and sinful universe, presented in fantastic graphics and stunning 7.1 surround audio. In a world filled with cruel gods, mythical creatures, lost civilizations and a struggling human race, the mighty barbarian has finally seized theIn 'Conan' the players encounter a dark, lush, violent and sinful universe, presented in fantastic graphics and stunning 7.1 surround audio. In a world filled with cruel gods, mythical creatures, lost civilizations and a struggling human race, the mighty barbarian has finally seized the throne as king of Aquilonia. But Conan's rule is on the brink of chaos, spiraling towards the doom of ancient evils. In this twisted fantasy world, dark magic and brutal combat lurks around every corner, and each man and woman must carve their own unique destiny under Conan's reign. In the true vision of Robert E. Howard's dark universe, it's now time for you to become a messenger of death. In addition to incredible graphics and sound, the game will be filled with unique features like the \"Real Combat\" engine; a revolutionary new multi-point melee system which allows the players to swing their weapons where they direct it, in real-time! This easy to learn and fun melee system lets the players truly feel they are on the battlefield, and goes head-on against the formulaic nature of online RPG combat. In 'Conan' you can also, for the first time in an online RPG, create player-made battle formations where you can command NPC's and other players in combat, making for epic multiplayer battles. The multiplayer game also allow the players to form guilds and lay siege to enemy castles, letting their catapults sing their merry song of death as the enemy is crushed to a pulp. [Funcom]… Expand"}, {"name": "Company of Heroes 2: The Western Front Armies", "details_link": "https://www.metacritic.com/game/pc/company-of-heroes-2-the-western-front-armies", "publisher": "Sega", "release_date": "Jun 23 2014", "developers": ["Relic", "Relic Entertainment"], "platforms": "PC", "genres": ["Strategy", "Real-Time", "General", "Historic"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/383eb3a4ad698821bf6bc927ebc4dfaf-98.jpg", "descriptions": "The Western Front Armies is available as a stand-alone package that represents an entry point into the franchise and access to the vibrant Company of Heroes 2 community. New players can also access 23 existing Company of Heroes 2 maps in auto-match, and play against all other existing factions."}, {"name": "Rogue Legacy", "details_link": "https://www.metacritic.com/game/switch/rogue-legacy", "publisher": "Cellar Door Games", "release_date": "Nov  6 2018", "developers": ["Cellar Door Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "PlayStation 4", "PlayStation Vita", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/9fc8729bd1929859509ec06ea2c5db27-98.jpg", "descriptions": "Each time you die, your child will succeed you. Every child is unique. One child might be colorblind, another might have tourettes-- they could even be a dwarf.\r That's OK, because no one is perfect, and you don't have to be perfect to win this game. But you do have to be pretty darn goodEach time you die, your child will succeed you. Every child is unique. One child might be colorblind, another might have tourettes-- they could even be a dwarf.\r That's OK, because no one is perfect, and you don't have to be perfect to win this game. But you do have to be pretty darn good because this game is HARD. Fortunately, every time you die all the gold you've collected can be used to upgrade you manor, giving your next child a step up in life and another chance at vanquishing evil.… Expand"}, {"name": "Darksiders: Warmastered Edition", "details_link": "https://www.metacritic.com/game/xbox-one/darksiders-warmastered-edition", "publisher": "Nordic Games Publishing", "release_date": "Nov 22 2016", "developers": ["Nordic Games Publishing"], "platforms": ["PC", "PlayStation 4", "Switch", "Wii U", "Xbox One"], "genres": ["Action Adventure", "Open-World"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/1/0c2f718cf53f58dc639d5efa09d95950-98.jpg", "descriptions": "Deceived by the forces of evil into prematurely hearkening the end of the world, War — the first Horseman of the Apocalypse — stands accused of breaking the sacred law by inciting a war between Heaven and Hell. In the slaughter that ensued, the demonic forces defeated the heavenly hosts andDeceived by the forces of evil into prematurely hearkening the end of the world, War — the first Horseman of the Apocalypse — stands accused of breaking the sacred law by inciting a war between Heaven and Hell. In the slaughter that ensued, the demonic forces defeated the heavenly hosts and laid claim to the Earth.… Expand"}, {"name": "Sid Meier's Civilization V: Gods & Kings", "details_link": "https://www.metacritic.com/game/pc/sid-meiers-civilization-v-gods-kings", "publisher": "2K Games", "release_date": "Jun 18 2012", "developers": ["Firaxis Games"], "platforms": "PC", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "4X"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/cb134827d3e66c3c253d9a448a5fdd07-98.jpg", "descriptions": "Sid Meier's Civilization V: God & Kings takes players through time as they engage in new quests and global competitions, interact with new types of city-states, and master exciting new systems for land and naval combat. Nine new civilizations; nine new wonders; three original scenarios;Sid Meier's Civilization V: God & Kings takes players through time as they engage in new quests and global competitions, interact with new types of city-states, and master exciting new systems for land and naval combat. Nine new civilizations; nine new wonders; three original scenarios; and dozens of new units, buildings, technologies and resources have also been added, offering even more ways for players to expand their empire on their quest to rule the world.… Expand"}, {"name": "Dorfromantik", "details_link": "https://www.metacritic.com/game/pc/dorfromantik", "publisher": "Toukana Interactive", "release_date": "Apr 28 2022", "developers": ["Toukana Interactive"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "General"], "meta_score": 80, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/1/dcddd9c63db3d951d9651d78740c99a5-98.jpg", "descriptions": "Dorfromantik is a peaceful building strategy and puzzle game where you create a beautiful and ever-growing village landscape by placing tiles. Explore a variety of colorful biomes, discover and unlock new tiles and complete quests to fill your world with life!"}, {"name": "Metro Redux", "details_link": "https://www.metacritic.com/game/switch/metro-redux", "publisher": "Deep Silver", "release_date": "Feb 28 2020", "developers": ["4A Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/2/c022c768a70a5f35ccbc4f3592b96ca8-98.jpg", "descriptions": "In 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the earth’s surface into a poisonous wasteland. A handful of survivors took refuge in the depths of the Moscow underground, and human civilization entered a new Dark Age.\r The year isIn 2013 the world was devastated by an apocalyptic event, annihilating almost all mankind and turning the earth’s surface into a poisonous wasteland. A handful of survivors took refuge in the depths of the Moscow underground, and human civilization entered a new Dark Age.\r The year is 2033. An entire generation has been born and raised underground, and their besieged Metro Station-Cities struggle for survival, with each other, and the mutant horrors that await outside.\r You are Artyom, born in the last days before the fire, but raised underground. Having never ventured beyond the city limits, one fateful event sparks a desperate mission to the heart of the Metro system, to warn the remnants of mankind of a terrible impending threat.\r But will they even listen? Rather than stand united, the factions of the Metro are locked in a struggle for the ultimate power, a doomsday device from the military vaults of D6. A civil war is stirring that could wipe humanity from the face of the earth forever.\r Including the epic single-player campaigns of both Metro 2033 and Metro: Last Light, Metro Redux takes you on a journey from the forgotten catacombs beneath the subway to the desolate wastelands above, where your actions will determine the fate of mankind.\r Metro Redux is the ultimate double game collection, including the definitive versions of both Metro 2033 and Metro: Last Light, now available on Nintendo Switch™\r Newcomers to the series will get the chance to experience two of the finest story-driven shooters of all time in one vast package; an epic adventure combining gripping survival horror, exploration and tactical combat and stealth.\r Those who favoured the more survival-horror oriented gameplay of ‘Metro 2033’ can play both campaigns in the ‘Survival’ Play-Style, a fraught, slow burn fight for survival. Those who enjoyed the more action-oriented gameplay of ‘Metro: Last Light’ can try the ‘Spartan’ Play-Style, providing Artyom with a powerful set of combat skills.\r With the legendary Ranger Mode  included to offer an extra layer of challenge and immersion, and all previous released DLC, Metro Redux offers 50+ hours of AAA FPS gameplay for an incredible price.… Expand"}, {"name": "Dragon Quest IV: Chapters of the Chosen", "details_link": "https://www.metacritic.com/game/ds/dragon-quest-iv-chapters-of-the-chosen", "publisher": "Square Enix", "release_date": "Sep 16 2008", "developers": ["ArtePiazza"], "platforms": "DS", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Japanese-Style"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/8/db84c68bf3355cf63d6f75f45e49de60-98.jpg", "descriptions": "A tale of epic proportions told through a unique chapter sequence that enables players to experience multiple character perspectives. Embark on an adventure with characters from different walks of life, all destined to unite with you, the hero, to save the world. [Square Enix]"}, {"name": "The Elder Scrolls Online: Elsweyr", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-online-elsweyr", "publisher": "Bethesda Softworks", "release_date": "May 20 2019", "developers": ["ZeniMax Media"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Massively Multiplayer", "genres": ["Role-Playing", "Massively Multiplayer"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/aa44ce30a20cac5c7c2c4d5e6429d2dc-98.jpg", "descriptions": "Once thought lost to the mists of time, fearsome Dragons now soar the skies of Elsweyr, leaving scorched ruin in their wake. In The Elder Scrolls Online: Elsweyr, you must discover the dark purpose behind their rampage in a new epic story and prevent the destruction of the Khajiiti homeland.Once thought lost to the mists of time, fearsome Dragons now soar the skies of Elsweyr, leaving scorched ruin in their wake. In The Elder Scrolls Online: Elsweyr, you must discover the dark purpose behind their rampage in a new epic story and prevent the destruction of the Khajiiti homeland. Take heart, for these scaled monstrosities are not invincible, and with the right planning, tactics, and tools they can be brought to the ground and even killed. Coordination and skill are key to overcoming the Dragons, but if you succeed, you'll reap rewards not found anywhere else in Nirn. Beware the skies, walker.… Expand"}, {"name": "The Elder Scrolls: Legends", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-legends", "publisher": "Bethesda Softworks", "release_date": "Mar 20 2017", "developers": ["Bethesda Softworks", "Dire Wolf Digital"], "platforms": ["iPhone/iPad", "PC"], "num_players": "Online Multiplayer", "genres": ["Miscellaneous", "Board / Card Game"], "meta_score": 80, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/0/ff2202681f697334921766ec2d6f0f4d-98.jpg", "descriptions": "Welcome to The Elder Scrolls: Legends, a competitive strategy card game set in the Elder Scrolls universe. From building your deck to taking on foes in one of the game’s three exciting modes, every decision you make will require strategy and careful planning. Will you overpower your opponentWelcome to The Elder Scrolls: Legends, a competitive strategy card game set in the Elder Scrolls universe. From building your deck to taking on foes in one of the game’s three exciting modes, every decision you make will require strategy and careful planning. Will you overpower your opponent with brute force? Or will you defeat your foes with speed and cunning? Each deck in The Elder Scrolls: Legends can be crafted using two of the five attributes in the game: Strength, Agility, Intelligence, Endurance and Willpower. … Expand"}, {"name": "Watch Dogs", "details_link": "https://www.metacritic.com/game/playstation-4/watch-dogs", "publisher": "Ubisoft", "release_date": "May 27 2014", "developers": ["Ubisoft Montreal"], "platforms": ["PC", "PlayStation 3", "Wii U", "Xbox 360", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Modern", "Action Adventure", "General", "Modern", "Open-World"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/4/e45ccf684ed7521022031892eedfe8e9-98.jpg", "descriptions": "In the modern uber-connected world, Chicago maintains the nation's most advanced and integrated computer system – one which controls almost every facet of city technology and maintains critical information on all of the city's residents. Assume the role of Aiden Pearce, a notorious hackerIn the modern uber-connected world, Chicago maintains the nation's most advanced and integrated computer system – one which controls almost every facet of city technology and maintains critical information on all of the city's residents. Assume the role of Aiden Pearce, a notorious hacker and former thug, whose criminal history lead to a violent family tragedy. Now on the hunt for those people who have hurt your family, you will be able to monitor and hack all who surround you while manipulating the city's systems to stop traffic lights, download personal and private information, manipulate the electrical grid and more. Use the entire city of Chicago as your personal weapon and exact your signature brand of revenge.… Expand"}, {"name": "Age of Empires III: The WarChiefs", "details_link": "https://www.metacritic.com/game/pc/age-of-empires-iii-the-warchiefs", "publisher": "Microsoft Game Studios", "release_date": "Oct 17 2006", "developers": ["Ensemble Studios"], "platforms": "PC", "num_players": "8  Online", "genres": ["Strategy", "Real-Time", "Historic", "Historic", "Command"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/6/41fe7aa3d81964409996a6e1c9934d8c-98.jpg", "descriptions": "The new expansion pack builds off of the real-time-strategy gameplay of \"Age of Empires III,\" providing players with the ability to lead one of three proud Native American civilizations, including the Iroquois Confederation, to expand their empire and fight for control of the Americas. TheThe new expansion pack builds off of the real-time-strategy gameplay of \"Age of Empires III,\" providing players with the ability to lead one of three proud Native American civilizations, including the Iroquois Confederation, to expand their empire and fight for control of the Americas. The game provides new ways to play and win, introducing new gameplay elements and content including new civilizations, a new single player campaign, Home City enhancements and additional maps and units. [Microsoft]… Expand"}, {"name": "Ace Combat 6: Fires of Liberation", "details_link": "https://www.metacritic.com/game/xbox-360/ace-combat-6-fires-of-liberation", "publisher": "Namco Bandai Games America", "release_date": "Oct 23 2007", "developers": ["Project Aces"], "platforms": "Xbox 360", "num_players": "Up to 16 ", "genres": ["Action", "Simulation", "Flight", "Flight", "Combat"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/4/b781f5b62cc4f8f32e11cbb06ff6978d-98.jpg", "descriptions": "Online for the first time, via Xbox Live, players can experience Ace Combat 6: Fires of Liberation on a massive worldwide scale as it features an in-depth multi-player online experience that includes a variety of action-packed online modes. Players fight alongside fighter planes, gun ships,Online for the first time, via Xbox Live, players can experience Ace Combat 6: Fires of Liberation on a massive worldwide scale as it features an in-depth multi-player online experience that includes a variety of action-packed online modes. Players fight alongside fighter planes, gun ships, attack helicopters, tanks, naval fleets, heavy bombers, and electronic warfare vessels in the ultimate Ace Combat showdown. The Dynamic Operation System provides for massive battles unfolding on a \"living battlefield,\" as up to six independent land, sea or air conflicts can break out at any time at multiple locations as allies and enemies clash in real-time. Players can experience the realism of war when battlefields come alive with engagingly authentic audio and visual effects: thundering explosions, dense vapor trails of air to air missiles, piercing machine gun fire, booming anti-aircraft artillery fire, mid-air explosions, gigantic columns of black smoke and more. Players can prove their supremacy on a global scale as they pilot highly detailed, authentic aircraft such as the F-15 E Strike Eagle and the F-22 Raptor online via Xbox Live. For an all out worldwide battle for the sky, players can choose from a variety of different online modes including the death match and team death match style game modes. Or they can team up with friends to play in co-op, where players combine strategy and skill to work together to take on computer-controlled adversaries. Online rankings are calculated globally with high-ranking players being granted honorable titles on a global scale, adding fuel to the fires of furious competition. [Namco Bandai Games]… Expand"}, {"name": "Signalis", "details_link": "https://www.metacritic.com/game/playstation-4/signalis", "publisher": "Humble Games", "release_date": "Oct 27 2022", "developers": ["rose-engine"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 8.4, "image": "https://static.metacritic.com/images/products/games/2/68164fe6884d1f3948de7d042baa6d28-98.jpg", "descriptions": "Awaken from slumber and explore a surreal retrotech world as Elster, a technician Replika searching for her lost partner and her lost dreams.\r Discover terrifying secrets, challenging puzzles, and nightmarish creatures in a tense and melancholic experience of cosmic dread and classicAwaken from slumber and explore a surreal retrotech world as Elster, a technician Replika searching for her lost partner and her lost dreams.\r Discover terrifying secrets, challenging puzzles, and nightmarish creatures in a tense and melancholic experience of cosmic dread and classic psychological survival horror.… Expand"}, {"name": "Halo Infinite", "details_link": "https://www.metacritic.com/game/pc/halo-infinite", "publisher": "Microsoft Game Studios", "release_date": "Dec  8 2021", "developers": ["343 Industries"], "platforms": ["Xbox One", "Xbox Series X", "PC"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 80, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/1a3f604f779db7a21e0459baea6b4022-98.jpg", "descriptions": "When all hope is lost and humanity’s fate hangs in the balance, the Master Chief is ready to confront the most ruthless foe he’s ever faced. Begin anew and step inside the armor of humanity’s greatest hero to experience an epic adventure and finally explore the scale of the Halo ring itself."}, {"name": "WRC 10 The Official Game", "details_link": "https://www.metacritic.com/game/xbox-series-x/wrc-10-the-official-game", "publisher": "Maximum Games", "release_date": "Sep  2 2021", "developers": ["KT Racing"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "Up to 8 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 80, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/6/de0e12deb8f83a4b264b6ff19fb21ad2-98.jpg", "descriptions": "Reach the 2021 season podium, and to celebrate the 50th anniversary of the competition, relive the highlights at the wheel of legendary cars."}, {"name": "Crash Team Racing: Nitro-Fueled", "details_link": "https://www.metacritic.com/game/switch/crash-team-racing-nitro-fueled", "publisher": "Activision", "release_date": "Jun 21 2019", "developers": ["Beenox"], "platforms": ["PlayStation 4", "Xbox One", "Switch"], "num_players": "Up to 8 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/1/e365b385ef1907cf5a82ee02d915f189-98.jpg", "descriptions": "Crash is back in the driver’s seat. Get ready to go fur-throttle with Crash Team Racing Nitro-Fueled. It’s the authentic CTR experience plus a whole lot more, now fully-remastered and revved up to the max:\r • Start your engines with the original game modes, characters, tracks, power-ups,Crash is back in the driver’s seat. Get ready to go fur-throttle with Crash Team Racing Nitro-Fueled. It’s the authentic CTR experience plus a whole lot more, now fully-remastered and revved up to the max:\r • Start your engines with the original game modes, characters, tracks, power-ups, weapons and controls\r • Power slide to glory in additional karts and tracks from beyond the original game\r • Race online with friends and Crash the competition with online leaderboards\r With Crash Team Racing Nitro-Fueled, the stakes are high and the competition is fierce. It's the CTR you love, now kicked into the highest gear. … Expand"}, {"name": "Phoenix Wright: Ace Attorney Trilogy", "details_link": "https://www.metacritic.com/game/xbox-one/phoenix-wright-ace-attorney-trilogy", "publisher": "Capcom", "release_date": "Apr  9 2019", "developers": ["Capcom"], "platforms": ["3DS", "iPhone/iPad", "PC", "PlayStation 4", "Switch", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Compilation"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/c52657ef1295541f7f18d60f6e69265e-98.jpg", "descriptions": "Defend the innocent and save the day! Courtroom hero Phoenix Wright lays down the law this Winter in the digital release of Phoenix Wright: Ace Attorney Trilogy. Experience the original trilogy like never before in clear, high-resolution re-drawn graphics and immersive 3D visuals optimizedDefend the innocent and save the day! Courtroom hero Phoenix Wright lays down the law this Winter in the digital release of Phoenix Wright: Ace Attorney Trilogy. Experience the original trilogy like never before in clear, high-resolution re-drawn graphics and immersive 3D visuals optimized for the Nintendo 3DS system. Join rookie lawyer Phoenix Wright through the early years of his career in his quest to find the truth behind all of the classic cases! Prepare for intense courtroom showdowns by investigating crime scenes, collecting evidence, and questioning witnesses. Use evidence and the testimonies of witnesses to your advantage as you battle for the innocence of your client. Nothing less of a full acquittal will do in this court of law. Find the contradictions in witnesses' testimonies to expose the truth!\r As a new feature, the Japanese version of the game, \"Gyakuten Saiban 123 Naruhodo Selection,\" will be included, giving players the option to switch between the Japanese and English versions in-game. Phoenix Wright: Ace Attorney Trilogy includes Phoenix Wright: Ace Attorney, Phoenix Wright: Ace Attorney - Justice For All, and Phoenix Wright: Ace Attorney - Trials and Tribulations and will be available to purchase as a digital download title exclusively on the Nintendo eShop for Nintendo 3DS.\r -Three beloved games in one: For the first time ever on Nintendo 3DS, experience all of the classic courtroom drama from the original Phoenix Wright trilogy in one epic collection.\r-Familiar faces return: Join Phoenix Wright in his early years, as he gets introduced to his colorful cast of friends and foes, including Pearl Fey and rival prosecutor Miles Edgeworth.\r-Two classic gameplay segments:\r--Investigation phase - survey crime scenes, interview witnesses and gather evidence that will be used in court.\r--Court phase - present findings from the investigation to support your case, listen to testimonies and examine witnesses.\r-Play two versions: the Japanese version of the game, \"Gyakuten Saiban 123 Naruhodo Selection,\" will be included, giving players the option to switch between the Japanese and English versions in-game.… Expand"}, {"name": "Sleeping Dogs", "details_link": "https://www.metacritic.com/game/pc/sleeping-dogs", "publisher": "Square Enix", "release_date": "Aug 13 2012", "developers": ["United Front Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Action Adventure", "Modern", "Open-World"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/cca10aa5bff5d3738d4491ccf889634b-98.jpg", "descriptions": "Sleeping Dogs is an open world cop drama set in the vibrant city of Hong Kong. Taking the role of undercover cop Wei Shen, players must take down one of the world's most lethal criminal organizations from the inside. Featuring imaginative combat systems, Sleeping Dogs empowers enablesSleeping Dogs is an open world cop drama set in the vibrant city of Hong Kong. Taking the role of undercover cop Wei Shen, players must take down one of the world's most lethal criminal organizations from the inside. Featuring imaginative combat systems, Sleeping Dogs empowers enables players to perform an array of martial arts moves, singlehandedly taking on numerous opponents. Players perform visceral kicks and combos, vicious counters and a cinematic set of environmental takedowns making use of real-world items from circular saws to phone booths, incinerators to refrigerator doors.… Expand"}, {"name": "LEGO Marvel Super Heroes", "details_link": "https://www.metacritic.com/game/xbox-360/lego-marvel-super-heroes", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct 22 2013", "developers": ["TT Games"], "platforms": ["PC", "PlayStation 3", "PlayStation 4", "Switch", "Wii U", "Xbox One", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Fantasy", "General", "Fantasy", "Open-World"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/7/820e6b65e9dd18a251434450956f7272-98.jpg", "descriptions": "LEGO Marvel Super Heroes features an original story where players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world."}, {"name": "Alan Wake Remastered", "details_link": "https://www.metacritic.com/game/xbox-series-x/alan-wake-remastered", "publisher": "Epic Games", "release_date": "Oct  5 2021", "developers": ["Remedy Entertainment"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Survival"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/5/c83ebd878a1dfed2d687ea8179d1d0da-98.jpg", "descriptions": "In this cinematic action-thriller, troubled author Alan Wake embarks on a desperate search for his missing wife, Alice. Following her mysterious disappearance from the Pacific Northwest town of Bright Falls, he discovers pages of a horror story he has supposedly written, but he has no memoryIn this cinematic action-thriller, troubled author Alan Wake embarks on a desperate search for his missing wife, Alice. Following her mysterious disappearance from the Pacific Northwest town of Bright Falls, he discovers pages of a horror story he has supposedly written, but he has no memory of. Wake is soon forced to question his sanity, as page by page, the story comes true before his eyes: a hostile presence of supernatural darkness is taking over everyone it finds, turning them against him. He has no choice but to confront the forces of darkness armed only with his flashlight, a handgun and what remains of his shredded mind. His nightmarish journey to find answers to the mind-bending mystery he faces will lead him into the terrifying depths of the night. Alan Wake Remastered offers the complete experience, with the main game and its two story expansions - The Signal and The Writer - in stunning new 4K visuals. The tense, episodic story is packed with unexpected twists, heart-stopping cliff hangers, and intense bursts of combat where it takes more than bullets to banish the darkness. The game’s cutscenes, quirky cast of characters, and the majestic Pacific Northwest vistas have been enhanced for an experience that delivers as much on its visual impact as its unnerving atmosphere.… Expand"}, {"name": "SEASON: A letter to the future", "details_link": "https://www.metacritic.com/game/pc/season-a-letter-to-the-future", "publisher": "Scavengers Studio", "release_date": "Jan 31 2023", "developers": ["Scavengers Studio"], "platforms": ["PlayStation 4", "PlayStation 5", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 80, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/3/87fa649a35a400622f53d2fec5d893fd-98.jpg", "descriptions": "Immerse yourself in the world of Season, a third-person atmospheric adventure bicycle road trip game.Leave home for the first time to collect memories before a mysterious cataclysm washes everything away. Explore, record, meet people, and unravel the strange world around you."}, {"name": "Youropa", "details_link": "https://www.metacritic.com/game/pc/youropa", "publisher": "frecle ApS", "release_date": "Jun 27 2018", "developers": ["frecle ApS"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/e673831ca50d07bdb1b4058bd6ad16fe-98.jpg", "descriptions": "When Youropa is torn apart, You must use your unique wall walking ability to navigate a strange fragmented city, restore it to former glory and learn who you really are. A platform puzzle paint adventure about breaking rules, being upside down and thinking outside the box."}, {"name": "LEGO Dimensions", "details_link": "https://www.metacritic.com/game/xbox-one/lego-dimensions", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 27 2015", "developers": ["Traveller's Tales"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/9/d66437a35578d30f04463a2a5f1b4a58-98.jpg", "descriptions": "LEGO characters from a melding of some of the most recognizable brands in the universe join forces and battle in worlds outside of their own. A Dark Knight, a Wizard, and a LEGO Master Builder traveling together down the Yellow Brick Road is just the beginning."}, {"name": "Bully: Scholarship Edition", "details_link": "https://www.metacritic.com/game/xbox-360/bully-scholarship-edition", "publisher": "Rockstar Games", "release_date": "Mar  4 2008", "developers": ["Mad Doc Software", "Rockstar Vancouver"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Modern", "Modern", "Open-World"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/6/1f7e41b7f35326f751f768e602ea307e-98.jpg", "descriptions": "Both the Wii and Xbox 360 versions retain the wit and deep gameplay of the previously released PS2 title \"Bully\" and boasts additional new content. Bully: Scholarship Edition takes place in the fictional New England boarding school of Bullworth Academy and tells the story of 15-year-oldBoth the Wii and Xbox 360 versions retain the wit and deep gameplay of the previously released PS2 title \"Bully\" and boasts additional new content. Bully: Scholarship Edition takes place in the fictional New England boarding school of Bullworth Academy and tells the story of 15-year-old Jimmy Hopkins as he experiences the highs and lows of adjusting to a new school. Capturing the hilarity and awkwardness of adolescence perfectly, Bully: Scholarship Edition pulls the player into its cinematic and engrossing world. [Rockstar Games]… Expand"}, {"name": "Endless Space 2", "details_link": "https://www.metacritic.com/game/pc/endless-space-2", "publisher": "SegaSoft", "release_date": "May 19 2017", "developers": ["Amplitude Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 80, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/8/ab5d0d77a3c197268892e39332fe1cf8-98.jpg", "descriptions": "The sequel to Endless Space. Endless Space 2 is turn-based, 4X space-strategy that will put you in the role of a leader guiding his civilization in making its first steps into the cold depths of interstellar space. Your Vision. Their Future."}, {"name": "Atelier Sophie 2: The Alchemist of the Mysterious Dream", "details_link": "https://www.metacritic.com/game/switch/atelier-sophie-2-the-alchemist-of-the-mysterious-dream", "publisher": "Koei Tecmo Games", "release_date": "Feb 25 2022", "developers": ["Gust"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 80, "users_score": 9.0, "image": "https://static.metacritic.com/images/products/games/8/91b94a3da68d54226bfac6a77105163e-98.jpg", "descriptions": "A mysterious story of a mysterious dream...\rOne of the stories experienced throughout the Alchemist Sophie’s many adventures, as she continued her travels after leaving her hometown of Kirchen Bell.\rThis is Sophie’s adventure as she searches for her friend Plachta in the dream world ErdeA mysterious story of a mysterious dream...\rOne of the stories experienced throughout the Alchemist Sophie’s many adventures, as she continued her travels after leaving her hometown of Kirchen Bell.\rThis is Sophie’s adventure as she searches for her friend Plachta in the dream world Erde Wiege, where they become separated, and shows the bonds she forms with the people she meets and passing of hearts.\r ■Evolved turn-based battles & seamless transitions!\rIn the 6 member party turn-based battles, the 3 members in the front and 3 in the back form 2 teams cooperating “multi-linked turn battles”, and transitions from exploration to battles without loading times in “seamless battles”, the entire game can be enjoyed at a great pace.\r ■2 types of panels for everyone to enjoy synthesis!\rThis game uses panel synthesis, the synthesis system of the Mysterious series, where materials are placed in the panel slots to create new items in this puzzle-like feature. By placing the certain materials in the slots, various effects can be produced.\rThere are 2 types of panels in this game that players can select from : a regular panel and a restricted panel that has a higher synthesis difficulty level.\rThe board of the restricted panel is fairly complex, but when materials are placed just right, items with high effects can be synthesized, which can't be generated from the regular panel. … Expand"}, {"name": "ABZU", "details_link": "https://www.metacritic.com/game/switch/abzu", "publisher": "505 Games", "release_date": "Nov 29 2018", "developers": ["Giant Squid"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 80, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/3/08bccf5645fda7399c3945ac9eb67a30-98.jpg", "descriptions": "Discover a lush hidden world as you descend into the heart of the ocean, where ancient secrets lie forgotten and encounters with majestic creatures await.\r ABZU is an epic descent into the depths of the sea, where players will explore beautifully rendered ocean environments with fluidDiscover a lush hidden world as you descend into the heart of the ocean, where ancient secrets lie forgotten and encounters with majestic creatures await.\r ABZU is an epic descent into the depths of the sea, where players will explore beautifully rendered ocean environments with fluid swimming controls. The experience draws inspiration from the deep innate narrative that we all carry within our subconscious: the story of ABZU is a universal myth that resonates across cultures. The name references a concept from the oldest mythologies; it is the combination of the two ancient words AB, meaning ocean, and ZU, meaning to know. ABZU is the ocean of wisdom.… Expand"}, {"name": "Pokemon Black Version 2", "details_link": "https://www.metacritic.com/game/ds/pokemon-black-version-2", "publisher": "Nintendo", "release_date": "Oct  7 2012", "developers": ["Game Freak"], "platforms": "DS", "num_players": "2 ", "genres": ["Role-Playing", "Console-style RPG", "Console-style RPG", "Trainer"], "meta_score": 80, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/3/cf028d51fcd8761452dd28219d7e13af-98.jpg", "descriptions": "In the Pokemon Black Version 2 game, players can explore new areas, discover gyms with new leaders and see how everything has changed in the last two years."}, {"name": "Tom Clancy's Ghost Recon 2", "details_link": "https://www.metacritic.com/game/xbox/tom-clancys-ghost-recon-2", "publisher": "Ubisoft", "release_date": "Nov 16 2004", "developers": ["Red Storm Entertainment"], "platforms": ["PlayStation 2", "Xbox 360", "Xbox"], "num_players": "16  Online", "genres": ["Action", "Shooter", "First-Person", "Tactical", "Modern"], "meta_score": 80, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/9/5143b97cad7b453540fec4045db3a222-98.jpg", "descriptions": "The Xbox version of Tom Clancy's Ghost Recon 2 is a sequel to the PS2 version (which is set in 2007), and it features its own storyline, level design, and cinematic sequences. Once again, you must lead a team of Special Forces operatives (the \"ghosts\") on a variety of dangerousThe Xbox version of Tom Clancy's Ghost Recon 2 is a sequel to the PS2 version (which is set in 2007), and it features its own storyline, level design, and cinematic sequences. Once again, you must lead a team of Special Forces operatives (the \"ghosts\") on a variety of dangerous missions. Equip your team with advanced weapons and gadgets, and then fight alongside them in East Asia. The game also supports online multiplayer matches, in both competitive and cooperative modes.… Expand"}, {"name": "Soul Reaver 2", "details_link": "https://www.metacritic.com/game/playstation-2/soul-reaver-2", "publisher": "Eidos Interactive", "release_date": "Oct 31 2001", "developers": ["Crystal Dynamics"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 80, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/4/2d5cc53100be7b55ad50b5fd980f92ab-98.jpg", "descriptions": "Raziel returns to various eras of Nosgoth's dark past in his relentless pursuit of Kain. Encounter new enemies as you unearth the mysteries of Nosgoth's ancient races, and expose the schemes behind the corruption of the Pillars, and the vampire genocide. [Eidos Interactive]"}, {"name": "Rocket Riot", "details_link": "https://www.metacritic.com/game/xbox-360/rocket-riot", "publisher": "THQ", "release_date": "Jun 17 2009", "developers": ["Codeglue"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "num_players": "8  Online", "genres": ["Action", "General", "General"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/7/9c36ee888655f104f85329c624c0e8de-98.jpg", "descriptions": "[Xbox Live Arcade]  Strap on your bazooka soldier, and get ready for the awesome action-packed side-view shooter Rocket Riot. In this highly stylized eight-bit era style game, blast your way through the environment against enemies or multiplayer foes online. Navigate through a completely[Xbox Live Arcade]  Strap on your bazooka soldier, and get ready for the awesome action-packed side-view shooter Rocket Riot. In this highly stylized eight-bit era style game, blast your way through the environment against enemies or multiplayer foes online. Navigate through a completely destructible environment, uncover special power-ups, or even burrow into different areas of the map. The map regenerates, keeping the action fast-paced, but time doesn't heal all wounds. [THQ]… Expand"}, {"name": "The Chronicles of Riddick: Assault on Dark Athena", "details_link": "https://www.metacritic.com/game/playstation-3/the-chronicles-of-riddick-assault-on-dark-athena", "publisher": "Atari", "release_date": "Apr  7 2009", "developers": ["Starbreeze"], "platforms": ["PC", "Xbox 360", "PlayStation 3"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 80, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/0/c53518162ceac450945b2dd02f8a6aaa-98.jpg", "descriptions": "Taking advantage of new hardware technologies, this package presents a reinvention of \"Escape from Butcher Bay\", delivering 2004's award winning experience in high definition with enhancements.  Also included is the Dark Athena chapter, an expansion of the original game with a new story andTaking advantage of new hardware technologies, this package presents a reinvention of \"Escape from Butcher Bay\", delivering 2004's award winning experience in high definition with enhancements.  Also included is the Dark Athena chapter, an expansion of the original game with a new story and new gameplay features. With The Chronicles of Riddick: Assault on Dark Athena, players are not only be challenged to survive Butcher Bay, but also engage in a new single-player experience and, for the first time in the Riddick universe, take action in intense multi-player combat. The game introduces the ominous Merc-ship Dark Athena, which sits silent like a marauding spider, awaiting helpless prey in the dark reaches of the galaxy. Players must face a large, bloodthirsty operation led by the dreaded Captain Revas and her slaves-turned-controllable combat drones, storm though death-defying events and fight fierce enemies in a battle of malice and gore. [Sierra Entertainment]… Expand"}, {"name": "Detroit: Become Human", "details_link": "https://www.metacritic.com/game/pc/detroit-become-human", "publisher": "Quantic Dream", "release_date": "Dec 12 2019", "developers": ["Quantic Dream"], "platforms": ["PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Third-Person"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/4/ea2306884008b75ad05d012a6e5751fd-98.jpg", "descriptions": "Humankind, rediscovered. Travel to the near-future metropolis of Detroit a city rejuvenated by an exciting technological development: androids. Witness your brave new world turn to chaos as you take on the role of Kara, a female android trying to find her own place in a turbulent socialHumankind, rediscovered. Travel to the near-future metropolis of Detroit a city rejuvenated by an exciting technological development: androids. Witness your brave new world turn to chaos as you take on the role of Kara, a female android trying to find her own place in a turbulent social landscape.\r Shape an ambitious branching narrative, making choices that will not only determine your own fate, but that of the entire city. Discover what it means to be human from the perspective of an outsider see the world of man though the eyes of a machine.… Expand"}, {"name": "Leap of Fate", "details_link": "https://www.metacritic.com/game/pc/leap-of-fate", "publisher": "Clever-Plays", "release_date": "Mar 30 2016", "developers": ["Clever-Plays"], "platforms": ["iPhone/iPad", "PlayStation 4", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Role-Playing", "General", "Roguelike"], "meta_score": 80, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/7d85271e3de332ba6b9f7b733421ca29-98.jpg", "descriptions": "Leap of Fate is a cyberpunk roguelite about overcoming your fears and achieving your fate. In a New York City where magic is real, you play as a technomage who must develop unspeakable powers to confront the Crucible of Fates. Can you survive the trials?"}, {"name": "Metal Gear Solid V: Ground Zeroes", "details_link": "https://www.metacritic.com/game/pc/metal-gear-solid-v-ground-zeroes", "publisher": "Konami", "release_date": "Dec 18 2014", "developers": ["Kojima Productions"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Modern", "Open-World"], "meta_score": 80, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/6/85af01e2ac6897a0efc04af631ff1a3e-98.jpg", "descriptions": "Metal Gear Solid V: Ground Zeroes is the first segment of the Metal Gear Solid V Experience and prologue to the larger second segment, Metal Gear Solid V: The Phantom Pain launching thereafter."}, {"name": "Trials Fusion", "details_link": "https://www.metacritic.com/game/pc/trials-fusion", "publisher": "Ubisoft", "release_date": "Apr 16 2014", "developers": ["RedLynx"], "platforms": ["PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Driving", "Racing", "Arcade", "Motorcycle", "Automobile", "Street", "Street"], "meta_score": 80, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/8bf74e20c7042927a7a0c6f0fc5936b4-98.jpg", "descriptions": "Trials Fusion melds the classic, proven Trials formula of simple yet addictive competition with the social and visual breakthroughs of the next generation of gaming."}, {"name": "Syberia II", "details_link": "https://www.metacritic.com/game/pc/syberia-ii", "publisher": "The Adventure Company", "release_date": "Mar 30 2004", "developers": ["Microids"], "platforms": ["iPhone/iPad", "PlayStation 3", "Switch", "Xbox 360", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "Fantasy", "Third-Person", "Fantasy"], "meta_score": 80, "users_score": 8.3, "image": "https://static.metacritic.com/images/products/games/1/01864a2cfae0e63b05a5775299050a1d-98.jpg", "descriptions": "Embarking on a desperate search for Hans Voralberg, Kate Walker crosses Europe from West to East. She has left behind all her worldly possessions with the express purpose of joining the heir of the Voralberg family on his journey. Together, through mystical and enchanting lands, they willEmbarking on a desperate search for Hans Voralberg, Kate Walker crosses Europe from West to East. She has left behind all her worldly possessions with the express purpose of joining the heir of the Voralberg family on his journey. Together, through mystical and enchanting lands, they will find their way to the mythical Syberia, land of the forgotten mammoths. Thus Syberia II begins...The train leaves Aralbad under a quiet snowfall. Kate, Hans and Oscar, the loyal, humorous automaton, are heading to Romansbourg, the first of the four worlds to be explored in Syberia II. The motley crew will clear the last bastions of Russian civilization followed by the Frozen North before arriving at Youkol Village, from where they will try to reach their final destination: Syberia. Along the way, they will have to overcome many obstacles and deal with shady characters to uncover clues vital to the continuation of their quest. Kate's timeless journey through Valadilene, Barrockstadt, Komkolzgrad and Aralbad has sparked an evolution in her character, from an ambitious lawyer to a curious and tenacious adventuress. Kate's role has undergone a remarkable change. From being the pursuant, she becomes Han's main acolyte, his support in attaining the forgotten realm of the mammoths. How will she react to this new situation? Can she live up to the choices she made? [Microids]… Expand"}, {"name": "Shenmue II", "details_link": "https://www.metacritic.com/game/xbox/shenmue-ii", "publisher": "Microsoft Game Studios", "release_date": "Oct 28 2002", "developers": ["Sega AM2"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 80, "users_score": 8.9, "image": "https://static.metacritic.com/images/products/games/7/d8347f16f82adc638bde8b664422133e-98.jpg", "descriptions": "Seeking answers and vengeance, Ryo Hazuki arrives in the bustling metropolis of Hong Kong. Encountering new friends and foes alike, Ryo realizes he has much to learn and must master new martial art skills to prepare himself for his ultimate showdown with Lan Di, the man who killed hisSeeking answers and vengeance, Ryo Hazuki arrives in the bustling metropolis of Hong Kong. Encountering new friends and foes alike, Ryo realizes he has much to learn and must master new martial art skills to prepare himself for his ultimate showdown with Lan Di, the man who killed his father. Each day brings Ryo closer to his goal of avenging his father's death and unlocking the mysteries of the Phoenix Mirror.… Expand"}, {"name": "Tiger Woods PGA Tour 2002", "details_link": "https://www.metacritic.com/game/playstation-2/tiger-woods-pga-tour-2002", "publisher": "EA Sports", "release_date": "Feb 24 2002", "developers": ["EA Sports"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Golf", "Sim"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/8/8f3e9c30848b118cbf68e2862f86a6f0-98.jpg", "descriptions": "New TrueSwing Total Precision Swing lets you drive in true, slice it or add a draw, giving you more control over your shots. Compete as or against 12 PGA TOUR professionals including Tiger, Jesper Parnevik, Vijay Singh, Colin Montgomerie, and Notah Begay. Brand new course lineup includesNew TrueSwing Total Precision Swing lets you drive in true, slice it or add a draw, giving you more control over your shots. Compete as or against 12 PGA TOUR professionals including Tiger, Jesper Parnevik, Vijay Singh, Colin Montgomerie, and Notah Begay. Brand new course lineup includes such amazing layouts as Pebble Beach Golf Links, TPC at Sawgrass, Royal Birkdale in England, and more! [EA Sports]… Expand"}, {"name": "Ecks vs. Sever", "details_link": "https://www.metacritic.com/game/game-boy-advance/ecks-vs-sever", "publisher": "Bam Entertainment", "release_date": "Nov 27 2001", "developers": ["Crawfish Interactive"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 80, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/3/37395a45f62b457c393a09901d13d698-98.jpg", "descriptions": "An FBI agent and a rogue NSA agent are pitted against each other in a deadly game of cat and mouse. Both skilled assassins bent on personal revenge, each must terminate the other in order to survive. But unknown to each other, they are both pawns in a much larger conspiracy. Now the as theAn FBI agent and a rogue NSA agent are pitted against each other in a deadly game of cat and mouse. Both skilled assassins bent on personal revenge, each must terminate the other in order to survive. But unknown to each other, they are both pawns in a much larger conspiracy. Now the as the hunters become the hunted, they must both determine who the real enemy is.… Expand"}, {"name": "Tom Clancy's Ghost Recon", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-ghost-recon", "publisher": "Ubisoft", "release_date": "Nov 13 2001", "developers": ["Red Storm Entertainment"], "platforms": ["PlayStation 2", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 80, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/1/0daba67f458d7c18f7af12c7f79bfd2c-98.jpg", "descriptions": "Take command of the Ghosts through a series of missions that range from demolitions, to search and rescue, to all-out firefights for survival. Features squad-based tactical combat with next-generation military action in stunning 3D environments and a mission-driven storyline with 15Take command of the Ghosts through a series of missions that range from demolitions, to search and rescue, to all-out firefights for survival. Features squad-based tactical combat with next-generation military action in stunning 3D environments and a mission-driven storyline with 15 different singleplayer maps (as big as 400m x 400m), and 6 dedicated multiplayer maps. [Ubi Soft]… Expand"}]