[
  {
    "name": "Dimension Drive",
    "details_link": "https://www.metacritic.com/game/switch/dimension-drive",
    "publisher": "2Awesome Studio",
    "release_date": "Dec  7 2017",
    "developers": [
      "2Awesome Studio"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "Shooter",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 72,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/3/769fcfafa7d3f4318c6f41a7802b1ff3-98.jpg",
    "descriptions": "Dimension Drive is a comic book-styled space adventure set in a multidimensional universe. It features a unique teleportation mechanic that allows you to fight on two battlefields at once, and gameplay combining frantic shooting, defense and fast puzzling action."
  },
  {
    "name": "Layton's Mystery Journey: Katrielle and The Millionaires' Conspiracy",
    "details_link": "https://www.metacritic.com/game/3ds/laytons-mystery-journey-katrielle-and-the-millionaires-conspiracy",
    "publisher": "Level 5",
    "release_date": "Oct  6 2017",
    "developers": [
      "Level 5",
      "h.a.n.d. Inc."
    ],
    "platforms": [
      "iPhone/iPad",
      "3DS"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Puzzle",
      "General"
    ],
    "meta_score": 72,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/9/74cdac2725d146c2921c6a59c534e71c-98.jpg",
    "descriptions": "A new adventure in the Layton series –with a female protagonist: As the seventh main entry into the core Layton series, LAYTON’S MYSTERY JOURNEY follows Professor Hershel Layton's daughter, Katrielle \"Kat\" Layton.A new cast of leading and supporting characters:When Professor Hershel LaytonA new adventure in the Layton series –with a female protagonist: As the seventh main entry into the core Layton series, LAYTON’S MYSTERY JOURNEY follows Professor Hershel Layton's daughter, Katrielle \"Kat\" Layton.A new cast of leading and supporting characters:When Professor Hershel Layton (the protagonist of past Layton titles) goes missing, it's up to his daughter and friends to figure out what’s going on. Smart puzzle solving: As Kat, explore different environments and solve a collection of different puzzles that will get you closer to finding your father. Navigation and puzzle solving will be heavily reliant on the Nintendo 3DS touch screen. [Nintendo]… Expand"
  },
  {
    "name": "Albion Online",
    "details_link": "https://www.metacritic.com/game/pc/albion-online",
    "publisher": "Sandbox Interactive",
    "release_date": "Jul 17 2017",
    "developers": [
      "Sandbox Interactive"
    ],
    "platforms": "PC",
    "num_players": "Online Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Historic"
    ],
    "meta_score": 72,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/0/7ea150f297cd8d489a8458cec8f72757-98.jpg",
    "descriptions": "Set in a medieval, cross-platform word, Albion Online will allow players to conquer, colonize and defend territories all in a classless character customization system tailored for dynamic full loot PvP battles where every encounter is different."
  },
  {
    "name": "Mordheim: City of the Damned",
    "details_link": "https://www.metacritic.com/game/playstation-4/mordheim-city-of-the-damned",
    "publisher": "Focus Home Interactive",
    "release_date": "Oct 18 2016",
    "developers": [
      "Rogue Factor"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Tactics"
    ],
    "meta_score": 72,
    "users_score": 6.6,
    "image": "https://static.metacritic.com/images/products/games/0/965ea4690858bb6f6a8dee4d3b3afddc-98.jpg",
    "descriptions": "Set in the Warhammer world's decimated Empire city, Mordheim: City of the Damned is a turn-based tactical game where you lead warbands into bloody and lethal skirmishes. The game blends RPG elements, fast-paced tactical combat and intricate unit customization in a time wrought by chaos andSet in the Warhammer world's decimated Empire city, Mordheim: City of the Damned is a turn-based tactical game where you lead warbands into bloody and lethal skirmishes. The game blends RPG elements, fast-paced tactical combat and intricate unit customization in a time wrought by chaos and rivalry where only the strongest survive.… Expand"
  },
  {
    "name": "Total War: WARHAMMER - Call of the Beastmen",
    "details_link": "https://www.metacritic.com/game/pc/total-war-warhammer---call-of-the-beastmen",
    "publisher": "Sega",
    "release_date": "Jul 28 2016",
    "developers": [
      "Creative Assembly"
    ],
    "platforms": "PC",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General"
    ],
    "meta_score": 72,
    "users_score": 4.5,
    "image": "https://static.metacritic.com/images/products/games/0/30c46c85136aa16c730510efcf3e01e4-98.jpg",
    "descriptions": "The Call of The Beastmen Campaign Pack introduces the Beastmen as a playable race to Total War: WARHAMMER. A feral, Chaos-tainted horde race, they move like a plague across The Old World, fielding half-human aberrations and colossal beasts in battle, many of which feature unique abilities.The Call of The Beastmen Campaign Pack introduces the Beastmen as a playable race to Total War: WARHAMMER. A feral, Chaos-tainted horde race, they move like a plague across The Old World, fielding half-human aberrations and colossal beasts in battle, many of which feature unique abilities. The Beastmen are playable in the Grand Campaign, custom and multiplayer battles, and in their very own Story Campaign, An Eye For An Eye.… Expand"
  },
  {
    "name": "Demetrios - The BIG Cynical Adventure",
    "details_link": "https://www.metacritic.com/game/pc/demetrios---the-big-cynical-adventure",
    "publisher": "COWCAT",
    "release_date": "May 31 2016",
    "developers": [
      "COWCAT"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation Vita",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 72,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/bff5d7fe2da62646f17ff41176ac87c5-98.jpg",
    "descriptions": "Demetrios is a quirky point and click adventure game inspired by classics like Broken Sword. Bjorn Thonen, a slob of an antique dealer living in Paris, is robbed one night after coming home drunk. Forced to conduct his own investigation with the help of his neighbor Sandra, he ends upDemetrios is a quirky point and click adventure game inspired by classics like Broken Sword. Bjorn Thonen, a slob of an antique dealer living in Paris, is robbed one night after coming home drunk. Forced to conduct his own investigation with the help of his neighbor Sandra, he ends up involved in a murky, mysterious affair. Will these unlikely heroes be able to rise up and discover ancient secrets? The game offers situations and puzzles for beginners and experts alike. Explore ridiculous item combinations, just to see what happens.… Expand"
  },
  {
    "name": "Assassin's Creed Rogue",
    "details_link": "https://www.metacritic.com/game/xbox-360/assassins-creed-rogue",
    "publisher": "Ubisoft",
    "release_date": "Nov 11 2014",
    "developers": [
      "Ubisoft",
      "Ubisoft Sofia"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Historic",
      "Open-World"
    ],
    "meta_score": 72,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/6/608aa23295dd95ae65c71fdb17d6d9a9-98.jpg",
    "descriptions": "Within the tumult and rage of the French and Indian War, Shay Patrick Cormac, a bold young man and part of the Assassin Brotherhood, undergoes a dark transformation that forever alters the future of the colonies. As Shay, you feel the steady transformation from Assassin to Assassin hunterWithin the tumult and rage of the French and Indian War, Shay Patrick Cormac, a bold young man and part of the Assassin Brotherhood, undergoes a dark transformation that forever alters the future of the colonies. As Shay, you feel the steady transformation from Assassin to Assassin hunter and utilize your myriad skills to avenge those you once called brothers.… Expand"
  },
  {
    "name": "PixelJunk Monsters: Ultimate",
    "details_link": "https://www.metacritic.com/game/pc/pixeljunk-monsters-ultimate",
    "publisher": "Double Eleven",
    "release_date": "Aug 26 2013",
    "developers": [
      "Double Eleven"
    ],
    "platforms": [
      "PlayStation Vita",
      "PC"
    ],
    "genres": [
      "Strategy",
      "Real-Time",
      "Fantasy",
      "Fantasy",
      "Defense"
    ],
    "meta_score": 72,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/0/a3e5b1c52b3849b350ff50bc38de96b1-98.jpg",
    "descriptions": null
  },
  {
    "name": "DodoGo! Robo",
    "details_link": "https://www.metacritic.com/game/ds/dodogo!-robo",
    "publisher": "Neko Entertainment",
    "release_date": "Apr 18 2011",
    "developers": [
      "Alien After All"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/8/a4c0be49a946177db8285b5f148494b6-98.jpg",
    "descriptions": "DodoGo! Robo is a title released exclusively on the DSiWare."
  },
  {
    "name": "Command & Conquer: Red Alert 3 - Commander's Challenge",
    "details_link": "https://www.metacritic.com/game/xbox-360/command-conquer-red-alert-3---commanders-challenge",
    "publisher": "Electronic Arts",
    "release_date": "Sep 16 2009",
    "developers": [
      "EA LA"
    ],
    "platforms": "Xbox 360",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 72,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/4/2737d910e9d3d6e273ab1295f4951724-98.jpg",
    "descriptions": "[Xbox Live Arcade]  Fight for world domination in the all-new Red Alert 3 Commander’s Challenge! Do you have what it takes to withstand the brutal onslaught and relentless taunting of the world’s toughest commanders, including Ric Flair as Commander Hill? Find out as you attempt to conquer[Xbox Live Arcade]  Fight for world domination in the all-new Red Alert 3 Commander’s Challenge! Do you have what it takes to withstand the brutal onslaught and relentless taunting of the world’s toughest commanders, including Ric Flair as Commander Hill? Find out as you attempt to conquer the world in 50 challenges featuring explosive new units such as the Giga Fortress, Desolator, and Cryo Legionnaire!  [Electronic Arts]… Expand"
  },
  {
    "name": "Legend of Kay",
    "details_link": "https://www.metacritic.com/game/playstation-2/legend-of-kay",
    "publisher": "Capcom",
    "release_date": "Sep 21 2005",
    "developers": [
      "Neon Studios"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 72,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/8/4231bf163984de2a83e0da3e13a943af-98.jpg",
    "descriptions": "Legend of Kay is a classic action adventure – enhanced by an advanced close combat fighting system. Our hero ‘Kay’, a young cat Kay, embarks on a quest to save his village from invading troops of emperor Shun – king of the mighty gorillas. Kay may be young, but he is a brave and agileLegend of Kay is a classic action adventure – enhanced by an advanced close combat fighting system. Our hero ‘Kay’, a young cat Kay, embarks on a quest to save his village from invading troops of emperor Shun – king of the mighty gorillas. Kay may be young, but he is a brave and agile fighter. He leaves his hometown only with his sword and soon becomes a seasoned fighter, the only hope of all cats. Finally Kay will manage to unravel the secret that lies hidden in the volcano fortress of emperor Shun. The fights in Legend of Kay recreate the feeling of classic eastern martial-arts-movies. But even Kay’s most spectecular moves are executed by pressing few buttons at the right moment. Kay auto-aims at enemies to a certain extent, which makes it easy for the player to execute double- and triple blows, uppercuts, backflips, somersaults and powerful magic attacks. [JoWood]… Expand"
  },
  {
    "name": "IndyCar Series 2005",
    "details_link": "https://www.metacritic.com/game/xbox/indycar-series-2005",
    "publisher": "Codemasters",
    "release_date": "Jun 22 2004",
    "developers": [
      "Codemasters"
    ],
    "platforms": "Xbox",
    "num_players": "1-12 ",
    "genres": [
      "Driving",
      "Racing",
      "Formula One"
    ],
    "meta_score": 72,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/2/32a2182a64bb60aa170897f13bdeb117-98.jpg",
    "descriptions": "IndyCar Series 2005 lets you compete from Pole Day to Bump Day as one of 33 racers. You'll race an entire season that takes you from the Indianapolis 500 to other IndyCar Series tracks, including the Texas Motor Speedway, Chicagoland Speedway, Pikes Peak International Raceway, and the newIndyCar Series 2005 lets you compete from Pole Day to Bump Day as one of 33 racers. You'll race an entire season that takes you from the Indianapolis 500 to other IndyCar Series tracks, including the Texas Motor Speedway, Chicagoland Speedway, Pikes Peak International Raceway, and the new Twin Ring Motegi Speedway in Japan. Now you can practice your driving skills in an updated Masterclass training mode, and then compete online against 11 other players.… Expand"
  },
  {
    "name": "All-Star Baseball 2005",
    "details_link": "https://www.metacritic.com/game/playstation-2/all-star-baseball-2005",
    "publisher": "Acclaim",
    "release_date": "Apr  8 2004",
    "developers": [
      "Acclaim"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-4 ",
    "genres": [
      "Sports",
      "Traditional",
      "Baseball",
      "Sim"
    ],
    "meta_score": 72,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/0/90013f31d2691f9cd630b213535f5cb4-98.jpg",
    "descriptions": "All-Star Baseball 2005 gives you the most realistic \"between the lines\" game play experience ever with ASB05's exclusive FielderCam. The perennial best selling Baseball videogame franchise is more fun and accessible than ever before, packed with exclusive feature innovations, onlineAll-Star Baseball 2005 gives you the most realistic \"between the lines\" game play experience ever with ASB05's exclusive FielderCam. The perennial best selling Baseball videogame franchise is more fun and accessible than ever before, packed with exclusive feature innovations, online head-to-head play AND the deepest franchise mode of any baseball video game. [Acclaim]… Expand"
  },
  {
    "name": "X2: The Threat",
    "details_link": "https://www.metacritic.com/game/pc/x2-the-threat",
    "publisher": "Enlight Software",
    "release_date": "Dec  3 2003",
    "developers": [
      "Egosoft"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Space",
      "Small Spaceship",
      "Small Spaceship",
      "Combat"
    ],
    "meta_score": 72,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/2/c738da23187b596cff1aa4bc94d5771a-98.jpg",
    "descriptions": "X2: The Threat offers players a rich storyline and a boundless game play universe. In X2, the player takes on the role of a pilot indigenous to the X-Universe. The story unfolds as the soon-to-be hero and his companion attempt to steal a ship. After a failed, action-packed escape, he soonX2: The Threat offers players a rich storyline and a boundless game play universe. In X2, the player takes on the role of a pilot indigenous to the X-Universe. The story unfolds as the soon-to-be hero and his companion attempt to steal a ship. After a failed, action-packed escape, he soon finds himself aboard a security ship and destined to live out his days on the cold, prison-mining world of Artur. With a dynamic universe and a plot expertly weaved together the story of The Threat is sure to intrigue players of various genres.… Expand"
  },
  {
    "name": "Turok: Evolution",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/turok-evolution",
    "publisher": "Acclaim",
    "release_date": "Aug 26 2002",
    "developers": [
      "RFX Interactive"
    ],
    "platforms": [
      "PlayStation 2",
      "Game Boy Advance"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 72,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/6/f60071ebf227ea749f8e9a56cf484861-98.jpg",
    "descriptions": "Get locked and loaded in an exciting prequel to the Turok series.   Turok: Evolution is an epic adventure set against the backdrop of living jungles, mysterious temples, and deadly dinosaurs.  Battle over 32 types of dinosaurs as Tal'Set, a warrior caught in the midst of a brutal war in theGet locked and loaded in an exciting prequel to the Turok series.   Turok: Evolution is an epic adventure set against the backdrop of living jungles, mysterious temples, and deadly dinosaurs.  Battle over 32 types of dinosaurs as Tal'Set, a warrior caught in the midst of a brutal war in the Lost Land.  Use your arsenal of all-new weapons including Variable Payload Cruise Missiles, Gravity Disruptor beams, and the Swarm Bore.  Soar through the skies on a winged Quetzalcoatlus, or set out on foot on of the lush interactive environments.  Experience an adventure before time.… Expand"
  },
  {
    "name": "Frogger 2: Swampy's Revenge",
    "details_link": "https://www.metacritic.com/game/pc/frogger-2-swampys-revenge",
    "publisher": "Hasbro Interactive",
    "release_date": "Oct  1 2000",
    "developers": [
      "Hasbro Interactive",
      "Blitz Games"
    ],
    "platforms": "PC",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "General",
      "General",
      "Platformer",
      "3D"
    ],
    "meta_score": 72,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/9/176ac78439b5c21b78524c48184a5168-98.jpg",
    "descriptions": "Kicking back on his bachelor pad, Frogger is enjoying the good life. Swampy the Crocodile is jealous and wants a showdown. It's a totally new adventure where Frogger will need to leap over, dive under, hop through, and climb above endless obstacles and challenges to save the Frog Babies fromKicking back on his bachelor pad, Frogger is enjoying the good life. Swampy the Crocodile is jealous and wants a showdown. It's a totally new adventure where Frogger will need to leap over, dive under, hop through, and climb above endless obstacles and challenges to save the Frog Babies from the mischievous Swampy.  [Hasbro Interactive]… Expand"
  },
  {
    "name": "Tiger Woods PGA Tour 07",
    "details_link": "https://www.metacritic.com/game/wii/tiger-woods-pga-tour-07",
    "publisher": "EA Sports",
    "release_date": "Mar 13 2007",
    "developers": [
      "EA Redwood Shores"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "Xbox 360",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Sports",
      "Traditional",
      "Individual",
      "Golf",
      "Sim",
      "Sim"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/0/0d1b8d45d5256bd20725f22a3a25f96c-98.jpg",
    "descriptions": "Tiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournamentTiger Woods Comes Alive — See and feel every emotion in complete detail with the introduction of all-new Universal Capture (UCAP) technology. Play Under Pressure — With bigger galleries, mass crowd movement from hole to hole, and cheers from nearby greens, all eyes are on you in tournament play. Enhanced Career Mode — From working on your driving to mastering your putting skills, craft your game with training challenges in the Practice Facility, then take on the world's best golfers on the World Tour. All-New Championship Courses — The course content doubles with the addition of new licensed courses, including Firestone Country Club, Glen Abbey, Princeville, Spyglass Hill, St Andrews, and Bandon Dunes. The game features 15 of the world's top players, including Tiger Woods, John Daly, Vijay Singh, Ian Poulter, Michael Campbell, and Annika Sorenstam, the most decorated golfer on the LPGA Tour. Show Your GameFace — The innovative character creation tool is revamped with deeper modifications, more apparel, equipment licenses, and specialty items. Challenge up to three players in five new game modes, or play in online tournaments complete with money lists, full stat tracking, league leaders, and more. More Game Modes — Work on your game or take on a friend in Match Play, Battle Golf, 21, OneBall, and more. [EA Sports]… Expand"
  },
  {
    "name": "Nintendogs + Cats: French Bulldog & New Friends",
    "details_link": "https://www.metacritic.com/game/3ds/nintendogs-+-cats-french-bulldog-new-friends",
    "publisher": "Nintendo",
    "release_date": "Mar 27 2011",
    "developers": [
      "Nintendo"
    ],
    "platforms": "3DS",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual Life",
      "Virtual",
      "Pet"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/1/913c2072bdb2e00c181483379e56824f-98.jpg",
    "descriptions": "Interact with your virtual puppies and cats in 3D."
  },
  {
    "name": "Shiren the Wanderer",
    "details_link": "https://www.metacritic.com/game/wii/shiren-the-wanderer",
    "publisher": "Atlus",
    "release_date": "Feb  9 2010",
    "developers": [
      "ChunSoft"
    ],
    "platforms": "Wii",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "General",
      "General",
      "Roguelike"
    ],
    "meta_score": 71,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/4/105e4cf188c6198d2673eaec7d5faa5e-98.jpg",
    "descriptions": "As Shiren, a wandering adventurer with a penchant for exploration, monster-slaying, and item collection, you trek across a beautiful and varied countryside with your companion, Koppa, a talking ferret.  Randomly-generated areas, intense boss battles, extensive item customization, and a castAs Shiren, a wandering adventurer with a penchant for exploration, monster-slaying, and item collection, you trek across a beautiful and varied countryside with your companion, Koppa, a talking ferret.  Randomly-generated areas, intense boss battles, extensive item customization, and a cast of intriguing and unpredictable characters translate into a satisfying RPG experience. [Atlus USA]… Expand"
  },
  {
    "name": "Dead Rising Triple Pack",
    "details_link": "https://www.metacritic.com/game/playstation-4/dead-rising-triple-pack",
    "publisher": "Capcom",
    "release_date": "Sep 13 2016",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure"
    ],
    "meta_score": 71,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/8/70222a75447bd9528d645a8ce17f11bb-98.jpg",
    "descriptions": "In celebration of Dead Rising’s 10th Anniversary, Capcom has brought Dead Rising, Dead Rising 2, and Dead Rising 2: Off the Record to a new generation of zombie slayers."
  },
  {
    "name": "SpongeBob SquarePants: Battle for Bikini Bottom - Rehydrated",
    "details_link": "https://www.metacritic.com/game/xbox-one/spongebob-squarepants-battle-for-bikini-bottom---rehydrated",
    "publisher": "THQ Nordic",
    "release_date": "Jun 23 2020",
    "developers": [
      "Purple Lamp Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Stadia",
      "Switch",
      "Xbox One"
    ],
    "num_players": "2 ",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 8.6,
    "image": "https://static.metacritic.com/images/products/games/9/e44d5214de77da299ae6f74eda63f1c1-98.jpg",
    "descriptions": "Are you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course youAre you ready, kids? The cult classic is back, faithfully remade in spongetastic splendor! Play as SpongeBob, Patrick and Sandy and show the evil Plankton that crime pays even less than Mr. Krabs. Want to save Bikini Bottom from lots of rampant robots with your mighty bubbles? Of course you do! Want to underpants bungee jump? Why wouldn't you! Want to join forces in a brand new multiplayer mode? The battle is on!\r GAME FEATURES\r- Play as SpongeBob, Patrick and Sandy and use their unique sets of skills\r- Thwart Plankton's evil plan to rule Bikini Bottom with his army of wacky robots\r- Meet countless characters from the beloved series\r REMAKE FEATURES\r- Faithful remake of one of the best SpongeBob games ever created\r- High-end visuals, modern resolutions and carefully polished gameplay\r- Brand new horde mode multiplayer for up to two players, online and offline\r- Restored content that was cut from the original game like the Robo Squidward boss fight and more… Expand"
  },
  {
    "name": "Capcom Beat 'Em Up Bundle",
    "details_link": "https://www.metacritic.com/game/playstation-4/capcom-beat-em-up-bundle",
    "publisher": "Capcom",
    "release_date": "Sep 18 2018",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 71,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/4/c5f9dca11603d840e3941cd4d807ea79-98.jpg",
    "descriptions": "Relive the glory days of cooperative arcade games with the Capcom Beat ‘Em Up Bundle. This comprehensive collection includes seven classic games, each with various multiplayer options, online capabilities and detailed galleries."
  },
  {
    "name": "Battlefield Hardline",
    "details_link": "https://www.metacritic.com/game/xbox-one/battlefield-hardline",
    "publisher": "Electronic Arts",
    "release_date": "Mar 17 2015",
    "developers": [
      "Visceral Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "Up to more than 64 ",
    "genres": [
      "Modern",
      "Action",
      "Shooter",
      "First-Person",
      "Tactical",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 5.3,
    "image": "https://static.metacritic.com/images/products/games/7/368bc59406bcb79ac405b97c434ee570-98.jpg",
    "descriptions": "Run your crew as detective Nick Mendoza in an episodic crime drama single player campaign or as cops and criminals in rapid Battlefield multi-player. You will be on one side of the thin blue line or the other. Assume control using new tactics to gather intelligence, obtain warrants andRun your crew as detective Nick Mendoza in an episodic crime drama single player campaign or as cops and criminals in rapid Battlefield multi-player. You will be on one side of the thin blue line or the other. Assume control using new tactics to gather intelligence, obtain warrants and takedown with non-lethal force to effectuate the arrests. Take the cash in a new battlefield playground. New maps and gadgets alter the way you play the game. Utilize grappling hooks and zip-lines to scale city buildings and fly across the city with the cheddar. No matter the strategy, teamwork is key to winning the turf war. Sate your need for speed in  new action-packed modes. Hop in exotic muscle cars, sleek crotch rockets or even give your whole crew a lift in transports or armored trucks.… Expand"
  },
  {
    "name": "Red Faction: Armageddon",
    "details_link": "https://www.metacritic.com/game/xbox-360/red-faction-armageddon",
    "publisher": "THQ",
    "release_date": "Jun  7 2011",
    "developers": [
      "Volition Inc."
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Third-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/0/81539e80b1c61d25ef4dc5407b8bff68-98.jpg",
    "descriptions": "Volition and THQ's martian insurgency will continue in a fourth chapter in the franchise with expanded online play and enhanced destruction."
  },
  {
    "name": "Star Wars: Tales from the Galaxy's Edge - Enhanced Edition",
    "details_link": "https://www.metacritic.com/game/playstation-5/star-wars-tales-from-the-galaxys-edge---enhanced-edition",
    "publisher": "Disney Interactive Studios",
    "release_date": "Feb 22 2023",
    "developers": [
      "ILMxLab"
    ],
    "platforms": "PlayStation 5",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 5.0,
    "image": "https://static.metacritic.com/images/products/games/1/bd417a7ae9d4350d135ba95d7a95e0e4-98.jpg",
    "descriptions": "As a Droid Repair Technician who crash lands on Batuu, get swept into a grand adventure, proving anyone can be a hero. Take on missions in the Batuu wilds, face off against the Guavian Death Gang, infiltrate a First Order facility and travel to other eras in the galaxy in your ownAs a Droid Repair Technician who crash lands on Batuu, get swept into a grand adventure, proving anyone can be a hero. Take on missions in the Batuu wilds, face off against the Guavian Death Gang, infiltrate a First Order facility and travel to other eras in the galaxy in your own unforgettable Star Wars story. \r\rThe adventure continues in the cantina by unlocking three of Seezelslak's legendary Tales. By completing his special missions, you'll be fully transported to other eras and even planets in the galaxy: become a Jedi in the \"Temple of Darkness\"; train with your padawan in \"The Sacred Garden\"; or even take on a bounty as assassin droid IG-88 in \"The Bounty of Boggs Triff\".\r Star Wars: Tales from the Galaxy's Edge - Enhanced Edition lets you become the hero of your own thrilling adventure, allowing you to play your way with different difficulty levels, combat weapons and within immersive tales that show how the actions of one person can change the galaxy.… Expand"
  },
  {
    "name": "Pumpkin Jack",
    "details_link": "https://www.metacritic.com/game/pc/pumpkin-jack",
    "publisher": "Headup Games",
    "release_date": "Oct 23 2020",
    "developers": [
      "Nicolas Meyssonnier"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/5/c2ad3f0c4d4d5181357a47748a70ef31-98.jpg",
    "descriptions": "Pumpkin Jack is a Spooky Scary 3D platformer in which you embody Jack, the Mythical Pumpkin Lord! Dive into an Epic Adventure through otherworldly landscapes and help the Evil annihilate the Good!"
  },
  {
    "name": "Just Dance 2018",
    "details_link": "https://www.metacritic.com/game/switch/just-dance-2018",
    "publisher": "Ubisoft",
    "release_date": "Oct 24 2017",
    "developers": [
      "Ubisoft Paris"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation 4",
      "Wii U",
      "Xbox 360",
      "Xbox One",
      "Switch"
    ],
    "num_players": "Up to 8 ",
    "genres": [
      "Action",
      "Rhythm",
      "Dancing"
    ],
    "meta_score": 71,
    "users_score": 5.8,
    "image": "https://static.metacritic.com/images/products/games/8/29ef0241600b34373bebeecfdd6b5582-98.jpg",
    "descriptions": "No matter where you come from, how old you are, if you are a panda or a carrot: turn up the volume and get ready to unleash your inner dancer, because Just Dance 2018 brings out the dancer in everyone. Whether you are a party starter, a young dancer in the making or a pro dancer looking forNo matter where you come from, how old you are, if you are a panda or a carrot: turn up the volume and get ready to unleash your inner dancer, because Just Dance 2018 brings out the dancer in everyone. Whether you are a party starter, a young dancer in the making or a pro dancer looking for new challenges, it's never been so easy to Just Dance. Dance your heart out to 24K Magic by Bruno Mars, Side to Side by Ariana Grande ft. Nicki Minaj, The Way I Are (Dance With Somebody) by Bebe Rexha ft. Lil Wayne and Chantaje by Shakira ft. Maluma. Relive classics including Daddy Cool by Groove Century, or if K-Pop is your thing get down to Bubble Pop by Hyuna.… Expand"
  },
  {
    "name": "The Crew",
    "details_link": "https://www.metacritic.com/game/pc/the-crew",
    "publisher": "Ubisoft",
    "release_date": "Dec  1 2014",
    "developers": [
      "Ubisoft Reflections",
      "Ivory Tower"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox 360",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "GT / Street",
      "Driving",
      "Racing",
      "Simulation",
      "GT / Street",
      "Automobile"
    ],
    "meta_score": 71,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/5/cd77383df4f60983a7e23b1ee0f30912-98.jpg",
    "descriptions": "Engage in a relentless ride to infiltrate and subvert the 510s, a gang that has come to power around Detroit's illegal street racing scene. Your mission? Build up your reputation in the secret racing scene and sabotage their activities city-by-city all across an open world United States.Engage in a relentless ride to infiltrate and subvert the 510s, a gang that has come to power around Detroit's illegal street racing scene. Your mission? Build up your reputation in the secret racing scene and sabotage their activities city-by-city all across an open world United States. Maneuver through the crackling streets of New York City and Los Angeles, drive through sunny Miami Beach, or trek through the grand plateaus of Monument Valley. Each location comes with its own set of surprises and driving challenges to master. On your journey you will encounter other people on the road - all potentially worthy companions to crew up with, or future rivals to compete against.… Expand"
  },
  {
    "name": "Puzzle Quest: Challenge of the Warlords",
    "details_link": "https://www.metacritic.com/game/wii/puzzle-quest-challenge-of-the-warlords",
    "publisher": "D3Publisher",
    "release_date": "Nov 30 2007",
    "developers": [
      "Vicious Cycle"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 2",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Wii"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "Puzzle",
      "Matching",
      "Matching"
    ],
    "meta_score": 71,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/0/99ee8563f0f89e825272be0616286a07-98.jpg",
    "descriptions": "Designed specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a puzzle boardDesigned specifically to entertain both casual and hardcore gamers with its deep immersion, five to fifteen minute play sessions and turn-based play style, Puzzle Quest: Challenge of the Warlords incorporates strategy, role-playing elements and a persistent storyline in a puzzle board setting. Set in the Warlords universe, the game challenges players to create, develop and customize the ultimate hero in order to save the land of Etheria from evil Lord Bane. To advance their character, players battle in turn-based, head-to-head \"match-three\" style puzzle games in one of three distinct gameplay modes: Single-player allows gamers to battle against the AI as they embark on over 150 challenging quests, Instant Action allows gamers to jump in and immediately play continuous battles to level-up characters without participating in quests, and Multiplayer allows gamers to battle live opponents. Victory will advance the player’s hero, magical arsenal, creature companions and more - ultimately rewarding gamers at nearly every turn and providing endless hours of replayability. [D3Publisher of America]… Expand"
  },
  {
    "name": "Rayman Origins",
    "details_link": "https://www.metacritic.com/game/3ds/rayman-origins",
    "publisher": "Ubisoft",
    "release_date": "Nov  6 2012",
    "developers": [
      "UBlart Montpellier"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox 360",
      "3DS"
    ],
    "genres": [
      "Action",
      "Action Adventure",
      "Platformer",
      "Fantasy",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/0/d643b022db4337de925f109520337afb-98.jpg",
    "descriptions": "When the Glade of Dreams is overrun by \"nefurrious\" Darktoons, the Fairy Council hastily invokes Rayman to save the day; but the hero of light isn’t quite all there…To help him, Rayman teams up with his best friend, Globox, and two crafty wizards, the Teensies. Together, the world’s mostWhen the Glade of Dreams is overrun by \"nefurrious\" Darktoons, the Fairy Council hastily invokes Rayman to save the day; but the hero of light isn’t quite all there…To help him, Rayman teams up with his best friend, Globox, and two crafty wizards, the Teensies. Together, the world’s most hilarious team of heroes will need to restore peace to the Glade or watch as their beloved home vanishes like a bad dream...… Expand"
  },
  {
    "name": "Ar tonelico II: Melody of Metafalica",
    "details_link": "https://www.metacritic.com/game/playstation-2/ar-tonelico-ii-melody-of-metafalica",
    "publisher": "NIS America",
    "release_date": "Jan 20 2009",
    "developers": [
      "Gust"
    ],
    "platforms": "PlayStation 2",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 71,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/3/01bc9d7971c8d4679c182b54b1595d4a-98.jpg",
    "descriptions": "The region of Metafalss surrounds Infel Pira, the second Tower, which is said to represent teh Goddess Frelia of the Trio. A mysterious epidemic called Infel Pira Dependency (IPD) has been killing Reyvateils. Croix, a young knight from the Church of Pastalia, is sent to contain the epidemic.The region of Metafalss surrounds Infel Pira, the second Tower, which is said to represent teh Goddess Frelia of the Trio. A mysterious epidemic called Infel Pira Dependency (IPD) has been killing Reyvateils. Croix, a young knight from the Church of Pastalia, is sent to contain the epidemic. However, many more challenges await, which lead him to unraveling the mysteries of the planet Ar Ciel and seek the legend handed down by the people of Metafalss: the lost Song of Metafalica. [NIS America]… Expand"
  },
  {
    "name": "Brigandine: The Legend of Runersia",
    "details_link": "https://www.metacritic.com/game/playstation-4/brigandine-the-legend-of-runersia",
    "publisher": "Limited Run Games",
    "release_date": "Dec 10 2020",
    "developers": [
      "Matrix Software"
    ],
    "platforms": [
      "PC",
      "Switch",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "Tactics"
    ],
    "meta_score": 71,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/4/a9e74a72d2acb75a0f0aad4ec05dec0f-98.jpg",
    "descriptions": "Runersia 781.\rA new era of war is being ushered in\rby five nations and a small tribe, each with\r\nconflicting ideals, beliefs, histories, and faiths.\r\n\r\nO visitor to this world,\r\nwho will you become, and what will you fight for?\r\nWhen you finally unify the continent,\r\nmemories from theRunersia 781.\rA new era of war is being ushered in\rby five nations and a small tribe, each with\rconflicting ideals, beliefs, histories, and faiths.\r O visitor to this world,\rwho will you become, and what will you fight for?\rWhen you finally unify the continent,\rmemories from the Record of Runersia will revive,\rand you will come to know...\rEvery story that’s played out here on this continent of Runersia. … Expand"
  },
  {
    "name": "Hyperdimension Neptunia U: Action Unleashed",
    "details_link": "https://www.metacritic.com/game/playstation-vita/hyperdimension-neptunia-u-action-unleashed",
    "publisher": "Idea Factory",
    "release_date": "May 19 2015",
    "developers": [
      "Tamsoft"
    ],
    "platforms": [
      "PC",
      "PlayStation Vita"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General",
      "Beat-'Em-Up",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/1/df4c2a431f4fbe33171b0b1bb7a69abe-98.jpg",
    "descriptions": "Featuring new playable characters, as well as customizable equipment and over-the-top skills that haven't been seen in previous Neptunia games, this game has something to offer old series fans and new fans alike."
  },
  {
    "name": "Screencheat",
    "details_link": "https://www.metacritic.com/game/pc/screencheat",
    "publisher": "Surprise Attack",
    "release_date": "Oct 21 2014",
    "developers": [
      "Samurai Punk"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "genres": [
      "Sci-Fi",
      "Action",
      "Shooter",
      "First-Person",
      "Tactical",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/0/0e148fc8b9646bdc3d10c70d3025f016-98.jpg",
    "descriptions": "It is an online and offline split-screen multiplayer first-person shooter in which all are invisible and you must cheat to come out victoriously."
  },
  {
    "name": "Killer Is Dead: Nightmare Edition",
    "details_link": "https://www.metacritic.com/game/pc/killer-is-dead-nightmare-edition",
    "publisher": "Deep Silver",
    "release_date": "May 23 2014",
    "developers": [
      "Grasshopper Manufacture"
    ],
    "platforms": [
      "PlayStation 3",
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/5/2c552568e79ac8d6c6be5efbf4f4e91c-98.jpg",
    "descriptions": "Killer Is Dead is the latest title from the demented mind of celebrated game creator, SUDA51, serving as a spiritual successor to his previous cult favorites, No More Heroes and Killer 7. Stylish cel-shaded visuals set the mood in this gritty, bloody, ultra-violent world where biomechanicalKiller Is Dead is the latest title from the demented mind of celebrated game creator, SUDA51, serving as a spiritual successor to his previous cult favorites, No More Heroes and Killer 7. Stylish cel-shaded visuals set the mood in this gritty, bloody, ultra-violent world where biomechanical augmentations increase the power of criminals and \"executioners\" alike. Mondo Zappa, a newly recruited executioner, hunts criminals wielding a Japanese sword in his right hand, and the crushing power of biomechanical engineering in his left.… Expand"
  },
  {
    "name": "MX vs. ATV Unleashed",
    "details_link": "https://www.metacritic.com/game/pc/mx-vs-atv-unleashed",
    "publisher": "THQ",
    "release_date": "Jan 16 2006",
    "developers": [
      "Rainbow Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "PC"
    ],
    "num_players": "6  Online",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Rally / Offroad",
      "Rally / Offroad",
      "Automobile"
    ],
    "meta_score": 71,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/7/9e98f1c6e41bf5120e16c24681d496b7-98.jpg",
    "descriptions": "In MX vs. ATV Unleashed, players power through all-new environments and event types, choosing from a variety of new vehicles. A redesigned monster truck, powerful sand-rail and raised 4x4 golf karts meet ATVs, dirt bikes and bi-planes to compete in massive free-world environments featuringIn MX vs. ATV Unleashed, players power through all-new environments and event types, choosing from a variety of new vehicles. A redesigned monster truck, powerful sand-rail and raised 4x4 golf karts meet ATVs, dirt bikes and bi-planes to compete in massive free-world environments featuring hill climbs, machine challenges and short track races. The game's career mode allows gamers to choose from the top professional ATV and Motocross riders. [THQ]… Expand"
  },
  {
    "name": "SD Gundam Battle Alliance",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/sd-gundam-battle-alliance",
    "publisher": "Bandai Namco Games",
    "release_date": "Aug 25 2022",
    "developers": [
      "Bandai Namco Games",
      "Artdink"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 3 ",
    "genres": [
      "Role-Playing",
      "Simulation",
      "Action RPG",
      "Vehicle",
      "Combat"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/54522715cab000328e2961d0d02bafdc-98.jpg",
    "descriptions": "In SD Gundam Battle Alliance, Mobile Suits and characters from across Mobile Suit Gundam history take center stage in this all-new action RPG. A Battle Alliance to Correct a False World\nThe story takes place in G: Universe, a world where Gundam canon twists and turns in ways no one canIn SD Gundam Battle Alliance, Mobile Suits and characters from across Mobile Suit Gundam history take center stage in this all-new action RPG. A Battle Alliance to Correct a False WorldThe story takes place in G: Universe, a world where Gundam canon twists and turns in ways no one can predict. To correct this world's distorted history, the player leads a 3-unit squadron consisting of Mobile Suits and pilots from across Gundam history - a true Battle Alliance.What Awaits Beyond False History... Combo action with stunning visuals and dynamic animationIndulge in a wide array of Mobile Suit weaponry to crush many foes with! Control Mobile Suits portrayed with realistic weathering that showcases them as weapons of war as they tear across the battlefield with dynamic animations. Strange phenomena known as Breaks are twisting legendary moments from Gundam history, and you're in charge to fix them.Experience Gundam history's most famous scenes as you develop new Mobile Suits to add to your arsenal. Gather Capital and expansion parts to transform your favorite machine into the ultimate MS. Tackle missions with friends in multiplayer!Launch into battle with 2 partners to back you up. In multiplayer, you can play through the game with up to 2 other players in a 3-person team. Enjoy this new SD Gundam action RPG solo, or with friends.… Expand"
  },
  {
    "name": "Toy Odyssey: The Lost and Found",
    "details_link": "https://www.metacritic.com/game/xbox-one/toy-odyssey-the-lost-and-found",
    "publisher": "Digital Smash",
    "release_date": "Sep 21 2016",
    "developers": [
      "Hikergames"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/6/a31a463120be2b7f6a44d21763f7813d-98.jpg",
    "descriptions": "​Toy Odyssey is fundamentally an action-adventure platformer. The player spends the night exploring a randomly-generated house, defeating bosses in each of the unique rooms, and then going up against the final boss."
  },
  {
    "name": "Back to the Future: The Game - Episode III: Citizen Brown",
    "details_link": "https://www.metacritic.com/game/pc/back-to-the-future-the-game---episode-iii-citizen-brown",
    "publisher": "Telltale Games",
    "release_date": "Mar 28 2011",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 3",
      "PC"
    ],
    "genres": [
      "Action Adventure",
      "Adventure",
      "Sci-Fi",
      "Sci-Fi",
      "3D",
      "Third-Person"
    ],
    "meta_score": 71,
    "users_score": 5.9,
    "image": "https://static.metacritic.com/images/products/games/0/666ee3cc9e7cf8813dca1beda2e8daf9-98.jpg",
    "descriptions": "In \"Citizen Brown\", the 3rd episode of this 5 game series, a time-stranded Marty has a rough and tumble return to the 1980s and finds himself in a topsy-turvy version of the world lorded over by the enigmatic \"First Citizen Brown.\""
  },
  {
    "name": "Assassin's Creed IV: Black Flag - Freedom Cry",
    "details_link": "https://www.metacritic.com/game/playstation-4/assassins-creed-iv-black-flag---freedom-cry",
    "publisher": "Ubisoft",
    "release_date": "Dec 18 2013",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "Xbox 360",
      "Xbox One",
      "PlayStation 4"
    ],
    "genres": [
      "Action Adventure",
      "Historic",
      "Open-World"
    ],
    "meta_score": 71,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/3/b059539e62d24cbf44c5b55ae213a47d-98.jpg",
    "descriptions": "Born a slave, Adewale found freedom aboard the Jackdaw where he became Edward Kenwayâ's second-in-command. 15 years later, Adewale has become an Assassin who finds himself shipwrecked in Saint-Domingue without weapons or crew. He meets locals in an effort to assemble a crew & steal a ship.Born a slave, Adewale found freedom aboard the Jackdaw where he became Edward Kenwayâ's second-in-command. 15 years later, Adewale has become an Assassin who finds himself shipwrecked in Saint-Domingue without weapons or crew. He meets locals in an effort to assemble a crew & steal a ship. The more he helps, the more he is drawn into the Maroon slave community. Forced to face his past, he sets out to free the slaves & bring death to their captors. Over 3 hours of new single-player game play!… Expand"
  },
  {
    "name": "Big Sky: Infinity",
    "details_link": "https://www.metacritic.com/game/playstation-vita/big-sky-infinity",
    "publisher": "Ripstone",
    "release_date": "Dec 11 2012",
    "developers": [
      "VooFoo Studios",
      "Boss Baddie"
    ],
    "platforms": [
      "PlayStation 3",
      "PlayStation Vita"
    ],
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Scrolling",
      "Scrolling",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 71,
    "users_score": 5.2,
    "image": "https://static.metacritic.com/images/products/games/1/ad454d3f3666e21bf3e21c46bdb9358d-98.jpg",
    "descriptions": "Big Sky: Infinity is a procedurally generated, super fast, twin-stick shooter game that will introduce new modes and enemies, and touch controls to its predecessors."
  },
  {
    "name": "Forgive me Father",
    "details_link": "https://www.metacritic.com/game/pc/forgive-me-father",
    "publisher": "1C Entertainment",
    "release_date": "Apr  7 2022",
    "developers": [
      "Byte Barrel"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/2/2b789492c9514bdd4c921300271ba8c0-98.jpg",
    "descriptions": "As the only one left with full senses, you embark on a journey in search of answers and relief in this FPS game that is created in a distinctive retro horror comic book style and feels as if it came straight out of Lovecraft's books.Be aware of your madness level which dynamically changesAs the only one left with full senses, you embark on a journey in search of answers and relief in this FPS game that is created in a distinctive retro horror comic book style and feels as if it came straight out of Lovecraft's books.Be aware of your madness level which dynamically changes during gameplay and gives you additional power. Choose your active skills depending on your play style and use them to fight against the eternal evil.Explore this Lovecraft-inspired world that is full of hidden and hard to reach areas, and uncover the entire story to solve the mystery of this crazy place.… Expand"
  },
  {
    "name": "Somerville",
    "details_link": "https://www.metacritic.com/game/pc/somerville",
    "publisher": "Xbox Game Studios",
    "release_date": "Nov 15 2022",
    "developers": [
      "Jumpship"
    ],
    "platforms": [
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Third-Person",
      "3D",
      "Action Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 4.8,
    "image": "https://static.metacritic.com/images/products/games/7/d9d88dabad391548d5d4341087647782-98.jpg",
    "descriptions": "Jumpship’s debut title immersse players in a hand-crafted narrative set across a vivid and rural landscape. Set in the wake of a catastrophe and grounded in the intimate repercussions of large-scale conflict, players navigate through perilous terrain as they unravel the mysteries of Earth’sJumpship’s debut title immersse players in a hand-crafted narrative set across a vivid and rural landscape. Set in the wake of a catastrophe and grounded in the intimate repercussions of large-scale conflict, players navigate through perilous terrain as they unravel the mysteries of Earth’s visitors.… Expand"
  },
  {
    "name": "OddBallers",
    "details_link": "https://www.metacritic.com/game/switch/oddballers",
    "publisher": "Ubisoft",
    "release_date": "Jan 26 2023",
    "developers": [
      "Game Swing"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One",
      "Xbox Series X",
      "Switch"
    ],
    "num_players": "Up to 6 ",
    "genres": [
      "Miscellaneous",
      "Party / Minigame"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/0/2037db144512995f4365ba0041fb5e97-98.jpg",
    "descriptions": "OddBallers is a new dodgeball multiplayer party game where just about anything you can find can be thrown at your opponents."
  },
  {
    "name": "Circus Electrique",
    "details_link": "https://www.metacritic.com/game/playstation-5/circus-electrique",
    "publisher": "Saber Interactive",
    "release_date": "Sep  6 2022",
    "developers": [
      "Zen Studios"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PlayStation 5"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Strategy",
      "Turn-Based",
      "General",
      "Tactics"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/0/1cc9ca118fc435ca22008c01226013fc-98.jpg",
    "descriptions": "When everyday Londoners mysteriously turn into vicious killers, only the circus' lineup of Strongmen, Fire Blowers, Clowns and other performers possess the unique talents necessary to save the city. Circus Electrique is part story-driven RPG, part tactics, part circus management, andWhen everyday Londoners mysteriously turn into vicious killers, only the circus' lineup of Strongmen, Fire Blowers, Clowns and other performers possess the unique talents necessary to save the city. Circus Electrique is part story-driven RPG, part tactics, part circus management, and completely enthralling - all with a steampunk twist. Through tactical turn-based battles, these unlikely heroes face Bobbies, British Sailors gone bad, aggressive Posh Girls, and other Victorian-era archetypes stand in their way - not to mention the occasional menacing Mime or Robobear. The game's innovative Devotion morale system affects characters' performance not only in battles, but also for actual circus shows, dutifully managed between heroic jaunts through six sprawling districts.… Expand"
  },
  {
    "name": "Mighty Goose",
    "details_link": "https://www.metacritic.com/game/pc/mighty-goose",
    "publisher": "Playism",
    "release_date": "Jun  5 2021",
    "developers": [
      "Blastmode"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation 5",
      "Switch",
      "Xbox One",
      "Xbox Series X",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 7.3,
    "image": "https://static.metacritic.com/images/products/games/9/ec174c1de21acaf858961c10443683e7-98.jpg",
    "descriptions": "Traveling the galaxy, hunting down evil. This is the life of Mighty Goose. One of the galaxy's most credited bounty hunters!At the core Mighty Goose is a tight side scrolling run & gun shooter that will test your skill, timing, reflexes. Building upon that solid arcade base, the game addsTraveling the galaxy, hunting down evil. This is the life of Mighty Goose. One of the galaxy's most credited bounty hunters!At the core Mighty Goose is a tight side scrolling run & gun shooter that will test your skill, timing, reflexes. Building upon that solid arcade base, the game adds a ton of crazy weapons, warmachines, upgrades and secrets.Assume the role of Mighty Goose and bring the fight to the Void King. This galaxy conquering monarch commands a vast army of minions and mechanised monsters. Dealing with these baddies means traveling to distant worlds and facing all kinds of dangers. But not to worry, this is no problem for the legendary Mighty Goose!… Expand"
  },
  {
    "name": "Senran Kagura: Estival Versus",
    "details_link": "https://www.metacritic.com/game/pc/senran-kagura-estival-versus",
    "publisher": "XSEED Games",
    "release_date": "Mar 17 2017",
    "developers": [
      "Tamsoft"
    ],
    "platforms": [
      "PlayStation 4",
      "PlayStation Vita",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "General"
    ],
    "meta_score": 71,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/f0ec2c27b228ac7118fbe1104f82fb60-98.jpg",
    "descriptions": "The flame that burns twice as bright burns half as long, and so it is with the lives of young shinobi. Death comes swiftly  for the lucky ones  and, for those still living, grief is a constant companion. Ry&#333;bi and Ry&#333;na, two shinobi sisters of the Hebijo Clandestine GirlsThe flame that burns twice as bright burns half as long, and so it is with the lives of young shinobi. Death comes swiftly  for the lucky ones  and, for those still living, grief is a constant companion. Ry&#333;bi and Ry&#333;na, two shinobi sisters of the Hebijo Clandestine Girls Academy elite, know that truth all too well, and they mourn their beloved elder sister every day.\r But, when a mystical phenomenon appears, drawing the shinobi worlds finest young ladies into a parallel dimension, everything they know about life and death turns upside down. Taken to a strange world resembling a warm summer island, the girls find themselves face to face with their departed loved ones.\r The islands mysterious mistresses challenge the girls, who hail from four rival schools, to a contest of strength and wits. The winning school, she promises, will not only learn the highest secrets of shinobi lore, but will also have the honour of laying their loved ones souls to rest.\r The buxom beauties prepare for a new kind of battle, facing not only their rivals, but questions galore. Can the island's hosts be trusted? Will the other schools play fair, team up, or cheat? Will there be time to enjoy the beach before the fighting starts? Will anyone manage to keep their clothes intact? And if they win, can they bear to be parted from their loved ones a second time?… Expand"
  },
  {
    "name": "Grow Up",
    "details_link": "https://www.metacritic.com/game/pc/grow-up",
    "publisher": "Ubisoft",
    "release_date": "Aug 16 2016",
    "developers": [
      "Ubisoft Reflections"
    ],
    "platforms": [
      "PlayStation 4",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 71,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/9/0616a9117ce4ebf76e68e5674f248585-98.jpg",
    "descriptions": "BUD, an adorable yet clumsy, stumbling, tumbling robot. Spaceship wreckage scattered across an entire planet of abundant alien flora and thrusting star plants. A distant moon with your spacecraft’s beating heart yearning to be rescued. A fantastical acrobatic adventure in a world that’s asBUD, an adorable yet clumsy, stumbling, tumbling robot. Spaceship wreckage scattered across an entire planet of abundant alien flora and thrusting star plants. A distant moon with your spacecraft’s beating heart yearning to be rescued. A fantastical acrobatic adventure in a world that’s as challenging as it is beautiful. Welcome to Grow Up.… Expand"
  },
  {
    "name": "The Walking Dead: Season Two Episode 4 - Amid the Ruins",
    "details_link": "https://www.metacritic.com/game/xbox-360/the-walking-dead-season-two-episode-4---amid-the-ruins",
    "publisher": "Telltale Games",
    "release_date": "Jul 23 2014",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation Vita",
      "Xbox 360"
    ],
    "genres": [
      "General",
      "Action",
      "Adventure",
      "General",
      "Point-and-Click"
    ],
    "meta_score": 71,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/5/99a20100f80736f4435f5329027d10cf-98.jpg",
    "descriptions": "Free from their brutal captor, the group continues their journey north. However, hunger, violence and death have taken their toll. Smoldering conflicts and inevitable changes within the group remind Clementine that danger can come from within, as well as from the outside; she must choose herFree from their brutal captor, the group continues their journey north. However, hunger, violence and death have taken their toll. Smoldering conflicts and inevitable changes within the group remind Clementine that danger can come from within, as well as from the outside; she must choose her allies wisely in this second-to-last episode of The Walking Dead: Season Two.… Expand"
  },
  {
    "name": "uDraw Studio",
    "details_link": "https://www.metacritic.com/game/wii/udraw-studio",
    "publisher": "THQ",
    "release_date": "Nov 14 2010",
    "developers": [
      "THQ"
    ],
    "platforms": "Wii",
    "genres": [
      "Miscellaneous",
      "General",
      "General"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/7/870f586134a04bf608c94d8103ba5b84-98.jpg",
    "descriptions": "Packaged with the uDraw GameTablet, uDraw Studio was designed as a showcase piece for the capabilities of the device and features a robust set of art creation modes and user-friendly tools that help players create anything from simple doodles to intricate masterpieces that can be saved and shared."
  },
  {
    "name": "Wolfenstein",
    "details_link": "https://www.metacritic.com/game/playstation-3/wolfenstein",
    "publisher": "Activision",
    "release_date": "Aug 18 2009",
    "developers": [
      "id Software",
      "Raven Software"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 12 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Historic",
      "Historic",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/9/a2265b8875b892162949162c1e772d71-98.jpg",
    "descriptions": "Set within a near-fictional, historical WWII setting, players take on the role of the heroic OSA agent BJ Blazkowicz as they are thrust into the unknown and unexpected to battle against combat troops, otherworldly forces, and the dark science created by a supernatural Nazi force hell-bent onSet within a near-fictional, historical WWII setting, players take on the role of the heroic OSA agent BJ Blazkowicz as they are thrust into the unknown and unexpected to battle against combat troops, otherworldly forces, and the dark science created by a supernatural Nazi force hell-bent on world domination.  Wolfenstein offers players an action-packed experience as they investigate the powers of a dark parallel dimension, join with resistance forces, and employ an arsenal of conventional and otherworldly weapons in attempts to annihilate the Nazi war machine. Ensuring a deep variety of action, Wolfenstein provides gamers with an assortment of interlinked missions that drive an intense, story-driven combat experience; while the Wolfenstein multiplayer experience continues the world-renowned tradition of class-based team objective gameplay with a full arsenal of conventional and supernatural weapons for addictive online warfare. [Activision]… Expand"
  },
  {
    "name": "Electroplankton",
    "details_link": "https://www.metacritic.com/game/ds/electroplankton",
    "publisher": "Nintendo",
    "release_date": "Jan  9 2006",
    "developers": [
      "indieszero"
    ],
    "platforms": "DS",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Miscellaneous",
      "Rhythm",
      "Music Maker",
      "Music Maker",
      "Application",
      "Music"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/9/5a4834e5eea66d9bac9e98438f0c6faf-98.jpg",
    "descriptions": "Electroplankton is a \"touchable media art\" game that presents the player with \"soothing music\" and graphics on the DS's two screens. The game features 10 \"digital planktons\" that respond to players when they touch the screen or use the microphone. Planktons react by making gestures andElectroplankton is a \"touchable media art\" game that presents the player with \"soothing music\" and graphics on the DS's two screens. The game features 10 \"digital planktons\" that respond to players when they touch the screen or use the microphone. Planktons react by making gestures and sounds of their own. The game takes further advantage of the DS's microphone by recording and playing back sounds and voices as tunes.… Expand"
  },
  {
    "name": "Moon",
    "details_link": "https://www.metacritic.com/game/ds/moon",
    "publisher": "Mastiff",
    "release_date": "Jan 13 2009",
    "developers": [
      "Renegade Kid"
    ],
    "platforms": "DS",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "First-Person",
      "Sci-Fi",
      "Sci-Fi",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/5/38b3c1e079cd8668e8cd68ddfc5a7464-98.jpg",
    "descriptions": "Moon is an intense sci-fi, action-adventure title for Nintendo DS. Moon places gamers on the cold lunar surface in the year 2058. Researchers of the newly established Lunar Base Alpha are shocked when they discover a sealed, alien hatch during construction of a new lunar base, but it's aMoon is an intense sci-fi, action-adventure title for Nintendo DS. Moon places gamers on the cold lunar surface in the year 2058. Researchers of the newly established Lunar Base Alpha are shocked when they discover a sealed, alien hatch during construction of a new lunar base, but it's a shock that soon pales in comparison to what they find beyond the hatch.… Expand"
  },
  {
    "name": "Jak and Daxter: The Lost Frontier",
    "details_link": "https://www.metacritic.com/game/psp/jak-and-daxter-the-lost-frontier",
    "publisher": "SCEA",
    "release_date": "Nov  3 2009",
    "developers": [
      "High Impact Games"
    ],
    "platforms": [
      "PlayStation 2",
      "PSP"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Fantasy",
      "General",
      "Platformer",
      "Fantasy",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/6/752eded956bff23135cd8e27328830cc-98.jpg",
    "descriptions": "Hero Jak and his mischievous sidekick Daxter are back together and for the first time-ever they've joined forces on PSP. Get set for the latest addition to the smash-hit Jak and Daxter series, Jak and Daxter: The Lost Frontier from Sony Computer Entertainment Europe. Prepare for non-stopHero Jak and his mischievous sidekick Daxter are back together and for the first time-ever they've joined forces on PSP. Get set for the latest addition to the smash-hit Jak and Daxter series, Jak and Daxter: The Lost Frontier from Sony Computer Entertainment Europe. Prepare for non-stop action and adventure as the duo travel across mysterious lands and take to the sky on a mission to save their planet from destruction. Take this incredible adventure with you anywhere on your PSP, or play it at home with PlayStation 2. Picking up from where the original Jak and Daxter trilogy left off, Jak and furry friend Daxter team up with their friend Kiera on her quest to become a Sage and save their world from the threat of darkness. As the environment of their planet slowly dies, our two worldly heroes embark on a mission to protect their world from the threat of \"dark eco\". Beginning on foot, you'll run and jump across undiscovered lands, before taking flight in one of five different aircrafts. With cheeky Daxter and our serious Hero Jak together on the adventure, fun and laughter is never far away. Blast airborne enemies and battle sky pirates with your powerful Gunstaff - a brand-new weapon that can transform into other new weapons. [Sony]… Expand"
  },
  {
    "name": "Ninja Gaiden: Master Collection",
    "details_link": "https://www.metacritic.com/game/pc/ninja-gaiden-master-collection",
    "publisher": "Koei Tecmo Games",
    "release_date": "Jun  9 2021",
    "developers": [
      "Team Ninja"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 71,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/0/e80cef9b27f1b17ff243d89e87639430-98.jpg",
    "descriptions": "Three extremely high speed and intense ninja action games are now available in one package. Enjoy 3 games from the NINJA GAIDEN series in this single collection.  The nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battles withThree extremely high speed and intense ninja action games are now available in one package. Enjoy 3 games from the NINJA GAIDEN series in this single collection.  The nostalgic yet timeless high-speed action of the series unfolds on the latest hardware, so look forward to heated battles with fearsome opponents. In addition to Ryu Hayabusa, the 4 female characters Ayane, Rachel, Momiji, and Kasumi are also playable. Pair up favorite characters, and switch between characters during battles. The heroines included in this title are the same as the original versions. In addition, the characters that are playable and scenes (modes) vary for each title.\r Most of the previously released game modes and DLC costumes for each title are included in this thrilling collection. In addition to Ryu Hayabusa, each of the other characters also have many different costumes to choose from, allowing for action packed battles in outfits of your choice.\r Included Titles:\r * NINJA GAIDEN Sigma (NINJA GAIDEN )\r* NINJA GAIDEN Sigma 2 (NINJA GAIDEN 2)\r* NINJA GAIDEN 3: Razor's Edge\rClassic Costumes Included\r DLC costumes included… Expand"
  },
  {
    "name": "Lords of Xulima",
    "details_link": "https://www.metacritic.com/game/pc/lords-of-xulima",
    "publisher": "Numantian Games",
    "release_date": "Nov 14 2014",
    "developers": [
      "Numantian Games"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Role-Playing",
      "PC-style RPG",
      "Western-Style"
    ],
    "meta_score": 71,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/3/68532c16d9fe57e4340d5dadbf59e05f-98.jpg",
    "descriptions": "An RPG set on the fictional continent of Xulima, where Gods and man once walked the land together. Features over one hundred hours of gameplay."
  },
  {
    "name": "Sherlock Holmes: Crimes & Punishments",
    "details_link": "https://www.metacritic.com/game/xbox-one/sherlock-holmes-crimes-punishments",
    "publisher": "Focus Home Interactive",
    "release_date": "Sep 30 2014",
    "developers": [
      "Frogwares"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Switch",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Adventure",
      "General",
      "3D",
      "Third-Person"
    ],
    "meta_score": 71,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/7/5531bca1f0096cb96efbec9a9ca3236b-98.jpg",
    "descriptions": "It is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of theIt is now your turn to truly become Sherlock Holmes and lead your own investigation--actually, your investigations, as 8 captivating cases await you in Crimes & Punishments! Murders, disappearances, spectacular thefts, and other investigations will bring you to the cutting edge of the detective written in the pure tradition of Conan Doyle's novels. Each case offers real freedom to players, who will have to make important moral choices instead of simply enforcing justice by the book. All decisions have an influence in the game, so bear the weight of your choices!… Expand"
  },
  {
    "name": "DreamWorks Bee Movie Game",
    "details_link": "https://www.metacritic.com/game/xbox-360/dreamworks-bee-movie-game",
    "publisher": "Activision",
    "release_date": "Oct 30 2007",
    "developers": [
      "Beenox"
    ],
    "platforms": [
      "PC",
      "Xbox 360"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "General",
      "General"
    ],
    "meta_score": 71,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/7/14e3fd32a6aa3de05a698c5a7989bd15-98.jpg",
    "descriptions": "Based on the DreamWorks Animation movie written, produced by and starring Jerry Seinfeld, Bee Movie Game lets players race, chase and fly their way through an adrenaline-fueled world of adventure as they experience the hilarious antics of Barry B. Benson, a dynamic and daring bee who knowsBased on the DreamWorks Animation movie written, produced by and starring Jerry Seinfeld, Bee Movie Game lets players race, chase and fly their way through an adrenaline-fueled world of adventure as they experience the hilarious antics of Barry B. Benson, a dynamic and daring bee who knows there is more to life than making honey. [Activision]… Expand"
  },
  {
    "name": "Gyromancer",
    "details_link": "https://www.metacritic.com/game/pc/gyromancer",
    "publisher": "Square Enix",
    "release_date": "Nov 18 2009",
    "developers": [
      "Square Enix",
      "PopCap"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Miscellaneous",
      "Puzzle",
      "Puzzle",
      "Puzzle",
      "Matching",
      "Matching"
    ],
    "meta_score": 71,
    "users_score": 6.5,
    "image": "https://static.metacritic.com/images/products/games/6/a81f3bf124faae48a0f4a9421dc19ebf-98.jpg",
    "descriptions": "Gyromanceris a puzzle-roleplaying game (RPG) featuring a unique battle system based on Bejeweled Twist combined with elements of Square Enix role-playing games. Battle system: Gyromancer has a new battle system based on Bejeweled Twist. Command unique beasts to battle your foes. HiddenGyromanceris a puzzle-roleplaying game (RPG) featuring a unique battle system based on Bejeweled Twist combined with elements of Square Enix role-playing games. Battle system: Gyromancer has a new battle system based on Bejeweled Twist. Command unique beasts to battle your foes. Hidden treasures: Search the map for items, coins, and new beasts to fight at your side. Gain levels in battle and acquire powerful new beasts. Deadly mage: Assume the role of Rivel, a deadly mage, as he rids Aldemona Wood of a brooding darkness. [Square Enix]… Expand"
  },
  {
    "name": "Brothers in Arms: Earned in Blood",
    "details_link": "https://www.metacritic.com/game/playstation-2/brothers-in-arms-earned-in-blood",
    "publisher": "Ubisoft",
    "release_date": "Oct 26 2005",
    "developers": [
      "Gearbox Software"
    ],
    "platforms": [
      "PC",
      "PlayStation 2"
    ],
    "num_players": "4  Online",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Historic"
    ],
    "meta_score": 71,
    "users_score": 8.0,
    "image": "https://static.metacritic.com/images/products/games/6/7888caa564413ba309e467fc99e1157f-98.jpg",
    "descriptions": "Experience authentic WWII combat as Sergeant Joe Hartsock and lead your squad beyond Carentan to liberate all of Normandy. Taking online tactics to new heights, Brothers In Arms Earned In Blood offers more unique multiplayer missions and improved online support on PC and consoles! (IncludingExperience authentic WWII combat as Sergeant Joe Hartsock and lead your squad beyond Carentan to liberate all of Normandy. Taking online tactics to new heights, Brothers In Arms Earned In Blood offers more unique multiplayer missions and improved online support on PC and consoles! (Including the bundled addition of modification support for the PC). Earned In Blood features an all-new cooperative Skirmish mode that allows one or two players to take a tour of duty through a series of authentic and harrowing custom combat missions. Arm yourself with additional authentic weapons and command new vehicles like the M10 \"Wolverine\" Tank Destroyer. More Challenging and Dynamic Combat - the game features close quarter urban environments and a new, next generation artificial intelligence system. [Ubisoft]… Expand"
  },
  {
    "name": "Mortal Kombat: Armageddon",
    "details_link": "https://www.metacritic.com/game/wii/mortal-kombat-armageddon",
    "publisher": "Midway",
    "release_date": "May 29 2007",
    "developers": [
      "JGI Entertainment"
    ],
    "platforms": [
      "PlayStation 2",
      "Wii"
    ],
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Fighting",
      "Fighting",
      "3D",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/1/9ec95745dda584058b8ef63bc0f9a1bf-98.jpg",
    "descriptions": "Exclusive to the Wii: Players can take their fighting action to a whole new level with all special moves and fatalities executed via the Wii-mote. In addition, not only can gamers enjoy all aspects of Armageddon with the Wii-mote, but the GameCube and Classic Controller as well. AppearingExclusive to the Wii: Players can take their fighting action to a whole new level with all special moves and fatalities executed via the Wii-mote. In addition, not only can gamers enjoy all aspects of Armageddon with the Wii-mote, but the GameCube and Classic Controller as well. Appearing for the first time on consoles, Armageddon features an enhanced Endurance Mode, allowing gamers to test their true fighting stamina. Select from more than 60 characters from the Entire Mortal Kombat Fighting Universe: From Liu Kang to Shang Tsung to Shao Kahn, Mortal Kombat: Armageddon features more playable fighters than any other Mortal Kombat game to date. For the first time in a Mortal Kombat game players can use a Kreate-A-Fighter feature to create and define their fighter's look, abilities and personality with a deep level of customization and take that unique fighter online. Fans now have the ability to create their own custom fatalities by stringing together a series of attacks via a series of button combos; those that prove worthy can take their very own death moves online to showcase to the world. [Midway]… Expand"
  },
  {
    "name": "Shakedown Hawaii",
    "details_link": "https://www.metacritic.com/game/pc/shakedown-hawaii",
    "publisher": "Vblank Entertainment Inc.",
    "release_date": "May  7 2019",
    "developers": [
      "Vblank Entertainment Inc."
    ],
    "platforms": [
      "3DS",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation 5",
      "PlayStation Vita",
      "Switch",
      "Wii U",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 71,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/7/6c36040aa984a871c0d8cc0cc6ca4ac9-98.jpg",
    "descriptions": "Vblank's open world action heads to the tropics, in Shakedown: Hawaii. From the boardroom to the streets, Shakedown parodies big business and the white collar crimes that go alongside. Build your empire, monopolize the markets, and collaterally re-zone the island's destructible sandbox."
  },
  {
    "name": "World of Final Fantasy Maxima",
    "details_link": "https://www.metacritic.com/game/playstation-4/world-of-final-fantasy-maxima",
    "publisher": "Square Enix",
    "release_date": "Nov  6 2018",
    "developers": [
      "Square Enix"
    ],
    "platforms": [
      "PC",
      "Switch",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "2 ",
    "genres": [
      "Role-Playing",
      "Japanese-Style"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/7/922fa75b118a0cd03b5eafa00d4dd805-98.jpg",
    "descriptions": "POWERED UP AND REBORN! Expanding the horizons of FINAL FANTASY! A tale of many encounters and the birth of a new world. Originally released in October 2016, WORLD OF FINAL FANTASY has just been powered up and reborn as WORLD OF FINAL FANTASY Maxima! New characters from FF lore (Champions)POWERED UP AND REBORN! Expanding the horizons of FINAL FANTASY! A tale of many encounters and the birth of a new world. Originally released in October 2016, WORLD OF FINAL FANTASY has just been powered up and reborn as WORLD OF FINAL FANTASY Maxima! New characters from FF lore (Champions) and monsters (Mirages) add even more fun and excitement to this unique adventure. This new and enhanced version of WORLD OF FINAL FANTASY also features the Avatar Change system, which allows the protagonists, Reynn and Lann, to fight as Champions. Fight your way through exhilarating battles as legendary FINAL FANTASY heroes.… Expand"
  },
  {
    "name": "Minecraft: Story Mode Season Two - Episode 1: Hero in Residence",
    "details_link": "https://www.metacritic.com/game/xbox-one/minecraft-story-mode-season-two---episode-1-hero-in-residence",
    "publisher": "Telltale Games",
    "release_date": "Jul 11 2017",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 71,
    "users_score": 4.6,
    "image": "https://static.metacritic.com/images/products/games/6/92e6e47fe726072dba90c7707c5317d2-98.jpg",
    "descriptions": "Now that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more… complicated. With more responsibilities and less time for adventure, old friendships have started to fade — at least until Jesse’s hand getsNow that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more… complicated. With more responsibilities and less time for adventure, old friendships have started to fade — at least until Jesse’s hand gets stuck in a creepy gauntlet that belongs to an ancient underwater temple.… Expand"
  },
  {
    "name": "Minecraft: Story Mode - Episode 4: A Block and a Hard Place",
    "details_link": "https://www.metacritic.com/game/xbox-one/minecraft-story-mode---episode-4-a-block-and-a-hard-place",
    "publisher": "Telltale Games",
    "release_date": "Dec 22 2015",
    "developers": [
      "Telltale Games"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox 360",
      "Xbox One"
    ],
    "genres": [
      "Action Adventure",
      "Linear",
      "Adventure",
      "Point-and-Click"
    ],
    "meta_score": 71,
    "users_score": 6.8,
    "image": "https://static.metacritic.com/images/products/games/0/538fe8c9002c7cdeefa79a02afdce435-98.jpg",
    "descriptions": "Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon,Minecraft: Story Mode is like a playable TV show based on the Minecraft game, where YOU are the star, and your choices and actions decide how the story is told. You assume the role of Jesse, and you and your friends are thrown into an adventure to save the world. While visiting EnderCon, your crew stumbles on something dreadful. Terror is unleashed, and your only hope is to track down the “Order of the Stone”, a fabled group of adventurers who slew the legendary Ender Dragon. But where are they? In a race against time, you will travel across the over-world, through the Nether, to The End, and beyond. [Telltale Games]… Expand"
  },
  {
    "name": "Star Wars: The Force Unleashed",
    "details_link": "https://www.metacritic.com/game/wii/star-wars-the-force-unleashed",
    "publisher": "LucasArts",
    "release_date": "Sep 16 2008",
    "developers": [
      "Krome Studios"
    ],
    "platforms": [
      "iPhone/iPad",
      "PlayStation 2",
      "PlayStation 3",
      "Switch",
      "Xbox 360",
      "Wii"
    ],
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Action Adventure",
      "General",
      "General",
      "Shooter",
      "Linear",
      "Third-Person",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 7.9,
    "image": "https://static.metacritic.com/images/products/games/7/15ccf1b1ff670afc3c97cdcc8e181f99-98.jpg",
    "descriptions": "Star Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode IIIStar Wars: The Force Unleashed casts players as Darth Vader's \"Secret Apprentice\" and promises to unveil new revelations about the Star Wars galaxy. The expansive story, created under direction from George Lucas, is set during the largely unexplored era between \"Star Wars: Episode III Revenge of the Sith\" and \"Star Wars: Episode IV A New Hope.\" In it, players assist the iconic villain in his quest to rid the universe of Jedi - and face decisions that could change the course of their destiny. Unleash and upgrade the Secret Apprentice's four core Force powers - Force push, grip, repulse and lightning - throughout the course of the game, and combine them for ultra-destructive, never-before-seen combos. The Secret Apprentice doesn't just Force push enemies into walls - he Force pushes enemies through walls. The Secret Apprentice doesn't just Force grip foes to throw them aside - he Force grips them in midair, zapping them with lightning, then dropping them to the ground to explode like a bomb. In addition to new adversaries created just for the game, such as fugitive Jedi and Force-sensitive Felucians, players also confront and associate with familiar faces from the Star Wars films, including Darth Vader. Visit locations such as Episode III's Wookiee homeworld Kashyyyk and the floral Felucia, the junk planet Raxus Prime, plus an Imperial TIE fighter construction facility. Decisions made by players throughout the game determine the path of the story, including multiple endings that will rock Star Wars continuity as they know it. [LucasArts]… Expand"
  },
  {
    "name": "Wild ARMs 5",
    "details_link": "https://www.metacritic.com/game/playstation-2/wild-arms-5",
    "publisher": "XSEED Games",
    "release_date": "Aug 28 2007",
    "developers": [
      "Media.Vision"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1 Player",
    "genres": [
      "Role-Playing",
      "Console-style RPG"
    ],
    "meta_score": 71,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/5/7db4d02ced17788a7152983ed84b5581-98.jpg",
    "descriptions": "WILD ARMS 5 follows the journey of a group of young travelers as they try to unlock the mysteries of their ravaged land and unknowingly become involved in a struggle that will decide the fate of the entire world. 12,000 years ago, the world of Filgaia was a land immersed in technology farWILD ARMS 5 follows the journey of a group of young travelers as they try to unlock the mysteries of their ravaged land and unknowingly become involved in a struggle that will decide the fate of the entire world. 12,000 years ago, the world of Filgaia was a land immersed in technology far beyond anything found in the present day. For reasons unknown, however, the citizens of this advanced culture suddenly abandoned their technology, leaving the future of the human race to live in a comparatively primitive state. All that remained of this once great civilization were some scattered mechanical parts and the occasional remnants of a legendary golem -- huge mechanical devices built to serve mankind. While use of the old technology remained mostly out of reach, there were some who had begun to research the ancient devices, seeking even the faintest hope of enriching their lives on this desolate world. The situation changed dramatically about a hundred years ago when a new race known as the Veruni arrived on the planet. Although similar in appearance to humans, the Veruni's superior physical attributes and advanced technology allowed them to quickly establish dominance over mankind. The human race found itself relegated to second-class status, and many citizens were forced to perform hard labor day in and day out in order to survive. Fast-forward to the present day. In a small town called Capo Bronco on the outskirts of Filgaia, two youths, Dean Stark and Rebecca Streisand, witness an unbelievable event -- the giant arm of a golem somehow falling from the sky. Their disbelief grows further when they discover that within the clenched fist of the golem's hand lies a girl with little recollection of her past other than her name -- \"Avril.\" This chance encounter inspires Dean and Rebecca to travel with Avril across the wastelands of Filgaia in hopes of helping her regain her lost memories. Little do they know their journey will eventually decide the fate of all mankind. [XSEED]… Expand"
  },
  {
    "name": "Scarface: The World Is Yours",
    "details_link": "https://www.metacritic.com/game/wii/scarface-the-world-is-yours",
    "publisher": "Sierra Entertainment",
    "release_date": "Jun 12 2007",
    "developers": [
      "Radical Entertainment"
    ],
    "platforms": [
      "PC",
      "PlayStation 2",
      "Wii"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Modern",
      "General",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 8.4,
    "image": "https://static.metacritic.com/images/products/games/0/39ac34beca627eb7ce36c2141f033e1a-98.jpg",
    "descriptions": "Scarface: The World Is Yours plunges players deep into the seedy underbelly of 1980s Miami as the one-and-only Tony Montana, featuring the likeness of Al Pacino. Players are challenged to re-enact the climactic mansion shoot-out from the original film, but in the game, Tony fights his wayScarface: The World Is Yours plunges players deep into the seedy underbelly of 1980s Miami as the one-and-only Tony Montana, featuring the likeness of Al Pacino. Players are challenged to re-enact the climactic mansion shoot-out from the original film, but in the game, Tony fights his way out of the mansion and survives.  Returning to Miami, Tony must rebuild his fallen empire and seize vengeance on his enemies. Scarface: The World Is Yours for Wii includes graphics and gameplay optimizations, an all-new control scheme that takes advantage of the Wii console's unique motion-sensitive Remote and Nunchuk controller design, as well as other alterations for the Wii audience. [Vivendi Games]… Expand"
  },
  {
    "name": "The King of Fighters 2000/2001",
    "details_link": "https://www.metacritic.com/game/playstation-2/the-king-of-fighters-20002001",
    "publisher": "Playmore",
    "release_date": "Dec  9 2003",
    "developers": [
      "SNK Playmore"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Miscellaneous",
      "Compilation"
    ],
    "meta_score": 71,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/234dc236d13bbd11d21bc90ece83385e-98.jpg",
    "descriptions": "KOF2000's Party Mode and Memory Mode are available only for PS2 version. In Party Mode, you can try to beat opponents with limited power. In Memory Mode, you can enjoy opening introductions of the past KOF series. Additionally, you may get unexpected characters as strikers! KOF 2001, TheKOF2000's Party Mode and Memory Mode are available only for PS2 version. In Party Mode, you can try to beat opponents with limited power. In Memory Mode, you can enjoy opening introductions of the past KOF series. Additionally, you may get unexpected characters as strikers! KOF 2001, The last 3rd of \"Nests Story\" started from \"KOF '99\" appears on PS2. With \"4vs. 4 Tactical Order Select\" and \"Wire Damage,\" KOF2001 has newly accomplished evolution. \"Party Mode\" and \"3-D Polygon Backgrounds\" are available. [SNK Playmore]… Expand"
  },
  {
    "name": "G1 Jockey 3",
    "details_link": "https://www.metacritic.com/game/playstation-2/g1-jockey-3",
    "publisher": "Koei",
    "release_date": "May 28 2003",
    "developers": [
      "Koei/Inis"
    ],
    "platforms": "PlayStation 2",
    "num_players": "1-2 ",
    "genres": [
      "Sports",
      "Alternative",
      "Horse Racing"
    ],
    "meta_score": 71,
    "users_score": 8.2,
    "image": "https://static.metacritic.com/images/products/games/5/df5cf213124fb9296ba5eca8185fcaa8-98.jpg",
    "descriptions": "Take the role of an apprentice jockey thrust into the highly competitive sport of thoroughbred racing. Over the course of a season, face fierce competition as you battle to become the world?s top Grade 1 jockey. All the action and the vibrant spectacle of thoroughbred racing are captured inTake the role of an apprentice jockey thrust into the highly competitive sport of thoroughbred racing. Over the course of a season, face fierce competition as you battle to become the world?s top Grade 1 jockey. All the action and the vibrant spectacle of thoroughbred racing are captured in real-time 3D. You have full control of their steed right out of the gate and all the way to the furious finish.… Expand"
  },
  {
    "name": "Star Wars: The Clone Wars",
    "details_link": "https://www.metacritic.com/game/xbox/star-wars-the-clone-wars",
    "publisher": "LucasArts",
    "release_date": "Apr 22 2003",
    "developers": [
      "Pandemic Studios"
    ],
    "platforms": [
      "PlayStation 2",
      "Xbox"
    ],
    "num_players": "1-8 ",
    "genres": [
      "Action",
      "Shooter",
      "Third-Person",
      "Sci-Fi"
    ],
    "meta_score": 71,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/0/bc1a20e984d5360519c4bc3c250c8677-98.jpg",
    "descriptions": "Star Wars: The Clone Wars begins where Star Wars Episode II: Attack of the Clones ends.  As Jedi Anakin Skywalker, Mace Windu, or Obi-Wan Kenobi, you lead the Republic Army in the greatest battles of the epic Clone Wars.  Your mission is to stop the Separatists from reassembling an ancientStar Wars: The Clone Wars begins where Star Wars Episode II: Attack of the Clones ends.  As Jedi Anakin Skywalker, Mace Windu, or Obi-Wan Kenobi, you lead the Republic Army in the greatest battles of the epic Clone Wars.  Your mission is to stop the Separatists from reassembling an ancient Sith weapon of mass annihilation.  Then battle for survival in a variety of multiplayer games with up to four players, with Deathmatch, King-of-the-Hill, and even strategic Conquest games.  And engage over 30 unique combat units as you wage war across six worlds in the galaxy's most unforgettable conflict.… Expand"
  },
  {
    "name": "Godzilla: Destroy All Monsters Melee",
    "details_link": "https://www.metacritic.com/game/xbox/godzilla-destroy-all-monsters-melee",
    "publisher": "Atari",
    "release_date": "Apr 16 2003",
    "developers": [
      "Pipeworks Software",
      "Inc."
    ],
    "platforms": "Xbox",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Fighting",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/8/a28fecb960b6bb22529d2f4e718ee20c-98.jpg",
    "descriptions": "Legendary monsters battle among Earth's cities to determine the planet's fate. In Godzilla: Destroy All Monsters Melee, you can play as Godzilla or any of his longtime rivals as they fight hand-to-hand, at close range, and with special moves. Each massive beast has different physicalLegendary monsters battle among Earth's cities to determine the planet's fate. In Godzilla: Destroy All Monsters Melee, you can play as Godzilla or any of his longtime rivals as they fight hand-to-hand, at close range, and with special moves. Each massive beast has different physical attributes and special projectile weapons. You'll fight in cities such as Tokyo and San Francisco--all featuring real building destruction and physics. For multiplayer fighting mayhem, you can bring three of your friends into the battle.… Expand"
  },
  {
    "name": "ToeJam & Earl III: Mission to Earth",
    "details_link": "https://www.metacritic.com/game/xbox/toejam-earl-iii-mission-to-earth",
    "publisher": "Sega",
    "release_date": "Oct 23 2002",
    "developers": [
      "ToeJam & Earl Productions"
    ],
    "platforms": "Xbox",
    "num_players": "1-2 ",
    "genres": [
      "Action Adventure",
      "Fantasy"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/6/7bb7e48965c517ffab18f1daf97bfe97-98.jpg",
    "descriptions": "The alien duo is back in an all-new adventure. In ToeJam & Earl III: Mission to Earth, ToeJam, Big Earl, and their new friend, Latisha, embark on a mission to retrieve the 12 sacred Albums of Funk, stolen by the inhabitantats of Earth. Across expansive environments, you must guide this groupThe alien duo is back in an all-new adventure. In ToeJam & Earl III: Mission to Earth, ToeJam, Big Earl, and their new friend, Latisha, embark on a mission to retrieve the 12 sacred Albums of Funk, stolen by the inhabitantats of Earth. Across expansive environments, you must guide this group toward a showdown with the evil Anti-Funk. You'll collect a wide variety of power-ups, take on dangerous side quests, and double-team the clueless Earthlings in style.… Expand"
  },
  {
    "name": "Aero the Acro-bat",
    "details_link": "https://www.metacritic.com/game/game-boy-advance/aero-the-acro-bat",
    "publisher": "Metro3D",
    "release_date": "May 14 2002",
    "developers": [
      "Atomic Planet Entertainment"
    ],
    "platforms": "Game Boy Advance",
    "num_players": "1 Player",
    "genres": [
      "Action",
      "Platformer",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/9/e52ed0b07037ba71ede80a70e2739a57-98.jpg",
    "descriptions": "Little seems to have been lost in the translation from the 1993 original, but then again, it was a mediocre game to begin with."
  },
  {
    "name": "Star Wars Galactic Battlegrounds: Clone Campaigns",
    "details_link": "https://www.metacritic.com/game/pc/star-wars-galactic-battlegrounds-clone-campaigns",
    "publisher": "LucasArts",
    "release_date": "May 14 2002",
    "developers": [
      "LucasArts"
    ],
    "platforms": "PC",
    "num_players": "1-8 ",
    "genres": [
      "Strategy",
      "Real-Time",
      "Sci-Fi",
      "Sci-Fi",
      "General"
    ],
    "meta_score": 71,
    "users_score": 7.6,
    "image": "https://static.metacritic.com/images/products/games/9/fab29ac4e7c7faf4132de91fac976c41-98.jpg",
    "descriptions": "Clone Campaigns features 14 original single-player combat scenarios, new civilizations, environments, vehicles, and more than 200 new units. By adding the expansion pack to Star Wars Galactic Battlegrounds: Clone Campaigns, in both skirmish and multiplayer modes, players can mix and matchClone Campaigns features 14 original single-player combat scenarios, new civilizations, environments, vehicles, and more than 200 new units. By adding the expansion pack to Star Wars Galactic Battlegrounds: Clone Campaigns, in both skirmish and multiplayer modes, players can mix and match civilizations from Attack of the Clones with those from the classic Star Wars universe. [LucasArts]… Expand"
  },
  {
    "name": "Ballistics",
    "details_link": "https://www.metacritic.com/game/pc/ballistics",
    "publisher": "Xicat Interactive",
    "release_date": "Oct 22 2001",
    "developers": [
      "GRIN"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Driving",
      "Racing",
      "Arcade",
      "Futuristic",
      "Futuristic"
    ],
    "meta_score": 71,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/1/2e1bf387970a35be838e6307fc43f252-98.jpg",
    "descriptions": "The Ballistics pilots run their hover bikes on magnetic fields inside a track that allows full 360º movement. The races take place in many different settings; all with their own unique design and environment - all shaped to breed the speed. [Xicat Interactive]"
  },
  {
    "name": "Resident Evil 3: Nemesis",
    "details_link": "https://www.metacritic.com/game/pc/resident-evil-3-nemesis",
    "publisher": "Capcom",
    "release_date": "Apr 16 2001",
    "developers": [
      "Capcom",
      "Hi Corp"
    ],
    "platforms": "PC",
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 71,
    "users_score": 8.7,
    "image": "https://static.metacritic.com/images/products/games/4/ab13aaee61591db88f62e963dba26b58-98.jpg",
    "descriptions": "Taking place on the day and night following the events of the first Resident Evil game but just before the second, Nemesis comes to the PC after a stops on the Playstation, continuing the series that made the survival horror genre."
  },
  {
    "name": "F1 World Grand Prix",
    "details_link": "https://www.metacritic.com/game/pc/f1-world-grand-prix",
    "publisher": "Eidos Interactive",
    "release_date": "Jul  1 2000",
    "developers": [
      "Video System"
    ],
    "platforms": "PC",
    "num_players": "1-12 ",
    "genres": [
      "Driving",
      "Racing",
      "Simulation",
      "Formula One",
      "Formula One",
      "Automobile"
    ],
    "meta_score": 71,
    "users_score": 6.9,
    "image": "https://static.metacritic.com/images/products/games/6/5b095264e3ea4dd92915cdb7269810f4-98.jpg",
    "descriptions": "F1 World Grand Prix is the follow to \"Official Formula 1 Racing.\" This new game in the franchise will feature all the teams, drivers, and circuits from the 1999 Formula 1 season. A host of graphical and gameplay improvements have been added while retaining the speed, intuitiveness, and funF1 World Grand Prix is the follow to \"Official Formula 1 Racing.\" This new game in the franchise will feature all the teams, drivers, and circuits from the 1999 Formula 1 season. A host of graphical and gameplay improvements have been added while retaining the speed, intuitiveness, and fun offered by the first game.… Expand"
  },
  {
    "name": "Tom Clancy's Rainbow Six Extraction",
    "details_link": "https://www.metacritic.com/game/xbox-series-x/tom-clancys-rainbow-six-extraction",
    "publisher": "Ubisoft",
    "release_date": "Jan 20 2022",
    "developers": [
      "Ubisoft Montreal"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "PlayStation 5",
      "Stadia",
      "Xbox One",
      "Xbox Series X"
    ],
    "num_players": "Up to 3 ",
    "genres": [
      "Action",
      "Shooter",
      "First-Person",
      "Tactical"
    ],
    "meta_score": 71,
    "users_score": 6.0,
    "image": "https://static.metacritic.com/images/products/games/3/9715bf73912a79faa73d8ecb0620b1b9-98.jpg",
    "descriptions": "Assemble your elite team of Rainbow Six Operators to launch incursions in the unpredictable containment zones and face off against an evolving Alien threat. Band together and put everything on the line as you take on this unknown enemy. Pick from 18 Rainbow Six operators. Assemble a squad inAssemble your elite team of Rainbow Six Operators to launch incursions in the unpredictable containment zones and face off against an evolving Alien threat. Band together and put everything on the line as you take on this unknown enemy. Pick from 18 Rainbow Six operators. Assemble a squad in Co-op of up to three Operators, or go solo. Each operator has a specific set of weapons and abilities to learn improve and master, and improve through a new progression-system. Explore 12 uniquely designed maps featuring procedurally generated challenges will test your team every time. Knowledge, cooperation and a tactical approach are your best weapons to survive. Fail against the enemies and your Operators will go Missing in Action (MIA). Be prepared to fight a lethal, unpredictable and constantly evolving Alien Threat. You will have to count on your teammates to face each of the 10 parasitic archetypes. Their abilities, combined with the alien ecosystem, will stand in your way.… Expand"
  },
  {
    "name": "Disney Magical World",
    "details_link": "https://www.metacritic.com/game/3ds/disney-magical-world",
    "publisher": "Nintendo",
    "release_date": "Apr 11 2014",
    "developers": [
      "h.a.n.d. Inc."
    ],
    "platforms": "3DS",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "General",
      "Virtual",
      "Virtual Life"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/2/a8b2a99c1e5822b3150e70b72565e5be-98.jpg",
    "descriptions": "A new life awaits you in the magical world of Disney! Meet and interact with over 60 favorite Disney characters while exploring the worlds of Alice in Wonderland, Cinderella, Aladdin, and Winnie the Pooh. When you can manage your own cafe filled with Disney magic and set off on ghost-huntingA new life awaits you in the magical world of Disney! Meet and interact with over 60 favorite Disney characters while exploring the worlds of Alice in Wonderland, Cinderella, Aladdin, and Winnie the Pooh. When you can manage your own cafe filled with Disney magic and set off on ghost-hunting quests, your life becomes the adventure.\r Go customization crazy! Build new furniture to decorate your cafe with, and your own personal room above it. Put together hundreds of Disney-themed outfits with collectable clothes and accessories for your avatar. You can even plant and harvest crops, learn new greetings, and collect Disney character cards. Or, collect magic wands and battle through ghost-filled forests and dungeons. And if thats not enough, you can get extra worlds, more items, and outfits as additional paid content. In other words, the magic never has to end!\r -Interact with over 60 Disney characters!\r-Explore the worlds of Alice in Wonderland, Cinderella, Aladdin, and Winnie the Pooh\r-Battle ghosts to help Disney characters and residents find special missing items\r-Manage your own cafe to make in-game money and attract Disney characters to dine in\r-Dress your avatar in hundreds of outfits using Disney-themed clothes and accessories\r-Friends can connect locally to show off their room and cafe\r-Enjoy StreetPass interactions with other players and see how theyve customized their avatars… Expand"
  },
  {
    "name": "Spectrobes: Origins",
    "details_link": "https://www.metacritic.com/game/wii/spectrobes-origins",
    "publisher": "Disney Interactive Studios",
    "release_date": "Aug 18 2009",
    "developers": [
      "Genki"
    ],
    "platforms": "Wii",
    "genres": [
      "Role-Playing",
      "Action RPG",
      "Action RPG"
    ],
    "meta_score": 71,
    "users_score": 8.3,
    "image": "https://static.metacritic.com/images/products/games/3/cebab375446882aec575d160a974f9f4-98.jpg",
    "descriptions": "Spectrobes: Origins brings the successful series to Wii for the first time with a new story that reveals secrets from the past through flashbacks of significant events. In Spectrobes: Origins, players use the unique Wii controls to explore vast worlds, excavate three-dimensional fossils andSpectrobes: Origins brings the successful series to Wii for the first time with a new story that reveals secrets from the past through flashbacks of significant events. In Spectrobes: Origins, players use the unique Wii controls to explore vast worlds, excavate three-dimensional fossils and unravel an engaging story while discovering the key to preventing a galactic threat. While immersed in the universe as never before, players fight enemies by controlling planetary patrol officer Rallen and commanding a Spectrobe creature at his side in large-scale, real-time battles. [Disney Interactive]… Expand"
  },
  {
    "name": "Conarium",
    "details_link": "https://www.metacritic.com/game/pc/conarium",
    "publisher": "Iceberg Interactive",
    "release_date": "Jun  6 2017",
    "developers": [
      "Zoetrope Interactive"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "3D",
      "First-Person"
    ],
    "meta_score": 71,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/7/aa380343198060c7251d08e7f909a791-98.jpg",
    "descriptions": "Conarium is a chilling Lovecraftian game, which follows a gripping story involving four scientists and their endeavor to challenge what we normally consider to be the ‘absolute’ limits of nature. Inspired by H.P. Lovecraft’s novella \"At the Mountains of Madness\", but largely set after theConarium is a chilling Lovecraftian game, which follows a gripping story involving four scientists and their endeavor to challenge what we normally consider to be the ‘absolute’ limits of nature. Inspired by H.P. Lovecraft’s novella \"At the Mountains of Madness\", but largely set after the original story.… Expand"
  },
  {
    "name": "Dead Island",
    "details_link": "https://www.metacritic.com/game/playstation-3/dead-island",
    "publisher": "Deep Silver",
    "release_date": "Sep  6 2011",
    "developers": [
      "Techland"
    ],
    "platforms": [
      "PC",
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Action Adventure",
      "Horror",
      "Horror",
      "Survival"
    ],
    "meta_score": 71,
    "users_score": 6.7,
    "image": "https://static.metacritic.com/images/products/games/6/90c6d5562feb99525decf45e1ac5e333-98.jpg",
    "descriptions": "Dead Island is a first-person shooter that pits you on an island full of zombies."
  },
  {
    "name": "Nintendogs + Cats: Toy Poodle & New Friends",
    "details_link": "https://www.metacritic.com/game/3ds/nintendogs-+-cats-toy-poodle-new-friends",
    "publisher": "Nintendo",
    "release_date": "Mar 27 2011",
    "developers": [
      "Nintendo"
    ],
    "platforms": "3DS",
    "genres": [
      "Simulation",
      "Miscellaneous",
      "Virtual Life",
      "Virtual Life",
      "Virtual",
      "Pet"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/0/f3befaf3c1220626d889395628c1df71-98.jpg",
    "descriptions": "Interact with your virtual puppies and cats in 3D."
  },
  {
    "name": "Oceanhorn 2: Knights of the Lost Realm",
    "details_link": "https://www.metacritic.com/game/switch/oceanhorn-2-knights-of-the-lost-realm",
    "publisher": "Cornfox & Bros.",
    "release_date": "Oct 28 2020",
    "developers": [
      "Cornfox & Bros."
    ],
    "platforms": [
      "iPhone/iPad",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Open-World"
    ],
    "meta_score": 71,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/7/bef092cba998b26dbfb9c2b7c3f64590-98.jpg",
    "descriptions": "A GRAND ADVENTUREOceanhorn 2: Knights of the Lost Realm, set a thousand years before the events of the first chapter, takes you on a magical journey across the vast world of Gaia, brimming with mythology and lore. A young Knight faces an impossible challenge, as Warlock Mesmeroth hasA GRAND ADVENTUREOceanhorn 2: Knights of the Lost Realm, set a thousand years before the events of the first chapter, takes you on a magical journey across the vast world of Gaia, brimming with mythology and lore. A young Knight faces an impossible challenge, as Warlock Mesmeroth has returned with a formidable Dark Army. Will our hero be able to unite the Owrus, Gillfolk, and men in a fight for the fate of the world?THIS TIME YOU'RE NOT ALONEYou will not be taking this journey alone. Trin, the granddaughter of Arcadia's leader Archimedes, and Gen, a mysterious robot wielding an old samurai weapon, will join forces with you, and fight at your side against Mesmeroth's Dark Army. Contextual commands will allow you to direct these allies into battle, or have them help you with the solution of the game's most clever puzzles!FIGHT, SOLVE, EXPLOREBigger, better, and packed with new features Oceanhorn 2 is not only one of the best-looking adventure games out there, but it also builds a unique experience on the shoulder of classic video games. Collect powerful items, wield the Caster Gun, solve the mysterious puzzles of the ancients, and discover all that Arcadia and its neighboring kingdoms have to offer! Accept the challenge and become a true Hero.FEATURES- An epic RPG main quest spanning 15+ hours of gameplay- Massive boss fights test your reflexes and combat skills- Dozens of side quests grant incredible rewards- Clever puzzles to solve and mysterious dungeons to explore- Beautiful, handcrafted graphics paint a world of legends and intrigue… Expand"
  },
  {
    "name": "Fallen Earth: Welcome to the Apocalypse",
    "details_link": "https://www.metacritic.com/game/pc/fallen-earth-welcome-to-the-apocalypse",
    "publisher": "SouthPeak Games",
    "release_date": "Sep 22 2009",
    "developers": [
      "Fallen Earth",
      "LLC"
    ],
    "platforms": "PC",
    "num_players": "Massively Multiplayer",
    "genres": [
      "Role-Playing",
      "Massively Multiplayer Online",
      "Massively Multiplayer",
      "Sci-Fi",
      "Sci-Fi"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/5/4373d9b0a49b42c74711a066508152ec-98.jpg",
    "descriptions": "Mankind teeters on the edge of extinction, clinging to the bones of the old world while trying to recover long forgotten secrets. The Grand Canyon is the last bastion of humanity. The Shiva virus, which wiped out nearly all of humanity, has left the survivors and subsequent generationsMankind teeters on the edge of extinction, clinging to the bones of the old world while trying to recover long forgotten secrets. The Grand Canyon is the last bastion of humanity. The Shiva virus, which wiped out nearly all of humanity, has left the survivors and subsequent generations altered. The virus caused mutations, some of which were benign, some malignant, and just some incredible. It is your choice to either rise above the hardships of the post-apocalyptic world and rebuild what was lost or embrace the destruction and erase the corrupt world that remains. Where will you stand in the fight for Fallen Earth? [Steam]… Expand"
  },
  {
    "name": "Anarchy Reigns",
    "details_link": "https://www.metacritic.com/game/playstation-3/anarchy-reigns",
    "publisher": "Sega",
    "release_date": "Jan  8 2013",
    "developers": [
      "PlatinumGames"
    ],
    "platforms": [
      "Xbox 360",
      "PlayStation 3"
    ],
    "num_players": "Up to 16 ",
    "genres": [
      "Action",
      "Beat-'Em-Up",
      "Beat-'Em-Up",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 8.1,
    "image": "https://static.metacritic.com/images/products/games/5/ef998bfa53de6b22bce08d6e94b20a0e-98.jpg",
    "descriptions": "ANARCHY REIGNS is a heavy-hitting, action packed multiplayer brawler that puts players in the middle of the battle simultaneously."
  },
  {
    "name": "Kirby: Squeak Squad",
    "details_link": "https://www.metacritic.com/game/ds/kirby-squeak-squad",
    "publisher": "Nintendo",
    "release_date": "Dec  4 2006",
    "developers": [
      "Flagship",
      "HAL Labs"
    ],
    "platforms": "DS",
    "num_players": "1-4 ",
    "genres": [
      "Action",
      "Platformer",
      "Platformer",
      "2D",
      "2D"
    ],
    "meta_score": 71,
    "users_score": 7.8,
    "image": "https://static.metacritic.com/images/products/games/8/60669a349773d63d9f2022de0c187d23-98.jpg",
    "descriptions": "(Also known as \"Kirby Mouse Attack\" in the UK/EU)  Kirby's back and ready for a bellyful of adventure. When someone steals some strawberry shortcake, the pink powerhouse sets out after them, learning new skills. Players can expect all the floating, jumping and battling of a classic Kirby(Also known as \"Kirby Mouse Attack\" in the UK/EU)  Kirby's back and ready for a bellyful of adventure. When someone steals some strawberry shortcake, the pink powerhouse sets out after them, learning new skills. Players can expect all the floating, jumping and battling of a classic Kirby game, but this time, Kirby’s copy abilities have been massively boosted. Not only can players mix and match copy abilities by using the stylus to drag them together inside Kirby's belly (located on the touch screen), but the powers themselves now have the ability to affect the environment, as well as foes. Burn trees and grasses with the Fire ability, freeze water with the Ice ability.  In sub-game mode, this game also features multiplayer fun for up to four players, using either Multi-Card or DS Download Play over DS Local Area Network. [Nintendo]… Expand"
  },
  {
    "name": "Dead Rising Triple Pack",
    "details_link": "https://www.metacritic.com/game/xbox-one/dead-rising-triple-pack",
    "publisher": "Capcom",
    "release_date": "Sep 13 2016",
    "developers": [
      "Capcom"
    ],
    "platforms": [
      "PC",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Action Adventure"
    ],
    "meta_score": 71,
    "users_score": 7.5,
    "image": "https://static.metacritic.com/images/products/games/7/70222a75447bd9528d645a8ce17f11bb-98.jpg",
    "descriptions": "In celebration of Dead Rising’s 10th Anniversary, Capcom has brought Dead Rising, Dead Rising 2, and Dead Rising 2: Off the Record to a new generation of zombie slayers."
  },
  {
    "name": "Echo: Secrets of the Lost Cavern",
    "details_link": "https://www.metacritic.com/game/pc/echo-secrets-of-the-lost-cavern",
    "publisher": "The Adventure Company",
    "release_date": "Jul  5 2005",
    "developers": [
      "Kheops Studio"
    ],
    "platforms": "PC",
    "num_players": "1 Player",
    "genres": [
      "Adventure",
      "3D",
      "Modern",
      "Third-Person",
      "Modern"
    ],
    "meta_score": 71,
    "users_score": 6.3,
    "image": "https://static.metacritic.com/images/products/games/9/934dc8aa8590782aa2bbe8203687f89a-98.jpg",
    "descriptions": "Delve into a world of exploration and intrigue as you embark on a quest filled with puzzles and mystery. Use your wits and powers of observation to survive the vast wilderness as your journey leads you to one of mankind's forgotten wonders. Experience your adventure through the eyes of ArokDelve into a world of exploration and intrigue as you embark on a quest filled with puzzles and mystery. Use your wits and powers of observation to survive the vast wilderness as your journey leads you to one of mankind's forgotten wonders. Experience your adventure through the eyes of Arok and meet many fascinating characters. Contend with the wild world where fishing, hunting, gathering, and mysterious shamanist ceremonies are all part of the struggle for survival as you unravel the secrets of the lost cavern. Also featured is an integrated encyclopedia filled with historically accurate data on the Paleolithic period. Pristine photo-realistic graphics and environments including rivers, troglodyte caves, and green valleys, will take players back to the dawn of human existence. [Adventure Company]… Expand"
  },
  {
    "name": "Bound",
    "details_link": "https://www.metacritic.com/game/playstation-4/bound",
    "publisher": "SCEA",
    "release_date": "Aug 16 2016",
    "developers": [
      "SCE Santa Monica",
      "Plastic Studios"
    ],
    "platforms": "PlayStation 4",
    "genres": [
      "Action",
      "Platformer",
      "3D"
    ],
    "meta_score": 71,
    "users_score": 7.0,
    "image": "https://static.metacritic.com/images/products/games/4/899903c0d99f9d524b55b11c75a55983-98.jpg",
    "descriptions": "Players use dance moves to traverse vast environments filled with platforming challenges in an introspective story that is revealed through powerful metaphor and imagery. [Plastic]"
  },
  {
    "name": "ASTRONEER",
    "details_link": "https://www.metacritic.com/game/pc/astroneer",
    "publisher": "System Era Softworks",
    "release_date": "Feb  6 2019",
    "developers": [
      "System Era Softworks"
    ],
    "platforms": [
      "PlayStation 4",
      "Switch",
      "Xbox One",
      "PC"
    ],
    "num_players": "Online Multiplayer",
    "genres": [
      "Action Adventure",
      "Sandbox"
    ],
    "meta_score": 71,
    "users_score": 7.2,
    "image": "https://static.metacritic.com/images/products/games/9/968ead6f68b8a4339427c43e682d6122-98.jpg",
    "descriptions": "Explore and reshape distant worlds. Astroneer is set during the 25th century’s Intergalactic Age of Discovery, where Astroneers explore the frontiers of outer space, risking their lives in harsh environments to unearth rare discoveries and unlock the mysteries of the universe. On thisExplore and reshape distant worlds. Astroneer is set during the 25th century’s Intergalactic Age of Discovery, where Astroneers explore the frontiers of outer space, risking their lives in harsh environments to unearth rare discoveries and unlock the mysteries of the universe. On this adventure, players can work together to build custom bases above or below ground, create vehicles to explore a vast solar system, and use terrain to create anything they can imagine. A player’s creativity and ingenuity are the key to seeking out and thriving while on exciting planetary adventures.… Expand"
  },
  {
    "name": "LEGO Marvel's Avengers",
    "details_link": "https://www.metacritic.com/game/xbox-one/lego-marvels-avengers",
    "publisher": "Warner Bros. Interactive Entertainment",
    "release_date": "Jan 26 2016",
    "developers": [
      "TT Games"
    ],
    "platforms": [
      "3DS",
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "PlayStation Vita",
      "Wii U",
      "Xbox 360",
      "Xbox One"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action Adventure",
      "General"
    ],
    "meta_score": 71,
    "users_score": 6.2,
    "image": "https://static.metacritic.com/images/products/games/6/daa87bb6d61223c71ac6547d0df4f844-98.jpg",
    "descriptions": "Avengers Assemble!  Experience the first console videogame featuring characters and storylines from the blockbuster film Marvel’s The Avengers and the much anticipated sequel Marvel’s Avengers: Age of Ultron, and more. Play as the most powerful Super Heroes in their quest to save humanity."
  },
  {
    "name": "Steep",
    "details_link": "https://www.metacritic.com/game/playstation-4/steep",
    "publisher": "Ubisoft",
    "release_date": "Dec  2 2016",
    "developers": [
      "Ubisoft Annecy"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "Up to 4 ",
    "genres": [
      "Sports",
      "Individual",
      "Ski / Snowboard"
    ],
    "meta_score": 71,
    "users_score": 6.4,
    "image": "https://static.metacritic.com/images/products/games/1/ff5998616b703034b715dc95428b5c03-98.jpg",
    "descriptions": "In Steep, players can use the innovative trail feature to relive their most inspiring rides and trailblazing achievements, and share them on social networks with friends. Along with sharing ride replays, players can also use this feature to challenge friends to outrace them on a shared path,In Steep, players can use the innovative trail feature to relive their most inspiring rides and trailblazing achievements, and share them on social networks with friends. Along with sharing ride replays, players can also use this feature to challenge friends to outrace them on a shared path, create epic stunts or set out to discover the massive mountain playground.… Expand"
  },
  {
    "name": "Amnesia: Memories",
    "details_link": "https://www.metacritic.com/game/switch/amnesia-memories",
    "publisher": "Idea Factory",
    "release_date": "Sep 20 2022",
    "developers": [
      "Idea Factory"
    ],
    "platforms": [
      "iPhone/iPad",
      "PC",
      "PlayStation Vita",
      "Switch"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Adventure",
      "Visual Novel"
    ],
    "meta_score": 71,
    "users_score": 0.0,
    "image": "https://static.metacritic.com/images/products/games/7/0a7c6fe5582a1958c2b070137c885ec9-98.jpg",
    "descriptions": "On the 1st of August, you awake as the Heroine, with previous memories of who you are somehow snatched away from you. In your confusion, a mysterious spirit named Orion appears to help you regain your memories. Youll explore your own world as a complete stranger, trying to understand whatOn the 1st of August, you awake as the Heroine, with previous memories of who you are somehow snatched away from you. In your confusion, a mysterious spirit named Orion appears to help you regain your memories. Youll explore your own world as a complete stranger, trying to understand what was once familiar all while hiding your condition from the five men close to you. Because, as Orion warns, you may jeopardize any chance of recovering your memories if anyone finds out. Its now up to you recover the past to rewrite your future love story!… Expand"
  },
  {
    "name": "God's Trigger",
    "details_link": "https://www.metacritic.com/game/playstation-4/gods-trigger",
    "publisher": "Techland",
    "release_date": "Apr 18 2019",
    "developers": [
      "Techland",
      "ONE MORE LEVEL"
    ],
    "platforms": [
      "PC",
      "Xbox One",
      "PlayStation 4"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Action",
      "Action Adventure",
      "Shooter",
      "Linear",
      "Shoot-'Em-Up",
      "Top-Down"
    ],
    "meta_score": 71,
    "users_score": 7.4,
    "image": "https://static.metacritic.com/images/products/games/4/46c7917edc6bddaad6f974920f73a0de-98.jpg",
    "descriptions": "Slay enemies with speed and precision in an over-the-top show of blood and explosions. Play solo or with others, make split-second decisions, dodge bullets, and use weapons and abilities to inflict violence in the most graphic way possible. When an Angel and a Demon team up to kill their waySlay enemies with speed and precision in an over-the-top show of blood and explosions. Play solo or with others, make split-second decisions, dodge bullets, and use weapons and abilities to inflict violence in the most graphic way possible. When an Angel and a Demon team up to kill their way into Heaven and stop the apocalypse, bullets will fly and blood will be shed. … Expand"
  },
  {
    "name": "Tower of Guns",
    "details_link": "https://www.metacritic.com/game/xbox-one/tower-of-guns",
    "publisher": "Grip Games",
    "release_date": "Apr 10 2015",
    "developers": [
      "Terrible Posture Games"
    ],
    "platforms": [
      "PC",
      "PlayStation 3",
      "PlayStation 4",
      "Xbox One"
    ],
    "genres": [
      "Sci-Fi",
      "Action",
      "Shooter",
      "First-Person",
      "Arcade"
    ],
    "meta_score": 71,
    "users_score": 6.1,
    "image": "https://static.metacritic.com/images/products/games/6/c432113bcaf9373db666df2f6e272af7-98.jpg",
    "descriptions": "Tower of Guns is a first-person shooter for gamers who simply want to arm themselves with the biggest guns imaginable, dispatching a whole array of enemies and perils in a tsunami of bullets, battle massive bosses, upgrade abilities and modify gear to make themselves the ultimate force.Tower of Guns is a first-person shooter for gamers who simply want to arm themselves with the biggest guns imaginable, dispatching a whole array of enemies and perils in a tsunami of bullets, battle massive bosses, upgrade abilities and modify gear to make themselves the ultimate force. Whenever the gamer dies, she returns to the beginning of the challenge, only stronger and better-equipped than before, ready to face varying level layouts and enemies, keeping the action fresh and challenging.… Expand"
  },
  {
    "name": "Nanostray",
    "details_link": "https://www.metacritic.com/game/ds/nanostray",
    "publisher": "Majesco Games",
    "release_date": "Jul 19 2005",
    "developers": [
      "Shin'en"
    ],
    "platforms": "DS",
    "num_players": "1-2 ",
    "genres": [
      "Action",
      "Shooter",
      "Shooter",
      "Scrolling",
      "Scrolling",
      "Shoot-'Em-Up",
      "Vertical"
    ],
    "meta_score": 71,
    "users_score": 7.7,
    "image": "https://static.metacritic.com/images/products/games/4/f4a838c91db38bf8e20f77d8afb6b512-98.jpg",
    "descriptions": "You slowly come back to life in your spacecraft. It feels like you were unconscious only for seconds. Faded impressions of pain and humiliation dominate your thoughts. Instinctively, you look up at your console; it’s still indicating a destination. Upgradeable weapons and sub-weapons,You slowly come back to life in your spacecraft. It feels like you were unconscious only for seconds. Faded impressions of pain and humiliation dominate your thoughts. Instinctively, you look up at your console; it’s still indicating a destination. Upgradeable weapons and sub-weapons, boasting tons of fire power to decimate your enemies. Touch screen features such as boss scanning, on-the-fly weapon management, live radar and hyperspace controls. 10+ stages to conquer; battle through environments like subterranean minefields, arctic mountains and hell-like lava fields.  Unlockable features and game modes add re-playability once players complete their campaign. 2-player co-op and head-to-head wireless functionality. Online ranking system via www.nanostray.com allows players to post their high scores and compete against best in the world. [Majesco]… Expand"
  },
  {
    "name": "DarkStar One",
    "details_link": "https://www.metacritic.com/game/pc/darkstar-one",
    "publisher": "cdv Software",
    "release_date": "Aug 14 2006",
    "developers": [
      "Ascaron Entertainment GmbH",
      "Ascaron Entertainment"
    ],
    "platforms": [
      "Xbox 360",
      "PC"
    ],
    "num_players": "No Online Multiplayer",
    "genres": [
      "Simulation",
      "Sci-Fi",
      "Space",
      "Small Spaceship",
      "Small Spaceship",
      "Combat"
    ],
    "meta_score": 71,
    "users_score": 7.1,
    "image": "https://static.metacritic.com/images/products/games/2/e422d306890d26e4155677d9360c8b3f-98.jpg",
    "descriptions": "DarkStar One is an open-ended action/adventure title set in a huge universe populated by a variety of unique alien races. Players will take on the role of an intrepid young adventurer, Kayron Jarvis, as he explores space, upgrading and customizing his ship – the DarkStar One. The game'sDarkStar One is an open-ended action/adventure title set in a huge universe populated by a variety of unique alien races. Players will take on the role of an intrepid young adventurer, Kayron Jarvis, as he explores space, upgrading and customizing his ship – the DarkStar One. The game's story, written by renowned German Fantasy and Science Fiction author Claudia Kern, will immerse players in a tale of action and intrigue as Kayron searches for answers surrounding the death of his father. Players can take a number of different paths and approaches to earn money and upgrades as they solve the mystery of the death of Kayron's father. One may play as trader, mercenary, smuggler, pirate or a combination thereof, customizing tactics to suit individual playing styles. A fully customizable and upgradeable ship – the DarkStar One. Players can create a fast attack boat, heavy cruiser or other combined style of ship from parts purchased or captured from enemies. More than 200 weapons, shields and equipment upgrades -- including rockets, torpedoes and mines, each featuring a special tactical or trade benefit. [CDV Software]… Expand"
  }
]