[{"name": "Marvel's Guardians of the Galaxy - Episode 4: Who Needs You", "details_link": "https://www.metacritic.com/game/pc/marvels-guardians-of-the-galaxy---episode-4-who-needs-you", "publisher": "Telltale Games", "release_date": "Oct 10 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Adventure", "General", "3D", "Third-Person"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "In the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-partIn the wake of an epic battle, the Guardians discover an artifact of unspeakable power. Each of the Guardians has a reason to desire this relic, as does a ruthless enemy who will stop at nothing to tear it from their hands. From Earth to the Milano to Knowhere and beyond, this five-part episodic series puts you in the rocket-powered boots of Star-Lord in an original Guardians adventure.… Expand"}, {"name": "Unbox: Newbie's Adventure", "details_link": "https://www.metacritic.com/game/xbox-one/unbox-newbies-adventure", "publisher": "Merge Games", "release_date": "Jul 26 2017", "developers": ["Merge Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One"], "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/2/004203bd839e5aa153020499235c3dc0-98.jpg", "descriptions": "Unbox is a 90s style 3D platformer about the ultimate postal service, self-delivering cardboard boxes! Unbox has giant worlds full of challenges, collectibles and boxy boss battles!"}, {"name": "The Simpsons Game", "details_link": "https://www.metacritic.com/game/playstation-3/the-simpsons-game", "publisher": "EA Games", "release_date": "Oct 30 2007", "developers": ["EA Redwood Shores"], "platforms": ["PlayStation 2", "Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Platformer", "3D", "3D"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/5/1a6c98f2f5d6b29c72060ff33031e03a-98.jpg", "descriptions": "The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart,The Simpsons Game features a hilarious, sprawling, and mind-busting storyline crafted by the TV show's Emmy Award-winning writers. The action-comedy also features the full cast of voice actors from the TV show who reprise their roles for the game. In The Simpsons Game, Homer, Marge, Bart, and Lisa use exciting, all-new powers to save the world from rising chaos. To help the Simpsons, gamers at home must journey through all of Springfield (as well as vast worlds beyond!), vanquish an amazing array of villains, and fight their way through parodies of popular games. [Electronic Arts]… Expand"}, {"name": "The Elder Scrolls Online", "details_link": "https://www.metacritic.com/game/pc/the-elder-scrolls-online", "publisher": "Bethesda Softworks", "release_date": "Apr  4 2014", "developers": ["ZeniMax Media"], "platforms": ["Stadia", "PC"], "num_players": "Massively Multiplayer", "genres": ["First-Person", "Role-Playing", "First-Person", "Massively Multiplayer Online", "Massively Multiplayer", "Fantasy"], "meta_score": 71, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/f61ace508506554b4103acb7338c9fa8-98.jpg", "descriptions": "Experience this epic adventure on your own or together with your friends, guild mates, and thousands of alliance members. Explore dangerous caves and dungeons, embark upon adventurous quests across Tamriel, and engage in massive player versus player battles, where the victors reap the spoils of war."}, {"name": "Kingdoms and Castles", "details_link": "https://www.metacritic.com/game/pc/kingdoms-and-castles", "publisher": "Lion Shield, LLC", "release_date": "Jul 20 2017", "developers": ["Lion Shield", "LLC"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/0/c7fafa9ae751855ff769559041d2d6fa-98.jpg", "descriptions": "Kingdoms and Castles is a game about growing a kingdom from a tiny hamlet to a sprawling city and imposing castle."}, {"name": "Snake Pass", "details_link": "https://www.metacritic.com/game/pc/snake-pass", "publisher": "Sumo Digital", "release_date": "Mar 28 2017", "developers": ["Sumo Digital"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Puzzle", "Action", "General"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/8/c246bc7c7247836e3726bf01f9efc067-98.jpg", "descriptions": "Slither, coil and climb your way to the top of Haven Tor in this one of a kind physics based, puzzle platform adventure from award winning independent studio Sumo Digital!"}, {"name": "FlatOut", "details_link": "https://www.metacritic.com/game/xbox/flatout", "publisher": "Empire Interactive", "release_date": "Jul 12 2005", "developers": ["Bugbear"], "platforms": "Xbox", "num_players": "8  Online", "genres": ["Driving", "Demolition Derby"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/5/72998be05b077747108ac4a9fbff72ab-98.jpg", "descriptions": "Get ready to race one of 16 upgradeable cars on 45 challenging tracks. Each environment in FlatOut is fully destructible, so you'll see all the damage you cause in broken fences, free-rolling trees, and mangled car parts; not to mention your own vehicle. A championship mode lets you battleGet ready to race one of 16 upgradeable cars on 45 challenging tracks. Each environment in FlatOut is fully destructible, so you'll see all the damage you cause in broken fences, free-rolling trees, and mangled car parts; not to mention your own vehicle. A championship mode lets you battle through a wide variety of races, minigames, and destruction arenas. The game also features online and multiplayer modes, which let you challenge your close friends or the best racers in the world.… Expand"}, {"name": "Rad", "details_link": "https://www.metacritic.com/game/pc/rad", "publisher": "Bandai Namco Games", "release_date": "Aug 19 2019", "developers": ["Double Fine Productions"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Action Adventure", "General"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/3/ae5eef0a86b2e8d01159e259910e1815-98.jpg", "descriptions": "RAD is a 3D action rogue-like set in a post-post-apocalyptic world, where humanity has faced armageddon not once, but twice."}, {"name": "Guitar Hero: Smash Hits", "details_link": "https://www.metacritic.com/game/xbox-360/guitar-hero-smash-hits", "publisher": "Activision", "release_date": "Jun 16 2009", "developers": ["Beenox"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 8 ", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/5/40f1a332b45d4c228ab35d1e0f8cb0e8-98.jpg", "descriptions": "Guitar Hero Smash Hits takes the most exciting, recognizable and fun to play music from genre-defining titles Guitar Hero, Guitar Hero II, Guitar Hero Encore: Rocks the 80s and Guitar Hero III: Legends of Rock, which were previously available for guitar-only in-game play, and delivers themGuitar Hero Smash Hits takes the most exciting, recognizable and fun to play music from genre-defining titles Guitar Hero, Guitar Hero II, Guitar Hero Encore: Rocks the 80s and Guitar Hero III: Legends of Rock, which were previously available for guitar-only in-game play, and delivers them as a compelling and dynamic full band experience. Featuring 48 master recordings, Guitar Hero Smash Hits delivers exciting online and offline gameplay modes including Band Career and 8-player \"Battle of the Bands,: which allows two full bands to compete head-to-head online. Players' rock n' roll fantasies turn to realities as they create their rocker, compose original music and share it with the world through the innovative Music Studio, GHTunesSM and robust Rock Star Creator gameplay modes first introduced in Guitar Hero World Tour. The tracklist includes:  Killer Queen (Queen), I Love Rock N Roll (Joan Jett and The Blackhearts), Bark At The Moon (Ozzy), Them Bones (Alice in Chains), Killing in the Name (Rage Against The Machine), Message In A Bottle (The Police), Carry On My Wayward Son (Kansas) Free Bird (Lynyrd Skynyrd), I Wanna Rock (Twisted Sister), Nothin But A Good Time (Poison), Barracuda (Heart), Through the Fire and Flames (DragonForce). [Activision]… Expand"}, {"name": "Minecraft: Story Mode Season Two - Episode 1: Hero in Residence", "details_link": "https://www.metacritic.com/game/pc/minecraft-story-mode-season-two---episode-1-hero-in-residence", "publisher": "Telltale Games", "release_date": "Jul 11 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Adventure", "Point-and-Click"], "meta_score": 71, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/98w-game.jpg", "descriptions": "Now that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more… complicated. With more responsibilities and less time for adventure, old friendships have started to fade — at least until Jesse’s hand getsNow that Jesse and the gang have vanquished the Wither Storm, saved the world, and become totally super famous heroes, life has gotten a bit more… complicated. With more responsibilities and less time for adventure, old friendships have started to fade — at least until Jesse’s hand gets stuck in a creepy gauntlet that belongs to an ancient underwater temple.… Expand"}, {"name": "Ixion", "details_link": "https://www.metacritic.com/game/pc/ixion", "publisher": "Kasedo Games", "release_date": "Dec  7 2022", "developers": ["Bulwark Studios"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/8/4ff9629849abd1c331ea349026007fb0-98.jpg", "descriptions": "IXION combines city building, survival elements and exploration, into a thrilling space opera as you explore the stars. Propelled onwards through a perilous journey, you are the Administrator of the Tiqqun space station, charged with finding a new home for humanity.Keeping the stationIXION combines city building, survival elements and exploration, into a thrilling space opera as you explore the stars. Propelled onwards through a perilous journey, you are the Administrator of the Tiqqun space station, charged with finding a new home for humanity.Keeping the station sound and flying will require a deft hand and strategic thinking, as you are constantly pulled between maintaining hull integrity, bringing in new resources and managing power consumption.What choices will you make when confronted with impending disaster? What will you discover out there in the dark?… Expand"}, {"name": "TouchMaster", "details_link": "https://www.metacritic.com/game/ds/touchmaster", "publisher": "Midway", "release_date": "Jun 25 2007", "developers": ["Midway Studios - San Diego"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "General"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/b5581eff419bc8e60bd508d73d43d7f5-98.jpg", "descriptions": "The wide variety of highly interactive mini-games made Midway's Touchmaster a favorite in bars and arcades across the country are will now be available whenever, wherever with Touchmaster DS. The game is a natural fit for the touchscreen and stylus of Nintendo DS, and is perfect for a quickThe wide variety of highly interactive mini-games made Midway's Touchmaster a favorite in bars and arcades across the country are will now be available whenever, wherever with Touchmaster DS. The game is a natural fit for the touchscreen and stylus of Nintendo DS, and is perfect for a quick gameplay session. There's something for everyone to choose from, with a wide variety of 23 Midway's classic Touchmaster games, including Trivia, Solitaire, Gem Slide and Mah Jongg. With the Nintendo DS Wi-Fi connection, players can connect to the Midway Tournament Network for high scores, tournaments and daily rankings. [Midway]… Expand"}, {"name": "Warhammer 40,000: Gladius - Relics of War", "details_link": "https://www.metacritic.com/game/pc/warhammer-40000-gladius---relics-of-war", "publisher": "Slitherine", "release_date": "Jul 12 2018", "developers": ["Proxy Studios"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/58285d91f4cfdac3e86306db6b1514a8-98.jpg", "descriptions": "Warhammer 40,000: Gladius – Relics of War brings you to a world of terror and violence. Four factions will engage in a brutal war for dominance over the planet’s resources. In the first 4X turn-based strategy game set in Warhammer 40,000 you will lead one of four unique factions."}, {"name": "Cars", "details_link": "https://www.metacritic.com/game/playstation-2/cars", "publisher": "THQ", "release_date": "Jun  6 2006", "developers": ["Rainbow Studios"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 71, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/4/2a6914814f0ef7d21116025e71294ba5-98.jpg", "descriptions": "Race to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. The game is a story-based racingRace to the finish line as you live all the fun and excitement of the Walt Disney Pictures presentation of a Pixar Animation Studios film, \"Cars.\" Play as all your favorite characters as you help Lightning McQueen capture the coveted Piston Cup Championship. The game is a story-based racing adventure game that relives all of the key moments of the movie. It features more than 10 playable characters from the film and an open world environment with more than 50 races. [THQ]… Expand"}, {"name": "Aragami", "details_link": "https://www.metacritic.com/game/playstation-4/aragami", "publisher": "Maximum Games", "release_date": "Oct 10 2016", "developers": ["Lince Works"], "platforms": ["PC", "PlayStation 4"], "num_players": "2 ", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/90f18c7ace549dee7e5f7708473149cd-98.jpg", "descriptions": "Aragami is a stealth game in which you play an undead assassin with the power to control the shadows. The darkness is your ally and the source of your strength, letting you teleport instantly to any other shadow, create new areas of darkness to stay invisible, materialize physical weaponsAragami is a stealth game in which you play an undead assassin with the power to control the shadows. The darkness is your ally and the source of your strength, letting you teleport instantly to any other shadow, create new areas of darkness to stay invisible, materialize physical weapons and traps from thin air, or even summon a shadow dragon to decapitate your target.… Expand"}, {"name": "Grand Slam Tennis 2", "details_link": "https://www.metacritic.com/game/xbox-360/grand-slam-tennis-2", "publisher": "EA Sports", "release_date": "Feb 14 2012", "developers": ["EA Sports"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Sports", "Traditional", "Individual", "Tennis", "Tennis"], "meta_score": 71, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/4/6c608b31778e1b6148025d30cd3e88b9-98.jpg", "descriptions": "EA Sports' tennis sim makes its high-definition debut with a roster of 25 players and all four Grand Slam Championships next year."}, {"name": "Cars", "details_link": "https://www.metacritic.com/game/gamecube/cars", "publisher": "THQ", "release_date": "Jun  6 2006", "developers": ["Rainbow Studios"], "platforms": "GameCube", "num_players": "1-2 ", "genres": ["Driving", "Mission-based"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/5/aa78f151927ac6b0541c3c0818cba803-98.jpg", "descriptions": "Based on the PIXAR film of the same name, Cars has you playing as characters from the movie as you help Lightning McQueen capture the coveted Piston Cup Championship."}, {"name": "World Championship Poker 2: Featuring Howard Lederer", "details_link": "https://www.metacritic.com/game/xbox/world-championship-poker-2-featuring-howard-lederer", "publisher": "Crave", "release_date": "Nov  3 2005", "developers": ["Crave"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "8  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/47a165c85967d66eecb092b645e7f3c4-98.jpg", "descriptions": "WCP 2 features Howard Lederer, Greg Raymer, Clonie Gowen, Amir Vahidi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke. World Championship Poker 2 features a much more detailed one player game, where you now have to work your way up the ranks, starting in your mom's basement.WCP 2 features Howard Lederer, Greg Raymer, Clonie Gowen, Amir Vahidi, Paul Darden, Robert Williamson III, Matt Savage, and Annie Duke. World Championship Poker 2 features a much more detailed one player game, where you now have to work your way up the ranks, starting in your mom's basement. Once you start winning and accumulating money, you can spend your winnings on increasingly better pads, and furnishings. Hit a losing streak, and you may have to hock your stuff to stay in the game. 14 types of poker are featured, including Texas Hold'em, Five Card Draw, Seven Card Stud and Pineapple.… Expand"}, {"name": "BloodRayne 2", "details_link": "https://www.metacritic.com/game/xbox/bloodrayne-2", "publisher": "Majesco Games", "release_date": "Oct 12 2004", "developers": ["Terminal Reality"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "Shooter", "Third-Person", "Fantasy"], "meta_score": 71, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/9/fcf620275bfb0817ddd19b05609304f4-98.jpg", "descriptions": "Reprise the role of BloodRayne, a dhampir born from the unnatural union of vampire and human. In BloodRayne 2, you can perform new acrobatic actions on poles and rails, fighting combos, and 12 finishing moves. The more creative your kills are, the more you can upgrade your weapons andReprise the role of BloodRayne, a dhampir born from the unnatural union of vampire and human. In BloodRayne 2, you can perform new acrobatic actions on poles and rails, fighting combos, and 12 finishing moves. The more creative your kills are, the more you can upgrade your weapons and abilities. Fill the Bloodlust meter to activate Blood Rage for powerful attacks. Master your vampire powers to stop your evil siblings from creating a new era of vampire supremacy where humans are mere cattle for the bloodthirsty predators that hunt them. … Expand"}, {"name": "Street Fighter X Mega Man", "details_link": "https://www.metacritic.com/game/pc/street-fighter-x-mega-man", "publisher": "Capcom", "release_date": "Dec 17 2012", "developers": ["Capcom"], "platforms": "PC", "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 71, "users_score": 8.6, "image": "https://static.metacritic.com/images/products/games/5/43d1a9845793d02391ada72bf5c4ad66-98.jpg", "descriptions": "Street Fighter X Mega Man is an 8-bit crossover game that stars the Blue Bomber and a slew of retro-ized SF mainstays acting as stand-in Robot Masters."}, {"name": "Ontamarama", "details_link": "https://www.metacritic.com/game/ds/ontamarama", "publisher": "Atlus", "release_date": "Nov  6 2007", "developers": ["Noise Factory"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Miscellaneous", "Rhythm", "Music", "Music"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/23faed70e9fb2610eba2d88c7a3b83f1-98.jpg", "descriptions": "Making full use of the Nintendo DS dual screens, touch functionality, and microphone, Ontamarama provides an entertaining level of challenge for novice players, while offering challenging play modes for advanced gamers. Fast reflexes and a keen sense of rhythm are the keys to success in thisMaking full use of the Nintendo DS dual screens, touch functionality, and microphone, Ontamarama provides an entertaining level of challenge for novice players, while offering challenging play modes for advanced gamers. Fast reflexes and a keen sense of rhythm are the keys to success in this frantic, fun, and addictive music-based game. On a peaceful tropical island, Ontama roam free. These gentle sound spirits, when properly conducted, offer the people of the land a beautiful and enchanting symphony. Wishing to rob the inhabitants of this joy, an evil demon begins to control the natives into capturing the Ontama. Two aspiring “Ontamaestros”, Beat and Rest, discover the plot and decide to foil the evil demon’s scheme by challenging the villagers under the demon’s control in order to release the trapped Ontama. [Atlus USA]… Expand"}, {"name": "Tom Clancy's Ghost Recon: Future Soldier", "details_link": "https://www.metacritic.com/game/pc/tom-clancys-ghost-recon-future-soldier", "publisher": "Ubisoft", "release_date": "Jun 26 2012", "developers": ["Ubisoft Paris"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Tactical", "Modern", "Modern"], "meta_score": 71, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/4/fb1a42283deeff09766753707d2bef2d-98.jpg", "descriptions": "Developed by the team behind Tom Clancy's Ghost Recon Advanced Warfighter and Tom Clancy's Ghost Recon Advanced Warfighter 2, the game features cutting-edge technology, prototype high-tech weaponry, and state-of-the-art single-player and multiplayer modes. Tom Clancy's Ghost Recon: FutureDeveloped by the team behind Tom Clancy's Ghost Recon Advanced Warfighter and Tom Clancy's Ghost Recon Advanced Warfighter 2, the game features cutting-edge technology, prototype high-tech weaponry, and state-of-the-art single-player and multiplayer modes. Tom Clancy's Ghost Recon: Future Soldier goes beyond the core Ghost Recon franchise and deliver a fresh gameplay experience.… Expand"}, {"name": "Madden NFL 08", "details_link": "https://www.metacritic.com/game/ds/madden-nfl-08", "publisher": "EA Sports", "release_date": "Aug 14 2007", "developers": ["Exient Entertainment"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "DS"], "num_players": "8  Online", "genres": ["Sports", "Traditional", "Team", "Football", "Sim", "Sim"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/8/ae60b5fb3b2a605121aa66d841219a0e-98.jpg", "descriptions": "All-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. Wi-Fi Enabled Multiplayer: Play head-to-headAll-New Read & React System: New player skill icons identify on-field strengths and weaknesses, providing an immediate read on what your opponent is giving you. Quickly react, create mismatches, and exploit opponent weaknesses before every play. Wi-Fi Enabled Multiplayer: Play head-to-head against a friend over Wi-Fi, including single-card mode that allows you to challenge anyone with a Nintendo DS, or play with up to seven other players in Wireless mode. An All-New Look and Feel: A redesigned Touch Screen menu system makes it easier to find and play all game modes. Use all-new Touch Screen controls to score touchdowns and kick field goals in Paper Football, an old-time classic made exclusively for the Nintendo DS. [EA Sports]… Expand"}, {"name": "GRIP: Combat Racing", "details_link": "https://www.metacritic.com/game/playstation-4/grip-combat-racing", "publisher": "Wired Productions", "release_date": "Nov  6 2018", "developers": ["Caged Element Inc."], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 10 ", "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 71, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/5/d14fc66d670ecd1521eb40599c960e84-98.jpg", "descriptions": "GRIP is a futuristic combat racer inspired by the Rollcage games from 1999/2000. Combine furious speed with intense action to create memorable racing moments."}, {"name": "Battlefield Hardline", "details_link": "https://www.metacritic.com/game/pc/battlefield-hardline", "publisher": "Electronic Arts", "release_date": "Mar 17 2015", "developers": ["Visceral Games"], "platforms": ["PlayStation 3", "PlayStation 4", "Xbox 360", "Xbox One", "PC"], "genres": ["Modern", "Action", "Shooter", "First-Person", "Tactical", "Arcade"], "meta_score": 71, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/0/1dae916aa5a851fb1e26b7d716d1e445-98.jpg", "descriptions": "Run your crew as detective Nick Mendoza in an episodic crime drama single player campaign or as cops and criminals in rapid Battlefield multi-player. You will be on one side of the thin blue line or the other. Assume control using new tactics to gather intelligence, obtain warrants andRun your crew as detective Nick Mendoza in an episodic crime drama single player campaign or as cops and criminals in rapid Battlefield multi-player. You will be on one side of the thin blue line or the other. Assume control using new tactics to gather intelligence, obtain warrants and takedown with non-lethal force to effectuate the arrests. Take the cash in a new battlefield playground. New maps and gadgets alter the way you play the game. Utilize grappling hooks and zip-lines to scale city buildings and fly across the city with the cheddar. No matter the strategy, teamwork is key to winning the turf war. Sate your need for speed in  new action-packed modes. Hop in exotic muscle cars, sleek crotch rockets or even give your whole crew a lift in transports or armored trucks.… Expand"}, {"name": "WWE SmackDown vs. Raw 2008", "details_link": "https://www.metacritic.com/game/playstation-2/wwe-smackdown-vs-raw-2008", "publisher": "THQ", "release_date": "Nov 13 2007", "developers": ["Yuke's"], "platforms": "PlayStation 2", "num_players": "1-6 ", "genres": ["Action", "Fighting", "Wrestling"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/25f3693ba93430f0932cab6af7ceb5be-98.jpg", "descriptions": "WWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and naturalWWE SmackDown! vs. Raw 2008 lets players take the fight into their own hands with the debut of Superstar Fighting Styles. The game features eight unique styles, each having its own strategy and exclusive attributes. A brand new Struggle Submission System gives players intuitive and natural control over their WWE Superstars by using the game's popular analog controls. Realism and strategy are at the forefront, as players now control the amount of pressure they apply to their opponents. In addition, WWE SmackDown! vs. Raw 2008 features a significant Extreme Championship Wrestling (ECW) presence, including a variety of Superstars, arenas and weapons. The game is also packed with significant updates requested by fans, including new rosters, more environmental hotspots, a combined Season and General Manager Mode experience, improved out-of-ring action, enhanced online community support and much more. [THQ]… Expand"}, {"name": "Unit 13", "details_link": "https://www.metacritic.com/game/playstation-vita/unit-13", "publisher": "SCEA", "release_date": "Mar  6 2012", "developers": ["Zipper Interactive"], "platforms": "PlayStation Vita", "num_players": "2 ", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/8/c65eb9ae929b574053f646dc2fa36420-98.jpg", "descriptions": "Jump into the action with Unit 13 and conquer 45 tactical missions as you help take down global terror networks and prove your place in the military elite. With the precision of the Vita's dual analog sticks, unique touch interface, Wifi connectivity for fast action and 2-player co-op, andJump into the action with Unit 13 and conquer 45 tactical missions as you help take down global terror networks and prove your place in the military elite. With the precision of the Vita's dual analog sticks, unique touch interface, Wifi connectivity for fast action and 2-player co-op, and 3G compatibility for instant social updates and daily challenges, Unit 13 promises to be the perfect on-the-go action shooter. [Sony]… Expand"}, {"name": "Scribblenauts Unmasked: A DC Comics Adventure", "details_link": "https://www.metacritic.com/game/wii-u/scribblenauts-unmasked-a-dc-comics-adventure", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Sep 24 2013", "developers": ["5TH Cell"], "platforms": ["3DS", "PC", "Wii U"], "num_players": "1-4 ", "genres": ["Puzzle", "Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/a9a094a151ae3624e2bdd2d34efeda27-98.jpg", "descriptions": "Challenge your imagination as you battle the mightiest villains in an exciting and action-filled adventure through GOTHAM CITY, METROPOLIS, ATLANTIS and other iconic locales from the DC Comics universe.  Enjoy endless replayability with new, dynamic puzzles that feature a different missionChallenge your imagination as you battle the mightiest villains in an exciting and action-filled adventure through GOTHAM CITY, METROPOLIS, ATLANTIS and other iconic locales from the DC Comics universe.  Enjoy endless replayability with new, dynamic puzzles that feature a different mission every time you play. \r\rBring out your inner super hero (or villain!) with the all-new Super Hero Creator by crafting completely original objects out of parts of existing DC Comics characters. Then assign unique properties to your creations and use them to solve puzzles, or share them online with friends - which they can use in game or further modify as they like.… Expand"}, {"name": "Nano Assault Neo", "details_link": "https://www.metacritic.com/game/wii-u/nano-assault-neo", "publisher": "Shin'en", "release_date": "Nov 18 2012", "developers": ["Shin'en"], "platforms": ["PlayStation 4", "Wii U"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Top-Down"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/33989b3a84e17f3945cf73b4cecb3790-98.jpg", "descriptions": "Nano Assault Neo is a fast paced shoot'em'up set in a microscopic world."}, {"name": "Samurai Warriors", "details_link": "https://www.metacritic.com/game/xbox/samurai-warriors", "publisher": "Koei", "release_date": "Jul 13 2004", "developers": ["Omega Force"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 71, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/4/1e4b9bffb7960a0f9d820f1727f527c1-98.jpg", "descriptions": "Set in feudal Japan, Samurai Warriors puts you in control of Yukimura Sanada as she leads an elite band of samurai and ninja through the hallowed battlefields of Okehazama, Kawanakajima, and inside the embattled walls of Osaka Castle. The epic tale unfolds as you come face-to-face withSet in feudal Japan, Samurai Warriors puts you in control of Yukimura Sanada as she leads an elite band of samurai and ninja through the hallowed battlefields of Okehazama, Kawanakajima, and inside the embattled walls of Osaka Castle. The epic tale unfolds as you come face-to-face with gun-toting troops, echelons of ninja, and deadly kunoichi--female ninja--in both historic and fictional battles. Samurai Warriors also features hundreds of different mini-missions, multiplayer support, and an Active Mission System that triggers distinct missions during every battle.… Expand"}, {"name": "Bloody Roar 3", "details_link": "https://www.metacritic.com/game/playstation-2/bloody-roar-3", "publisher": "Activision", "release_date": "Jun 25 2001", "developers": ["Eighting/Raizing"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 71, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/0/81d68b494faec35cd4745ed5a148ff2b-98.jpg", "descriptions": "Take control of one of 14 \"werebeasts\" (i.e., werewolf, wereleopard, werebunny, and the mythic weremole!) in this 3D fighter and attempt to punch, kick, and tear the living guts out of your opponents."}, {"name": "Farpoint", "details_link": "https://www.metacritic.com/game/playstation-4/farpoint", "publisher": "Sony Interactive Entertainment", "release_date": "May 16 2017", "developers": ["Impulse Gear"], "platforms": "PlayStation 4", "num_players": "2 ", "genres": ["Action", "Shooter", "First-Person", "Light Gun", "Arcade"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/1/6b53350852e5c3e1a974a730e8f8c0f7-98.jpg", "descriptions": "A PlayStation VR exclusive, Farpoint is an unnerving space adventure set on a hostile alien world. After crash landing you must fight to survive as you explore and uncover the planet’s secrets. Your only hope of escape is to constantly keep moving and discover the fate of your team. [Impulse Gear]"}, {"name": "SpongeBob SquarePants: The Cosmic Shake", "details_link": "https://www.metacritic.com/game/pc/spongebob-squarepants-the-cosmic-shake", "publisher": "THQ Nordic", "release_date": "Jan 31 2023", "developers": ["Purple Lamp Studios"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "General", "Platformer", "3D"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/4/05694642cd14a87e41e1d1783954ce08-98.jpg", "descriptions": "Wish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that'sWish-granting Mermaid's Tears in the hands of SpongeBob and Patrick... What could possibly go wrong? Sure, the very fabric holding the very universe very together could come very undone, opening up portals into Wishworlds full of knights, cowboys, pirates, and prehistoric snails. But that's nothing everyone's favorite sponge can't handle - with the right cosmic costume! Everybody do the Cosmic Shake!Features* Unlock classic and new platforming skills like the Fishhook Swing and Karate Kick* Don more than 30 F.U.N.tastic costumes like SnailBob and SpongeGar* Travel to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom* Experience all the buddy movie banter with SpongeBob's permanent companion Balloon-Patrick* Meet all your favorite Bikini Bottomites from the series, voiced by their original actors* Enjoy the in-game soundtrack featuring 101 songs from the series, including Sweet Victory… Expand"}, {"name": "Ultra Age", "details_link": "https://www.metacritic.com/game/switch/ultra-age", "publisher": "DANGEN Entertainment", "release_date": "Sep  9 2021", "developers": ["Visual Dart", "Next Stage"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "General"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/79be76dd65f8e64b1142cecde1258011-98.jpg", "descriptions": "Change Your Blade, Change Your Destiny. Ultra Age is a high-speed, sword-swinging action game set in the far future that follows the story of young warrior Age, who embarks on a mission to save humankind from extinction. Use your blades to cut through robotic and mutant foes, exploreChange Your Blade, Change Your Destiny. Ultra Age is a high-speed, sword-swinging action game set in the far future that follows the story of young warrior Age, who embarks on a mission to save humankind from extinction. Use your blades to cut through robotic and mutant foes, explore futuristic locales, and unravel a vast conspiracy concerning the fate of the planet. Far in the future, the resources of Earth have become insufficient, its ecosystem long ago changed irrevocably by a passing meteor. Humankind has divided into two: the people who have escaped Earth and relocated to the space colony, 'Orbital Arc,' and the others who have remained on Earth in a facility called ‘The Shelter.’\r Humanity vanished from Earth after civilians from The Shelter failed an experiment that was meant to be the last hope for humanity, while people from Orbital Arc sent expeditions to Earth in search of resources. Failing to find any signs of life, a young sword-wielding warrior named ‘Age’ falls down from orbit to Earth. Accompanied by his floating android, Helvis, he must find the indispensable key to the survival of humankind.\r -Unleash Combos with Blade-Changing Action-\rSlash through foes with a variety of blades in high-speed, stylish action! Change blades on the fly with powerful moves to create linkage and run devastating combos. Different attributes and varied actions call for unique strategy against different types of foes.\r -Narrow Gaps Using the Wire-\rLaunch the wire skill to pull smaller enemies toward you, or Quantum Warp to get instant access to larger foes! Use the wire to strategically overcome numerical inferiority, traverse gaps on land and quickly grab items.\r -Get the Edge with Skills-\rGather elements to enhance your blades, expand your skills, and learn new combos. Install modules and power gear to level up Age and increase your arsenal of blades to take down the toughest of enemies. Use Helvis to burst into Critical Rage, cast Healing Pocket to recover, or Time Shift to loot more items.\r -Experience a Post-Apocalyptic Earth-\rFollow Age on his journey in the year 3174. Experience cutscenes that tell the story of Age’s mission across futuristic mecha, forests and deserts developed with Unreal Engine. Encounter mysterious characters and overcome menacing bosses to uncover the story behind the fate of humankind.\r… Expand"}, {"name": "9 Monkeys of Shaolin", "details_link": "https://www.metacritic.com/game/pc/9-monkeys-of-shaolin", "publisher": "Buka Entertainment", "release_date": "Oct 16 2020", "developers": ["Sobaka"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "3D"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/3/ddf7b45d31e7522d7a8bfbf0cc790ac0-98.jpg", "descriptions": "9 Monkeys of Shaolin  marks a rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely9 Monkeys of Shaolin  marks a rebirth of the iconic beat 'em up genre in vein of old-school video games. If, as a kid you had hours of fun playing SNES or SEGA beat 'em up videogames crushing foes left and right then this new title from the creators of hardcore brawler REDEEMER is definitely for you. As a mere Chinese fisherman Wei Cheng you have to avenge the death of your friends and family slaughtered in a pirate raid at your peaceful village. Game protagonist is quite a tough nut to crack as he knows the basics of ancient martial arts only mastered by legendary Shaolin monks. Get your trusty battle staff ready for a challenging adventure in Medieval China and for merciless fights with hordes of various enemies. Action-packed battles, user friendly controls and incredible atmosphere of great kung-fu movies of 70s – all this makes 9 Monkeys of Shaolin a choice for every true fan of really hardcore brawlers.… Expand"}, {"name": "Willy Morgan and the Curse of Bone Town", "details_link": "https://www.metacritic.com/game/pc/willy-morgan-and-the-curse-of-bone-town", "publisher": "imaginarylab", "release_date": "Aug 11 2020", "developers": ["imaginarylab"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/427e04760313561b501332fb28e7c467-98.jpg", "descriptions": "A letter from 10 years ago, an intricate web of lies to unravel and a mystery to solve. Explore an unconventional town of pirates, dive into the past, collect items and look for clues to help Willy find out what happened to his father..."}, {"name": "Project Warlock", "details_link": "https://www.metacritic.com/game/switch/project-warlock", "publisher": "Crunching Koalas", "release_date": "Jun 11 2020", "developers": ["Buckshot Software"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/1/25bde156f0183f3d49b9c4ea273d02b2-98.jpg", "descriptions": "One man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hoursOne man and his guns. Become a mysterious Warlock who embarks onto a dangerous mission to eradicate all evil. Put your finger on the trigger and travel through time and space to wreak havoc like in the golden days of fast paced, adrenaline-pumping first person shooters, hooking you for hours of super fun carnage. Let’s rock and roll!… Expand"}, {"name": "SD Gundam G Generation Cross Rays", "details_link": "https://www.metacritic.com/game/pc/sd-gundam-g-generation-cross-rays", "publisher": "Bandai Namco Games", "release_date": "Nov 27 2019", "developers": ["Bandai Namco Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Strategy", "Turn-Based", "General", "Tactics"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/4/b27fc6afa3a6b52281960bb874dd00d9-98.jpg", "descriptions": "Beyond creation, four eras come together as one!Discover the latest entry in this iconic Tactical RPG series.Form your own team of SD Gundams and deploy for battle -- with units from from Mobile Suit Gundam Wing, SEED, 00, and Iron-Blooded Orphans!\n\nIntense battle scenes rendered withBeyond creation, four eras come together as one!Discover the latest entry in this iconic Tactical RPG series.Form your own team of SD Gundams and deploy for battle -- with units from from Mobile Suit Gundam Wing, SEED, 00, and Iron-Blooded Orphans!Intense battle scenes rendered with high-def 3D models and dynamic animations with character cut-ins.Featuring game design unique to the series with Development, Design, and Capture, as well as+ various other strategic elements. Form your own team and deploy for battle!… Expand"}, {"name": "Felix the Reaper", "details_link": "https://www.metacritic.com/game/pc/felix-the-reaper", "publisher": "Daedalic Entertainment", "release_date": "Oct 17 2019", "developers": ["Kong Orange"], "platforms": ["iPhone/iPad", "PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/1/1786b842378e1f0e0bc98dde85f43e75-98.jpg", "descriptions": "Felix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as a field reaper will enable him to one day meet her. Hence he’s taken the job of making sure people die — and taught himself to dance to impressFelix works at The Ministry of Death and is in love with Betty The Maiden from The Ministry of Life. He believes that going to the human world as a field reaper will enable him to one day meet her. Hence he’s taken the job of making sure people die — and taught himself to dance to impress the love of his life.… Expand"}, {"name": "Exception", "details_link": "https://www.metacritic.com/game/switch/exception", "publisher": "Traxmaster Software", "release_date": "Aug 13 2019", "developers": ["Traxmaster Software"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/ad0e1cb46f3fc3fea37fb5f3810a61d2-98.jpg", "descriptions": "Exception is a combat platformer set inside a computer system which has been hijacked by a totalitarian virus. Lead the resistance across stylistic transforming levels. When an old woman's computer is taken over by a virus bent on total annihilation, you assume control of an ordinaryException is a combat platformer set inside a computer system which has been hijacked by a totalitarian virus. Lead the resistance across stylistic transforming levels. When an old woman's computer is taken over by a virus bent on total annihilation, you assume control of an ordinary software program transformed into an elite combat machine.  Retake the system and build your character into a formidable instrument of retribution.… Expand"}, {"name": "Melbits World", "details_link": "https://www.metacritic.com/game/playstation-4/melbits-world", "publisher": "Sony Interactive Entertainment", "release_date": "Feb  5 2019", "developers": ["Melbot Studios"], "platforms": ["iPhone/iPad", "PC", "Switch", "PlayStation 4"], "num_players": "Up to 4 ", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/c2a6ce8c20365269f893dc71c8e85573-98.jpg", "descriptions": "The cooperative puzzle-platformer game that will equally\rcharm and challenge your friends and family. Communication and coordination are the key to success in the Melbits mission."}, {"name": "Thea: The Awakening", "details_link": "https://www.metacritic.com/game/switch/thea-the-awakening", "publisher": "Monster Couch", "release_date": "Feb  1 2019", "developers": ["MuHa Games"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "4X"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/5/f437b6a476c4ecd7fa9d135c9995acbe-98.jpg", "descriptions": "Thea: The Awakening is a turn-based strategic survival game steeped in Slavic myth and monstrosity set after an apocalyptic force known only as The Darkness has engulfed the world. There are Strigas and Baba Yagas aplenty, but there are no heroes, no monster slayers, and no great armiesThea: The Awakening is a turn-based strategic survival game steeped in Slavic myth and monstrosity set after an apocalyptic force known only as The Darkness has engulfed the world. There are Strigas and Baba Yagas aplenty, but there are no heroes, no monster slayers, and no great armies capable of banishing them. You have only a few hopeless and starving survivors who are desperately trying to stay alive. You are their last and only true hope. The game combines turn-based strategic gameplay with the tension and grit of a rogue-like, a captivating story you can uncover through a series of in-game events, and a unique combat system based on a complex card battle game. … Expand"}, {"name": "Happy Birthdays", "details_link": "https://www.metacritic.com/game/switch/happy-birthdays", "publisher": "NIS America", "release_date": "Jun  5 2018", "developers": ["Arc System Works"], "platforms": ["PC", "PlayStation 4", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Sandbox"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/6/e635f9238b35d8ec5044168dc0b4b72e-98.jpg", "descriptions": "From legendary creator Mr. Yasuhiro Wada (TOYBOX Inc.) comes Happy Birthdays: a sandbox game in which players create cube-shaped worlds that give rise to diverse and unique lifeforms. With careful experimentation, players can shape the geography and alter the temperature of the world toFrom legendary creator Mr. Yasuhiro Wada (TOYBOX Inc.) comes Happy Birthdays: a sandbox game in which players create cube-shaped worlds that give rise to diverse and unique lifeforms. With careful experimentation, players can shape the geography and alter the temperature of the world to create the conditions for life and witness the birth of an entire ecosystem.… Expand"}, {"name": "Swim Out", "details_link": "https://www.metacritic.com/game/switch/swim-out", "publisher": "Lozange Lab", "release_date": "Mar 20 2018", "developers": ["Lozange Lab"], "platforms": ["iPhone/iPad", "PC", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/308474e0d0e67be4f08b4ac34929be6a-98.jpg", "descriptions": "Dive into the relaxing and refreshing atmosphere of Swim Out, a strategic, turn-based puzzle game, that will transport you into a sunny day by the swimming pool, the river or the sea. Plan each of your strokes wisely and be sure to never cross any other swimmer's path if you want toDive into the relaxing and refreshing atmosphere of Swim Out, a strategic, turn-based puzzle game, that will transport you into a sunny day by the swimming pool, the river or the sea. Plan each of your strokes wisely and be sure to never cross any other swimmer's path if you want to peacefully enjoy the sea view on a cosy chaise-longue. Over 100 levels nestled in carefully crafted landscapes, soothed by the sound of seagulls, frogs or water splashes.7 chapters combining:* 12 different types of swimmers: each with their own way of moving around, ranging from the simple breaststroke swimmers to the more complex divers or cheeky water-bombing kids* 12 different objects to interact with: buoys, fins, water guns, you can even ride a kayak!* 6 disruptive environmental elements like waves, crabs or jellyfish that will give your brain a workout until you swim out!… Expand"}, {"name": "Bridge Constructor Portal", "details_link": "https://www.metacritic.com/game/switch/bridge-constructor-portal", "publisher": "Headup Games", "release_date": "Feb 28 2018", "developers": ["ClockStone Studio"], "platforms": ["iPhone/iPad", "PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Puzzle", "Action", "Virtual", "Career"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/8/c2b632b4336a4fb1550c3c865b486022-98.jpg", "descriptions": "Enter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 testEnter the Aperture Science Enrichment Center and experience Bridge Constructor Portal – the unique merging of the classic Portal and Bridge Constructor games. As a new employee in the Aperture Science test lab, it's your job to build bridges, ramps, slides, and other constructions in 60 test chambers and get the Bendies safely across the finish line in their vehicles. Make use of the many Portal gadgets, like portals, propulsion gel, repulsion gel, aerial faith plates, cubes, and more to bypass the sentry turrets, acid pools and laser barriers, solve switch puzzles, and make it through the test chambers unscathed. Let Ellen McLain, the original voice of GLaDOS, guide you through the tutorial, and learn all the tips and tricks that make a true Aperture Science employee. [Nintendo]… Expand"}, {"name": "Romancing SaGa 2", "details_link": "https://www.metacritic.com/game/playstation-4/romancing-saga-2", "publisher": "Square Enix", "release_date": "Dec 15 2017", "developers": ["SquareSoft", "Square Enix", "ArtePiazza"], "platforms": ["iPhone/iPad", "PC", "PlayStation Vita", "Switch", "Xbox One", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "Japanese-Style"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/6/967bedef345aeaddd396042266e57b49-98.jpg", "descriptions": "Sit upon the throne of the Varennes Empire and control several generations of rulers in a valiant battle against the Seven Heroes. A dynamic freeform scenario system — a hallmark of the million-selling SaGa RPG series — enables you to take command of a variety of protagonists along the lineSit upon the throne of the Varennes Empire and control several generations of rulers in a valiant battle against the Seven Heroes. A dynamic freeform scenario system — a hallmark of the million-selling SaGa RPG series — enables you to take command of a variety of protagonists along the line of imperial succession and experience the history of a nation as it grows and changes based on your actions.… Expand"}, {"name": "Never Stop Sneakin'", "details_link": "https://www.metacritic.com/game/switch/never-stop-sneakin", "publisher": "Humble Hearts", "release_date": "Dec 14 2017", "developers": ["Humble Hearts"], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/1/387ab889589e9daa9a2e8c89518e34a6-98.jpg", "descriptions": "Can you believe it? That madman, Amadeus Guildenstern, just traveled through time and kidnapped all the U.S. Presidents! Yes, all of them! Even the bad ones! If you're going to fix history, you'll need the help of the world's most elite stealth operatives: The Department of Sneakin'.Can you believe it? That madman, Amadeus Guildenstern, just traveled through time and kidnapped all the U.S. Presidents! Yes, all of them! Even the bad ones! If you're going to fix history, you'll need the help of the world's most elite stealth operatives: The Department of Sneakin'. Infiltrate the enemy base, avoid their patrols, and hack their systems to gain valuable intel. Build your Sneakin' HQ, and figure out how to stop Guildenstern's time-traveling scheme. Classic tactical sneakin' action, rendered with only the finest polygons. Unlock new characters, weapons, and perks to aid you in your mission. Fight incredible bosses, including the evil Dr. Acula (probably a vampire) and Vice President Helicopter (who is a helicopter). [Nintendo]… Expand"}, {"name": "Resident Evil 7: biohazard - Not a Hero", "details_link": "https://www.metacritic.com/game/playstation-4/resident-evil-7-biohazard---not-a-hero", "publisher": "Capcom", "release_date": "Dec 12 2017", "developers": ["Capcom"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "Survival"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/5/b24bad9355f59311555786558a99f874-98.jpg", "descriptions": "Chris Redfield returns in this free additional episode for all Resident Evil 7 players. Facing new enemies and cruel traps, Chris must use his well-honed skills in marksmanship and melee fighting as he attempts to secure his target and uncover the truth behind the Baker incident."}, {"name": "The Sexy Brutale", "details_link": "https://www.metacritic.com/game/switch/the-sexy-brutale", "publisher": "Tequila Works", "release_date": "Dec  7 2017", "developers": ["Cavalier Game Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General"], "meta_score": 71, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/6/f27f4e8f881560a9eb25813c624fd8e4-98.jpg", "descriptions": "The Marquis is renowned for three things: his annual masked balls, his eclectic taste in friends, and his grand casino mansion -- \"The Sexy Brutale\".But this year's party is very different. Something truly terrible has found its way into the heart of \"The Sexy Brutale\", turning the ballThe Marquis is renowned for three things: his annual masked balls, his eclectic taste in friends, and his grand casino mansion -- \"The Sexy Brutale\".But this year's party is very different. Something truly terrible has found its way into the heart of \"The Sexy Brutale\", turning the ball into a nightmare where the staff stalk and murder the guests with no hope of escape.And at the end of every day when the clocks strike midnight... the same day begins all over again.Discover the secrets of \"The Sexy Brutale\" casino mansion and its inhabitants as you relive the same mysterious and murderous masked ball over and over. The story is unfolding in real-time all around you -- what is happening to the guests? Who is behind it? Can you piece it all together and end the loop to save them, and save yourself?… Expand"}, {"name": "Batman: The Enemy Within - Episode 2: The Pact", "details_link": "https://www.metacritic.com/game/pc/batman-the-enemy-within---episode-2-the-pact", "publisher": "Telltale Games", "release_date": "Sep 26 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/f68c309adda2552253fea4a71eba18bb-98.jpg", "descriptions": "Harley Quinn, the standout character in the episode, exhibits a drastic shift in her power dynamic with Joker."}, {"name": "Aporia: Beyond The Valley", "details_link": "https://www.metacritic.com/game/pc/aporia-beyond-the-valley", "publisher": "Green Man Gaming Publishing", "release_date": "Jul 19 2017", "developers": ["Investigate North"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "3D", "First-Person"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/efaa28e7d306c30995efee4a6e85a418-98.jpg", "descriptions": "Aporia: Beyond The Valley is a first person adventure puzzle game, set in a beautifully realised world and with a story told without text or dialogue."}, {"name": "OVIVO", "details_link": "https://www.metacritic.com/game/pc/ovivo", "publisher": "IzHard", "release_date": "May 12 2017", "developers": ["IzHard"], "platforms": ["iPhone/iPad", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 71, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/f4b1841a5f6f469a7690a6376bdfb3b3-98.jpg", "descriptions": "OVIVO is a metaphoric game filled with illusions and hidden messages. In the world of OVIVO Black and White exist in harmony. Constantly intertwining and replacing each other they maintain balance. The main character named OVO created from these two halves of the world and it has the abilityOVIVO is a metaphoric game filled with illusions and hidden messages. In the world of OVIVO Black and White exist in harmony. Constantly intertwining and replacing each other they maintain balance. The main character named OVO created from these two halves of the world and it has the ability to switch between them. OVO travels through the metaphoric world, overcomes various dangers and collects mysterious symbols. These symbols help you to unravel the story of this world but how you interpret it is completely up to you.… Expand"}, {"name": "Little Inferno", "details_link": "https://www.metacritic.com/game/switch/little-inferno", "publisher": "Tomorrow Corporation", "release_date": "Mar 16 2017", "developers": ["Tomorrow Corporation"], "platforms": ["iPhone/iPad", "PC", "Wii U", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Puzzle", "Action"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/4bddab4bd12a2a596bdab96e5afa566b-98.jpg", "descriptions": "Congratulations on your new Little Inferno Entertainment Fireplace! Throw your toys into your fire, and play with them as they burn. Stay warm in there. It's getting cold outside. Burn flaming logs, screaming robots, credit cards, batteries, exploding fish, unstable nuclear devices, and tinyCongratulations on your new Little Inferno Entertainment Fireplace! Throw your toys into your fire, and play with them as they burn. Stay warm in there. It's getting cold outside. Burn flaming logs, screaming robots, credit cards, batteries, exploding fish, unstable nuclear devices, and tiny galaxies. An adventure that takes place almost entirely in front of a fireplace - about looking up up up out of the chimney, and the cold world just on the other side of the wall.… Expand"}, {"name": "A Normal Lost Phone", "details_link": "https://www.metacritic.com/game/pc/a-normal-lost-phone", "publisher": "Plug In Digital", "release_date": "Jan 26 2017", "developers": ["Accidental Queens"], "platforms": ["iPhone/iPad", "Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "General"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/3/12221dfddee9fd14be6d8900b28e6716-98.jpg", "descriptions": "A Normal Lost Phone is a game about exploring the intimacy of an unknown person whose phone was found by the player."}, {"name": "Fragments of Him", "details_link": "https://www.metacritic.com/game/xbox-one/fragments-of-him", "publisher": "Sassybot", "release_date": "Jun  1 2016", "developers": ["Sassybot"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Adventure", "Visual Novel"], "meta_score": 71, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/1/e6b1b3e1d612f687c334ecd712c2a106-98.jpg", "descriptions": "In Fragments of Him you experience the lives of four people connected by love and a tragic accident. You walk alongside Will on his last morning and discover the meaning of his final thoughts. With Mary, Will's grandmother, you learn about his childhood, their conflict, and how theyIn Fragments of Him you experience the lives of four people connected by love and a tragic accident. You walk alongside Will on his last morning and discover the meaning of his final thoughts. With Mary, Will's grandmother, you learn about his childhood, their conflict, and how they ultimately reconciled some of their differences. Sarah was Will's girlfriend and first love. She tells us how she found a deeper understanding of herself during their time together. And finally, Harry is Will's partner when the accident happens. Can Harry ever accept the loss?… Expand"}, {"name": "The Detail", "details_link": "https://www.metacritic.com/game/pc/the-detail", "publisher": "Rival Games Ltd", "release_date": "Apr 28 2016", "developers": ["Rival Games Ltd"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "Point-and-Click"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/4/4a89bab54fe4307be5bd647f8628c28c-98.jpg", "descriptions": "A crime noir adventure in a modern American city."}, {"name": "Tachyon Project", "details_link": "https://www.metacritic.com/game/playstation-4/tachyon-project", "publisher": "Eclipse Games", "release_date": "Jan 19 2016", "developers": ["Eclipse Games"], "platforms": ["PC", "PlayStation Vita", "Switch", "Wii U", "Xbox One", "PlayStation 4"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 71, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/8/7fe6e5cc6cfcd7cbbd4acd9830c09ae5-98.jpg", "descriptions": "Tachyon Project is an action packed dual-stick shooter driven by a story. Through the story mode you'll progressively unlock all the weapons, secondary weapons and perks available to configure your ship. You'll need them to face the increasingly hard enemies you'll find with over 30Tachyon Project is an action packed dual-stick shooter driven by a story. Through the story mode you'll progressively unlock all the weapons, secondary weapons and perks available to configure your ship. You'll need them to face the increasingly hard enemies you'll find with over 30 different types (including 4 bosses). In Tachyon Project you take control of Ada, a software program that has taken conscience and that was designed to hack into the most secure servers on Earth. After some rather misterious events, Ada is thrown out of the test server where it was living and out into the Internet, but when she tries to go back there she finds she's unable to. She'll then start a journey to uncover the truth behind what happened to her creators, which she considers her parents. In the process she'll find out that things were a bit more complex than she initially thought.… Expand"}, {"name": "Mamorukun Curse!", "details_link": "https://www.metacritic.com/game/playstation-3/mamorukun-curse!", "publisher": "UFO Interactive", "release_date": "Jul 16 2013", "developers": ["Gulti"], "platforms": "PlayStation 3", "genres": ["Action", "Shooter", "Shooter", "Scrolling", "Scrolling", "Shoot-'Em-Up", "Vertical"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/aeeae3969eade677d26ccac2d298de79-98.jpg", "descriptions": "Mamorukun Curse! is an action-packed top-down shooter that has players make use of the \"Curse Bullet\" mechanic to wipe away enemy bullets, curse enemies, or even curse yourself."}, {"name": "Ikachan", "details_link": "https://www.metacritic.com/game/3ds/ikachan", "publisher": "Nicalis", "release_date": "Jan 31 2013", "developers": ["Nicalis"], "platforms": "3DS", "genres": ["Action", "Role-Playing", "General", "Action RPG"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/21e2c2ab28e7f50259533599ebc8cde6-98.jpg", "descriptions": "You wake up in an underwater cave. Near the bottom of an enormous abyss, there's only one way out. Swim in a dark world under attack by frequent earthquakes and famine. This vast undersea kingdom is filled with both dangerous and hamless denizens. Its fearful inhabitants are led by aYou wake up in an underwater cave. Near the bottom of an enormous abyss, there's only one way out. Swim in a dark world under attack by frequent earthquakes and famine. This vast undersea kingdom is filled with both dangerous and hamless denizens. Its fearful inhabitants are led by a reluctant fish who has no answer to the impending disasters. Take to the sea and help your new friends flee their home and find a new one. Their fate rests with you, Ikachan. You must help them find a way out before it's too late. Use whatever tools you can and try to escape. Swim, Ikachan, swim!… Expand"}, {"name": "Retro City Rampage", "details_link": "https://www.metacritic.com/game/xbox-360/retro-city-rampage", "publisher": "Vblank Entertainment Inc.", "release_date": "Jan  2 2013", "developers": ["Vblank Entertainment Inc."], "platforms": ["PC", "PlayStation 3", "PlayStation Vita", "Xbox 360"], "genres": ["Action", "Action Adventure", "Adventure", "General", "3D", "Open-World", "Third-Person", "Modern"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/8/29fc4b536a2fdcdaf4246d606adab295-98.jpg", "descriptions": "YOU are THE PLAYER. Your open-world crime spree of INCREDIBLE CAR STEALING ACTION is suddenly ambushed by ”EVIL” GOOD GUYS. They will stop at nothing to protect the citizens of Theftropolis City from your RAMPAGE OF DOOM. Are YOU rad enough to defeat the ”EVIL” GOOD GUYS?\r \rRETRO CITYYOU are THE PLAYER. Your open-world crime spree of INCREDIBLE CAR STEALING ACTION is suddenly ambushed by ”EVIL” GOOD GUYS. They will stop at nothing to protect the citizens of Theftropolis City from your RAMPAGE OF DOOM. Are YOU rad enough to defeat the ”EVIL” GOOD GUYS?\r \rRETRO CITY RAMPAGE invites you to steal over 40 vehicles and outrun the law while mowing down your fellow citizens! Jump on pedestrians for coins, or use them for target practice with over 25 weapons and power-ups! WHOA!\r \rThis 8-bit nostalgic throwback comes loaded with story missions and arcade challenges (over 80 of 'em)! Explore the city or pop a cap in your friends' scores to educate them in the finer points of SUPER CRIME.… Expand"}, {"name": "Nike+ Kinect Training", "details_link": "https://www.metacritic.com/game/xbox-360/nike+-kinect-training", "publisher": "Microsoft Game Studios", "release_date": "Oct 30 2012", "developers": ["Nike", "Inc."], "platforms": "Xbox 360", "num_players": "No Online Multiplayer", "genres": ["Sports", "General", "General"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/5/48a723fcc6369013c8d1dea4c25675e6-98.jpg", "descriptions": "Whatever your goal, Nike+ Kinect Training promises to help you reach it with a workout program that evolves as you do. What will your moment be?"}, {"name": "Corpse Party", "details_link": "https://www.metacritic.com/game/psp/corpse-party", "publisher": "XSEED Games", "release_date": "Nov 22 2011", "developers": ["Team GrisGris"], "platforms": ["3DS", "iPhone/iPad", "PC", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "Adventure", "General", "Horror", "Horror", "Survival"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/45603bb77ff18c3ab088159483367457-98.jpg", "descriptions": "Corpse Party is an adventure game that uses hand-drawn 2D sprite and tile art to tell the story of a group of Kisaragi Academy High School students who are trapped in a haunted elementary school filled with the decaying corpses and tormented souls of countless children who’d mysteriouslyCorpse Party is an adventure game that uses hand-drawn 2D sprite and tile art to tell the story of a group of Kisaragi Academy High School students who are trapped in a haunted elementary school filled with the decaying corpses and tormented souls of countless children who’d mysteriously vanished from the Japanese countryside years, months or sometimes only days prior. Desperately trying to escape and survive, players will experience unnatural, unnerving and decidedly uncensored horrors through the eyes – and ears -- of these frightened teenaged victims. Detailed 2D sprite animations and art stills show the bloody and unsettling fates that await those who enter, and full Japanese-language voice-acting combines with 3D audio support to create a simulated surround sound experience when playing with headphones, offering players a delightfully uncomfortable level of immersion.… Expand"}, {"name": "Pipe Mania", "details_link": "https://www.metacritic.com/game/ds/pipe-mania", "publisher": "Empire Interactive", "release_date": "Sep 26 2008", "developers": ["Razorworks"], "platforms": ["iPhone/iPad", "PC", "PlayStation 2", "DS"], "num_players": "No Online Multiplayer", "genres": ["Miscellaneous", "Puzzle", "Action", "Puzzle", "General", "Puzzle", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/dd915314d7a7b3f6069094966b40b349-98.jpg", "descriptions": "Join alfonso junior and his sister fawcett in a race against time to save their paradise island. Home from pollution and cowboy plumbers. Pipe mania is a frenetically charged puzzle game that will challenge your mental skills to the maximum across intense, fast-paced levels. Beat the puzzlesJoin alfonso junior and his sister fawcett in a race against time to save their paradise island. Home from pollution and cowboy plumbers. Pipe mania is a frenetically charged puzzle game that will challenge your mental skills to the maximum across intense, fast-paced levels. Beat the puzzles set by the island residents and become a pipe mania puzzle master. 50+ levels across 4 game modes: world, arcade, bonus and the Updated classic pipe mania game. Enhanced visuals & a host of characters to help and hinder attacks & damage. New pieces, new play mechanics, multiple floozes. [Empire Interactive]… Expand"}, {"name": "Call of Juarez", "details_link": "https://www.metacritic.com/game/xbox-360/call-of-juarez", "publisher": "Ubisoft", "release_date": "Jun  7 2007", "developers": ["Techland"], "platforms": ["PC", "Xbox 360"], "num_players": "16  Online", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Historic", "Historic", "Arcade"], "meta_score": 71, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/12d9c0ea76ce447a6f970cb6a200d420-98.jpg", "descriptions": "Call of Juarez provides the only Western first-person shooter experience on Xbox 360. Call of Juarez captures the brutality and ruthlessness that turned the American Frontier into a theater of war. Players experience legendary Wild West action including duels at high noon, gruesome shootoutsCall of Juarez provides the only Western first-person shooter experience on Xbox 360. Call of Juarez captures the brutality and ruthlessness that turned the American Frontier into a theater of war. Players experience legendary Wild West action including duels at high noon, gruesome shootouts and barroom brawls. The intense multiplayer modes pit bands of money-hungry outlaws against one another through a variety of game options and different terrain. An authentic Wild West single-player campaign puts players into the world of both the hunter AND the hunted, each equipped with contrasting weaponry, styles and motives. The hunted, Billy Candle, is determined to prove he's not a nobody. But when his parents are murdered, Billy stands accused. Hot on his trail is his stepfather's brother, the hunter, Reverend Ray McCall, a legendary gunfighter who believes that the lord has chosen him to be Billy's judge, jury and executioner. [Ubisoft]… Expand"}, {"name": "MotoGP 4", "details_link": "https://www.metacritic.com/game/playstation-2/motogp-4", "publisher": "Namco Bandai Games America", "release_date": "Jun 20 2006", "developers": ["Namco Bandai Games"], "platforms": "PlayStation 2", "num_players": "8  Online", "genres": ["Driving", "Racing", "Motorcycle", "Street"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/875d72d76326f2ad0d69b375896d2805-98.jpg", "descriptions": "MotoGP4 continues the series's tradition of realism and speed with an advanced physics engine, authentic rider animations and multiple weather conditions for a truly intense racing experience. Players can take part in the thrills and drama of professional racing across all three engineMotoGP4 continues the series's tradition of realism and speed with an advanced physics engine, authentic rider animations and multiple weather conditions for a truly intense racing experience. Players can take part in the thrills and drama of professional racing across all three engine classes from the 2004 season, including MotoGP, 125cc and 250cc throughout 16 accurately recreated tracks from around the world. Boasting a larger selection of playable racing legends than ever before, \"MotoGP4\" lets players choose from greats such as Kevin Schwantz, Wayne Rainey, Mick Doohan, Wayne Gardner and the late Daijiro Kato. \"MotoGP4’s\" commitment to racing realism extends beyond the tarmac -- allowing players to conduct parts tests between races to upgrade the performance of their bikes. [Namco]… Expand"}, {"name": "Command & Conquer: The First Decade", "details_link": "https://www.metacritic.com/game/pc/command-conquer-the-first-decade", "publisher": "EA Games", "release_date": "Feb  7 2006", "developers": ["Various"], "platforms": "PC", "num_players": "8  Online", "genres": ["Miscellaneous", "Compilation", "Compilation"], "meta_score": 71, "users_score": 8.5, "image": "https://static.metacritic.com/images/products/games/5/3cad74d51e688aaaa2356727edac602b-98.jpg", "descriptions": "The title celebrates the 10th anniversary of this franchise and includes a dozen C&C games spanning over the last ten years plus a bonus DVD, which includes commemorative video features. With its explosive style of warfare, the C&C franchise has grown over the years to span multipleThe title celebrates the 10th anniversary of this franchise and includes a dozen C&C games spanning over the last ten years plus a bonus DVD, which includes commemorative video features. With its explosive style of warfare, the C&C franchise has grown over the years to span multiple fictional genres, including the science fiction Tiberium universe, the revisionist history of the Red Alert universe, and a twist on modern warfare with Command & Conquer Generals. The bonus DVD features a half-dozen exclusive video features including an interview with Louis Castle, who is also co-founder of Westwood Studios, the creator of the C&C franchise. As a special bonus, C&C fans will have the opportunity to be featured on the exclusive DVD. [Electronic Arts]… Expand"}, {"name": "Goblin Commander: Unleash the Horde", "details_link": "https://www.metacritic.com/game/gamecube/goblin-commander-unleash-the-horde", "publisher": "Jaleco Entertainment", "release_date": "Dec 16 2003", "developers": ["Jaleco Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Strategy", "Real-Time", "Fantasy"], "meta_score": 71, "users_score": 8.7, "image": "https://static.metacritic.com/images/products/games/2/d7244285b08ac4c6cd5c758d187f8f6e-98.jpg", "descriptions": "Goblin Commander: Unleash the Horde calls upon your skill and courage to destroy the enemy, pillage the enclaves, and scorch the earth. With a horde of specialized goblin warriors at your command, you can wage war in single-player and multiplayer modes. Design a custom army from over 25Goblin Commander: Unleash the Horde calls upon your skill and courage to destroy the enemy, pillage the enclaves, and scorch the earth. With a horde of specialized goblin warriors at your command, you can wage war in single-player and multiplayer modes. Design a custom army from over 25 different goblins with melee, ranged, elemental, acid, and magical combat specialties. You can even take direct control of giant titans, powerful turrets, and battle-ready vehicles to cause reckless mayhem across the lands.… Expand"}, {"name": "NBA Inside Drive 2004", "details_link": "https://www.metacritic.com/game/xbox/nba-inside-drive-2004", "publisher": "Microsoft Game Studios", "release_date": "Nov 18 2003", "developers": ["High Voltage Software"], "platforms": "Xbox", "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 71, "users_score": 8.2, "image": "https://static.metacritic.com/images/products/games/5/285990acc9143b5ddbaa613571365811-98.jpg", "descriptions": "NBA Inside Drive 2004, Microsoft's exclusive basketball game for the Xbox, lets you brush shoulders with some of the biggest NBA superstars on the court.  The game includes a wide selection of real-life ballers including Shaquille O'Neal, LeBron James, and Allen Iverson.  Now through XSNNBA Inside Drive 2004, Microsoft's exclusive basketball game for the Xbox, lets you brush shoulders with some of the biggest NBA superstars on the court.  The game includes a wide selection of real-life ballers including Shaquille O'Neal, LeBron James, and Allen Iverson.  Now through XSN Sports, you can easily organize teams, leagues, and schedules from a centralized Web site.  New \"jukes\" and post moves will keep the game dynamic, and a revamped defensive game shuts down high-scoring teams.  With thumpin' hip-hop beats, online play, and innovative commentary, NBA Inside Drive 2004 stays true to the game.… Expand"}, {"name": "NFL Blitz Pro", "details_link": "https://www.metacritic.com/game/xbox/nfl-blitz-pro", "publisher": "Midway", "release_date": "Nov  4 2003", "developers": ["Midway"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Football", "Arcade"], "meta_score": 71, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/6/e0b659d8d6c9125177d569b3fc32e607-98.jpg", "descriptions": "NFL Blitz Pro is an 11-on-11 licensed smash-mouth football videogame experience, delivering a new and sophisticated online feature set combined with its blend of lightning-fast, adrenaline-style gameplay.  NFL Blitz has been reinvented, without leaving behind the edginess of the previousNFL Blitz Pro is an 11-on-11 licensed smash-mouth football videogame experience, delivering a new and sophisticated online feature set combined with its blend of lightning-fast, adrenaline-style gameplay.  NFL Blitz has been reinvented, without leaving behind the edginess of the previous games in the series.  For the first time, NFL Blitz Pro will showcase authentic 11-on-11 gameplay with realistic rules, features, and online play.  New features also include a new Franchise mode, a reworked running game, and an improved AI.… Expand"}, {"name": "The Haunted Mansion", "details_link": "https://www.metacritic.com/game/xbox/the-haunted-mansion", "publisher": "TDK Mediactive", "release_date": "Oct 14 2003", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "Xbox"], "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/2/8e171e7ea1cdbf32c010de3589fa7cfe-98.jpg", "descriptions": "The Disneyland attraction is making a video game appearance in The Haunted Mansion.  In the famous house of wall-to-wall creeps and hot-and-cold running chills, you play Zeke, a boy burdened with the unenviable task of putting 999 evil spirits to rest while trying to keep himself fromThe Disneyland attraction is making a video game appearance in The Haunted Mansion.  In the famous house of wall-to-wall creeps and hot-and-cold running chills, you play Zeke, a boy burdened with the unenviable task of putting 999 evil spirits to rest while trying to keep himself from becoming number 1000.  Inspired by the both the movie and the ride, Haunted Mansion's environments feature unique puzzles, secret passageways, and plenty of areas for you to run, jump, fight, and climb your way through the mansion.  There's no turning back now.… Expand"}, {"name": "The Temple of Elemental Evil", "details_link": "https://www.metacritic.com/game/pc/the-temple-of-elemental-evil", "publisher": "Atari", "release_date": "Sep 16 2003", "developers": ["Troika Games"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "PC-style RPG", "Western-Style"], "meta_score": 71, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/3/e51de43808b36bfcf23265cc3f9a25d9-98.jpg", "descriptions": "Many years ago in the land of Flanaess, an evil demoness founded a cult dedicated to elemental evil, the four elements as symbols of true evil, and based it in a temple outside the village of Nulb. Eventually, after years of tyranny and chaos, the good armies of the nearby lands, headed byMany years ago in the land of Flanaess, an evil demoness founded a cult dedicated to elemental evil, the four elements as symbols of true evil, and based it in a temple outside the village of Nulb. Eventually, after years of tyranny and chaos, the good armies of the nearby lands, headed by the infamous Circle of Eight descended into the temple and razed it, imprisoning the villains inside. For years thereafter relative peace ensued, as daring adventurers slew the remaining monsters that ravaged the land above and the temple itself faded into but a distant memory...until now. [Atari]… Expand"}, {"name": "Hulk", "details_link": "https://www.metacritic.com/game/gamecube/hulk", "publisher": "Universal Interactive", "release_date": "May 27 2003", "developers": ["Radical Entertainment"], "platforms": ["PlayStation 2", "GameCube"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/4/ba30dbed31f59c258d6f726a08766488-98.jpg", "descriptions": "The Hulk takes place one year after the events in the film, with troubled scientist Bruce Banner and his enraged alter ego, The Hulk, forced into action once again. A new villain, known as The Leader, plans to use The Hulk's gamma energy to unleash a relentless army of gamma creatures on theThe Hulk takes place one year after the events in the film, with troubled scientist Bruce Banner and his enraged alter ego, The Hulk, forced into action once again. A new villain, known as The Leader, plans to use The Hulk's gamma energy to unleash a relentless army of gamma creatures on the world, and only you can stop him. Employ the powers of stealth and logic as Bruce Banner, or command the incredible strength and fury of The Hulk. Take down your foes in fully destructible environments. The Hulk's 25 attacks can hurt your foes and can also destroy your environment.… Expand"}, {"name": "Shrek: Hassle at the Castle", "details_link": "https://www.metacritic.com/game/game-boy-advance/shrek-hassle-at-the-castle", "publisher": "TDK Mediactive", "release_date": "Oct 10 2002", "developers": ["TOSE"], "platforms": "Game Boy Advance", "num_players": "1-4 ", "genres": ["Action", "Fighting", "2D"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/0/b228dfdc8ba20d02d08c9c03590b2793-98.jpg", "descriptions": null}, {"name": "NCAA College Football 2K3", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-college-football-2k3", "publisher": "Sega", "release_date": "Aug  7 2002", "developers": ["Avalanche Software"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Football", "Sim"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/e8ec8723f9db39d77f4950e191fa52cd-98.jpg", "descriptions": "Sega Sports NCAA College Football 2K3 recreates the college atmosphere like never before - from the field, with plays like the wishbone and other triple options, to the sidelines, with school-specific cheerleaders and mascots, to the stadium, with rabid student sections and bands striking upSega Sports NCAA College Football 2K3 recreates the college atmosphere like never before - from the field, with plays like the wishbone and other triple options, to the sidelines, with school-specific cheerleaders and mascots, to the stadium, with rabid student sections and bands striking up fight songs, to the presentation, enhanced with a completely new ESPN broadcast system. And behind the scenes, it's big-time BCS pressure as you assemble your team from the country's top prep prospects, prepare in rigorous, off-season spring practices, and endure a competitive Division I-A schedule. Three ranking systems - the Writers Poll, Coaches Poll, and BCS Standings - track your team's progress throughout the season and determine which teams will play in the 25 post-season bowl games. Strive for perfection and the spoils of gridiron success are yours - the Heisman trophy, a BCS Championship, and your shot at campus immortality. [Sega]… Expand"}, {"name": "James Bond 007: Agent Under Fire", "details_link": "https://www.metacritic.com/game/xbox/james-bond-007-agent-under-fire", "publisher": "Electronic Arts", "release_date": "Mar 26 2002", "developers": ["Electronic Arts"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Modern"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/797ffd5308dfb7bdb993462e1394110a-98.jpg", "descriptions": "Driven by a completely new and original storyline, James Bond 007: Agent Under Fire is a first-person action game that balances furious action and stealth tactics.  An evil world organization has been replacing world leaders with their more docile clones and it's up to you to put a stop toDriven by a completely new and original storyline, James Bond 007: Agent Under Fire is a first-person action game that balances furious action and stealth tactics.  An evil world organization has been replacing world leaders with their more docile clones and it's up to you to put a stop to it.  As Bond, you'll encounter villains and allies, both new and familiar, detailed 3D environments, and spy-packed, fast-action gameplay. And don't worry, Q will provide you with all the innovative weapons, sophisticated spy-craft, and state-of-the-art gadgets that Bond fans expect.… Expand"}, {"name": "ESPN Winter X-Games Snowboarding 2002", "details_link": "https://www.metacritic.com/game/xbox/espn-winter-x-games-snowboarding-2002", "publisher": "Konami", "release_date": "Mar  4 2002", "developers": ["Konami"], "platforms": ["PlayStation 2", "Xbox"], "genres": ["Sports", "Alternative", "Snowboarding"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/9/a4481aef9d7e8fd92265bcaca9fd97fc-98.jpg", "descriptions": "The most authentic snowboarding game returns! Winter X Games Snowboarding 2002 features more arcade fun and snowboarding action. Win a gold medal in on of four authentic Winter X Games events, or go anywhere in the free ride mode, where you can pull off big kickers and twisted rails to yourThe most authentic snowboarding game returns! Winter X Games Snowboarding 2002 features more arcade fun and snowboarding action. Win a gold medal in on of four authentic Winter X Games events, or go anywhere in the free ride mode, where you can pull off big kickers and twisted rails to your heart's content.… Expand"}, {"name": "Combat Command 2: Desert Rats", "details_link": "https://www.metacritic.com/game/pc/combat-command-2-desert-rats", "publisher": "Shrapnel Games", "release_date": "Jul 29 2001", "developers": ["Boku Strategy Games"], "platforms": "PC", "genres": ["Strategy", "General", "General"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/5ea3fe97356bd6f9ecaf7685d002de27-98.jpg", "descriptions": "Step into the shoes of Rommel or Patton in this second installment of the Combat Command 2 series with enhanced night attack capability and enhanced armor strength in 17 scenarios, including Sidi Rezegh, Kasserine Pass, El Guettar, and Oran."}, {"name": "Star Wars: Super Bombad Racing", "details_link": "https://www.metacritic.com/game/playstation-2/star-wars-super-bombad-racing", "publisher": "Lucas Learning", "release_date": "Apr 23 2001", "developers": ["Lucas Learning"], "platforms": "PlayStation 2", "num_players": "1-4 ", "genres": ["Driving", "Racing", "Kart"], "meta_score": 71, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/0/1a9d6f2d9727b5bdc038aa639ec9e036-98.jpg", "descriptions": "Assume the role of Yoda, Anakin, or Jar Jar (or not) in this kart racer set in a variety of Star Wars locales and featuring enough gadgets and weopons to keep you busy."}, {"name": "NBA ShootOut 2001", "details_link": "https://www.metacritic.com/game/playstation/nba-shootout-2001", "publisher": "SCEA", "release_date": "Oct 30 2000", "developers": ["989 Sports"], "platforms": ["PlayStation 2", "PlayStation"], "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 71, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/3fa6cf0ebf320c5f448debe9b70686f3-98.jpg", "descriptions": "989 has opted to take the easy road this time around, and the result is a basketball game that remains virtually unchanged from last year's version."}, {"name": "Panzer General III: Scorched Earth", "details_link": "https://www.metacritic.com/game/pc/panzer-general-iii-scorched-earth", "publisher": "SSI", "release_date": "Sep 28 2000", "developers": ["SSI"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Strategy", "Turn-Based", "General", "General", "Tactics"], "meta_score": 71, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/2/4a8ec84e0c0d797619d70aa212d09481-98.jpg", "descriptions": "Your commanders are key to the optimal use of every class of unit, from infantry to bomber. Special abilities for leaders and units mean no two armies are ever the same, and no two battles have the same result. Bold maneuvering and careful use of equipment can often mean the differenceYour commanders are key to the optimal use of every class of unit, from infantry to bomber. Special abilities for leaders and units mean no two armies are ever the same, and no two battles have the same result. Bold maneuvering and careful use of equipment can often mean the difference between victory and defeat.  [Mattel Interactive]… Expand"}, {"name": "Ferrari Challenge Trofeo Pirelli", "details_link": "https://www.metacritic.com/game/playstation-3/ferrari-challenge-trofeo-pirelli", "publisher": "Activision", "release_date": "Aug 26 2008", "developers": ["Eutechnyx"], "platforms": ["PlayStation 2", "PlayStation 3"], "num_players": "Up to 16 ", "genres": ["Driving", "Racing", "Simulation", "Other", "Other", "GT / Street", "Automobile"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/8/0af5d76ff3e9b5ac40de04d956fdef75-98.jpg", "descriptions": "Ferrari Challenge Trofeo Pirelli's racing style is fast and accessible, yet the feel is more \"sim\" than arcade. It includes over 15 international racing circuits along with multiple gameplay modes such as Ferrari Challenge Seasons, Time Trial, Quick Race, and Endurance. Racing can be takenFerrari Challenge Trofeo Pirelli's racing style is fast and accessible, yet the feel is more \"sim\" than arcade. It includes over 15 international racing circuits along with multiple gameplay modes such as Ferrari Challenge Seasons, Time Trial, Quick Race, and Endurance. Racing can be taken online with up to 16 players in a variety of challenges including circuits, hill climbs, and more. Downloadable content will be continually released for the Ferrari Challenge Trofeo Pirelli community, and the official team and car rosters can be updated at the start of each season to reflect real-world lineups. Moreover, downloadable cars, tracks and customization options will be made available on a monthly basis to keep ravenous Ferrari fans satisfied. [Activision]… Expand"}, {"name": "Get Even", "details_link": "https://www.metacritic.com/game/playstation-4/get-even", "publisher": "Bandai Namco Games", "release_date": "Jun 23 2017", "developers": ["The Farm 51"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Modern", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/2301961d07d867e29b1859f42061e9cb-98.jpg", "descriptions": "Cole Black wakes up in an old, abandoned asylum. He is confused and his sole memory is the attempted rescue of a teenage girl with a bomb strapped to her chest. With a strange technology fused to his head – used to read and replay human memory – Black travels into the depths of his own mindCole Black wakes up in an old, abandoned asylum. He is confused and his sole memory is the attempted rescue of a teenage girl with a bomb strapped to her chest. With a strange technology fused to his head – used to read and replay human memory – Black travels into the depths of his own mind to discover the truth about his past. Every step he takes, leads to the mysterious Red, whose intentions it is difficult to guess. Get Even is a game maintained in convention of a thriller, where action is shown in first-person perspective (FPP). Raising fundamental questions about the understanding of justice and reality. The player discovers the story piece-by-piece through exploration of interactive environments.… Expand"}, {"name": "Pac-Man World: Re-PAC", "details_link": "https://www.metacritic.com/game/playstation-5/pac-man-world-re-pac", "publisher": "Bandai Namco Games", "release_date": "Aug 26 2022", "developers": ["Bandai Namco Games"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 71, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/5/c47d798e9c83b251961dcbcc19f748f0-98.jpg", "descriptions": "Feed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, andFeed Your Appetite for Adventure. In Pac-Man World Re-Pac, Pac-Man arrives home on his birthday to find the Ghosts have kidnapped Pac-Man’s family & friends and ruined his party. Pac-Man must set out to adventure through the six areas of Ghost Island to rescue his family and friends, and face-off against the Ghosts’ boss, Toc-Man. With polished graphics, enhanced gameplay, and updated features – Pac-Man World Re-Pac is action/platforming fun for both experienced Pac-fans and new Pac-thusiasts the world over.… Expand"}, {"name": "State of Emergency", "details_link": "https://www.metacritic.com/game/playstation-2/state-of-emergency", "publisher": "Rockstar Games", "release_date": "Feb 12 2002", "developers": ["VIS Entertainment"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 71, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/4/9b55c946bb4e5538ab3651fdf80977f5-98.jpg", "descriptions": "Enlist in the freedom movement to topple the tyrannical corporation. Freedom Agents duties include the following: Eliminate corporate officers, execute assassinations before targets flee to safety, steal sensitive items and documents from the corporation and return them to freedom agents atEnlist in the freedom movement to topple the tyrannical corporation. Freedom Agents duties include the following: Eliminate corporate officers, execute assassinations before targets flee to safety, steal sensitive items and documents from the corporation and return them to freedom agents at the safehouse, rescue captured allies from corporation deathsquads and help rescue them to safety. [Rockstar]… Expand"}, {"name": "Stranger of Sword City", "details_link": "https://www.metacritic.com/game/playstation-vita/stranger-of-sword-city", "publisher": "NIS America", "release_date": "Apr 26 2016", "developers": ["Experience Inc."], "platforms": ["PC", "Xbox One", "PlayStation Vita"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General"], "meta_score": 71, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/5/6e6c03ee7148ebaa663262567eef3cd5-98.jpg", "descriptions": "STRANGER OF SWORD CITY is the next step in the evolution of the traditional dungeon RPG genre. This title contains the three core elements of attraction for dungeon RPGs: character creation, conquering various dungeons, and dungeon crawling gameplay. Furthermore, our experience and know-howSTRANGER OF SWORD CITY is the next step in the evolution of the traditional dungeon RPG genre. This title contains the three core elements of attraction for dungeon RPGs: character creation, conquering various dungeons, and dungeon crawling gameplay. Furthermore, our experience and know-how with a large number of titles within the Dungeon RPG genre has allowed us to create enhanced support features that allow our users to enjoy the title to their hearts content. Players can switch between the beautiful and fantastical art style of Yoko Tsukamoto, or the art style of Oxijiyen, an artist renowned for their cute character graphics, for the NPC illustrations in game.… Expand"}, {"name": "God Eater 3", "details_link": "https://www.metacritic.com/game/playstation-4/god-eater-3", "publisher": "Bandai Namco Games", "release_date": "Feb  8 2019", "developers": ["Bandai Namco Games", "Marvelous First Studio"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/7d6f61df502be4919cd64bda7b2bd26f-98.jpg", "descriptions": "Set in a post-apocalyptic world, it’s up to your special team of God Eaters to destroy god-like monsters devastating the world. With an epic story, unique characters, and all new God Arcs and Aragami, the latest evolution in ACTION is here."}, {"name": "Batman: The Enemy Within - Episode 3: The Fractured Mask", "details_link": "https://www.metacritic.com/game/pc/batman-the-enemy-within---episode-3-the-fractured-mask", "publisher": "Telltale Games", "release_date": "Nov 21 2017", "developers": ["Telltale Games"], "platforms": ["iPhone/iPad", "PlayStation 4", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "Point-and-Click"], "meta_score": 71, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/2/6c25d71ad8d8e9c9e0793b4c1478ce63-98.jpg", "descriptions": "Discover the powerful and far-reaching consequences of your choices as the Dark Knight. The fate of Bruce Wayne, his dark persona, Batman, and Gotham hang in the balance."}, {"name": "Mass Effect 2: Kasumi - Stolen Memory", "details_link": "https://www.metacritic.com/game/pc/mass-effect-2-kasumi---stolen-memory", "publisher": "Electronic Arts", "release_date": "Apr  6 2010", "developers": ["BioWare"], "platforms": ["Xbox 360", "PC"], "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/25069476246222fda7b905ea36fc7233-98.jpg", "descriptions": "Cerberus has procured the service of Kasumi Goto, the galaxy’s most enigmatic master thief. In return for her help, Kasumi has asked Shepard’s help on a dangerous heist to infiltrate the vault of a deadly master criminal named Donovan Hock. Gain Kasumi’s loyalty on the planet Bekenstein,Cerberus has procured the service of Kasumi Goto, the galaxy’s most enigmatic master thief. In return for her help, Kasumi has asked Shepard’s help on a dangerous heist to infiltrate the vault of a deadly master criminal named Donovan Hock. Gain Kasumi’s loyalty on the planet Bekenstein, where Hock is throwing a party for the galaxy’s richest and most deranged criminal minds to recover data of great importance to Kasumi... and to the galaxy at large. New squad member, weapon, research, and achievement.… Expand"}, {"name": "Tokyo 42", "details_link": "https://www.metacritic.com/game/xbox-one/tokyo-42", "publisher": "Mode 7 Games", "release_date": "May 31 2017", "developers": ["SMAC Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 71, "users_score": 4.3, "image": "https://static.metacritic.com/images/products/games/6/76c15b84eac78d2a52892adae23465e2-98.jpg", "descriptions": "Tokyo 42 is a hyper-stylish isometric open-world shooter. Framed for a murder you didn’t commit, you must delve into a world of assassins, deadly corporate intrigue and… tactical cats. A single-player story mode and a host of multiplayer modes await."}, {"name": "WWE All Stars", "details_link": "https://www.metacritic.com/game/3ds/wwe-all-stars", "publisher": "THQ", "release_date": "Nov 22 2011", "developers": ["THQ"], "platforms": ["PlayStation 2", "PlayStation 3", "Xbox 360", "3DS"], "genres": ["Action", "Sports", "Fighting", "Fighting", "Individual", "Wrestling", "Combat", "Wrestling"], "meta_score": 71, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/3/6abd0be6b7601edceda0785b6ba7eb5f-98.jpg", "descriptions": "WWE All Stars will deliver one of the greatest rosters ever assembled in a wrestling-centric videogame.  Renowned WWE Legends will align with today's most prominent Superstars, inviting players to generate fantasy matches and ultimately determine the greatest competitors of all time.  InWWE All Stars will deliver one of the greatest rosters ever assembled in a wrestling-centric videogame.  Renowned WWE Legends will align with today's most prominent Superstars, inviting players to generate fantasy matches and ultimately determine the greatest competitors of all time.  In addition, each Legend and Superstar will boast a distinctive and highly stylized appearance, adding to the overall atmosphere and intrepid attitude exuding from the on-screen action.… Expand"}, {"name": "Guitar Hero: Aerosmith", "details_link": "https://www.metacritic.com/game/playstation-2/guitar-hero-aerosmith", "publisher": "Activision", "release_date": "Jun 29 2008", "developers": ["BudCat"], "platforms": ["PC", "PlayStation 3", "Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 71, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/3/a2e988fe90b66d5ef6d4ff4b9e006e29-98.jpg", "descriptions": "Guitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) andGuitar Hero: Aerosmith is the first game built around the legendary music of \"America's Greatest Rock ‘N Roll Band\": Steven Tyler, Joe Perry, Brad Whitford, Tom Hamilton and Joey Kramer. This latest Guitar Hero installment puts players in the shoes of Perry (guitar), Whitford (guitar) and Hamilton (bass), as they rock out alongside frontman Tyler and drummer Kramer. Gamers experience Aerosmith’s Grammy winning career, from their first gig to becoming rock royalty, in a way that no other entertainment vehicle offers. As fans progress through their careers in the game, they can rock out to scores of Aerosmith’s greatest hits, as well as songs from celebrated artists that the band has either performed with or has been inspired by in some way.  Venues from historical moments during the band's illustrious career offer the experience of \"sweet emotion\" and further capture the essence of the band's rise to fame. [Activision]… Expand"}, {"name": "DreamWorks Kung Fu Panda", "details_link": "https://www.metacritic.com/game/ds/dreamworks-kung-fu-panda", "publisher": "Activision", "release_date": "Jun  3 2008", "developers": ["Vicarious Visions"], "platforms": "DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "3D", "2D", "3D"], "meta_score": 71, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/6/4482a34795d0d6781e880ba09ac60517-98.jpg", "descriptions": "In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13In Kung Fu Panda, players embark on an epic, action-packed adventure as they master the specialized Kung Fu fighting styles of Po the Panda, the unlikely hero, his teacher Shifu, and the legendary Kung Fu masters, the Furious Five: Monkey, Tigress, Viper, Mantis and Crane. Through 13 legendary levels from the movie and beyond, and spanning land, water and air, players must work their way to become the Dragon Warrior and defeat the ultimate enemy, Tai Lung, as they battle a variety of foes, overcome dangerous obstacles, navigate multi-tiered environments and solve challenging puzzles. Featuring a deep variety of gameplay, unique co-op and competitive multiplayer modes, collectibles, and a host of character upgrades, the Kung Fu Panda video game provides an experience gamers of all ages will enjoy. [Activision]… Expand"}, {"name": "Eiyuden Chronicle: Rising", "details_link": "https://www.metacritic.com/game/pc/eiyuden-chronicle-rising", "publisher": "505 Games", "release_date": "May 10 2022", "developers": ["NATSUME ATARI Inc.", "Rabbit & Bear Studios"], "platforms": ["PlayStation 4", "PlayStation 5", "Switch", "Xbox One", "Xbox Series X", "PC"], "num_players": "No Online Multiplayer", "genres": ["Japanese-Style", "Role-Playing", "Action RPG"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/a6918a90c201e8acaa60393f62f3f114-98.jpg", "descriptions": "Eiyuden Chronicle: Rising combines a thrilling adventure through ancient ruins with the tale of one town’s rise from the ashes. Drawn by lenses and other treasure in the nearby Runebarrows, our heroes learn that the town is struggling to rebuild after an earthquake and decide to help. AlongEiyuden Chronicle: Rising combines a thrilling adventure through ancient ruins with the tale of one town’s rise from the ashes. Drawn by lenses and other treasure in the nearby Runebarrows, our heroes learn that the town is struggling to rebuild after an earthquake and decide to help. Along the way, they’ll resolve disputes between eager adventurers and wary locals who don’t think the Barrows should be disturbed. And they’ll learn more about each other’s reasons for seeking treasure, deepening their bonds in the process. As you will learn, these Runebarrows hide a great secret that has fateful implications for one of the characters. What begins as a simple treasure hunt turns into a dark conspiracy that will shake the world and plant seeds that carry over into the main story of Eiyuden Chronicle: Hundred Heroes. The game will introduce a portion of Eiyuden Chronicle’s cast of characters in an original story with thrilling action and engaging town-upgrading elements.\r… Expand"}, {"name": "One Piece: Unlimited World Red", "details_link": "https://www.metacritic.com/game/playstation-3/one-piece-unlimited-world-red", "publisher": "Bandai Namco Games", "release_date": "Jul  8 2014", "developers": ["Ganbarion"], "platforms": ["3DS", "PlayStation 4", "PlayStation Vita", "Wii U", "PlayStation 3"], "genres": ["Action", "Action Adventure", "General"], "meta_score": 71, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/6/ce1e332ecf5be915c3c70ac5c81722b8-98.jpg", "descriptions": "Set sail on a gripping adventure in the New World with the beloved Straw Hat Crew in ONE PIECE Unlimited World Red. Dive into a wayfaring journey with fun-filled escapades, action-packed battles and powerful comrades in a whole new never-before- seen scenario. Play as members of the StrawSet sail on a gripping adventure in the New World with the beloved Straw Hat Crew in ONE PIECE Unlimited World Red. Dive into a wayfaring journey with fun-filled escapades, action-packed battles and powerful comrades in a whole new never-before- seen scenario. Play as members of the Straw Hat crew and progress through the episodic storyline with encounters against famous bosses like Rob Lucci, Caesar Clown, and more. Master a large variation of flashy combos and test your reflexes by pressing the right button at the right time to counter, dodge or otherwise interact with enemies. Enjoy endless playability by exploring the central town and taking on quests to assist the townfolk and gain more rewards and items.… Expand"}, {"name": "The Chronicles of Narnia: The Lion, The Witch and The Wardrobe", "details_link": "https://www.metacritic.com/game/gamecube/the-chronicles-of-narnia-the-lion-the-witch-and-the-wardrobe", "publisher": "Buena Vista Games", "release_date": "Nov 14 2005", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "GameCube"], "num_players": "1-2 ", "genres": ["Action Adventure", "Fantasy"], "meta_score": 71, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/6/fdbf0533da061c0312e016bf93b25574-98.jpg", "descriptions": "The malevolent White Witch has cast a 100-year winter on the land of Narnia, and you can help Aslan free his people in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. As the four children from the movie, you can battle fantastical creatures such as Minotaurs, Cyclops,The malevolent White Witch has cast a 100-year winter on the land of Narnia, and you can help Aslan free his people in The Chronicles of Narnia: The Lion, the Witch and the Wardrobe. As the four children from the movie, you can battle fantastical creatures such as Minotaurs, Cyclops, Werewolves, and Wraiths. The game includes puzzle elements and is closely tied to the plot of the movie. Multiplayer cooperative play is also available.… Expand"}, {"name": "Driveclub", "details_link": "https://www.metacritic.com/game/playstation-4/driveclub", "publisher": "SCEA", "release_date": "Oct  7 2014", "developers": ["Evolution Studios"], "platforms": "PlayStation 4", "num_players": "Up to 12 ", "genres": ["GT / Street", "Driving", "Racing", "Simulation", "GT / Street", "Automobile"], "meta_score": 71, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/9/f87a0bd18cfef179ce0a4d865285931c-98.jpg", "descriptions": "Driveclub promises to bring to life the heart and soul of car culture. An authentic and immersive driving experience, Drivelub promises to let you feel the exhilaration of racing the most powerful and beautifully designed cars in the world. Share in high-speed solo racing, or join a racingDriveclub promises to bring to life the heart and soul of car culture. An authentic and immersive driving experience, Drivelub promises to let you feel the exhilaration of racing the most powerful and beautifully designed cars in the world. Share in high-speed solo racing, or join a racing Club to discover what Driveclub is all about. Created specifically with the next-generation gamer in mind, Driveclub connects you and your friends, allowing you to share your experiences, send and receive challenges, and keep up to speed with your team’s performance.… Expand"}, {"name": "Sebastien Loeb Rally Evo", "details_link": "https://www.metacritic.com/game/playstation-4/sebastien-loeb-rally-evo", "publisher": "Square Enix", "release_date": "Jan 29 2016", "developers": ["Milestone S.r.l"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "num_players": "Up to 16 ", "genres": ["Racing", "General"], "meta_score": 71, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/8/1b6ea13fc89935627a72f889c03ca795-98.jpg", "descriptions": "Sebastien Loeb Rally Evo is an off-road racing game experience that teams players with the greatest racer in Rally history: Sebastien Loeb."}, {"name": "Starshatter", "details_link": "https://www.metacritic.com/game/pc/starshatter", "publisher": "Matrix Games", "release_date": "Jul  1 2004", "developers": ["Destroyer Studios"], "platforms": "PC", "num_players": "1-12 ", "genres": ["Simulation", "Sci-Fi", "Space", "Small Spaceship", "Small Spaceship", "Combat"], "meta_score": 71, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/8/aff9cfcd3d159cb866db79dd1fb29dce-98.jpg", "descriptions": "Starshatter represents the next generation of space combat simulation games. Starshatter extends the gameplay concepts of the classic sims by combining fighter and starship combat in a single game. You begin the game as either a fighter pilot or the captain of a small Frigate-class starship.Starshatter represents the next generation of space combat simulation games. Starshatter extends the gameplay concepts of the classic sims by combining fighter and starship combat in a single game. You begin the game as either a fighter pilot or the captain of a small Frigate-class starship. As you progress through the game, you can earn promotions and awards until you are commanding a massive fleet carrier with three wings of fighters and a complete escort of warships. Starshatter promotes airborne fighter combat to a first-class game component, allowing you to take-off and land at planetary bases, engage in aerial dogfights, and use air-to-ground missiles to destroy ground targets. Starshatter also integrates elements of real-time-strategy games by allowing fleet commanders to direct the battle on a tactical level, launching fighters and directing destroyers to defend the fleet and annihilate enemy forces. You will arm fighters for patrol or strike missions. You will send orders to your escorting destroyers and frigates to engage enemy starships or defend the fleet from attack by enemy fighters. You are the admiral, and you decide how to employ all of your forces in battle. It is all up to you. [Matrix Games]… Expand"}, {"name": "Elderand", "details_link": "https://www.metacritic.com/game/pc/elderand", "publisher": "Graffiti Games", "release_date": "Feb 16 2023", "developers": ["Mantra"], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["General", "Action", "Platformer", "Metroidvania"], "meta_score": 71, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/2/68d19ae246dc170739a923e003b8e9f0-98.jpg", "descriptions": "Explore a dangerous world and fight deadly creatures for untold treasure in this Lovecraftian inspired action RPG game. Uncover the dark and ancient mysteries of a haunting land with RPG elements and skill-based combat to slay adversaries, find hidden passages, and collective bountiful loot."}, {"name": "RIDE 4", "details_link": "https://www.metacritic.com/game/playstation-5/ride-4", "publisher": "Deep Silver", "release_date": "Jan 21 2021", "developers": ["Milestone S.r.l"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "Up to 20 ", "genres": ["Racing", "Simulation", "Automobile"], "meta_score": 71, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/8/f28526c6e8aadb6eabd29ae769898492-98.jpg", "descriptions": "Choose among 176 Officially licensed bikes and ride on 30 tracks all around the world, carefully designed with an extraordinary level of detail! Every asset has been created starting from Cad data, laser and 3D scanning to achieve precision down to the smallest detail and let you enjoy theChoose among 176 Officially licensed bikes and ride on 30 tracks all around the world, carefully designed with an extraordinary level of detail! Every asset has been created starting from Cad data, laser and 3D scanning to achieve precision down to the smallest detail and let you enjoy the best two-wheel racing experience ever.\rchoose your path - Jump into an amazing and dynamic adventure that interacts with your decisions and choose your own path from the regional events up to the professional leagues. Show your riding skills through challenging races, ability tests, track days and a huge set of events. You could even become an official tester for the most celebrated manufacturers.\rday/night cycle, dynamic weather and Endurance Races - ride 4 features a fully dynamic weather conditions system and a complete day/night cycle. Experience the race in a new light and prove you are the best rider in any condition. And for the first time, the \"Endurance\" Mode will put your tenacity to the test, with animated pit-stops and long lasting races: prepare to face a world where strategy is the ultimate ingredient of your success.\rneural AI - let us introduce you to a.N.N.A. (Artificial neural network Agent), our revolutionary neural AI system based on machine learning. Race against faster, smarter, more accurate riders and compete with an AI more human than ever.\rexpanded customization - Race with your own style! Choose among plenty of official brands for your rider's outfit and customize your bikes aesthetically and mechanically. Unleash your creativity and design your helmet, suit and bike livery in total freedom thanks to our new graphics editor. Once you're done, share your creations online or just discover the best designs of the community.\ronline competitions - Enjoy the most complete and Lag-free online multiplayer experience ever thanks to our dedicated servers.\r… Expand"}]