[{"name": "Lords of Football", "details_link": "https://www.metacritic.com/game/pc/lords-of-football", "publisher": "Geniaware", "release_date": "Apr  5 2013", "developers": ["Geniaware"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Sports", "Traditional", "Team", "Football", "Soccer", "Sim", "Sim"], "meta_score": 52, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/2/385434e4a1d940e9d7a8af22c2c8c8ef-98.jpg", "descriptions": "Lords of Football brings the everyday routine of football to life, simulating footballers' training to improve their skills and all the drama and real-life distractions that unfold during a normal season."}, {"name": "Extinction", "details_link": "https://www.metacritic.com/game/xbox-one/extinction", "publisher": "Modus Games", "release_date": "Apr 10 2018", "developers": ["Iron Galaxy Studios"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 52, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/9/d5de37bbe2743bfc24b6c2d53d98cbde-98.jpg", "descriptions": "You are one of the world’s last Sentinels, a soldier named Avil equipped with the skills to battle the endless wave of Ravenii. Fight massive brutes and their minions across a sprawling countryside, defending cities and rescuing refugees torn from their homes."}, {"name": "The Da Vinci Code", "details_link": "https://www.metacritic.com/game/xbox/the-da-vinci-code", "publisher": "2K Games", "release_date": "May 19 2006", "developers": ["Double Helix Games"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "1 Player", "genres": ["Action", "General"], "meta_score": 52, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/9/0a958663c05ce57b4098145dfe5e3fb9-98.jpg", "descriptions": "The Da Vinci Code game is based on the \"The Da Vinci Code\" film by director Ron Howard, which is based on Dan Brown's novel -- the best-selling novel of all time which has spent more than two years on the New York Times best-seller list. It has also been translated into 42The Da Vinci Code game is based on the \"The Da Vinci Code\" film by director Ron Howard, which is based on Dan Brown's novel -- the best-selling novel of all time which has spent more than two years on the New York Times best-seller list. It has also been translated into 42 languages. To date, there are more than 38.6 million copies of the novel in print, averaging more than two million copies sold each month.… Expand"}, {"name": "Kamiwaza: Way of the Thief", "details_link": "https://www.metacritic.com/game/playstation-4/kamiwaza-way-of-the-thief", "publisher": "Acquire", "release_date": "Oct 11 2022", "developers": ["Acquire"], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/f4c21c632fab44fa6b5ae350f90c6f57-98.jpg", "descriptions": "On the streets of Mikado, only the tough survive. For one man, a heist gone wrong would change his life forever.Set during the Edo period of Japan, Kamiwaza stars amateur thief Ebizo, who aspires to steal from the rich and give to the poor. During his first stint, however, he and hisOn the streets of Mikado, only the tough survive. For one man, a heist gone wrong would change his life forever.Set during the Edo period of Japan, Kamiwaza stars amateur thief Ebizo, who aspires to steal from the rich and give to the poor. During his first stint, however, he and his mentor, Ainosuke, witness their own men take the lives of innocent civilians. Disillusioned by the horrific display of violence, Ainosuke advises Ebizo to escape with the only survivor - a lone girl.A decade later, Ebizo has held fast to his morals, living an honest and fulfilling life with Suzuna, the young girl he took in as his own daughter. But the illusion of security is shattered once Suzuna falls ill. In order to buy the medicine she desperately needs, Ebizo is faced with a heavy financial burden. Conflicted, Ebizo is forced to return to the underbelly of Mikado, but vows only to steal for the sake of those less fortunate.Will you walk the path of honor, even as a thief? The choice is yours to make.… Expand"}, {"name": "NCAA Final Four 2002", "details_link": "https://www.metacritic.com/game/playstation-2/ncaa-final-four-2002", "publisher": "SCEA", "release_date": "Nov 12 2001", "developers": ["989 Sports"], "platforms": "PlayStation 2", "num_players": "1-8 ", "genres": ["Sports", "Traditional", "Basketball", "Sim"], "meta_score": 52, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/6/7dba4c1ed2d00af2c9c724e9dd4de5e5-98.jpg", "descriptions": "Features more than 300 Division I-A teams from 31 national conferences; improved Touch Shooting Controls and an all new Backdown move for maneuvering in the inside game; Team-specific playbooks of offensive and defensive strategies; and Play-by-Play commentary from Eddie Doucette and BillyFeatures more than 300 Division I-A teams from 31 national conferences; improved Touch Shooting Controls and an all new Backdown move for maneuvering in the inside game; Team-specific playbooks of offensive and defensive strategies; and Play-by-Play commentary from Eddie Doucette and Billy Packer on color. [SCEA]… Expand"}, {"name": "Naruto: Uzumaki Chronicles 2", "details_link": "https://www.metacritic.com/game/playstation-2/naruto-uzumaki-chronicles-2", "publisher": "Namco Bandai Games", "release_date": "Sep  4 2007", "developers": ["Cavia Inc."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 52, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/2ee08edf23390fe4c55bb28a8ce180a7-98.jpg", "descriptions": "A brand new tale arrives as Naruto faces different challenges to defend the Hidden Leaf Village and surrounding villages from the evil force trying to dominate it. An ancient organization, which was thought to have been disbanded, is alive and in search of orbs to resurrect a mechanicalA brand new tale arrives as Naruto faces different challenges to defend the Hidden Leaf Village and surrounding villages from the evil force trying to dominate it. An ancient organization, which was thought to have been disbanded, is alive and in search of orbs to resurrect a mechanical terror. It's now up to Naruto and all of the Hidden Leaf Genin to join forces with those of the Hidden Sand Village to stop this menace. Multiplayer Co-op and Vs Battles - During the game, a second player is able to join in on the action for a simultaneous two-player adventure! Or, fight head-to-head with a friend and battle it out for the title of Hokage. Additional gameplay modes further enhance the Naruto experience: Story Mode - Play alone or with a friend and traverse a lush, 3-D anime-style world in which Naruto and his friends work together to unravel the mystery of the Shirogane Clan and their nefarious army of \"puppet walkers.\" Hone your skills to become the ultimate warrior and unlock a secret chapter of the story. Mission Mode - Take on a series of challenging side missions. Survival Mode - Test your skills to become the ultimate warrior and unlock a secret mission. Choose your favorite ninja, including Naruto, Shikamaru, Rock Lee, Kakashi, Guy, Sasuke, or Choji, to complete story-driven missions and intense challenges. Prove yourself in battle and earn money to create the ultimate warrior using Chips and Plates that can customize your character's speed, strength, stamina and even special moves. Harness the power of Rasengan, Lightning Blade, Sand Coffin, and other moves, straight from the series. [Namco Bandai Games]… Expand"}, {"name": "Miner Wars 2081", "details_link": "https://www.metacritic.com/game/pc/miner-wars-2081", "publisher": "Keen Software House", "release_date": "Nov 28 2012", "developers": ["Keen Software House"], "platforms": "PC", "genres": ["Action", "Simulation", "Shooter", "Sci-Fi", "Space", "Third-Person", "Small Spaceship", "Combat", "Sci-Fi"], "meta_score": 52, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/7/b5d4e8ec39d859840dfcba37e68713a9-98.jpg", "descriptions": "As a player, you operate an advanced mining ship in an open world asteroid belt area. You dig kilometers of tunnels, harvest the ore, travel the solar system, fight your enemies and discover mysterious alien secrets. Game play is led by an epic story and is a combination of aAs a player, you operate an advanced mining ship in an open world asteroid belt area. You dig kilometers of tunnels, harvest the ore, travel the solar system, fight your enemies and discover mysterious alien secrets. Game play is led by an epic story and is a combination of a single/multi-player game, cooperative, or you against everyone. The story will introduce you to many types of missions: rescue, exploration, revenge, base defense, theft, transportation, stealth, search and destroy, pure harvesting, racing or just flying around and destroying everything you see.… Expand"}, {"name": "The Ant Bully", "details_link": "https://www.metacritic.com/game/playstation-2/the-ant-bully", "publisher": "Midway", "release_date": "Jul 24 2006", "developers": ["Artificial Mind and Movement"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 52, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/7/7269820b0d049e5148136afa86818d89-98.jpg", "descriptions": "Go pick on someone your own size! After bullying an innocent ant colony, a young boy named Lucas is magically shrunk down to ant size and embarks on a remarkable adventure. Play as Lucas, experiencing the dangerous and thrilling life of an ant as you battle, explore and forge new friendshipsGo pick on someone your own size! After bullying an innocent ant colony, a young boy named Lucas is magically shrunk down to ant size and embarks on a remarkable adventure. Play as Lucas, experiencing the dangerous and thrilling life of an ant as you battle, explore and forge new friendships with natives and other species in his new ant world. Based on exciting moments from the upcoming digitally animated family adventure The Ant Bully, and featuring all-new challenges created especially for the game, help Lucas evolve from recluse to hero in his quest to save the colony from extermination. [Midway]… Expand"}, {"name": "Asterix & Obelix XXL 3: The Crystal Menhir", "details_link": "https://www.metacritic.com/game/xbox-one/asterix-obelix-xxl-3-the-crystal-menhir", "publisher": "Microids", "release_date": "Nov 28 2019", "developers": ["Anuman Interactive"], "platforms": ["PC", "PlayStation 4", "PlayStation 5", "Switch", "Xbox One"], "num_players": "Online Multiplayer", "genres": ["Action", "Action Adventure", "Platformer", "Linear", "3D"], "meta_score": 52, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/3/2d6f821c8b3a28cba24bb70f9d129976-98.jpg", "descriptions": "The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely... One small village of indomitable Gauls still holds out against the invaders. And life is not easy for the Roman legionaries who garrison the fortified camps of Totorum, Aquarium, Laudanum and Compendium.The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely... One small village of indomitable Gauls still holds out against the invaders. And life is not easy for the Roman legionaries who garrison the fortified camps of Totorum, Aquarium, Laudanum and Compendium.Peace reigns in the small Armorican village, where the villagers go about their daily business. Our two heroes, Asterix and Obelix, hunt wild boar, the blacksmith and the fishmonger quarrel, and the village chief strolls around the village square atop his shield.One day, the village druid, Getafix, receives a strange letter. It is from Avina Gandir, the high priestess of Thule! She warns the druid of a grave threat to his people and asks him to take a mysterious Menhir out of its hiding place...Set off on an exciting adventure and immerse yourself in the world of Asterix! Alone or in co-op, explore the lands of the Roman empire and unravel the mystery of the Crystal Menhir and its incredible powers!… Expand"}, {"name": "Inuyasha: Feudal Combat", "details_link": "https://www.metacritic.com/game/playstation-2/inuyasha-feudal-combat", "publisher": "Bandai", "release_date": "Aug 24 2005", "developers": ["Eighting"], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "Fighting", "3D"], "meta_score": 52, "users_score": 7.8, "image": "https://static.metacritic.com/images/products/games/3/b4191fff743da2327bef64f2b52ed866-98.jpg", "descriptions": "Unleash your inner demon! Choose your partner and fight your way across feudal-era Japan. Team up with friend or foe as you battle out the storylines from the TV series. Featuring 12 playable characters from the Inuyasha TV series. Use the interactive environments to gain a battle advantage.Unleash your inner demon! Choose your partner and fight your way across feudal-era Japan. Team up with friend or foe as you battle out the storylines from the TV series. Featuring 12 playable characters from the Inuyasha TV series. Use the interactive environments to gain a battle advantage. Original battle system! Choose your partner and the best formation system to take out your opponent! Choose from Mission Mode, Story Mode, and 2 player Versus Mode. Develop your character's attacks. [Bandai]… Expand"}, {"name": "Boogie", "details_link": "https://www.metacritic.com/game/playstation-2/boogie", "publisher": "Electronic Arts", "release_date": "Nov 12 2007", "developers": ["Pipeworks Software", "Inc."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Miscellaneous", "Rhythm", "Music"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/4/fda8c9b0d2c747d9b3c14dfe65722012-98.jpg", "descriptions": "Boogie on the PlayStation 2 showcases the game’s signature dancing and singing gameplay. Players can sing along to their favorite tunes or dance to the latest hit songs as well as catch their best dance moves, record their own voice and make music videos with the music video creator.Boogie on the PlayStation 2 showcases the game’s signature dancing and singing gameplay. Players can sing along to their favorite tunes or dance to the latest hit songs as well as catch their best dance moves, record their own voice and make music videos with the music video creator. [Electronic Arts]… Expand"}, {"name": "Winter Sports: The Ultimate Challenge", "details_link": "https://www.metacritic.com/game/wii/winter-sports-the-ultimate-challenge", "publisher": "Conspiracy Entertainment", "release_date": "Dec 11 2007", "developers": ["49Games"], "platforms": ["PlayStation 2", "Wii"], "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 52, "users_score": 6.8, "image": "https://static.metacritic.com/images/products/games/3/9da79169e8e989dbed8f5393f2d48989-98.jpg", "descriptions": "Break world records in diverse single player modes and challenge your friends and family to taxing multiplayer matches. Captivating sports such as Figure skating or Skeleton demand high skills and fast reactions. Experience the fascination of Winter Sports: The Ultimate Challenge withBreak world records in diverse single player modes and challenge your friends and family to taxing multiplayer matches. Captivating sports such as Figure skating or Skeleton demand high skills and fast reactions. Experience the fascination of Winter Sports: The Ultimate Challenge with stun-ning graphics and an exciting soundtrack. Multiplayer matches for up to 4 players (2 players in split screen mode). Brand new campaign and career mode promises weeks of fun playing. Compete for record times in the 9 most popular winter sports in 15 disciplines. [Conspiracy Entertainment]… Expand"}, {"name": "Realpolitiks", "details_link": "https://www.metacritic.com/game/pc/realpolitiks", "publisher": "1C Entertainment", "release_date": "Feb 16 2017", "developers": ["Jujubee S.A."], "platforms": ["Switch", "PC"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 52, "users_score": 6.7, "image": "https://static.metacritic.com/images/products/games/7/90a14609f5fefe330013e166c752cad7-98.jpg", "descriptions": "Become the ruler of any contemporary country in this streamlined real-time grand strategy game. Use diplomacy, espionage, military and economic power to deal with other nations, while tackling issues such as terrorism, financial crises and medical epidemics, all in an effort to achieveBecome the ruler of any contemporary country in this streamlined real-time grand strategy game. Use diplomacy, espionage, military and economic power to deal with other nations, while tackling issues such as terrorism, financial crises and medical epidemics, all in an effort to achieve global domination.… Expand"}, {"name": "Spectra: 8bit Racing", "details_link": "https://www.metacritic.com/game/xbox-one/spectra-8bit-racing", "publisher": "Gateway Interactive", "release_date": "Jul 10 2015", "developers": ["Gateway Interactive"], "platforms": ["PC", "Xbox One"], "genres": ["Driving", "Racing", "Arcade", "Automobile"], "meta_score": 52, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/0/52d4ab95ae13df733c307942d9109ce9-98.jpg", "descriptions": "\"Spectra: 8bit Racing, flips the script on what weve come to expect from a music-based game.\" - Xbox Wire\r Spectra is a beautiful twitch racing game that will have you on the edge of your seat! Blast your nimble ship down intricate ribbons of light in time to a thumping all\"Spectra: 8bit Racing, flips the script on what weve come to expect from a music-based game.\" - Xbox Wire\r Spectra is a beautiful twitch racing game that will have you on the edge of your seat! Blast your nimble ship down intricate ribbons of light in time to a thumping all original soundtrack by Chipzel (Super Hexagon, Size Does Matter). Spectra will have your ears pumping and your heart racing as you drift into a trance with just one objective. Survive till the music stops! A true callback to arcade games of old; mastery of Spectra will require all your twitch skills and the beautiful retro style graphics will have you just itching to go dig up your Atari!\r-Game Features\r- Exclusive soundtrack from chiptune legend Chipzel Procedural levels for UNLIMITED playthroughs The downloadable version of this game supports English.… Expand"}, {"name": "X-Men: The Official Game", "details_link": "https://www.metacritic.com/game/playstation-2/x-men-the-official-game", "publisher": "Activision", "release_date": "May 16 2006", "developers": ["Z-Axis", "Ltd."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 52, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/0/1b7d2ff0a1bf969fbd0b322157456896-98.jpg", "descriptions": "Master the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms asMaster the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms as lightning-fast Iceman. For even more power, utilize fury and adrenaline modes. Become a part of the X-Men movie universe—Embark on a globe-spanning conflict featuring every element of the X-Men universe—from favorite villains to famous locations such as Alkali Lake, plus the voices and likenesses of key actors from the films. Battle fierce enemies, join forces with comrades—Face off against movie villains such as Pyro, Magneto and Sabretooth, plus added foes like legions of Sentinels. Storm, Colossus and Cyclops join forces with you in gameplay that includes melee fighting, stealth-style action and time-based missions. [Activision]… Expand"}, {"name": "Ford Bold Moves Street Racing", "details_link": "https://www.metacritic.com/game/psp/ford-bold-moves-street-racing", "publisher": "Eidos Interactive", "release_date": "Oct 17 2006", "developers": ["Razorworks"], "platforms": ["PC", "PSP"], "num_players": "2  Online", "genres": ["Driving", "Racing", "Simulation", "GT / Street", "GT / Street", "Automobile"], "meta_score": 52, "users_score": 7.3, "image": "https://static.metacritic.com/images/products/games/4/f0b836c4279af2fb6e5e7724780d2b66-98.jpg", "descriptions": "(Known in the UK/EU as \"Ford Street Racing: LA Duel\")  Now featuring 24 officially licensed Ford vehicles, classics such as the 1971 Mustang Mach 1 join the already prestigious roster, as well as scorching hot supercars like the 2005 Shelby GR-1 Concept.  The Maximum Team Control Racing(Known in the UK/EU as \"Ford Street Racing: LA Duel\")  Now featuring 24 officially licensed Ford vehicles, classics such as the 1971 Mustang Mach 1 join the already prestigious roster, as well as scorching hot supercars like the 2005 Shelby GR-1 Concept.  The Maximum Team Control Racing features have been expanded to 11 different modes, each designed to exploit different aspects of team racings such as blocking, drafting, and switching.  Multiplayer has also been enhanced to include both team and solo racing options, utilizing the wireless capabilities of the PSP system for high velocity head-to-head racing battles.  [Eidos Interactive]… Expand"}, {"name": "Time Ace", "details_link": "https://www.metacritic.com/game/ds/time-ace", "publisher": "Konami", "release_date": "Jun 12 2007", "developers": ["Trainwreck Studios"], "platforms": "DS", "num_players": "4  Online", "genres": ["Simulation", "Flight", "Sci-Fi", "Futuristic Jet", "Futuristic Jet", "Combat"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/7/5f3411ceb8578e0c5f9b94a0d9211cdc-98.jpg", "descriptions": "In 1914, eccentric scientist Dr. Hugo Clock created a time machine with the plans of going back in time and preventing World War I from happening and preventing millions of needless deaths. However, his sneaky assistant, Dr. Klaus Scythe, hijacks his time machine with a plan to acquire anIn 1914, eccentric scientist Dr. Hugo Clock created a time machine with the plans of going back in time and preventing World War I from happening and preventing millions of needless deaths. However, his sneaky assistant, Dr. Klaus Scythe, hijacks his time machine with a plan to acquire an arsenal of history's most powerful weapons in order to rule the world. Now Dr. Clock must pursue Scythe through time and prevent him from unleashing the aerial war machines of the future on an unsuspecting era. 3D aerial shooting action across more than 19 levels. Acquire and fly the aircraft of the past, present and future, from World War II bombers to modern fighter jets and futuristic marvels of airborne destruction. Collect power-ups to modify the speed, durability, firepower and maneuverability of your aircraft. Dogfighting multiplayer mode. [Konami]… Expand"}, {"name": "Tetris Evolution", "details_link": "https://www.metacritic.com/game/xbox-360/tetris-evolution", "publisher": "THQ", "release_date": "Mar 19 2007", "developers": ["Mass Media"], "platforms": "Xbox 360", "num_players": "Up to 16 ", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "Stacking", "Stacking"], "meta_score": 52, "users_score": 8.0, "image": "https://static.metacritic.com/images/products/games/7/28d2e52e8f2bd7bad5221392c3f97b3f-98.jpg", "descriptions": "In Tetris Evolution, players enjoy not only traditional Tetris gameplay but numerous new modes including \"Go Low\" and \"Eraser\" for both single and multiplayer. The multiplayer mode not only allows for up to four players on a single console, but players can now compete with up to four playersIn Tetris Evolution, players enjoy not only traditional Tetris gameplay but numerous new modes including \"Go Low\" and \"Eraser\" for both single and multiplayer. The multiplayer mode not only allows for up to four players on a single console, but players can now compete with up to four players via the Xbox Live online entertainment service. Contributing to the online experience are the new intelligent matchmaking system, which pits players against others within their skill level, as well as the online ladder system, which enables players to track their overall skill level and accumulate Xbox Live achievement points to increase their Gamerscore. Tetris Evolution allows players to take advantage of Xbox 360's high-definition capabilities with intense graphics that make the Tetriminos appear to pop off the screen and more than a dozen high-definition background videos. The game also features customizable themes, skins, icons and soundtracks to create a personalized gaming experience. [THQ]… Expand"}, {"name": "Defenders of Ardania", "details_link": "https://www.metacritic.com/game/xbox-360/defenders-of-ardania", "publisher": "Paradox Interactive", "release_date": "Mar 14 2012", "developers": ["Most Wanted Entertainment"], "platforms": ["iPhone/iPad", "PC", "Xbox 360"], "genres": ["Strategy", "Real-Time", "General", "General", "Defense"], "meta_score": 52, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/2/2af863142e7eafc29dd393361bd22a30-98.jpg", "descriptions": "Defenders of Ardania is a next-generation tower defense game that is being developed for four different platforms."}, {"name": "Bionicle Heroes", "details_link": "https://www.metacritic.com/game/wii/bionicle-heroes", "publisher": "Eidos Interactive", "release_date": "Apr 24 2007", "developers": ["Traveller's Tales"], "platforms": ["PC", "PlayStation 2", "Xbox 360", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Action", "Action Adventure", "Sci-Fi", "Sci-Fi", "General", "Shooter", "First-Person", "Third-Person", "Arcade"], "meta_score": 52, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/7/03452bbbeacd04b9cc5b57a1e3937dcb-98.jpg", "descriptions": "Bionicle Heroes brings to life the most powerful and exciting Bionicle characters ever seen in one game, in an action-packed world of adventure and discovery. Gamers take control of the heroic Toa as they battle against the dastardly Piraka for the ‘Mask of Life’.  Gamers learn to master theBionicle Heroes brings to life the most powerful and exciting Bionicle characters ever seen in one game, in an action-packed world of adventure and discovery. Gamers take control of the heroic Toa as they battle against the dastardly Piraka for the ‘Mask of Life’.  Gamers learn to master the skills and weapons of all the heroes as they face the enemy and explore the mysterious island of Voya Nui. [Eidos Interactive]… Expand"}, {"name": "Cross Edge", "details_link": "https://www.metacritic.com/game/playstation-3/cross-edge", "publisher": "NIS America", "release_date": "May 26 2009", "developers": ["Compile Heart"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Role-Playing", "General", "General", "Japanese-Style"], "meta_score": 52, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/2/f29b10e7fe764dac3194027a3baa1a82-98.jpg", "descriptions": "In a world where dreams and nightmares become reality, a band of powerful warriors from across dimensions must come together to stop their worlds from being consumed by evil incarnate. Harness the power of characters from such series as Disgaea, Ar tonelico, and DarkStalkers! Utilize theIn a world where dreams and nightmares become reality, a band of powerful warriors from across dimensions must come together to stop their worlds from being consumed by evil incarnate. Harness the power of characters from such series as Disgaea, Ar tonelico, and DarkStalkers! Utilize the dynamic battle system to unleash powerful special skills and team combos, and choose your destiny! [NIS America]… Expand"}, {"name": "The Sims 3", "details_link": "https://www.metacritic.com/game/3ds/the-sims-3", "publisher": "EA Games", "release_date": "Mar 22 2011", "developers": ["EA Games"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Xbox 360", "3DS"], "num_players": "No Online Multiplayer", "genres": ["Simulation", "Miscellaneous", "Virtual Life", "Virtual", "Virtual Life"], "meta_score": 52, "users_score": 2.9, "image": "https://static.metacritic.com/images/products/games/1/e5c2604fb9c939b0ad4b013a58502a19-98.jpg", "descriptions": "Create Sims, the characters unique to The Sims franchise, with unique personalities, fulfill their desires and control their lives within a living neighborhood. Unlock new Karma Powers with Karma Points and unleash amazing effects on your Sims. As you guide your Sims through life, buildCreate Sims, the characters unique to The Sims franchise, with unique personalities, fulfill their desires and control their lives within a living neighborhood. Unlock new Karma Powers with Karma Points and unleash amazing effects on your Sims. As you guide your Sims through life, build relationships and experience different careers like Criminal, Athlete or Musician to unlock new items, outfits and various rewards. Share your Sims with other 3DS owners using the Nintendo StreetPass. … Expand"}, {"name": "Contra: Rogue Corps", "details_link": "https://www.metacritic.com/game/playstation-4/contra-rogue-corps", "publisher": "Konami", "release_date": "Sep 24 2019", "developers": ["Konami", "Toylogic Inc.", "Toylogic"], "platforms": ["PC", "Switch", "Xbox One", "PlayStation 4"], "num_players": "Up to 8 ", "genres": ["Action", "Shooter", "Shoot-'Em-Up", "Top-Down"], "meta_score": 52, "users_score": 4.0, "image": "https://static.metacritic.com/images/products/games/2/eb7f694e5a0032b910728e2626bff3c8-98.jpg", "descriptions": "ROGUE CORPS, You know the Drill!CONTRA ROGUE CORPS is an over the top run and gun game with fast paced ultra-violent combat. Offering both single and multiplayer options, CONTRA ROGUE CORPS is an incredible gameplay experience alone or with your friends."}, {"name": "Mighty No. 9", "details_link": "https://www.metacritic.com/game/pc/mighty-no-9", "publisher": "Deep Silver", "release_date": "Jun 21 2016", "developers": ["Inti Creates"], "platforms": ["PlayStation 3", "PlayStation 4", "Wii U", "Xbox 360", "Xbox One", "PC"], "num_players": "Online Multiplayer", "genres": ["Platformer", "2D", "Action", "Platformer", "2D"], "meta_score": 52, "users_score": 3.6, "image": "https://static.metacritic.com/images/products/games/6/bcb6405a8833925024c6e5fe14040c2c-98.jpg", "descriptions": "Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots,Mighty No. 9 is an all-new Japanese side-scrolling action game that takes the best aspects of the 8- and 16-bit era classics you know and love, and transforms them with modern tech, fresh mechanics, and fan input into something fresh. You play as Beck, the 9th in a line of powerful robots, and the only one not infected by a mysterious computer virus that has caused mechanized creatures the world over to go berserk. Run, jump, blast, and transform your way through six stages (or more, via stretch goals) you can tackle in any order you choose, using weapons and abilities stolen from your enemies to take down your fellow Mighty Number robots and confront the final evil that threatens the planet. Once, you worked together, side-by-side but now, your fellow Mighty No. robots have lashed out, taking over key strategic locations across the globe and infesting them with their minions. You have no choice: the other Mighty Numbers...Must. Be. Destroyed.… Expand"}, {"name": "Game of Thrones", "details_link": "https://www.metacritic.com/game/xbox-360/game-of-thrones", "publisher": "Atlus", "release_date": "May 15 2012", "developers": ["Cyanide", "Cyanide Studios"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "1 Player", "genres": ["Role-Playing", "General", "General", "Western-Style"], "meta_score": 52, "users_score": 5.1, "image": "https://static.metacritic.com/images/products/games/8/dc56f153e71d7878e986d3a41eec4179-98.jpg", "descriptions": "Written in conjunction with author George R. R. Martin, the famed \"A Song of Ice and Fire\" universe opens even further to reveal an additional chapter of the story. Play as 2 former soldiers of Robert’s Rebellion who, despite their different paths, need to reunite to face a new and deadlyWritten in conjunction with author George R. R. Martin, the famed \"A Song of Ice and Fire\" universe opens even further to reveal an additional chapter of the story. Play as 2 former soldiers of Robert’s Rebellion who, despite their different paths, need to reunite to face a new and deadly threat to the Seven Kingdoms. Travel a parallel course with the original series, interacting with familiar faces on the journey, including Cersei Lannister, Lord Commander Mormont, and Varys the Spider.… Expand"}, {"name": "Dark Messiah of Might and Magic: Elements", "details_link": "https://www.metacritic.com/game/xbox-360/dark-messiah-of-might-and-magic-elements", "publisher": "Ubisoft", "release_date": "Feb 12 2008", "developers": ["Ubisoft Annecy"], "platforms": ["PC", "Xbox 360"], "num_players": "Up to 10 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Fantasy", "Fantasy", "Arcade"], "meta_score": 52, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/1/c7c85e7bf199f32b7cf20d0014e511e8-98.jpg", "descriptions": "In Dark Messiah of Might and Magic: Elements, players are introduced to the dark and unforgiving world of Ashan, scarred by a bloody history and threatened by the apocalyptic prophecy of the Dark Messiah. The game sports a refined experience thanks to several improvements in gameplay, designIn Dark Messiah of Might and Magic: Elements, players are introduced to the dark and unforgiving world of Ashan, scarred by a bloody history and threatened by the apocalyptic prophecy of the Dark Messiah. The game sports a refined experience thanks to several improvements in gameplay, design and other technical aspects. Players embody the young hero Sareth and choose his evolution path to acquire spells, skills and abilities that will set his destiny. Experience Might and Magic like never before, with refined game mechanics carefully crafted for pad-controlled carnage, including a brand new lock-on feature and tweaked level design and game statistics. Explore three previously unreleased secret levels with new objectives, gameplay, and rewards. New multiplayer maps have been created exclusively for Xbox 360, while all other features have been completely remastered for an optimal Xbox Live experience, allowing you to play with up to 10 players. Enlist with the Humans or the Undead and choose to play as an archer, priestess, mage or knight. Make use of powerful and unique skills and spells on the battlefield, including powers such as meteor shower, berserk charge and rain of arrows. [Ubisoft]… Expand"}, {"name": "Fallout 76", "details_link": "https://www.metacritic.com/game/pc/fallout-76", "publisher": "Bethesda Softworks", "release_date": "Nov 14 2018", "developers": ["Bethesda Game Studios"], "platforms": ["PlayStation 4", "Xbox One", "PC"], "num_players": "Up to 24 ", "genres": ["Role-Playing", "Western-Style"], "meta_score": 52, "users_score": 2.8, "image": "https://static.metacritic.com/images/products/games/0/05cdbff96258c0f2c11ec256bb043b37-98.jpg", "descriptions": "Fallout 76 is the online prequel where every surviving human is a real person. Work together – or not – to survive. Under the threat of nuclear annihilation, you’ll experience the largest, most dynamic world ever created in the legendary Fallout universe. Reclamation Day, 2102. 25 yearsFallout 76 is the online prequel where every surviving human is a real person. Work together – or not – to survive. Under the threat of nuclear annihilation, you’ll experience the largest, most dynamic world ever created in the legendary Fallout universe. Reclamation Day, 2102. 25 years after the bombs fall, you and your fellow Vault Dwellers – chosen from the nation’s best and brightest – emerge into post-nuclear America. Play alone or band together as you explore, quest, build and triumph against the wasteland’s greatest threats. Multiplayer finally comes to the epic open-world RPGs of Bethesda Game Studios. Create your character with the S.P.E.C.I.A.L. system and forge your own path in a new and untamed wasteland with hundreds of locations. Whether you journey alone or with friends, a new and unique Fallout adventure awaits. Use the all-new Construction and Assembly Mobile Platform (C.A.M.P.) to build and craft anywhere in the world. Your C.A.M.P. will provide much-needed shelter, supplies and safety. You can even set up shop to trade goods with other survivors. But beware, not everyone will be quite so neighborly. [Bethesda]\r… Expand"}, {"name": "Warriors Orochi 2", "details_link": "https://www.metacritic.com/game/playstation-2/warriors-orochi-2", "publisher": "Koei", "release_date": "Sep 23 2008", "developers": ["Omega Force"], "platforms": ["Xbox 360", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 52, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/5/e22c041b44cf53dcdbbc56089d9e2613-98.jpg", "descriptions": "Shattering time and space, the venomous Serpent King Orochi kidnapped the Dynasty Warriors and Samurai Warriors in scheme to test his might. The heroes eventually defeated Orochi and his menacing army. While the slain Orochi lies in the netherworld, a mysterious alliance is hatching anShattering time and space, the venomous Serpent King Orochi kidnapped the Dynasty Warriors and Samurai Warriors in scheme to test his might. The heroes eventually defeated Orochi and his menacing army. While the slain Orochi lies in the netherworld, a mysterious alliance is hatching an otherworldly plan so that the Serpent King may rise again. Now a new group of warriors must join forces with history's finest in an effort to stop this evil resurrection. Warriors Orochi 2 takes place after the events of the original game. The game's main \"Story\" mode features storylines for the kingdoms of Wu, Wei, and Shu, and the Samurai Warriors, while a new Orochi storyline looks back to the first series of wars to expose some of the Serpent King's secrets. The game's newly added \"Dream\" mode features an original storyline different from that of Story Mode. A new two-player \"Versus\" mode comes action-packed with four different games including \"Tag Team\" matches that pit individual fighters in lethal head-to-head combat. The popular \"Team Battle System\" which lets players create their own three-person fighting unit returns for this sequel. At any given time, one warrior will be engaged in battle, while the other two are recuperating; restoring their Life Meters and Musou Gauges. Warriors Orochi 2 features an overwhelming lineup of over 90 playable characters from both franchises including Samurai Warriors 2 Extreme Legends, plus new characters from Chinese and Japanese history. [Koei]… Expand"}, {"name": "Carmageddon: Max Damage", "details_link": "https://www.metacritic.com/game/xbox-one/carmageddon-max-damage", "publisher": "Stainless Games", "release_date": "Jul  5 2016", "developers": ["Stainless Games"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Racing", "Arcade", "Automobile"], "meta_score": 52, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/5/038c0469b2f5177f10dd78e826a35837-98.jpg", "descriptions": "Create carnage in a wide range of large open world environments and smaller battle arenas, with plenty of fun stuff to smash into, smash up, snap off and sling around. Explore city streets and country trails, arid deserts and icy wastelands all packed with juicy meatbags for your killing pleasure."}, {"name": "Caveman Warriors", "details_link": "https://www.metacritic.com/game/switch/caveman-warriors", "publisher": "JanduSoft", "release_date": "Dec  5 2017", "developers": ["JanduSoft"], "platforms": ["PC", "PlayStation 4", "Xbox One", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "Beat-'Em-Up", "2D"], "meta_score": 52, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/dbc91a5f93f4e797114d97024ebefff6-98.jpg", "descriptions": "Jump back in time and free your inner caveman. Smash heads in this cooperative platformer game. Play solo or team up with up to 4 players.Inspired by games like New Super Mario, Joe & Mac, Metal Slug, Castle Crashers and Trine."}, {"name": "Brain Voyage", "details_link": "https://www.metacritic.com/game/ds/brain-voyage", "publisher": "Eidos Interactive", "release_date": "May  5 2008", "developers": ["Razorback Developments"], "platforms": "DS", "num_players": "1 Player", "genres": ["Miscellaneous", "Puzzle", "Puzzle", "General", "Puzzle", "General"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/1/dac2f42ad38171b171e4526762789ab7-98.jpg", "descriptions": "(Also known as \"Dr. Reiner Knizia's Brainbenders\")  Travel the world with the award-winning puzzle and board game designer Dr. Reiner Knizia as you visit iconic global cities in an attempt to solve ingenious conundrums. An expert in algorithmically generated logic problems and designer of(Also known as \"Dr. Reiner Knizia's Brainbenders\")  Travel the world with the award-winning puzzle and board game designer Dr. Reiner Knizia as you visit iconic global cities in an attempt to solve ingenious conundrums. An expert in algorithmically generated logic problems and designer of over 300 board games, Dr. Reiner Knizia invites you to join him on the brilliant puzzle journey, Brain Voyage. Featuring 16 puzzle types each with five distinct varieties, specialist DS developer Razorback Developments has constructed a total of 80 mind-blowing puzzles ranging from easy to elaborately ambitious. Uncover the amazing secrets held within 16 exotic cities around the world as players track marine life off the coast of Cape Town, restore the ancient mosaics of Beijing, organize dancers at the Rio Carnival, memorize melodies at the Sydney Opera House, assemble the stone tablets of the Aztec ruins and more. Brain Voyage features a World Tour Mode plus three Random Play Modes allowing players to send games to their friends using the Nintendo Wi-Fi Connection and compete for the title of International Champion. [Eidos Interactive]… Expand"}, {"name": "Azurik: Rise of Perathia", "details_link": "https://www.metacritic.com/game/xbox/azurik-rise-of-perathia", "publisher": "Microsoft Game Studios", "release_date": "Nov 25 2001", "developers": ["Adrenium"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Fantasy"], "meta_score": 52, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/0/2550541e4b5ad2a6be2ea97befdb35aa-98.jpg", "descriptions": "Young Azurik must learn to control the elements by mastering the ultimate weapon, the Axion. His goal: Restore balance to the universe. As Azurik, you journey through a vast, mysterious land filled with dynamic and dangerous creatures."}, {"name": "Alien Rage", "details_link": "https://www.metacritic.com/game/pc/alien-rage", "publisher": "CI Games", "release_date": "Sep 24 2013", "developers": ["CI Games"], "platforms": ["PlayStation 3", "PlayStation 3", "Xbox 360", "Xbox 360", "PC"], "genres": ["Action", "Shooter", "Shooter", "First-Person", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 52, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/8/774bcb9f9fec0d5d0ef15a54b8b70122-98.jpg", "descriptions": "Unleash a fury of powerful weapons as you blast your way through armies of Alien forces hell-bent on taking you down. Battle through 14 intense levels and prepare to face a barrage of beastly-sized bosses that will test your every skill. Each of your 10 weapons comes with two firing modesUnleash a fury of powerful weapons as you blast your way through armies of Alien forces hell-bent on taking you down. Battle through 14 intense levels and prepare to face a barrage of beastly-sized bosses that will test your every skill. Each of your 10 weapons comes with two firing modes and you’ll need all of them. Battle hardened Alien forces will attack you from every direction using various flanking and attack moves. Built with powerful up-to-date graphics technology, awesome physics, destructible environments… experience an intense, old-school styled shooter game.… Expand"}, {"name": "X-Men: The Official Game", "details_link": "https://www.metacritic.com/game/pc/x-men-the-official-game", "publisher": "Activision", "release_date": "May 16 2006", "developers": ["Beenox"], "platforms": ["Xbox 360", "PC"], "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 52, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/2/18322ec1d078582885685782e731e084-98.jpg", "descriptions": "Master the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms asMaster the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms as lightning-fast Iceman. For even more power, utilize fury and adrenaline modes. Become a part of the X-Men movie universe—Embark on a globe-spanning conflict featuring every element of the X-Men universe—from favorite villains to famous locations such as Alkali Lake, plus the voices and likenesses of key actors from the films. Battle fierce enemies, join forces with comrades—Face off against movie villains such as Pyro, Magneto and Sabretooth, plus added foes like legions of Sentinels. Storm, Colossus and Cyclops join forces with you in gameplay that includes melee fighting, stealth-style action and time-based missions. [Activision]… Expand"}, {"name": "Star Horizon", "details_link": "https://www.metacritic.com/game/switch/star-horizon", "publisher": "No Gravity Games", "release_date": "May 14 2020", "developers": ["Orbital Knight sp. z o.o."], "platforms": ["iPhone/iPad", "PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Rail"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/3/7bffe3c000e08892ec1b5443b9b3e52e-98.jpg", "descriptions": "Experience fast action, thrilling levels, spectacular explosions and lots of pew-pew-pew. Star Horizon is a reboot for the on-rails space shooter genre."}, {"name": "Great War Nations: The Spartans", "details_link": "https://www.metacritic.com/game/pc/great-war-nations-the-spartans", "publisher": "DreamCatcher Interactive", "release_date": "May  5 2008", "developers": ["WorldForge"], "platforms": "PC", "num_players": "1-8 ", "genres": ["Strategy", "Real-Time", "Historic", "General", "Historic"], "meta_score": 52, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/7f9593bb93b214f1fae8b3a3bcb742cf-98.jpg", "descriptions": "Combine economic development with tactical real time battles, all fully rendered in glorious 3D in Great War Nations: The Spartans. Spanning two campaigns each with seven missions, take over control of the legendary people of Macedonia and Sparta.  You will fight alongside great heroes andCombine economic development with tactical real time battles, all fully rendered in glorious 3D in Great War Nations: The Spartans. Spanning two campaigns each with seven missions, take over control of the legendary people of Macedonia and Sparta.  You will fight alongside great heroes and bring peace to the city states of ancient Greece. Assemble your army and fight with your soldiers for wealth and peace, becoming more successful than even Alexander The Great. But beware: It will not be just your enemies who will envy you. [DreamCatcher Interactive]… Expand"}, {"name": "Aqua Moto Racing 3D", "details_link": "https://www.metacritic.com/game/3ds/aqua-moto-racing-3d", "publisher": "Zordix", "release_date": "Oct 10 2013", "developers": ["Zordix"], "platforms": "3DS", "genres": ["Driving", "Racing", "Arcade", "Arcade", "Other"], "meta_score": 52, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/8/122dc2e437e0264dc73d39ddc83ad7f6-98.jpg", "descriptions": "It's Aqua Moto Racing 3D!\r Experience the thrill of high-powered watercraft and break-neck stunts in a third dimension. Race through heaving oceans along sandy beaches in the Tropics, Greece and Egypt. Perform insane stunts and go around the buoys closely to charge your turbo and get theIt's Aqua Moto Racing 3D!\r Experience the thrill of high-powered watercraft and break-neck stunts in a third dimension. Race through heaving oceans along sandy beaches in the Tropics, Greece and Egypt. Perform insane stunts and go around the buoys closely to charge your turbo and get the edge against your opponents. Earn cash by participating in races and spend it on better watercraft. Unlock new Championships and Achievements on your quest for Legendary Status. Compete against your friends in local multiplayer mode.\r Get Ready For The Wave Ride Of Your Life!\r -Race rolling waves in exotic locations\r-Epic career mode with 12 watercraft\r-Show off your skills with extreme stunts… Expand"}, {"name": "Red Faction: Battlegrounds", "details_link": "https://www.metacritic.com/game/xbox-360/red-faction-battlegrounds", "publisher": "THQ", "release_date": "Apr  6 2011", "developers": ["THQ"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Simulation", "Shooter", "Shooter", "Vehicle", "Third-Person", "Combat", "Sci-Fi", "Sci-Fi", "Arcade"], "meta_score": 52, "users_score": 7.0, "image": "https://static.metacritic.com/images/products/games/1/3b75eda11aa7eb3ab4ab730ed43559b8-98.jpg", "descriptions": "The signature destructive gameplay from Red Faction: Guerrilla comes to the downloadable arcade with Red Faction: Battlegrounds! Jump into your favorite tank or mech using your Gauss Cannons, Rocket Launchers and Singularity Bombs to destroy the competition, and environment along with it.The signature destructive gameplay from Red Faction: Guerrilla comes to the downloadable arcade with Red Faction: Battlegrounds! Jump into your favorite tank or mech using your Gauss Cannons, Rocket Launchers and Singularity Bombs to destroy the competition, and environment along with it. Battle your way through treacherous Martian deserts, terraformed enclaves and more in a variety of different multiplayer modes and single player challenges. Rank up by defeating the competition and unlock new content including maps, vehicles, weapons and even items for the upcoming Xbox 360, PlayStation 3 system and PC game, Red Faction: Armageddon. … Expand"}, {"name": "Beyond Eyes", "details_link": "https://www.metacritic.com/game/playstation-4/beyond-eyes", "publisher": "Team17", "release_date": "Sep  8 2015", "developers": ["tiger & squid"], "platforms": ["PC", "Xbox One", "PlayStation 4"], "genres": ["Action Adventure", "General"], "meta_score": 52, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/2/38a25c79560907c1e5e7b59e90a85d74-98.jpg", "descriptions": "Beyond Eyes is a modern fairy tale about finding courage and friendship as you carefully guide young Rae on a life changing journey, uncovering an incredible world, step by step. Blinded as a young child, and reluctant to leave the protection of her family home, Raes world is once moreBeyond Eyes is a modern fairy tale about finding courage and friendship as you carefully guide young Rae on a life changing journey, uncovering an incredible world, step by step. Blinded as a young child, and reluctant to leave the protection of her family home, Raes world is once more shattered as Nani, her pet cat, goes missing. Summoning up all the courage she can muster, Rae learns to face her fears and ventures out into the world, to find her best friend.… Expand"}, {"name": "X-Men: The Official Game", "details_link": "https://www.metacritic.com/game/xbox-360/x-men-the-official-game", "publisher": "Activision", "release_date": "May 16 2006", "developers": ["Z-Axis", "Ltd."], "platforms": ["PC", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D", "3D"], "meta_score": 52, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/9/01faea192d04216c6d56f8e4602462c6-98.jpg", "descriptions": "Master the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms asMaster the power of the X-Men—Obliterate enemies and objects as Wolverine, using your lethal adamantium claws and crushing brute force. As Nightcrawler, scale walls, swing from rafters and teleport through environments to surprise enemies. Shoot ice bursts and create hailstorms as lightning-fast Iceman. For even more power, utilize fury and adrenaline modes. Become a part of the X-Men movie universe—Embark on a globe-spanning conflict featuring every element of the X-Men universe—from favorite villains to famous locations such as Alkali Lake, plus the voices and likenesses of key actors from the films. Battle fierce enemies, join forces with comrades—Face off against movie villains such as Pyro, Magneto and Sabretooth, plus added foes like legions of Sentinels. Storm, Colossus and Cyclops join forces with you in gameplay that includes melee fighting, stealth-style action and time-based missions. [Activision]… Expand"}, {"name": "World Series of Poker", "details_link": "https://www.metacritic.com/game/xbox/world-series-of-poker", "publisher": "Activision Value", "release_date": "Aug 31 2005", "developers": ["Activision Value"], "platforms": ["PC", "PlayStation 2", "Xbox"], "num_players": "10  Online", "genres": ["Miscellaneous", "Parlor", "Gambling"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/5/f1554dcf26c4c1a2d57473cad91ed98b-98.jpg", "descriptions": "World Series of Poker features the likenesses of poker professionals participating in the 2005 WSOP Tournament. The game offers players a truly unique experience unlike any other poker video game on the market today. For the first time ever, the 2005 WSOP Tournament will be held at Harrah'sWorld Series of Poker features the likenesses of poker professionals participating in the 2005 WSOP Tournament. The game offers players a truly unique experience unlike any other poker video game on the market today. For the first time ever, the 2005 WSOP Tournament will be held at Harrah's Rio Suites in Las Vegas, the same location simulated in the video game and the location of the 2005 Lifestyle Show. All the sanctioned poker various of the World Series of Poker are available, including Texas Hold 'Em, 7 Card Stud, Omaha, and 5 Card Draw. With the flexible character creator, the player can create his or her own poker face, wear Vegas-style threads and upgrade looks/clothes as he or she gains money.… Expand"}, {"name": "New Frontier Days: Founding Pioneers", "details_link": "https://www.metacritic.com/game/switch/new-frontier-days-founding-pioneers", "publisher": "Arc System Works", "release_date": "Mar  3 2017", "developers": ["Arc System Works"], "platforms": ["PC", "Switch"], "num_players": "No Online Multiplayer", "genres": ["Strategy", "Management", "Government", "Business / Tycoon"], "meta_score": 52, "users_score": 4.6, "image": "https://static.metacritic.com/images/products/games/3/3948a707579a47e36d4edb42de328a27-98.jpg", "descriptions": "New Frontier Days ~Founding Pioneers~ is a town-building simulation game, where you command your pioneers to colonize a new land. The pioneers are capable of \"Logging\", \"Mining\", \"Hunting\", \"Fishing\" and many others. Command them accordingly, and build your own town efficiently. [ASW]"}, {"name": "Jagged Alliance: Flashback", "details_link": "https://www.metacritic.com/game/pc/jagged-alliance-flashback", "publisher": "Full Control ApS", "release_date": "May 15 2014", "developers": ["Full Control ApS", "Full Control"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Strategy", "Turn-Based", "Historic", "Historic", "Tactics"], "meta_score": 52, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/5/a5acf08b53c786fdcf1dffd4982f79e6-98.jpg", "descriptions": "Jagged Alliance: Flashback is a tactical turn-based action game where you control and maintain squads of mercenaries off and on the battlefield."}, {"name": "Enemy Front", "details_link": "https://www.metacritic.com/game/pc/enemy-front", "publisher": "CI Games", "release_date": "Jun 10 2014", "developers": ["CI Games"], "platforms": ["PlayStation 3", "Xbox 360", "PC"], "genres": ["Shooter", "Historic", "Action", "Shooter", "First-Person", "Tactical", "Historic"], "meta_score": 52, "users_score": 5.5, "image": "https://static.metacritic.com/images/products/games/4/30122e368e42ca54cb2f01aa38fea688-98.jpg", "descriptions": "Enemy Front is the realistic tale of a hardened soldier dropped behind Nazi lines to engage in dynamic, diversified missions ranging from quick skirmishes, espionage assignments, and sabotage activities. The epic scope of Enemy Front spans several years and key battles as it progresses fromEnemy Front is the realistic tale of a hardened soldier dropped behind Nazi lines to engage in dynamic, diversified missions ranging from quick skirmishes, espionage assignments, and sabotage activities. The epic scope of Enemy Front spans several years and key battles as it progresses from the trenches of a desolate France right on through to Berlin and a secret weapons base. Once there, the player must thwart the plans for a terrifying weapon that will all but assure a global Nazis victory.… Expand"}, {"name": "Rabbids Land", "details_link": "https://www.metacritic.com/game/wii-u/rabbids-land", "publisher": "Ubisoft", "release_date": "Nov 18 2012", "developers": ["Ubisoft Paris"], "platforms": "Wii U", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 52, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/0/7bb33ff83ded99b74d562b73588b07a5-98.jpg", "descriptions": "Rabbids have a lot on their plate: princess castle, the pirate boat, haunted house, tunnel of love, roller coaster…there are over 20 + attractions waiting to be invaded!"}, {"name": "Lara Croft Tomb Raider: The Angel of Darkness", "details_link": "https://www.metacritic.com/game/playstation-2/lara-croft-tomb-raider-the-angel-of-darkness", "publisher": "Eidos Interactive", "release_date": "Jun 20 2003", "developers": ["Core Design Ltd."], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 52, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/4/6c97ad728f52173ee35c4a622e19d69e-98.jpg", "descriptions": "A series of grisly murders brings Lara into conflict with a sinister Alchemist from the past, and a secret alliance of powerful individuals shrouded in mystery.  At the center of these mysteries are the Obscura Paintings - five 14th century pieces of art that the Alchemist is desperate toA series of grisly murders brings Lara into conflict with a sinister Alchemist from the past, and a secret alliance of powerful individuals shrouded in mystery.  At the center of these mysteries are the Obscura Paintings - five 14th century pieces of art that the Alchemist is desperate to repossess.  Accused of the murder of her one time mentor, Werner Von Croy, Lara becomes a fugitive on the run. Pursued by the police, she follows the Alchemist into a dark world of blood, betrayal and vengeance where it is up to her to defeat this unholy alliance, and stop them from unleashing their incredible powers on the world. [Eidos Interactive]… Expand"}, {"name": "Star Trek: Voyager Elite Force", "details_link": "https://www.metacritic.com/game/playstation-2/star-trek-voyager-elite-force", "publisher": "Majesco Games", "release_date": "Dec  6 2001", "developers": ["Pipe Dream Interactive"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-4 ", "genres": ["Action", "Shooter", "First-Person", "Sci-Fi"], "meta_score": 52, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/5/104f2fbfa3ea0f531c8d6fc913605735-98.jpg", "descriptions": "One blast from destruction, the U.S.S. Voyager is mysteriously transported into a null space infested with danger. As part of the Voyager's Elite Hazard Team, you must defend it from a host of scavenging aliens, infiltrate a Borg cube and derelict vessels to eradicate your deadly foes.One blast from destruction, the U.S.S. Voyager is mysteriously transported into a null space infested with danger. As part of the Voyager's Elite Hazard Team, you must defend it from a host of scavenging aliens, infiltrate a Borg cube and derelict vessels to eradicate your deadly foes. [Majesco Sales Inc.]… Expand"}, {"name": "50 Cent: Bulletproof G Unit Edition", "details_link": "https://www.metacritic.com/game/psp/50-cent-bulletproof-g-unit-edition", "publisher": "Vivendi Games", "release_date": "Aug 29 2006", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "PSP"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Modern", "General", "Modern"], "meta_score": 52, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/2/c079a844b396a541ee35c1fea6d75aae-98.jpg", "descriptions": "Run the streets of New York as 50 Cent and G Unit as you seek revenge against those who shot you and left you for dead. Shoot, punch and throw enemies through 16 different levels featuring all new gameplay, over 30 new counterkill moves and a wide variety of firearms and melee weapons.Run the streets of New York as 50 Cent and G Unit as you seek revenge against those who shot you and left you for dead. Shoot, punch and throw enemies through 16 different levels featuring all new gameplay, over 30 new counterkill moves and a wide variety of firearms and melee weapons. Compete or cooperate in 5 different multiplayer modes for up to 6 players and customize your character with real world G-Unit clothing. Watch the exclusive G-Unit documentary available only on the PSP, or any of the 15 music videos or kick back and listen to over 160+ tracks of Classic, Current and Exclusive Music & Score. [Vivendi Games]… Expand"}, {"name": "Cocoto Fishing Master", "details_link": "https://www.metacritic.com/game/wii/cocoto-fishing-master", "publisher": "Neko Entertainment", "release_date": "Jun 16 2008", "developers": ["Neko Entertainment"], "platforms": ["PlayStation 2", "Wii"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Individual", "Nature", "Fishing", "Fishing"], "meta_score": 52, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/2/dd6b5183deb02ddfed4b1774f66bb0fe-98.jpg", "descriptions": "[WiiWare]  Welcome to the adventures of Cocoto, Fishing Master. Get ready for a completely new experience on Wii. Play the role of Cocoto and travel the world to find five millennial fish. Only they can stop the magic cauldron from overflowing with lava and prevent the world from being[WiiWare]  Welcome to the adventures of Cocoto, Fishing Master. Get ready for a completely new experience on Wii. Play the role of Cocoto and travel the world to find five millennial fish. Only they can stop the magic cauldron from overflowing with lava and prevent the world from being destroyed. Thanks to Cocoto Fishing Master for Wii, fishing has never been such fun. Use the Wii Remote™ and Nunchuk™ controllers like a real fishing rod to catch more than 30 different fish. Discover five enchanted lakes in five different worlds from Cocoto's universe. Confront gigantic bosses to collect each fragment of the statuette that will allow you to wake the great god Geo from his slumber. Meet Cocoto's friends, sell your fish to Baggy and buy new fishing equipment from Neuro's shop. [Neko Entertainment]… Expand"}, {"name": "Brunswick Pro Bowling", "details_link": "https://www.metacritic.com/game/wii/brunswick-pro-bowling", "publisher": "Crave", "release_date": "Aug 21 2007", "developers": ["Point of View"], "platforms": ["iPhone/iPad", "Wii"], "num_players": "4  Online", "genres": ["Sports", "Alternative", "Individual", "Bowling", "Bowling"], "meta_score": 52, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/8/29cc53e786d377a934113fec989230b1-98.jpg", "descriptions": "Real time changing lane conditions for the player to master during the course of a match. Work your way from an amateur to a true professional Brunswick Pro Champion. Authentic Brunswick bowling products to improve your character's performance. Ten different environments to choose from. [Crave]"}, {"name": "Bionicle Heroes", "details_link": "https://www.metacritic.com/game/playstation-2/bionicle-heroes", "publisher": "Eidos Interactive", "release_date": "Nov 14 2006", "developers": ["Traveller's Tales"], "platforms": ["PC", "Xbox 360", "PlayStation 2"], "num_players": "1 Player", "genres": ["Action Adventure", "Sci-Fi"], "meta_score": 52, "users_score": 8.8, "image": "https://static.metacritic.com/images/products/games/4/3923aa0f10cc9214dd557e11851de1d4-98.jpg", "descriptions": "Bionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by masteringBionicle Heroes brings to life the most powerful and exciting LEGO characters ever seen in one game, in an action-packed world of adventure and discovery. Take control of a young hero as he steps out of the real world and into the strange and dangerous universe of Bionicle. Only by mastering the powers and special abilities of the greatest Bionicle heroes will he be able to overcome the many challenges ahead. [Eidos Interactive]… Expand"}, {"name": "NBA Live 08", "details_link": "https://www.metacritic.com/game/wii/nba-live-08", "publisher": "EA Sports", "release_date": "Oct  1 2007", "developers": ["EA Canada"], "platforms": ["PC", "PlayStation 2", "PlayStation 3", "Xbox 360", "Wii"], "num_players": "1-4 ", "genres": ["Sports", "Traditional", "Team", "Basketball", "Sim", "Sim"], "meta_score": 52, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/4/5e0f7a68556408e7b0c829950a03ac24-98.jpg", "descriptions": "NBA Live 08 is fun for all on the Wii with a simple flick of the wrist. Get in on the ground floor of EA SPORTS basketball franchise and show-off your go-to Move on the Wii. The Wii allows you to actually perform a slam dunk by rotating your Wii remote downwards, or pull up for a jumper byNBA Live 08 is fun for all on the Wii with a simple flick of the wrist. Get in on the ground floor of EA SPORTS basketball franchise and show-off your go-to Move on the Wii. The Wii allows you to actually perform a slam dunk by rotating your Wii remote downwards, or pull up for a jumper by flicking the Wii remote up and down. Blow by the defense with a quick crossover by tilting the nunchuck left or right. Now you have 2 ways to play with EA SPORTS Family Play. Introducing a new multiplayer, social experience for EA SPORTS Wii games that allows novice users to compete against advanced players and still enjoy success. Take control of the action using just the Wii remote and let the AI take care of movement to take the glory as you drive to the basket. But if you’ve already got game, plug in your nunchuck and play with the advanced control setting to get the depth that you crave. Now everyone can dominate with your go-to move on NBA LIVE 08 for the Wii. [Electronic Arts]… Expand"}, {"name": "No Time to Explain", "details_link": "https://www.metacritic.com/game/xbox-one/no-time-to-explain", "publisher": "tiny Build GAMES", "release_date": "Jul 17 2015", "developers": ["tiny Build GAMES", "tinyBuild"], "platforms": ["PC", "PlayStation 4", "Xbox One"], "genres": ["Action", "Platformer", "2D"], "meta_score": 52, "users_score": 5.6, "image": "https://static.metacritic.com/images/products/games/3/0fcb0a269b12132f2cd27639cad43ff5-98.jpg", "descriptions": "No Time To Explain is a game about Time Paradoxes, Jetpack Guns and Ribs In People's Eyes. It's a comedy platformer featuring great music, voice acting and gameplay that becomes more ridiculous as you go."}, {"name": "The First Templar", "details_link": "https://www.metacritic.com/game/xbox-360/the-first-templar", "publisher": "Kalypso", "release_date": "May 17 2011", "developers": ["Haemimont", "Haemimont Games"], "platforms": ["PC", "Xbox 360"], "num_players": "2 ", "genres": ["Action Adventure", "Adventure", "General", "Historic", "General", "Historic"], "meta_score": 52, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/2/6b0fbe7f05cefc869764215f46b41d2b-98.jpg", "descriptions": "The First Templar follows the story of two main characters – a French Templar, and his companion, a noble lady who has been proclaimed a heretic. Taking control over these two unlikely allies, the player must uncover the mysteries behind the Templar Order, play a role in a grand conspiracy,The First Templar follows the story of two main characters – a French Templar, and his companion, a noble lady who has been proclaimed a heretic. Taking control over these two unlikely allies, the player must uncover the mysteries behind the Templar Order, play a role in a grand conspiracy, and discover the secret of the Holy Grail. The heroes face powerful opponents at every turn, in the face of the Saracen, King Philip IV of France and the Inquisition.… Expand"}, {"name": "Jack Keane 2: The Fire Within", "details_link": "https://www.metacritic.com/game/pc/jack-keane-2-the-fire-within", "publisher": "Nordic Games Publishing", "release_date": "Jun 28 2013", "developers": ["Deck 13"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General"], "meta_score": 52, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/8/64c4793dd81fbcd7a77c570f1129b012-98.jpg", "descriptions": "Jack Keane is back! And his newest adventure is even more fast-paced than ever before!\r Several years after his last adventure with Dr. T, the hapless but incorrigible hero, Jack Keane returns to experience the greatest adventure of his life alongside the beautiful Amanda. However he soonJack Keane is back! And his newest adventure is even more fast-paced than ever before!\r Several years after his last adventure with Dr. T, the hapless but incorrigible hero, Jack Keane returns to experience the greatest adventure of his life alongside the beautiful Amanda. However he soon realises once again that nothing goes quite as smoothly as Jack had imagined.\r Shanghai, 1899 -The mysterious Chinese city is the epicentre for adventurers of all kinds. Jack Keane, too, has been attracted to the place by rumours of a legendary treasure - or to be more precise, these tales have led him right inside the walls of the notorious Shanghai prison. It is within these walls that the guardian of the treasure, a secretive shaman, has been locked up for years. Unfortunately for our hero, Jack has completely disregarded the fact that it is a lot easier to get INTO prison than out of it\r And this is only the beginning of Jack Keane's newest bizarre adventure: mysterious treasures, ruthless villains, two distractingly beautiful women and tons of clever humour await the most lovable treasure hunter to have ever sailed the seven seas in a comical tour de force around the globe. During his travels, Jack will not only meet old friends, but also encounter new faces such as the elegant city-lady Eve and the brilliant German engineer Carl.\r Jack Keane 2 - The Fire Within is set to revolutionise the classic point & click adventure genre. Never has an adventure been as cinematic, fast-paced and humorous, without breaking any of the iconic point & click gameplay rules.\r State of the art 3D-graphics, gripping action-sequences and the typical bizarre Jack Keanesque humour will be an absolute delight to all adventure fans.\r Features\r - Control your characters directly with WASD, or switch to the classic Point & Click-Style\r- Experience the kind of love triangle we all know from everyday life movies\r- Explore your own mind (literally), chase zeppelins by car, and learn a wide array of fight-stances to counter your opponents frantic moves\r- Created by the developers of adventure hits such as Ankh, Jack Keane and Black Sails\r- State of the art 3D-graphics based on Deck 13s revolutionary FLEDGE engine\r- The mix of fast-paced action sequences and iconic point & click-gameplay makes Jack Keane 2 - The Fire Within a truly 21st Century adventure… Expand"}, {"name": "Syberia", "details_link": "https://www.metacritic.com/game/ds/syberia", "publisher": "DreamCatcher Interactive", "release_date": "Nov 25 2008", "developers": ["Microids", "Dreamcatcher"], "platforms": ["iPhone/iPad", "PC", "PlayStation 3", "Switch", "Xbox 360", "DS"], "num_players": "1 Player", "genres": ["Adventure", "General", "3D", "Third-Person", "Fantasy"], "meta_score": 52, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/486055b0024cd771da7b20201136a87a-98.jpg", "descriptions": "Leave behind the past and embrace a future of unpredictable events, as you encounter unique worlds, endearing characters and challenging puzzles. For Kate Walker, a sophisticated New York Attorney, the Voralberg Toy Company acquisition seemed like an easy task: a quick stop-over to a smallLeave behind the past and embrace a future of unpredictable events, as you encounter unique worlds, endearing characters and challenging puzzles. For Kate Walker, a sophisticated New York Attorney, the Voralberg Toy Company acquisition seemed like an easy task: a quick stop-over to a small alpine village in France to buy-out an old toy factory, then straight back home to New York. But deep in the alpine valleys, Kate uncovers a secret which starts her on a fascinating quest of discovery. Due to an unexpected twist, her business trip quickly becomes a journey across land and time throwing all she values into question, while the deal she set out to sign becomes a pact with destiny. [The Adventure Company]… Expand"}, {"name": "NeverDead", "details_link": "https://www.metacritic.com/game/xbox-360/neverdead", "publisher": "Konami", "release_date": "Jan 31 2012", "developers": ["Rebellion"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "Up to 4 ", "genres": ["Action Adventure", "Horror", "Horror", "Survival"], "meta_score": 52, "users_score": 5.7, "image": "https://static.metacritic.com/images/products/games/4/03a76addcadea71ee25bd3fb7292f088-98.jpg", "descriptions": "NEVERDEAD begins in the waking hours of peace and calm, when the world is under threat of being consumed by a demonic plague.  Centuries have passed since the world succumbed to an unforeseen shadow of evil, and a hero was made an immortal by demons. These demons have risen once again in theNEVERDEAD begins in the waking hours of peace and calm, when the world is under threat of being consumed by a demonic plague.  Centuries have passed since the world succumbed to an unforeseen shadow of evil, and a hero was made an immortal by demons. These demons have risen once again in the present day causing unrelenting mayhem reinforced by destructible environments within the game.  Now using his immortalic regenerative powers re-assembling his own body to evade death, the hero carries out the only salvation the world will know, for he is Never Dead.… Expand"}, {"name": "Sniper: Ghost Warrior 2", "details_link": "https://www.metacritic.com/game/xbox-360/sniper-ghost-warrior-2", "publisher": "City Interactive", "release_date": "Mar 12 2013", "developers": ["City Interactive"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 12 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Tactical", "Modern", "Modern"], "meta_score": 52, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/6/fb51b8a9227529c6a4b1a92b146a190c-98.jpg", "descriptions": "Assume the role of the deadliest sniper in an elite Ghost Warrior unit. Dug in deep within enemy territory, throw precision firepower and test your skills in a story of intrigue and betrayal. Feel the kill as you control your breathing and experience a realistic ballistics system. ExperienceAssume the role of the deadliest sniper in an elite Ghost Warrior unit. Dug in deep within enemy territory, throw precision firepower and test your skills in a story of intrigue and betrayal. Feel the kill as you control your breathing and experience a realistic ballistics system. Experience the single player campaign and multiplayer sniper battles. The game is powered by CryENGINE® 3 technology. … Expand"}, {"name": "Conflict: Denied Ops", "details_link": "https://www.metacritic.com/game/xbox-360/conflict-denied-ops", "publisher": "Eidos Interactive", "release_date": "Feb 12 2008", "developers": ["Pivotal Games"], "platforms": ["PC", "PlayStation 3", "Xbox 360"], "num_players": "Up to 16 ", "genres": ["Action", "Shooter", "Shooter", "First-Person", "Modern", "Modern", "Arcade"], "meta_score": 52, "users_score": 4.4, "image": "https://static.metacritic.com/images/products/games/8/f1b2bfa2a5d5e053a643be1fd931ad3b-98.jpg", "descriptions": "When the US government needs to act, but can not afford to be associated with the operation, deniable operatives are dispatched. Members of the unit must bear no identity; no objects, papers or clothing that could associate them with the government. Their task is to do anything necessary, noWhen the US government needs to act, but can not afford to be associated with the operation, deniable operatives are dispatched. Members of the unit must bear no identity; no objects, papers or clothing that could associate them with the government. Their task is to do anything necessary, no matter how ruthless, to dissolve the threat. Conflict: Denied Ops puts players in control of two of these merciless operatives, each of them highly specialized in both weapons and military tactics. With gameplay focused on accessible two-man tactics, utilize simple commands and switch seamlessly between team mates to lay down covering fire, explore diverging paths, create distractions and pin the enemy under fire. Making full use of Pivotal's Puncture Technology, Conflict: Denied Ops features a highly destructible environment, allowing players to utilize tactics such as shooting through walls to create sniping holes or blasting open new paths to take the enemy by surprise. Fighting for a good cause, does not mean they have to play by the rules. Brutalize the opposition, blast down buildings, and destroy everything in true Hollywood fashion – all throughout politically sensitive areas across South America, Africa and Russia. [Eidos Interactive]… Expand"}, {"name": "Dawn of Magic", "details_link": "https://www.metacritic.com/game/pc/dawn-of-magic", "publisher": "Atari", "release_date": "Oct 23 2007", "developers": ["1C", "Sky Fallen", "1C Entertainment"], "platforms": "PC", "num_players": "16  Online", "genres": ["Role-Playing", "Third-Person", "Action RPG"], "meta_score": 52, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/a15b97fa3adc0461000468bce2e570fa-98.jpg", "descriptions": "An immortal named Modo has been sent to live a full mortal life on earth as punishment for his crimes in the Absolute, the realm of the afterlife. Angered by this humiliation, the mortal Modo is determined to not only reclaim all his previous power, but gain enough strength to destroy theAn immortal named Modo has been sent to live a full mortal life on earth as punishment for his crimes in the Absolute, the realm of the afterlife. Angered by this humiliation, the mortal Modo is determined to not only reclaim all his previous power, but gain enough strength to destroy the Earth once and for all, so that he may never be punished in such a base way again. As the story’s hero, the player must stop Modo’s heinous plans and ultimately destroy him, or aid Modo in his quest to annihilate the Earth. [Deep Silver]… Expand"}, {"name": "Hi Hi Puffy AmiYumi: The Genie & the Amp", "details_link": "https://www.metacritic.com/game/ds/hi-hi-puffy-amiyumi-the-genie-the-amp", "publisher": "D3Publisher", "release_date": "Jun 27 2006", "developers": ["Sensory Sweep"], "platforms": "DS", "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 52, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/9/3bedde360acecb1e0e8bc94de700d586-98.jpg", "descriptions": "Follow the fantastic adventures of two very cool pop-stars in HiHi Puffy AmiYumi: The Genie & the Amp. A massive writer's block is thwarting the girls' attempts to finish their new album. Frustrated, Ami and Yumi kick a dusty amplifier, releasing a genie! Using the genie as a guide andFollow the fantastic adventures of two very cool pop-stars in HiHi Puffy AmiYumi: The Genie & the Amp. A massive writer's block is thwarting the girls' attempts to finish their new album. Frustrated, Ami and Yumi kick a dusty amplifier, releasing a genie! Using the genie as a guide and helper, Ami and Yumi collect musical notes from 10 time periods. Playing as Ami or Yumi, you solve challenging puzzles, battle scary enemies and unlock minigames in single-player or two-player wireless co-op mode. [Nintendo]… Expand"}, {"name": "Pixel Gear", "details_link": "https://www.metacritic.com/game/playstation-4/pixel-gear", "publisher": "Oasis Games", "release_date": "Oct 20 2016", "developers": ["Geronimo Interactive"], "platforms": ["PC", "PlayStation 4"], "genres": ["Action", "Shooter", "First-Person", "Arcade"], "meta_score": 51, "users_score": 4.8, "image": "https://static.metacritic.com/images/products/games/2/e638dc9d3801b083540d248b91093f0f-98.jpg", "descriptions": "Pixel Gear is a pixel style VR shoot-em-up with a variety of humorous cartoon monsters and ghosts as enemies. Utlize your skills and weapons to defeat them, gain energy, and apply your skills wisely to slow down time and load up infinite bullets. Observe the environment carefully. And keepPixel Gear is a pixel style VR shoot-em-up with a variety of humorous cartoon monsters and ghosts as enemies. Utlize your skills and weapons to defeat them, gain energy, and apply your skills wisely to slow down time and load up infinite bullets. Observe the environment carefully. And keep on shooting in the pixel battlefield. [Playstation.com]… Expand"}, {"name": "The Waylanders", "details_link": "https://www.metacritic.com/game/pc/the-waylanders", "publisher": "Gato Salvaje Studio", "release_date": "Feb  2 2022", "developers": ["Gato Salvaje Studio"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action RPG", "Role-Playing", "Western-Style"], "meta_score": 51, "users_score": 1.9, "image": "https://static.metacritic.com/images/products/games/8/c03c60fcf50b6b07f66181913b364d1b-98.jpg", "descriptions": "The Waylanders is a classic party-based RPG featuring some of the top-talents who brought well-known titles within the genre like the Dragon Age, Mass Effect or Pillars of Eternity sagas."}, {"name": "Balan Wonderworld", "details_link": "https://www.metacritic.com/game/playstation-5/balan-wonderworld", "publisher": "Square Enix", "release_date": "Mar 26 2021", "developers": ["Square Enix", "Arzest", "Balan Company"], "platforms": ["PC", "PlayStation 4", "Switch", "Xbox One", "Xbox Series X", "PlayStation 5"], "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "3D"], "meta_score": 51, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/1/135091d50217919a7bee4829330e412a-98.jpg", "descriptions": "BALAN WONDERWORLD is an action platformer game themed around the Balan Theatre. Led by the enigmatic maestro named Balan, the stars of the show Emma and Leo will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land ofBALAN WONDERWORLD is an action platformer game themed around the Balan Theatre. Led by the enigmatic maestro named Balan, the stars of the show Emma and Leo will use special abilities from a multitude of characterful costumes as they adventure in the bizarre and imaginary land of Wonderworld. Here memories and vistas from the real world mix with the things that people hold dear. Twelve different tales await our stars in the Wonderworld, each with their own unique quirks. They will explore all corners of these labyrinthine stages, filled with a myriad of tricks and traps, to get to the heart of each story.… Expand"}, {"name": "Dinocide", "details_link": "https://www.metacritic.com/game/pc/dinocide", "publisher": "AtomicTorch", "release_date": "Jan 21 2016", "developers": ["AtomicTorch"], "platforms": "PC", "num_players": "No Online Multiplayer", "genres": ["Action", "Platformer", "2D"], "meta_score": 51, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/1/c5ae4364d35e86f2cc2037b451c882f7-98.jpg", "descriptions": "A classic NES inspired old-school single-player platformer in a prehistoric fantasy world. Dinocide tries to capture the drive and fun of that era and recreate it in a modern way."}, {"name": "Bird Mania 3D", "details_link": "https://www.metacritic.com/game/3ds/bird-mania-3d", "publisher": "Teyon", "release_date": "May  3 2012", "developers": ["Teyon"], "platforms": "3DS", "num_players": "1 Player", "genres": ["Action", "Platformer", "Platformer", "Arcade", "2D", "2D"], "meta_score": 51, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/9/e85f4546499548f997dc5684cd6c7433-98.jpg", "descriptions": "Bird Mania 3D has players take the role of Mojo as he begins a frantic chase after his friends so he can go on vacation too."}, {"name": "Unbound Saga", "details_link": "https://www.metacritic.com/game/xbox-360/unbound-saga", "publisher": "Vogster Entertainment, LLC", "release_date": "Dec  1 2010", "developers": ["Vogster"], "platforms": "Xbox 360", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/500447f44a396e8733466a8122fa1b2c-98.jpg", "descriptions": "Unbound Saga is a 3D side-scrolling brawler based on the upcoming comic book of the same name to be published by Dark Horse Comics, a leading publisher of comic books and graphic novels. Unbound Saga is set in a satirical comic book universe, where enemies are drawn onto the screen andUnbound Saga is a 3D side-scrolling brawler based on the upcoming comic book of the same name to be published by Dark Horse Comics, a leading publisher of comic books and graphic novels. Unbound Saga is set in a satirical comic book universe, where enemies are drawn onto the screen and madcap battles travel from panel to panel through a twisted, post-apocalyptic landscape. Break off a weapon and rage off the page!… Expand"}, {"name": "Rampage: Total Destruction", "details_link": "https://www.metacritic.com/game/playstation-2/rampage-total-destruction", "publisher": "Midway", "release_date": "Apr 24 2006", "developers": ["Pipeworks Software", "Inc."], "platforms": "PlayStation 2", "num_players": "1-2 ", "genres": ["Action", "General"], "meta_score": 51, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/4/7ca2c09f73ecaa0e90a07f4c12401ab9-98.jpg", "descriptions": "Rampage: Total Destruction offers a fresh take on an arcade classic complete with everyone's favorite monsters: George, Lizzie, and Ralph, along with a variety of new monsters to collect and play. Virtually everything in the environment can be damaged, broken, and utterly destroyed withRampage: Total Destruction offers a fresh take on an arcade classic complete with everyone's favorite monsters: George, Lizzie, and Ralph, along with a variety of new monsters to collect and play. Virtually everything in the environment can be damaged, broken, and utterly destroyed with plenty of hilarious results. Aided by power-ups, the Rampage: Total Destruction monsters are capable of acquiring a number of upgrades throughout the course of a single campaign. Players can annihilate cities all over the world in either one or two player mode in this reinvention of the Midway classic. [Midway]… Expand"}, {"name": "Inuyasha: The Secret of the Cursed Mask", "details_link": "https://www.metacritic.com/game/playstation-2/inuyasha-the-secret-of-the-cursed-mask", "publisher": "Bandai", "release_date": "Nov  2 2004", "developers": ["Kamui"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Role-Playing", "Console-style RPG"], "meta_score": 51, "users_score": 8.1, "image": "https://static.metacritic.com/images/products/games/7/0f1bee3bdf0d4b86214dc80307dce1eb-98.jpg", "descriptions": "Explore the fascinating world of Inuyasha and encounter your favorite characters from the hit Cartoon Network TV series in this highly anticipated RPG by Bandai. As one of 2 original characters created especially for the game, you will find yourself back in feudal era Japan. How will you getExplore the fascinating world of Inuyasha and encounter your favorite characters from the hit Cartoon Network TV series in this highly anticipated RPG by Bandai. As one of 2 original characters created especially for the game, you will find yourself back in feudal era Japan. How will you get back to the present day? Can you unravel the mystery of the Cursed Mask? Encounter and build relationships with your favorite characters from the TV series ? as seen on Cartoon Network. Includes more than 30 minutes of exclusive anime footage made especially for the game. Encounter all your favorite characters from the hit TV series. The relationships you make will affect the outcome of your adventure. [Bandai]… Expand"}, {"name": "Fast Lanes Bowling", "details_link": "https://www.metacritic.com/game/pc/fast-lanes-bowling", "publisher": "Enlight Software", "release_date": "Jan  7 2004", "developers": ["Lab Rats Games"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Alternative", "Bowling", "Bowling"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/6/da8de5ee4d85771a05c85d7c95143721-98.jpg", "descriptions": "No more waiting for lanes and renting shoes! You own the entire alley with Fast Lanes Bowling, the latest and greatest bowling simulation to hit the PC. Fast Lanes Bowling is a bowler's dream-come-true with incredibly detailed environments and characters, brought to life in fully renderedNo more waiting for lanes and renting shoes! You own the entire alley with Fast Lanes Bowling, the latest and greatest bowling simulation to hit the PC. Fast Lanes Bowling is a bowler's dream-come-true with incredibly detailed environments and characters, brought to life in fully rendered 3D. Bowl in a variety of fantastic locations, knocking down the pins aboard a moving pirate ship, or catching the 7-10 split on the pier of a remote tropical island - play with the most advanced and realistic bowling physics to date, in a total of twelve day and night environments or even in your local bowl-o-rama! [Enlight Software]… Expand"}, {"name": "OVERKILL's The Walking Dead", "details_link": "https://www.metacritic.com/game/pc/overkills-the-walking-dead", "publisher": "Starbreeze", "release_date": "Nov  6 2018", "developers": ["Starbreeze"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Sci-Fi", "Action", "Shooter", "First-Person", "Arcade"], "meta_score": 51, "users_score": 5.2, "image": "https://static.metacritic.com/images/products/games/6/5fd36e7f3289710786db032419d52479-98.jpg", "descriptions": "OVERKILL’s The Walking Dead is a co-op first person shooter with elements of action, role-playing, survival horror and stealth, that invites players to explore the hugely popular The Walking Dead universe, where they will play the role of survivors fending for themselves in aOVERKILL’s The Walking Dead is a co-op first person shooter with elements of action, role-playing, survival horror and stealth, that invites players to explore the hugely popular The Walking Dead universe, where they will play the role of survivors fending for themselves in a post-apocalyptic world dominated by flesh-eating walkers. In 2016 Washington will fall – what will you do?… Expand"}, {"name": "The Haunted: Hell's Reach", "details_link": "https://www.metacritic.com/game/pc/the-haunted-hells-reach", "publisher": "THQ", "release_date": "Oct 24 2011", "developers": ["ValuSoft"], "platforms": "PC", "genres": ["Action Adventure", "Adventure", "General", "General", "Survival"], "meta_score": 51, "users_score": 7.5, "image": "https://static.metacritic.com/images/products/games/1/31fbd7707061cb12195ab81f7e8aa931-98.jpg", "descriptions": "Battle your way through the depths of hell in The Haunted: Hells Reach."}, {"name": "The Hustle: Detroit Streets", "details_link": "https://www.metacritic.com/game/psp/the-hustle-detroit-streets", "publisher": "Activision Value", "release_date": "Oct 25 2005", "developers": ["Blade Interactive"], "platforms": ["PlayStation 2", "PSP"], "num_players": "2 ", "genres": ["Sports", "Miscellaneous", "Parlor", "Individual", "Billiards", "Billiards"], "meta_score": 51, "users_score": 5.3, "image": "https://static.metacritic.com/images/products/games/9/34c7b3f90b440cdd4755f9e4eeb15974-98.jpg", "descriptions": "The Hustle: Detroit Streets lets players take on the role of either Jack Stone or Kat Hudson as they make their way through the pool halls and clubs of Detroit. Players hone their pool skills and work their way to the top of the pool circuit through two different game modes - single-playerThe Hustle: Detroit Streets lets players take on the role of either Jack Stone or Kat Hudson as they make their way through the pool halls and clubs of Detroit. Players hone their pool skills and work their way to the top of the pool circuit through two different game modes - single-player story mode, playing as either Jack or Kat in their quest for respect and cash, or single-player single game, where they can practice their skills by playing one-off matches against AI opponents. Additionally, for the PSP system, players can play pool using multiplayer and multiplayer over Wi-Fi where they can try to run the table against other gaming pool sharks. All of the modes feature a number of trickshots and challenges, which allow players to earn prize money, face off against other players and buy new items such as clothes and cues at local shops. Players make their money gambling on their own matches, hustling, betting on shots (spot betting) and betting on other pool matches. As players progress through the game and meet certain criteria, different game play modes and items are unlocked. Challenges, new venues, different clothes and characters unique to each venue become available as players climb their way to the top of their pool game. [Activision]… Expand"}, {"name": "Syberia 3", "details_link": "https://www.metacritic.com/game/pc/syberia-3", "publisher": "Ubisoft", "release_date": "Apr 20 2017", "developers": ["Microids"], "platforms": ["PlayStation 4", "Switch", "Xbox One", "PC"], "num_players": "No Online Multiplayer", "genres": ["Modern", "Adventure", "3D", "Third-Person"], "meta_score": 51, "users_score": 5.8, "image": "https://static.metacritic.com/images/products/games/4/69f21aa6acdee5b75905a80e650d5df5-98.jpg", "descriptions": "The next generation in adventure games, Syberia 3 takes you inside an enchanting, mysterious universe full of life for you to explore in 3D. Plunged into the heart of a world inhabited by a cast of interesting characters, you'll discover and experience a fabulous tale as imagined by Benoit Sokal."}, {"name": "SuperPower 2", "details_link": "https://www.metacritic.com/game/pc/superpower-2", "publisher": "DreamCatcher Interactive", "release_date": "Oct 11 2004", "developers": ["GolemLabs"], "platforms": "PC", "num_players": "32  Online", "genres": ["Strategy", "Real-Time", "Modern", "General", "Modern"], "meta_score": 51, "users_score": 7.9, "image": "https://static.metacritic.com/images/products/games/9/49c0a9e14ac51e9c7495631d9dabeabd-98.jpg", "descriptions": "SuperPower 2 gives gamers 'God-like' powers as they seek world domination. The game demands intelligence, political-savvy and a touch of guile to succeed! With the addition of multiplayer support, the game also brings a new edge to the genre. SuperPower 2 further improves on the originalSuperPower 2 gives gamers 'God-like' powers as they seek world domination. The game demands intelligence, political-savvy and a touch of guile to succeed! With the addition of multiplayer support, the game also brings a new edge to the genre. SuperPower 2 further improves on the original with new 3D graphics, improved missions and a wickedly intelligent A.I. The game features 193 real countries, each equipped with realistic data drawn from the U.S. Military's databases. Sophisticated A.I. designed to realistically simulate each country. Real-life combat situations, with multiple forces joining and leaving battles as the balance of power shifts. [DreamCatcher Interactive]… Expand"}, {"name": "Alien Syndrome", "details_link": "https://www.metacritic.com/game/psp/alien-syndrome", "publisher": "Sega", "release_date": "Jul 24 2007", "developers": ["Totally Games"], "platforms": "PSP", "num_players": "1-4 ", "genres": ["Role-Playing", "Action RPG", "Action RPG"], "meta_score": 51, "users_score": 6.4, "image": "https://static.metacritic.com/images/products/games/5/f1d88fc96ad90448f3d1ddc84d14eaa3-98.jpg", "descriptions": "In Alien Syndrome, players take control of the game's strong and enigmatic heroine – Earth Command Trooper Aileen Harding – and battle a variety of fearsome aliens and colossal bosses. Gamers choose from a wide selection of character specialties and skills as they progress through anIn Alien Syndrome, players take control of the game's strong and enigmatic heroine – Earth Command Trooper Aileen Harding – and battle a variety of fearsome aliens and colossal bosses. Gamers choose from a wide selection of character specialties and skills as they progress through an engrossing campaign, protected by many different types of armor and using a variety of melee and ranged weaponry. Players can improve their heroine's statistics and discover a huge number of powerful new abilities as they fight through infested spaceships and bizarre alien planets. Alien Syndrome features two fast-paced action-RPG modes – the dramatic and engaging single-player campaign, plus an infinitely replayable co-op multiplayer mode for up to four players. Derived from the classic SEGA arcade game, Alien Syndrome's new action-RPG gameplay makes it easy to pick up and play, while its depth and wealth of features and missions keeps it challenging for all gamers. Alien Syndrome features 20 different weapons including flamethrowers, quad-barreled lasers, nanobot swarms that dissolve enemies, and incendiary grenades that shoot fire geysers from the ground. Each weapon offers advantages and disadvantages, dependent upon how it is used and the specializations players have chosen to adopt. Alien Syndrome's fast-paced combat also allows for any number of combat strategies to defeat over 100 different alien enemies at one time. [Sega]… Expand"}, {"name": "Pirates of the Caribbean: The Legend of Jack Sparrow", "details_link": "https://www.metacritic.com/game/playstation-2/pirates-of-the-caribbean-the-legend-of-jack-sparrow", "publisher": "Bethesda Softworks", "release_date": "Jun 28 2006", "developers": ["7 Studios"], "platforms": ["PC", "PlayStation 2"], "num_players": "1-2 ", "genres": ["Action Adventure", "Historic"], "meta_score": 51, "users_score": 7.4, "image": "https://static.metacritic.com/images/products/games/3/6f85e0fdc3d2b10f5e9dc98423840df6-98.jpg", "descriptions": "A sequel to the original Pirates of the Caribbean, Pirates of the Caribbean: The Legend of Jack Sparrow features a blend of fast-paced action and adventure that captures the entertaining characters, settings, and spirit of the first movie. Piracy, smuggling, buried treasure (not to mentionA sequel to the original Pirates of the Caribbean, Pirates of the Caribbean: The Legend of Jack Sparrow features a blend of fast-paced action and adventure that captures the entertaining characters, settings, and spirit of the first movie. Piracy, smuggling, buried treasure (not to mention kidnapping, sword fighting looting, pilfering, and other acts of villainy)...what's not to love about Captain Jack Sparrow?  Jack Sparrow is the ultimate video game character - with his cocky swagger and his offbeat personality - and players are be able to experience his adventures first hand in this action game. Gamers slash and hack their way through a dozen locations, with fully interactive levels and varied gameplay.  The action takes place in a variety of lush, immersive settings, including burning buildings, wrecked ships, and misty moonlit caves. The gameplay experience finds gamers fighting hordes of their enemies one minute, while in the next they're evading capture by the Royal Navy. Gamers learn new moves and combos as the game progresses, allowing even more spectacular, and deadly attacks during combat. [Bethesda Softworks]… Expand"}, {"name": "Eat Lead: The Return of Matt Hazard", "details_link": "https://www.metacritic.com/game/playstation-3/eat-lead-the-return-of-matt-hazard", "publisher": "D3Publisher", "release_date": "Feb 26 2009", "developers": ["Vicious Cycle"], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "No Online Multiplayer", "genres": ["Action", "Shooter", "Shooter", "Third-Person", "Modern", "Modern", "Arcade"], "meta_score": 51, "users_score": 6.0, "image": "https://static.metacritic.com/images/products/games/5/aff45e92d98504a55198f4f7de5c94d8-98.jpg", "descriptions": "In Eat Lead: The Return of Matt Hazard, videogame action hero Matt Hazard gets his chance to prove once and for all that he is the king of shooters when the new owner of mega game publisher, Marathon Megasoft, gives Matt his comeback role starring in a new title for next-gen consoles thatIn Eat Lead: The Return of Matt Hazard, videogame action hero Matt Hazard gets his chance to prove once and for all that he is the king of shooters when the new owner of mega game publisher, Marathon Megasoft, gives Matt his comeback role starring in a new title for next-gen consoles that pits him against all of his memorable foes from videogames past. In the world of Eat Lead, however, everything stops being a game and becomes reality when it is clear that someone is using the new game to bring about Matt’s death once and for all. With only the mysterious QA to help him, Matt must fight against a legion of Marathon Megasoft catalogue of videogame characters to keep it from being Game Over forever. Eat Lead pays homage to the games of yesteryear with a menagerie of classic enemies such as zombies, space marines, cowboys, genetically mutated super snipers, and more and an expansive level environment design that reflects videogame history in a next-gen package. The game fires on all cylinders with explosive artillery and combat moves to help gamers escape from a variety of predicaments including radically-changing environments during gameplay via hack effects Hazard's nemesis uses by altering the game’s code on the fly. Throughout the adventure, players utilize a strategic cover system dubbed point and cover, upgradeable weapons and different interactive melee moves to attack and outsmart foes. [D3Publisher]… Expand"}, {"name": "Dragon Ball Z: Sagas", "details_link": "https://www.metacritic.com/game/xbox/dragon-ball-z-sagas", "publisher": "Atari", "release_date": "Mar 22 2005", "developers": ["Avalanche Software"], "platforms": ["PlayStation 2", "Xbox"], "num_players": "1-2 ", "genres": ["Action", "Beat-'Em-Up"], "meta_score": 51, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/2/3d2ceeea01551d3080d9aca5ea2481d5-98.jpg", "descriptions": "Join characters from the Dragon Ball Z animated series as they journey from the Saivan Saga through the Cell Games. You'll face a host of enemies, including Radiz, Nappa, Captain Ginyu, and Cell--each equipped with unique powers that you can inherit. The Dragon Ball Z world features fullyJoin characters from the Dragon Ball Z animated series as they journey from the Saivan Saga through the Cell Games. You'll face a host of enemies, including Radiz, Nappa, Captain Ginyu, and Cell--each equipped with unique powers that you can inherit. The Dragon Ball Z world features fully destructible battlefields, bonus areas, and other hidden surprises. Discover all the secrets in the single-player campaign, or challenge a friend in the two-player mode.… Expand"}, {"name": "Crime Boss: Rockay City", "details_link": "https://www.metacritic.com/game/pc/crime-boss-rockay-city", "publisher": "505 Games", "release_date": "Mar 28 2023", "developers": ["InGame Studios"], "platforms": "PC", "num_players": "Up to 4 ", "genres": ["Action Adventure", "Open-World"], "meta_score": 51, "users_score": 5.4, "image": "https://static.metacritic.com/images/products/games/5/107d5839663fdbb8cc83ac4d95a688fb-98.jpg", "descriptions": "Rockay City. A thriving metropolis with excitement buzzing from the sandy bay to the towering skyscrapers. But beyond the glamour, there is a fierce turf war raging on... After the demise of the previous crime boss, there's an open vacancy for a new King of Rockay City - but it isn't justRockay City. A thriving metropolis with excitement buzzing from the sandy bay to the towering skyscrapers. But beyond the glamour, there is a fierce turf war raging on... After the demise of the previous crime boss, there's an open vacancy for a new King of Rockay City - but it isn't just you who is fighting for the throne. Choose your crew based on their skills and expertise, and execute daring missions with the hopes of walking away with the cash, the turf and, ultimately, the crown.\r Crime Boss: Rockay City is an organized crime game combining first-person shooter action and turf wars, playable solo or with friends. Take on the role of Travis Baker - a man with his sights set on becoming the new King of Rockay City, one crime at a time...… Expand"}, {"name": "Le Tour de France 2013 - 100th Edition", "details_link": "https://www.metacritic.com/game/xbox-360/le-tour-de-france-2013---100th-edition", "publisher": "Focus Home Interactive", "release_date": "Jul  4 2014", "developers": ["Cyanide"], "platforms": ["PlayStation 3", "Xbox 360"], "num_players": "No Online Multiplayer", "genres": ["Sports", "Alternative", "Individual", "Biking", "Biking"], "meta_score": 51, "users_score": 5.9, "image": "https://static.metacritic.com/images/products/games/8/0ffeeb7bfb5ed8cc08b19f150e9b100f-98.jpg", "descriptions": "An Exceptional 100th Edition!Take control of the greatest champions during a Tour de France 2013 full of new features! With a more dynamic gameplay and a new graphic engine, live 21 official stages more realistic than ever. Build your race strategies, reach your objectives and win theAn Exceptional 100th Edition!Take control of the greatest champions during a Tour de France 2013 full of new features! With a more dynamic gameplay and a new graphic engine, live 21 official stages more realistic than ever. Build your race strategies, reach your objectives and win the yellow jersey to become the new Legend of Le Tour!- Total control of the trajectory- Races more realistic than ever- Multiplayer Modes: Coop and Versus… Expand"}, {"name": "Fuel Overdose", "details_link": "https://www.metacritic.com/game/playstation-3/fuel-overdose", "publisher": "I-FRIQIYA", "release_date": "Mar  5 2013", "developers": ["I-FRIQIYA"], "platforms": "PlayStation 3", "genres": ["Simulation", "Driving", "Car Combat", "Car Combat", "Vehicle", "Combat"], "meta_score": 51, "users_score": 3.0, "image": "https://static.metacritic.com/images/products/games/1/72bbb5052892d4e9150892e9192f91fd-98.jpg", "descriptions": "Fuel Overdose is an action racing experience with customizable weapons and vehicles, grappling hooks, climatic catastrophes, and a whole fighting system that you can utilize to finish first."}, {"name": "Warlords", "details_link": "https://www.metacritic.com/game/xbox-360/warlords", "publisher": "Atari", "release_date": "May 28 2008", "developers": ["Stainless Games"], "platforms": "Xbox 360", "num_players": "4  Online", "genres": ["Action", "General", "General"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/8/5eabcd17d35ce4ea65eb60df07e2b15a-98.jpg", "descriptions": "[Xbox Live Arcade]  Warlords is one of the classic multiplayer experiences of the coin-op era. You and three other players (A.I. controlled or Human), join together in a Breakout-style battle, each controlling a paddle protecting their own castle from rebounding fireballs. Use your skill to[Xbox Live Arcade]  Warlords is one of the classic multiplayer experiences of the coin-op era. You and three other players (A.I. controlled or Human), join together in a Breakout-style battle, each controlling a paddle protecting their own castle from rebounding fireballs. Use your skill to deflect these missiles onto other players’ castles. Once you breach each opponent's walls, it's game over for them, until the last man standing wins the day. [Atari]… Expand"}, {"name": "Malice", "details_link": "https://www.metacritic.com/game/playstation-2/malice", "publisher": "Mud Duck Productions", "release_date": "Jun  2 2004", "developers": ["Argonaut Games"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 51, "users_score": 6.3, "image": "https://static.metacritic.com/images/products/games/4/e027b92bffd5b4edf9aa518c33b1af55-98.jpg", "descriptions": "Venture into the warped reality of Malice where the evil fire god, Nefarious Rex, has fractured the time-lines and set the world ablaze. The world's only hope rests in the hands of the most unlikely hero, Malice. As Malice you must unravel the mystery surrounding your demise, battle Rex'sVenture into the warped reality of Malice where the evil fire god, Nefarious Rex, has fractured the time-lines and set the world ablaze. The world's only hope rests in the hands of the most unlikely hero, Malice. As Malice you must unravel the mystery surrounding your demise, battle Rex's twisted minions, and fix the shattered time-lines in order to save a world gone mad.  [Sierra]… Expand"}, {"name": "007 Racing", "details_link": "https://www.metacritic.com/game/playstation/007-racing", "publisher": "Electronic Arts", "release_date": "Nov 20 2000", "developers": ["Eutechnyx"], "platforms": "PlayStation", "genres": ["Driving", "Mission-based"], "meta_score": 51, "users_score": 5.0, "image": "https://static.metacritic.com/images/products/games/5/e88f384d20dc4a05dcb5465979783619-98.jpg", "descriptions": "Pay attention, 007. This is for your eyes only. Q-Branch has re-engineered some of your favorite automobiles with additional gadgets and firepower. You'll need everything they've got, plus your own uncanny ability to beat the odds. The free world is depending on you. Oh, and one other thingPay attention, 007. This is for your eyes only. Q-Branch has re-engineered some of your favorite automobiles with additional gadgets and firepower. You'll need everything they've got, plus your own uncanny ability to beat the odds. The free world is depending on you. Oh, and one other thing before you go, 007 - try to bring them back in one piece.… Expand"}, {"name": "Sydney 2000", "details_link": "https://www.metacritic.com/game/pc/sydney-2000", "publisher": "Eidos Interactive", "release_date": "Aug 25 2000", "developers": ["Attention To Detail"], "platforms": "PC", "num_players": "1-4 ", "genres": ["Sports", "Olympic Sports", "Olympic Sports", "Individual", "Athletics"], "meta_score": 51, "users_score": 4.9, "image": "https://static.metacritic.com/images/products/games/3/0af82e263c1a3d0edd8b66123667d642-98.jpg", "descriptions": "Let the games begin, Mate! Get ready to compete against your friends in 12 challenging events including 110M Hurdles, High Jump, 10M Platform Diving, Sprint Cycling, and much more!  [Eidos Interactive]"}, {"name": "Spy Hunter", "details_link": "https://www.metacritic.com/game/playstation-vita/spy-hunter", "publisher": "Warner Bros. Interactive Entertainment", "release_date": "Oct  9 2012", "developers": ["TT Fusion"], "platforms": ["3DS", "PlayStation Vita"], "num_players": "Up to 4 ", "genres": ["Driving", "Racing", "Mission-based", "Arcade", "Mission-based", "Automobile"], "meta_score": 51, "users_score": 6.5, "image": "https://static.metacritic.com/images/products/games/3/e10973bfdcee34e7e9b4024e3b2ddb58-98.jpg", "descriptions": "On the eve of the franchise's 30th anniversary since the original Spy Hunter was released to arcades in 1983, the new Spy Hunter races forward on its most thrilling and dangerous ride yet. The player once again takes on the role of the \"Agent,\" the driver of the high-tech G-6155On the eve of the franchise's 30th anniversary since the original Spy Hunter was released to arcades in 1983, the new Spy Hunter races forward on its most thrilling and dangerous ride yet. The player once again takes on the role of the \"Agent,\" the driver of the high-tech G-6155 Interceptor supercar, armed extensively with advanced weaponry, and ready to take on a global terrorist organization set on world domination. … Expand"}, {"name": "Pac-Man World Rally", "details_link": "https://www.metacritic.com/game/psp/pac-man-world-rally", "publisher": "Namco Bandai Games America", "release_date": "Aug 22 2006", "developers": ["Smart Bomb Interactive"], "platforms": ["PC", "PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Arcade", "Kart", "Other", "Kart", "Automobile"], "meta_score": 51, "users_score": 6.9, "image": "https://static.metacritic.com/images/products/games/9/939181057c42c0ca6d38afdadf753320-98.jpg", "descriptions": "In Pac Man World Rally, players can race through a variety of environments from Pac Man World as Pac Man, Pac Jr. and other characters from past Namco classics. Players kart race for the win or fight it out in colorful Battle Arenas with special weapons, power ups and variety Pac-Man powers.In Pac Man World Rally, players can race through a variety of environments from Pac Man World as Pac Man, Pac Jr. and other characters from past Namco classics. Players kart race for the win or fight it out in colorful Battle Arenas with special weapons, power ups and variety Pac-Man powers. The game also features the Prince of all Cosmos from the award-winning Katamari series as an unlockable character. Making a debut in his first kart racing game, the Prince can be unlocked by winning a Gold Trophy in all Circuit Cups within the EASY difficulty setting. [Namco Bandai]… Expand"}, {"name": "Looney Tunes: Back in Action", "details_link": "https://www.metacritic.com/game/playstation-2/looney-tunes-back-in-action", "publisher": "Electronic Arts", "release_date": "Nov 19 2003", "developers": ["Warthog"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action", "Platformer", "3D"], "meta_score": 51, "users_score": 7.6, "image": "https://static.metacritic.com/images/products/games/6/d0368d25e554fbc1e71fe22e52090eb2-98.jpg", "descriptions": "Looney Tunes Back In Action is a hilarious new adventure featuring everyone's favorite cartoon two-some, Bugs Bunny and Daffy Duck, in a globetrotting scavenger hunt to find the mythical Blue Monkey Diamond. From Hollywood to Las Vegas, from Paris to Africa, our roving heroes must run, jump,Looney Tunes Back In Action is a hilarious new adventure featuring everyone's favorite cartoon two-some, Bugs Bunny and Daffy Duck, in a globetrotting scavenger hunt to find the mythical Blue Monkey Diamond. From Hollywood to Las Vegas, from Paris to Africa, our roving heroes must run, jump, slide, and bounce their way through a heap of cartoon perils and put an end to the sinister plans of the evil ACME Corporation in an effort to save the world. [Electronic Arts]… Expand"}, {"name": "BANNERMEN", "details_link": "https://www.metacritic.com/game/pc/bannermen", "publisher": "Pathos Interactive", "release_date": "Feb 21 2019", "developers": ["Pathos Interactive"], "platforms": "PC", "num_players": "Online Multiplayer", "genres": ["Strategy", "Real-Time", "General"], "meta_score": 51, "users_score": 7.1, "image": "https://static.metacritic.com/images/products/games/7/4993c50b9d259f7281dc2a4c4a035d81-98.jpg", "descriptions": "Take on the role of a fallen lord on his journey back to become one of the mightiest in the realm. Make your banner strike fear into your opponents and challenge the multiplayer ladder in action packed skirmishes."}, {"name": "Stolen", "details_link": "https://www.metacritic.com/game/playstation-2/stolen", "publisher": "Hip Games", "release_date": "Apr 21 2005", "developers": ["Blue 52"], "platforms": "PlayStation 2", "num_players": "1 Player", "genres": ["Action Adventure", "Modern"], "meta_score": 51, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/1/8b2c455519cf31e204f4630570db8aae-98.jpg", "descriptions": "Stolen is an ultra realistic, third person, stealth-based, action game based around a high-tech female thief. Along with innovative high-tech stealth/robbery game actions and events, Stolen also boasts some truly amazing technical and presentational features to give it a spectacular lookStolen is an ultra realistic, third person, stealth-based, action game based around a high-tech female thief. Along with innovative high-tech stealth/robbery game actions and events, Stolen also boasts some truly amazing technical and presentational features to give it a spectacular look that will captivate gamers. Play the role of a Hollywood-style thief with a host of athletic and martial abilities. Break into and out of movie-like locations and steal priceless items. Use atmospheric real time volumetric shadow technology to hide from your enemies. [Hip Games]… Expand"}, {"name": "Family Guy", "details_link": "https://www.metacritic.com/game/psp/family-guy", "publisher": "2K Games", "release_date": "Oct 17 2006", "developers": ["High Voltage Software"], "platforms": ["PlayStation 2", "PSP"], "num_players": "No Online Multiplayer", "genres": ["Adventure", "General", "General", "3D", "Third-Person"], "meta_score": 51, "users_score": 6.2, "image": "https://static.metacritic.com/images/products/games/7/acae1122d4c7551a712faedfb607717c-98.jpg", "descriptions": "The first video game based on the hugely popular Family Guy TV show, the Family Guy game will feature the same outrageous humor all the fans know and love. Play through three stories that intersect in typical Family Guy fashion. Play as the loveable Peter, the diabolical Stewie and theThe first video game based on the hugely popular Family Guy TV show, the Family Guy game will feature the same outrageous humor all the fans know and love. Play through three stories that intersect in typical Family Guy fashion. Play as the loveable Peter, the diabolical Stewie and the charismatic Brian. Visit familiar locations around Quahog and interact with many beloved characters from the show. Funny and unique combination of combat, stealth and puzzle-solving gameplay. Take part in the jokes, parodies and sarcasm as though you were part of the show. [2K games]… Expand"}, {"name": "Indianapolis 500 Legends", "details_link": "https://www.metacritic.com/game/ds/indianapolis-500-legends", "publisher": "Destineer", "release_date": "Dec 19 2007", "developers": ["Torus Games"], "platforms": "DS", "genres": ["Driving", "Racing", "Simulation", "Formula One", "Formula One", "Automobile"], "meta_score": 51, "users_score": 0.0, "image": "https://static.metacritic.com/images/products/games/0/a127a145912db1b2a47aaf8fde10eb76-98.jpg", "descriptions": "In Indianapolis 500 Legends, players assume the roles of 30 of the sport’s most daring real-life legends like Al Unser, A.J. Foyt and Parnelli Jones as they draft, dodge and slingshot through a virtual minefield on a track where speeds of up to 180 miles per hour defined racing’s frontierIn Indianapolis 500 Legends, players assume the roles of 30 of the sport’s most daring real-life legends like Al Unser, A.J. Foyt and Parnelli Jones as they draft, dodge and slingshot through a virtual minefield on a track where speeds of up to 180 miles per hour defined racing’s frontier mentality. Experience crashes, upsets and thrills with mission-based racing that puts you in the middle of some of the Indy 500’s most famous and infamous moments. Drive the last of the front-engine roadsters; experiment with the first turbine cars or strap on the earliest sets of bolt-on wings. But buckle up - back then the rules were few, protection was a luxury and making it to the finish line was never guaranteed. [Destineer]… Expand"}, {"name": "Dino Crisis 3", "details_link": "https://www.metacritic.com/game/xbox/dino-crisis-3", "publisher": "Capcom", "release_date": "Sep 16 2003", "developers": ["Capcom"], "platforms": "Xbox", "num_players": "1 Player", "genres": ["Action Adventure", "Horror"], "meta_score": 51, "users_score": 3.8, "image": "https://static.metacritic.com/images/products/games/7/316638371f35314ec0192f76b317d1db-98.jpg", "descriptions": "More than 500 years in the future, you and your partners embark on a search-and-rescue mission to piece together a spacecraft's mysterious reappearance after a 300-year absence. Armed with hyperspeed booster units and an arsenal of futuristic weaponry, you'll confront ferocious spaceMore than 500 years in the future, you and your partners embark on a search-and-rescue mission to piece together a spacecraft's mysterious reappearance after a 300-year absence. Armed with hyperspeed booster units and an arsenal of futuristic weaponry, you'll confront ferocious space mutations and evolved forms of dinosaur creations. On this dynamically changing galactic ship, it's up to you to change the spaceship layout, collect objects, and solve puzzles to achieve your objectives.… Expand"}, {"name": "Dragon Blade: Wrath of Fire", "details_link": "https://www.metacritic.com/game/wii/dragon-blade-wrath-of-fire", "publisher": "D3Publisher", "release_date": "Sep 25 2007", "developers": ["D3Publisher"], "platforms": "Wii", "num_players": "1 Player", "genres": ["Action", "Beat-'Em-Up", "Beat-'Em-Up", "2D"], "meta_score": 51, "users_score": 7.2, "image": "https://static.metacritic.com/images/products/games/3/494024e2fe6355567a8569c89ee45d4c-98.jpg", "descriptions": "Designed specifically for the Wii system, Dragon Blade: Wrath of Fire is a 3rd person action-adventure game where players unleash the magical powers of a fierce dragon, creating a unique and visually stunning weapon through their sword and arms. Players utilize an intuitively designed,Designed specifically for the Wii system, Dragon Blade: Wrath of Fire is a 3rd person action-adventure game where players unleash the magical powers of a fierce dragon, creating a unique and visually stunning weapon through their sword and arms. Players utilize an intuitively designed, two-handed Wii control scheme and use both arms simultaneously to emulate the dragon’s arms, wings, tail, fire and more as they embark on an epic fantasy adventure in more than 20 unique environments in 6 visually stunning worlds. [D3Publisher of America]… Expand"}, {"name": "Disaster Report 4: Summer Memories", "details_link": "https://www.metacritic.com/game/playstation-4/disaster-report-4-summer-memories", "publisher": "NIS America", "release_date": "Apr  7 2020", "developers": ["Granzella Inc."], "platforms": ["PC", "Switch", "PlayStation 4"], "num_players": "No Online Multiplayer", "genres": ["Action Adventure", "General", "Survival"], "meta_score": 51, "users_score": 6.1, "image": "https://static.metacritic.com/images/products/games/9/1c12cb37f01d89095b99a3ee50c8ceb7-98.jpg", "descriptions": "Through the game, players can experience the fear brought on by an earthquake, and can learn that wisdom, bravery and people's bonding through mutual assistance are necessary for survival. Can players escape from the disaster?"}, {"name": "Rush'N Attack Ex-Patriot", "details_link": "https://www.metacritic.com/game/xbox-360/rushn-attack-ex-patriot", "publisher": "Konami", "release_date": "Mar 30 2011", "developers": ["Vatra"], "platforms": ["PlayStation 3", "Xbox 360"], "genres": ["Action", "Platformer", "Platformer", "2D", "2D"], "meta_score": 51, "users_score": 6.6, "image": "https://static.metacritic.com/images/products/games/3/25951643f2966381550d292c34a7a4f9-98.jpg", "descriptions": "In Rush'N Attack Ex-Patriot, a clandestine struggle exists between Russia and the United States for military intelligence during the shadows of the Cold War. Through three massive environments of a Siberian prison complex, a bio-weapons laboratory, and a nuclear weapons base players willIn Rush'N Attack Ex-Patriot, a clandestine struggle exists between Russia and the United States for military intelligence during the shadows of the Cold War. Through three massive environments of a Siberian prison complex, a bio-weapons laboratory, and a nuclear weapons base players will need to complete a variety of missions and survive encounters with elite Russian soldiers.… Expand"}, {"name": "Big Mutha Truckers 2", "details_link": "https://www.metacritic.com/game/playstation-2/big-mutha-truckers-2", "publisher": "THQ", "release_date": "Aug 23 2005", "developers": ["Eutechnyx"], "platforms": ["PC", "PlayStation 2"], "num_players": "1 Player", "genres": ["Driving", "Mission-based"], "meta_score": 51, "users_score": 2.5, "image": "https://static.metacritic.com/images/products/games/1/07870daaca1ce61d05ea05511f019079-98.jpg", "descriptions": "Big Mutha Truckers 2 begins with Ma Jackson being taken into police custody for tax evasion. The only way she can win her case is by hiring Cousin Jacob, the most \"fancy-talkin' legal fella\" this side of Booger's Canyon. Players will be challenged to raise the cash needed to bribe jurors toBig Mutha Truckers 2 begins with Ma Jackson being taken into police custody for tax evasion. The only way she can win her case is by hiring Cousin Jacob, the most \"fancy-talkin' legal fella\" this side of Booger's Canyon. Players will be challenged to raise the cash needed to bribe jurors to let Ma off by trucking, trading, wheeling and dealing. The go-anywhere, any-time philosophy that was utilized in the original Big Mutha Truckers is expanded in Big Mutha Truckers 2 with additional routes, hidden shortcuts, and the ability to drive numerous vehicles. Players have the freedom to deviate from their route and explore the highways and back roads to whichever city they decide to visit. In addition, the trading process is streamlined, with more focus on the on-road action. [THQ]… Expand"}, {"name": "Hail to the Chimp", "details_link": "https://www.metacritic.com/game/playstation-3/hail-to-the-chimp", "publisher": "Gamecock Media Group", "release_date": "Jun 30 2008", "developers": ["Wideload Games Inc."], "platforms": ["Xbox 360", "PlayStation 3"], "num_players": "Up to 4 ", "genres": ["Miscellaneous", "Party", "Party", "Party / Minigame"], "meta_score": 51, "users_score": 4.2, "image": "https://static.metacritic.com/images/products/games/2/97a776644bc3539af1a543e33d08c1fa-98.jpg", "descriptions": "Since the dawn of time, Man has wondered who would win if a polar bear and jellyfish teamed up to fight an armadillo and yak. Do you have what it takes (approximately $40) to learn the shocking truth? When the King of the Animals is forced to resign in disgrace, a motley group of candidatesSince the dawn of time, Man has wondered who would win if a polar bear and jellyfish teamed up to fight an armadillo and yak. Do you have what it takes (approximately $40) to learn the shocking truth? When the King of the Animals is forced to resign in disgrace, a motley group of candidates turns out for a bare-knuckle campaign to win the Crown. From Ptolemy, the mighty hippo, to Crackers, the devious monkey, each of the ten candidates has distinct strengths and strategies, but the same hunger for political power. Hail to the Chimp is a party game that delivers exciting gameplay, lush interactive environments, and a comic look at politics. Players use the game’s unique team-up mechanic, mixing cooperation with competition, to claw their way to victory. Whether played by four friends on one TV, online against distant challengers or single-player against advanced AI, Hail to the Chimp offers endlessly replayable party fun for gamers of all stripes. [Gamecock Media]… Expand"}, {"name": "Monster 4X4: World Circuit", "details_link": "https://www.metacritic.com/game/wii/monster-4x4-world-circuit", "publisher": "Ubisoft", "release_date": "Nov 19 2006", "developers": ["Ubisoft"], "platforms": "Wii", "num_players": "No Online Multiplayer", "genres": ["Driving", "Racing", "Simulation", "Rally / Offroad", "Rally / Offroad", "Automobile"], "meta_score": 51, "users_score": 7.7, "image": "https://static.metacritic.com/images/products/games/5/74c0e479a7b0cbfef06fb49681fb5670-98.jpg", "descriptions": "Use the Wii Remote to perform spectacular stunts, jump and race the most powerful Monster Trucks, and go head-to-head in pulse-pounding off-road competitions all over the world. . Whether you’re grinding through the desert of Egypt, crunching up snowy mountains in Russia, or smashing upUse the Wii Remote to perform spectacular stunts, jump and race the most powerful Monster Trucks, and go head-to-head in pulse-pounding off-road competitions all over the world. . Whether you’re grinding through the desert of Egypt, crunching up snowy mountains in Russia, or smashing up trees in California to make the ride a little bumpier for the guy behind you, keep your eyes on the prize: The cash you earn on the circuit goes to customize your trucks and build up your ultimate Monster machine. Personalize your truck’s appearance with sweet paint jobs and decals and soup up its performance by maxing out its speed, jumping and destruction capabilities. Win races, unleash spectacular stunts and jumps, and demolish everything in sight to win cash and upgrade your Monster truck to the ultimate stomping machine. Tear through 40 Monster events in the hairiest off-road circuits your tires have ever seen. Smoke the competition as you blaze through exciting new locations all over the world, such as Egypt, Moscow, Barcelona, San Francisco, South Dakota and more. Master your tricks in Quick Race mode as you taste all of the thrills, spills, twists and rolls of Monster Truck racing. [Ubisoft]… Expand"}]